{
  "url": "https://voxday.net/2011/11/26/its-all-fun-and-games/",
  "scraped_at": "2025-12-13T23:28:21.159600",
  "title": "It’s all fun and games",
  "date_display": "November 26, 2011",
  "date_iso": "2011-11-26T18:49:00+00:00",
  "date_from_url": "2011-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s all fun and games being a neocon, invading other countries, and spreading world democratic revolution, right up until the moment that someone accidentally <a href=\"http://news.yahoo.com/pakistan-24-troops-dead-nato-helicopter-attack-140517725.html\">pokes a nuclear power in the eye</a> with “collateral damage”.  If “well, we didn’t mean it” doesn’t work for kids, it’s probably not going to work for nations either:</p><blockquote><p>NATO helicopters and fighter jets attacked two military outposts in northwest Pakistan on Saturday, killing as many as 28 troops and plunging U.S.-Pakistan relations, already deeply frayed, further into crisis.</p><p>Pakistan retaliated by shutting down vital NATO supply routes into Afghanistan, used for sending in just under a third of the alliance’s supplies.</p></blockquote><p>Pakistan should cease all cooperation with the US military.  Why should they tolerate the US killing Pakistani soldiers in Pakistan any more than we would tolerate the Pakistani military killing American soldiers in the USA?</p></div>",
  "content_text": "It’s all fun and games being a neocon, invading other countries, and spreading world democratic revolution, right up until the moment that someone accidentally\npokes a nuclear power in the eye\nwith “collateral damage”.  If “well, we didn’t mean it” doesn’t work for kids, it’s probably not going to work for nations either:\nNATO helicopters and fighter jets attacked two military outposts in northwest Pakistan on Saturday, killing as many as 28 troops and plunging U.S.-Pakistan relations, already deeply frayed, further into crisis.\nPakistan retaliated by shutting down vital NATO supply routes into Afghanistan, used for sending in just under a third of the alliance’s supplies.\nPakistan should cease all cooperation with the US military.  Why should they tolerate the US killing Pakistani soldiers in Pakistan any more than we would tolerate the Pakistani military killing American soldiers in the USA?",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-26T18:49:00+00:00"
}