{
  "url": "https://voxday.net/2011/11/17/jane-galt-quits-markets/",
  "scraped_at": "2025-12-13T23:27:39.012693",
  "title": "Jane Galt quits the markets",
  "date_display": "November 17, 2011",
  "date_iso": "2011-11-17T20:00:00+00:00",
  "date_from_url": "2011-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Barnhardt Capital Management <a href=\"http://barnhardt.biz/\">shuts down</a>.  Ann Barnhardt explains her belief in “the inevitability of the collapse of the global financial markets, the overthrow of our government, and the resulting collapse in the rule of law.”</p><blockquote><p>Everything changed just a few short weeks ago. A firm, led by a crony of the Obama regime, stole all of the non-margined cash held by customers of his firm. Let’s not sugar-coat this or make this crime seem “complex” and “abstract” by drowning ourselves in six-dollar words and uber-technical jargon. Jon Corzine STOLE the customer cash at MF Global. Knowing Jon Corzine, and knowing the abject lawlessness and contempt for humanity of the Marxist Obama regime and its cronies, this is not really a surprise. What was a surprise was the reaction of the exchanges and regulators. Their reaction has been to take a bad situation and make it orders of magnitude worse. Specifically, they froze customers out of their accounts WHILE THE MARKETS CONTINUED TO TRADE, refusing to even allow them to liquidate. This is unfathomable. The risk exposure precedent that has been set is completely intolerable and has destroyed the entire industry paradigm. No informed person can continue to engage these markets, and no moral person can continue to broker or facilitate customer engagement in what is now a massive game of Russian Roulette.</p><p>I have learned over the last week that MF Global is almost certainly the mere tip of the iceberg. There is massive industry-wide exposure to European sovereign junk debt. While other firms may not be as heavily leveraged as Corzine had MFG leveraged, and it is now thought that MFG’s leverage may have been in excess of 100:1, they are still suicidally leveraged and will likely stand massive, unmeetable collateral calls in the coming days and weeks as Europe inevitably collapses. I now suspect that the reason the Chicago Mercantile Exchange did not immediately step in to backstop the MFG implosion was because they knew and know that if they backstopped MFG, they would then be expected to backstop all of the other firms in the system when the failures began to cascade – and there simply isn’t that much money in the entire system. In short, the problem is a SYSTEMIC problem, not merely isolated to one firm….</p><p>And so, to the very unpleasant crux of the matter. The futures and options markets are no longer viable. It is my recommendation that ALL customers withdraw from all of the markets as soon as possible so that they have the best chance of protecting themselves and their equity. The system is no longer functioning with integrity and is suicidally risk-laden. The rule of law is non-existent, instead replaced with godless, criminal political cronyism.</p></blockquote><p>Well, I tried to warn you that Wall Street was nothing but a casino anymore.  There is no more genuine investment or financing of capitalist activity on Wall Street than there is in Las Vegas.  It’s nothing more than borrowing – or stealing – money to place it on red… then scream for government bailouts when you lose.</p><p>The interesting question, which no one has even begun to answer, is how many other capital management firms have been gambling with their clients’ money.  And how many have lost it all.  I assure you, there is no chance Corzine’s MF Global was the only one.</p><p> UPDATE: it looks like the eurocontagion may be getting out of control <a href=\"http://market-ticker.org/akcs-www?post=197706\">rather quickly</a>.  This may be why Mervyn King of the Bank of England went public with his concerns about a credit crunch. <i>The London Stock Exchange is becoming the lender of last resort for many banks in Italy as concerns over the country’s debt levels squeeze liquidity out of the Italian financial market.  With cash increasingly hard to come by, Italy’s banks are turning to CC&amp;G, the L.S.E’s Italian clearinghouse, for short-term lending. That includes some of the country’s largest financial institutions, including Unicredit and Mediobanca, according to a person close to the situation.</i></p></div>",
  "content_text": "Barnhardt Capital Management\nshuts down\n.  Ann Barnhardt explains her belief in “the inevitability of the collapse of the global financial markets, the overthrow of our government, and the resulting collapse in the rule of law.”\nEverything changed just a few short weeks ago. A firm, led by a crony of the Obama regime, stole all of the non-margined cash held by customers of his firm. Let’s not sugar-coat this or make this crime seem “complex” and “abstract” by drowning ourselves in six-dollar words and uber-technical jargon. Jon Corzine STOLE the customer cash at MF Global. Knowing Jon Corzine, and knowing the abject lawlessness and contempt for humanity of the Marxist Obama regime and its cronies, this is not really a surprise. What was a surprise was the reaction of the exchanges and regulators. Their reaction has been to take a bad situation and make it orders of magnitude worse. Specifically, they froze customers out of their accounts WHILE THE MARKETS CONTINUED TO TRADE, refusing to even allow them to liquidate. This is unfathomable. The risk exposure precedent that has been set is completely intolerable and has destroyed the entire industry paradigm. No informed person can continue to engage these markets, and no moral person can continue to broker or facilitate customer engagement in what is now a massive game of Russian Roulette.\nI have learned over the last week that MF Global is almost certainly the mere tip of the iceberg. There is massive industry-wide exposure to European sovereign junk debt. While other firms may not be as heavily leveraged as Corzine had MFG leveraged, and it is now thought that MFG’s leverage may have been in excess of 100:1, they are still suicidally leveraged and will likely stand massive, unmeetable collateral calls in the coming days and weeks as Europe inevitably collapses. I now suspect that the reason the Chicago Mercantile Exchange did not immediately step in to backstop the MFG implosion was because they knew and know that if they backstopped MFG, they would then be expected to backstop all of the other firms in the system when the failures began to cascade – and there simply isn’t that much money in the entire system. In short, the problem is a SYSTEMIC problem, not merely isolated to one firm….\nAnd so, to the very unpleasant crux of the matter. The futures and options markets are no longer viable. It is my recommendation that ALL customers withdraw from all of the markets as soon as possible so that they have the best chance of protecting themselves and their equity. The system is no longer functioning with integrity and is suicidally risk-laden. The rule of law is non-existent, instead replaced with godless, criminal political cronyism.\nWell, I tried to warn you that Wall Street was nothing but a casino anymore.  There is no more genuine investment or financing of capitalist activity on Wall Street than there is in Las Vegas.  It’s nothing more than borrowing – or stealing – money to place it on red… then scream for government bailouts when you lose.\nThe interesting question, which no one has even begun to answer, is how many other capital management firms have been gambling with their clients’ money.  And how many have lost it all.  I assure you, there is no chance Corzine’s MF Global was the only one.\nUPDATE: it looks like the eurocontagion may be getting out of control\nrather quickly\n.  This may be why Mervyn King of the Bank of England went public with his concerns about a credit crunch.\nThe London Stock Exchange is becoming the lender of last resort for many banks in Italy as concerns over the country’s debt levels squeeze liquidity out of the Italian financial market.  With cash increasingly hard to come by, Italy’s banks are turning to CC&G, the L.S.E’s Italian clearinghouse, for short-term lending. That includes some of the country’s largest financial institutions, including Unicredit and Mediobanca, according to a person close to the situation.",
  "tags": [
    "banks",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-17T20:00:00+00:00"
}