{
  "url": "https://voxday.net/2011/11/10/joe-is-no-hero/",
  "scraped_at": "2025-12-13T23:26:56.984052",
  "title": "Joe Paterno is no hero",
  "date_display": "November 10, 2011",
  "date_iso": "2011-11-10T14:00:00+00:00",
  "date_from_url": "2011-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>On the other hand, he’s not a criminal either.  It’s a sad ending to an epic career, but in the end, Joe Paterno definitely had to go.  Now.  The truly problematic thing isn’t that he only fulfilled his legal obligations in 2002 when a homosexual pedophile was raping boys in the Penn State football facilities, but that he didn’t demand an investigation of Sandusky back in 1998 when the police, the local media, and the Penn State administration all knew about his criminal proclivities.  If you read between the lines of the former defensive coordinator’s retirement after the 1999 Alamo Bowl, it is clear that the Penn State hierarchy, including Paterno, knew there was something seriously wrong with Sandusky’s behavior.  Regardless of who should have done what after the man was seen raping the boy in 2002, Sandusky should never have been in a position to do anything of the sort in the first place, given what was clearly already known about him.</p><p>However, I think it is incorrect to seriously condemn either Paterno or McQueary for failing to run to the police.  They both did exactly what they were supposed to do, exactly what the law required them to do.  Saying that they should have run to the police doesn’t even make any sense; the police are not some sort of magic panacea in this situation for the obvious reason that Penn State has <a href=\"http://www.police.psu.edu/aboutus/\">its own police force</a>.  In a university town like Penn State, going to the university administration is going to the police.  It’s rather like complaining someone reported a crime to the DA rather than the receptionist at the police station.</p><p>Now, should Paterno and McQueary have spoken out afterwards given the failure of the administration to do anything?  Yes, I believe so.  But a failure to do the optimal thing is not synonymous with doing the wrong thing.  To compare them, as some have, to Sandusky himself, or even to the administrators responsible for taking action, is both unfair and incorrect.  It would have been heroic for either man to speak out and confront both Sandusky and the Penn State administration, but the reality is that most men are not cut out for such heroism.  However, Paterno’s fame, combined with his willingness to take on the university administration in his own interest – they wanted him to retire years ago – versus his unwillingness to do so on behalf of the boys being raped by his former assistant, is an indelible stain on both his reputation and his moral character.</p><p>I think it is totally irrelevant that Paterno didn’t go to the campus police because I see no reason to believe they would have investigated the manner any more seriously, or been less inclined to cover up the matter, than the Penn State administration.  They report to the administration after all, and more importantly, <i>they already knew about Sandusky</i>.  From CFT: “An extensive police report exists from as far back as 1998, documenting Sandusky inappropriately touching a young boy.”  Moreover, consider the way police forces around the country cover up most of the crime, including rape, that occurs on college campuses.  Still, if Paterno shouldn’t have gone to the Penn State police, he absolutely should have gone public and spoken to the media after it became clear that the university administration intended to sweep Sandusky under the carpet as they and the police had done previously.  Paterno should have threatened to resign then, but failing that, he should have resigned immediately once the media storm began.  In fact, I have some serious questions about this story erupting so soon after Paterno broke the all-time coaching wins record, as it appears someone with links to Penn State was waiting until that happened before going public about Sandusky.  There will be more nasty revelations coming, that is almost guaranteed.</p><p>However, don’t kid yourself into thinking that the gay rape scandal at Penn State is the least bit unusual.  Most, not many, but most, such offenses are swept under the table by organizations from the Roman Catholic Church to your local high school.  The sub-optimal, self-interested behavior of men like McQueary and Paterno is the norm.  And the police forces of the USA have swept far more wrongdoing under the carpet than most people would like to believe.  There are very, very few individuals who are willing to risk their jobs and reputations when the organization decides to handle a crime of this sort “internally”.</p><p>I’m not saying this to defend Paterno or McQueary.  If it is still deemed appropriate to fire men and women from their jobs for moral failings, then they should certainly be fired.  However, I am not sure that this is presently the case in the modern USA, given that one cannot deny employment to a homosexual, an adulterer, or a murderer of unborn children for their proven moral failings.  Regardless, it is wildly naive to pretend that most people would have behaved much differently when faced with that situation.  Some would, but most demonstrably would not.  If heroism and strong moral character are necessary aspects of retaining one’s job, the unemployment rate will soon be well north of 75 percent.</p><p>UPDATE – My suspicions were correct. <i>“The VP who heard the grad assistant’s claim was in charge of the campus police. He did nothing. Paterno got the witness to the head of the campus law enforcement agency who was supposed to know that a crime was being reported to him.”</i> In other words, Paterno did tell the police, who then did nothing.</p><p>UPDATE II – And the next phase of the scandal looks as if it will go well beyond <a href=\"http://rivals.yahoo.com/ncaa/football/news?slug=ycn-10407023\">the university’s football program</a>:<br> <i>“Madden stated that two “prominent columnists” are currently investigating a rumor that Jerry Sandusky’s Second Mile Foundation, a non-profit organization aimed to serve underprivileged youths, was “pimping out young boys to rich (Penn State) donors.” Madden went on to say that Jerry Sandusky was told by those running the show at Penn State football that Sandusky had to retire after allegations made in 1998 that the defensive coordinator was guilty of “improper conduct with an underage male.” Sandusky, thought by some to be Joe Paterno’s successor at the time, abruptly and somewhat shockingly retired from coaching in 1999.  It actually gets worse. Madden went on to say “When Sandusky quit, everybody knew; not just at Penn State. It was a very poorly kept secret around college football, in general. That is why he never coached in college football again and retired at the relatively young age of 55, young for a coach.””</i></br></p><p>This scandal is going to end up being about a lot more than one record-setting football coach.  And don’t imagine that Penn State is the only place where the gay mafia is doing this sort of thing; homosexual pedophiles are more than 14 times more likely to be caught abusing boys than heterosexual pedophiles are caught abusing girls.  Watch for the predictable and nonsensical attempts to claim that men who like to rape boys are not homosexual.</p></div>",
  "content_text": "On the other hand, he’s not a criminal either.  It’s a sad ending to an epic career, but in the end, Joe Paterno definitely had to go.  Now.  The truly problematic thing isn’t that he only fulfilled his legal obligations in 2002 when a homosexual pedophile was raping boys in the Penn State football facilities, but that he didn’t demand an investigation of Sandusky back in 1998 when the police, the local media, and the Penn State administration all knew about his criminal proclivities.  If you read between the lines of the former defensive coordinator’s retirement after the 1999 Alamo Bowl, it is clear that the Penn State hierarchy, including Paterno, knew there was something seriously wrong with Sandusky’s behavior.  Regardless of who should have done what after the man was seen raping the boy in 2002, Sandusky should never have been in a position to do anything of the sort in the first place, given what was clearly already known about him.\nHowever, I think it is incorrect to seriously condemn either Paterno or McQueary for failing to run to the police.  They both did exactly what they were supposed to do, exactly what the law required them to do.  Saying that they should have run to the police doesn’t even make any sense; the police are not some sort of magic panacea in this situation for the obvious reason that Penn State has\nits own police force\n.  In a university town like Penn State, going to the university administration is going to the police.  It’s rather like complaining someone reported a crime to the DA rather than the receptionist at the police station.\nNow, should Paterno and McQueary have spoken out afterwards given the failure of the administration to do anything?  Yes, I believe so.  But a failure to do the optimal thing is not synonymous with doing the wrong thing.  To compare them, as some have, to Sandusky himself, or even to the administrators responsible for taking action, is both unfair and incorrect.  It would have been heroic for either man to speak out and confront both Sandusky and the Penn State administration, but the reality is that most men are not cut out for such heroism.  However, Paterno’s fame, combined with his willingness to take on the university administration in his own interest – they wanted him to retire years ago – versus his unwillingness to do so on behalf of the boys being raped by his former assistant, is an indelible stain on both his reputation and his moral character.\nI think it is totally irrelevant that Paterno didn’t go to the campus police because I see no reason to believe they would have investigated the manner any more seriously, or been less inclined to cover up the matter, than the Penn State administration.  They report to the administration after all, and more importantly,\nthey already knew about Sandusky\n.  From CFT: “An extensive police report exists from as far back as 1998, documenting Sandusky inappropriately touching a young boy.”  Moreover, consider the way police forces around the country cover up most of the crime, including rape, that occurs on college campuses.  Still, if Paterno shouldn’t have gone to the Penn State police, he absolutely should have gone public and spoken to the media after it became clear that the university administration intended to sweep Sandusky under the carpet as they and the police had done previously.  Paterno should have threatened to resign then, but failing that, he should have resigned immediately once the media storm began.  In fact, I have some serious questions about this story erupting so soon after Paterno broke the all-time coaching wins record, as it appears someone with links to Penn State was waiting until that happened before going public about Sandusky.  There will be more nasty revelations coming, that is almost guaranteed.\nHowever, don’t kid yourself into thinking that the gay rape scandal at Penn State is the least bit unusual.  Most, not many, but most, such offenses are swept under the table by organizations from the Roman Catholic Church to your local high school.  The sub-optimal, self-interested behavior of men like McQueary and Paterno is the norm.  And the police forces of the USA have swept far more wrongdoing under the carpet than most people would like to believe.  There are very, very few individuals who are willing to risk their jobs and reputations when the organization decides to handle a crime of this sort “internally”.\nI’m not saying this to defend Paterno or McQueary.  If it is still deemed appropriate to fire men and women from their jobs for moral failings, then they should certainly be fired.  However, I am not sure that this is presently the case in the modern USA, given that one cannot deny employment to a homosexual, an adulterer, or a murderer of unborn children for their proven moral failings.  Regardless, it is wildly naive to pretend that most people would have behaved much differently when faced with that situation.  Some would, but most demonstrably would not.  If heroism and strong moral character are necessary aspects of retaining one’s job, the unemployment rate will soon be well north of 75 percent.\nUPDATE – My suspicions were correct.\n“The VP who heard the grad assistant’s claim was in charge of the campus police. He did nothing. Paterno got the witness to the head of the campus law enforcement agency who was supposed to know that a crime was being reported to him.”\nIn other words, Paterno did tell the police, who then did nothing.\nUPDATE II – And the next phase of the scandal looks as if it will go well beyond\nthe university’s football program\n:\n“Madden stated that two “prominent columnists” are currently investigating a rumor that Jerry Sandusky’s Second Mile Foundation, a non-profit organization aimed to serve underprivileged youths, was “pimping out young boys to rich (Penn State) donors.” Madden went on to say that Jerry Sandusky was told by those running the show at Penn State football that Sandusky had to retire after allegations made in 1998 that the defensive coordinator was guilty of “improper conduct with an underage male.” Sandusky, thought by some to be Joe Paterno’s successor at the time, abruptly and somewhat shockingly retired from coaching in 1999.  It actually gets worse. Madden went on to say “When Sandusky quit, everybody knew; not just at Penn State. It was a very poorly kept secret around college football, in general. That is why he never coached in college football again and retired at the relatively young age of 55, young for a coach.””\nThis scandal is going to end up being about a lot more than one record-setting football coach.  And don’t imagine that Penn State is the only place where the gay mafia is doing this sort of thing; homosexual pedophiles are more than 14 times more likely to be caught abusing boys than heterosexual pedophiles are caught abusing girls.  Watch for the predictable and nonsensical attempts to claim that men who like to rape boys are not homosexual.",
  "tags": [
    "sports",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-10T14:00:00+00:00"
}