{
  "url": "https://voxday.net/2011/11/19/keeny-is-very-technical-boy/",
  "scraped_at": "2025-12-13T23:27:48.158564",
  "title": "Keeny is a very technical boy",
  "date_display": "November 19, 2011",
  "date_iso": "2011-11-19T15:37:00+00:00",
  "date_from_url": "2011-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been reading the second edition of <i>Debunking Economics</i> by Steve Keen and I’ve been reading it very slowly and carefully because it appears to be one of two things.  If his criticisms are generally correct but his proposed alternatives are generally incorrect, (which is what I would presently conclude on the basis of a still-incomplete reading, but I am reserving judgment for now) this is the most important book on economics since Paul Samuelson’s 1948 textbook.</p><p>If, on the other hand, he is generally correct across the board, it is the most important book on economics since Adam Smith wrote <i>The Wealth of Nations</i>.  Either way, it does to neoclassical economics what Mises and Hayek together did to socialist economics.  It’s not a critique, and to call it a deconstruction would completely fail to do it justice.  It’s a one-man gang bang.  In prison.</p><p>On the casual level, my first impression was “Damn, I was right!  I knew I was smarter than all those clueless PhDs babbling nonsensically about equilibrium and rational consumers with perfect information.”  And my second impression was “Damn, I didn’t know the half of it.  Keen is a freaking genius!”  Needless to say, I will be writing a very detailed review/critique of it in a month or two.  In the meantime, it’s highly recommended for those who grokked RGD and want to go deeper.  There is a surprising amount of synchronicity between <i>Debunking Economics</i> and <i>The Return of the Great Depression</i> even though he is a professional academic coming from a left-wing perspective and I am an amateur</p><p>And just for the record… I should mention that Dirk Bezemer told me he probably would have included me with Keen, Baker, Shiller and the others on the famous list of the Bezemer 12 who saw the 2008 crisis coming had he known about my predictions prior to assembling it.  But I’m hardly the only one; Investor Home has expanded the list to 45, including Ron Paul, Nassim Talib, and rather less credibly, Paul Krugman.  I can’t say I’m terribly surprised to learn Dutch academics aren’t regular readers of the WND commentary page, but it is really a pathetic commentary on the state of economics to note that less than 50 people, out of all the various academics, analysts, and financial media talkers, managed to notice the global debt tsunami.</p><p>What is fantastic about Keen’s book is he explains, in great detail, exactly why nearly all academic and professional economists didn’t see it coming in 2008 and still don’t see it coming now.  They literally cannot see anything of the sort due to their theoretical blinders.</p></div>",
  "content_text": "I’ve been reading the second edition of\nDebunking Economics\nby Steve Keen and I’ve been reading it very slowly and carefully because it appears to be one of two things.  If his criticisms are generally correct but his proposed alternatives are generally incorrect, (which is what I would presently conclude on the basis of a still-incomplete reading, but I am reserving judgment for now) this is the most important book on economics since Paul Samuelson’s 1948 textbook.\nIf, on the other hand, he is generally correct across the board, it is the most important book on economics since Adam Smith wrote\nThe Wealth of Nations\n.  Either way, it does to neoclassical economics what Mises and Hayek together did to socialist economics.  It’s not a critique, and to call it a deconstruction would completely fail to do it justice.  It’s a one-man gang bang.  In prison.\nOn the casual level, my first impression was “Damn, I was right!  I knew I was smarter than all those clueless PhDs babbling nonsensically about equilibrium and rational consumers with perfect information.”  And my second impression was “Damn, I didn’t know the half of it.  Keen is a freaking genius!”  Needless to say, I will be writing a very detailed review/critique of it in a month or two.  In the meantime, it’s highly recommended for those who grokked RGD and want to go deeper.  There is a surprising amount of synchronicity between\nDebunking Economics\nand\nThe Return of the Great Depression\neven though he is a professional academic coming from a left-wing perspective and I am an amateur\nAnd just for the record… I should mention that Dirk Bezemer told me he probably would have included me with Keen, Baker, Shiller and the others on the famous list of the Bezemer 12 who saw the 2008 crisis coming had he known about my predictions prior to assembling it.  But I’m hardly the only one; Investor Home has expanded the list to 45, including Ron Paul, Nassim Talib, and rather less credibly, Paul Krugman.  I can’t say I’m terribly surprised to learn Dutch academics aren’t regular readers of the WND commentary page, but it is really a pathetic commentary on the state of economics to note that less than 50 people, out of all the various academics, analysts, and financial media talkers, managed to notice the global debt tsunami.\nWhat is fantastic about Keen’s book is he explains, in great detail, exactly why nearly all academic and professional economists didn’t see it coming in 2008 and still don’t see it coming now.  They literally cannot see anything of the sort due to their theoretical blinders.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-19T15:37:00+00:00"
}