{
  "url": "https://voxday.net/2011/11/06/mailvox-what-am-i-missing-here/",
  "scraped_at": "2025-12-13T23:26:36.836003",
  "title": "Mailvox: what am I missing here?",
  "date_display": "November 6, 2011",
  "date_iso": "2011-11-06T08:49:00+00:00",
  "date_from_url": "2011-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of interlocutors, one of my occasional atheist emailers sent this in response to yesterday’s Mailvox.  MD wrote:</p><blockquote><p><i>‘ . . . the moment they decide to attempt to convince others that they are correct, they become targets.’</i></p><p>Never has there been a greater endorsement of the ‘new atheist’ movement than that last sentence!  You’re cleverer than saying weak stuff like that.</p></blockquote><p>I genuinely do not understand the point he is making here.  The idea would appear to be that the New Atheism has made targets of Christians and other evangelical theists because they are incorrect.  But I don’t see that this is the observable case at all.  It seems to me if that X is attempting to convince others he is correct and Y decides to make X a target in response, the onus is therefore on Y <i>to show that X is incorrect</i>.</p><p>So, where do Richard Dawkins, Sam Harris, or any of the New Atheists ever attempt to show that Billy Graham or John Wesley or Thomas Aquinas are incorrect?  They very seldom attack anything that is even remotely recognizable as Christian theology, preferring instead to take on what appear to be poorly remembered Sunday School versions of it.  The Courtier’s Reply of PZ Myers – which, to be fair, other New Atheists besides Richard Dawkins cannot be assumed to endorse – outright attempts to justify atheists knowing nothing about what they are so ineptly criticizing.</p><p>I even remarked on this bizarre failure to actually address the most basic Christian theology in TIA: <i>“While Harris doesn’t once cite minor Christian intellectual figures such as Tertullian, Ambrose, Jerome, Gregory the Great, Thomas Aquinas, John Calvin, John Wesley, G. K. Chesterton, or even C. S. Lewis, he does find it relevant to provide one reference to Tim LaHaye, thirteen references to Hitler, Himmler, and Hess, and six whole pages dedicated to Noam Chomsky.  Because, after all, no one is more suited to explain the Christian faith quite so well as an elderly author of pop religious fantasies, a trio of dead Nazis, and a left-wing Jewish linguist.”</i></p><p>Now Dawkins does mention Aquinas and the Five Proofs in <i>The God Delusion</i>, but he does little more than cry “infinite regress” and demonstrate that he has missed the point of them.  (I did like his point about the natural terminator, although it doesn’t actually serve to refute any of the Five Proofs since they concern beginnings rather than ends.)  He also shows that he has never actually read the <i>Summa Theologica</i>; it is telling to note that Dawkins immediately proceeds from his cursory glance at the Five Proofs to the Ontological Argument without realizing that Aquinas rejected it more than 700 years ago in <a href=\"http://www.ccel.org/ccel/aquinas/summa.FP_Q2_A1.html\">Part 1, Question 2, Article 1</a> of the <i>Summa</i>.</p><p><i>“OBJECTION 2: Further, those things are said to be self-evident which are known as soon as the terms are known, which the Philosopher (1 Poster. iii) says is true of the first principles of demonstration. Thus, when the nature of a whole and of a part is known, it is at once recognized that every whole is greater than its part. But as soon as the signification of the word “God” is understood, it is at once seen that God exists. For by this word is signified that thing than which nothing greater can be conceived. But that which exists actually and mentally is greater than that which exists only mentally. Therefore, since as soon as the word “God” is understood it exists mentally, it also follows that it exists actually. Therefore the proposition “God exists” is self-evident.</i></p><p>REPLY TO OBJECTION 2: Perhaps not everyone who hears this word “God” understands it to signify something than which nothing greater can be thought, seeing that some have believed God to be a body. Yet, granted that everyone understands that by this word “God” is signified something than which nothing greater can be thought, nevertheless, it does not therefore follow that he understands that what the word signifies exists actually, but only that it exists mentally. Nor can it be argued that it actually exists, unless it be admitted that there actually exists something than which nothing greater can be thought; and this precisely is not admitted by those who hold that God does not exist.”</p><p>So, it seems to me that far from being the greatest endorsement of the New Atheist movement, my statement demonstrates its impotence, its ignorance, and its intellectual dishonesty.</p></div>",
  "content_text": "Speaking of interlocutors, one of my occasional atheist emailers sent this in response to yesterday’s Mailvox.  MD wrote:\n‘ . . . the moment they decide to attempt to convince others that they are correct, they become targets.’\nNever has there been a greater endorsement of the ‘new atheist’ movement than that last sentence!  You’re cleverer than saying weak stuff like that.\nI genuinely do not understand the point he is making here.  The idea would appear to be that the New Atheism has made targets of Christians and other evangelical theists because they are incorrect.  But I don’t see that this is the observable case at all.  It seems to me if that X is attempting to convince others he is correct and Y decides to make X a target in response, the onus is therefore on Y\nto show that X is incorrect\n.\nSo, where do Richard Dawkins, Sam Harris, or any of the New Atheists ever attempt to show that Billy Graham or John Wesley or Thomas Aquinas are incorrect?  They very seldom attack anything that is even remotely recognizable as Christian theology, preferring instead to take on what appear to be poorly remembered Sunday School versions of it.  The Courtier’s Reply of PZ Myers – which, to be fair, other New Atheists besides Richard Dawkins cannot be assumed to endorse – outright attempts to justify atheists knowing nothing about what they are so ineptly criticizing.\nI even remarked on this bizarre failure to actually address the most basic Christian theology in TIA:\n“While Harris doesn’t once cite minor Christian intellectual figures such as Tertullian, Ambrose, Jerome, Gregory the Great, Thomas Aquinas, John Calvin, John Wesley, G. K. Chesterton, or even C. S. Lewis, he does find it relevant to provide one reference to Tim LaHaye, thirteen references to Hitler, Himmler, and Hess, and six whole pages dedicated to Noam Chomsky.  Because, after all, no one is more suited to explain the Christian faith quite so well as an elderly author of pop religious fantasies, a trio of dead Nazis, and a left-wing Jewish linguist.”\nNow Dawkins does mention Aquinas and the Five Proofs in\nThe God Delusion\n, but he does little more than cry “infinite regress” and demonstrate that he has missed the point of them.  (I did like his point about the natural terminator, although it doesn’t actually serve to refute any of the Five Proofs since they concern beginnings rather than ends.)  He also shows that he has never actually read the\nSumma Theologica\n; it is telling to note that Dawkins immediately proceeds from his cursory glance at the Five Proofs to the Ontological Argument without realizing that Aquinas rejected it more than 700 years ago in\nPart 1, Question 2, Article 1\nof the\nSumma\n.\n“OBJECTION 2: Further, those things are said to be self-evident which are known as soon as the terms are known, which the Philosopher (1 Poster. iii) says is true of the first principles of demonstration. Thus, when the nature of a whole and of a part is known, it is at once recognized that every whole is greater than its part. But as soon as the signification of the word “God” is understood, it is at once seen that God exists. For by this word is signified that thing than which nothing greater can be conceived. But that which exists actually and mentally is greater than that which exists only mentally. Therefore, since as soon as the word “God” is understood it exists mentally, it also follows that it exists actually. Therefore the proposition “God exists” is self-evident.\nREPLY TO OBJECTION 2: Perhaps not everyone who hears this word “God” understands it to signify something than which nothing greater can be thought, seeing that some have believed God to be a body. Yet, granted that everyone understands that by this word “God” is signified something than which nothing greater can be thought, nevertheless, it does not therefore follow that he understands that what the word signifies exists actually, but only that it exists mentally. Nor can it be argued that it actually exists, unless it be admitted that there actually exists something than which nothing greater can be thought; and this precisely is not admitted by those who hold that God does not exist.”\nSo, it seems to me that far from being the greatest endorsement of the New Atheist movement, my statement demonstrates its impotence, its ignorance, and its intellectual dishonesty.",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-06T08:49:00+00:00"
}