{
  "url": "https://voxday.net/2011/11/15/mailvox-search-for-science-based-fai/",
  "scraped_at": "2025-12-13T23:27:24.352661",
  "title": "Mailvox: the search for science-based faith",
  "date_display": "November 15, 2011",
  "date_iso": "2011-11-15T11:22:00+00:00",
  "date_from_url": "2011-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure AD can find what he is looking for, mostly because I don’t believe it exists or even can exist:</p><blockquote><p>Thank you for your blog. I started reading it through WND then over the last several months have learned a lot about being a beta.  I was raised in Christian churches and accepted Christ at an early age but looking back I was playing church. After [many] years of a rocky marriage my wife filed for divorce. We hadn’t attended church in about 14 years and I decided to go to a local congregation.</p><p>For the first time I’m actually going because I want to learn about having a better Christian walk. The trouble I’m having is I want to know what I’m talking about when I talk to someone, (e.g., ex-wife) about Christ and the Bible. I am no Bible scholar and I only have basic answers to her talking about discrepancies in the gospels and the story of a virgin birth savior being included in other religions.</p><p>I believe God’s word should stand up to legitimate scientific scrutiny but I can’t say, “well, it is a fact that this or that original text confirms what the modern Bible translations say.” I really want to know what I’m talking about.</p><p>Are you able to direct me to sources so I can start to really know I’m basing my faith on a sound foundation? Maybe I’m not showing faith by asking this question but I think I need to know for me.</p></blockquote><p>This is somewhat outside my area of knowledge, as common misconceptions about TIA to the contrary, I don’t get into apologetics, particularly science-flavored ones.  So, it might behoove me to step back and allow the scientists here, particularly Stickwick and the other physicists, to provide any recommended reading.  I’ve never paid much attention to the present state of the scientific consensus or considered it to be any sort of truth metric because I am old enough to recall it having been the precise opposite of what it is today in many different areas.  No one who recalls the butter-margarine consensuses, the global ice age-global warming consensuses, the steady state-Big Bang consensuses, or the low fat-low carbs consensuses is likely to be overly concerned about what scientists happen to be asserting is absolute truth today.  Give them a few years and there is a reasonable chance they’ll be saying something very different, if not the exact opposite.  Never forget that scientists do not study history and very few of them even know anything about the history of science.</p><p>That being said, Patrick Glynn’s <i>God: The Evidence: The Reconciliation of Faith and Reason in a Postsecular World</i>, wouldn’t be a bad start.  It’s nothing I would consider conclusive, but it will disabuse you of the notion that you cannot balance your faith in science with your faith in God.</p><p>But a word of warning.  It is not so much indicative of a lack of faith to seek a sound scientific foundation for one’s religious faith as it is evidence of flawed <i>reason</i>.  As I have demonstrated on numerous occasions in the past, science is not a reliable basis for one’s faith in <i>anything</i>, religious or otherwise, due to its dynamic nature and its intrinsic reliance on human honesty.  It is engineering that is truly reliable by virtue of its much more stringent system of material verification of truth claims; only when science has been transformed into engineering can it be considered more or less reliable, and even then, it can be less than perfectly accurate.</p><p>Note that at the moment, after decades of “scientific certainty”, science is attempting to ascertain if supra-luminal speeds are possible.  The idea science is capable of being used as any position at all on the supernatural beyond the purely philosophical not only defies reason, but history and scientific history as well.</p><p>And if religion got things as reliably wrong as science does, no one would believe in it.  When science fetishists complain that religion claims absolute truth, they are projecting.  It is religion’s room for and acceptance of doubt that accounts for its persistence; it is science’s false pretensions to being the final word on truth that explain why the world has become increasingly skeptical of science and scientists.</p></div>",
  "content_text": "I’m not sure AD can find what he is looking for, mostly because I don’t believe it exists or even can exist:\nThank you for your blog. I started reading it through WND then over the last several months have learned a lot about being a beta.  I was raised in Christian churches and accepted Christ at an early age but looking back I was playing church. After [many] years of a rocky marriage my wife filed for divorce. We hadn’t attended church in about 14 years and I decided to go to a local congregation.\nFor the first time I’m actually going because I want to learn about having a better Christian walk. The trouble I’m having is I want to know what I’m talking about when I talk to someone, (e.g., ex-wife) about Christ and the Bible. I am no Bible scholar and I only have basic answers to her talking about discrepancies in the gospels and the story of a virgin birth savior being included in other religions.\nI believe God’s word should stand up to legitimate scientific scrutiny but I can’t say, “well, it is a fact that this or that original text confirms what the modern Bible translations say.” I really want to know what I’m talking about.\nAre you able to direct me to sources so I can start to really know I’m basing my faith on a sound foundation? Maybe I’m not showing faith by asking this question but I think I need to know for me.\nThis is somewhat outside my area of knowledge, as common misconceptions about TIA to the contrary, I don’t get into apologetics, particularly science-flavored ones.  So, it might behoove me to step back and allow the scientists here, particularly Stickwick and the other physicists, to provide any recommended reading.  I’ve never paid much attention to the present state of the scientific consensus or considered it to be any sort of truth metric because I am old enough to recall it having been the precise opposite of what it is today in many different areas.  No one who recalls the butter-margarine consensuses, the global ice age-global warming consensuses, the steady state-Big Bang consensuses, or the low fat-low carbs consensuses is likely to be overly concerned about what scientists happen to be asserting is absolute truth today.  Give them a few years and there is a reasonable chance they’ll be saying something very different, if not the exact opposite.  Never forget that scientists do not study history and very few of them even know anything about the history of science.\nThat being said, Patrick Glynn’s\nGod: The Evidence: The Reconciliation of Faith and Reason in a Postsecular World\n, wouldn’t be a bad start.  It’s nothing I would consider conclusive, but it will disabuse you of the notion that you cannot balance your faith in science with your faith in God.\nBut a word of warning.  It is not so much indicative of a lack of faith to seek a sound scientific foundation for one’s religious faith as it is evidence of flawed\nreason\n.  As I have demonstrated on numerous occasions in the past, science is not a reliable basis for one’s faith in\nanything\n, religious or otherwise, due to its dynamic nature and its intrinsic reliance on human honesty.  It is engineering that is truly reliable by virtue of its much more stringent system of material verification of truth claims; only when science has been transformed into engineering can it be considered more or less reliable, and even then, it can be less than perfectly accurate.\nNote that at the moment, after decades of “scientific certainty”, science is attempting to ascertain if supra-luminal speeds are possible.  The idea science is capable of being used as any position at all on the supernatural beyond the purely philosophical not only defies reason, but history and scientific history as well.\nAnd if religion got things as reliably wrong as science does, no one would believe in it.  When science fetishists complain that religion claims absolute truth, they are projecting.  It is religion’s room for and acceptance of doubt that accounts for its persistence; it is science’s false pretensions to being the final word on truth that explain why the world has become increasingly skeptical of science and scientists.",
  "tags": [
    "Christianity",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-15T11:22:00+00:00"
}