{
  "url": "https://voxday.net/2011/11/05/mailvox-its-not-about-interlocutor/",
  "scraped_at": "2025-12-13T23:26:33.143006",
  "title": "Mailvox: it’s not about the interlocutor",
  "date_display": "November 5, 2011",
  "date_iso": "2011-11-05T13:05:00+00:00",
  "date_from_url": "2011-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AA wonders why it’s so hard to convince atheists of anything:</p><blockquote><p>I’ve been debating atheists on message boards for about 5 years now and while I’m getting better at writing, I don’t think I’m seeing a lot of results.  I’m just wondering, do you think there’s a place for people like me to debate on forums and then just read your blog to get ideas and material? Or is it better to carry out debates on blogs?  Also –I don’t know if you have an adderall habit or what but I’m amazed at how often you post — do you do something for your attention span and work ethic?</p></blockquote><p>The quote from Bartleby’s sums it up:</p><p><i>“He that complies against his will<br> Is of his own opinion still.”<br> ~Samuel Butler (1612-1680)</br></br></i></p><p>It’s a tautology.  Most atheists don’t believe in God because they don’t believe in God.  If you listen to their stories and read their books, it is readily apparent that most of them became atheists between the ages of 10 and 17.  There are various theories concerning why this happens, but the observable fact of the matter is that their atheism is actually less rational and less based on any reasoning than the average college student’s political party identification.  All the appeals to science and so forth are nothing more than ex post facto rationalizations.</p><p>Hence all the false claims about Biblical knowledge and the attacks on Sunday School theology.  What passes for their knowledge is usually the dimly remembered childhood church indoctrination.  I can’t think of a single atheist who has ever been able to tell me the structure of an argument from the <i>Summa Theologica</i>, much less the actual content of any of the 610 arguments contained within it.  And the next atheist I meet to have read Tertullian or any of the Latin Fathers except Augustine will be the first.  Their ignorance isn’t merely limited to Christianity either, as they seldom know anything about the sacred works or theology of other religions except perhaps a little Greek and Norse mythology.</p><p>That being said, I am entirely open to hear other explanations for why an atheist remains an atheist after having his purported reasons for becoming an atheist destroyed from actual atheists.</p><p>The reason for combating atheism isn’t to convert the atheist.  You will never see any such results.  That simply isn’t going to happen because no atheist will ever cease being an atheist simply because all of his rationalizations have been shown to be factually incorrect, logically fallacious, or otherwise irrational.  And that’s completely fine.  The reason for shooting them down over and over again is to neutralize and counteract their effect on the weak-minded, who are even less inclined to think than the average evangelical atheist.  I seldom intentionally attack atheists who make no attempt to convince others that gods and the supernatural do not exist for precisely this reason; I don’t care what they believe or do not believe.  Their lack of belief has no effect on me or anyone else.</p><p>But the moment they decide to attempt to convince others that they are correct, they become targets.  So, my advice is to keep doing what you’re doing, keep refining and improving your arguments, and you will likely prevent dozens, if not hundreds of people, from falling for the false arguments and incorrect logic being presented by evangelical atheists.</p><p>As for the frequency of my posting, I simply make a habit of it by sticking to a schedule.  Two posts per day, period.  Usually, that ends up meaning three or four on weekdays.  It takes very little time; the average one probably takes between 10-15 minutes, so 2-3 posts is like watching one sitcom per day.  That’s not a lot of work.  I’ve recently taken the same approach to my writing and it’s been very effective.  In 102 days since I started writing the first novel in the <i>Arts of Dark and Light</i> series, I’ve written 84,269 words, leaving me exactly 2.3 days ahead of an aggressive schedule.  Only another 210,731 to go….  As for adderall, I’ve never heard of it.  My only drugs of choice are cappucino and vino rosso.  Three cups of the former and one or two glasses of the latter daily is my limit.</p><p>As Ecclesiastes reminds us, it’s all vanity.  But one hopes that even so, some of it may be useful to others and will ultimately prove to be to the glory of God.</p></div>",
  "content_text": "AA wonders why it’s so hard to convince atheists of anything:\nI’ve been debating atheists on message boards for about 5 years now and while I’m getting better at writing, I don’t think I’m seeing a lot of results.  I’m just wondering, do you think there’s a place for people like me to debate on forums and then just read your blog to get ideas and material? Or is it better to carry out debates on blogs?  Also –I don’t know if you have an adderall habit or what but I’m amazed at how often you post — do you do something for your attention span and work ethic?\nThe quote from Bartleby’s sums it up:\n“He that complies against his will\nIs of his own opinion still.”\n~Samuel Butler (1612-1680)\nIt’s a tautology.  Most atheists don’t believe in God because they don’t believe in God.  If you listen to their stories and read their books, it is readily apparent that most of them became atheists between the ages of 10 and 17.  There are various theories concerning why this happens, but the observable fact of the matter is that their atheism is actually less rational and less based on any reasoning than the average college student’s political party identification.  All the appeals to science and so forth are nothing more than ex post facto rationalizations.\nHence all the false claims about Biblical knowledge and the attacks on Sunday School theology.  What passes for their knowledge is usually the dimly remembered childhood church indoctrination.  I can’t think of a single atheist who has ever been able to tell me the structure of an argument from the\nSumma Theologica\n, much less the actual content of any of the 610 arguments contained within it.  And the next atheist I meet to have read Tertullian or any of the Latin Fathers except Augustine will be the first.  Their ignorance isn’t merely limited to Christianity either, as they seldom know anything about the sacred works or theology of other religions except perhaps a little Greek and Norse mythology.\nThat being said, I am entirely open to hear other explanations for why an atheist remains an atheist after having his purported reasons for becoming an atheist destroyed from actual atheists.\nThe reason for combating atheism isn’t to convert the atheist.  You will never see any such results.  That simply isn’t going to happen because no atheist will ever cease being an atheist simply because all of his rationalizations have been shown to be factually incorrect, logically fallacious, or otherwise irrational.  And that’s completely fine.  The reason for shooting them down over and over again is to neutralize and counteract their effect on the weak-minded, who are even less inclined to think than the average evangelical atheist.  I seldom intentionally attack atheists who make no attempt to convince others that gods and the supernatural do not exist for precisely this reason; I don’t care what they believe or do not believe.  Their lack of belief has no effect on me or anyone else.\nBut the moment they decide to attempt to convince others that they are correct, they become targets.  So, my advice is to keep doing what you’re doing, keep refining and improving your arguments, and you will likely prevent dozens, if not hundreds of people, from falling for the false arguments and incorrect logic being presented by evangelical atheists.\nAs for the frequency of my posting, I simply make a habit of it by sticking to a schedule.  Two posts per day, period.  Usually, that ends up meaning three or four on weekdays.  It takes very little time; the average one probably takes between 10-15 minutes, so 2-3 posts is like watching one sitcom per day.  That’s not a lot of work.  I’ve recently taken the same approach to my writing and it’s been very effective.  In 102 days since I started writing the first novel in the\nArts of Dark and Light\nseries, I’ve written 84,269 words, leaving me exactly 2.3 days ahead of an aggressive schedule.  Only another 210,731 to go….  As for adderall, I’ve never heard of it.  My only drugs of choice are cappucino and vino rosso.  Three cups of the former and one or two glasses of the latter daily is my limit.\nAs Ecclesiastes reminds us, it’s all vanity.  But one hopes that even so, some of it may be useful to others and will ultimately prove to be to the glory of God.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-05T13:05:00+00:00"
}