{
  "url": "https://voxday.net/2011/11/18/miracle-of-tebow/",
  "scraped_at": "2025-12-13T23:27:42.684066",
  "title": "The Miracle of Tebow",
  "date_display": "November 18, 2011",
  "date_iso": "2011-11-18T19:00:00+00:00",
  "date_from_url": "2011-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, despite my unshaken belief that he does not in any way meet the necessary qualifications, I am genuinely enjoying the unlikely career of <a href=\"http://www.grantland.com/blog/the-triangle/post/_/id/10128/tim-tebow-and-the-miracles\">Tim Tebow, Starting NFL Quarterback</a>:</p><blockquote><p>For most of the night, I was looking for a reason why. Why Mark Sanchez (who, for all his problems, has led the Jets to consecutive AFC Championship games) was getting nothing but shade from Plaxico Burress and hot, angry breath from offensive coordinator Brian Schottenheimer while Tebow, who was playing quarterback with the grace of an ice-skating Bambi, was getting the undying support of his teammates.</p><p>For the answer, go back to 3:55 remaining in the fourth quarter. Tebow, barely bothering to look upfield, cradles the ball and takes off like a Greyhound bus driven by a meth head. There on the horizon, he sees the usually unwelcoming vista that is Revis Island. And what does he do? Does he trot out of bounds and save some clock and spare himself the contact? Nope. He barrels over Revis like a hurricane, stays in bounds, and gets that much closer to the end zone.</p><p>That’s why you block for a guy like that. That’s why you run route after useless route and try to save play after broken play. That’s why, if you’re on defense, you are just trying to keep it close, just trying to ding Sanchez up enough to make him jumpy, just trying to frustrate the Jets receiver corps enough to make them give up on their game plan.</p><p>Because at the end of the game, it might just be 13-10 and you might just have a shot. You might just be 20 yards out and your quarterback might just be able to run like Mike Alstott. And with the home crowd losing their minds in the thin air, and the terrifying Jets defense on their back foot and everyone in America watching because your very average AFC West team has become the center of the football universe, your quarterback might just do the one thing he was put on Earth to do: make a perfect read on a safety who is overcommitted to the inside and take off with only one destination in mind. He might do what he said he would, what he asked you to believe he could do. He might just win the damn thing for you.</p></blockquote><p>Dr. Pangloss was right.  This is the best of all possible worlds.  I assumed Tim Tebow would fail as a starter because he is not capable of throwing the ball at an NFL level.  This was a basic failure of logic, because as Mr. Tebow has demonstrated, winning in the NFL <i>does not actually require a quarterback successfully throwing the ball</i>.  He is literally adding a new dimension to the game, which is not merely interesting, it is awesome.</p><p>I love Tebow’s success to date for exactly the same reason I exulted in the failure of Real Madrid’s “galáctico” approach to international football.  For those troglodytes who are unaware, a few years back Real Madrid spent umpty gazillion euros doing the equivalent of starting Peyton Manning (Zizou), Tom Brady (Luis Figo) and Drew Brees (David Beckham) in the same backfield, in addition to acquiring the best English striker (Michael Owen) to pair with the best Brazilian striker (Ronaldo), backed up by the best young Spanish striker (Raul).  They spent $210 million just to acquire the <i>rights</i> to FOUR players.  Everyone – and I mean almost everyone in Europe except me – assumed that Real would dominate the La Liga as well as the Champion’s League for years.</p><p>They won three titles, all of them before Beckham and Owen arrived.  This compares to the four they had won in the six years that preceded the galáctico era.  It was a complete failure and remains a proverbial example of the limitations of pure talent in team sports.</p><p>I still find it incredibly hard to imagine a Tebow-led NFL team winning the Super Bowl.  But at this point, I can’t count it out entirely, because Tebow is all about the team rather than the talent.  And that is as awesome and inspiring as it is amusing.</p></div>",
  "content_text": "I have to admit, despite my unshaken belief that he does not in any way meet the necessary qualifications, I am genuinely enjoying the unlikely career of\nTim Tebow, Starting NFL Quarterback\n:\nFor most of the night, I was looking for a reason why. Why Mark Sanchez (who, for all his problems, has led the Jets to consecutive AFC Championship games) was getting nothing but shade from Plaxico Burress and hot, angry breath from offensive coordinator Brian Schottenheimer while Tebow, who was playing quarterback with the grace of an ice-skating Bambi, was getting the undying support of his teammates.\nFor the answer, go back to 3:55 remaining in the fourth quarter. Tebow, barely bothering to look upfield, cradles the ball and takes off like a Greyhound bus driven by a meth head. There on the horizon, he sees the usually unwelcoming vista that is Revis Island. And what does he do? Does he trot out of bounds and save some clock and spare himself the contact? Nope. He barrels over Revis like a hurricane, stays in bounds, and gets that much closer to the end zone.\nThat’s why you block for a guy like that. That’s why you run route after useless route and try to save play after broken play. That’s why, if you’re on defense, you are just trying to keep it close, just trying to ding Sanchez up enough to make him jumpy, just trying to frustrate the Jets receiver corps enough to make them give up on their game plan.\nBecause at the end of the game, it might just be 13-10 and you might just have a shot. You might just be 20 yards out and your quarterback might just be able to run like Mike Alstott. And with the home crowd losing their minds in the thin air, and the terrifying Jets defense on their back foot and everyone in America watching because your very average AFC West team has become the center of the football universe, your quarterback might just do the one thing he was put on Earth to do: make a perfect read on a safety who is overcommitted to the inside and take off with only one destination in mind. He might do what he said he would, what he asked you to believe he could do. He might just win the damn thing for you.\nDr. Pangloss was right.  This is the best of all possible worlds.  I assumed Tim Tebow would fail as a starter because he is not capable of throwing the ball at an NFL level.  This was a basic failure of logic, because as Mr. Tebow has demonstrated, winning in the NFL\ndoes not actually require a quarterback successfully throwing the ball\n.  He is literally adding a new dimension to the game, which is not merely interesting, it is awesome.\nI love Tebow’s success to date for exactly the same reason I exulted in the failure of Real Madrid’s “galáctico” approach to international football.  For those troglodytes who are unaware, a few years back Real Madrid spent umpty gazillion euros doing the equivalent of starting Peyton Manning (Zizou), Tom Brady (Luis Figo) and Drew Brees (David Beckham) in the same backfield, in addition to acquiring the best English striker (Michael Owen) to pair with the best Brazilian striker (Ronaldo), backed up by the best young Spanish striker (Raul).  They spent $210 million just to acquire the\nrights\nto FOUR players.  Everyone – and I mean almost everyone in Europe except me – assumed that Real would dominate the La Liga as well as the Champion’s League for years.\nThey won three titles, all of them before Beckham and Owen arrived.  This compares to the four they had won in the six years that preceded the galáctico era.  It was a complete failure and remains a proverbial example of the limitations of pure talent in team sports.\nI still find it incredibly hard to imagine a Tebow-led NFL team winning the Super Bowl.  But at this point, I can’t count it out entirely, because Tebow is all about the team rather than the talent.  And that is as awesome and inspiring as it is amusing.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-18T19:00:00+00:00"
}