{
  "url": "https://voxday.net/2011/11/04/psychology-is-not-science/",
  "scraped_at": "2025-12-13T23:26:29.441959",
  "title": "Psychology is not science",
  "date_display": "November 4, 2011",
  "date_iso": "2011-11-04T12:55:00+00:00",
  "date_from_url": "2011-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And neither are many other pseudoscientific fields with scientific pretensions.  Because the credibility of science depends upon its replicability, it naturally follows that any “scientist” who does not release his data for independent review and replication is not doing science:</p><blockquote><p>In a recent survey, two-thirds of Dutch research psychologists said they did not make their raw data available for other researchers to see.</p></blockquote><p>Then they are witch-doctors, propagandists, and grant-seekers, not scientists.  Some years ago, I wrote about the need for Open Science.  But the more that I think about it, that is redundant.  Because if it isn’t open, it isn’t science.  To paraphrase <a href=\"http://www.openscience.org/blog/?p=376\">the OpenScience Project</a>, if you’re going to do science, you have to release the computer code too.</p><p><i>“Our view is that it is not healthy for scientific papers to be supported by computations that cannot be reproduced except by a few employees at a commercial software developer. Should this kind of work even be considered Science? It may be research, and it may be important, but unless enough details of the experimental methodology are made available so that it can be subjected to true reproducibility tests by skeptics, it isn’t Science.”</i></p><p>This was also amusing to note in light of my contention that most scientists are completely untrained in statistics.</p><p><i>“Also common is a self-serving statistical sloppiness. In an analysis published this year, Dr. Wicherts and Marjan Bakker, also at the University of Amsterdam, searched a random sample of 281 psychology papers for statistical errors. They found that about half of the papers in high-end journals contained some statistical error.”</i></p></div>",
  "content_text": "And neither are many other pseudoscientific fields with scientific pretensions.  Because the credibility of science depends upon its replicability, it naturally follows that any “scientist” who does not release his data for independent review and replication is not doing science:\nIn a recent survey, two-thirds of Dutch research psychologists said they did not make their raw data available for other researchers to see.\nThen they are witch-doctors, propagandists, and grant-seekers, not scientists.  Some years ago, I wrote about the need for Open Science.  But the more that I think about it, that is redundant.  Because if it isn’t open, it isn’t science.  To paraphrase\nthe OpenScience Project\n, if you’re going to do science, you have to release the computer code too.\n“Our view is that it is not healthy for scientific papers to be supported by computations that cannot be reproduced except by a few employees at a commercial software developer. Should this kind of work even be considered Science? It may be research, and it may be important, but unless enough details of the experimental methodology are made available so that it can be subjected to true reproducibility tests by skeptics, it isn’t Science.”\nThis was also amusing to note in light of my contention that most scientists are completely untrained in statistics.\n“Also common is a self-serving statistical sloppiness. In an analysis published this year, Dr. Wicherts and Marjan Bakker, also at the University of Amsterdam, searched a random sample of 281 psychology papers for statistical errors. They found that about half of the papers in high-end journals contained some statistical error.”",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-04T12:55:00+00:00"
}