{
  "url": "https://voxday.net/2011/11/03/skeptic-shows-hes-sucker/",
  "scraped_at": "2025-12-13T23:26:20.875828",
  "title": "A skeptic shows he’s a sucker",
  "date_display": "November 3, 2011",
  "date_iso": "2011-11-03T13:30:00+00:00",
  "date_from_url": "2011-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whenever you encounter atheists claiming to be skeptical, rational, logical, and intelligent, you can be relatively confident that they will soon demonstrate that they are absolutely nothing of the sort.  Consider these <a href=\"http://www.skepticblog.org/2011/11/01/occupy-this/\">two contradictory claims</a> from SkepticBlog:</p><blockquote><p>1.  “SkepticBlog is a collaboration among some of the most recognized names in promoting science, critical thinking, and skepticism.”</p><p>2.  “Why has no one from Wall Street gone to jail for the financial meltdown? Bill Maher has asked this question several times on his HBO show Real Time. I have asked many experts myself, including economists, lawyers, and Wall Street traders. Answer: no one went to jail because they didn’t break any laws.”</p></blockquote><p>Now, I rather liked Michael Shermer’s “The Mind of the Market” when I reviewed it a while back, but this post is almost astonishingly stupid and is so demonstrably clueless that I very much doubt Shermer has genuinely asked a single expert about this.  One need look no further than the mainstream media to know that the Obama administration broke the law.  Ben Bernanke broke the law.  Henry Paulson broke the law.  Every single “too big to fail” bank broke the law.  Every bank that registered a mortage with MERS broke the law and evaded county taxes.  Karl Denninger has a little list of <a href=\"http://market-ticker.org/akcs-www?post=196936\">four of the most obvious and egregious examples</a>.</p><p>Shermer then goes on to ask “What, exactly, did these Wall Street people do that was so wrong?”  That’s quite simple.  Fraud, theft, forgery, money laundering, and tax evasion.</p><p>And after this preposterous demonstration of willful stupidity, the “skeptic” Shermer declares that “the government should regulate Wall Street more”.  Right, because the answer to government regulators failing to enforce the law is obviously <i>more government regulation</i>.  That’s some <i>fine</i> criticial thinking right there, isn’t it?</p><p>Shermer should know better.  I know for a fact that he’s not as economically illiterate as this post makes him look, but it shows that he is demonstrably inept when it comes to logic.  Keep this performance in mind when you consider the value of the science he is promoting and the legitimacy of his arguments concerning atheism.</p></div>",
  "content_text": "Whenever you encounter atheists claiming to be skeptical, rational, logical, and intelligent, you can be relatively confident that they will soon demonstrate that they are absolutely nothing of the sort.  Consider these\ntwo contradictory claims\nfrom SkepticBlog:\n1.  “SkepticBlog is a collaboration among some of the most recognized names in promoting science, critical thinking, and skepticism.”\n2.  “Why has no one from Wall Street gone to jail for the financial meltdown? Bill Maher has asked this question several times on his HBO show Real Time. I have asked many experts myself, including economists, lawyers, and Wall Street traders. Answer: no one went to jail because they didn’t break any laws.”\nNow, I rather liked Michael Shermer’s “The Mind of the Market” when I reviewed it a while back, but this post is almost astonishingly stupid and is so demonstrably clueless that I very much doubt Shermer has genuinely asked a single expert about this.  One need look no further than the mainstream media to know that the Obama administration broke the law.  Ben Bernanke broke the law.  Henry Paulson broke the law.  Every single “too big to fail” bank broke the law.  Every bank that registered a mortage with MERS broke the law and evaded county taxes.  Karl Denninger has a little list of\nfour of the most obvious and egregious examples\n.\nShermer then goes on to ask “What, exactly, did these Wall Street people do that was so wrong?”  That’s quite simple.  Fraud, theft, forgery, money laundering, and tax evasion.\nAnd after this preposterous demonstration of willful stupidity, the “skeptic” Shermer declares that “the government should regulate Wall Street more”.  Right, because the answer to government regulators failing to enforce the law is obviously\nmore government regulation\n.  That’s some\nfine\ncriticial thinking right there, isn’t it?\nShermer should know better.  I know for a fact that he’s not as economically illiterate as this post makes him look, but it shows that he is demonstrably inept when it comes to logic.  Keep this performance in mind when you consider the value of the science he is promoting and the legitimacy of his arguments concerning atheism.",
  "tags": [
    "atheism",
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-03T13:30:00+00:00"
}