{
  "url": "https://voxday.net/2011/11/01/three-levels-of-science/",
  "scraped_at": "2025-12-13T23:26:09.962544",
  "title": "The three levels of science",
  "date_display": "November 1, 2011",
  "date_iso": "2011-11-01T17:00:00+00:00",
  "date_from_url": "2011-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The fundamental flaw in the common, but erroneous idea that science is an intrinsically superior form of obtaining knowledge is that it relies upon the same human element that various other forms of knowledge do.  Notice that the amount of <a href=\"http://news.sciencemag.org/scienceinsider/2011/10/report-dutch-lord-of-the-data-fo.html?ref=hp\">detected scientific fraud</a> appears to be increasing as electronic communications provide greater access to non-scientists, and that even in this case, where the whistleblowing was done by scientists, it was not done as part of the scientific process.</p><blockquote><p>Diederik Stapel was suspended from his position at Tilburg University in the Netherlands in September after three junior researchers reported that they suspected scientific misconduct in a study that claimed eating meat made people more aggressive. Soon after being confronted with the accusations, Stapel reportedly told university officials that some of his papers contained falsified data. The university launched an investigation, as did the University of Groningen and the University of Amsterdam, where Stapel had worked previously. The Tilburg commission today released an interim report (in Dutch), which includes preliminary results from all three investigations. The investigators found “several dozens of publications” in which fictitious data has been used. Fourteen of the 21 Ph.D. theses Stapel supervised are also tainted, the committee concluded.</p><p>Stapel issued a statement today in which he apologizes to his colleagues and says he “failed as a scientist” and is ashamed of his actions. He has cooperated to an extent by identifying papers with suspect data, according to university officials. The investigation by the three universities is ongoing and should ultimately investigate more than 150 papers that Stapel has published since 2004, including a paper earlier this year in Science on the influence of a messy environment on prejudice. “People are in shock,” says Gerben van Kleef, a social psychologist at the University of Amsterdam, who did not work directly with Stapel. “Everybody wonders how this could have happened and at this proportion.”</p><p>Stapel’s work encompassed a broad range of attention-catching topics, including the influence of power on moral thinking and the reaction of psychologists to a plagiarism scandal.  The committee, which interviewed dozens of Stapel’s former students, postdoctoral researchers, co-authors, and colleagues, found that Stapel alone was responsible for the fraud. The panel reported that he would discuss in detail experimental designs, including drafting questionnaires, and would then claim to conduct the experiments at high schools and universities with which he had special arrangements. The experiments, however, never took place, the universities concluded. Stapel made up the data sets, which he then gave the student or collaborator for analysis, investigators allege. In other instances, the report says, he told colleagues that he had an old data set lying around that he hadn’t yet had a chance to analyze. When Stapel did conduct actual experiments, the committee found evidence that he manipulated the results.</p><p>Many of Stapel’s students graduated without having ever run an experiment, the report says. Stapel told them that their time was better spent analyzing data and writing. The commission writes that Stapel was “lord of the data” in his collaborations. It says colleagues or students who asked to see raw data were given excuses or even threatened and insulted.</p></blockquote><p>Now, keep in mind that science fetishists often claim that science is <i>intrinsically</i> superior because scientific evidence <i>theoretically</i> can be replicated.  But this argument is fundamentally flawed; no one argues that eyewitness testimony that theoretically could be confirmed by physical evidence is intrinsically superior to eyewitness evidence that cannot be independently confirmed <i>in the absence of actually bothering to verify the testimony</i>.</p><p>Clearly, a bright line needs to be delineated between scientific evidence that has been independently replicated by experiment, scientific evidence that could be independently replicated but has not been, and scientific evidence that cannot be independently replicated by experiment.  And furthermore, it is necessary to stop giving the latter two types of scientific evidence, or more properly, potential scientific evidence, the same level of credence that is given to actual scientific evidence that has been reliably and independently replicated.</p></div>",
  "content_text": "The fundamental flaw in the common, but erroneous idea that science is an intrinsically superior form of obtaining knowledge is that it relies upon the same human element that various other forms of knowledge do.  Notice that the amount of\ndetected scientific fraud\nappears to be increasing as electronic communications provide greater access to non-scientists, and that even in this case, where the whistleblowing was done by scientists, it was not done as part of the scientific process.\nDiederik Stapel was suspended from his position at Tilburg University in the Netherlands in September after three junior researchers reported that they suspected scientific misconduct in a study that claimed eating meat made people more aggressive. Soon after being confronted with the accusations, Stapel reportedly told university officials that some of his papers contained falsified data. The university launched an investigation, as did the University of Groningen and the University of Amsterdam, where Stapel had worked previously. The Tilburg commission today released an interim report (in Dutch), which includes preliminary results from all three investigations. The investigators found “several dozens of publications” in which fictitious data has been used. Fourteen of the 21 Ph.D. theses Stapel supervised are also tainted, the committee concluded.\nStapel issued a statement today in which he apologizes to his colleagues and says he “failed as a scientist” and is ashamed of his actions. He has cooperated to an extent by identifying papers with suspect data, according to university officials. The investigation by the three universities is ongoing and should ultimately investigate more than 150 papers that Stapel has published since 2004, including a paper earlier this year in Science on the influence of a messy environment on prejudice. “People are in shock,” says Gerben van Kleef, a social psychologist at the University of Amsterdam, who did not work directly with Stapel. “Everybody wonders how this could have happened and at this proportion.”\nStapel’s work encompassed a broad range of attention-catching topics, including the influence of power on moral thinking and the reaction of psychologists to a plagiarism scandal.  The committee, which interviewed dozens of Stapel’s former students, postdoctoral researchers, co-authors, and colleagues, found that Stapel alone was responsible for the fraud. The panel reported that he would discuss in detail experimental designs, including drafting questionnaires, and would then claim to conduct the experiments at high schools and universities with which he had special arrangements. The experiments, however, never took place, the universities concluded. Stapel made up the data sets, which he then gave the student or collaborator for analysis, investigators allege. In other instances, the report says, he told colleagues that he had an old data set lying around that he hadn’t yet had a chance to analyze. When Stapel did conduct actual experiments, the committee found evidence that he manipulated the results.\nMany of Stapel’s students graduated without having ever run an experiment, the report says. Stapel told them that their time was better spent analyzing data and writing. The commission writes that Stapel was “lord of the data” in his collaborations. It says colleagues or students who asked to see raw data were given excuses or even threatened and insulted.\nNow, keep in mind that science fetishists often claim that science is\nintrinsically\nsuperior because scientific evidence\ntheoretically\ncan be replicated.  But this argument is fundamentally flawed; no one argues that eyewitness testimony that theoretically could be confirmed by physical evidence is intrinsically superior to eyewitness evidence that cannot be independently confirmed\nin the absence of actually bothering to verify the testimony\n.\nClearly, a bright line needs to be delineated between scientific evidence that has been independently replicated by experiment, scientific evidence that could be independently replicated but has not been, and scientific evidence that cannot be independently replicated by experiment.  And furthermore, it is necessary to stop giving the latter two types of scientific evidence, or more properly, potential scientific evidence, the same level of credence that is given to actual scientific evidence that has been reliably and independently replicated.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-01T17:00:00+00:00"
}