{
  "url": "https://voxday.net/2011/11/12/week-in-alpha_12/",
  "scraped_at": "2025-12-13T23:27:11.347552",
  "title": "The week in Alpha",
  "date_display": "November 12, 2011",
  "date_iso": "2011-11-12T21:23:00+00:00",
  "date_from_url": "2011-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://alphagameplan.blogspot.com/2011/11/science-has-spoken.html\">Science has spoken</a> and demonstrated that ALPHAS are merely selfless men bringing health and wellness benefits to the opposite sex.</p><p>We already know the answer to why a 10 percent shortfall in the number of female physical science and math degrees is a problem but an eight percent shortfall in the number of male biology degrees <a href=\"http://alphagameplan.blogspot.com/2011/11/we-already-know-answer.html\">is not</a>.</p><p>Athol adeptly translates a song into <i>Spielsprache</i> and Vox suggests that being able to do what you want all the time <a href=\"http://alphagameplan.blogspot.com/2011/11/game-set-to-music.html\">is not necessarily the worst fate</a> in the world.</p><p>Vox does his best Pat Moynihan impression and deduces that black statistical canaries are suggesting 50 percent of white college women today will not marry <a href=\"http://alphagameplan.blogspot.com/2011/11/black-canaries-in-coal-mine.html\">by the age of 40</a>.</p><p>Game in Libya suggests that women help choose what sort of society they will live in <a href=\"http://alphagameplan.blogspot.com/2011/11/dont-talk-just-kill.html\">by influencing young men</a> to pursue careers as builders or destroyers.</p></div>",
  "content_text": "Science has spoken\nand demonstrated that ALPHAS are merely selfless men bringing health and wellness benefits to the opposite sex.\nWe already know the answer to why a 10 percent shortfall in the number of female physical science and math degrees is a problem but an eight percent shortfall in the number of male biology degrees\nis not\n.\nAthol adeptly translates a song into\nSpielsprache\nand Vox suggests that being able to do what you want all the time\nis not necessarily the worst fate\nin the world.\nVox does his best Pat Moynihan impression and deduces that black statistical canaries are suggesting 50 percent of white college women today will not marry\nby the age of 40\n.\nGame in Libya suggests that women help choose what sort of society they will live in\nby influencing young men\nto pursue careers as builders or destroyers.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-12T21:23:00+00:00"
}