{
  "url": "https://voxday.net/2014/06/18/a-failure-to-grasp-consequences/",
  "scraped_at": "2025-12-16T12:17:50.540469",
  "title": "A failure to grasp consequences",
  "date_display": "June 18, 2014",
  "date_iso": "2014-06-18T09:31:00+00:00",
  "date_from_url": "2014-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought <a href=\"http://www.telegraph.co.uk/education/educationnews/10892606/Trojan-Horse-debate-We-were-wrong-all-cultures-are-not-equal.html\">this article by a worried cultural blank-slatist</a> was informative, because it demonstrates how, even when faced with the obvious consequences of multiculturalism and the rejection of their own traditional Christian culture, the secularists still leap to the wrong conclusions and refuse to abandon their groundless assumptions.</p><blockquote class=\"tr_bq\"><p> If I have learnt one thing working with children as a teacher, a volunteer and, more recently, a parent, it’s that what children want above all else is to fit in. The desire not to be different must be hard-wired, so urgent is the need of your average nine-year-old to have the same pencil case as every other nine-year-old. Individuality, much prized in adult life, is abhorred by our conservative juniors, who crave acceptance as the thirsty crave water. “Fitting in” is braided into the DNA of every child, regardless of creed or colour. When the deep, resonant bell of human evolution tolls, it says: “Belong, belong, belong.”</p><p>Integrating children into a new society, then, should not present too much of a problem. A football, some Panini World Cup stickers to trade, One Direction, Harry Potter, 97 episodes of Friends, especially the one where Rachel has a baby: common interests for youngsters are not hard to find. So how have we ended up with a situation where so many Muslims are adrift from the mainstream? Why this scandal in Birmingham where five overwhelmingly Muslim schools, some until recently judged to be outstanding, are to be put into special measures because they have sought to inculcate ideas that are repellent to this country?</p><p>Let me quote Myriam Francois-Cerrah, a writer and Muslim convert, who told Channel 4 News on Tuesday that she rejected calls by the Prime Minister and Michael Gove, the Education Secretary, for schools to promote British values. “In many ways, the problem is creating a hierarchy of cultures when you say you need to promote British values,” she objected. “What does that say to children in a classroom whose heritage harks from outside the British Isles? It says this country has superior moral values and you are coming from some backward culture whose values you … must not consider equal to our own.”</p><p>Funnily enough, that’s exactly what we are saying, Myriam. Spot on! A Muslim girl who winds up in Bolton or Luton should thank her lucky stars she doesn’t live in Sudan – or Pakistan, where, only last month, a woman was stoned to death by her family for the crime of marrying a man of whom they disapproved. Farzana Parveen’s father explained: “I killed my daughter as she had insulted all of our family by marrying a man without our consent, and I have no regret over it.”</p><p>Are British values superior to Mr Parveen’s? I do hope so.</p><p>Unfortunately, the great lie underpinning the creed of multiculturalism, as spouted by Francois‑Cerrah and her ilk, is that all cultures are “equally valid”. Well, patently, they’re not. The reason irate Pakistani patriarchs are not chucking bricks at their errant daughters in the Birmingham Bull Ring is because Britain has a basically uncorrupt police force, a robust judiciary and an enlightened, hard-won system of liberal values that regards women and girls as equals, not third-class citizens.</p><p>But instead of standing up to barbarism and ignorance, too often we have looked away in embarrassment or fear. How many teachers have averted their gaze when 13-year-old Muslim girls suddenly disappear from the classroom to be taken “home” for a forced marriage, because this would present unwelcome evidence that some cultures are less valid than others?</p><p>How many health professionals in Bradford are concerned, but never say so, that intermarriage in the Muslim community – 75 per cent of Pakistanis in the city are married to their first cousin – is causing babies to be born blind, deaf and with other disabilities? Back in 2008, when Labour environment minister Phil Woolas said that British Pakistanis were fuelling the rate of birth defects, he was slapped down by Downing Street, with a spokesman for prime minister Gordon Brown saying the issue was not one for ministers to comment on. Government after government has filed this thorny issue in “The Too Difficult Box”, the title of a timely new book edited by former Cabinet minister Charles Clarke.</p><p>This was all so predictable. Back in the summer of 1981, I was working in a primary school in west London where the children were dizzy with excitement about Prince Charles and Lady Di. The royal wedding was a great unifying event, but there was one group of pupils who were not allowed to fit in. The little Muslim girls did not wear cool, gingham-checked dresses in the heat like the others. Instead, they were dressed in the winter uniform – a polo neck and tunic worn over strictly non-uniform trousers and thick tights. As far as I could tell, no teacher dared challenge this clear breach of school rules. In a similar spirit, it was accepted that the Muslim girls could not attend the weekly swimming lesson.</p><p>When a trip was planned to Hampton Court, the children were told they would be seeing Henry VIII’s bed. Somehow, the word “bed”, coupled with the humongously horny Henry, set off alarm bells among Muslim parents, who withdrew their sons and daughters from the outing. This irrational boycott was tolerated. I remember thinking how awful and sad it was that liberal, white teachers didn’t stick up for the Muslim children’s right to play a full part in the life of their country.</p><p>It made me angry when I was practically a child myself, and it makes me even angrier now, 30 years on, thinking of the lost decades when good people did nothing to prevent the toxic situation outlined this week by the chief inspector of schools. Music and dancing banned in a primary school because they are un-Islamic. Muslim pupils not allowed to study Shakespeare’s Much Ado About Nothing because it shows young people falling in love and marrying. A preacher who believes homosexuals should be stoned to death invited to address an assembly – in a British school in a British town, forsooth. Children as young as six told that Western women are “white prostitutes”, if you please….</p><p>I think the battle we must fight now really has very little to do with sincere religious belief. It’s about social control, repression, misogyny and cruelty.</p></blockquote><p>Multiculturalism, and the insistence that all cultures are created equal, was the inevitable result of the secular rejection of Christian European culture. It was the combination of a) asserting traditional customs and morality to be onerous with b) the intrinsic philosophical groundlessness of secularism. Without deeming all cultures equal, and thereby permitting everyone to pick and choose whatever standards they preferred, they could not render judgementalism the one and only sin and provide themselves with a weapon against their traditional culture.</p><p>But instead of admitting they were wrong to advocate secularism over traditional Christian European culture, they are trying to separate the consequence from the cause. And that is not going to work.</p><p>I’ve nearly finished reading Thomas Asbridge’s <i>The Crusades: The Authoritative History of the War for the Holy Land</i>. And one thing that is clear is that conflict between secularism and Islam is even more inevitable than the historical conflict between Christianity and Islam. It is evident that Islam goes through periods of decadence, decay, and dormancy, before it revives and becomes expansionary and imperial. This cycle can no more be externally controlled and managed than an individual can negotiate with the cells in his body.</p><p>What we are witnessing is The Third Jihad, the third great wave of Islamic expansion. The first was 622 to 732 AD. The second was 1071 to 1683. The third began in 1936, when the Muslim Brotherhood first began to oppose British rule in Egypt.</p><p>And as long as the secular West is babbling about the evolutionary need to “belong belong belong” and actively inviting its own invasion, the Third Jihad will continue its rapid expansion across the globe. Muslims are “adrift from the mainstream” because they are a rival mainstream, and a powerful historical mainstream with considerable advantages over the barren secular one. The complete collapse of the well-armed Iraqi Army in the face of the outnumbered, outgunned ISIS forces despite its material advantages is an apt metaphor for the way in which Western secularism now finds itself in full-fledged retreat before the advance of global Islam.</p></div>",
  "content_text": "I thought\nthis article by a worried cultural blank-slatist\nwas informative, because it demonstrates how, even when faced with the obvious consequences of multiculturalism and the rejection of their own traditional Christian culture, the secularists still leap to the wrong conclusions and refuse to abandon their groundless assumptions.\nIf I have learnt one thing working with children as a teacher, a volunteer and, more recently, a parent, it’s that what children want above all else is to fit in. The desire not to be different must be hard-wired, so urgent is the need of your average nine-year-old to have the same pencil case as every other nine-year-old. Individuality, much prized in adult life, is abhorred by our conservative juniors, who crave acceptance as the thirsty crave water. “Fitting in” is braided into the DNA of every child, regardless of creed or colour. When the deep, resonant bell of human evolution tolls, it says: “Belong, belong, belong.”\nIntegrating children into a new society, then, should not present too much of a problem. A football, some Panini World Cup stickers to trade, One Direction, Harry Potter, 97 episodes of Friends, especially the one where Rachel has a baby: common interests for youngsters are not hard to find. So how have we ended up with a situation where so many Muslims are adrift from the mainstream? Why this scandal in Birmingham where five overwhelmingly Muslim schools, some until recently judged to be outstanding, are to be put into special measures because they have sought to inculcate ideas that are repellent to this country?\nLet me quote Myriam Francois-Cerrah, a writer and Muslim convert, who told Channel 4 News on Tuesday that she rejected calls by the Prime Minister and Michael Gove, the Education Secretary, for schools to promote British values. “In many ways, the problem is creating a hierarchy of cultures when you say you need to promote British values,” she objected. “What does that say to children in a classroom whose heritage harks from outside the British Isles? It says this country has superior moral values and you are coming from some backward culture whose values you … must not consider equal to our own.”\nFunnily enough, that’s exactly what we are saying, Myriam. Spot on! A Muslim girl who winds up in Bolton or Luton should thank her lucky stars she doesn’t live in Sudan – or Pakistan, where, only last month, a woman was stoned to death by her family for the crime of marrying a man of whom they disapproved. Farzana Parveen’s father explained: “I killed my daughter as she had insulted all of our family by marrying a man without our consent, and I have no regret over it.”\nAre British values superior to Mr Parveen’s? I do hope so.\nUnfortunately, the great lie underpinning the creed of multiculturalism, as spouted by Francois‑Cerrah and her ilk, is that all cultures are “equally valid”. Well, patently, they’re not. The reason irate Pakistani patriarchs are not chucking bricks at their errant daughters in the Birmingham Bull Ring is because Britain has a basically uncorrupt police force, a robust judiciary and an enlightened, hard-won system of liberal values that regards women and girls as equals, not third-class citizens.\nBut instead of standing up to barbarism and ignorance, too often we have looked away in embarrassment or fear. How many teachers have averted their gaze when 13-year-old Muslim girls suddenly disappear from the classroom to be taken “home” for a forced marriage, because this would present unwelcome evidence that some cultures are less valid than others?\nHow many health professionals in Bradford are concerned, but never say so, that intermarriage in the Muslim community – 75 per cent of Pakistanis in the city are married to their first cousin – is causing babies to be born blind, deaf and with other disabilities? Back in 2008, when Labour environment minister Phil Woolas said that British Pakistanis were fuelling the rate of birth defects, he was slapped down by Downing Street, with a spokesman for prime minister Gordon Brown saying the issue was not one for ministers to comment on. Government after government has filed this thorny issue in “The Too Difficult Box”, the title of a timely new book edited by former Cabinet minister Charles Clarke.\nThis was all so predictable. Back in the summer of 1981, I was working in a primary school in west London where the children were dizzy with excitement about Prince Charles and Lady Di. The royal wedding was a great unifying event, but there was one group of pupils who were not allowed to fit in. The little Muslim girls did not wear cool, gingham-checked dresses in the heat like the others. Instead, they were dressed in the winter uniform – a polo neck and tunic worn over strictly non-uniform trousers and thick tights. As far as I could tell, no teacher dared challenge this clear breach of school rules. In a similar spirit, it was accepted that the Muslim girls could not attend the weekly swimming lesson.\nWhen a trip was planned to Hampton Court, the children were told they would be seeing Henry VIII’s bed. Somehow, the word “bed”, coupled with the humongously horny Henry, set off alarm bells among Muslim parents, who withdrew their sons and daughters from the outing. This irrational boycott was tolerated. I remember thinking how awful and sad it was that liberal, white teachers didn’t stick up for the Muslim children’s right to play a full part in the life of their country.\nIt made me angry when I was practically a child myself, and it makes me even angrier now, 30 years on, thinking of the lost decades when good people did nothing to prevent the toxic situation outlined this week by the chief inspector of schools. Music and dancing banned in a primary school because they are un-Islamic. Muslim pupils not allowed to study Shakespeare’s Much Ado About Nothing because it shows young people falling in love and marrying. A preacher who believes homosexuals should be stoned to death invited to address an assembly – in a British school in a British town, forsooth. Children as young as six told that Western women are “white prostitutes”, if you please….\nI think the battle we must fight now really has very little to do with sincere religious belief. It’s about social control, repression, misogyny and cruelty.\nMulticulturalism, and the insistence that all cultures are created equal, was the inevitable result of the secular rejection of Christian European culture. It was the combination of a) asserting traditional customs and morality to be onerous with b) the intrinsic philosophical groundlessness of secularism. Without deeming all cultures equal, and thereby permitting everyone to pick and choose whatever standards they preferred, they could not render judgementalism the one and only sin and provide themselves with a weapon against their traditional culture.\nBut instead of admitting they were wrong to advocate secularism over traditional Christian European culture, they are trying to separate the consequence from the cause. And that is not going to work.\nI’ve nearly finished reading Thomas Asbridge’s\nThe Crusades: The Authoritative History of the War for the Holy Land\n. And one thing that is clear is that conflict between secularism and Islam is even more inevitable than the historical conflict between Christianity and Islam. It is evident that Islam goes through periods of decadence, decay, and dormancy, before it revives and becomes expansionary and imperial. This cycle can no more be externally controlled and managed than an individual can negotiate with the cells in his body.\nWhat we are witnessing is The Third Jihad, the third great wave of Islamic expansion. The first was 622 to 732 AD. The second was 1071 to 1683. The third began in 1936, when the Muslim Brotherhood first began to oppose British rule in Egypt.\nAnd as long as the secular West is babbling about the evolutionary need to “belong belong belong” and actively inviting its own invasion, the Third Jihad will continue its rapid expansion across the globe. Muslims are “adrift from the mainstream” because they are a rival mainstream, and a powerful historical mainstream with considerable advantages over the barren secular one. The complete collapse of the well-armed Iraqi Army in the face of the outnumbered, outgunned ISIS forces despite its material advantages is an apt metaphor for the way in which Western secularism now finds itself in full-fledged retreat before the advance of global Islam.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-18T08:31:00+00:00"
}