{
  "url": "https://voxday.net/2014/06/11/a-grand-strategic-failure/",
  "scraped_at": "2025-12-16T12:17:05.695018",
  "title": "A grand strategic failure",
  "date_display": "June 11, 2014",
  "date_iso": "2014-06-11T08:57:00+00:00",
  "date_from_url": "2014-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Back in 2004, I pointed out that there was no possibility of long-term success for the neocons in Iraq. Now, <a href=\"http://www.nytimes.com/2014/06/11/world/middleeast/militants-in-mosul.html?hp\">with the fall of Iraq’s second largest city</a>, it is only a matter of time before Baghdad is taken and the utter failure of the entire neocon grand strategy is apparent to everyone.</p><blockquote class=\"tr_bq\"><p> Sunni militants spilling over the border from Syria on Tuesday seized control of the northern city of Mosul, Iraq’s second largest, in the most stunning success yet in a rapidly widening insurgency that threatens to drag the region into war.</p><p>Having consolidated control over Sunni-dominated Nineveh Province, armed gunmen were heading on the main road to Baghdad, Iraqi officials said, and had already taken over parts of Salahuddin Province. Thousands of civilians fled south toward Baghdad and east toward the autonomous region of Kurdistan, where security is maintained by a fiercely loyal army, the pesh merga.</p><p>The Iraqi Army apparently crumbled in the face of the militant assault, as soldiers dropped their weapons, shed their uniforms for civilian clothes and blended in with the fleeing masses. The militants freed thousands of prisoners and took over military bases, police stations, banks and provincial headquarters, before raising the black flag of the jihadi group Islamic State of Iraq and Syria over public buildings. The bodies of soldiers, police officers and civilians lay scattered in the streets….</p><p>The swift capture of large areas of the city by militants aligned with<br> the Islamic State of Iraq and Syria represented a climactic moment on a<br> long trajectory of Iraq’s unraveling since the withdrawal of American<br> forces at the end of 2011.</br></br></br></p></blockquote><p>As the Romans knew, if you’re not going to colonize a conquered territory, the correct strategy is to go in hard, break things and kill people, then immediately leave. Repeat as needed.</p><p>Ten years ago, I was correct about this. Ten years from now, it will be seen that those who demanded Reconquista 2.0 in the West were correct too. Unlike the tango, wars and invasions only require the participation of a single party.</p><p>The fall of Mosul also shows the Potemkin nature of the government authorities. As soon as a few committed militants with guns appear on the scene, the facade of omnipotent government power promptly collapses. In recent weeks, we’ve seen this everywhere from the USA to Ukraine and Iraq. The ironic thing is that what is being described as “a foreign invasion of Iraq” is a considerably smaller-scale invasion than the one taking place in the southern USA right now.</p></div>",
  "content_text": "Back in 2004, I pointed out that there was no possibility of long-term success for the neocons in Iraq. Now,\nwith the fall of Iraq’s second largest city\n, it is only a matter of time before Baghdad is taken and the utter failure of the entire neocon grand strategy is apparent to everyone.\nSunni militants spilling over the border from Syria on Tuesday seized control of the northern city of Mosul, Iraq’s second largest, in the most stunning success yet in a rapidly widening insurgency that threatens to drag the region into war.\nHaving consolidated control over Sunni-dominated Nineveh Province, armed gunmen were heading on the main road to Baghdad, Iraqi officials said, and had already taken over parts of Salahuddin Province. Thousands of civilians fled south toward Baghdad and east toward the autonomous region of Kurdistan, where security is maintained by a fiercely loyal army, the pesh merga.\nThe Iraqi Army apparently crumbled in the face of the militant assault, as soldiers dropped their weapons, shed their uniforms for civilian clothes and blended in with the fleeing masses. The militants freed thousands of prisoners and took over military bases, police stations, banks and provincial headquarters, before raising the black flag of the jihadi group Islamic State of Iraq and Syria over public buildings. The bodies of soldiers, police officers and civilians lay scattered in the streets….\nThe swift capture of large areas of the city by militants aligned with\nthe Islamic State of Iraq and Syria represented a climactic moment on a\nlong trajectory of Iraq’s unraveling since the withdrawal of American\nforces at the end of 2011.\nAs the Romans knew, if you’re not going to colonize a conquered territory, the correct strategy is to go in hard, break things and kill people, then immediately leave. Repeat as needed.\nTen years ago, I was correct about this. Ten years from now, it will be seen that those who demanded Reconquista 2.0 in the West were correct too. Unlike the tango, wars and invasions only require the participation of a single party.\nThe fall of Mosul also shows the Potemkin nature of the government authorities. As soon as a few committed militants with guns appear on the scene, the facade of omnipotent government power promptly collapses. In recent weeks, we’ve seen this everywhere from the USA to Ukraine and Iraq. The ironic thing is that what is being described as “a foreign invasion of Iraq” is a considerably smaller-scale invasion than the one taking place in the southern USA right now.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-11T07:57:00+00:00"
}