{
  "url": "https://voxday.net/2014/06/14/a-past-sfwa-resignation/",
  "scraped_at": "2025-12-16T12:17:25.241778",
  "title": "A past SFWA resignation",
  "date_display": "June 14, 2014",
  "date_iso": "2014-06-14T13:00:00+00:00",
  "date_from_url": "2014-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was sent this link to why <a href=\"http://www.midwinter.com/lurk/guide/031.html\">the Babylon 5 guy quit SFWA</a>:</p><blockquote class=\"tr_bq\"><p> I resigned SFWA (back before it became SFFWA) for the reasons you<br> cite, and over the whole Dramatic Nebula issue, which was for me the<br> defining moment and the proverbial straw across the equally<br> proverbial camel’s back. A number of us — me, D.C. Fontana, David Gerrold, Mike Cassutt,<br> Harlan, others — attempted to get SFWA to restore the Dramatic<br> Nebula, which had been dropped for a number of years.  In the course<br> of this, I received more abusive, vitriolic, hateful pieces of mail<br> and email than I can begin to describe to you.  It rivals or exceeds<br> *anything* ever sent to me in any flame war.  All from other SFWA<br> members.  One quote I remember vividly is emblematic of the whole: “I<br> work my ass off writing for pennies a word, while all you hacks in TV<br> churn out crap for thousands of dollars a page.  You and your LA<br> buddies will never get a Dramatic Nebula as long as I’m alive.”</br></br></br></br></br></br></br></br></br></br></br></br></p><p>And that was the nicest letter I got. It was explained to me, in mail, email and the SFWA journal, that<br> scriptwriting wasn’t really *writing*, it was just typing.  That TV<br> writers weren’t really writers.  That you can’t read a script unless<br> you’re trained, so you can’t vote on it.  That since TV/film is often<br> a collaborative form, you don’t know who contributed what, so how can<br> you give a nebula?  And there’s George Martin’s argument, that SFWA<br> should give Dramatic Nebulas to scriptwriters when WGA allows prose<br> writers to join.</br></br></br></br></br></br></br></p><p>And the responses to this…it *is* writing, you *can* read the<br> script easily, it’s just the margins that are different.  Editors<br> often contribute structure and ideas and other material to the books<br> they edit, but I don’t see that stopping regular nebulas.  And SFWA<br> was built around a particular *genre*, anything in that genre is or<br> should be acceptable; WGA is built around *form*, the script, and any<br> genre within that form is acceptable.  We’re talking apples and<br> oranges here.</br></br></br></br></br></br></br></p><p>I was even willing to remove myself from all future DN consideration<br> to remove the notion that I was doing this to get one myself.  It was<br> the principle, for one vital reason:</br></br></p><p>At that time, SFWA allowed scripts to qualify you for membership in<br> SFWA.  Scripts were fine as far as SFWA was concerned as long as it<br> brought in more in the way of membership dues.  If it brought money<br> INTO SFWA, then it was writing, and qualified script writers to join<br> SFWA.  But when it came time to give out the dramatic nebula…nope,<br> suddenly it ain’t writing no more.</br></br></br></br></br></p><p>It was a clear contradiction, and a bald-faced double-standard.<br> Hypocrisy at its most blatant. So finally, when the move to restore the Dramatic Nebula was vetoed,<br> I quit.  The final irony being this: over the 10 years or so I’d been<br> a member, I’d written maybe 7 or 8 letters to be published in the<br> SFWA Journal, which appears quarterly or monthly, I forget now.<br> There were (and are) people who had something in almost every issue,<br> often for pages at a time.  I sent my letter of resignation to the<br> Journal, and it has never to this day been printed.  Because once it<br> became clear that I was no longer going to continue paying dues<br> (though I was still a member at the time of the letter, and for<br> several months thereafter, until my prior payment ran out), they<br> really had no interest in hearing anything from a scriptwriter.  They<br> later tried the excuse that it was too long, but it was exactly the<br> same length as the majority of letters that appeared in the Journal.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>In fighting for the rights of script-members of SFWA on  the DN<br> issue, and the perception of scriptwriters in general, I was<br> insulted, abused, targeted, slandered, ridiculed, threatened and<br> harrassed.  While there are many fine individuals who belong to the<br> group, as an organization is is provincial and small minded and<br> insecure and jealous.  Any John Norman GOR novel would theoretically<br> be eligible for a Nebula, but 12 Monkeys would not.  If an SF novel<br> sells 35,000 copies, it’s a great thing; 100,000 is a *terrific*<br> thing, much ballyhooed by the SF establishment.  B5 has a hardcore<br> audience of between 10 and 15 *million* people.</br></br></br></br></br></br></br></br></br></p><p>So bottom-line…yeah, I left SFWA because I got tired of the<br> contempt the organization and many of its members held (and still<br> hold) for scriptwriters.  When it came time to accept the Science<br> Fiction Weekly’s award for “The Coming of Shadows,” I stepped into<br> the SFFWA suite (where they were to be given out) just long enough to<br> find the guys involved, and get out again.  And the award was<br> presented out in the hallway, because I didn’t want it to happen<br> there.  As I told the organizer, I wouldn’t go into the SFFWA suite<br> for this if I were dying of lung cancer and they were offering free<br> chemotherapy at the door.</br></br></br></br></br></br></br></br></br></p></blockquote><p>And here I thought I was supposed to be the first SFWA member to ever attack another member in an official SFWA channel. In any event, the organization is clearly not a place for people with principles. And how typical is it of the cowardly little freaks that they didn’t print his letter of resignation. They still haven’t announced my expulsion either.</p><p>Now the freaks aren’t being snobbish about scriptwriters; they’re too busy trying to become scriptwriters themselves. They content themselves now with trying to look down on self-publishers, who they also insist are not real writers. </p></div>",
  "content_text": "I was sent this link to why\nthe Babylon 5 guy quit SFWA\n:\nI resigned SFWA (back before it became SFFWA) for the reasons you\ncite, and over the whole Dramatic Nebula issue, which was for me the\ndefining moment and the proverbial straw across the equally\nproverbial camel’s back. A number of us — me, D.C. Fontana, David Gerrold, Mike Cassutt,\nHarlan, others — attempted to get SFWA to restore the Dramatic\nNebula, which had been dropped for a number of years.  In the course\nof this, I received more abusive, vitriolic, hateful pieces of mail\nand email than I can begin to describe to you.  It rivals or exceeds\n*anything* ever sent to me in any flame war.  All from other SFWA\nmembers.  One quote I remember vividly is emblematic of the whole: “I\nwork my ass off writing for pennies a word, while all you hacks in TV\nchurn out crap for thousands of dollars a page.  You and your LA\nbuddies will never get a Dramatic Nebula as long as I’m alive.”\nAnd that was the nicest letter I got. It was explained to me, in mail, email and the SFWA journal, that\nscriptwriting wasn’t really *writing*, it was just typing.  That TV\nwriters weren’t really writers.  That you can’t read a script unless\nyou’re trained, so you can’t vote on it.  That since TV/film is often\na collaborative form, you don’t know who contributed what, so how can\nyou give a nebula?  And there’s George Martin’s argument, that SFWA\nshould give Dramatic Nebulas to scriptwriters when WGA allows prose\nwriters to join.\nAnd the responses to this…it *is* writing, you *can* read the\nscript easily, it’s just the margins that are different.  Editors\noften contribute structure and ideas and other material to the books\nthey edit, but I don’t see that stopping regular nebulas.  And SFWA\nwas built around a particular *genre*, anything in that genre is or\nshould be acceptable; WGA is built around *form*, the script, and any\ngenre within that form is acceptable.  We’re talking apples and\noranges here.\nI was even willing to remove myself from all future DN consideration\nto remove the notion that I was doing this to get one myself.  It was\nthe principle, for one vital reason:\nAt that time, SFWA allowed scripts to qualify you for membership in\nSFWA.  Scripts were fine as far as SFWA was concerned as long as it\nbrought in more in the way of membership dues.  If it brought money\nINTO SFWA, then it was writing, and qualified script writers to join\nSFWA.  But when it came time to give out the dramatic nebula…nope,\nsuddenly it ain’t writing no more.\nIt was a clear contradiction, and a bald-faced double-standard.\nHypocrisy at its most blatant. So finally, when the move to restore the Dramatic Nebula was vetoed,\nI quit.  The final irony being this: over the 10 years or so I’d been\na member, I’d written maybe 7 or 8 letters to be published in the\nSFWA Journal, which appears quarterly or monthly, I forget now.\nThere were (and are) people who had something in almost every issue,\noften for pages at a time.  I sent my letter of resignation to the\nJournal, and it has never to this day been printed.  Because once it\nbecame clear that I was no longer going to continue paying dues\n(though I was still a member at the time of the letter, and for\nseveral months thereafter, until my prior payment ran out), they\nreally had no interest in hearing anything from a scriptwriter.  They\nlater tried the excuse that it was too long, but it was exactly the\nsame length as the majority of letters that appeared in the Journal.\nIn fighting for the rights of script-members of SFWA on  the DN\nissue, and the perception of scriptwriters in general, I was\ninsulted, abused, targeted, slandered, ridiculed, threatened and\nharrassed.  While there are many fine individuals who belong to the\ngroup, as an organization is is provincial and small minded and\ninsecure and jealous.  Any John Norman GOR novel would theoretically\nbe eligible for a Nebula, but 12 Monkeys would not.  If an SF novel\nsells 35,000 copies, it’s a great thing; 100,000 is a *terrific*\nthing, much ballyhooed by the SF establishment.  B5 has a hardcore\naudience of between 10 and 15 *million* people.\nSo bottom-line…yeah, I left SFWA because I got tired of the\ncontempt the organization and many of its members held (and still\nhold) for scriptwriters.  When it came time to accept the Science\nFiction Weekly’s award for “The Coming of Shadows,” I stepped into\nthe SFFWA suite (where they were to be given out) just long enough to\nfind the guys involved, and get out again.  And the award was\npresented out in the hallway, because I didn’t want it to happen\nthere.  As I told the organizer, I wouldn’t go into the SFFWA suite\nfor this if I were dying of lung cancer and they were offering free\nchemotherapy at the door.\nAnd here I thought I was supposed to be the first SFWA member to ever attack another member in an official SFWA channel. In any event, the organization is clearly not a place for people with principles. And how typical is it of the cowardly little freaks that they didn’t print his letter of resignation. They still haven’t announced my expulsion either.\nNow the freaks aren’t being snobbish about scriptwriters; they’re too busy trying to become scriptwriters themselves. They content themselves now with trying to look down on self-publishers, who they also insist are not real writers.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-14T12:00:00+00:00"
}