{
  "url": "https://voxday.net/2014/06/08/an-angry-terror/",
  "scraped_at": "2025-12-16T12:16:45.317120",
  "title": "An angry terror",
  "date_display": "June 8, 2014",
  "date_iso": "2014-06-08T13:30:00+00:00",
  "date_from_url": "2014-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears we may need <a href=\"https://twitter.com/humidpress/status/475477175894679552\">to petition the White House</a> to classify angry black women as a terrorist movement. I tend to suspect President Obama would be more than happy to sign it himself.</p><blockquote class=\"tr_bq\"><p> N. K. Jemisin ‏@nkjemisin 7h<br> They’re already watching my group</br></p><p>N. K. Jemisin @nkjemisin  ·  Jun 6<br> Everybody’s got a bomb</br></p><p>N. K. Jemisin @nkjemisin  ·  Jun 6<br> So I have to make choices. Burning bridges is unavoidable; whose gets set on fire first?</br></p><p>N. K. Jemisin @nkjemisin  ·  Jun 6<br> Just offered to kill one of my oldest friends</br></p><p>N. K. Jemisin @nkjemisin  ·  May 28<br> It needs to be made clear that the privileging of straight white male voices at the exp of all others won’t be tolerated.</br></p><p>N. K. Jemisin @nkjemisin  ·  May 15<br> We kinda need to see some shit blow up.</br></p><p>N. K. Jemisin @nkjemisin  ·  May 15<br> One of my co-workers just came into my office, took one look at my face, and walked out. #RestingKILLFace</br></p></blockquote><p>It is not surprising that Jemisin is against the rights of men. She is, after all, a faux equalitarian, a race-baiting coward who tries to hide behind the idea that she is hated for her genetics and/or her sex rather than for her ideas and her actions. There is no reason to despise the woman for her melanin content, especially not when there is already so much to despise about her <a href=\"http://www.milobookclub.com/2013/06/13/a-black-female-fantasis/\">dishonesty</a>, her emotional incontinence, her pinkshirted progressive neofascism, her overrated fiction, her <a href=\"http://nkjemisin.com/2012/09/things-people-need-to-understand-issue-223-2/\">slander of the living and the dead</a>, and her avowed opposition to legal self-defense as well as the Constitutional rights to a) free speech, b) free association, and c) bearing arms.</p><p>Consider her bizarre concept of “harassment” and keep in mind that this is the very same woman who was “harassing” me five years before I had ever even heard of her:</p><blockquote class=\"tr_bq\"><p> N. K. Jemisin ‏@nkjemisin Jun 6<br> I can’t do – not to my fullest – if I have to constantly interact with people who *hate* me, not b/c of my actions but who I am.+</br></p><p>Vox Day ‏@voxday 3h<br> @nkjemisin Never fear, Ms Fully Savage and Proud of It, we only despise you for your actions. Just like the other pinkshirted fascists.</br></p><p>N. K. Jemisin ‏@nkjemisin 28m<br> @voxday Oh, look, fresh harassment. Must have missed this handle of yours. Welp, blocking you now. Don’t talk to me again.</br></p></blockquote><p>Her courage never ceases to inspire! And I never cease to find it satisfying that so many of those who attack me unprovoked end up running away, pretending I don’t exist, and desperately wishing that I’d never mention them again. After more than 10 years of this blog, you’d think people would have learned better by now, but there is always some brave new progressive champion who can’t resist the urge to stick his hand into the woodchipper.</p></div>",
  "content_text": "It appears we may need\nto petition the White House\nto classify angry black women as a terrorist movement. I tend to suspect President Obama would be more than happy to sign it himself.\nN. K. Jemisin ‏@nkjemisin 7h\nThey’re already watching my group\nN. K. Jemisin @nkjemisin  ·  Jun 6\nEverybody’s got a bomb\nN. K. Jemisin @nkjemisin  ·  Jun 6\nSo I have to make choices. Burning bridges is unavoidable; whose gets set on fire first?\nN. K. Jemisin @nkjemisin  ·  Jun 6\nJust offered to kill one of my oldest friends\nN. K. Jemisin @nkjemisin  ·  May 28\nIt needs to be made clear that the privileging of straight white male voices at the exp of all others won’t be tolerated.\nN. K. Jemisin @nkjemisin  ·  May 15\nWe kinda need to see some shit blow up.\nN. K. Jemisin @nkjemisin  ·  May 15\nOne of my co-workers just came into my office, took one look at my face, and walked out. #RestingKILLFace\nIt is not surprising that Jemisin is against the rights of men. She is, after all, a faux equalitarian, a race-baiting coward who tries to hide behind the idea that she is hated for her genetics and/or her sex rather than for her ideas and her actions. There is no reason to despise the woman for her melanin content, especially not when there is already so much to despise about her\ndishonesty\n, her emotional incontinence, her pinkshirted progressive neofascism, her overrated fiction, her\nslander of the living and the dead\n, and her avowed opposition to legal self-defense as well as the Constitutional rights to a) free speech, b) free association, and c) bearing arms.\nConsider her bizarre concept of “harassment” and keep in mind that this is the very same woman who was “harassing” me five years before I had ever even heard of her:\nN. K. Jemisin ‏@nkjemisin Jun 6\nI can’t do – not to my fullest – if I have to constantly interact with people who *hate* me, not b/c of my actions but who I am.+\nVox Day ‏@voxday 3h\n@nkjemisin Never fear, Ms Fully Savage and Proud of It, we only despise you for your actions. Just like the other pinkshirted fascists.\nN. K. Jemisin ‏@nkjemisin 28m\n@voxday Oh, look, fresh harassment. Must have missed this handle of yours. Welp, blocking you now. Don’t talk to me again.\nHer courage never ceases to inspire! And I never cease to find it satisfying that so many of those who attack me unprovoked end up running away, pretending I don’t exist, and desperately wishing that I’d never mention them again. After more than 10 years of this blog, you’d think people would have learned better by now, but there is always some brave new progressive champion who can’t resist the urge to stick his hand into the woodchipper.",
  "tags": [
    "freakshow",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-08T12:30:00+00:00"
}