{
  "url": "https://voxday.net/2014/06/28/an-apt-simile/",
  "scraped_at": "2025-12-16T12:19:03.445842",
  "title": "An apt simile",
  "date_display": "June 28, 2014",
  "date_iso": "2014-06-28T21:27:00+00:00",
  "date_from_url": "2014-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure Damien understood <a href=\"http://damiengwalter.com/2014/06/27/i-thought-that-my-mothers-fans-would-be-angry-with-me/#comment-10211\">quite how funny this was</a>, if one presumes that he is referring to Larry’s fans and the Dread Ilk:</p><blockquote class=\"tr_bq\"><p> In the social media era, we lend authors immediate credibility when we follow them. I’m thinking of some of our right wing friends here who deploy their fans like paramilitary forces. Strange times!</p></blockquote><p>I have to admit, I did laugh at that one. What the Left simply can’t seem to understand is that when they attack an author <i>for his beliefs</i>, they are providing motivation to all of his fans who happen to share those beliefs, because the fans uunderstand that it is not the author, but their own beliefs that are under attack. The author is merely the symbol.</p><p>Also, our fans tend to be intrinsically more capable than those of our left wing counterparts. That’s not pandering or anything, it’s just that theirs don’t tend to be good for much more than fawning, favoriting tweets, feigning outrage, and pretending to donate money they don’t have.</p></div>",
  "content_text": "I’m not sure Damien understood\nquite how funny this was\n, if one presumes that he is referring to Larry’s fans and the Dread Ilk:\nIn the social media era, we lend authors immediate credibility when we follow them. I’m thinking of some of our right wing friends here who deploy their fans like paramilitary forces. Strange times!\nI have to admit, I did laugh at that one. What the Left simply can’t seem to understand is that when they attack an author\nfor his beliefs\n, they are providing motivation to all of his fans who happen to share those beliefs, because the fans uunderstand that it is not the author, but their own beliefs that are under attack. The author is merely the symbol.\nAlso, our fans tend to be intrinsically more capable than those of our left wing counterparts. That’s not pandering or anything, it’s just that theirs don’t tend to be good for much more than fawning, favoriting tweets, feigning outrage, and pretending to donate money they don’t have.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-28T20:27:00+00:00"
}