{
  "url": "https://voxday.net/2014/06/07/another-science-fiction-fraud/",
  "scraped_at": "2025-12-16T12:16:41.634566",
  "title": "Another science fiction fraud?",
  "date_display": "June 7, 2014",
  "date_iso": "2014-06-07T18:43:00+00:00",
  "date_from_url": "2014-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I quite like David Brin’s <i>Uplift Saga</i>, particularly <i>Startide Rising</i>. It is innovative, insightful, and original. While it does betray a few hints of what would, in many later SF writers’ less-capable hands, blossom into full-blown political correctness, such strands do not detract from the story. Unlike the award-winning pinkshirts of today, Dr. Brin never sacrifices the story for his ideology.</p><p>There is no question that David Brin is an accomplished science fiction writer. His various awards are well-merited. However, it is apparent that in the course of debate, he likes to throw his weight around as a credentialed scientist, which one gentleman who has had a run-in or two with him is now <a href=\"http://stoppinginflyover.blogspot.ch/2014/06/a-few-questions-for-david-brin.html\">calling into question</a>:</p><blockquote class=\"tr_bq\"><p> You have repeatedly used your qualifications as a scientist to denigrate those who disagree with you, particularly on this issue…. If you are a scientist, where’s your scientific publications?  Your public sources list 6 papers in the scientific field in which you trained.  Based on your published Bio, three-to-four were from your Master’s, and two don’t really count, since they constitute a two-part paper authored by your Advisor with you in the “courtesy student author” slot. </p><p>You have one main publication obviously from your PhD dissertation, but absolutely nothing for the next 8 years – where was your scholarly output as a post-graduate professional scientist?</p><p>You have only four scholarly papers since your PhD – one was SETI, three in fields other than what you trained, and one of those clearly marked “speculation” – where is there any evidence of you doing science?</p><p>All of your academic positions are for “instructor,” “post-doctoral fellow,” “associate,” “visiting scholar.” Nowhere do you list any faculty or academic scientific positions, neither do you list any actual scientific jobs – so how are you a practicing scientist without working in science?</p><p>You have 4 scientific publications in over 30 years, and no publications relevant to your scientific training in over 25 years.  How is it that you can currently claim to be a scientist?</p></blockquote><p>If what scientists do is science, and if it is true that Dr. Brin has published no scientific papers in more than 25 years, then David Brin is clearly no longer a scientist and should not be attempting to claim that he is, Wikipedia’s description of him as “an American scientist and award-winning author of science fiction” notwithstanding. In such a case, a description as an ex-scientist or a former scientist would be more apt.</p><p>Especially given that one of his three featured “science” publications <a href=\"http://www.researchgate.net/profile/David_Brin\">on ResearchGate</a> is “<i>Q&amp;A: David Brin on writing fiction. Interview by Nicola Jones</i>“.</p><p>If the writer has his facts straight and Dr. Brin has been appealing to his scientific credentials when he is no more actively involved in science than any other SF writer with an MA in English, that would be pathetic. For example, the astrophysicist who authored our recently published <b><a href=\"http://www.castaliahouse.com/downloads/category/homeschool/\"><i>Astronomy and Astrophysics</i></a></b> curriculum has <a href=\"http://www.researchgate.net/profile/Sarah_Salviander\">more than twice as many</a> scientific publications, more Impact Points, and is more than two decades younger than Dr. Brin. I was the founder of an award-winning, 3x Billboard-charting techno band signed to TVT but I do not describe myself as a professional musician, not when I haven’t set foot in a recording studio in 22 years.</p><p>Now, to be clear, I am not declaring that David Brin has, like John Scalzi, committed self-inflating biography fraud. We have not yet heard Dr. Brin’s side of the story; for all I know, he has published scores of landmark papers and is actively working on some ground-breaking science today. We would owe him the benefit of the doubt even if we did not enjoy his fiction. However, these are serious charges of misrepresentation, especially the charge that Dr. Brin has “lied about [his] affiliation with Caltech” and Dr. Brin has a responsibility to answer them, especially if he is the dedicated scientist he portrays himself to be.</p><p>UPDATE: Dr. Brin responds:</p><blockquote class=\"tr_bq\"><p> A brief, measured response.</p><p>1) When people engage in a public<br> pillorying, it is common courtesy to let the target know.  Instead of<br> being offered collegial opportunities for response, I learned of this<br> blind-side assault fifth hand. The first order conclusion is that this<br> is not a person who was well-raised.</br></br></br></br></p><p>2) I admit freelance is an<br> easier life than the academic trenches.  I have no need to burnish a<br> vita.  Getting to be a sniff-everywhere scientific generalist and<br> cross-fertilizer is fun and fits my personality more than specialization<br> did. Sorry.</br></br></br></br></p><p>3)  The Transparent Society is one of the only<br> public policy books from the 20th Century still in print, and selling<br> more every year.  I now fly all over the world on this topic. Open it.</br></br></p><p>4)<br> Beyond fiction and nonfiction, I’m a speaker and consultant on<br> sci-technological trends. I’m on the board of advisors of NASA’s<br> Innovative and Advanced Concepts (NIAC) group as well as corporations<br> and intelligence agencies.  So far this year, I consulted in the<br> Pentagon, for MITRE Corp, ODNI, the Atlantic Council, Google and many<br> others. Funny, they keep asking to run concepts by me.  But I suppose<br> this blogger would do things differently.  Close your eyes and picture<br> him in charge.</br></br></br></br></br></br></br></br></p><p>4) I’ll not discuss here my early work in<br> astrophysics and optics, or my even-earlier career as a microelectronics<br> engineer (helping to invent CCDs.) But over the last decade I’ve had<br> papers in (e.g.) evolutionary biology journals and the volume<br> PATHOLOGICAL ALTRUISM. I presented new ideas at the National Institute<br> on Drugs and Addiction and have extensive patents. I’ll likely moderate a<br> SETI panel at the AAAS in February.  And funny, the University of<br> California named me a Distinguished Alumnus, instead of asking for their<br> PhD back.  What fools</br></br></br></br></br></br></br></br></p><p>5) I suppose I should update my<br> publications list, and find and correct sites that mistakenly show me<br> now connected to my alma mater Caltech. But in fact, I… do… not… care…<br> much.  I do have an official scholar position at UCSD. I guess I should<br> note that.  Some time.</br></br></br></br></p><p>Sure, my role in science tends to be as<br> generalist/cross-fertilizer/consultant/gadfly/reviewer, more often than<br> via direct publication in specialized topics. But, scientific colleagues<br> make liberal use of me and that is satisfying enough. Getting to hang<br> with and exchange ideas with some of the best minds on Earth, my sole<br> regret is the time I just spent answering bona fide ninnies.</br></br></br></br></br></p><p>Come<br> on by http://davidbrin.blogspot.com/ and meet a better community.<br> Better yet, keep exploring.  These are great times for those with free<br> minds.</br></br></br></p><p>With cordial regards,</p><p>David Brin </p></blockquote><p>I have to admit, I am more than a little puzzled that Dr. Brin would consider drawing his attention to some questions that I’m told were posted to his own Facebook page is either a public pillorying or a failure to offer an opportunity for a response.</p><p>Speaking only for myself, I’m satisfied with his response, as I think there is considerably more to science than simply publishing papers and there is no reason to conclude he is an ex-scientist or that he is, scientifically speaking, pining for the fjords. I think it’s impressive that he has gotten involved in more practical engineering applications; as regular readers here know, I regard them as the only truly reliable science. That being said, his tone and his reference to “bona fide ninnies” does tend to indicate that it is not far-fetched to believe that he might occasionally be inclined to appeal to his credentials in lieu of actually presenting a valid argument when questioned by someone he deems, rightly or wrongly, his inferior.</p><p>After all, he freely admitted that his publications list is incomplete and that the ResearchGate assertion of a professional connection to Caltech is incorrect as well. If he thinks asking obviously legitimate questions somehow makes someone a ninny, well, I would say that insulting people simply because they catch you out is unwise. Substantive criticism should always be appreciated. My conclusion is that Dr. Brin is not a fraud, but is overly accustomed to deferential treatment and therefore occasionally finds himself involved in social media debates in which he is not truly prepared to engage.</p><p>No one is above being questioned. I answer questions I find painfully stupid on a regular basis. And while Dr. Brin may have found the questions of his critic to be stupid or irritating, I have to commend him for answering them directly.</p></div>",
  "content_text": "I quite like David Brin’s\nUplift Saga\n, particularly\nStartide Rising\n. It is innovative, insightful, and original. While it does betray a few hints of what would, in many later SF writers’ less-capable hands, blossom into full-blown political correctness, such strands do not detract from the story. Unlike the award-winning pinkshirts of today, Dr. Brin never sacrifices the story for his ideology.\nThere is no question that David Brin is an accomplished science fiction writer. His various awards are well-merited. However, it is apparent that in the course of debate, he likes to throw his weight around as a credentialed scientist, which one gentleman who has had a run-in or two with him is now\ncalling into question\n:\nYou have repeatedly used your qualifications as a scientist to denigrate those who disagree with you, particularly on this issue…. If you are a scientist, where’s your scientific publications?  Your public sources list 6 papers in the scientific field in which you trained.  Based on your published Bio, three-to-four were from your Master’s, and two don’t really count, since they constitute a two-part paper authored by your Advisor with you in the “courtesy student author” slot.\nYou have one main publication obviously from your PhD dissertation, but absolutely nothing for the next 8 years – where was your scholarly output as a post-graduate professional scientist?\nYou have only four scholarly papers since your PhD – one was SETI, three in fields other than what you trained, and one of those clearly marked “speculation” – where is there any evidence of you doing science?\nAll of your academic positions are for “instructor,” “post-doctoral fellow,” “associate,” “visiting scholar.” Nowhere do you list any faculty or academic scientific positions, neither do you list any actual scientific jobs – so how are you a practicing scientist without working in science?\nYou have 4 scientific publications in over 30 years, and no publications relevant to your scientific training in over 25 years.  How is it that you can currently claim to be a scientist?\nIf what scientists do is science, and if it is true that Dr. Brin has published no scientific papers in more than 25 years, then David Brin is clearly no longer a scientist and should not be attempting to claim that he is, Wikipedia’s description of him as “an American scientist and award-winning author of science fiction” notwithstanding. In such a case, a description as an ex-scientist or a former scientist would be more apt.\nEspecially given that one of his three featured “science” publications\non ResearchGate\nis “\nQ&A: David Brin on writing fiction. Interview by Nicola Jones\n“.\nIf the writer has his facts straight and Dr. Brin has been appealing to his scientific credentials when he is no more actively involved in science than any other SF writer with an MA in English, that would be pathetic. For example, the astrophysicist who authored our recently published\nAstronomy and Astrophysics\ncurriculum has\nmore than twice as many\nscientific publications, more Impact Points, and is more than two decades younger than Dr. Brin. I was the founder of an award-winning, 3x Billboard-charting techno band signed to TVT but I do not describe myself as a professional musician, not when I haven’t set foot in a recording studio in 22 years.\nNow, to be clear, I am not declaring that David Brin has, like John Scalzi, committed self-inflating biography fraud. We have not yet heard Dr. Brin’s side of the story; for all I know, he has published scores of landmark papers and is actively working on some ground-breaking science today. We would owe him the benefit of the doubt even if we did not enjoy his fiction. However, these are serious charges of misrepresentation, especially the charge that Dr. Brin has “lied about [his] affiliation with Caltech” and Dr. Brin has a responsibility to answer them, especially if he is the dedicated scientist he portrays himself to be.\nUPDATE: Dr. Brin responds:\nA brief, measured response.\n1) When people engage in a public\npillorying, it is common courtesy to let the target know.  Instead of\nbeing offered collegial opportunities for response, I learned of this\nblind-side assault fifth hand. The first order conclusion is that this\nis not a person who was well-raised.\n2) I admit freelance is an\neasier life than the academic trenches.  I have no need to burnish a\nvita.  Getting to be a sniff-everywhere scientific generalist and\ncross-fertilizer is fun and fits my personality more than specialization\ndid. Sorry.\n3)  The Transparent Society is one of the only\npublic policy books from the 20th Century still in print, and selling\nmore every year.  I now fly all over the world on this topic. Open it.\n4)\nBeyond fiction and nonfiction, I’m a speaker and consultant on\nsci-technological trends. I’m on the board of advisors of NASA’s\nInnovative and Advanced Concepts (NIAC) group as well as corporations\nand intelligence agencies.  So far this year, I consulted in the\nPentagon, for MITRE Corp, ODNI, the Atlantic Council, Google and many\nothers. Funny, they keep asking to run concepts by me.  But I suppose\nthis blogger would do things differently.  Close your eyes and picture\nhim in charge.\n4) I’ll not discuss here my early work in\nastrophysics and optics, or my even-earlier career as a microelectronics\nengineer (helping to invent CCDs.) But over the last decade I’ve had\npapers in (e.g.) evolutionary biology journals and the volume\nPATHOLOGICAL ALTRUISM. I presented new ideas at the National Institute\non Drugs and Addiction and have extensive patents. I’ll likely moderate a\nSETI panel at the AAAS in February.  And funny, the University of\nCalifornia named me a Distinguished Alumnus, instead of asking for their\nPhD back.  What fools\n5) I suppose I should update my\npublications list, and find and correct sites that mistakenly show me\nnow connected to my alma mater Caltech. But in fact, I… do… not… care…\nmuch.  I do have an official scholar position at UCSD. I guess I should\nnote that.  Some time.\nSure, my role in science tends to be as\ngeneralist/cross-fertilizer/consultant/gadfly/reviewer, more often than\nvia direct publication in specialized topics. But, scientific colleagues\nmake liberal use of me and that is satisfying enough. Getting to hang\nwith and exchange ideas with some of the best minds on Earth, my sole\nregret is the time I just spent answering bona fide ninnies.\nCome\non by http://davidbrin.blogspot.com/ and meet a better community.\nBetter yet, keep exploring.  These are great times for those with free\nminds.\nWith cordial regards,\nDavid Brin\nI have to admit, I am more than a little puzzled that Dr. Brin would consider drawing his attention to some questions that I’m told were posted to his own Facebook page is either a public pillorying or a failure to offer an opportunity for a response.\nSpeaking only for myself, I’m satisfied with his response, as I think there is considerably more to science than simply publishing papers and there is no reason to conclude he is an ex-scientist or that he is, scientifically speaking, pining for the fjords. I think it’s impressive that he has gotten involved in more practical engineering applications; as regular readers here know, I regard them as the only truly reliable science. That being said, his tone and his reference to “bona fide ninnies” does tend to indicate that it is not far-fetched to believe that he might occasionally be inclined to appeal to his credentials in lieu of actually presenting a valid argument when questioned by someone he deems, rightly or wrongly, his inferior.\nAfter all, he freely admitted that his publications list is incomplete and that the ResearchGate assertion of a professional connection to Caltech is incorrect as well. If he thinks asking obviously legitimate questions somehow makes someone a ninny, well, I would say that insulting people simply because they catch you out is unwise. Substantive criticism should always be appreciated. My conclusion is that Dr. Brin is not a fraud, but is overly accustomed to deferential treatment and therefore occasionally finds himself involved in social media debates in which he is not truly prepared to engage.\nNo one is above being questioned. I answer questions I find painfully stupid on a regular basis. And while Dr. Brin may have found the questions of his critic to be stupid or irritating, I have to commend him for answering them directly.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-07T17:43:00+00:00"
}