{
  "url": "https://voxday.net/2014/06/03/another-whack-of-tetsubo/",
  "scraped_at": "2025-12-16T12:16:13.607079",
  "title": "Another whack of the Tetsubo",
  "date_display": "June 3, 2014",
  "date_iso": "2014-06-03T13:00:00+00:00",
  "date_from_url": "2014-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m beginning to get the impression that <a href=\"http://monsterhunternation.com/2014/06/03/fisking-the-guardians-village-idiot-part-2/\">Larry is underwhelmed by the call</a> to repentance, recantation, and self-abasement:<i> </i></p><blockquote class=\"tr_bq\"><p> <i>Secondly, and this is going to be much more damaging for him longterm, he allowed himself to become very closely associated to Vox Day in the process. Ultimately people do judge others by their associations, and both Larry Correia and John C Wright have made very public declarations of support for Day, that I fear both will deeply regret in the long run.</i></p><p>One of the tactics I’ve seen them take is conflating my views with those of Vox Day. It doesn’t matter that I’ve disagreed with the man, and I’ve debated with him several times, but they sure love linking me to Vox. See, unlike me, they can actually find a couple of comments from him that they can manage to spin up some outrage over, and everybody knows righteous indignation gives libprogs super powers.</p><p>You have an issue with something Vox said, take it up with him. I did, and I found the guy to be a capable debater, and many of the insinuations about him floating around the internet were grossly exaggerated. (says the man who the Guardian has insinuated hates women and wants to keep fiction the exclusive domain of a group he doesn’t technically belong to, so I simply can’t imagine the internet exaggerating somebody’s beliefs.)</p><p>The woman Vox insulted with the infamous half-savage comment also has a long history of inflammatory racial statements, and had been throwing insults at Vox for years, but somehow she always gets a pass in these discussions about “divisiveness” (remember what I said earlier about the Ctrl H search and replace to put Jew instead of White Man in their tweets? She’s totally the best). I don’t think she likes me much either, because she gave a speech a little while ago and condemned Mr. Free Speech At All Costs… I think that’s supposed to be me, but personally I took that as a compliment, because you know, that part where I actually believe in free speech and stuff.</p><p>So I recommend a short story by somebody who made a statement they found racist? DIVISIVE! And Damien will condemn me in his newspaper. Meanwhile, an approved author writes tons of negative things about an ethnic group that it is cool to hate? Totally not divisive, and Damien will plug her in his newspaper. Now me personally, I think the concept of race is increasingly irrelevant bullshit, and I judge all humans as individuals, but I’m the International Lord of Hate.</p><p>Public declaration of support? By that Damien means I failed to join his lynch mob? Sadly I couldn’t find my jack boots in time.</p></blockquote><p>One of the International Lord of Hate’s commenters pointed out what Damien was trying, and failing, to accomplish: <i>“They want to slam Vox because he is the one nut they can’t crack, but<br> boy, if they can turn a few of his friends and supporters, that’s at<br> least along the lines of their goals.”</br></br></i></p><p>On behalf of Mr. Correia, Mr. Wright, and Mrs. Hoyt, I am offended at the idea they should be deemed any easier to crack than me. (As opposed to that notoriously soft and bendable reed, Col. Kratman, whose pastimes make Ramsay Snow’s look like embroidery.) Now, it is true that mi amigo latino has a different perspective on race than I do. I realize this may astonish white people, particularly of the SWPL variety, but we members of La Raza Cósmica do not necessarily think alike; some of us don’t even believe in the inevitability of Universópolis. Transmetachronopolis, yes. Universópolis, not so much.</p><p>As Larry says, we’ve even debated the matter in private, and while I did not convince him, I believe he did come to understand that my position is based entirely on sound genetic science and history rather than personal preferences. Since then, the publication of <i>A Troublesome Inheritance</i> by Nicholas Wade has demonstrated that my “controversial” views are entirely in line with current science and that the “Nurture not Nature” perspective is outdated and unscientific.</p><p>(<i>Nota Ironica:</i> the very concept of La Raza Cósmica is based on the idea that Darwinism was “created to validate, explain, and justify ethnic superiority and to repress others.” So, you see, this is why only fifth-racers like me “have the territorial, racial, and spiritual factors necessary to initiate the ‘universal era of humanity’.” Bow down, you colonial sons and daughters of the Old World, abase yourselves, you children of the Orient, kneel before me, you spawnlings of Darkest Africa. Bow to me, in the name of humanity!)</p><p>I love Larry. I have great respect for him. He’s the best action writer of our generation. But I don’t answer for him and he doesn’t answer for me. That’s one thing the Left will never accept: there is no guilt by association. A man can only answer for his own deeds, his own words, his own actions.</p><p>Which is one reason why Larry declined the opportunity to participate in the suggested auto-da-fe:</p><blockquote class=\"tr_bq\"><p> <i>I’m quite serious about my suggestion by the way. I think if Correia wrote publicly to support the new diversity in the genre, and apologised for any perception he was campaigning against it, that might help him a lot.</i></p><p>Apologize for the perception? Apologize for being seen as an enemy of progress? That sounds suspiciously like the apologies Stalin used to have people sign right before he shipped them off to the gulag, so in response, Beria, er, I mean Damien, here are a few of my thoughts about what it really means when a libprog demands an apology.</p><p>Rule number one. Never apologize for something that shouldn’t be apologized for. Check out all the various firings, purges, boycotts, and cancellations. Apologizing for causing their outrage is you taking responsibility for their ignorance and inability to control their own emotions. Apologizing to the perpetually outraged means they own you. You have declared yourself guilty and vulnerable to their threats. It is like negotiating with terrorists. Give into their demands and you’re just encouraging them to blow something else up.</p><p>If I was the type of mushy headed fool that would issue an apology, it wouldn’t matter anyway, because as we’ve already seen my actual words and actions mean nothing compared to the agreed upon narrative, and that narrative is that I’m guilty of pretty much every vile thing they can think of. Luckily for me, I’m successful enough that these people aren’t particularly threatening, so I scrape them off my shoe and continue writing books.</p><p>Normal people only apologize for things that should be apologized for, like for example: “I’m sorry the Social Justice Warrior contingent of sci-fi is made up of a bunch of perpetually outraged adult children.”</p></blockquote><p>I suspected that would be the outcome. As for me, I’m just wondering when all the pinkshirts and Social Justice Warriors who said less-than-flattering things about me are going to apologize to me now that N.K. Jemisin has openly admitted that she is not merely “half-savage”, but rather, “all savage and damned proud of it”.</p><p>And in the meantime, John C. Wright has produced <a href=\"http://www.scifiwright.com/2014/06/united-underworld-literary-movement-manifesto/\">the United Underworld Literary Movement Manifesto</a>, complete with logo. Apparently I am the Supreme Dark Lord, Secret Warden of the Cosmic Fifth Race, and Eternal Champion of Universópolis.</p></div>",
  "content_text": "I’m beginning to get the impression that\nLarry is underwhelmed by the call\nto repentance, recantation, and self-abasement:\nSecondly, and this is going to be much more damaging for him longterm, he allowed himself to become very closely associated to Vox Day in the process. Ultimately people do judge others by their associations, and both Larry Correia and John C Wright have made very public declarations of support for Day, that I fear both will deeply regret in the long run.\nOne of the tactics I’ve seen them take is conflating my views with those of Vox Day. It doesn’t matter that I’ve disagreed with the man, and I’ve debated with him several times, but they sure love linking me to Vox. See, unlike me, they can actually find a couple of comments from him that they can manage to spin up some outrage over, and everybody knows righteous indignation gives libprogs super powers.\nYou have an issue with something Vox said, take it up with him. I did, and I found the guy to be a capable debater, and many of the insinuations about him floating around the internet were grossly exaggerated. (says the man who the Guardian has insinuated hates women and wants to keep fiction the exclusive domain of a group he doesn’t technically belong to, so I simply can’t imagine the internet exaggerating somebody’s beliefs.)\nThe woman Vox insulted with the infamous half-savage comment also has a long history of inflammatory racial statements, and had been throwing insults at Vox for years, but somehow she always gets a pass in these discussions about “divisiveness” (remember what I said earlier about the Ctrl H search and replace to put Jew instead of White Man in their tweets? She’s totally the best). I don’t think she likes me much either, because she gave a speech a little while ago and condemned Mr. Free Speech At All Costs… I think that’s supposed to be me, but personally I took that as a compliment, because you know, that part where I actually believe in free speech and stuff.\nSo I recommend a short story by somebody who made a statement they found racist? DIVISIVE! And Damien will condemn me in his newspaper. Meanwhile, an approved author writes tons of negative things about an ethnic group that it is cool to hate? Totally not divisive, and Damien will plug her in his newspaper. Now me personally, I think the concept of race is increasingly irrelevant bullshit, and I judge all humans as individuals, but I’m the International Lord of Hate.\nPublic declaration of support? By that Damien means I failed to join his lynch mob? Sadly I couldn’t find my jack boots in time.\nOne of the International Lord of Hate’s commenters pointed out what Damien was trying, and failing, to accomplish:\n“They want to slam Vox because he is the one nut they can’t crack, but\nboy, if they can turn a few of his friends and supporters, that’s at\nleast along the lines of their goals.”\nOn behalf of Mr. Correia, Mr. Wright, and Mrs. Hoyt, I am offended at the idea they should be deemed any easier to crack than me. (As opposed to that notoriously soft and bendable reed, Col. Kratman, whose pastimes make Ramsay Snow’s look like embroidery.) Now, it is true that mi amigo latino has a different perspective on race than I do. I realize this may astonish white people, particularly of the SWPL variety, but we members of La Raza Cósmica do not necessarily think alike; some of us don’t even believe in the inevitability of Universópolis. Transmetachronopolis, yes. Universópolis, not so much.\nAs Larry says, we’ve even debated the matter in private, and while I did not convince him, I believe he did come to understand that my position is based entirely on sound genetic science and history rather than personal preferences. Since then, the publication of\nA Troublesome Inheritance\nby Nicholas Wade has demonstrated that my “controversial” views are entirely in line with current science and that the “Nurture not Nature” perspective is outdated and unscientific.\n(\nNota Ironica:\nthe very concept of La Raza Cósmica is based on the idea that Darwinism was “created to validate, explain, and justify ethnic superiority and to repress others.” So, you see, this is why only fifth-racers like me “have the territorial, racial, and spiritual factors necessary to initiate the ‘universal era of humanity’.” Bow down, you colonial sons and daughters of the Old World, abase yourselves, you children of the Orient, kneel before me, you spawnlings of Darkest Africa. Bow to me, in the name of humanity!)\nI love Larry. I have great respect for him. He’s the best action writer of our generation. But I don’t answer for him and he doesn’t answer for me. That’s one thing the Left will never accept: there is no guilt by association. A man can only answer for his own deeds, his own words, his own actions.\nWhich is one reason why Larry declined the opportunity to participate in the suggested auto-da-fe:\nI’m quite serious about my suggestion by the way. I think if Correia wrote publicly to support the new diversity in the genre, and apologised for any perception he was campaigning against it, that might help him a lot.\nApologize for the perception? Apologize for being seen as an enemy of progress? That sounds suspiciously like the apologies Stalin used to have people sign right before he shipped them off to the gulag, so in response, Beria, er, I mean Damien, here are a few of my thoughts about what it really means when a libprog demands an apology.\nRule number one. Never apologize for something that shouldn’t be apologized for. Check out all the various firings, purges, boycotts, and cancellations. Apologizing for causing their outrage is you taking responsibility for their ignorance and inability to control their own emotions. Apologizing to the perpetually outraged means they own you. You have declared yourself guilty and vulnerable to their threats. It is like negotiating with terrorists. Give into their demands and you’re just encouraging them to blow something else up.\nIf I was the type of mushy headed fool that would issue an apology, it wouldn’t matter anyway, because as we’ve already seen my actual words and actions mean nothing compared to the agreed upon narrative, and that narrative is that I’m guilty of pretty much every vile thing they can think of. Luckily for me, I’m successful enough that these people aren’t particularly threatening, so I scrape them off my shoe and continue writing books.\nNormal people only apologize for things that should be apologized for, like for example: “I’m sorry the Social Justice Warrior contingent of sci-fi is made up of a bunch of perpetually outraged adult children.”\nI suspected that would be the outcome. As for me, I’m just wondering when all the pinkshirts and Social Justice Warriors who said less-than-flattering things about me are going to apologize to me now that N.K. Jemisin has openly admitted that she is not merely “half-savage”, but rather, “all savage and damned proud of it”.\nAnd in the meantime, John C. Wright has produced\nthe United Underworld Literary Movement Manifesto\n, complete with logo. Apparently I am the Supreme Dark Lord, Secret Warden of the Cosmic Fifth Race, and Eternal Champion of Universópolis.",
  "tags": [
    "media",
    "rabbitology",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-03T12:00:00+00:00"
}