{
  "url": "https://voxday.net/2014/06/24/another-letter-to-sfwa/",
  "scraped_at": "2025-12-16T12:18:36.202222",
  "title": "Another letter to SFWA",
  "date_display": "June 24, 2014",
  "date_iso": "2014-06-24T13:38:00+00:00",
  "date_from_url": "2014-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear SFWA President Steven Gould,</p><p>It has come to my attention that a convicted child molester still<br> belongs to SFWA as of 23 June 2014. In light of your concerted efforts<br> to expel me for a single tweet linking to a blog post deemed<br> unacceptable to the organization, it very much appears that you and the<br> rest of the SFWA Board have no similar objections to the sexual abuse of<br> children. Given the recent decision to award SFWA’s Grand Master award<br> to Samuel Delany, a public supporter of the North American Man Boy Love<br> Association, these facts raise some serious questions about SFWA’s<br> position concerning the sexual abuse of children.</br></br></br></br></br></br></br></br></p><p>I would very much appreciate it if you would explain to me and the rest<br> of the world how a single expression of a private opinion on a personal<br> blog merited expulsion from SFWA while multiple arrests over a period of<br> 18 years, culminating in a conviction on multiple counts of child<br> molesting, did not.</br></br></br></br></p><p>If you do not respond to this email, as you failed to respond to my<br> previous questions concerning SFWA’s continued support for Marion Zimmer Bradley, be aware that you will leave everyone little choice<br> but to conclude that SFWA tolerates and celebrates the sexual abuse of<br> children by its members.</br></br></br></p><p>Sincerely,<br> Vox</br></p><p>Attachment: Screen shot of SFWA Membership List</p><p>I also tweeted this:</p><p>A lot of criticism of @monsterhunter45 by @scalzi, @jimchines and @damiengwalter. Absolutely none of SFWA member @edwardekramer. #askthemwhy</p></div>",
  "content_text": "Dear SFWA President Steven Gould,\nIt has come to my attention that a convicted child molester still\nbelongs to SFWA as of 23 June 2014. In light of your concerted efforts\nto expel me for a single tweet linking to a blog post deemed\nunacceptable to the organization, it very much appears that you and the\nrest of the SFWA Board have no similar objections to the sexual abuse of\nchildren. Given the recent decision to award SFWA’s Grand Master award\nto Samuel Delany, a public supporter of the North American Man Boy Love\nAssociation, these facts raise some serious questions about SFWA’s\nposition concerning the sexual abuse of children.\nI would very much appreciate it if you would explain to me and the rest\nof the world how a single expression of a private opinion on a personal\nblog merited expulsion from SFWA while multiple arrests over a period of\n18 years, culminating in a conviction on multiple counts of child\nmolesting, did not.\nIf you do not respond to this email, as you failed to respond to my\nprevious questions concerning SFWA’s continued support for Marion Zimmer Bradley, be aware that you will leave everyone little choice\nbut to conclude that SFWA tolerates and celebrates the sexual abuse of\nchildren by its members.\nSincerely,\nVox\nAttachment: Screen shot of SFWA Membership List\nI also tweeted this:\nA lot of criticism of @monsterhunter45 by @scalzi, @jimchines and @damiengwalter. Absolutely none of SFWA member @edwardekramer. #askthemwhy",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-24T12:38:00+00:00"
}