{
  "url": "https://voxday.net/2014/06/30/book-review-monster-hunter-nemesis/",
  "scraped_at": "2025-12-16T12:19:12.732530",
  "title": "Book review: Monster Hunter Nemesis",
  "date_display": "June 30, 2014",
  "date_iso": "2014-06-30T13:00:00+00:00",
  "date_from_url": "2014-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.amazon.com/gp/product/B00L17ZHNQ\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://contentcafe2.btol.com/ContentCafe/Jacket.aspx?UserID=WST62134&amp;Password=CC93041&amp;Return=1&amp;Type=M&amp;Value=9781476736556&amp;erroroverride=1\" width=\"210\"/></a>I am not a Monster Hunter International fan. Or perhaps it would be more accurate to say that I WAS NOT a Monster Hunter International fan before this, the fifth book in the Monster Hunter series. While I stand second-to-none in my respect for their intrepid best-selling author, I found the first four books in the series to be a little too vanilla urban fantasy for my tastes. Violent vanilla, to be sure, even XXXtreme vanilla, but vanilla nonetheless. Which isn’t to say that they are not fun and entertaining; they are, in fact, exactly the sort of books that harbor great appeal to red-blooded men who like big guns and pretty women with big breasts, and who are willing to defend civilization and society as the hard men standing between the monsters and the innocent.</p><p>Translation: I liked Mack Bolan back in the day too. This doesn’t mean I ever confused it with great literature. Or even interesting literature.</p><p>I found Correia’s <i>Grimnoir Chronicles</i> to be of considerably more interest. Unlike most Western authors, Correia is able to write a respectful portrayal of the Japanese warrior culture without coming off as the sort of obsessed round-eye who puts on a red kimono to drink <i>ocha </i>every afternoon. (I am an East Asian Studies major who spent a semester abroad in Tokyo, and I still speak a smattering of Japanee. So I knew a few guys like that.) I also found that the Grimnoir characters, despite their superhuman abilities, were more fully developed and interesting than their MHI counterparts.</p><p>So, what was fascinating about reading <i><a href=\"http://www.amazon.com/gp/product/B00L17ZHNQ\"><b>Monster Hunter Nemesis</b></a> </i>was to see the way Correia upped his game and took the book to a higher level. The way in which he did so was rather remarkable, because he somehow managed to improve the depth and scope of his writing without sacrificing even one iota of the violence-fueled action of the previous books.</p><p>In the first four books, Agent Franks is little more than a superweapon and an repetitive joke: <i>“Oh shit, it’s Franks!”</i> As with most street drugs and urban fantasy series, Correia finds it necessary to keep raising the oppositional ante in order to maintain the reader’s interest, which might seem a little conceptually challenging considering that the big boss at the end of the third book was an extradimensional Elder God and the collateral damage involved a considerable portion of the city of Las Vegas.</p><p>And so he raises the ante, but not in any of the cheap and obvious ways so common to lesser authors. Instead, Correia provides a backstory to his take on Frankenstein’s monster that is both more interesting and comprehensive than the customary one. This backstory, which is directly integral to the plot, is deftly revealed in vignettes as the current story plays out.</p><p>For the first time, Larry Correia draws upon his religious background, and in doing so he brings both intellectual depth and emotional poignancy to the world of Monster Hunter that it previously lacked. Franks is revealed to be far more than monstrous construct, he is shown to be a complex, noble being whose inhuman sociopathy is the logical consequence of his alien values, motivations, and restrictions.</p><p>Larry Correia may not win the Hugo Best Novel Award in 2014 for <i>Warbound</i>. But his <i>Monster Hunter Nemesis</i> is likely to be a contender for next year’s award. This is a very good book by a best-selling author who is confident in his ability and is beginning to hit his stride.</p><p><b>Characters (9/10)</b>  Correia fleshes out existing characters both major and minor; his use of Heather the red-headed werewolf as a reluctant government agent desperate to earn her PUFF exception is particularly adroit. One of the major antagonists is well-portrayed, the other remains more than a bit of a mystery, and is alarmingly convincing in his ruthlessly efficient use and abuse of the bureaucratic power struggles between the various federal agencies.</p><p><b>Prose (7/10) </b>One doesn’t read Correia for the stylistic pyrotechnics or the obscure literary allusions. It’s akin to contemplating the fuel-efficiency of a Lamborghini. That being said, his prose is smooth and easy, regardless of whether he is describing the splattering of a reanimated collection of corpses by a large, fast-moving vehicle or lovingly detailing the chambering action of a Glock* pistol. As an adept storyteller, Correia’s style serves as simple lubricant for the story, just as it should be. He does have a certain lamentable habit of throwing in the occasional conversational rimshot, all of which will no doubt one day appear verbatim in the television series. Hey, if it works for Richard Castle….</p><p><b>Plot (10/10)  </b>A centuries-old contract between Franks and the U.S. government is being jeopardized by a grasping bureaucrat with a savior complex who rejects the idea that people in the past had legitimate reasons for doing as they did. Adroitly ties everything from Milton and Mary Shelley and Ben Franklin into the Monster Hunter mythos.</p><p><b>Ideas (8/10)  </b>Correia is moving well beyond the usual werewolves and vampires of generic urban fantasy. He is drawing effectively upon history, his tactical training experience, and his religious background, to say nothing of his accountant’s eye view of government bureaucracy. <i>Monster Hunter Nemesis</i> is more than a mere action novel, it is an intelligent and occasionally thought-provoking action novel.</p><p><b>Text Sample:  </b><i>There was a commotion on the other side of the tent flap. Guards gave challenges, IDs were presented, and then there was a rush of apologies. The flap opened and several men entered the giant command tent. The first through were members of the MCB’s elite mobile strike team. They were hardened warriors who Franks had served with many times, and behind them was an innocuous looking, middle aged man in a cheap suit.</i><br> <i><br>Franks’ arms were chained to the chair, so he dipped his head slightly. “Sir.”</br></i><br> <i><br>“Why is my second in command tied up?” Dwayne Myers, Strike Team SAC, demanded. “What’s the meaning of this?”</br></i><br> <i><br>Foster’s response was about as belligerent as could be expected. “Agent Franks is charged with disobeying direct orders, violating security protocols by taking a civilian witness into a monster containment area, and then breaking into the Nevada storage facility to steal seized evidence.”</br></i><br> <i><br>“Is that true?” Myers asked.</br></i><br> <i><br>Franks nodded. That sounded about right, but Myers already knew most of the details, since it had secretly been his idea to begin with. Franks had taken Owen Pitt to Dugway because he’d thought the Monster Hunter’s psychic powers could help their investigation. He’d taken three ancient arcane weapons from Area 51 in order to fight the Nachtmar; Lord Machado’s ax, the Attilius gladius, and the Black Heart of Suffering. That last one had done the trick, and destroyed the creature.</br></i><br> <i><br>“When he was confronted about his actions, Franks attempted to kill MCB Director Douglas Stark.”</br></i><br> <i><br>Franks snorted. The five men covering him with drawn weapons backed away nervously. They were only following orders, but all of them had worked with Franks at some point, so they were aware that shooting Franks might upset him.</br></i><br> <i><br>“I’ve known Agent Franks for twenty years. He doesn’t attempt to kill anyone. Holster those side arms and unchain him. Franks is coming with me.” Myers had recently been demoted, but had been the Acting Director before that, and he was still probably the most respected senior agent in the Bureau.</br></i><br> <i><br>“Hold on,” Foster demanded. “Franks is in STFU custody.” It was almost like Foster thought that invoking the name of the ultra-secret Special Task Force Unicorn would strike fear into the federal agent’s hearts.</br></i><br> <i><br>Myers glanced around theatrically. “Really? Because these appear to be MCB men, and last I checked sworn MCB agents don’t take orders from an operation that doesn’t exist.” The MCB didn’t officially exist either, as it was just a line item on the Department of Homeland Security’s budget, but in this business there were levels of not existing.</br></i><br> <i><br>“Director Stark is—”</br></i><br> <i><br>“Hiding from this giant clusterfuck caused by his lack of leadership,” Myers said. “Our good Director must have forgotten that is against regulation 72 dash B to turn MCB handling of a level five containment to another entity, such as yours, without authorization from the President. So in the meantime I’m the highest ranking member of the MCB available, and I’m making the call. Cut Franks loose. I’m going back outside to try and contain the unholy mess you amateurs made out of one of America’s most popular tourist attractions, before every news agency in the world records video of a street full of ectoplasm and dragon parts. Is that understood, Mr. Foster?”</br></i><br> <i><br>It was clearly understood, but not particularly liked. “We’re not done, Myers.”</br></i><br> <i><br>“Oh, I believe that we are.” Myers glanced over and confirmed that the men had put their weapons away. “Remove Mr. Foster from my command tent.”</br></i><br> <i><br>“I’ve got it,” Franks said. One of the men had been looking for the key to the padlock, but Franks simply took up the chain in his bare hands and twisted until a link snapped. By the time anyone realized what was happening, the chains had already hit the floor and Franks had caught Foster by the arm and effortlessly lifted him off the ground. Foster winced in pain as Franks carried him to the nearest flap, and hurled the Unicorn operative into the street. </br></i></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>*Let no one henceforth say Larry Correia is homophobic. No doubt the LGBT community appreciated the little shout-out.</p></div>",
  "content_text": "I am not a Monster Hunter International fan. Or perhaps it would be more accurate to say that I WAS NOT a Monster Hunter International fan before this, the fifth book in the Monster Hunter series. While I stand second-to-none in my respect for their intrepid best-selling author, I found the first four books in the series to be a little too vanilla urban fantasy for my tastes. Violent vanilla, to be sure, even XXXtreme vanilla, but vanilla nonetheless. Which isn’t to say that they are not fun and entertaining; they are, in fact, exactly the sort of books that harbor great appeal to red-blooded men who like big guns and pretty women with big breasts, and who are willing to defend civilization and society as the hard men standing between the monsters and the innocent.\nTranslation: I liked Mack Bolan back in the day too. This doesn’t mean I ever confused it with great literature. Or even interesting literature.\nI found Correia’s\nGrimnoir Chronicles\nto be of considerably more interest. Unlike most Western authors, Correia is able to write a respectful portrayal of the Japanese warrior culture without coming off as the sort of obsessed round-eye who puts on a red kimono to drink\nocha\nevery afternoon. (I am an East Asian Studies major who spent a semester abroad in Tokyo, and I still speak a smattering of Japanee. So I knew a few guys like that.) I also found that the Grimnoir characters, despite their superhuman abilities, were more fully developed and interesting than their MHI counterparts.\nSo, what was fascinating about reading\nMonster Hunter Nemesis\nwas to see the way Correia upped his game and took the book to a higher level. The way in which he did so was rather remarkable, because he somehow managed to improve the depth and scope of his writing without sacrificing even one iota of the violence-fueled action of the previous books.\nIn the first four books, Agent Franks is little more than a superweapon and an repetitive joke:\n“Oh shit, it’s Franks!”\nAs with most street drugs and urban fantasy series, Correia finds it necessary to keep raising the oppositional ante in order to maintain the reader’s interest, which might seem a little conceptually challenging considering that the big boss at the end of the third book was an extradimensional Elder God and the collateral damage involved a considerable portion of the city of Las Vegas.\nAnd so he raises the ante, but not in any of the cheap and obvious ways so common to lesser authors. Instead, Correia provides a backstory to his take on Frankenstein’s monster that is both more interesting and comprehensive than the customary one. This backstory, which is directly integral to the plot, is deftly revealed in vignettes as the current story plays out.\nFor the first time, Larry Correia draws upon his religious background, and in doing so he brings both intellectual depth and emotional poignancy to the world of Monster Hunter that it previously lacked. Franks is revealed to be far more than monstrous construct, he is shown to be a complex, noble being whose inhuman sociopathy is the logical consequence of his alien values, motivations, and restrictions.\nLarry Correia may not win the Hugo Best Novel Award in 2014 for\nWarbound\n. But his\nMonster Hunter Nemesis\nis likely to be a contender for next year’s award. This is a very good book by a best-selling author who is confident in his ability and is beginning to hit his stride.\nCharacters (9/10)\nCorreia fleshes out existing characters both major and minor; his use of Heather the red-headed werewolf as a reluctant government agent desperate to earn her PUFF exception is particularly adroit. One of the major antagonists is well-portrayed, the other remains more than a bit of a mystery, and is alarmingly convincing in his ruthlessly efficient use and abuse of the bureaucratic power struggles between the various federal agencies.\nProse (7/10)\nOne doesn’t read Correia for the stylistic pyrotechnics or the obscure literary allusions. It’s akin to contemplating the fuel-efficiency of a Lamborghini. That being said, his prose is smooth and easy, regardless of whether he is describing the splattering of a reanimated collection of corpses by a large, fast-moving vehicle or lovingly detailing the chambering action of a Glock* pistol. As an adept storyteller, Correia’s style serves as simple lubricant for the story, just as it should be. He does have a certain lamentable habit of throwing in the occasional conversational rimshot, all of which will no doubt one day appear verbatim in the television series. Hey, if it works for Richard Castle….\nPlot (10/10)\nA centuries-old contract between Franks and the U.S. government is being jeopardized by a grasping bureaucrat with a savior complex who rejects the idea that people in the past had legitimate reasons for doing as they did. Adroitly ties everything from Milton and Mary Shelley and Ben Franklin into the Monster Hunter mythos.\nIdeas (8/10)\nCorreia is moving well beyond the usual werewolves and vampires of generic urban fantasy. He is drawing effectively upon history, his tactical training experience, and his religious background, to say nothing of his accountant’s eye view of government bureaucracy.\nMonster Hunter Nemesis\nis more than a mere action novel, it is an intelligent and occasionally thought-provoking action novel.\nText Sample:\nThere was a commotion on the other side of the tent flap. Guards gave challenges, IDs were presented, and then there was a rush of apologies. The flap opened and several men entered the giant command tent. The first through were members of the MCB’s elite mobile strike team. They were hardened warriors who Franks had served with many times, and behind them was an innocuous looking, middle aged man in a cheap suit.\nFranks’ arms were chained to the chair, so he dipped his head slightly. “Sir.”\n“Why is my second in command tied up?” Dwayne Myers, Strike Team SAC, demanded. “What’s the meaning of this?”\nFoster’s response was about as belligerent as could be expected. “Agent Franks is charged with disobeying direct orders, violating security protocols by taking a civilian witness into a monster containment area, and then breaking into the Nevada storage facility to steal seized evidence.”\n“Is that true?” Myers asked.\nFranks nodded. That sounded about right, but Myers already knew most of the details, since it had secretly been his idea to begin with. Franks had taken Owen Pitt to Dugway because he’d thought the Monster Hunter’s psychic powers could help their investigation. He’d taken three ancient arcane weapons from Area 51 in order to fight the Nachtmar; Lord Machado’s ax, the Attilius gladius, and the Black Heart of Suffering. That last one had done the trick, and destroyed the creature.\n“When he was confronted about his actions, Franks attempted to kill MCB Director Douglas Stark.”\nFranks snorted. The five men covering him with drawn weapons backed away nervously. They were only following orders, but all of them had worked with Franks at some point, so they were aware that shooting Franks might upset him.\n“I’ve known Agent Franks for twenty years. He doesn’t attempt to kill anyone. Holster those side arms and unchain him. Franks is coming with me.” Myers had recently been demoted, but had been the Acting Director before that, and he was still probably the most respected senior agent in the Bureau.\n“Hold on,” Foster demanded. “Franks is in STFU custody.” It was almost like Foster thought that invoking the name of the ultra-secret Special Task Force Unicorn would strike fear into the federal agent’s hearts.\nMyers glanced around theatrically. “Really? Because these appear to be MCB men, and last I checked sworn MCB agents don’t take orders from an operation that doesn’t exist.” The MCB didn’t officially exist either, as it was just a line item on the Department of Homeland Security’s budget, but in this business there were levels of not existing.\n“Director Stark is—”\n“Hiding from this giant clusterfuck caused by his lack of leadership,” Myers said. “Our good Director must have forgotten that is against regulation 72 dash B to turn MCB handling of a level five containment to another entity, such as yours, without authorization from the President. So in the meantime I’m the highest ranking member of the MCB available, and I’m making the call. Cut Franks loose. I’m going back outside to try and contain the unholy mess you amateurs made out of one of America’s most popular tourist attractions, before every news agency in the world records video of a street full of ectoplasm and dragon parts. Is that understood, Mr. Foster?”\nIt was clearly understood, but not particularly liked. “We’re not done, Myers.”\n“Oh, I believe that we are.” Myers glanced over and confirmed that the men had put their weapons away. “Remove Mr. Foster from my command tent.”\n“I’ve got it,” Franks said. One of the men had been looking for the key to the padlock, but Franks simply took up the chain in his bare hands and twisted until a link snapped. By the time anyone realized what was happening, the chains had already hit the floor and Franks had caught Foster by the arm and effortlessly lifted him off the ground. Foster winced in pain as Franks carried him to the nearest flap, and hurled the Unicorn operative into the street.\n*Let no one henceforth say Larry Correia is homophobic. No doubt the LGBT community appreciated the little shout-out.",
  "tags": [
    "Book Review"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-30T12:00:00+00:00"
}