{
  "url": "https://voxday.net/2014/06/26/circling-wagons/",
  "scraped_at": "2025-12-16T12:18:45.421420",
  "title": "Circling the wagons, poisoning the well",
  "date_display": "June 26, 2014",
  "date_iso": "2014-06-26T09:05:00+00:00",
  "date_from_url": "2014-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Colleen Doran points out one of <a href=\"http://www.adistantsoil.com/2014/06/20/why-i-burned-marion-zimmer-bradleys-books/\">the hidden costs</a> of an abusive community:</p><blockquote class=\"tr_bq\"><p> I<br> have heard from many people in the last couple of days (men and women)<br> who had to deal with multiple incidents from multiple perps themselves,<br> and most said they got out of fandom because of it. Fans may think Bradley was a mighty fine writer, or that comic book<br> was a mighty fine comic, but consider all of the art we’ll never see and<br> books we’ll never read because the young people who might have wanted<br> to make them someday ran screaming from this community.</br></br></br></br></br></br></p><p>These people poisoned the well for generations of fans, and future<br> writers and artists. And the poison not only came from the perps, but<br> from the people who covered up for them, claiming if the outside world<br> knew what really goes on, “it might make fandom look bad.”</br></br></br></p><p>No folks, YOU did that. You did.</p></blockquote><div class=\"comment-content\"> S. Andrew Swann adds:<div class=\"comment-text\"><blockquote class=\"tr_bq\"><p> What’s disheartening is that the general reaction of SF Fandom<br> to things like this echoes the reaction I’ve seen from just about any<br> organized group to this kind of thing, esp. when someone of some weight<br> and power in the community is involved in the abuse.  Be it Jerry<br> Sandusky at Penn State, Jimmy Savile at the BBC, or the Catholic Church<br> to their own abusive priests.  It’s like everyone has this script that<br> tells them they must continue to enable abuse to protect their own<br> little community.</br></br></br></br></br></br></br></p></blockquote><p>After SFWA quickly leaped to wipe Ed Kramer from their online membership list on 24 June 2014 following <a href=\"http://www.milobookclub.com/2014/06/24/sfwa-still-harbors-child-molesters/\">my post of a screen capture</a> proving Kramer’s SFWA membership yesterday, some of its fans and members began to pretend that Kramer’s apparent failure to pay his dues sometime between 2011 and 2013 somehow exculpates SFWA’s complete failure to do anything but publicly defend the child molester while he was “<a href=\"http://www.linkedin.com/in/edwardekramer\">an active member</a> of the Science Fiction Writer’s Association (SFWA) for more than two decades, and a past Nebula Awards host”. This is how they continue “to protect their own<br> little community”:</br></p><ul><li>Vox attempting to defame <a class=\"twitter-atreply pretty-link\" dir=\"ltr\" href=\"https://twitter.com/sfwa\"><s>@</s><b>sfwa</b></a> with phony “screenshot” showing Ed Kramer still a member. – <a href=\"https://twitter.com/SFReviewsnet/status/481481555945078785\">Thomas Wagner</a></li><li>Why should we keep talking about Kramer? Oh, right, because VD made up<br> some fake bullshit to stir controversy. Not surprising at all. – <a href=\"https://twitter.com/shaunduke/status/481550068743675905\">Shaun Duke</a></br></li><li>The Naive Idiocy of Not Checking Your Facts Before Making Accusations Online – <a href=\"https://twitter.com/scalzi/status/481464330387718144\">John Scalzi</a></li><li>Yeah. So Kramer isn’t actually a member of SFWA. (Though it looks like he was an associate member…four years ago.)<br> #FactChecking  – <a href=\"https://twitter.com/jimchines/status/481462957004836864\">Jim C Hines</a></br></li><li>Font in the link on his screenshot doesn’t look right to me, size difference. – <a href=\"https://twitter.com/JabberwockySR/status/481495683069775873\">JabberwockySR</a></li><li>I’m not a member, and when I do a search at the site Jim linked, I get 0 results found. Searched just “kramer.” – <a href=\"https://twitter.com/TheBarbarienne/status/481502688656773120\">The Barbarienne</a></li><li>Nah, can’t be. Ed Kramer’s not currently a SFWA member. I mean, it’s not like the troll would *lie* about that. Or not have their facts in order before spouting off.” – <a href=\"http://james-nicoll.livejournal.com/4995323.html?thread=93019643#t93019643\">Jazzfish</a></li><li>VD says the SFWA removed Kramer’s entry right after he posted, but I<br> think he’s lying and the screen grab is a fake – <a href=\"http://james-nicoll.livejournal.com/4995323.html?thread=93039867#t93039867\">Agent Mimi</a> </br></li><li>What a troll. Never could understand such petty BS. How small his soul must be to run a campaign of destruction of others. – <a href=\"https://twitter.com/SFWriterGuy/status/481559326851477504\">Walter L. Fisher</a></li></ul><p>If there are others, let me know. These people must be put on the record for their attempts to whitewash the problematic past. The screen capture is not a fake. Multiple readers here have testified that they saw Kramer on the list and SFWA has not denied the fact that Edward E. Kramer was on the SFWA.ORG membership list as of 5:04 AM EST, 24 June 2014. The fact is that Kramer was listed in the SFWA print directory in 2010 and I am still waiting to hear from someone who has the 2011 and 2012 directories. The fact is that Kramer himself said he was an SFWA member “for more than two decades”. And the fact is that numerous members of the science fiction community are attacking me and deceitfully claiming that I forged a screen capture rather than believe the well-documented truth: SFWA has harbored, defended, and celebrated child molesters for more than 50 years and <i>is still doing so today</i>.</p><p>Furthermore, even if Ed Kramer stopped paying his dues at some point between 2011 and 2014, how is that to SFWA’s credit? They did not criticize him. They did not investigate him. They did not expel him. They did not cut ties to him. They did not do any of these things even though Dragoncon began attempting to cut ties with the man 14 years ago! Instead, as I pointed out, SFWA defended him, and now its defenders are attempting to deny the undeniable evidence literally in front of their eyes rather than admit that SFWA has a real and ongoing problem with child molesters in its midst.</p><p>And, if Ed Kramer paid his dues tomorrow, he would again be an Active member in good standing. As he was for more than 20 years.</p><p>Consider how many SFWA people are doing exactly as their predecessors who defended Ed Kramer did in 2004 and 2006, only now they are pointing out that there isn’t any hard evidence that their new Grand Master ever put his words into action. Keeping in mind that the SFWA Board produced an 80-page investigative report on the basis of a single tweet last year, when did SFWA ever do a similar investigation of the author of <a href=\"http://www.amazon.com/Hogg-Novel-Samuel-R-Delany/dp/1573661198\">Hogg: A Novel</a> on the basis of his public support for NAMBLA or even this review of his book by <i>Publisher’s Weekly</i>?</p><blockquote class=\"tr_bq\"><p> <i>Hugo-and Nebula Award-winner Delany – whose early books were fascinating but whose recent efforts have grown increasingly obtuse – has been trying to get this pornographic novel published since 1973. The main narrator here is an 11-year-old boy who joins up with a raping, murdering pederast named Hogg. Coprophiliac Hogg violates women for pay. He enlists the help of other pedophiliac murdering rapists – Nigg, Dago and Denny – and the group sets off to perform acts of hideous violence. After the attacks, a biker friend of Hogg’s sells the boy into sexual slavery to dockyard slum resident Big Sambo, who keeps his 12-year-old daughter for prostitution and his own perversions. The traumatized little girl is gang-raped by Hogg’s crew as well. Meanwhile, teenaged Denny goes on an insane mutilating and mass-murder spree, eludes the police and finally returns to Hogg and the hopelessly confused narrator, who has been “rescued” after Hogg murders Big Sambo. Gang-rape attacks and criminal sex orgies are detailed at excruciating length, with photographic realism. </i></p></blockquote><p>That monstrosity is precisely <a href=\"http://www.sfwa.org/2013/12/32160/\">what SFWA chose to celebrate</a> in May 2014. SFWA President Steven Gould, who was personally responsible for the decision to select Delany,  was “delighted” to select the author of <i>Hogg</i> instead of Frank Herbert, Jerry Pournelle, Larry Niven, or other, much more deserving SF authors:</p><blockquote><p> One of the perks of being SFWA president is the option of<br> selecting the Science Fiction and Fantasy Writers of America’s next<br> Damon Knight Memorial Grand Master. One of the tragedies is we only get<br> to select one a year. That said, from the grains of sand in my pocket, I<br> am delighted to pull this star. Samuel R. Delany is one of science fiction’s most influential<br> authors, critics, and teachers and it is my great honor to announce his<br> selection. When discussing him as this year’s choice with the board,<br> past-presidents, and members, the most frequent response I received was,<br> “He’s not already?” Well he is now.</br></br></br></br></br></br></br></br></p></blockquote><p>If Delany was truly “one of science fiction’s most influential<br> authors”, then science fiction would be in dire straits indeed. Fortunately, aside from <a href=\"http://www.locusmag.com/Roundtable/2014/03/roundtable-on-samuel-r-delany-grand-master/\">a fairly small number of Pink SF/F freakshows</a> like Gould, Delany isn’t even remotely influential. Virtually no one actually reads his perverted sewage: <i>Dhalgren </i>is #523,915 on Kindle, <i>Nova </i>is #381,524, and <i>Hogg </i>is #873,530. Unfortunately, there are those who unwittingly read the writers influenced by him. Writers like this one:</br></p><blockquote class=\"tr_bq\"><p> The Science Fiction and Fantasy Writers of America has named Samuel R. Delany its newest Grand Master…. I will say this: This is an award both well chosen and well deserved.<br>  – John Scalzi, <a href=\"http://whatever.scalzi.com/2013/12/04/samuel-r-delany-grand-master-of-science-fiction/\">4 December 2013</a></br></p></blockquote><p>In light of what we have learned about the way in which the crimes of Walter Breen and Marion Zimmer Bradley were directly tied to the dark themes of their literary work, is it truly justifiable to give another award-winning author the benefit of the doubt and simply assume his innocence without asking any questions at all? Or will it eventually come out that the SF community is again doing what it has repeatedly done over the last 50 years and circled its wagons in defense of yet another celebrated child molester? I have invented nothing here. This is what they are.</p><p>To paraphrase Miss Doran: “Even when abuse is right in their faces, they will cover up and deny.”</p></div></div></div>",
  "content_text": "Colleen Doran points out one of\nthe hidden costs\nof an abusive community:\nI\nhave heard from many people in the last couple of days (men and women)\nwho had to deal with multiple incidents from multiple perps themselves,\nand most said they got out of fandom because of it. Fans may think Bradley was a mighty fine writer, or that comic book\nwas a mighty fine comic, but consider all of the art we’ll never see and\nbooks we’ll never read because the young people who might have wanted\nto make them someday ran screaming from this community.\nThese people poisoned the well for generations of fans, and future\nwriters and artists. And the poison not only came from the perps, but\nfrom the people who covered up for them, claiming if the outside world\nknew what really goes on, “it might make fandom look bad.”\nNo folks, YOU did that. You did.\nS. Andrew Swann adds:\nWhat’s disheartening is that the general reaction of SF Fandom\nto things like this echoes the reaction I’ve seen from just about any\norganized group to this kind of thing, esp. when someone of some weight\nand power in the community is involved in the abuse.  Be it Jerry\nSandusky at Penn State, Jimmy Savile at the BBC, or the Catholic Church\nto their own abusive priests.  It’s like everyone has this script that\ntells them they must continue to enable abuse to protect their own\nlittle community.\nAfter SFWA quickly leaped to wipe Ed Kramer from their online membership list on 24 June 2014 following\nmy post of a screen capture\nproving Kramer’s SFWA membership yesterday, some of its fans and members began to pretend that Kramer’s apparent failure to pay his dues sometime between 2011 and 2013 somehow exculpates SFWA’s complete failure to do anything but publicly defend the child molester while he was “\nan active member\nof the Science Fiction Writer’s Association (SFWA) for more than two decades, and a past Nebula Awards host”. This is how they continue “to protect their own\nlittle community”:\nVox attempting to defame\n@\nsfwa\nwith phony “screenshot” showing Ed Kramer still a member. –\nThomas Wagner\nWhy should we keep talking about Kramer? Oh, right, because VD made up\nsome fake bullshit to stir controversy. Not surprising at all. –\nShaun Duke\nThe Naive Idiocy of Not Checking Your Facts Before Making Accusations Online –\nJohn Scalzi\nYeah. So Kramer isn’t actually a member of SFWA. (Though it looks like he was an associate member…four years ago.)\n#FactChecking  –\nJim C Hines\nFont in the link on his screenshot doesn’t look right to me, size difference. –\nJabberwockySR\nI’m not a member, and when I do a search at the site Jim linked, I get 0 results found. Searched just “kramer.” –\nThe Barbarienne\nNah, can’t be. Ed Kramer’s not currently a SFWA member. I mean, it’s not like the troll would *lie* about that. Or not have their facts in order before spouting off.” –\nJazzfish\nVD says the SFWA removed Kramer’s entry right after he posted, but I\nthink he’s lying and the screen grab is a fake –\nAgent Mimi\nWhat a troll. Never could understand such petty BS. How small his soul must be to run a campaign of destruction of others. –\nWalter L. Fisher\nIf there are others, let me know. These people must be put on the record for their attempts to whitewash the problematic past. The screen capture is not a fake. Multiple readers here have testified that they saw Kramer on the list and SFWA has not denied the fact that Edward E. Kramer was on the SFWA.ORG membership list as of 5:04 AM EST, 24 June 2014. The fact is that Kramer was listed in the SFWA print directory in 2010 and I am still waiting to hear from someone who has the 2011 and 2012 directories. The fact is that Kramer himself said he was an SFWA member “for more than two decades”. And the fact is that numerous members of the science fiction community are attacking me and deceitfully claiming that I forged a screen capture rather than believe the well-documented truth: SFWA has harbored, defended, and celebrated child molesters for more than 50 years and\nis still doing so today\n.\nFurthermore, even if Ed Kramer stopped paying his dues at some point between 2011 and 2014, how is that to SFWA’s credit? They did not criticize him. They did not investigate him. They did not expel him. They did not cut ties to him. They did not do any of these things even though Dragoncon began attempting to cut ties with the man 14 years ago! Instead, as I pointed out, SFWA defended him, and now its defenders are attempting to deny the undeniable evidence literally in front of their eyes rather than admit that SFWA has a real and ongoing problem with child molesters in its midst.\nAnd, if Ed Kramer paid his dues tomorrow, he would again be an Active member in good standing. As he was for more than 20 years.\nConsider how many SFWA people are doing exactly as their predecessors who defended Ed Kramer did in 2004 and 2006, only now they are pointing out that there isn’t any hard evidence that their new Grand Master ever put his words into action. Keeping in mind that the SFWA Board produced an 80-page investigative report on the basis of a single tweet last year, when did SFWA ever do a similar investigation of the author of\nHogg: A Novel\non the basis of his public support for NAMBLA or even this review of his book by\nPublisher’s Weekly\n?\nHugo-and Nebula Award-winner Delany – whose early books were fascinating but whose recent efforts have grown increasingly obtuse – has been trying to get this pornographic novel published since 1973. The main narrator here is an 11-year-old boy who joins up with a raping, murdering pederast named Hogg. Coprophiliac Hogg violates women for pay. He enlists the help of other pedophiliac murdering rapists – Nigg, Dago and Denny – and the group sets off to perform acts of hideous violence. After the attacks, a biker friend of Hogg’s sells the boy into sexual slavery to dockyard slum resident Big Sambo, who keeps his 12-year-old daughter for prostitution and his own perversions. The traumatized little girl is gang-raped by Hogg’s crew as well. Meanwhile, teenaged Denny goes on an insane mutilating and mass-murder spree, eludes the police and finally returns to Hogg and the hopelessly confused narrator, who has been “rescued” after Hogg murders Big Sambo. Gang-rape attacks and criminal sex orgies are detailed at excruciating length, with photographic realism.\nThat monstrosity is precisely\nwhat SFWA chose to celebrate\nin May 2014. SFWA President Steven Gould, who was personally responsible for the decision to select Delany,  was “delighted” to select the author of\nHogg\ninstead of Frank Herbert, Jerry Pournelle, Larry Niven, or other, much more deserving SF authors:\nOne of the perks of being SFWA president is the option of\nselecting the Science Fiction and Fantasy Writers of America’s next\nDamon Knight Memorial Grand Master. One of the tragedies is we only get\nto select one a year. That said, from the grains of sand in my pocket, I\nam delighted to pull this star. Samuel R. Delany is one of science fiction’s most influential\nauthors, critics, and teachers and it is my great honor to announce his\nselection. When discussing him as this year’s choice with the board,\npast-presidents, and members, the most frequent response I received was,\n“He’s not already?” Well he is now.\nIf Delany was truly “one of science fiction’s most influential\nauthors”, then science fiction would be in dire straits indeed. Fortunately, aside from\na fairly small number of Pink SF/F freakshows\nlike Gould, Delany isn’t even remotely influential. Virtually no one actually reads his perverted sewage:\nDhalgren\nis #523,915 on Kindle,\nNova\nis #381,524, and\nHogg\nis #873,530. Unfortunately, there are those who unwittingly read the writers influenced by him. Writers like this one:\nThe Science Fiction and Fantasy Writers of America has named Samuel R. Delany its newest Grand Master…. I will say this: This is an award both well chosen and well deserved.\n– John Scalzi,\n4 December 2013\nIn light of what we have learned about the way in which the crimes of Walter Breen and Marion Zimmer Bradley were directly tied to the dark themes of their literary work, is it truly justifiable to give another award-winning author the benefit of the doubt and simply assume his innocence without asking any questions at all? Or will it eventually come out that the SF community is again doing what it has repeatedly done over the last 50 years and circled its wagons in defense of yet another celebrated child molester? I have invented nothing here. This is what they are.\nTo paraphrase Miss Doran: “Even when abuse is right in their faces, they will cover up and deny.”",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-26T08:05:00+00:00"
}