{
  "url": "https://voxday.net/2014/06/23/city-beyond-time/",
  "scraped_at": "2025-12-16T12:18:25.138857",
  "title": "CITY BEYOND TIME",
  "date_display": "June 23, 2014",
  "date_iso": "2014-06-23T06:00:00+00:00",
  "date_from_url": "2014-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/06/city_900.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/06/city_900.jpg\" width=\"200\"/></a></div><p><i>Metachronopolis is the golden city beyond time. Ruled by the Masters<br> of Time, who can travel freely throughout the multitudinous time lines<br> of Man’s history, the city is a shining society of heroes and horrors.<br> For the arrogant Masters, who steal famous men and women out of the past<br> and bring them to the eternal city for their amusement, are not only<br> beyond time, but beyond remorse and retribution too.<b> </b></br></br></br></br></br></i></p><p><i><a href=\"http://www.amazon.com/City-Beyond-Time-Tales-Metachronopolis-ebook/dp/B00L6WI3PU\"><i><b>CITY BEYOND TIME: Tales of the Fall of Metachronopolis</b></i></a> is John C. Wright’s mind-bending and astonishingly brilliant take on<br> time travel. In making use of a centuries-spanning perspective similar<br> to his highly-regarded  <b><a href=\"http://www.castaliahouse.com/downloads/awake-in-the-night-land/\">AWAKE IN THE NIGHT LAND</a></b>, Wright expertly weaves a larger tale out of a series of smaller ones. Part anthology and part novel, <a href=\"http://www.amazon.com/City-Beyond-Time-Tales-Metachronopolis-ebook/dp/B00L6WI3PU\"><b><i>CITY BEYOND TIME</i></b></a> is fascinating, melancholy, frightening, and a true masterpiece of story-telling.</br></br></i></p><p>As you can probably imagine, we are very pleased to be able to announce that John C. Wright’s latest book is available today <a href=\"http://www.amazon.com/City-Beyond-Time-Tales-Metachronopolis-ebook/dp/B00L6WI3PU\">on Amazon</a> in Kindle format and <a href=\"http://www.castaliahouse.com/downloads/city-beyond-time/\">at Castalia House</a> in EPUB format. Featuring a cover by the inimitable <a href=\"http://www.dogeareddesign.com/\">Kirk DouPonce</a>, the book consists of six of the aforementioned tales, which, in a manner more convoluted than I can possibly hope to summarize here, collectively tell of the fate of the shining city of Metachronopolis. At 167 pages, it is a relatively short book, but one that you will almost surely find yourself reading more than once as Wright expertly explores the paradoxes inherent in the logic of time travel.</p><p>As Wright’s fans have come to expect,  <i><a href=\"http://www.amazon.com/City-Beyond-Time-Tales-Metachronopolis-ebook/dp/B00L6WI3PU\"><b><i>CITY BEYOND TIME</i></b></a> </i>is more than just an intelligently entertaining story. It is also a thoughtful musing on the nature of power and its corrupting temptations. But no matter how deep the darkness runs, it can never do more than obscure the light.</p><p>And this is more than a book announcement, it is also a charity drive. About a month ago, Mr. Wright contacted me about the possibility of bringing some attention to a charity he wished to support. The charity, called <a href=\"http://www.stillbrave.org/home.html\">Stillbrave</a>, was started by<br> a Christian man who lost his daughter to cancer. Mr. Wright and his wife requested that half his royalties for the first month’s sales be donated to Stillbrave, which we agreed to do. Castalia House also agreed to match his donation.</br></p><p>So, if you buy <i><b>CITY BEYOND TIME</b></i> between now and July 23rd, about half the money Castalia receives will go to Stillbrave, in the name of Mr. and Mrs. John C. Wright. Obviously, you can simply donate directly to the charity, but if you also wish to honor Mr. Wright’s efforts, the most efficient means of doing so will be <a href=\"http://www.castaliahouse.com/downloads/city-beyond-time/\">to purchase the book through Castalia House</a>. If you have not yet read Mr. Wright’s work, you may be interested to know that we are giving away his <a href=\"http://www.amazon.com/Awake-Night-John-C-Wright-ebook/dp/B00K425CL6\"><i><b>AWAKE IN THE NIGHT</b></i></a> today and tomorrow on Amazon.</p></div>",
  "content_text": "Metachronopolis is the golden city beyond time. Ruled by the Masters\nof Time, who can travel freely throughout the multitudinous time lines\nof Man’s history, the city is a shining society of heroes and horrors.\nFor the arrogant Masters, who steal famous men and women out of the past\nand bring them to the eternal city for their amusement, are not only\nbeyond time, but beyond remorse and retribution too.\nCITY BEYOND TIME: Tales of the Fall of Metachronopolis\nis John C. Wright’s mind-bending and astonishingly brilliant take on\ntime travel. In making use of a centuries-spanning perspective similar\nto his highly-regarded\nAWAKE IN THE NIGHT LAND\n, Wright expertly weaves a larger tale out of a series of smaller ones. Part anthology and part novel,\nCITY BEYOND TIME\nis fascinating, melancholy, frightening, and a true masterpiece of story-telling.\nAs you can probably imagine, we are very pleased to be able to announce that John C. Wright’s latest book is available today\non Amazon\nin Kindle format and\nat Castalia House\nin EPUB format. Featuring a cover by the inimitable\nKirk DouPonce\n, the book consists of six of the aforementioned tales, which, in a manner more convoluted than I can possibly hope to summarize here, collectively tell of the fate of the shining city of Metachronopolis. At 167 pages, it is a relatively short book, but one that you will almost surely find yourself reading more than once as Wright expertly explores the paradoxes inherent in the logic of time travel.\nAs Wright’s fans have come to expect,\nCITY BEYOND TIME\nis more than just an intelligently entertaining story. It is also a thoughtful musing on the nature of power and its corrupting temptations. But no matter how deep the darkness runs, it can never do more than obscure the light.\nAnd this is more than a book announcement, it is also a charity drive. About a month ago, Mr. Wright contacted me about the possibility of bringing some attention to a charity he wished to support. The charity, called\nStillbrave\n, was started by\na Christian man who lost his daughter to cancer. Mr. Wright and his wife requested that half his royalties for the first month’s sales be donated to Stillbrave, which we agreed to do. Castalia House also agreed to match his donation.\nSo, if you buy\nCITY BEYOND TIME\nbetween now and July 23rd, about half the money Castalia receives will go to Stillbrave, in the name of Mr. and Mrs. John C. Wright. Obviously, you can simply donate directly to the charity, but if you also wish to honor Mr. Wright’s efforts, the most efficient means of doing so will be\nto purchase the book through Castalia House\n. If you have not yet read Mr. Wright’s work, you may be interested to know that we are giving away his\nAWAKE IN THE NIGHT\ntoday and tomorrow on Amazon.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-23T05:00:00+00:00"
}