{
  "url": "https://voxday.net/2014/06/16/contamination-by-association/",
  "scraped_at": "2025-12-16T12:17:36.197300",
  "title": "Contamination by association",
  "date_display": "June 16, 2014",
  "date_iso": "2014-06-16T06:00:00+00:00",
  "date_from_url": "2014-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In keeping with the argument presented by Tim Atkinson, I encourage left-liberal science fiction writers to <a href=\"http://magpie-moth.blogspot.com/2014/06/dear-conservative-science-fiction.html\">not “give house room” to known child molesters and rapists</a>. Atkinson writes:</p><blockquote class=\"tr_bq\"><p> Now, there’s a conversation to be had about how and whether to read authors with detestable views. I’m not pro-censorship, I’m pro-context. But putting someone prone to racist outbursts on a conservative voting slate for the shortlist for the prestigious Hugo Awards – that sends a entirely different message to the one I think you hoped it would.</p><p>Would Beale have gotten onto the shortlist for Best Novella – which he succeeded in doing – if he hadn’t had this kind of support? We’ll probably never know. But the point is that the Beale-boosting contaminated by association the conservatives-and-libertarians-overlooked-in-SF position the slate was intended at least in part to raise.</p><p>Correia mounts a mainly art-for-arts-sake defence for the inclusion of Beale on his slate (it’s a long post so I’d suggest scrolling or searching for it). Unfortunately, he presses onto deny both the racism of Beale’s statement and of the man himself, which seems at best naïve and at worst disingenuous in light of his public record….</p><p>I have been clear, I hope, that Correia is not supporting Beale over and<br> above putting him on his Hugos slate and is on the record that he<br> himself is not racist. My key point is that putting forward such a<br> divisive, controversial figure (to put it mildly and in terms you might<br> find acceptable) risks contaminating by implication<br> conservative/libertarian positions in science-fiction.</br></br></br></br></br></p></blockquote><p>I find Mr. Atkinson’s concern about messages and contamination to be fascinating. Mr. Atkinson claims my comments made in response to a woman lying about me and repeatedly attacking me are “controversial” and risk “contaminating by implication<br> conservative/libertarian positions in science-fiction” while completely ignoring the fact that, by the same metric, the liberal/left position in science fiction has undeniably been contaminated for 15 years by the documented public evidence that Marion Zimmer Bradley, one of the most influential and celebrated feminist authors that Pink SF/F has ever had, was an abusive, sexually aberrant child molester and incestuous rapist.</br></p><p>Marion Zimmer Bradley was <a href=\"http://www.sff.net/people/stephen.goldin/mzb/reply.html\">convicted on a federal child pornography charge</a> prior to her marrying <a href=\"http://breendoggle.wikia.com/wiki/Breendoggle_Wiki\">the homosexual child molester Walter Breen</a> and editing one of his books <a href=\"http://www.amazon.com/Greek-Love-J-Z-Eglinton/dp/1589636376\">defending pedophilia</a>. Bradley’s own daughter has publicly stated that <a href=\"http://www.teleread.com/writing/marion-zimmer-bradley-child-abuser-says-daughter/\">her mother raped her</a> on more than one occasion. One of Bradley’s lesbian lovers <a href=\"http://www.sff.net/people/stephen.goldin/mzb/lisa_excerpts.html\">testified in a 1998 legal deposition</a> that she was aware Marion Zimmer Bradley sexually harassed and tortured her own daughter, and raped her own son as well.</p><p>SFWA purged me from its ranks for a single tweet, but has not yet seen fit to purge Marion Zimmer Bradley despite her many sex-related crimes dating back to the 1950s. They have not revoked the two Nebula nominations given to a known child molester and a magazine named after her. SFWA still features <a href=\"http://www.sfwa.org/1999/09/rip-marion-zimmer-bradley-1930-1999/\">an RIP notice</a> for Marion Zimmer Bradley, as well as a listing for Bradley’s literary estate and the agent for that estate on its Internet site. (However, it is interesting to note that SFWA never awarded her any distinction as a Grand Master or Author Emeritus whereas she received <a href=\"http://en.wikipedia.org/wiki/World_Fantasy_Award_for_Life_Achievement\">the Lifetime Achievement Award</a> from the World Fantasy Convention in 2000, which suggests that some SFWA officers were probably aware of her problematic history.) But SFWA’s <a href=\"http://www.tor.com/blogs/2010/02/qin-my-own-time-and-seasonq-marion-zimmer-bradleys-lemgthe-shattered-chainlemg-and-lemgthendara-houselemg\">Nebula-winning members</a> and <a href=\"http://www.sfsignal.com/archives/2014/06/deborah-j-ross-on-marion-zimmer-bradley-and-darkover-inspiring-a-generation-of-writers/\">former officers</a> are still writing and publishing laudatory articles about the confirmed child abuser, some as recently as last week.</p><p>To the best of my knowledge, none of the 47 SFWA members who called for my expulsion and none of the 8 SFWA Board members who voted for it have ever openly condemned Marion Zimmer Bradley or called for the revoking of all awards and recognition given to her by various science fiction and fantasy organizations even though knowledge of her crimes has been a literal matter of public record for more than a decade. By the Left’s own transitive logic of contamination-by-association, until they do, it must be assumed that Steven Gould, Rachel Swirsky, Lee Martindale, Matthew Johnson, Bud Sparhawk, Patrick Nielsen Hayden (<a href=\"http://seeking-avalon.blogspot.ch/2009/01/timeline.html?showComment=1233270180000#c5724448489116809651\">a self-described racist</a>), John Scalzi (<a href=\"http://whatever.scalzi.com/2012/10/25/a-fan-letter-to-certain-conservative-politicians/\">a self-described rapist</a>), the Toad of Tor, Jim Hines, Jo Walton, Deborah Ross, Amal El-Mohtar, and dozens of other left-leaning science fiction and fantasy writers are morally degenerate individuals who celebrate homosexuality, torture, child abuse, child molestation, incest, and rape.</p><p>It appears not to be a coincidence that their books are so often packed with sexual perversions and crimes. It is beyond irony, and well into dark parody, to discover that this inclusive and tolerant crowd has long included, tolerated, celebrated, and even <i>honored </i>a felonious feminist child molester. In light of these facts, I sent the following letter to Steven Gould, the President of SFWA, yesterday:</p><p><i>Dear Mr. Gould and the SFWA Board</i><br> <i><br/></i><br> <i>I have three questions in light of the recent public statements that<br> Marion Zimmer Bradley raped her daughter, and the legal depositions of <a href=\"http://www.sff.net/people/stephen.goldin/mzb/excerpts1.html\">Ms Bradley</a> and <a href=\"http://www.sff.net/people/stephen.goldin/mzb/Lisa_Excerpts.html\">Elizabeth Waters</a> which are posted on SFF.net and indicate Marion Zimmer Bradley:</br></i></br></br></p><ol><li><i>was aware of her husband’s criminal sexual molestation of<br> several underage boys</br></i></li><li><i>tortured and sexually molested her own daughter</i></li><li><i>raped her own son</i></li></ol><p><i>First, as a tolerant and inclusive organization, does the<br> behavior which SFWA tolerates include abnormal sexual behavior<br> such as homosexuality, child abuse, torture, and incestuous rape by its<br> members? Second, will the SFWA Board be purging Marion Zimmer<br> Bradley from SFWA’s historical membership list and removing all<br> references to her, her estate, and her estate’s agent from the<br> SFWA web site? Third, will the SFWA Board be retroactively<br> expunging from the Nebula Awards list Marion Zimmer Bradley’s 1976<br> Best Novel nomination for </br></br></br></br></br></br></br></br></i>The Heritage of Hastur<i> and<br> Mary C. Aldridge’s 1990 Best Short Story nomination for “The<br> Adinkra Cloth”, published in </br></br></i>Marion Zimmer Bradley’s Fantasy<br> Magazine<i>.</i><br> <i><br/></i><br> <i>As a former life member of SFWA expelled by the current SFWA<br> Board for a tweet deemed inappropriate, I should be very interested to hear SFWA’s formal position<br> on homosexuality, child molestation, torture and incestuous rape by its<br> members. I look forward to reading your response.</br></br></br></i><br> <i><br/></i><br> <i>Sincerely,</i><br> <i>Vox Day</i></br></br></br></br></br></br></p><p>Some may find it shocking to learn that even after learning about the extent of Marion Zimmer Bradley’s crimes, members of the SFWA <a href=\"http://deirdre.net/the-importance-of-books-and-the-mzb-timeline/\">are <i>still </i>defending <strike>the woman and</strike> her work</a>. I can’t say I’m even surprised.</p><blockquote class=\"tr_bq\"><p> In addition to the lives she harmed, MZB’s works saved the lives of<br> other people by speaking to them when other works and other people would<br> not and/or did not.</br></br></p><p>Truly.</p><p>Rachel E. Holmen, who worked as an editor for <i>Marion Zimmer Bradley’s Fantasy Magazine</i> said about Marion: <i>“When she visited cons, ten or twenty young women an hour would stop by<br> with stories along the lines of “Your books saved my life.””</br></i></p><p>There are other writers being published now who may speak to those<br> same hearts, but if MZB is still the author that would help them, then I<br> think it’s important that her work be available to do so. This doesn’t<br> diminish her very real (and very severe) failings.</br></br></br></p><p>Rachel’s quote points out why we need diverse books by diverse writers that speak to diverse audiences.</p><p>Additionally, MZB gave a start to a lot of women writers—a higher<br> percentage than anyone else in the genre at the time. Those writers<br> helped pave the way for even more female voices in the genre.</br></br></p></blockquote><p>Keep in mind that the SF/F Left <i>openly </i>states that science fiction needs books by child molesters and rapists. Because diversity. And equality. And it remains enthusiastic about Marion Zimmer Bradley’s depraved legacy.</p><blockquote class=\"tr_bq\"><p> <i>“Great to see MZB’s Legacy Continue!”</i><br> – Jim Hines, Hugo Award-winning SFWA member</br></p></blockquote><p>I certainly wouldn’t say so. Would you? The Left always claims the Right is a collection of racist white supremacists. But how seriously can you take the accusations made by collection of child-molesting perverts? The only rape culture to be found in science fiction and fantasy is on the SF/F Left.</p><p>UPDATE: <a href=\"http://alphagameplan.blogspot.com/2014/06/the-female-imperative-triumphs-over-all.html?showComment=1402944435857#c379228536272241816\">Deidre clarifies her position</a> on Marion Zimmer Bradley and makes it clear that she is NOT defending the woman.</p><blockquote class=\"tr_bq\"><p> The entire reason I posted about Marion Zimmer Bradley at all is that<br> she did unconscionable things and enabled unconscionable things and<br> Tor.com was whitewashing that. Full stop.</br></br></p><p>Even if you disagree<br> with me about almost everything else, we probably agree that suicide, in<br> general, is a sad loss of life. There are a lot of people who’ve had<br> rough childhoods who feel suicidal and who have attempted suicide. If<br> MZB’s books help keep a few of them living long enough to get through<br> that dark patch, then I think that is a good thing.</br></br></br></br></br></p><p>It does not change the fact that I think she belonged in prison.</p></blockquote><p>Now, I think she’s wrong as I do not believe the child molester’s books saved a single life, the various claims of attention-seeking drama queens notwithstanding. But regardless, it is clear that she is not defending Marion Zimmer Bradley, she is not claiming that the woman’s actions are justified by the impact of her books, and she should not be criticized for doing so. To the contrary, she should be lauded for calling out the ghastly MZB-glorifying actions of Tor.com and others.</p></div>",
  "content_text": "In keeping with the argument presented by Tim Atkinson, I encourage left-liberal science fiction writers to\nnot “give house room” to known child molesters and rapists\n. Atkinson writes:\nNow, there’s a conversation to be had about how and whether to read authors with detestable views. I’m not pro-censorship, I’m pro-context. But putting someone prone to racist outbursts on a conservative voting slate for the shortlist for the prestigious Hugo Awards – that sends a entirely different message to the one I think you hoped it would.\nWould Beale have gotten onto the shortlist for Best Novella – which he succeeded in doing – if he hadn’t had this kind of support? We’ll probably never know. But the point is that the Beale-boosting contaminated by association the conservatives-and-libertarians-overlooked-in-SF position the slate was intended at least in part to raise.\nCorreia mounts a mainly art-for-arts-sake defence for the inclusion of Beale on his slate (it’s a long post so I’d suggest scrolling or searching for it). Unfortunately, he presses onto deny both the racism of Beale’s statement and of the man himself, which seems at best naïve and at worst disingenuous in light of his public record….\nI have been clear, I hope, that Correia is not supporting Beale over and\nabove putting him on his Hugos slate and is on the record that he\nhimself is not racist. My key point is that putting forward such a\ndivisive, controversial figure (to put it mildly and in terms you might\nfind acceptable) risks contaminating by implication\nconservative/libertarian positions in science-fiction.\nI find Mr. Atkinson’s concern about messages and contamination to be fascinating. Mr. Atkinson claims my comments made in response to a woman lying about me and repeatedly attacking me are “controversial” and risk “contaminating by implication\nconservative/libertarian positions in science-fiction” while completely ignoring the fact that, by the same metric, the liberal/left position in science fiction has undeniably been contaminated for 15 years by the documented public evidence that Marion Zimmer Bradley, one of the most influential and celebrated feminist authors that Pink SF/F has ever had, was an abusive, sexually aberrant child molester and incestuous rapist.\nMarion Zimmer Bradley was\nconvicted on a federal child pornography charge\nprior to her marrying\nthe homosexual child molester Walter Breen\nand editing one of his books\ndefending pedophilia\n. Bradley’s own daughter has publicly stated that\nher mother raped her\non more than one occasion. One of Bradley’s lesbian lovers\ntestified in a 1998 legal deposition\nthat she was aware Marion Zimmer Bradley sexually harassed and tortured her own daughter, and raped her own son as well.\nSFWA purged me from its ranks for a single tweet, but has not yet seen fit to purge Marion Zimmer Bradley despite her many sex-related crimes dating back to the 1950s. They have not revoked the two Nebula nominations given to a known child molester and a magazine named after her. SFWA still features\nan RIP notice\nfor Marion Zimmer Bradley, as well as a listing for Bradley’s literary estate and the agent for that estate on its Internet site. (However, it is interesting to note that SFWA never awarded her any distinction as a Grand Master or Author Emeritus whereas she received\nthe Lifetime Achievement Award\nfrom the World Fantasy Convention in 2000, which suggests that some SFWA officers were probably aware of her problematic history.) But SFWA’s\nNebula-winning members\nand\nformer officers\nare still writing and publishing laudatory articles about the confirmed child abuser, some as recently as last week.\nTo the best of my knowledge, none of the 47 SFWA members who called for my expulsion and none of the 8 SFWA Board members who voted for it have ever openly condemned Marion Zimmer Bradley or called for the revoking of all awards and recognition given to her by various science fiction and fantasy organizations even though knowledge of her crimes has been a literal matter of public record for more than a decade. By the Left’s own transitive logic of contamination-by-association, until they do, it must be assumed that Steven Gould, Rachel Swirsky, Lee Martindale, Matthew Johnson, Bud Sparhawk, Patrick Nielsen Hayden (\na self-described racist\n), John Scalzi (\na self-described rapist\n), the Toad of Tor, Jim Hines, Jo Walton, Deborah Ross, Amal El-Mohtar, and dozens of other left-leaning science fiction and fantasy writers are morally degenerate individuals who celebrate homosexuality, torture, child abuse, child molestation, incest, and rape.\nIt appears not to be a coincidence that their books are so often packed with sexual perversions and crimes. It is beyond irony, and well into dark parody, to discover that this inclusive and tolerant crowd has long included, tolerated, celebrated, and even\nhonored\na felonious feminist child molester. In light of these facts, I sent the following letter to Steven Gould, the President of SFWA, yesterday:\nDear Mr. Gould and the SFWA Board\nI have three questions in light of the recent public statements that\nMarion Zimmer Bradley raped her daughter, and the legal depositions of\nMs Bradley\nand\nElizabeth Waters\nwhich are posted on SFF.net and indicate Marion Zimmer Bradley:\nwas aware of her husband’s criminal sexual molestation of\nseveral underage boys\ntortured and sexually molested her own daughter\nraped her own son\nFirst, as a tolerant and inclusive organization, does the\nbehavior which SFWA tolerates include abnormal sexual behavior\nsuch as homosexuality, child abuse, torture, and incestuous rape by its\nmembers? Second, will the SFWA Board be purging Marion Zimmer\nBradley from SFWA’s historical membership list and removing all\nreferences to her, her estate, and her estate’s agent from the\nSFWA web site? Third, will the SFWA Board be retroactively\nexpunging from the Nebula Awards list Marion Zimmer Bradley’s 1976\nBest Novel nomination for\nThe Heritage of Hastur\nand\nMary C. Aldridge’s 1990 Best Short Story nomination for “The\nAdinkra Cloth”, published in\nMarion Zimmer Bradley’s Fantasy\nMagazine\n.\nAs a former life member of SFWA expelled by the current SFWA\nBoard for a tweet deemed inappropriate, I should be very interested to hear SFWA’s formal position\non homosexuality, child molestation, torture and incestuous rape by its\nmembers. I look forward to reading your response.\nSincerely,\nVox Day\nSome may find it shocking to learn that even after learning about the extent of Marion Zimmer Bradley’s crimes, members of the SFWA\nare\nstill\ndefending\nthe woman and\nher work\n. I can’t say I’m even surprised.\nIn addition to the lives she harmed, MZB’s works saved the lives of\nother people by speaking to them when other works and other people would\nnot and/or did not.\nTruly.\nRachel E. Holmen, who worked as an editor for\nMarion Zimmer Bradley’s Fantasy Magazine\nsaid about Marion:\n“When she visited cons, ten or twenty young women an hour would stop by\nwith stories along the lines of “Your books saved my life.””\nThere are other writers being published now who may speak to those\nsame hearts, but if MZB is still the author that would help them, then I\nthink it’s important that her work be available to do so. This doesn’t\ndiminish her very real (and very severe) failings.\nRachel’s quote points out why we need diverse books by diverse writers that speak to diverse audiences.\nAdditionally, MZB gave a start to a lot of women writers—a higher\npercentage than anyone else in the genre at the time. Those writers\nhelped pave the way for even more female voices in the genre.\nKeep in mind that the SF/F Left\nopenly\nstates that science fiction needs books by child molesters and rapists. Because diversity. And equality. And it remains enthusiastic about Marion Zimmer Bradley’s depraved legacy.\n“Great to see MZB’s Legacy Continue!”\n– Jim Hines, Hugo Award-winning SFWA member\nI certainly wouldn’t say so. Would you? The Left always claims the Right is a collection of racist white supremacists. But how seriously can you take the accusations made by collection of child-molesting perverts? The only rape culture to be found in science fiction and fantasy is on the SF/F Left.\nUPDATE:\nDeidre clarifies her position\non Marion Zimmer Bradley and makes it clear that she is NOT defending the woman.\nThe entire reason I posted about Marion Zimmer Bradley at all is that\nshe did unconscionable things and enabled unconscionable things and\nTor.com was whitewashing that. Full stop.\nEven if you disagree\nwith me about almost everything else, we probably agree that suicide, in\ngeneral, is a sad loss of life. There are a lot of people who’ve had\nrough childhoods who feel suicidal and who have attempted suicide. If\nMZB’s books help keep a few of them living long enough to get through\nthat dark patch, then I think that is a good thing.\nIt does not change the fact that I think she belonged in prison.\nNow, I think she’s wrong as I do not believe the child molester’s books saved a single life, the various claims of attention-seeking drama queens notwithstanding. But regardless, it is clear that she is not defending Marion Zimmer Bradley, she is not claiming that the woman’s actions are justified by the impact of her books, and she should not be criticized for doing so. To the contrary, she should be lauded for calling out the ghastly MZB-glorifying actions of Tor.com and others.",
  "tags": [
    "Hugo Award",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-16T05:00:00+00:00"
}