{
  "url": "https://voxday.net/2014/06/29/defective-literature/",
  "scraped_at": "2025-12-16T12:19:05.337937",
  "title": "Birth-defective literature",
  "date_display": "June 29, 2014",
  "date_iso": "2014-06-29T10:05:00+00:00",
  "date_from_url": "2014-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright <a href=\"http://www.scifiwright.com/2014/06/a-comment-on-political-activism-in-fairy-stories/\">answers a question</a> concerning whether books can contain messages concerning politics, religion, or philosophy without being propaganda:</p><blockquote class=\"tr_bq\"><p> I am a Christian, hence I regard God as the ultimate floor of reality, the one necessary being from which all contingent beings flow. If I am a faithful Christian, this one ultimate reality influences all lesser realities, and there is no neutral ground. Even something as lighthearted as a fight scene, I must decide if the characters act like pagan warriors or chivalrous knights, that is, with the romance of Christendom. Even a love scene must show love to be romantic, as a Christian sees love, or as situation of shameful weakness, erotic madness, or mutual exploitation, as various pagan and secular worldviews see love.</p><p>The Leftist for whom politics is the ultimate floor of being is an idolater, and makes power arrangements his personal little crappy god. It influences everything in his thought and life, and if left unchecked will eventually ruin his writing.</p><p>The Leftist who is a faithful Leftist only on their sabbath days, and otherwise ignores the business (and that would be the majority of Leftists) can write a perfectly passable story about space pirates kidnapping space princesses without any hint of politics, to the satisfaction of all involved. He will write his love scenes with romance and his fight scenes with chivalry without noticing or caring about the origin of these Christian cultural artifacts. He will not think of them as particularly Christian, merely as part of the moral atmosphere and cultural background of his society. He will not notice the incongruity between his art and his philosophy.</p></blockquote><p>The distinction Wright is making can be seen very clearly in the difference between Larry Correia’s MONSTER HUNTER NEMESIS and Greg Bear’s DARWIN’S RADIO, both of which I recently finished reading. Now, Bear is much more highly regarded in the science fiction community. DARWIN’S RADIO won the Nebula Award for best novel and was nominated for the Hugo, Locus SF, and John W. Campbell awards. Bear is a multiple award-winner who is described as a hard SF writer “who often addresses major questions in contemporary science and culture with fictional solutions.”</p><p>Larry, on the other hand, can’t get nominated for the Hugo without being accused of rape, child abuse, and sexual deviancy… no, wait, that was Marion Zimmer Bradley. Or was it Samuel Delany? Anyhow, the point is that his books are generally considered little more than pulp urban fantasy that is popular among right-wing mouth breathers due to its heavy gun-porn content. And that’s not an entirely unfair characterization, if one looks solely at the early Monster Hunter books.</p><p>But here is the interesting thing. I will come right out and say that NEMESIS will hold up much better over time than DARWIN’S RADIO, and eventually will be seen to be a deeper, more serious novel, because, under the skin of its hellacious action-fury, the former contains the significant examination of some long-contemplated philosophical questions, whereas despite its erudite flights of scientific fancy, the latter contains nothing deeper than cheap atheist propaganda.</p><p>I’ll explain the philosophical questions of NEMESIS on Monday, when I review the book that is easily the best of the Monster Hunter series to date. And as for the propagandistic elements running so strong within DARWIN’S RADIO, the book is almost startling for its contempt for the unwashed, easily frightened masses, with a lack of faith in humanity surpassed only by Isaac Asimov’s “Nightfall”.</p><p>The core idea is a response to the fossil and DNA dichotomies that falsify the models supporting the theory of evolution by natural selection: evolution doesn’t merely punctuate its equilibrium, but occurs instantaneously across a broad spectrum of a species under stress because [long complicated theory concerning viruses I couldn’t possibly explain on the basis of a single reading.] Informed? Highly. Ingenious? Absolutely. But then recall that the “major question” he’s nominally addressing (despite never expressing any serious doubts about the consensus dogma), is “why doesn’t the evidence support the conventional neo-Darwinian synthesis?”</p><p>And his answer is absurd. Magic Science Elves or Alien Uplifters or even a bored, sadistic Creator God would have been considerably more plausible than the Magic Ancient Virus-Program, which raises far more questions than it purports to answer. The real question underlying the nominal one is: “just how terribly would those awful little people who are too ignorant to place blind faith in scientistry react if they found themselves in a situation where living as a traditional married couple would cause them to a) believe that the wife was unfaithful, and, b) humanity was on the verge of becoming extinct through miscarriages.</p><p>As you can probably imagine, it isn’t long before we are treated to riots, televangelists, thousands of women being murdered by their husbands, the president and several governors being assassinated by a bomb, and even a ritual lampooning of Pat Robertson.</p><blockquote class=\"tr_bq\"><p> “They’re calling it ‘original sin,’ you know that?”</p><p>“I hadn’t heard that,” Augustine said.</p><p>“Tune in the Christian Broadcasting Network. They’re splitting constituencies all across America. Pat Robertson is telling his audience these monsters are God’s final test before the arrival of the new Kingdom of Heaven. He says our DNA is trying to purge itself of all our accumulated sins, to…what was his phrase, Ted?”</p><p>The aide said, “Clean up our records before God calls Judgment Day.”</p><p>“That was it.”</p><p>“We still don’t control the airwaves, Frank,” Augustine said. “I can’t be held responsible…”</p><p>“Half a dozen other televangelists say these unborn children are the devil’s spawn,” Shawbeck continued, building up steam. “Born with the mark of Satan, one-eyed and hare-lipped. Some are even saying they have cloven hooves.”</p><p>Augustine shook his head sadly.</p><p>“They’re your support group now,” Shawbeck said, and waved his arm for the aide to step forward. He struggled to his feet, shoved the crutches into his armpits. “I’m tendering my resignation tomorrow morning. From the Taskforce and from the NIH. I’m burned out. I can’t take any more of this ignorance—my own or anybody else’s. Just thought you should be the first to know. Maybe you can consolidate all the power.”</p></blockquote><p>Oh, that dreadful ignorance! Oh, those awful violence-prone Christians! Only turning to science and giving unlimited power to politicians wise enough to unhesitatingly accept the untested and unproven assertions of scientists can save Man! With only superficial changes, this could have just as easily been a book about global warming, or nuclear disarmament, or an unexpected attack by rapidly evolving salamanders.</p><p>That’s what Wright means when he talks about the leftist ruining his own writing. I found myself putting down DARWIN’S RADIO twice, and had to force myself to finish it once it became clear that the philosophical message was not merely an integral part of the story, the message WAS the story. The characters, the plot, even the “major questions addressed” were only there to serve the all-important Message: <i>Evolution by natural selection is real despite the appearance of the evidence and only Scientists can save you from the blind fury of the ignorant masses.</i></p><p>So, it’s not terribly surprising to discover that despite its scientific erudition and its panoply of literary awards, DARWIN’S RADIO is presently ranked #731,269 on Amazon and Greg Bear is now reduced to writing game tie-in novels for an Xbox game. This leads me to conclude it might be interesting, and more than a little informative in this regard, to compare Bear’s CITY AT THE END OF TIME to John C. Wright’s CITY BEYOND TIME.</p></div>",
  "content_text": "John C. Wright\nanswers a question\nconcerning whether books can contain messages concerning politics, religion, or philosophy without being propaganda:\nI am a Christian, hence I regard God as the ultimate floor of reality, the one necessary being from which all contingent beings flow. If I am a faithful Christian, this one ultimate reality influences all lesser realities, and there is no neutral ground. Even something as lighthearted as a fight scene, I must decide if the characters act like pagan warriors or chivalrous knights, that is, with the romance of Christendom. Even a love scene must show love to be romantic, as a Christian sees love, or as situation of shameful weakness, erotic madness, or mutual exploitation, as various pagan and secular worldviews see love.\nThe Leftist for whom politics is the ultimate floor of being is an idolater, and makes power arrangements his personal little crappy god. It influences everything in his thought and life, and if left unchecked will eventually ruin his writing.\nThe Leftist who is a faithful Leftist only on their sabbath days, and otherwise ignores the business (and that would be the majority of Leftists) can write a perfectly passable story about space pirates kidnapping space princesses without any hint of politics, to the satisfaction of all involved. He will write his love scenes with romance and his fight scenes with chivalry without noticing or caring about the origin of these Christian cultural artifacts. He will not think of them as particularly Christian, merely as part of the moral atmosphere and cultural background of his society. He will not notice the incongruity between his art and his philosophy.\nThe distinction Wright is making can be seen very clearly in the difference between Larry Correia’s MONSTER HUNTER NEMESIS and Greg Bear’s DARWIN’S RADIO, both of which I recently finished reading. Now, Bear is much more highly regarded in the science fiction community. DARWIN’S RADIO won the Nebula Award for best novel and was nominated for the Hugo, Locus SF, and John W. Campbell awards. Bear is a multiple award-winner who is described as a hard SF writer “who often addresses major questions in contemporary science and culture with fictional solutions.”\nLarry, on the other hand, can’t get nominated for the Hugo without being accused of rape, child abuse, and sexual deviancy… no, wait, that was Marion Zimmer Bradley. Or was it Samuel Delany? Anyhow, the point is that his books are generally considered little more than pulp urban fantasy that is popular among right-wing mouth breathers due to its heavy gun-porn content. And that’s not an entirely unfair characterization, if one looks solely at the early Monster Hunter books.\nBut here is the interesting thing. I will come right out and say that NEMESIS will hold up much better over time than DARWIN’S RADIO, and eventually will be seen to be a deeper, more serious novel, because, under the skin of its hellacious action-fury, the former contains the significant examination of some long-contemplated philosophical questions, whereas despite its erudite flights of scientific fancy, the latter contains nothing deeper than cheap atheist propaganda.\nI’ll explain the philosophical questions of NEMESIS on Monday, when I review the book that is easily the best of the Monster Hunter series to date. And as for the propagandistic elements running so strong within DARWIN’S RADIO, the book is almost startling for its contempt for the unwashed, easily frightened masses, with a lack of faith in humanity surpassed only by Isaac Asimov’s “Nightfall”.\nThe core idea is a response to the fossil and DNA dichotomies that falsify the models supporting the theory of evolution by natural selection: evolution doesn’t merely punctuate its equilibrium, but occurs instantaneously across a broad spectrum of a species under stress because [long complicated theory concerning viruses I couldn’t possibly explain on the basis of a single reading.] Informed? Highly. Ingenious? Absolutely. But then recall that the “major question” he’s nominally addressing (despite never expressing any serious doubts about the consensus dogma), is “why doesn’t the evidence support the conventional neo-Darwinian synthesis?”\nAnd his answer is absurd. Magic Science Elves or Alien Uplifters or even a bored, sadistic Creator God would have been considerably more plausible than the Magic Ancient Virus-Program, which raises far more questions than it purports to answer. The real question underlying the nominal one is: “just how terribly would those awful little people who are too ignorant to place blind faith in scientistry react if they found themselves in a situation where living as a traditional married couple would cause them to a) believe that the wife was unfaithful, and, b) humanity was on the verge of becoming extinct through miscarriages.\nAs you can probably imagine, it isn’t long before we are treated to riots, televangelists, thousands of women being murdered by their husbands, the president and several governors being assassinated by a bomb, and even a ritual lampooning of Pat Robertson.\n“They’re calling it ‘original sin,’ you know that?”\n“I hadn’t heard that,” Augustine said.\n“Tune in the Christian Broadcasting Network. They’re splitting constituencies all across America. Pat Robertson is telling his audience these monsters are God’s final test before the arrival of the new Kingdom of Heaven. He says our DNA is trying to purge itself of all our accumulated sins, to…what was his phrase, Ted?”\nThe aide said, “Clean up our records before God calls Judgment Day.”\n“That was it.”\n“We still don’t control the airwaves, Frank,” Augustine said. “I can’t be held responsible…”\n“Half a dozen other televangelists say these unborn children are the devil’s spawn,” Shawbeck continued, building up steam. “Born with the mark of Satan, one-eyed and hare-lipped. Some are even saying they have cloven hooves.”\nAugustine shook his head sadly.\n“They’re your support group now,” Shawbeck said, and waved his arm for the aide to step forward. He struggled to his feet, shoved the crutches into his armpits. “I’m tendering my resignation tomorrow morning. From the Taskforce and from the NIH. I’m burned out. I can’t take any more of this ignorance—my own or anybody else’s. Just thought you should be the first to know. Maybe you can consolidate all the power.”\nOh, that dreadful ignorance! Oh, those awful violence-prone Christians! Only turning to science and giving unlimited power to politicians wise enough to unhesitatingly accept the untested and unproven assertions of scientists can save Man! With only superficial changes, this could have just as easily been a book about global warming, or nuclear disarmament, or an unexpected attack by rapidly evolving salamanders.\nThat’s what Wright means when he talks about the leftist ruining his own writing. I found myself putting down DARWIN’S RADIO twice, and had to force myself to finish it once it became clear that the philosophical message was not merely an integral part of the story, the message WAS the story. The characters, the plot, even the “major questions addressed” were only there to serve the all-important Message:\nEvolution by natural selection is real despite the appearance of the evidence and only Scientists can save you from the blind fury of the ignorant masses.\nSo, it’s not terribly surprising to discover that despite its scientific erudition and its panoply of literary awards, DARWIN’S RADIO is presently ranked #731,269 on Amazon and Greg Bear is now reduced to writing game tie-in novels for an Xbox game. This leads me to conclude it might be interesting, and more than a little informative in this regard, to compare Bear’s CITY AT THE END OF TIME to John C. Wright’s CITY BEYOND TIME.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-29T09:05:00+00:00"
}