{
  "url": "https://voxday.net/2014/06/10/desperately-avoiding-defau/",
  "scraped_at": "2025-12-16T12:16:59.971569",
  "title": "Desperately avoiding default",
  "date_display": "June 10, 2014",
  "date_iso": "2014-06-10T14:36:00+00:00",
  "date_from_url": "2014-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One thing you have to understand about every federal debt-related action: it’s not for the benefit of the borrowers, but for the benefit of the banks. We saw this in 2009 with “mortgage reform” and it will be the same with <a href=\"http://www.foxnews.com/politics/2014/06/08/obama-prepares-to-take-executive-action-expanding-student-loan-program/\">“student loan reform”</a>:</p><blockquote class=\"tr_bq\"><p> President Barack Obama is prepping new executive steps to help Americans struggling to pay off their student debt, and throwing his support behind Senate Democratic legislation with a similar goal but potentially a much more profound impact.</p><p>Obama on Monday will announce he’s expanding his “Pay As You Earn” program that lets borrowers pay no more than 10 percent of their monthly income in loan payments, the White House said. Currently, the program is only available to those who started borrowing after October 2007 and kept borrowing after October 2011. Obama plans to start allowing those who borrowed earlier to participate, potentially extending the benefit to millions more borrowers.</p></blockquote><p> The problem Obama is addressing is that although it is impossible for graduates (and non-graduates) to formally default on their student loans, they will effectively default on them when they simply don’t have the money to make their payments.</p><p>This is simply reducing the payments in order to keep them on the hook longer and thereby prevent the loans from being correctly recognized as bad loans that have to be written off. As Karl Denninger correctly ascertains, the ultimate goal is to keep the<br> young borrowers on the hook, but force taxpayers to pay off their<br> loans. It about the banks not the borrowers. It’s ALWAYS about the banks.</br></br></p></div>",
  "content_text": "One thing you have to understand about every federal debt-related action: it’s not for the benefit of the borrowers, but for the benefit of the banks. We saw this in 2009 with “mortgage reform” and it will be the same with\n“student loan reform”\n:\nPresident Barack Obama is prepping new executive steps to help Americans struggling to pay off their student debt, and throwing his support behind Senate Democratic legislation with a similar goal but potentially a much more profound impact.\nObama on Monday will announce he’s expanding his “Pay As You Earn” program that lets borrowers pay no more than 10 percent of their monthly income in loan payments, the White House said. Currently, the program is only available to those who started borrowing after October 2007 and kept borrowing after October 2011. Obama plans to start allowing those who borrowed earlier to participate, potentially extending the benefit to millions more borrowers.\nThe problem Obama is addressing is that although it is impossible for graduates (and non-graduates) to formally default on their student loans, they will effectively default on them when they simply don’t have the money to make their payments.\nThis is simply reducing the payments in order to keep them on the hook longer and thereby prevent the loans from being correctly recognized as bad loans that have to be written off. As Karl Denninger correctly ascertains, the ultimate goal is to keep the\nyoung borrowers on the hook, but force taxpayers to pay off their\nloans. It about the banks not the borrowers. It’s ALWAYS about the banks.",
  "tags": [
    "banks",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-10T13:36:00+00:00"
}