{
  "url": "https://voxday.net/2014/06/10/e-dia-de-portugues/",
  "scraped_at": "2025-12-16T12:16:56.290059",
  "title": "É dia de Português",
  "date_display": "June 10, 2014",
  "date_iso": "2014-06-10T06:58:00+00:00",
  "date_from_url": "2014-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/QUANTUM-MORTIS-Homem-Desintegrado-Portuguese-ebook/dp/B00KV0WUIE\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/06/AMD_BP_256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/06/AMD_BP_256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>O planeta independente Rhysalan oferece Asilo para 1.462 governos<br> exilados. É responsabilidade do departamento de Xenocriminologia e<br> Relações Alienígenas da Divisão Militar de Investigação de Crimes manter<br> a rédea curta com as centenas de milhares de xenos residindo no<br> planeta. Assassinatos, revoluções, guerras civis e tentativas de<br> genocídios planetários fazem parte da rotina de trabalho do Subtenente<br> Comandante Graven Tower, da DMIC-XRA.</br></br></br></br></br></br></p><p>Em acréscimo a um aerovar armado com mísseis, à sua confiável Sphinx<br> CPB-18 e às políticas extremamente liberais da DMIC com relação a danos<br> colaterais e vítimas civis, o Comandante Tower é estimulado por sua<br> extrema xenofobia, assim como por uma inteligência de máquina com<br> aumento de realidade de categoria militar que acredita que encontrou<br> Deus. No meio deste cenário, quando os restos desintegrados do herdeiro<br> legítimo de uma casa real alienígena são descobertos nas ruas de Trans<br> Paradis, a questão não é tanto se no final os assassinos serão<br> encontrados, mas se são os criminosos ou os investigadores criminais que<br> vão contribuir mais para a soma total de mortos.</br></br></br></br></br></br></br></br></br></p><p><a href=\"http://www.amazon.com/QUANTUM-MORTIS-Gravidade-Mortal-Portuguese-ebook/dp/B00KVUVFSA\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/06/GK_BP_200.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/06/GK_BP_200.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>QUANTUM MORTIS é a série de mistério de Ficção Científica Militar<br> repleta de ação de Vox Day – indicado para o prêmio Hugo e autor da<br> série de fantasias épicas As Artes da Escuridão e da Luz – e Steve<br> Rzasa.</br></br></br></p><p>Thanks to Israel and Daniel, Castalia House has released its second and third books in Portuguese today. Two QUANTUM MORTIS books, <a href=\"http://www.amazon.com/QUANTUM-MORTIS-Homem-Desintegrado-Portuguese-ebook/dp/B00KV0WUIE\"><i><b>Um Homem Desintegrado</b></i></a> and <i><b><a href=\"http://www.amazon.com/QUANTUM-MORTIS-Gravidade-Mortal-Portuguese-ebook/dp/B00KVUVFSA\">Gravidade Mortal</a></b></i>, have joined <b><i>Uma Magia Perdida</i></b> in our Portuguese language catalog. This should be useful for those, like The Perfect Aryan Male, who are brushing up on their Brazilian Portuguese. Please note that both <b><i>Gravidade Mortal</i></b> and <b><i>Uma Magia Perdida</i></b> will be free downloads tomorrow and Thursday.</p><p>And in other Castalia House news, we’re pleased to announce the first of our new bloggers. Jeff Johnson of the Space Gaming Blog will be posting on Mondays. Yesterday he got off on exactly the right foot with <a href=\"http://www.castaliahouse.com/review-fate-of-the-kinunir-by-robert-e-vardeman/\">a review of the first of the new Traveller novels</a> from Marc Miller, <i>Fate of the Kinunir</i>. The Castalia House blog is rapidly becoming a destination in its own right, with four new bloggers joining Daniel, Mascaro, and Anson in posting essays, book reviews and interviews of independent and established authors alike. So, if you’re interested in following the Blue SF revolution as it proceeds, you’ll want to check it out on a regular basis.</p></div>",
  "content_text": "O planeta independente Rhysalan oferece Asilo para 1.462 governos\nexilados. É responsabilidade do departamento de Xenocriminologia e\nRelações Alienígenas da Divisão Militar de Investigação de Crimes manter\na rédea curta com as centenas de milhares de xenos residindo no\nplaneta. Assassinatos, revoluções, guerras civis e tentativas de\ngenocídios planetários fazem parte da rotina de trabalho do Subtenente\nComandante Graven Tower, da DMIC-XRA.\nEm acréscimo a um aerovar armado com mísseis, à sua confiável Sphinx\nCPB-18 e às políticas extremamente liberais da DMIC com relação a danos\ncolaterais e vítimas civis, o Comandante Tower é estimulado por sua\nextrema xenofobia, assim como por uma inteligência de máquina com\naumento de realidade de categoria militar que acredita que encontrou\nDeus. No meio deste cenário, quando os restos desintegrados do herdeiro\nlegítimo de uma casa real alienígena são descobertos nas ruas de Trans\nParadis, a questão não é tanto se no final os assassinos serão\nencontrados, mas se são os criminosos ou os investigadores criminais que\nvão contribuir mais para a soma total de mortos.\nQUANTUM MORTIS é a série de mistério de Ficção Científica Militar\nrepleta de ação de Vox Day – indicado para o prêmio Hugo e autor da\nsérie de fantasias épicas As Artes da Escuridão e da Luz – e Steve\nRzasa.\nThanks to Israel and Daniel, Castalia House has released its second and third books in Portuguese today. Two QUANTUM MORTIS books,\nUm Homem Desintegrado\nand\nGravidade Mortal\n, have joined\nUma Magia Perdida\nin our Portuguese language catalog. This should be useful for those, like The Perfect Aryan Male, who are brushing up on their Brazilian Portuguese. Please note that both\nGravidade Mortal\nand\nUma Magia Perdida\nwill be free downloads tomorrow and Thursday.\nAnd in other Castalia House news, we’re pleased to announce the first of our new bloggers. Jeff Johnson of the Space Gaming Blog will be posting on Mondays. Yesterday he got off on exactly the right foot with\na review of the first of the new Traveller novels\nfrom Marc Miller,\nFate of the Kinunir\n. The Castalia House blog is rapidly becoming a destination in its own right, with four new bloggers joining Daniel, Mascaro, and Anson in posting essays, book reviews and interviews of independent and established authors alike. So, if you’re interested in following the Blue SF revolution as it proceeds, you’ll want to check it out on a regular basis.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-10T05:58:00+00:00"
}