{
  "url": "https://voxday.net/2014/06/17/game-of-thrones-season-4-finale/",
  "scraped_at": "2025-12-16T12:17:46.816652",
  "title": "Game of Thrones Season 4 finale",
  "date_display": "June 17, 2014",
  "date_iso": "2014-06-17T13:00:00+00:00",
  "date_from_url": "2014-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In addition to streamlining the story, Messrs. Benioff and Weiss appear to have a better grip on where <i>A Song of Ice and Fire</i> is going than Mr. Martin does himself. Not that I appreciated all their innovations; while apparently aborting Brienne of Tarth’s tedious wandering is a true mercy, it was just silly to see her defeating the Hound, not once, but twice. But at least a) she is a physical freak, and b) they made it look like a close-run thing, so it wasn’t too ridiculously Pink in these latter and oft very silly days.</p><p>I was wondering what on Earth Stannis Baratheon was doing NORTH of the Wall. Why does Mance need a tunnel to go south if Stannis doesn’t need it to go south? Ships, one presumes, but this was not actually explained that I noticed. And how did Stannis’s tiny force, even augmented by Iron Bank financing, so easily demolish the 100,000 strong army of the Wildings?</p><p>Despite these questions, it promises to avoid the interminable Stannis in the Snow chapters that so dragged down the latter books. And Benioff and Weiss have wisely kept the Mereen elements to a bare minimum, retaining only the emotionally powerful aspects of the Danaerys storyline – losing Ser Jorat and having to chain her dragons – rather than waste time on bureaucratic and romantic matters.</p><p>Tyrion’s escape seemed rushed. The murder of Shay was more like an accident than a betrayal punished, and it seemed odd that Tywin didn’t simply point out that he sent Jaime and Tyrion’s escape was all his doing. But Tyrion redeemed the whole scene with his final, hissed “I have always been your son”. One won’t often see two better actors facing off than in that last father-son Lannister showdown.</p><p>I also liked that Benioff and Weiss clearly grasp how boring the Bran storyline is. Short, action-packed, and full of skeletons erupting from the snow, that was definitely a great way to go. Burying Bran under a tree and leaving him there to vegetate for the rest of the show strikes me as an excellent idea.</p><p>All in all, I am considerably more optimistic about Season Five than I am about <i>The Winds of Winter</i>, although I would very much like to be proven wrong and to see Mr. Martin regain his fastball.</p></div>",
  "content_text": "In addition to streamlining the story, Messrs. Benioff and Weiss appear to have a better grip on where\nA Song of Ice and Fire\nis going than Mr. Martin does himself. Not that I appreciated all their innovations; while apparently aborting Brienne of Tarth’s tedious wandering is a true mercy, it was just silly to see her defeating the Hound, not once, but twice. But at least a) she is a physical freak, and b) they made it look like a close-run thing, so it wasn’t too ridiculously Pink in these latter and oft very silly days.\nI was wondering what on Earth Stannis Baratheon was doing NORTH of the Wall. Why does Mance need a tunnel to go south if Stannis doesn’t need it to go south? Ships, one presumes, but this was not actually explained that I noticed. And how did Stannis’s tiny force, even augmented by Iron Bank financing, so easily demolish the 100,000 strong army of the Wildings?\nDespite these questions, it promises to avoid the interminable Stannis in the Snow chapters that so dragged down the latter books. And Benioff and Weiss have wisely kept the Mereen elements to a bare minimum, retaining only the emotionally powerful aspects of the Danaerys storyline – losing Ser Jorat and having to chain her dragons – rather than waste time on bureaucratic and romantic matters.\nTyrion’s escape seemed rushed. The murder of Shay was more like an accident than a betrayal punished, and it seemed odd that Tywin didn’t simply point out that he sent Jaime and Tyrion’s escape was all his doing. But Tyrion redeemed the whole scene with his final, hissed “I have always been your son”. One won’t often see two better actors facing off than in that last father-son Lannister showdown.\nI also liked that Benioff and Weiss clearly grasp how boring the Bran storyline is. Short, action-packed, and full of skeletons erupting from the snow, that was definitely a great way to go. Burying Bran under a tree and leaving him there to vegetate for the rest of the show strikes me as an excellent idea.\nAll in all, I am considerably more optimistic about Season Five than I am about\nThe Winds of Winter\n, although I would very much like to be proven wrong and to see Mr. Martin regain his fastball.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-17T12:00:00+00:00"
}