{
  "url": "https://voxday.net/2014/06/23/holland-v-chile/",
  "scraped_at": "2025-12-16T12:18:30.695236",
  "title": "Holland v Chile",
  "date_display": "June 23, 2014",
  "date_iso": "2014-06-23T19:17:00+00:00",
  "date_from_url": "2014-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am a little bit nervous after watching the Oranje defeat Chile, 2-0. I’m not certain that Arjen Robben <i>passing the ball</i> while in shooting range is a definite sign of the Apocalypse, but it strikes me as an ominous harbinger indeed.. Other than that surreal moment, which was beautifully set up by a long ball from the left back, Holland was in charge without ever looking likely to score. But Schneider’s substitute put in a header for his first-ever touch of the ball in a World Cup match – not a bad start – and Holland finished with all 9 points.</p><p>While Croatia v Mexico is the more interesting game, I’m tempted to watch Brazil. They have really looked like nothing the first two games, and if they don’t kick it up a notch, they might very well lose, and lose handily, to European teams like Holland, France, and to a lesser extent, Germany, that are clicking on all cylinders. Perhaps the Brazilians are simply cruising, but it can’t be argued that with names like Fred, Hulk, Bernard, and Oscar, this team seems to lack more than a little of the traditional Brazilian magic.</p><p>UPDATE: 2-1 Brazil at halftime. They’re basically Neymar and everybody else. Two very nice goals by Neymar versus one unlucky bounce followed by a lazy defensive breakdown. Brazil may find it hard to score if one of the elite teams man-marks Neymar.</p><p>UPDATE 2: Switched to Mexico v Croatia after Brazil goes up 3-1 on Fred’s header. Mexico promptly scores twice; the second goal is an excellent ground cross and finish. Mexico ends up winning 3-1 and looks very good while doing so. Brazil wins the group on goal difference, but Mexico gave them a very good run for their money.</p></div>",
  "content_text": "I am a little bit nervous after watching the Oranje defeat Chile, 2-0. I’m not certain that Arjen Robben\npassing the ball\nwhile in shooting range is a definite sign of the Apocalypse, but it strikes me as an ominous harbinger indeed.. Other than that surreal moment, which was beautifully set up by a long ball from the left back, Holland was in charge without ever looking likely to score. But Schneider’s substitute put in a header for his first-ever touch of the ball in a World Cup match – not a bad start – and Holland finished with all 9 points.\nWhile Croatia v Mexico is the more interesting game, I’m tempted to watch Brazil. They have really looked like nothing the first two games, and if they don’t kick it up a notch, they might very well lose, and lose handily, to European teams like Holland, France, and to a lesser extent, Germany, that are clicking on all cylinders. Perhaps the Brazilians are simply cruising, but it can’t be argued that with names like Fred, Hulk, Bernard, and Oscar, this team seems to lack more than a little of the traditional Brazilian magic.\nUPDATE: 2-1 Brazil at halftime. They’re basically Neymar and everybody else. Two very nice goals by Neymar versus one unlucky bounce followed by a lazy defensive breakdown. Brazil may find it hard to score if one of the elite teams man-marks Neymar.\nUPDATE 2: Switched to Mexico v Croatia after Brazil goes up 3-1 on Fred’s header. Mexico promptly scores twice; the second goal is an excellent ground cross and finish. Mexico ends up winning 3-1 and looks very good while doing so. Brazil wins the group on goal difference, but Mexico gave them a very good run for their money.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-23T18:17:00+00:00"
}