{
  "url": "https://voxday.net/2014/06/22/invasion-not-integration/",
  "scraped_at": "2025-12-16T12:18:17.750244",
  "title": "Invasion, not integration",
  "date_display": "June 22, 2014",
  "date_iso": "2014-06-22T13:03:00+00:00",
  "date_from_url": "2014-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The mass immigration of the late 20th century is simply not the same as the European immigration of the 19th century. All social policies formulated on the basis of the false equivalence will not only fail, but lead to considerable bloodshed in the near future. The reason is that most of these immigrants <a href=\"http://en.trend.az/regions/met/turkey/2287516.html\">have no desire to assimilate into Western society</a>; they come not as supplicants, but conquerers.</p><blockquote class=\"tr_bq\"><p> Turkish Prime Minister Recep Tayyip Erdogan has called on Turkish citizens living in France to apply for dual citizenship and be integrated with the French society, but also stay loyal to their roots, especially their language and religion, Hurriyet Daily News reported.</p><p>“There are 620,000 Turkish citizens living in France,” he said while addressing the Union of European Turkish Democrats, or UETD, in Lyon June 21. “Why don’t they apply for dual citizenship?” he asked….</p><p>Erdogan advised Turks in France not to forget about their French citizenship. “Feel proud of your identity. Particularly do not forget or let forget your language and beliefs. France needs people like you,” he said. “Do not become assimilated and let our kids be assimilated.”</p></blockquote><p>Turkey is no more immune to the expansionary pressures of the Third Jihad than other Islamic nations. The West is still waiting for its Charles Martel 2.0, but the sooner Europe and America begin their Second Reconquistas, the less terrible it will be for the West and the West’s invaders alike. A better question would be: why are 620,00 Turks living in France instead of Turkey? That is a Turkish invasion more than five times larger than Sultan Suleiman I’s army of 120,000 that conquered Hungary and besieged Vienna.</p><p>The first step is to reject all amnesty and immigration “reform”. The second is to end dual-citizenship. And the third is to end birth citizenship. Then, and only then, can the invasions begin to be rolled back with the mass deportations that will make Eisenhower’s million-Mexican Operation Wetback look petty.</p><p>Meanwhile, in England, more than <a href=\"http://www.dailymail.co.uk/news/article-2664668/A-lethal-new-class-British-jihadi-Second-fanatic-ISIS-recruitment-video-went-Cardiff-school-dreamed-prime-minister-Now-says-Muslims-dont-join-die-painful-death.html\">500 “British” Muslims</a> have traveled to Iraq to fight for the establishment of the global caliphate. If Baghdad falls, it won’t be long before they are fighting for it in Londonistan.</p><blockquote class=\"tr_bq\"><p> Reyaad Khan, 20, once dreamed of being the first Asian Prime Minister.<br> Now, he is pictured holding a Kalashnikov rifle alongside Islamist<br> militants, and is urging fellow Britons to join ISIS.<br> Former school friends said he was a studious pupil who loved<br> sports, but he is now one of 500 from the UK who have been radicalised<br> and have fled to the Middle East to fight.  </br></br></br></br></br></p></blockquote><p>Given advancements in human genetics and the scientific understanding<br> of their implications, I think safe to assume that more than one<br> European nation will eventually adopt genetic-based citizenship<br> standards on much the same grounds that Erdogan is assuming that<br> Turkish-French dual citizens will remain Turkish in terms of language,<br> identity, and beliefs.</br></br></br></br></br></p><p>The coming tragedies and<br> atrocities will not be the fault of those who are determined to defend<br> their nations and cultures and keep them alive at any cost, but those<br> who blithely threw history and logic out the window in the name of the myth of human<br> equality.</br></br></br></br></p></div>",
  "content_text": "The mass immigration of the late 20th century is simply not the same as the European immigration of the 19th century. All social policies formulated on the basis of the false equivalence will not only fail, but lead to considerable bloodshed in the near future. The reason is that most of these immigrants\nhave no desire to assimilate into Western society\n; they come not as supplicants, but conquerers.\nTurkish Prime Minister Recep Tayyip Erdogan has called on Turkish citizens living in France to apply for dual citizenship and be integrated with the French society, but also stay loyal to their roots, especially their language and religion, Hurriyet Daily News reported.\n“There are 620,000 Turkish citizens living in France,” he said while addressing the Union of European Turkish Democrats, or UETD, in Lyon June 21. “Why don’t they apply for dual citizenship?” he asked….\nErdogan advised Turks in France not to forget about their French citizenship. “Feel proud of your identity. Particularly do not forget or let forget your language and beliefs. France needs people like you,” he said. “Do not become assimilated and let our kids be assimilated.”\nTurkey is no more immune to the expansionary pressures of the Third Jihad than other Islamic nations. The West is still waiting for its Charles Martel 2.0, but the sooner Europe and America begin their Second Reconquistas, the less terrible it will be for the West and the West’s invaders alike. A better question would be: why are 620,00 Turks living in France instead of Turkey? That is a Turkish invasion more than five times larger than Sultan Suleiman I’s army of 120,000 that conquered Hungary and besieged Vienna.\nThe first step is to reject all amnesty and immigration “reform”. The second is to end dual-citizenship. And the third is to end birth citizenship. Then, and only then, can the invasions begin to be rolled back with the mass deportations that will make Eisenhower’s million-Mexican Operation Wetback look petty.\nMeanwhile, in England, more than\n500 “British” Muslims\nhave traveled to Iraq to fight for the establishment of the global caliphate. If Baghdad falls, it won’t be long before they are fighting for it in Londonistan.\nReyaad Khan, 20, once dreamed of being the first Asian Prime Minister.\nNow, he is pictured holding a Kalashnikov rifle alongside Islamist\nmilitants, and is urging fellow Britons to join ISIS.\nFormer school friends said he was a studious pupil who loved\nsports, but he is now one of 500 from the UK who have been radicalised\nand have fled to the Middle East to fight.\nGiven advancements in human genetics and the scientific understanding\nof their implications, I think safe to assume that more than one\nEuropean nation will eventually adopt genetic-based citizenship\nstandards on much the same grounds that Erdogan is assuming that\nTurkish-French dual citizens will remain Turkish in terms of language,\nidentity, and beliefs.\nThe coming tragedies and\natrocities will not be the fault of those who are determined to defend\ntheir nations and cultures and keep them alive at any cost, but those\nwho blithely threw history and logic out the window in the name of the myth of human\nequality.",
  "tags": [
    "immigration",
    "Invasion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-22T12:03:00+00:00"
}