{
  "url": "https://voxday.net/2014/06/08/mailvox-case-for-singularity/",
  "scraped_at": "2025-12-16T12:16:43.464999",
  "title": "Mailvox: a case for the Singularity",
  "date_display": "June 8, 2014",
  "date_iso": "2014-06-08T09:09:00+00:00",
  "date_from_url": "2014-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>James Miller, an econ professor at Smith and the author of <i>Singularity Rising</i>, asked if he could present his case for<br> the future likelihood of a Singularity. Or, as the Original Cyberpunk has described it, “the rapture of the nerds”. Since this is a place where we are always pleased to give both space and genuine consideration to diverse points of view, I readily agreed to his request.</br></p><blockquote class=\"tr_bq\"><p> I define a Singularity as a threshold of time at which AIs at least as<br> smart as humans and/or augmented human intelligence radically remake<br> civilization.<b> </b></br></br></p><p><b>1.  Rocks exist!</b><br> Strange as it seems, the existence of rocks actually<br> provides us with evidence that it should be possible to build computers<br> powerful enough to take us to a Singularity. <br> There are around ten trillion, trillion atoms in a one-kilogram rock,<br> and as inventor and leading Singularity scholar Ray Kurzweil writes: “Despite the apparent solidity of the object, the atoms are<br> all in motion, sharing electrons back and forth, changing particle spins, and<br> generating rapidly moving electromagnetic fields.  All of this activity represents computation,<br> even if not very meaningfully organized.”</br></br></br></br></br></br></br></br></p><p>If the particles in the rock were organized in a more<br> “purposeful manner” it would be possible to create a computer trillions of<br> times more computationally powerful than all the human brains on earth<br> combined.   Our eventual capacity to<br> accomplish this is established by our second fact.<b> </b></br></br></br></br></p><p><b>2.  Biological cells exist!</b><br> The human body makes use of tiny biological machines to<br> create and repair cells.  Once mankind<br> masters this nanotechnology we will be able to cheaply create powerful<br> molecular computers.  Our third fact<br> proves that these computers could be turned into general purpose thinking<br> machines.<b> </b></br></br></br></br></br></br></p><p><b>3.  Human brains exist!</b><br> Suppose this book claimed that scientists would soon build a<br> human teleportation device.  Given that<br> many past predictions of scientific miracles—such as cheap fusion power, flying<br> cars or a cure for cancer—have come up short, you would rightly be suspicious<br> of my teleportation prediction.  But my<br> credibility would jump if I discovered a species of apes that had the inborn<br> ability to instantly transport themselves across great distances.</br></br></br></br></br></br></br></p><p>In some alternate universe that had different laws of<br> physics, it’s perfectly possible that intelligent machines couldn’t be created.  But human brains provide absolute proof that<br> our universe allows the construction of intelligent, self-aware machines.   And, because the brain exists already,<br> scientists can probe, dissect, scan and interrogate it.  We’re even beginning to understand the<br> brain’s DNA and protein-based ‘source code’. <br> Also, many of the tools used to study the brain have been becoming<br> exponentially more powerful, which explains why engineers might be only a<br> couple of decades away from building a working digital model of the brain even<br> though today we seem far from understanding all of the brains operations.  Would-be creators of AI are already using<br> neuroscience research to help them create machine learning software.   Our fourth fact shows the fantastic<br> potential of AI.<b> </b></br></br></br></br></br></br></br></br></br></br></p><p><b>4.  Albert Einstein existed!</b></p><p>It’s extremely unlikely that the chaotic forces of evolution<br> just happened to stumble on the best possible recipe for intelligence when they<br> created our brains, especially since our brains have many constraints imposed<br> on them by biology: they must run on energy obtained from mere food; must fit<br> in a small space; and can’t use useful materials such as metals and plastics,<br> that engineers employ all the time.</br></br></br></br></br></p><p>But even if people such as Albert Einstein had close to the<br> highest possible level of intelligence allowed by the laws of physics, creating<br> a few million people or machines possessing this man’s brain power would still<br> change the world far more than the industrial revolution. We share about 98% of our genes with some primates, but that<br> 2% difference was enough to produce creatures that can assemble spaceships,<br> sequence genes, and build hydrogen bombs.  <br> What happens when mankind takes its next step, and births lifeforms who<br> have a 2% genetic distance from us? <b> </b></br></br></br></br></br></br></br></p><p><b>5.  If we were smarter, we would be smarter!</b></p><p>Becoming smarter enhances our ability to do everything,<br> including our ability to figure out ways of becoming even smarter because our<br> intelligence is a reflective superpower able to turn on itself to decipher its<br> own workings.  Consider, for example, a<br> college student taking a focus-improving drug such as Adderall, Ritalin or<br> Provigil, to help learn genetics.  After<br> graduation, this student might get a job researching the genetic basis of human<br> intelligence, and her work might assist pharmaceutical companies in making<br> better cognitive enhancing drugs that will help future students acquire an even<br> deeper understanding of genetics. <br> Smarter scientists could invent ways of making even smarter scientists<br> who could in turn… Now, throw the power of machine intelligence into this<br> positive feedback loop and we will end up at technological heights beyond our<br> imagination.  </br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I hereby recuse myself from the position of critic, mostly since my position on the concept can be best described as “mild, but curious skepticism”. But everyone should feel free to either express their doubts or offer additional arguments to bolster Prof. Miller’s case.</p></div>",
  "content_text": "James Miller, an econ professor at Smith and the author of\nSingularity Rising\n, asked if he could present his case for\nthe future likelihood of a Singularity. Or, as the Original Cyberpunk has described it, “the rapture of the nerds”. Since this is a place where we are always pleased to give both space and genuine consideration to diverse points of view, I readily agreed to his request.\nI define a Singularity as a threshold of time at which AIs at least as\nsmart as humans and/or augmented human intelligence radically remake\ncivilization.\n1.  Rocks exist!\nStrange as it seems, the existence of rocks actually\nprovides us with evidence that it should be possible to build computers\npowerful enough to take us to a Singularity.\nThere are around ten trillion, trillion atoms in a one-kilogram rock,\nand as inventor and leading Singularity scholar Ray Kurzweil writes: “Despite the apparent solidity of the object, the atoms are\nall in motion, sharing electrons back and forth, changing particle spins, and\ngenerating rapidly moving electromagnetic fields.  All of this activity represents computation,\neven if not very meaningfully organized.”\nIf the particles in the rock were organized in a more\n“purposeful manner” it would be possible to create a computer trillions of\ntimes more computationally powerful than all the human brains on earth\ncombined.   Our eventual capacity to\naccomplish this is established by our second fact.\n2.  Biological cells exist!\nThe human body makes use of tiny biological machines to\ncreate and repair cells.  Once mankind\nmasters this nanotechnology we will be able to cheaply create powerful\nmolecular computers.  Our third fact\nproves that these computers could be turned into general purpose thinking\nmachines.\n3.  Human brains exist!\nSuppose this book claimed that scientists would soon build a\nhuman teleportation device.  Given that\nmany past predictions of scientific miracles—such as cheap fusion power, flying\ncars or a cure for cancer—have come up short, you would rightly be suspicious\nof my teleportation prediction.  But my\ncredibility would jump if I discovered a species of apes that had the inborn\nability to instantly transport themselves across great distances.\nIn some alternate universe that had different laws of\nphysics, it’s perfectly possible that intelligent machines couldn’t be created.  But human brains provide absolute proof that\nour universe allows the construction of intelligent, self-aware machines.   And, because the brain exists already,\nscientists can probe, dissect, scan and interrogate it.  We’re even beginning to understand the\nbrain’s DNA and protein-based ‘source code’.\nAlso, many of the tools used to study the brain have been becoming\nexponentially more powerful, which explains why engineers might be only a\ncouple of decades away from building a working digital model of the brain even\nthough today we seem far from understanding all of the brains operations.  Would-be creators of AI are already using\nneuroscience research to help them create machine learning software.   Our fourth fact shows the fantastic\npotential of AI.\n4.  Albert Einstein existed!\nIt’s extremely unlikely that the chaotic forces of evolution\njust happened to stumble on the best possible recipe for intelligence when they\ncreated our brains, especially since our brains have many constraints imposed\non them by biology: they must run on energy obtained from mere food; must fit\nin a small space; and can’t use useful materials such as metals and plastics,\nthat engineers employ all the time.\nBut even if people such as Albert Einstein had close to the\nhighest possible level of intelligence allowed by the laws of physics, creating\na few million people or machines possessing this man’s brain power would still\nchange the world far more than the industrial revolution. We share about 98% of our genes with some primates, but that\n2% difference was enough to produce creatures that can assemble spaceships,\nsequence genes, and build hydrogen bombs.\nWhat happens when mankind takes its next step, and births lifeforms who\nhave a 2% genetic distance from us?\n5.  If we were smarter, we would be smarter!\nBecoming smarter enhances our ability to do everything,\nincluding our ability to figure out ways of becoming even smarter because our\nintelligence is a reflective superpower able to turn on itself to decipher its\nown workings.  Consider, for example, a\ncollege student taking a focus-improving drug such as Adderall, Ritalin or\nProvigil, to help learn genetics.  After\ngraduation, this student might get a job researching the genetic basis of human\nintelligence, and her work might assist pharmaceutical companies in making\nbetter cognitive enhancing drugs that will help future students acquire an even\ndeeper understanding of genetics.\nSmarter scientists could invent ways of making even smarter scientists\nwho could in turn… Now, throw the power of machine intelligence into this\npositive feedback loop and we will end up at technological heights beyond our\nimagination.\nI hereby recuse myself from the position of critic, mostly since my position on the concept can be best described as “mild, but curious skepticism”. But everyone should feel free to either express their doubts or offer additional arguments to bolster Prof. Miller’s case.",
  "tags": [
    "mailvox",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-08T08:09:00+00:00"
}