{
  "url": "https://voxday.net/2014/06/20/mcrapey-and-leftward-death-spira/",
  "scraped_at": "2025-12-16T12:18:09.005280",
  "title": "McRapey and the leftward death spiral",
  "date_display": "June 20, 2014",
  "date_iso": "2014-06-20T16:00:00+00:00",
  "date_from_url": "2014-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright and George R.R. Martin both <a href=\"http://www.scifiwright.com/2014/06/the-leftward-death-spiral/\">attempt to explain</a> John Scalzi’s habitual reaction to criticism and public humiliation:</p><blockquote class=\"tr_bq\"><p> The Evil League of Evil smites again. I am too delicate of<br> constitution to repeat the details, since the writer involved, Mr. John<br> Scalzi, is one who has treated me with respect in the past, and I would<br> wish to return the favor if I could.</br></br></br></p><p>Despite this, my loyalty to the Evil League of Evil requires me to<br> draw attention to the odd phenomenon of leftwing thinkers of reacting to<br> public humiliation by redoubling their efforts to humiliate themselves.</br></br></p><p>There is a normal psychological mechanism, something like an inner<br> ear, which allows someone to correct himself when his words and thoughts<br> become imbalanced. The social cues, or the whisper of conscience or<br> reason, tells a man he has said something too extreme or too absurd, and<br> that his thought no longer reflect reality, and so he reverses course,<br> modifies his position, admits of some exception, apologizes and puts<br> himself right.</br></br></br></br></br></br></p><p>This mechanism, in those poor souls afflicted by the political<br> neurosis of Leftwingnuttery is jammed or, worse, is set in reverse. When<br> they discover themselves to be in an unbalanced position, instead of<br> shifting their center of mass and returning to true, their psychological<br> inner ear tells them their fault is that they are not tipping far<br> enough, and so they throw themselves headlong.</br></br></br></br></br></p></blockquote><p>That is a credible theory, but I think it fails to take human socio-sexuality into account, and particular, the Gamma Delusion Complex, as does Mr. Martin’s explanation, provided in <i>A Game of Thrones</i>.</p><blockquote class=\"tr_bq\"><p> When Tyrion encounters Jon Snow up at the wall, he gives Ned’s bastard the classic, but profound advice of the misfit: “Let [those who mock you] see that their words can cut you, and you’ll never be free of their mockery. If they want to give you [an insulting] name, take it, make it your own. Then they can’t hurt you with it anymore.”<br> – “A Different Kind of Other: The Role of Freaks and Outcasts in <i>A Song of Ice and Fire</i>“, Brent Hartinger</br></p></blockquote><p>This is why John Scalzi has publicly adopted the Gamma Rabbit as a device and why he attempts to redefine every apt description of his cowardly, dishonest, and reprehensible behavior, from “insect” to “pussy”, as a compliment of some kind. He reacts in this manner because he is a deeply insecure misfit, a fatherless and effeminate man, so his instinctive response is not to deny the charge and demonstrate it to be false, but rather to protect his own overly sensitive feelings.</p><p>This is also why he is always pretending to enjoy the very abuse that hurts him and returns him to his feelings of childhood rejection. After having his overtures rejected by Larry Correia, Scalzi predictably lashed out in a bitter and vulgar manner, only to suffer a very public humiliation at the hands of the Correiakin, who, being masculine and of higher socio-sexual status, does not fear direct conflict. This promptly led to exactly the sort of misfit posturing recommended by Martin’s Tyrion, prior to Scalzi finally metaphorically placing his hands over his ears when he couldn’t take the humiliation any longer.<br> <i><br/></i><br> <i>“So you’re saying I’m tough, resilient, constantly reinventing myself, and a source of great pleasure? This is an insult</i>?”<br> – retweeted 19 Jun 2014</br></br></br></p><p><i>“Honestly, the stupidity of people who think they’re making clever points<br> on my thread is like a meeting of the Dunning-Kruger fan club.”</br></i><br> – tweeted 19 Jun 2014</br></p><p><i>“Shhhh. Can you hear that? It’s the sound of a bunch of jackasses on<br> Twitter, desperately trying to pretend that I haven’t muted their asses.”</br></i><br>  – tweeted 20 Jun 2014</br></p><p>He can mute his own Twitter account, but he can’t mute reality. As I’ve demonstrated here, the correct way to puncture John Scalzi’s incessant spinning is to simply keep repeating the truth no matter how he tries to deflect and redefine it. Just continue observing the readily apparent: he is a fraud, he is a literary mediocrity, he is a socio-sexual gamma, he is a coward, he is insecure, and he is unable to engage in effective debate.</p><p>I suspect Scalzi will always remain popular in some misfit circles because he is, and he will probably always be, one of them. Unlike those misfits (or as Sarah Hoyt would say, Odds) who are determined to improve themselves and grow out of the social prison of their low status, the self-deluded Gamma redefines his every action as winning, and reinterprets every expression of criticism or contempt as praise. The fact that he does so is not an indication of psychological strength, but rather, extreme psychological weakness. The Gamma has to claim victory on all occasions, however absurd the claim appears, because he simply cannot handle the pain of admitting that he is a loser.</p></div>",
  "content_text": "John C. Wright and George R.R. Martin both\nattempt to explain\nJohn Scalzi’s habitual reaction to criticism and public humiliation:\nThe Evil League of Evil smites again. I am too delicate of\nconstitution to repeat the details, since the writer involved, Mr. John\nScalzi, is one who has treated me with respect in the past, and I would\nwish to return the favor if I could.\nDespite this, my loyalty to the Evil League of Evil requires me to\ndraw attention to the odd phenomenon of leftwing thinkers of reacting to\npublic humiliation by redoubling their efforts to humiliate themselves.\nThere is a normal psychological mechanism, something like an inner\near, which allows someone to correct himself when his words and thoughts\nbecome imbalanced. The social cues, or the whisper of conscience or\nreason, tells a man he has said something too extreme or too absurd, and\nthat his thought no longer reflect reality, and so he reverses course,\nmodifies his position, admits of some exception, apologizes and puts\nhimself right.\nThis mechanism, in those poor souls afflicted by the political\nneurosis of Leftwingnuttery is jammed or, worse, is set in reverse. When\nthey discover themselves to be in an unbalanced position, instead of\nshifting their center of mass and returning to true, their psychological\ninner ear tells them their fault is that they are not tipping far\nenough, and so they throw themselves headlong.\nThat is a credible theory, but I think it fails to take human socio-sexuality into account, and particular, the Gamma Delusion Complex, as does Mr. Martin’s explanation, provided in\nA Game of Thrones\n.\nWhen Tyrion encounters Jon Snow up at the wall, he gives Ned’s bastard the classic, but profound advice of the misfit: “Let [those who mock you] see that their words can cut you, and you’ll never be free of their mockery. If they want to give you [an insulting] name, take it, make it your own. Then they can’t hurt you with it anymore.”\n– “A Different Kind of Other: The Role of Freaks and Outcasts in\nA Song of Ice and Fire\n“, Brent Hartinger\nThis is why John Scalzi has publicly adopted the Gamma Rabbit as a device and why he attempts to redefine every apt description of his cowardly, dishonest, and reprehensible behavior, from “insect” to “pussy”, as a compliment of some kind. He reacts in this manner because he is a deeply insecure misfit, a fatherless and effeminate man, so his instinctive response is not to deny the charge and demonstrate it to be false, but rather to protect his own overly sensitive feelings.\nThis is also why he is always pretending to enjoy the very abuse that hurts him and returns him to his feelings of childhood rejection. After having his overtures rejected by Larry Correia, Scalzi predictably lashed out in a bitter and vulgar manner, only to suffer a very public humiliation at the hands of the Correiakin, who, being masculine and of higher socio-sexual status, does not fear direct conflict. This promptly led to exactly the sort of misfit posturing recommended by Martin’s Tyrion, prior to Scalzi finally metaphorically placing his hands over his ears when he couldn’t take the humiliation any longer.\n“So you’re saying I’m tough, resilient, constantly reinventing myself, and a source of great pleasure? This is an insult\n?”\n– retweeted 19 Jun 2014\n“Honestly, the stupidity of people who think they’re making clever points\non my thread is like a meeting of the Dunning-Kruger fan club.”\n– tweeted 19 Jun 2014\n“Shhhh. Can you hear that? It’s the sound of a bunch of jackasses on\nTwitter, desperately trying to pretend that I haven’t muted their asses.”\n– tweeted 20 Jun 2014\nHe can mute his own Twitter account, but he can’t mute reality. As I’ve demonstrated here, the correct way to puncture John Scalzi’s incessant spinning is to simply keep repeating the truth no matter how he tries to deflect and redefine it. Just continue observing the readily apparent: he is a fraud, he is a literary mediocrity, he is a socio-sexual gamma, he is a coward, he is insecure, and he is unable to engage in effective debate.\nI suspect Scalzi will always remain popular in some misfit circles because he is, and he will probably always be, one of them. Unlike those misfits (or as Sarah Hoyt would say, Odds) who are determined to improve themselves and grow out of the social prison of their low status, the self-deluded Gamma redefines his every action as winning, and reinterprets every expression of criticism or contempt as praise. The fact that he does so is not an indication of psychological strength, but rather, extreme psychological weakness. The Gamma has to claim victory on all occasions, however absurd the claim appears, because he simply cannot handle the pain of admitting that he is a loser.",
  "tags": [
    "McRapey",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-20T15:00:00+00:00"
}