{
  "url": "https://voxday.net/2014/06/19/my-nonexistent-wife-on-twitchy/",
  "scraped_at": "2025-12-16T12:17:58.049926",
  "title": "My nonexistent wife on Twitchy",
  "date_display": "June 19, 2014",
  "date_iso": "2014-06-19T09:02:00+00:00",
  "date_from_url": "2014-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Twitchy has a round-up of Larry Correia’s <a href=\"http://twitchy.com/2014/06/19/monster-hunter-author-larry-correia-targeted-for-departing-from-rape-culture-orthodoxy/\">comprehensive Twitterspank of John Scalzi</a>:</p><blockquote class=\"tr_bq\"><p> After the<a href=\"http://twitchy.com/2014/06/09/rape-culture-wins-feminist-freakout-after-miss-nevada-dares-suggest-self-defense-training-for-women/\"> freakout sparked by Miss Nevada</a> promoting women’s self defense, Correia wrote a blog post with the headline <a href=\"http://monsterhunternation.com/2014/06/10/the-naive-idiocy-of-teaching-rapists-not-to-rape/\" rel=\"bookmark noopener\" target=\"_blank\" title=\"The Naive Idiocy of Teaching Rapists Not To Rape\">The Naive Idiocy of Teaching Rapists Not To Rape</a>. Here’s a taste:</p><blockquote><p> <i>The idea that there is a “rape culture” in the USA is a<br> myth. There are individual imbeciles, individual evil scumbags, and<br> there are some criminal gang subcultures where rape is business as<br> usual, but for most regular people it is an evil anomaly, and our<br> children are taught accordingly. To all of these TEACH BOYS NOT TO RAPE<br> morons, my question is who the hell is teaching them that it is okay?<br> Where do you live? Next to Roman Polanski or Bill Clinton?<b>  </b></br></br></br></br></br></br></i></p></blockquote><p>Some of his science fiction author brethren weren’t too pleased with it and sanctimony ensued.</p></blockquote><p>In addition to accusing Larry of looking like “a rape-excusing asshole” (I note that unlike Scalzi, Larry Correia does not belong to the group that associated with Walter Breen and still celebrates both Marion Zimmer Bradley and Samuel Delaney), John Scalzi went on to claim that Larry’s blog readers are misogynists, that Larry is “sexist” and not “able to understand the English language past the fourth grade level”, and even went so far as to assert that <a href=\"http://photos1.blogger.com/blogger/5786/315/1600/sbswimsuit.jpg\">Spacebunny</a> does not exist in her own right, but is merely my sockpuppet.</p><blockquote class=\"tr_bq\"><p> John Scalzi ‏@scalzi <br> @Spacebunnyday Hi, Vox. Run along now. @monsterhunter45</br></p><p>Larry Correia ‏@monsterhunter45 <br> Uh… @Spacebunnyday is an actual female human person on the internet @scalzi</br></p></blockquote><p>I thought that was a little rich coming from a self-described rapist who claims to be celebrating two decades of married bliss <a href=\"https://www.flickr.com/photos/21125578@N00/3813244401/\">with a drag queen</a>. Isn’t denying female agency supposed to be an important aspect of Rape Culture? Anyhow, given the timing of the relevant laws, it should be apparent to the casual observer that it is not <a href=\"http://jamesworrad.blogspot.ch/2013/06/vox-day-schrodingers-spacebunny.html\">my wife</a>, but his marriage, that is imaginary.</p><p>But since we’re talking about the Hugo-nominated Larry Correia, I would be remiss were I to fail to note that Larry’s latest Monster Hunter International, <b><i><a href=\"http://www.amazon.com/Monster-Hunter-Nemesis-Hunters-International-ebook/dp/B00L17ZHNQ\">NEMESIS</a></i></b>, is already available on Amazon despite its nominal release date of 1 July. Does the man not entertain you? I’ve read the previous four books in the series and I’ll be posting a review here next week. I was intending to post it on the release date, but either Baen or Amazon threw me a curve ball with the early release of the ebook on that one.</p><p>UPDATE: I just noticed that Tom Kratman’s <b><i><a href=\"http://www.amazon.com/The-Rods-Carerra-Series-Book-ebook/dp/B00L17ZGY6\">THE RODS AND THE AXE</a></i></b> are also available on Kindle. It’s a big day for Baen fans! But don’t be disappointed if you’re a Castalia fan too… we’ll have a little something for you on Monday.</p></div>",
  "content_text": "Twitchy has a round-up of Larry Correia’s\ncomprehensive Twitterspank of John Scalzi\n:\nAfter the\nfreakout sparked by Miss Nevada\npromoting women’s self defense, Correia wrote a blog post with the headline\nThe Naive Idiocy of Teaching Rapists Not To Rape\n. Here’s a taste:\nThe idea that there is a “rape culture” in the USA is a\nmyth. There are individual imbeciles, individual evil scumbags, and\nthere are some criminal gang subcultures where rape is business as\nusual, but for most regular people it is an evil anomaly, and our\nchildren are taught accordingly. To all of these TEACH BOYS NOT TO RAPE\nmorons, my question is who the hell is teaching them that it is okay?\nWhere do you live? Next to Roman Polanski or Bill Clinton?\nSome of his science fiction author brethren weren’t too pleased with it and sanctimony ensued.\nIn addition to accusing Larry of looking like “a rape-excusing asshole” (I note that unlike Scalzi, Larry Correia does not belong to the group that associated with Walter Breen and still celebrates both Marion Zimmer Bradley and Samuel Delaney), John Scalzi went on to claim that Larry’s blog readers are misogynists, that Larry is “sexist” and not “able to understand the English language past the fourth grade level”, and even went so far as to assert that\nSpacebunny\ndoes not exist in her own right, but is merely my sockpuppet.\nJohn Scalzi ‏@scalzi\n@Spacebunnyday Hi, Vox. Run along now. @monsterhunter45\nLarry Correia ‏@monsterhunter45\nUh… @Spacebunnyday is an actual female human person on the internet @scalzi\nI thought that was a little rich coming from a self-described rapist who claims to be celebrating two decades of married bliss\nwith a drag queen\n. Isn’t denying female agency supposed to be an important aspect of Rape Culture? Anyhow, given the timing of the relevant laws, it should be apparent to the casual observer that it is not\nmy wife\n, but his marriage, that is imaginary.\nBut since we’re talking about the Hugo-nominated Larry Correia, I would be remiss were I to fail to note that Larry’s latest Monster Hunter International,\nNEMESIS\n, is already available on Amazon despite its nominal release date of 1 July. Does the man not entertain you? I’ve read the previous four books in the series and I’ll be posting a review here next week. I was intending to post it on the release date, but either Baen or Amazon threw me a curve ball with the early release of the ebook on that one.\nUPDATE: I just noticed that Tom Kratman’s\nTHE RODS AND THE AXE\nare also available on Kindle. It’s a big day for Baen fans! But don’t be disappointed if you’re a Castalia fan too… we’ll have a little something for you on Monday.",
  "tags": [
    "McRapey",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-19T08:02:00+00:00"
}