{
  "url": "https://voxday.net/2014/06/05/nicholas-kristof-and-butterfield-effec/",
  "scraped_at": "2025-12-16T12:16:27.360702",
  "title": "Nicholas Kristof and the Butterfield Effect",
  "date_display": "June 5, 2014",
  "date_iso": "2014-06-05T13:00:00+00:00",
  "date_from_url": "2014-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Graham defines <a href=\"http://www.jewishworldreview.com/1204/graham120204.asp\">the Butterfield Effect</a>:</p><blockquote class=\"tr_bq\"><p> It’s what happens when someone on the Left makes a statement that is laughably ludicrous on its face, yet it reveals what the speaker truly believes — no matter how dumb.</p><p>“The Butterfield Effect” is named in honor of ace New York Times crime reporter Fox Butterfield, the intrepid analyst responsible for such brilliantly headlined stories as “More Inmates, Despite Drop In Crime,” and “Number in Prison Grows Despite Crime Reduction,” not to mention the poetic 1997 header, “Crime Keeps on Falling, but Prisons Keep on Filling.”</p><p>Mr. Butterfield is truly perplexed at what he calls the “paradox” of more criminals in prison coinciding with less crime in neighborhoods. An observation that might appear obvious to an 8th grader (crooks + jail = fewer crimes) is simply beyond his grasp. Butterfield of the Times is the poster boy for the greatest conundrum facing the American Left today: How do you explain to people who just don’t get it that the problem is they just don’t get it?</p></blockquote><p> Nicholas Kristof is my favorite exemplar of this effect. Previously there was his brilliant idea to combat Boko Haram with redoubled efforts to educate Nigerian girls. <a href=\"http://www.nytimes.com/2014/06/05/opinion/kritstof-theres-a-kind-of-hush.html?hp&amp;rref=opinion\">And look at his column today</a>, in which he affects to be puzzled why Aung San Suu Kyi isn’t standing up for the rights of Myanmar’s Muslims to set up madrassas all over the country and indiscriminately murder Buddhists.</p><ol><li>Aung San Suu Kyi should be one of the heroes of modern times. Instead, as her country imposes on the Rohingya Muslim minority an apartheid that would have made white supremacists in South Africa blush, she bites her tongue. It seems as though she aspires to become president of Myanmar, and speaking up for a reviled minority could be fatal to her prospects.</li><li>In the absence of schools, Wahhabi madrassas are popping up ominously in closed camps.</li><li>“She supports Muslims,” U Pan Tha, a 66-year-old Buddhist, told me,<br> bitterly. His home was burned by Muslims in 2012 clashes, and he now<br> lives in a camp for displaced people. He voted for Aung San Suu Kyi’s<br> party in 1990, but he says he won’t in the elections next year. “We will<br> choose the military government over Suu Kyi,” he said.</br></br></br></br></li></ol><p>It’s an apt reference to South Africa; it would appear Suu Kyi has learned from de Klerk’s mistakes. Kristof doesn’t seem to realize that once there are enough Muslims in the USA, history suggests they will begin behaving the same way they do in Myanmar, in India, in the Philippines, in China, in the former Soviet Union, and in the Middle East. After a few schools or churches or synagogues are attacked, what the American people’s response will likely make Myanmar’s patient strangulation of the Rohingya look moderate in comparison.</p><p>There will be a second and larger scale Reconquista across the West sooner or later. It’s that or Sharia. The sooner it takes place, the less violent it will be.</p></div>",
  "content_text": "Michael Graham defines\nthe Butterfield Effect\n:\nIt’s what happens when someone on the Left makes a statement that is laughably ludicrous on its face, yet it reveals what the speaker truly believes — no matter how dumb.\n“The Butterfield Effect” is named in honor of ace New York Times crime reporter Fox Butterfield, the intrepid analyst responsible for such brilliantly headlined stories as “More Inmates, Despite Drop In Crime,” and “Number in Prison Grows Despite Crime Reduction,” not to mention the poetic 1997 header, “Crime Keeps on Falling, but Prisons Keep on Filling.”\nMr. Butterfield is truly perplexed at what he calls the “paradox” of more criminals in prison coinciding with less crime in neighborhoods. An observation that might appear obvious to an 8th grader (crooks + jail = fewer crimes) is simply beyond his grasp. Butterfield of the Times is the poster boy for the greatest conundrum facing the American Left today: How do you explain to people who just don’t get it that the problem is they just don’t get it?\nNicholas Kristof is my favorite exemplar of this effect. Previously there was his brilliant idea to combat Boko Haram with redoubled efforts to educate Nigerian girls.\nAnd look at his column today\n, in which he affects to be puzzled why Aung San Suu Kyi isn’t standing up for the rights of Myanmar’s Muslims to set up madrassas all over the country and indiscriminately murder Buddhists.\nAung San Suu Kyi should be one of the heroes of modern times. Instead, as her country imposes on the Rohingya Muslim minority an apartheid that would have made white supremacists in South Africa blush, she bites her tongue. It seems as though she aspires to become president of Myanmar, and speaking up for a reviled minority could be fatal to her prospects.\nIn the absence of schools, Wahhabi madrassas are popping up ominously in closed camps.\n“She supports Muslims,” U Pan Tha, a 66-year-old Buddhist, told me,\nbitterly. His home was burned by Muslims in 2012 clashes, and he now\nlives in a camp for displaced people. He voted for Aung San Suu Kyi’s\nparty in 1990, but he says he won’t in the elections next year. “We will\nchoose the military government over Suu Kyi,” he said.\nIt’s an apt reference to South Africa; it would appear Suu Kyi has learned from de Klerk’s mistakes. Kristof doesn’t seem to realize that once there are enough Muslims in the USA, history suggests they will begin behaving the same way they do in Myanmar, in India, in the Philippines, in China, in the former Soviet Union, and in the Middle East. After a few schools or churches or synagogues are attacked, what the American people’s response will likely make Myanmar’s patient strangulation of the Rohingya look moderate in comparison.\nThere will be a second and larger scale Reconquista across the West sooner or later. It’s that or Sharia. The sooner it takes place, the less violent it will be.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-05T12:00:00+00:00"
}