{
  "url": "https://voxday.net/2014/06/05/opera-on-amazon/",
  "scraped_at": "2025-12-16T12:16:30.655319",
  "title": "“Opera” on Amazon",
  "date_display": "June 5, 2014",
  "date_iso": "2014-06-05T19:00:00+00:00",
  "date_from_url": "2014-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/dp/B00KSBQI84\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/06/opera_256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/06/opera_256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Tor is giving away its various Hugo nominees for free on Amazon today, so I thought it might be a good idea to follow suit. The Hugo-nominated <a href=\"http://www.amazon.com/dp/B00KSBQI84\">“Opera Vita Aeterna”</a> is now available on Amazon for 99 cents, and it will be given away as a free download as soon as Kindle Select permits. If you’ve read it, I encourage you to post a review there; if nothing else the contrast between the pinkshirts’ reviews and everyone else’s should make for some entertaining reading.</p><p>In other Castalia House news, we will be introducing a number of new bloggers in the next two weeks as part of our long term plan to become the leading SF/F destination site. The release of John C. Wright’s latest masterpiece, a real mind-bender, will be taking place this month, and just in time for the World Cup, both QM:AMD and QM:GK will be published in Brazilian Portuguese next week.</p><p>Speaking of Amazon, the good news for readers is that they appear to be winning their showdown with the publishers to keep book prices low. From Publishers Weekly: <i>“A spokesperson for Hachette Book Group has confirmed that they initiated a round of layoffs today.”</i></p></div>",
  "content_text": "Tor is giving away its various Hugo nominees for free on Amazon today, so I thought it might be a good idea to follow suit. The Hugo-nominated\n“Opera Vita Aeterna”\nis now available on Amazon for 99 cents, and it will be given away as a free download as soon as Kindle Select permits. If you’ve read it, I encourage you to post a review there; if nothing else the contrast between the pinkshirts’ reviews and everyone else’s should make for some entertaining reading.\nIn other Castalia House news, we will be introducing a number of new bloggers in the next two weeks as part of our long term plan to become the leading SF/F destination site. The release of John C. Wright’s latest masterpiece, a real mind-bender, will be taking place this month, and just in time for the World Cup, both QM:AMD and QM:GK will be published in Brazilian Portuguese next week.\nSpeaking of Amazon, the good news for readers is that they appear to be winning their showdown with the publishers to keep book prices low. From Publishers Weekly:\n“A spokesperson for Hachette Book Group has confirmed that they initiated a round of layoffs today.”",
  "tags": [
    "Castalia House",
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-05T18:00:00+00:00"
}