{
  "url": "https://voxday.net/2014/06/11/pink-sff-is-worse-than-you-think/",
  "scraped_at": "2025-12-16T12:17:07.538517",
  "title": "Pink SF/F is worse than you think",
  "date_display": "June 11, 2014",
  "date_iso": "2014-06-11T12:00:00+00:00",
  "date_from_url": "2014-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>By way of example, consider that one of the foremost heroines of Pink SF/F turns out to have been the very sort of monstrous sexual freak the pinkshirts so love to write about in their inclusive, people of colorful, sexually deviant fiction. This is <a href=\"http://deirdre.net/marion-zimmer-bradley-its-worse-than-i-knew/\">a letter from the daughter of Marion Zimmer Bradley</a>, one of SF/F’s most influential feminists, who was nominated for Hugo Awards in 1963 and 1978, for a Nebula Award in 1976, and given a World Fantasy Award for lifetime achievement. A short story published in Marion Zimmer Bradley’s Fantasy Magazine was also nominated for a Nebula Award in 1990.</p><blockquote class=\"tr_bq\"><p> Hello Deirdre.</p><p>It is a lot worse than <a href=\"http://deirdre.net/marion-zimmer-bradley-gave-us-new-perspectives-all-right/\">that</a>. The first time she molested me, I was three.  The last time, I was twelve, and able to walk away.  I put Walter in jail for molesting one boy.  I had tried to<br> intervene when I was 13 by telling Mother and Lisa, and they just moved<br> him into his own apartment.</br></br></p><p>I had been living partially on couches since I was ten years old<br> because of the out of control drugs, orgies, and constant flow of people<br> in and out of our family “home.”</br></br></p><p>None of this should be news.  Walter was a serial rapist with many,<br> many, many victims (I named 22 to the cops) but Marion was far, far<br> worse.  She was cruel and violent, as well as completely out of her mind<br> sexually.  I am not her only victim, nor were her only victims girls.</br></br></br></p><p>I wish I had better news.</p><p>Moira Greyland</p></blockquote><p>This is the true heart of Pink SF/F. This is the twisted moral perspective they have been trying to push on science fiction readers as being imperative for more than three decades. This is the shamelessly hedonistic worldview they have been trying to assert as the pinnacle of the literary subgenres with their odes to dinoporn revenge and necrobestial multicultic rape fantasies.</p><p>Keep this in mind when the social justice warriors wag their fingers and lecture society on the burning need for tolerance and acceptance. <i>This is what they seek to tolerate and accept.</i> One wonders how many SFWA members not only knew about Ms Bradley’s behavior, but were part of that “constant flow of people” mentioned by Miss Greyland. Pink SF/F is the literary end product of sick, damaged, and twisted minds. It is not a coincidence that reading it so often feels like immersing oneself in a never-ending flow of sewage.</p><p>Lest you think I am exaggerating, have a look at who Tor.com was celebrating just last week. Tor <a href=\"http://file770.com/?p=17382\">attempted to bury the piece</a> after being criticized for whitewashing Bradley’s personal history, but it can be found <a href=\"http://webcache.googleusercontent.com/search?q=cache:zRvB1GQEhOYJ:www.tor.com/blogs/2014/06/marion-zimmer-bradley-on-this-day+&amp;cd=1&amp;hl=en&amp;ct=clnk&amp;gl=us\">on Google web cache</a> in its entirety.</p><blockquote class=\"tr_bq\"><p> <b>On This Day   </b> <br> Marion Zimmer Bradley Gave us New Perspectives<br> Leah Schnelbach, June 3, 2014</br></br></p><p>Marion Zimmer Bradley</p><p>For someone who considered herself more of an editor than a writer, Marion Zimmer Bradley managed to write an absurd number of books, and create a whole world that fellow writers have returned to for the last forty years.</p><p>Born in 1930, Bradley grew up in rural New York during the Great Depression, and became an enthusiastic member of SFF fandom that exploded just after World War II, beginning by writing letters to Amazing Stories and Thrilling Wonder Stories, and then writing, editing, and publishing fanzines, including Astra’s Tower, Day*Star and Anything Box.</p><p>She was married to Robert Alden Bradley from 1949 until 1964, and had one son. She married Walter Breen in 1964, and the couple had a son and a daughter. She earned a B.A. from Hardin-Simmons University in Texas the following year, and then took graduate courses at UC Berkeley from 1965 until 1967. Throughout this time she continued her work in fandom, and also became involved in a groundbreaking lesbian-rights group, the Daughters of Bilitis.</p><p>Bradley’s early professional work came in two areas. In 1958 her novel The Planet Savers was published, introducing audiences to the world of Darkover. Darkover proved to have a life of its own: she continued writing stories set in that world until her death, and her fans have kept it alive ever since; the most recent fan novel was published in 2013, and the Friends of Darkover still hold conventions each year.</p><p>Bradley also began writing lesbian erotica for pulp publishers in the 1950s, including the novels I Am a Lesbian and My Sister, My Love, under various pseudonyms. However, despite her involvement in the Daughters of Bilitis (and the scholarly work published under her own name, “Feminine Equivalents of Greek Love in Modern Fiction”) she didn’t acknowledge these books during her later career.</p><p>In 1983, Bradley published what would become her most famous work, a reworking of the Arthurian legends told from the perspective of Arthur’s half-sister, Morgaine (Morgana le Fay) who fights to keep Avalon and Mother-Goddess-centered paganism alive in the face of Christianity’s rise in England. Rather than just writing a black-and-white story, Bradley delves into the complexities: Guinevere loves Arthur and Lancelot, and dedicates herself to a fanatical Christianity because of her guilt over this triangle. Arthur knows about their affair, and hates that his best friend and wife are in constant emotional pain, but has to ignore it for the health of the realm. Mordred admires Arthur, but also feels that he’s unfit to rule. The various priestesses of Avalon can be just as cold and unfeeling as the male rulers, and the male rulers can be compassionate toward their subjects. The Mists of Avalon is not simply a feminist statement: it is also a powerful work of storytelling. But it also isn’t just a story, it is an attempt to wrest control of history from the winners. Bradley returned to this methodology with her 1987 work The Firebrand, which sang the Trojan War’s classic song of ‘arms and a man,’ but this time with attention paid to a woman, Cassandra.</p><p>Likewise, the Darkover books took fantasy tropes and complicated them. Darkover is founded by stranded colonists from Earth. The Earthlings intermarry with each other and with the natives of the planet, giving birth to a population with psychic and psionic abilities, called laran. Because the original colonists were Scottish, Irish, and Basque, the idea that second sight was a possibility is passed down through the generations, making laran a prized gift, and keeping the Darkovans open to it. One of the most notable things about Darkover is that Bradley (who seemingly enjoyed playing Civilization on the highest difficulty setting) hemmed herself in with an extremely difficult geography, and then set her characters against it. Darkover is primarily an ice planet, with only a small equatorial pocket of habitable land. However, even this region is subject to extreme temperature, evergreen forests that produce a flammable resin, resulting in forest fires, and several different sentient native species that complicate life for her Terran survivors. Among the natives, the most notable group were the Chieri, long lived, six-fingered, hermaphroditic, and psychic.</p><p>Bradley used her fantasy to deal with gender roles and sexuality. One book, The Winds of Darkover, is explicitly about the aftermath of rapes, one physical, one psychic. With the extremely popular Renunciates, she created women who opted out of Darkover’s gender roles to instead form female guilds. Even within the guild Bradley plays with traditional roles, showing some members who are tough mercenaries and some who are healers. These characters inspired people in both the literary world (Free Amazons of Darkover is an anthology of all-Renunciate stories, written mostly by women and edited by Bradley) and in the more prosaic world, where women tried living in communes and occasionally changed their names to emulate those of the Renunciates, who go by a first, given name, and then use their mother’s given name as a surname, to remove themselves from a patriarchal line while honoring their mothers. Bradley started the Sword and Sorceress series of anthologies to encourage people to write more active heroines. Beginning in 1984, the 28th volume was released last year. And obviously her stories in Mists of Avalon and Firebrand rewrite popular Western mythology from the points of view of the women who are often sidelined in the traditional tellings.</p><p>For much of her career she was dedicated to promoting new writers, encouraging people to write in the Darkover world, and editing anthologies, particularly for female authors, to help new writers gain an introduction to the SFF world. One of her protégés, Mercedes Lackey, published early work in Sword and Sorceress, and co-wrote Tiger Burning Bright and Rediscovery with her.</p><p>She also helped found the Society for Creative Anachronism in 1966, and is credited with naming it. After she moved to Staten Island from Berkeley she founded The Kingdom of the East, which currently rules over Pennsylvania, eastern New York, Delaware, New Jersey, Connecticut, Rhode Island, Massachusetts, Vermont, New Hampshire, Maine, Quebec, Prince Edward Island, Nova Scotia, New Brunswick, and Newfoundland. So she didn’t just give us books. She didn’t just give us a world that encouraged other writers to play. She gave us a literal kingdom. Or perhaps it would be better, in light of Marion Zimmer Bradley’s work in promoting equality in science fiction and fantasy, to call it a queendom?</p></blockquote><p>It is now more than obvious that science fiction’s equalitarian queendom is the evil product of an evil, abusive, and morally depraved woman. It is “is an attempt to wrest control of history from the winners”. Opposing these monsters and rejecting their deviant, corrupting creations is the moral imperative. It should be fascinating to see if the pinkshirts who have been so eager to read out HP Lovecraft, RE Howard, and Orson Scott Card from the genre will be as ready to eliminate the bisexual, child-molesting neo-pagan Marion Zimmer Bradley from it as well.</p><p>Notice that John Scalzi has never once condemned Marion Zimmer Bradley despite repeatedly attacking me and threatening to quit SFWA if I was not purged. And notice that the Tor.com publisher, Patrick Nielsen Hayden, who also threatened to quit SFWA if I was not purged, is the individual responsible for publishing the Schnelbach piece. It is extremely informative to observe what the champions of Pink SF/F consider acceptable and what they do not.</p><p> UPDATE: Kate Elliott tweets: <i>“And we know more about other people that no one wants to say out loud.”</i></p></div>",
  "content_text": "By way of example, consider that one of the foremost heroines of Pink SF/F turns out to have been the very sort of monstrous sexual freak the pinkshirts so love to write about in their inclusive, people of colorful, sexually deviant fiction. This is\na letter from the daughter of Marion Zimmer Bradley\n, one of SF/F’s most influential feminists, who was nominated for Hugo Awards in 1963 and 1978, for a Nebula Award in 1976, and given a World Fantasy Award for lifetime achievement. A short story published in Marion Zimmer Bradley’s Fantasy Magazine was also nominated for a Nebula Award in 1990.\nHello Deirdre.\nIt is a lot worse than\nthat\n. The first time she molested me, I was three.  The last time, I was twelve, and able to walk away.  I put Walter in jail for molesting one boy.  I had tried to\nintervene when I was 13 by telling Mother and Lisa, and they just moved\nhim into his own apartment.\nI had been living partially on couches since I was ten years old\nbecause of the out of control drugs, orgies, and constant flow of people\nin and out of our family “home.”\nNone of this should be news.  Walter was a serial rapist with many,\nmany, many victims (I named 22 to the cops) but Marion was far, far\nworse.  She was cruel and violent, as well as completely out of her mind\nsexually.  I am not her only victim, nor were her only victims girls.\nI wish I had better news.\nMoira Greyland\nThis is the true heart of Pink SF/F. This is the twisted moral perspective they have been trying to push on science fiction readers as being imperative for more than three decades. This is the shamelessly hedonistic worldview they have been trying to assert as the pinnacle of the literary subgenres with their odes to dinoporn revenge and necrobestial multicultic rape fantasies.\nKeep this in mind when the social justice warriors wag their fingers and lecture society on the burning need for tolerance and acceptance.\nThis is what they seek to tolerate and accept.\nOne wonders how many SFWA members not only knew about Ms Bradley’s behavior, but were part of that “constant flow of people” mentioned by Miss Greyland. Pink SF/F is the literary end product of sick, damaged, and twisted minds. It is not a coincidence that reading it so often feels like immersing oneself in a never-ending flow of sewage.\nLest you think I am exaggerating, have a look at who Tor.com was celebrating just last week. Tor\nattempted to bury the piece\nafter being criticized for whitewashing Bradley’s personal history, but it can be found\non Google web cache\nin its entirety.\nOn This Day\nMarion Zimmer Bradley Gave us New Perspectives\nLeah Schnelbach, June 3, 2014\nMarion Zimmer Bradley\nFor someone who considered herself more of an editor than a writer, Marion Zimmer Bradley managed to write an absurd number of books, and create a whole world that fellow writers have returned to for the last forty years.\nBorn in 1930, Bradley grew up in rural New York during the Great Depression, and became an enthusiastic member of SFF fandom that exploded just after World War II, beginning by writing letters to Amazing Stories and Thrilling Wonder Stories, and then writing, editing, and publishing fanzines, including Astra’s Tower, Day*Star and Anything Box.\nShe was married to Robert Alden Bradley from 1949 until 1964, and had one son. She married Walter Breen in 1964, and the couple had a son and a daughter. She earned a B.A. from Hardin-Simmons University in Texas the following year, and then took graduate courses at UC Berkeley from 1965 until 1967. Throughout this time she continued her work in fandom, and also became involved in a groundbreaking lesbian-rights group, the Daughters of Bilitis.\nBradley’s early professional work came in two areas. In 1958 her novel The Planet Savers was published, introducing audiences to the world of Darkover. Darkover proved to have a life of its own: she continued writing stories set in that world until her death, and her fans have kept it alive ever since; the most recent fan novel was published in 2013, and the Friends of Darkover still hold conventions each year.\nBradley also began writing lesbian erotica for pulp publishers in the 1950s, including the novels I Am a Lesbian and My Sister, My Love, under various pseudonyms. However, despite her involvement in the Daughters of Bilitis (and the scholarly work published under her own name, “Feminine Equivalents of Greek Love in Modern Fiction”) she didn’t acknowledge these books during her later career.\nIn 1983, Bradley published what would become her most famous work, a reworking of the Arthurian legends told from the perspective of Arthur’s half-sister, Morgaine (Morgana le Fay) who fights to keep Avalon and Mother-Goddess-centered paganism alive in the face of Christianity’s rise in England. Rather than just writing a black-and-white story, Bradley delves into the complexities: Guinevere loves Arthur and Lancelot, and dedicates herself to a fanatical Christianity because of her guilt over this triangle. Arthur knows about their affair, and hates that his best friend and wife are in constant emotional pain, but has to ignore it for the health of the realm. Mordred admires Arthur, but also feels that he’s unfit to rule. The various priestesses of Avalon can be just as cold and unfeeling as the male rulers, and the male rulers can be compassionate toward their subjects. The Mists of Avalon is not simply a feminist statement: it is also a powerful work of storytelling. But it also isn’t just a story, it is an attempt to wrest control of history from the winners. Bradley returned to this methodology with her 1987 work The Firebrand, which sang the Trojan War’s classic song of ‘arms and a man,’ but this time with attention paid to a woman, Cassandra.\nLikewise, the Darkover books took fantasy tropes and complicated them. Darkover is founded by stranded colonists from Earth. The Earthlings intermarry with each other and with the natives of the planet, giving birth to a population with psychic and psionic abilities, called laran. Because the original colonists were Scottish, Irish, and Basque, the idea that second sight was a possibility is passed down through the generations, making laran a prized gift, and keeping the Darkovans open to it. One of the most notable things about Darkover is that Bradley (who seemingly enjoyed playing Civilization on the highest difficulty setting) hemmed herself in with an extremely difficult geography, and then set her characters against it. Darkover is primarily an ice planet, with only a small equatorial pocket of habitable land. However, even this region is subject to extreme temperature, evergreen forests that produce a flammable resin, resulting in forest fires, and several different sentient native species that complicate life for her Terran survivors. Among the natives, the most notable group were the Chieri, long lived, six-fingered, hermaphroditic, and psychic.\nBradley used her fantasy to deal with gender roles and sexuality. One book, The Winds of Darkover, is explicitly about the aftermath of rapes, one physical, one psychic. With the extremely popular Renunciates, she created women who opted out of Darkover’s gender roles to instead form female guilds. Even within the guild Bradley plays with traditional roles, showing some members who are tough mercenaries and some who are healers. These characters inspired people in both the literary world (Free Amazons of Darkover is an anthology of all-Renunciate stories, written mostly by women and edited by Bradley) and in the more prosaic world, where women tried living in communes and occasionally changed their names to emulate those of the Renunciates, who go by a first, given name, and then use their mother’s given name as a surname, to remove themselves from a patriarchal line while honoring their mothers. Bradley started the Sword and Sorceress series of anthologies to encourage people to write more active heroines. Beginning in 1984, the 28th volume was released last year. And obviously her stories in Mists of Avalon and Firebrand rewrite popular Western mythology from the points of view of the women who are often sidelined in the traditional tellings.\nFor much of her career she was dedicated to promoting new writers, encouraging people to write in the Darkover world, and editing anthologies, particularly for female authors, to help new writers gain an introduction to the SFF world. One of her protégés, Mercedes Lackey, published early work in Sword and Sorceress, and co-wrote Tiger Burning Bright and Rediscovery with her.\nShe also helped found the Society for Creative Anachronism in 1966, and is credited with naming it. After she moved to Staten Island from Berkeley she founded The Kingdom of the East, which currently rules over Pennsylvania, eastern New York, Delaware, New Jersey, Connecticut, Rhode Island, Massachusetts, Vermont, New Hampshire, Maine, Quebec, Prince Edward Island, Nova Scotia, New Brunswick, and Newfoundland. So she didn’t just give us books. She didn’t just give us a world that encouraged other writers to play. She gave us a literal kingdom. Or perhaps it would be better, in light of Marion Zimmer Bradley’s work in promoting equality in science fiction and fantasy, to call it a queendom?\nIt is now more than obvious that science fiction’s equalitarian queendom is the evil product of an evil, abusive, and morally depraved woman. It is “is an attempt to wrest control of history from the winners”. Opposing these monsters and rejecting their deviant, corrupting creations is the moral imperative. It should be fascinating to see if the pinkshirts who have been so eager to read out HP Lovecraft, RE Howard, and Orson Scott Card from the genre will be as ready to eliminate the bisexual, child-molesting neo-pagan Marion Zimmer Bradley from it as well.\nNotice that John Scalzi has never once condemned Marion Zimmer Bradley despite repeatedly attacking me and threatening to quit SFWA if I was not purged. And notice that the Tor.com publisher, Patrick Nielsen Hayden, who also threatened to quit SFWA if I was not purged, is the individual responsible for publishing the Schnelbach piece. It is extremely informative to observe what the champions of Pink SF/F consider acceptable and what they do not.\nUPDATE: Kate Elliott tweets:\n“And we know more about other people that no one wants to say out loud.”",
  "tags": [
    "freakshow",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-11T11:00:00+00:00"
}