{
  "url": "https://voxday.net/2014/06/24/sfwa-still-harbors-child-molesters/",
  "scraped_at": "2025-12-16T12:18:34.360287",
  "title": "SFWA still harbors child molesters",
  "date_display": "June 24, 2014",
  "date_iso": "2014-06-24T11:00:00+00:00",
  "date_from_url": "2014-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SFWA’s sordid history of harboring child molesters is not, as some of its defenders would have you believe, nothing but a relic of freaky 1960s SF fandom. From the 2010 SFWA Directory:<br> <b><br/></b><br> <b>Kowal, Mary Robinette (A)</b><br> Secretary of SFWA<br> [Address 1]<br> [Address 2]<br> [Telephone]<br> secretary@secretary.org<br> [personal email]<br> www.maryrobinettekowal.com<br> Twitter: maryrobinette<br> [SFWA Agent Code]</br></br></br></br></br></br></br></br></br></br></br></p><p><b>Kramer, Edward E. (A)</b><br> [Address 1]<br> [Address 2]<br> [Telephone]<br> [personal email]<br> [AOL email]<br> http://www.edkramer.com</br></br></br></br></br></br></p><p><b>Krasnoff, Barbara (A) </b><br> [Address 1]<br> Etcetera.</br></br></p><p>So who is this <a href=\"http://pjmedia.com/blog/the-sicko-side-of-the-sci-fi-circuit/?singlepage=true\">Edward E. Kramer</a>? He is the founder of Dragoncon in Atlanta and an Active <a href=\"https://twitter.com/edwardekramer\">member of SFWA</a> who was <a href=\"http://www.deadline.com/2013/02/dragoncon-boycott-accused-pedophile-cofounder-jail/\">convicted in December 2013</a> of three counts of child molestation.</p><blockquote class=\"tr_bq\"><p> Back in February Deadline went behind the boycott of popular Atlanta sci-fi convention DragonCon, whose co-founder Ed Kramer avoided trial on child molestation charges for over a decade while receiving income from the annual fan fest. This morning in Gwinnett County, GA, the embattled Kramer pleaded guilty to three counts of child molestation and was sentenced to 34 months under house arrest — instead of the 20-year term recommended by the Gwinnett County DA’s office. It’s the latest apparent break for Kramer, whose health complaints led to numerous delays in a 13-year series of evasive legal motions believed to have been financed by his reported $150K per year (in 2011) shareholder cash flow from DragonCon. But as Gwinnett County District Attorney Danny Porter explained to Deadline today, “We wanted a resolution of the case and the victims wanted a resolution of the case and they agreed to the recommendations.” Under the court’s nine-condition agreement, if the 52-year-old Kramer violates even a single term he could land back in prison for up to 60 years. Those include failing to pay each victim a $100K restitution, violating his house arrest, or coming in contact with any person under the age of 16.</p></blockquote><p>This convicted child molester was actively supported and <a href=\"https://groups.yahoo.com/neo/groups/DefenseFund/conversations/topics/154\">defended in official SFWA publications</a> by a number of SFWA members, including Ann McCaffrey, Brad Linaweaver of the SFWA Grievance Committee, and other SFWA members, <a href=\"http://www.serversystems.net/free-ed/\">some of whom</a> were among the 267 members of the Ed Kramer Legal Defense Fund.</p><blockquote class=\"tr_bq\"><p> What can we do to help our friend Ed Kramer? If money is needed, we should organize a benefit campaign. It is probably time to go to the media. It should be played up as flagrant anti-Semitism, which it clearly is. Ed needs to sue and seek criminal prosecutions of his torturers. And, quite frankly, of his accusers. As far as I can tell, he has suffered this ordeal merely because of a malicious lie. This sort of thing has happened before, not necessarily in the South. In Salem, Massachusetts, for example.Certainly, SFWA, if it is good for anything, should not leave Ed Kramer to rot.<br> – Darrell Schweitzer, Issue 199 (October 2004) of the Science Fiction and Fantasy Writers of America (SFWA) Forum</br></p></blockquote><p>This wasn’t the only defense of Kramer in the Forum or in other official SFWA publications. SFWA Member and Nebula Award winner Robert Sawyer wrote in 2006:</p><blockquote class=\"tr_bq\"><p> I do my best to bring up Ed’ name whenever I can.  In fact, I mentioned and praised him <a href=\"http://www.sfwriter.com/2006/05/identity-theft-nebula-award-essay.html\">in the latest issue of the SFWA BULLETIN</a> (I happened to be on the Nebula ballot, and got to say a few words).</p></blockquote><p>As of this morning, 18 years after his first arrest for aggravated child molestation, 14 years after his arrest on three counts of child molestation, three years after arrest in Connecticut for “risk of injury to a minor”, 18 months after being arrested again in Connecticut for violating his bond, and six months after his guilty plea on three counts of child molestation, <b><i>ED KRAMER IS STILL AN ACTIVE MEMBER OF SFWA!</i></b> The screen shot below was taken this morning, 23 June 2014, from <a href=\"http://www.sfwa.org/member-links/member-list/\">the SFWA member directory</a>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/06/SFWA_Kramer_23Jun14.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"310\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/06/SFWA_Kramer_23Jun14.jpg\" width=\"320\"/></a></div><p><a href=\"http://radishreviews.com/2014/06/16/silence-is-complicity/#comment-46078\">Ann Somerville</a> tried to claim I unfairly tarred various SFWA members with being complicit by virtue of their silence regarding Marion Zimmer Bradley. She wrote: “<i>Vox Day linked MZB with Delany as part of ‘Pink SF’ and then linked<br> them to Jim Hines, Mary Kowal, Rachel Swirsky, Marko Kloos, John Scalzi,<br> Sheri Tepper, and Mercedes Lackey, in a very clear attempt to smear<br> these upstanding and entirely non-criminal individuals by association.”</br></br></br></i></p><p>But most of them were associated with MZB, some of them, like Jim “Celebrate her legacy” Hines, directly and professionally. And then there is their <i>continued </i>association with Ed Kramer. The fact is that these “upstanding and entirely non-criminal individuals” chose to support, defend, and continue to associate with an SFWA member who they knew, at a bare minimum, to be an accused child molester.<i> </i>John Scalzi was SFWA president for three years during which Kramer’s abusive activities were a matter of public record; Scalzi is also known to have <a href=\"http://whatever.scalzi.com/2008/08/31/thats-dragoncon-for-you/\">attended Kramer’s Dragoncon</a> in 2008. Mary Kowal was on the SFWA Board during that time, as was Rachel Swirsky. And, to the best of my knowledge, not a single one of these SFWA members has ever publicly or privately demanded that a confirmed and <i>convicted</i> child molester be expelled from SFWA.</p><p>There is no more possibility of denying the facts. SFWA knowingly shields, supports, defends, and even praises child molesters. It should be obvious that any SFWA member who continues to associate with SFWA despite this long-time and continuing institutional support of child molestation is, at the very least, tolerant of those who rape and abuse children. But give them some credit, they are indubitably tough on tweets!</p><p>SFWA President Steven Gould still has not responded to my questions concerning SFWA’s ongoing support for the late Marion Zimmer Bradley. Perhaps SFWA members who are concerned about their organization’s continued association with convicted child molesters and NAMBLA supporters will see fit to ask him about SFWA’s connections to Mr. Kramer and Mr. Delany. Or perhaps they will continue to remain complicit in their silence.</p><p>UPDATE: Creepy rape enthusiast Jim C. Hines pretends to ignore the screenshot:</p><p><i>“Apparently, a certain SF/F troll is tweeting about SFWA harboring child molester Ed Kramer.<br> So I pulled up the online membership directory.”</br></i></p><p>I notice that SFWA scrubbed Ed Kramer from the membership directory AFTER I took the screenshot and posted it here this morning. Which makes John Scalzi’s tweet more than a little amusing:</p><p><i>John Scalzi @scalzi <br>.@jimchines The Naive Idiocy of Not Checking Your Facts Before Making Accusations Online</br></i></p><div class=\"ProfileTweet-contents\"><div class=\"ProfileTweet-text js-tweet-text u-dir\" dir=\"ltr\"></div><div class=\"ProfileTweet-text js-tweet-text u-dir\" dir=\"ltr\"> Or rather, the naive idiocy of failing to understand that some people are smart enough to anticipate your attempts to cover your ass.<i><br/></i></div></div></div>",
  "content_text": "SFWA’s sordid history of harboring child molesters is not, as some of its defenders would have you believe, nothing but a relic of freaky 1960s SF fandom. From the 2010 SFWA Directory:\nKowal, Mary Robinette (A)\nSecretary of SFWA\n[Address 1]\n[Address 2]\n[Telephone]\nsecretary@secretary.org\n[personal email]\nwww.maryrobinettekowal.com\nTwitter: maryrobinette\n[SFWA Agent Code]\nKramer, Edward E. (A)\n[Address 1]\n[Address 2]\n[Telephone]\n[personal email]\n[AOL email]\nhttp://www.edkramer.com\nKrasnoff, Barbara (A)\n[Address 1]\nEtcetera.\nSo who is this\nEdward E. Kramer\n? He is the founder of Dragoncon in Atlanta and an Active\nmember of SFWA\nwho was\nconvicted in December 2013\nof three counts of child molestation.\nBack in February Deadline went behind the boycott of popular Atlanta sci-fi convention DragonCon, whose co-founder Ed Kramer avoided trial on child molestation charges for over a decade while receiving income from the annual fan fest. This morning in Gwinnett County, GA, the embattled Kramer pleaded guilty to three counts of child molestation and was sentenced to 34 months under house arrest — instead of the 20-year term recommended by the Gwinnett County DA’s office. It’s the latest apparent break for Kramer, whose health complaints led to numerous delays in a 13-year series of evasive legal motions believed to have been financed by his reported $150K per year (in 2011) shareholder cash flow from DragonCon. But as Gwinnett County District Attorney Danny Porter explained to Deadline today, “We wanted a resolution of the case and the victims wanted a resolution of the case and they agreed to the recommendations.” Under the court’s nine-condition agreement, if the 52-year-old Kramer violates even a single term he could land back in prison for up to 60 years. Those include failing to pay each victim a $100K restitution, violating his house arrest, or coming in contact with any person under the age of 16.\nThis convicted child molester was actively supported and\ndefended in official SFWA publications\nby a number of SFWA members, including Ann McCaffrey, Brad Linaweaver of the SFWA Grievance Committee, and other SFWA members,\nsome of whom\nwere among the 267 members of the Ed Kramer Legal Defense Fund.\nWhat can we do to help our friend Ed Kramer? If money is needed, we should organize a benefit campaign. It is probably time to go to the media. It should be played up as flagrant anti-Semitism, which it clearly is. Ed needs to sue and seek criminal prosecutions of his torturers. And, quite frankly, of his accusers. As far as I can tell, he has suffered this ordeal merely because of a malicious lie. This sort of thing has happened before, not necessarily in the South. In Salem, Massachusetts, for example.Certainly, SFWA, if it is good for anything, should not leave Ed Kramer to rot.\n– Darrell Schweitzer, Issue 199 (October 2004) of the Science Fiction and Fantasy Writers of America (SFWA) Forum\nThis wasn’t the only defense of Kramer in the Forum or in other official SFWA publications. SFWA Member and Nebula Award winner Robert Sawyer wrote in 2006:\nI do my best to bring up Ed’ name whenever I can.  In fact, I mentioned and praised him\nin the latest issue of the SFWA BULLETIN\n(I happened to be on the Nebula ballot, and got to say a few words).\nAs of this morning, 18 years after his first arrest for aggravated child molestation, 14 years after his arrest on three counts of child molestation, three years after arrest in Connecticut for “risk of injury to a minor”, 18 months after being arrested again in Connecticut for violating his bond, and six months after his guilty plea on three counts of child molestation,\nED KRAMER IS STILL AN ACTIVE MEMBER OF SFWA!\nThe screen shot below was taken this morning, 23 June 2014, from\nthe SFWA member directory\n.\nAnn Somerville\ntried to claim I unfairly tarred various SFWA members with being complicit by virtue of their silence regarding Marion Zimmer Bradley. She wrote: “\nVox Day linked MZB with Delany as part of ‘Pink SF’ and then linked\nthem to Jim Hines, Mary Kowal, Rachel Swirsky, Marko Kloos, John Scalzi,\nSheri Tepper, and Mercedes Lackey, in a very clear attempt to smear\nthese upstanding and entirely non-criminal individuals by association.”\nBut most of them were associated with MZB, some of them, like Jim “Celebrate her legacy” Hines, directly and professionally. And then there is their\ncontinued\nassociation with Ed Kramer. The fact is that these “upstanding and entirely non-criminal individuals” chose to support, defend, and continue to associate with an SFWA member who they knew, at a bare minimum, to be an accused child molester.\nJohn Scalzi was SFWA president for three years during which Kramer’s abusive activities were a matter of public record; Scalzi is also known to have\nattended Kramer’s Dragoncon\nin 2008. Mary Kowal was on the SFWA Board during that time, as was Rachel Swirsky. And, to the best of my knowledge, not a single one of these SFWA members has ever publicly or privately demanded that a confirmed and\nconvicted\nchild molester be expelled from SFWA.\nThere is no more possibility of denying the facts. SFWA knowingly shields, supports, defends, and even praises child molesters. It should be obvious that any SFWA member who continues to associate with SFWA despite this long-time and continuing institutional support of child molestation is, at the very least, tolerant of those who rape and abuse children. But give them some credit, they are indubitably tough on tweets!\nSFWA President Steven Gould still has not responded to my questions concerning SFWA’s ongoing support for the late Marion Zimmer Bradley. Perhaps SFWA members who are concerned about their organization’s continued association with convicted child molesters and NAMBLA supporters will see fit to ask him about SFWA’s connections to Mr. Kramer and Mr. Delany. Or perhaps they will continue to remain complicit in their silence.\nUPDATE: Creepy rape enthusiast Jim C. Hines pretends to ignore the screenshot:\n“Apparently, a certain SF/F troll is tweeting about SFWA harboring child molester Ed Kramer.\nSo I pulled up the online membership directory.”\nI notice that SFWA scrubbed Ed Kramer from the membership directory AFTER I took the screenshot and posted it here this morning. Which makes John Scalzi’s tweet more than a little amusing:\nJohn Scalzi @scalzi\n.@jimchines The Naive Idiocy of Not Checking Your Facts Before Making Accusations Online\nOr rather, the naive idiocy of failing to understand that some people are smart enough to anticipate your attempts to cover your ass.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2014-06-24T10:00:00+00:00"
}