{
  "url": "https://voxday.net/2014/06/18/shut-up-mccreepy/",
  "scraped_at": "2025-12-16T12:17:56.097262",
  "title": "Shut up, McCreepy",
  "date_display": "June 18, 2014",
  "date_iso": "2014-06-18T23:17:00+00:00",
  "date_from_url": "2014-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jim C. Hines, the weirdo who is really, really, really interested in “helping” women who have been raped, <a href=\"http://www.jimchines.com/2014/06/lc-on-rape-and-self-defense/\">tries to take Larry Correia to task</a> for suggesting that women should be armed and able <a href=\"http://monsterhunternation.com/2014/06/10/the-naive-idiocy-of-teaching-rapists-not-to-rape/\">to defend themselves</a> against rapists:</p><blockquote class=\"tr_bq\"><p> There’s nothing new in LC’s rant. It’s the same attitude we’ve seen<br> for ages, an attitude that conveniently puts the burden on victims to<br> end rape, oversimplifies the problem, and allows the rest of us to look<br> away and pretend there isn’t a real or widespread problem here, despite<br> countless studies showing otherwise.</br></br></br></br></p><p>Some of you are aware of the current conversation in SF/F fandom<br> about several Big Names who sexually assaulted hundreds of children, and<br> how fandom stood by and let it happen, despite there being multiple<br> eyewitnesses to these assaults. Call me a naive idiot, but I wonder how<br> many children would have escaped those assaults if others in fandom had<br> intervened or reported them or enforced any kind of consequences,<br> anything to teach the perpetrators that this kind of behavior was<br> unacceptable.</br></br></br></br></br></br></br></p><p>I wonder how many victims we’re continuing to turn our back on today<br> because we assume there’s no point in doing anything to intervene.</br></p></blockquote><p>So, the guy who really, really, really likes to “help” women who have been raped is attacking the guy who actually helps prevent women from being raped. This raises certain questions about his motivations and is only one of the many reasons we know him as “McCreepy”. And here is McCreepy expressing his opinion of one of those Big Names who is known to have sexually assaulted several of those children:</p><p><i>“Great to see MZB’s Legacy Continue!”</i><br> – Jim C. Hines<i> </i><br> <i><br/></i><br> Cheering on the legacy of a child molester isn’t exactly the most convincing way to help children avoid sexual assault. If deviancy apologists like Hines weren’t so busy celebrating sexual deviancy in SF/F, then perhaps some of those children might not have been abused by the sexual deviants in SF/F.</br></br></br></p></div>",
  "content_text": "Jim C. Hines, the weirdo who is really, really, really interested in “helping” women who have been raped,\ntries to take Larry Correia to task\nfor suggesting that women should be armed and able\nto defend themselves\nagainst rapists:\nThere’s nothing new in LC’s rant. It’s the same attitude we’ve seen\nfor ages, an attitude that conveniently puts the burden on victims to\nend rape, oversimplifies the problem, and allows the rest of us to look\naway and pretend there isn’t a real or widespread problem here, despite\ncountless studies showing otherwise.\nSome of you are aware of the current conversation in SF/F fandom\nabout several Big Names who sexually assaulted hundreds of children, and\nhow fandom stood by and let it happen, despite there being multiple\neyewitnesses to these assaults. Call me a naive idiot, but I wonder how\nmany children would have escaped those assaults if others in fandom had\nintervened or reported them or enforced any kind of consequences,\nanything to teach the perpetrators that this kind of behavior was\nunacceptable.\nI wonder how many victims we’re continuing to turn our back on today\nbecause we assume there’s no point in doing anything to intervene.\nSo, the guy who really, really, really likes to “help” women who have been raped is attacking the guy who actually helps prevent women from being raped. This raises certain questions about his motivations and is only one of the many reasons we know him as “McCreepy”. And here is McCreepy expressing his opinion of one of those Big Names who is known to have sexually assaulted several of those children:\n“Great to see MZB’s Legacy Continue!”\n– Jim C. Hines\nCheering on the legacy of a child molester isn’t exactly the most convincing way to help children avoid sexual assault. If deviancy apologists like Hines weren’t so busy celebrating sexual deviancy in SF/F, then perhaps some of those children might not have been abused by the sexual deviants in SF/F.",
  "tags": [
    "freakshow",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-18T22:17:00+00:00"
}