{
  "url": "https://voxday.net/2014/06/15/switzerland-v-ecuador/",
  "scraped_at": "2025-12-16T12:17:34.373413",
  "title": "Switzerland v Ecuador",
  "date_display": "June 15, 2014",
  "date_iso": "2014-06-15T17:00:00+00:00",
  "date_from_url": "2014-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m enjoying the results to date. Here is hoping that the doughty Swiss can continue the theme. Hopp Schwiiz!</p><p>I didn’t actually think the English were bad, and Sterling is clearly a player to watch. But they simply weren’t strong enough to break through the Italian <i>catenaccio</i>-style defending. Some may find it boring to watch, but I’ve played with Italians long enough that I’ve come to respect the defense-first philosophy.</p><p>And Pirlo… what can you say about a playmaker still playing at this level at 35? It’s unbelievable. Remember, those midfielders are covering the equivalent of up to three 5k races in only 90 minutes, with only one break in the middle. Calcio isn’t as violent as MMA, NHL, or the NFL, but it is a brutal sport in its own way. There is a reason why even superlatively great players like Brazil’s Kaká are done as internationals at 32 and there is talk of England’s Rooney being washed up at 28.</p><p>UPDATE: Switzerland was robbed of one game-winning goal (seriously, what is it with these terrible assistant referees and their dreadful offsides calls?) but a PHENOMENAL slide tackle to stop a dangerous shot in the area, followed by a GREAT advantage call by the referee, led to a long counterattack and goal with 14 seconds left in injury time. 2-1 Switzerland!</p></div>",
  "content_text": "I’m enjoying the results to date. Here is hoping that the doughty Swiss can continue the theme. Hopp Schwiiz!\nI didn’t actually think the English were bad, and Sterling is clearly a player to watch. But they simply weren’t strong enough to break through the Italian\ncatenaccio\n-style defending. Some may find it boring to watch, but I’ve played with Italians long enough that I’ve come to respect the defense-first philosophy.\nAnd Pirlo… what can you say about a playmaker still playing at this level at 35? It’s unbelievable. Remember, those midfielders are covering the equivalent of up to three 5k races in only 90 minutes, with only one break in the middle. Calcio isn’t as violent as MMA, NHL, or the NFL, but it is a brutal sport in its own way. There is a reason why even superlatively great players like Brazil’s Kaká are done as internationals at 32 and there is talk of England’s Rooney being washed up at 28.\nUPDATE: Switzerland was robbed of one game-winning goal (seriously, what is it with these terrible assistant referees and their dreadful offsides calls?) but a PHENOMENAL slide tackle to stop a dangerous shot in the area, followed by a GREAT advantage call by the referee, led to a long counterattack and goal with 14 seconds left in injury time. 2-1 Switzerland!",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-15T16:00:00+00:00"
}