{
  "url": "https://voxday.net/2014/06/23/the-complicit-silence/",
  "scraped_at": "2025-12-16T12:18:28.813968",
  "title": "The complicit silence",
  "date_display": "June 23, 2014",
  "date_iso": "2014-06-23T17:05:00+00:00",
  "date_from_url": "2014-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s informative to observe that even though a few belatedly brave members of the science fiction Left are pointing out that <a href=\"http://radishreviews.com/2014/06/16/silence-is-complicity/\">“silence is complicity”</a>, SFWA and most of its members are still completely silent about the child molesters they have honored in the past and continue to celebrate today:</p><blockquote class=\"tr_bq\"><p> And, as is clear from the Breendoggle documents, everyone in their vicinity knew what was going on. What is even more clear, because of the years involved was that many people knew for a long time. And, for a long, long time–the time it takes to ruin a generation of lives–the community still did nothing to stop him.</p><p>Let me repeat that. EVERYONE KNEW IT.</p><p>Adults. Knew.</p><p>And did nothing. Nothing. To stop it….</p><p>Friends, we have a problem in the science fiction &amp; fantasy community. A big problem.</p><p>We have a culture of silence around our missing stairs. We expect the whisper network to warn newcomers about them–except the whisper network only works when people are connected. And a newcomer is, almost by definition, not connected….</p><p>We must confront this history and bring it to light.</p><p>I don’t know how we can make this right to the hundreds, if not thousands, of people who have been injured by our complicity in these horrors.</p></blockquote><p>Speaking of silence and complicity, I note that although a week has passed, neither Steven Gould nor any other member of the SFWA Board <a href=\"http://www.milobookclub.com/2014/06/16/contamination-by-association/\">has responded to my letter to them</a> concerning their continued support of Marion Zimmer Bradley. Keep in mind this is the same SFWA that recently <a href=\"http://www.sfwa.org/2013/12/32160/\">gave its Grand Master award to Samuel Delany</a>, the homosexual supporter of the North American Man-Boy Love Association.</p><p>A few wags have suggested, given SFWA’s longstanding support for child molesters and its members’ complicity in child molestation, the Nebula Awards should be renamed the NAMBuLA Awards.</p><p>As for those attempting to distinguish between the confirmed child molesters Bradley, Breen, and Kramer, and the SFWA Grand Master Samuel Delany, this raises the obvious question: has Mr. Delany actually denied ever having had any sexual involvement with underage boys? Has anyone from SFWA ever asked the known NAMBLA supporter about it? Or is this simply more silent complicity on the part of SFWA?</p></div>",
  "content_text": "It’s informative to observe that even though a few belatedly brave members of the science fiction Left are pointing out that\n“silence is complicity”\n, SFWA and most of its members are still completely silent about the child molesters they have honored in the past and continue to celebrate today:\nAnd, as is clear from the Breendoggle documents, everyone in their vicinity knew what was going on. What is even more clear, because of the years involved was that many people knew for a long time. And, for a long, long time–the time it takes to ruin a generation of lives–the community still did nothing to stop him.\nLet me repeat that. EVERYONE KNEW IT.\nAdults. Knew.\nAnd did nothing. Nothing. To stop it….\nFriends, we have a problem in the science fiction & fantasy community. A big problem.\nWe have a culture of silence around our missing stairs. We expect the whisper network to warn newcomers about them–except the whisper network only works when people are connected. And a newcomer is, almost by definition, not connected….\nWe must confront this history and bring it to light.\nI don’t know how we can make this right to the hundreds, if not thousands, of people who have been injured by our complicity in these horrors.\nSpeaking of silence and complicity, I note that although a week has passed, neither Steven Gould nor any other member of the SFWA Board\nhas responded to my letter to them\nconcerning their continued support of Marion Zimmer Bradley. Keep in mind this is the same SFWA that recently\ngave its Grand Master award to Samuel Delany\n, the homosexual supporter of the North American Man-Boy Love Association.\nA few wags have suggested, given SFWA’s longstanding support for child molesters and its members’ complicity in child molestation, the Nebula Awards should be renamed the NAMBuLA Awards.\nAs for those attempting to distinguish between the confirmed child molesters Bradley, Breen, and Kramer, and the SFWA Grand Master Samuel Delany, this raises the obvious question: has Mr. Delany actually denied ever having had any sexual involvement with underage boys? Has anyone from SFWA ever asked the known NAMBLA supporter about it? Or is this simply more silent complicity on the part of SFWA?",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-23T16:05:00+00:00"
}