{
  "url": "https://voxday.net/2014/06/03/the-tedious-fruit-of-nihilis/",
  "scraped_at": "2025-12-16T12:16:15.072314",
  "title": "The tedious fruit of nihilism",
  "date_display": "June 3, 2014",
  "date_iso": "2014-06-03T17:00:00+00:00",
  "date_from_url": "2014-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I appreciate the HBO version of A GAME OF THRONES. Unlike most screen adaptations, it has actually improved upon the books in many ways, and it is likely to continue doing so now that it has reached the second-rate material of the later books. But in this recap of the recent episode in which the Red Viper and the Mountain fight their duel, Andy Greenwald <a href=\"http://grantland.com/hollywood-prospectus/game-of-thrones-recap-the-rumble-in-the-red-keep/\">pinpoints the fundamental flaw</a> in the SF/F genre’s nihilism.</p><blockquote class=\"tr_bq\"><p> It was all quite thrilling, for a time, with the Red Viper leaping balletically through the summery air and Alex Graves’s camera swooping vertiginously to catch him. Game of Thrones has often punched me in the heart, but it’s rarely had it fluttering so mightily in my throat. But then, just as Tyrion was getting his hopes up and Cersei was reaching for her Big Gulp of merlot, Oberyn spiked the ball at the 1-yard line. Rather than finish off the Mountain, Oberyn was just getting warmed up, demanding much more than an improbable victory. Instead, like Tyrion in the garden all those years ago, Oberyn demanded logic and an answer. And we all know what happened next.<i> Kung. Kung. Kung.</i></p><p>Actually, the sound of Oberyn’s head exploding was much more terrible than that. The defanging — and defacing — of the Red Viper was among the worst things I’ve ever seen on a screen, but it was definitely the worst thing I’ve ever heard: It somehow managed to remind me both of my own mortality and of Gallagher. (Trust me when I say I’m not sure which was more unbearable.) And in that gruesome, hideous moment I realized that the real takeaway from Tyrion’s story isn’t that he’s a fool for wanting order when there is only chaos. It’s that we just might be for greedily tuning in to the Orson Hour every week and expecting the same thing.</p><p>Look, contra Ramsay Snow, I have been paying attention. I harbor no illusions of a happy ending. But even in the midst of an epic, excellent season that has provided more wit, resonance, and emotion than I had previously thought possible, I am growing slightly weary of being taught the same merciless lesson again and again. I’d like to think that Charlie Brown had some grudging respect for Lucy the first time she pulled away the football. But the fifth? What happened to dashing Prince Oberyn was gripping, horrifying television. But, unlike his skull, it was also rather hollow. Few authors could introduce such a fantastic character with such economy and skill (and fewer showrunners could do the same on television, with even more of both). But only George R.R. Martin would so sadistically run that character into the buzz saw of disappointment and plot that is Game of Thrones just to prove a point — and, I suppose, to tighten the noose a bit more around Tyrion’s neck. Like a beetle, Oberyn was born to die, and in the most gruesome, splattery way possible. And to what end? Shocking us isn’t the same thing as challenging us. A simpleton with a rock might not need to explain himself, but a writer usually does. At this point, the most radical thing Game of Thrones could do is to make the audience exhale in relief.</p></blockquote><p>But it isn’t only George R.R. Martin who is obsessed with making the same point over and over and over. In his excellent collection of essays on science fiction, <b><i><a href=\"http://www.amazon.com/Transhuman-Subhuman-Essays-Science-Fiction-ebook/dp/B00K4D7LO6\">TRANSHUMAN AND SUBHUMAN</a></i></b>, John C. Wright makes the vital distinction between a good story and a well-written one:</p><blockquote class=\"tr_bq\"><p> An artist can draw a picture of the rotting skull of a dead dog on a dungheap with maggots and blind worms crawling on its exposed brains with perfect perspective, shading, composition, and balance of light and dark, and yet it is still a picture of a dead dog.</p></blockquote><p>Lest you think Wright exaggerates the depths to which the nihilistic authors of SF/F habitually descend, consider this, which is the conclusion of the highly regarded, and recently deceased, literary SF author Iain M. Banks’s novel WALKING ON GLASS.</p><blockquote class=\"tr_bq\"><p> In the grass he saw a magazine lying, torn. He looked more closely at it, saw a woman’s buttocks, over a pair of hairy knees. The woman’s bottom was reddened slightly; there was a hand poised, too obviously posed, not in motion, over her. A small breeze ruffled the pages of the magazine for him as he looked, as obligingly as any Hollywood wind-machine stripping a calendar between scenes. The pictures in the rest of the magazine were almost all identical.</p><p>He turned away, disgusted with something other than the pathetic but relatively harmless fetish of the magazine, and saw a flurry of flies swirl into the air from something dark in the grass; it looked like an animal’s leg.</p><p>He closed his eyes, willing tears to come, some final part of him giving in only now, wanting the surrender to animal emotion which until now he had fought against, but as he stood there he could feel no tears coming, only a son of resigned, ugly bitterness, a comprehensive revulsion for everything around him, for all the people and their artefacts and thoughts, all their stupid ways and pointless aims. He opened his smarting eyes, blinking angrily.</p><p>Here it was; this was what it all really meant; here was your civilisation, your billion years of evolution, right here; a soiled and tattered wanking-mag and chopped domestic animal.</p><p>Sex and violence, writ small like all our standard fantasies.</p><p>The pain in his belly which had afflicted him earlier returned, sharp and fierce as a rusty blade.</p><p>It swelled in him then, like some wildfire cancer; a rapid disgust, a total allergy syndrome directed at everything around him; at the filthy, eviscerated mundanity of it all, the sheer crawling awful-ness of existence; all the lies and the pain, the legalized murder, the privileged theft, the genocides and the hatreds and the stupefying human cruelties, all the starveling beauty of the burgeoning poor and the crippled in body and brain, all the life-defying squalor of the cities and the camps, all the sweltering frenetics of the creeds and the faiths, all the torturingly ingenious, carefully civilised savagery of the technology of pain and the economies of greed; all the hollow, ringing, bullshitting words used to justify and explain the utter howling grief of our own cruelty and stupidity; it piled on him, in him, like a weight of atmosphere, that awful mass of air above for those moments no longer balanced by a pressure within, so that he felt at once crushed, smashed inside, but swollen too; bursting with the sickening burden of a cheap and tumid revelation.</p></blockquote><p>The writing is excellent from a technical perspective. But to the extent that it is more than the picture of a dead dog, the message is poisonous, and, as Greenwald correctly observes, tedious. It is ironic that Banks died as he wrote, of a wildfire cancer that brought a meaningless end to his meaningless life of writing repetitively about the meaninglessness of Man.</p><p>But that is the fruit of nihilism: insignificance, boredom, and sooner or later, death.</p></div>",
  "content_text": "I appreciate the HBO version of A GAME OF THRONES. Unlike most screen adaptations, it has actually improved upon the books in many ways, and it is likely to continue doing so now that it has reached the second-rate material of the later books. But in this recap of the recent episode in which the Red Viper and the Mountain fight their duel, Andy Greenwald\npinpoints the fundamental flaw\nin the SF/F genre’s nihilism.\nIt was all quite thrilling, for a time, with the Red Viper leaping balletically through the summery air and Alex Graves’s camera swooping vertiginously to catch him. Game of Thrones has often punched me in the heart, but it’s rarely had it fluttering so mightily in my throat. But then, just as Tyrion was getting his hopes up and Cersei was reaching for her Big Gulp of merlot, Oberyn spiked the ball at the 1-yard line. Rather than finish off the Mountain, Oberyn was just getting warmed up, demanding much more than an improbable victory. Instead, like Tyrion in the garden all those years ago, Oberyn demanded logic and an answer. And we all know what happened next.\nKung. Kung. Kung.\nActually, the sound of Oberyn’s head exploding was much more terrible than that. The defanging — and defacing — of the Red Viper was among the worst things I’ve ever seen on a screen, but it was definitely the worst thing I’ve ever heard: It somehow managed to remind me both of my own mortality and of Gallagher. (Trust me when I say I’m not sure which was more unbearable.) And in that gruesome, hideous moment I realized that the real takeaway from Tyrion’s story isn’t that he’s a fool for wanting order when there is only chaos. It’s that we just might be for greedily tuning in to the Orson Hour every week and expecting the same thing.\nLook, contra Ramsay Snow, I have been paying attention. I harbor no illusions of a happy ending. But even in the midst of an epic, excellent season that has provided more wit, resonance, and emotion than I had previously thought possible, I am growing slightly weary of being taught the same merciless lesson again and again. I’d like to think that Charlie Brown had some grudging respect for Lucy the first time she pulled away the football. But the fifth? What happened to dashing Prince Oberyn was gripping, horrifying television. But, unlike his skull, it was also rather hollow. Few authors could introduce such a fantastic character with such economy and skill (and fewer showrunners could do the same on television, with even more of both). But only George R.R. Martin would so sadistically run that character into the buzz saw of disappointment and plot that is Game of Thrones just to prove a point — and, I suppose, to tighten the noose a bit more around Tyrion’s neck. Like a beetle, Oberyn was born to die, and in the most gruesome, splattery way possible. And to what end? Shocking us isn’t the same thing as challenging us. A simpleton with a rock might not need to explain himself, but a writer usually does. At this point, the most radical thing Game of Thrones could do is to make the audience exhale in relief.\nBut it isn’t only George R.R. Martin who is obsessed with making the same point over and over and over. In his excellent collection of essays on science fiction,\nTRANSHUMAN AND SUBHUMAN\n, John C. Wright makes the vital distinction between a good story and a well-written one:\nAn artist can draw a picture of the rotting skull of a dead dog on a dungheap with maggots and blind worms crawling on its exposed brains with perfect perspective, shading, composition, and balance of light and dark, and yet it is still a picture of a dead dog.\nLest you think Wright exaggerates the depths to which the nihilistic authors of SF/F habitually descend, consider this, which is the conclusion of the highly regarded, and recently deceased, literary SF author Iain M. Banks’s novel WALKING ON GLASS.\nIn the grass he saw a magazine lying, torn. He looked more closely at it, saw a woman’s buttocks, over a pair of hairy knees. The woman’s bottom was reddened slightly; there was a hand poised, too obviously posed, not in motion, over her. A small breeze ruffled the pages of the magazine for him as he looked, as obligingly as any Hollywood wind-machine stripping a calendar between scenes. The pictures in the rest of the magazine were almost all identical.\nHe turned away, disgusted with something other than the pathetic but relatively harmless fetish of the magazine, and saw a flurry of flies swirl into the air from something dark in the grass; it looked like an animal’s leg.\nHe closed his eyes, willing tears to come, some final part of him giving in only now, wanting the surrender to animal emotion which until now he had fought against, but as he stood there he could feel no tears coming, only a son of resigned, ugly bitterness, a comprehensive revulsion for everything around him, for all the people and their artefacts and thoughts, all their stupid ways and pointless aims. He opened his smarting eyes, blinking angrily.\nHere it was; this was what it all really meant; here was your civilisation, your billion years of evolution, right here; a soiled and tattered wanking-mag and chopped domestic animal.\nSex and violence, writ small like all our standard fantasies.\nThe pain in his belly which had afflicted him earlier returned, sharp and fierce as a rusty blade.\nIt swelled in him then, like some wildfire cancer; a rapid disgust, a total allergy syndrome directed at everything around him; at the filthy, eviscerated mundanity of it all, the sheer crawling awful-ness of existence; all the lies and the pain, the legalized murder, the privileged theft, the genocides and the hatreds and the stupefying human cruelties, all the starveling beauty of the burgeoning poor and the crippled in body and brain, all the life-defying squalor of the cities and the camps, all the sweltering frenetics of the creeds and the faiths, all the torturingly ingenious, carefully civilised savagery of the technology of pain and the economies of greed; all the hollow, ringing, bullshitting words used to justify and explain the utter howling grief of our own cruelty and stupidity; it piled on him, in him, like a weight of atmosphere, that awful mass of air above for those moments no longer balanced by a pressure within, so that he felt at once crushed, smashed inside, but swollen too; bursting with the sickening burden of a cheap and tumid revelation.\nThe writing is excellent from a technical perspective. But to the extent that it is more than the picture of a dead dog, the message is poisonous, and, as Greenwald correctly observes, tedious. It is ironic that Banks died as he wrote, of a wildfire cancer that brought a meaningless end to his meaningless life of writing repetitively about the meaninglessness of Man.\nBut that is the fruit of nihilism: insignificance, boredom, and sooner or later, death.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-03T16:00:00+00:00"
}