{
  "url": "https://voxday.net/2014/06/02/the-concern-rabbi/",
  "scraped_at": "2025-12-16T12:16:06.273726",
  "title": "The concern rabbit",
  "date_display": "June 2, 2014",
  "date_iso": "2014-06-02T07:37:00+00:00",
  "date_from_url": "2014-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is no need for me to address <a href=\"http://t.co/0NPS6G8saz\">Damien Walters’s latest attack</a> on Larry Correia and me, since the big guy is going to be doing one of his monster fisks on it. I will link to it later. One Jared Garrett summed up the Guardian article succinctly:<i> “This is one of the single stupidest pieces I’ve ever read. I<br> know who you’re referring to in this clownish rant and you have<br> absolutely zero clue. Either you’re too stupid to read and comprehend or<br> you’re being deliberately obtuse.” </br></br></br></i></p><p>What I found more interesting than Damien’s customary moronics was the rabbiting that took place in the comments, wherein Damien purported to be deeply concerned about the career of the very man he is publicly attacking and calling “not very intelligent”. Consider his comments of that follow the article.</p><blockquote class=\"tr_bq\"><ol><li>I think you’ll find they lumped themselves in with Vox Day. Why they<br> wanted to do something quite so suicidal to their careers, we can only<br> speculate.</br></br></li><li> I think Correia did two things. The first was appeal for<br> votes on the basis of a perceived liberal bias in the genre. That was<br> the basis of his campaign, a protest vote against liberal influence.<br> That was divisive and did a lot to spark the backlash he’s still<br> feeling. Secondly, and this is going to be much more damaging for him<br> longterm, he allowed himself to become very closely associated to Vox<br> Day in the process. Ultimately people do judge others by their<br> associations, and both Larry Correia and John C Wright have made very<br> public declarations of support for Day, that I fear both will deeply<br> regret in the long run. I’m quite serious about my suggestion by<br> the way. I think if Correia wrote publicly to support the new diversity<br> in the genre, and apologised for any perception he was campaigning<br> against it, that might help him a lot. Remember, we won’t know who<br> missed out on shortlist places until after the awards. At that point<br> Correia et al could find the response to them gets much, much worse even<br> than when the story broke. </br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></li><li>I’d suggest those 25 other writers work harder not to be associated with<br> Vox Day. it seems to be doing the public perception of them a great<br> deal of harm.</br></br></li><li>The reactionary conservative movement in SF has many members, Corrreia,<br> Wright and a number of others mentioned. Vox Day goes far beyond that.<br> You’re welcome to defend his opinions if you wish, and good luck to you<br> in the task. I think even the reactionaries would do well to distance<br> from him if they have any sense.</br></br></br></br></li><li>I have no clear idea what you mean by shunning or writing people out of<br> the genre. I assume you’re bringing in baggage from other discussions.<br> We have a genre growing ever more diverse, and a small clique of<br> reactionaries behaving very poorly in response to that. And doing<br> immense damage to their own careers in the process. Sad for everyone<br> involved.</br></br></br></br></br></li></ol></blockquote><p>Meanwhile, the Blue SF/F market continues to grow, as do the submissions to Castalia, as does the readership of this blog. May 2014 marked the 14th straight month in which the <i>average </i>blog traffic was <i>more than 100,000 Google pageviews more</i> than Whatever’s best-ever month of May 2012. </p><p>It’s fascinating to see how desperate the pinkshirts are to try to separate me from Larry, John, and everyone else. This is classic rabbit behavior; when they can’t exclude themselves, they try to convince others to perform the exclusion for them. Not that it would do any good anyhow. They don’t understand that Larry, John, and me are under absolutely no illusions that we agree on everything. Or even most things. We are three very different men who belong to different population sub-groups, different Christian denominations, we vote for different political parties, and we have very different interests and communication styles. Larry is the tetsubo, John is the rapier, and I am the Ka-Bar, best suited for close-in combat gutting. We simply happen to have earned each other’s respect for various reasons and to share a disdain for SF/F that elevates left-wing ideology over every other aspect of storytelling.</p><p>Nor are we alone. Damien doesn’t mention Tom and Sarah and Ringo and Amanda and Kate and the other Tom and Lou and Brad or any of the many other writers who have observed precisely the same problems with the left-wing infestation of SF/F that the Big Three have, (just a joke, John, I can see you wincing now) except to say that “the reactionary conservative movement in SF has many members”.  But that’s not the real issue, the real issue is that there are far more “reactionary conservative” readers than there are readers of the progressive Pink SF detritus that the mainstream SF/F publishers have been aggressively pushing on SF/F fans for the last two decades. And apparently two decades of a consistently shrinking market isn’t enough for them, because #weneeddiversebooks!</p><p>Damien is making the same mistake that Whatever readers did two years ago, the same mistake that CNN made in 1996, and the same mistake that Newsweek made in 1998. He is assuming, all the evidence to the contrary, that the numbers are on his side. Throughout his piece and his comments, he foolishly attempts to minimize the other side: for example, he refers to “little-known writers” even though Larry is a best-selling author, I have the best-trafficked blog in SF/F, and John C. Wright was voted the sixth-greatest SF writer alive.</p><p>Indeed, if there is not this institutional left-wing influence that we “reactionaries” all observe, and all oppose, how can anyone be “doing immense damage to their own careers” by opposing it? If it doesn’t exist, then how would being lumped in with me, in any way, be “suicidal to their careers”. Setting aside the humor inherent in an unpublished nonentity like Damien giving literary career advice to the Nebula-nominated Mr. Wright or the Hugo-nominated Mr. Correia, it should be obvious that Damien has assumed the very point that he was attempting to refute.</p><p>So, in the end, this is nothing more than a petty rabbit with a soapbox attempting to DISQUALIFY, DISQUALIFY. Again. The most offensive aspect of Damien’s latest attack is the insult to both Larry and John in the implication that they are any more susceptible to the Left’s blandishments than I am. I, for one, find it impossible to imagine either man being even remotely willing to submit to the Left’s ritual of public recantation and self-abasemen.</p><p>Why, one wonders, is it such an imperative for the Left to separate me from everyone else it is attacking?</p></div>",
  "content_text": "There is no need for me to address\nDamien Walters’s latest attack\non Larry Correia and me, since the big guy is going to be doing one of his monster fisks on it. I will link to it later. One Jared Garrett summed up the Guardian article succinctly:\n“This is one of the single stupidest pieces I’ve ever read. I\nknow who you’re referring to in this clownish rant and you have\nabsolutely zero clue. Either you’re too stupid to read and comprehend or\nyou’re being deliberately obtuse.”\nWhat I found more interesting than Damien’s customary moronics was the rabbiting that took place in the comments, wherein Damien purported to be deeply concerned about the career of the very man he is publicly attacking and calling “not very intelligent”. Consider his comments of that follow the article.\nI think you’ll find they lumped themselves in with Vox Day. Why they\nwanted to do something quite so suicidal to their careers, we can only\nspeculate.\nI think Correia did two things. The first was appeal for\nvotes on the basis of a perceived liberal bias in the genre. That was\nthe basis of his campaign, a protest vote against liberal influence.\nThat was divisive and did a lot to spark the backlash he’s still\nfeeling. Secondly, and this is going to be much more damaging for him\nlongterm, he allowed himself to become very closely associated to Vox\nDay in the process. Ultimately people do judge others by their\nassociations, and both Larry Correia and John C Wright have made very\npublic declarations of support for Day, that I fear both will deeply\nregret in the long run. I’m quite serious about my suggestion by\nthe way. I think if Correia wrote publicly to support the new diversity\nin the genre, and apologised for any perception he was campaigning\nagainst it, that might help him a lot. Remember, we won’t know who\nmissed out on shortlist places until after the awards. At that point\nCorreia et al could find the response to them gets much, much worse even\nthan when the story broke.\nI’d suggest those 25 other writers work harder not to be associated with\nVox Day. it seems to be doing the public perception of them a great\ndeal of harm.\nThe reactionary conservative movement in SF has many members, Corrreia,\nWright and a number of others mentioned. Vox Day goes far beyond that.\nYou’re welcome to defend his opinions if you wish, and good luck to you\nin the task. I think even the reactionaries would do well to distance\nfrom him if they have any sense.\nI have no clear idea what you mean by shunning or writing people out of\nthe genre. I assume you’re bringing in baggage from other discussions.\nWe have a genre growing ever more diverse, and a small clique of\nreactionaries behaving very poorly in response to that. And doing\nimmense damage to their own careers in the process. Sad for everyone\ninvolved.\nMeanwhile, the Blue SF/F market continues to grow, as do the submissions to Castalia, as does the readership of this blog. May 2014 marked the 14th straight month in which the\naverage\nblog traffic was\nmore than 100,000 Google pageviews more\nthan Whatever’s best-ever month of May 2012.\nIt’s fascinating to see how desperate the pinkshirts are to try to separate me from Larry, John, and everyone else. This is classic rabbit behavior; when they can’t exclude themselves, they try to convince others to perform the exclusion for them. Not that it would do any good anyhow. They don’t understand that Larry, John, and me are under absolutely no illusions that we agree on everything. Or even most things. We are three very different men who belong to different population sub-groups, different Christian denominations, we vote for different political parties, and we have very different interests and communication styles. Larry is the tetsubo, John is the rapier, and I am the Ka-Bar, best suited for close-in combat gutting. We simply happen to have earned each other’s respect for various reasons and to share a disdain for SF/F that elevates left-wing ideology over every other aspect of storytelling.\nNor are we alone. Damien doesn’t mention Tom and Sarah and Ringo and Amanda and Kate and the other Tom and Lou and Brad or any of the many other writers who have observed precisely the same problems with the left-wing infestation of SF/F that the Big Three have, (just a joke, John, I can see you wincing now) except to say that “the reactionary conservative movement in SF has many members”.  But that’s not the real issue, the real issue is that there are far more “reactionary conservative” readers than there are readers of the progressive Pink SF detritus that the mainstream SF/F publishers have been aggressively pushing on SF/F fans for the last two decades. And apparently two decades of a consistently shrinking market isn’t enough for them, because #weneeddiversebooks!\nDamien is making the same mistake that Whatever readers did two years ago, the same mistake that CNN made in 1996, and the same mistake that Newsweek made in 1998. He is assuming, all the evidence to the contrary, that the numbers are on his side. Throughout his piece and his comments, he foolishly attempts to minimize the other side: for example, he refers to “little-known writers” even though Larry is a best-selling author, I have the best-trafficked blog in SF/F, and John C. Wright was voted the sixth-greatest SF writer alive.\nIndeed, if there is not this institutional left-wing influence that we “reactionaries” all observe, and all oppose, how can anyone be “doing immense damage to their own careers” by opposing it? If it doesn’t exist, then how would being lumped in with me, in any way, be “suicidal to their careers”. Setting aside the humor inherent in an unpublished nonentity like Damien giving literary career advice to the Nebula-nominated Mr. Wright or the Hugo-nominated Mr. Correia, it should be obvious that Damien has assumed the very point that he was attempting to refute.\nSo, in the end, this is nothing more than a petty rabbit with a soapbox attempting to DISQUALIFY, DISQUALIFY. Again. The most offensive aspect of Damien’s latest attack is the insult to both Larry and John in the implication that they are any more susceptible to the Left’s blandishments than I am. I, for one, find it impossible to imagine either man being even remotely willing to submit to the Left’s ritual of public recantation and self-abasemen.\nWhy, one wonders, is it such an imperative for the Left to separate me from everyone else it is attacking?",
  "tags": [
    "rabbitology",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-02T06:37:00+00:00"
}