{
  "url": "https://voxday.net/2014/06/03/the-inevitable-decline-of-atheis/",
  "scraped_at": "2025-12-16T12:16:11.774002",
  "title": "The inevitable decline of atheism",
  "date_display": "June 3, 2014",
  "date_iso": "2014-06-03T09:45:00+00:00",
  "date_from_url": "2014-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"firstPar\"> Another reminder that the future belongs <a href=\"http://www.telegraph.co.uk/culture/hay-festival/10856665/Christianity-will-rise-as-sceptics-die-out-geneticist-claims.html\">to those who show up</a> for it:<blockquote class=\"tr_bq\"><p> The world could see a resurgence of Christianity driven by population decline<br> in sceptical countries, the geneticist Steve Jones has claimed. Professor Jones said history had proven that religion grows rapidly during<br> large population booms, particularly in poorer countries. He argued that rapid growth in Africa could spark a new resurgence of major<br> religions like Christianity. However in increasingly atheist countries in Europe people are no longer<br> reproducing in sufficient numbers to avoid population decline, he told the<br> Hay Literary Festival.</br></br></br></br></br></p><p>“We atheists sometimes congratulate ourselves that the incidence of religious<br> belief is going down. But religious people have more children. Where are people having the most<br> children? It’s in the tropics and in Africa. It’s clearly the case that the future will involve an increase in religious<br> populations and a decrease in scepticism.”</br></br></br></p></blockquote><p>It’s not only that. There is also the fact that most of the children raised in an atheist home eventually become religious; the only reason that the rate of growth of atheism briefly, (in historical terms), was fast enough to surmount that inhibiting factor is because the atheist population was so small. Atheists are at the literal bottom of the retention rate in comparison with every religious group from Hindus to Jehovah’s Witnesses. Even the mealy-mouthed Anglicans fare better.</p><p>A more important factor is that times of wealth and peace have always been a counter-indicator of religious belief. The rich and fat seldom believe they have any need for God, and they deeply resent any divinely inspired restrictions on their descent into decadence. At the end of the longest period of peace and economic expansion in the history of the West, it should be no surprise at all that we have an obese, decadent, depraved, diseased population that fears no God.</p><p>They will learn better soon enough. Both history and the Bible are very clear concerning the eventual fate of such societies.</p></div></div>",
  "content_text": "Another reminder that the future belongs\nto those who show up\nfor it:\nThe world could see a resurgence of Christianity driven by population decline\nin sceptical countries, the geneticist Steve Jones has claimed. Professor Jones said history had proven that religion grows rapidly during\nlarge population booms, particularly in poorer countries. He argued that rapid growth in Africa could spark a new resurgence of major\nreligions like Christianity. However in increasingly atheist countries in Europe people are no longer\nreproducing in sufficient numbers to avoid population decline, he told the\nHay Literary Festival.\n“We atheists sometimes congratulate ourselves that the incidence of religious\nbelief is going down. But religious people have more children. Where are people having the most\nchildren? It’s in the tropics and in Africa. It’s clearly the case that the future will involve an increase in religious\npopulations and a decrease in scepticism.”\nIt’s not only that. There is also the fact that most of the children raised in an atheist home eventually become religious; the only reason that the rate of growth of atheism briefly, (in historical terms), was fast enough to surmount that inhibiting factor is because the atheist population was so small. Atheists are at the literal bottom of the retention rate in comparison with every religious group from Hindus to Jehovah’s Witnesses. Even the mealy-mouthed Anglicans fare better.\nA more important factor is that times of wealth and peace have always been a counter-indicator of religious belief. The rich and fat seldom believe they have any need for God, and they deeply resent any divinely inspired restrictions on their descent into decadence. At the end of the longest period of peace and economic expansion in the history of the West, it should be no surprise at all that we have an obese, decadent, depraved, diseased population that fears no God.\nThey will learn better soon enough. Both history and the Bible are very clear concerning the eventual fate of such societies.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-03T08:45:00+00:00"
}