{
  "url": "https://voxday.net/2014/06/06/the-price-of-war/",
  "scraped_at": "2025-12-16T12:16:34.392033",
  "title": "The price of war",
  "date_display": "June 6, 2014",
  "date_iso": "2014-06-06T13:00:00+00:00",
  "date_from_url": "2014-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>I posted this 10 years ago. I think it is still relevant today.</i></p><p>The price of war does not stop being paid when the guns fall silent.<br> This was driven home to me when we bought our first house from an older<br> couple who had lived there for many years.  My grandfather, a Marine<br> who’d fought on Guadacanal and Tarawa, recognized the home seller as an<br> Army veteran and asked where he had served.<br> <br> <br> <br>In Europe, the man answered, and his eyes filled unexpectedly with<br> tears.  He turned away for a moment, and then, composed again, he<br> apologized and explained that he’d lost his brother in Normandy.  This<br> conversation was taking place 53 years later, but it was clear that the<br> pain still lingered.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>It is almost impossible for us, sixty years later, to understand the<br> grim realities of D-Day.  Yes, we are unfortunate enough to live in<br> what a Chinese sage described as the curse of interesting times, and<br> yet, we do not yet live in a real state of war.  Most of us know a few<br> soldiers who are involved in the present conflict – I was relieved to<br> receive an email yesterday from my Italian cousin in Baghdad, telling me<br> that he was fine after the embassy attack – but it is not the vast<br> majority of young men of our acquaintance who are in uniform and in<br> danger as was the case back then.</br></br></br></br></br></br></br></br></p><p>A few years ago, I took part in a massive simulation of Gold Beach,<br> using the Advanced Squad Leader system.  Each player was responsible for<br> a section of the beach; I was commanding three companies of British<br> troops plus 12 Shermans and a few funnies.  The experience drove home<br> how a relatively small number of defending German troops were able to<br> inflict terrible casualties on the landing Allies, and it was sobering<br> to see the pile of cardboard casualties grow and realize that each piece<br> represented the lives of ten men.</br></br></br></br></br></br></br></p><p>To the left, I lost an entire company, and only a lucky shot and a<br> wildly aggressive charge by one Sherman commander allowed me to take out<br> the two AT-guns defending my attack sector and get the two surviving companies off the beach.  It<br> was only a game, and yet, one could see how the <a href=\"http://www.blackfive.net/main/2004/05/one_year.html\">valiant action of a single brave man</a> could make all the difference in the world to the rest of the men involved.</br></br></br></p><p>In the end, after many hours, the Allies triumphed on the table just<br> as they had many years before on the real beaches.  But there was no<br> celebration by the winners, instead we found ourselves standing quietly<br> around the massive array of maps, contemplating those who had fought and<br> died so long ago.  Some may think that it is strange and silly, if not<br> downright disrespectful, to view the tragic loss of human life through<br> the lens of a wargame.  But, sixty years later, this is the only lens<br> that many of us have.</br></br></br></br></br></br></br></p><p>Soon, all the young men who stormed Normandy will be gone.  But as<br> long as there are other young men who are curious about history, who<br> want to know what happened when, where and why, neither they nor their<br> sacrifices will ever be forgotten.</br></br></br></p></div>",
  "content_text": "I posted this 10 years ago. I think it is still relevant today.\nThe price of war does not stop being paid when the guns fall silent.\nThis was driven home to me when we bought our first house from an older\ncouple who had lived there for many years.  My grandfather, a Marine\nwho’d fought on Guadacanal and Tarawa, recognized the home seller as an\nArmy veteran and asked where he had served.\nIn Europe, the man answered, and his eyes filled unexpectedly with\ntears.  He turned away for a moment, and then, composed again, he\napologized and explained that he’d lost his brother in Normandy.  This\nconversation was taking place 53 years later, but it was clear that the\npain still lingered.\nIt is almost impossible for us, sixty years later, to understand the\ngrim realities of D-Day.  Yes, we are unfortunate enough to live in\nwhat a Chinese sage described as the curse of interesting times, and\nyet, we do not yet live in a real state of war.  Most of us know a few\nsoldiers who are involved in the present conflict – I was relieved to\nreceive an email yesterday from my Italian cousin in Baghdad, telling me\nthat he was fine after the embassy attack – but it is not the vast\nmajority of young men of our acquaintance who are in uniform and in\ndanger as was the case back then.\nA few years ago, I took part in a massive simulation of Gold Beach,\nusing the Advanced Squad Leader system.  Each player was responsible for\na section of the beach; I was commanding three companies of British\ntroops plus 12 Shermans and a few funnies.  The experience drove home\nhow a relatively small number of defending German troops were able to\ninflict terrible casualties on the landing Allies, and it was sobering\nto see the pile of cardboard casualties grow and realize that each piece\nrepresented the lives of ten men.\nTo the left, I lost an entire company, and only a lucky shot and a\nwildly aggressive charge by one Sherman commander allowed me to take out\nthe two AT-guns defending my attack sector and get the two surviving companies off the beach.  It\nwas only a game, and yet, one could see how the\nvaliant action of a single brave man\ncould make all the difference in the world to the rest of the men involved.\nIn the end, after many hours, the Allies triumphed on the table just\nas they had many years before on the real beaches.  But there was no\ncelebration by the winners, instead we found ourselves standing quietly\naround the massive array of maps, contemplating those who had fought and\ndied so long ago.  Some may think that it is strange and silly, if not\ndownright disrespectful, to view the tragic loss of human life through\nthe lens of a wargame.  But, sixty years later, this is the only lens\nthat many of us have.\nSoon, all the young men who stormed Normandy will be gone.  But as\nlong as there are other young men who are curious about history, who\nwant to know what happened when, where and why, neither they nor their\nsacrifices will ever be forgotten.",
  "tags": [
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-06T12:00:00+00:00"
}