{
  "url": "https://voxday.net/2014/06/04/the-challenge-of-cause-and-effec/",
  "scraped_at": "2025-12-16T12:16:21.789052",
  "title": "The challenge of cause-and-effect",
  "date_display": "June 4, 2014",
  "date_iso": "2014-06-04T17:00:00+00:00",
  "date_from_url": "2014-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://hotair.com/archives/2014/06/02/liberal-austin-homeowners-surprised-to-find-they-have-to-pay-all-the-taxes-they-voted-for/\">This plaintive protest</a>, in a nutshell, explains why there can never be any significant mixing of various population sub-groups that will be successful over time. Not without the rule of a militarized aristocracy at a bare minimum, and a strictly limited voting franchise at best.</p><blockquote class=\"tr_bq\"><p> “I’m at the breaking point,” said Gretchen Gardner, an Austin artist who bought a 1930s bungalow in the Bouldin neighborhood just south of downtown in 1991 and has watched her property tax bill soar to $8,500 this year.</p><p>“It’s not because I don’t like paying taxes,” said Gardner, who attended both meetings. “I have voted for every park, every library, all the school improvements, for light rail, for anything that will make this city better. But now I can’t afford to live here anymore. I’ll protest my appraisal notice, but that’s not enough. Someone needs to step in and address the big picture.”</p></blockquote><p>Now, this is a woman who cannot grasp the connection between her votes for “anything that will make this city better” and the consequent increase in her property tax bill. How can one reasonably argue that she should be permitted to vote? She is literally <i>non compos mentis</i> with regards to basic politics.</p><p>And she is high-functioning in comparison to millions of other voters! If nothing else, she has managed to provide for herself and pay her mortgage for 23 years. That puts her ahead of tens of millions of people.</p><p>The worst thing is the probable consequences of her selling her house. She’ll move somewhere less expensive, and then promptly resume voting for the very things that forced her to move there. Because she does not understand cause and effect.</p></div>",
  "content_text": "This plaintive protest\n, in a nutshell, explains why there can never be any significant mixing of various population sub-groups that will be successful over time. Not without the rule of a militarized aristocracy at a bare minimum, and a strictly limited voting franchise at best.\n“I’m at the breaking point,” said Gretchen Gardner, an Austin artist who bought a 1930s bungalow in the Bouldin neighborhood just south of downtown in 1991 and has watched her property tax bill soar to $8,500 this year.\n“It’s not because I don’t like paying taxes,” said Gardner, who attended both meetings. “I have voted for every park, every library, all the school improvements, for light rail, for anything that will make this city better. But now I can’t afford to live here anymore. I’ll protest my appraisal notice, but that’s not enough. Someone needs to step in and address the big picture.”\nNow, this is a woman who cannot grasp the connection between her votes for “anything that will make this city better” and the consequent increase in her property tax bill. How can one reasonably argue that she should be permitted to vote? She is literally\nnon compos mentis\nwith regards to basic politics.\nAnd she is high-functioning in comparison to millions of other voters! If nothing else, she has managed to provide for herself and pay her mortgage for 23 years. That puts her ahead of tens of millions of people.\nThe worst thing is the probable consequences of her selling her house. She’ll move somewhere less expensive, and then promptly resume voting for the very things that forced her to move there. Because she does not understand cause and effect.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-04T16:00:00+00:00"
}