{
  "url": "https://voxday.net/2014/06/05/the-consequences-of-atheist-morality/",
  "scraped_at": "2025-12-16T12:16:29.177595",
  "title": "The consequences of an atheist morality",
  "date_display": "June 5, 2014",
  "date_iso": "2014-06-05T17:00:00+00:00",
  "date_from_url": "2014-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright has entirely too much fun deconstructing <a href=\"http://www.scifiwright.com/2014/06/more-on-selfish-gene-theory/\">what passes for the logic of an altruism-based morality</a> of the sort advocated by midwitted atheists who genuinely believe Richard Dawkins is a formidable philosopher:</p><blockquote class=\"tr_bq\"><p> Now, the most common and most persuasive argument an atheist or materialist can make in favor of universal morality is a genetic argument. The argument is that, as a matter of pure game theory, any races and breeds that develops a gene which imposes an instinct for altruism toward other members of one’s own bloodline, will, as a matter of course, have a definite statistical advantage in the lottery of Darwinian survival, and will come to outnumber those races and breeds that do not.</p><p>The argument is that the purely blind and selfish drive of the genes we carry in us therefore mesmerizes us with an instinct to altruism and self-sacrifice which is not in our immediate self-interest, but unintentionally serves the self-interest of the family, clan, tribe, breed, bloodline, and race.</p><p>The argument is that this mesmeric spell makes us hallucinate that there is such a thing as a moral code we are bound to obey, but whether this hallucination is true or false, it serves the blind and selfish reasons of the parasites called genes dwelling inside us, whom we much, willy-nilly, serve and obey.</p><p>Putting this argument to the test, I asked a hypothetical question about the following rule of behavior:  “Abducting Nubile Young Woman to Serve as Concubines, Dancing Girls, or Breeding Stock is bad.” Is this a rule that bind only those who share the non-abduction gene, or does it bind all men, including those with not one gene in common with us? I used the hypothetical example of an abductor who is a Man from Mars. He is not of our tribe, nation, or race. He is, at least during the Obama Administration NASA days, beyond the reach of any reasonable expectation of retaliation from Earthlings.</p><p>Is it objectively wrong for the Martian Warlord to abduct a luscious Earthgirl like Yvonne Craig to his horrible harem of terror atop Olympus Mons? Or is it only wrong because the Selfish Gene says it is wrong? Is it wrong objectively, or only genetically?</p><p>(Of course I mean to use this as an excuse to post more pictures!)</p><p>The genetic argument as a basis of morality makes me laugh until I puke green foam from my nose. It is obvious enough that if my instinct for altruism is proportional to how many selfish genes I have in common with another, that I will always prefer my self over my brother, my brother over my cousin, my cousin over my second cousin, my family over my clan, and my clan over my race, and my race over the Slavs and Jews and Untermenschen.</p><p>Racism, and I mean REAL Nazi-style kill-the-Jews racism, is not only excused by the genetic argument for altruism, it is demanded by it. Aiding anyone outside your clad and clan and bloodline is treason to the Selfish Gene, ergo, by this logic, immoral.</p><p>For that matter, women’s liberation causes a drop in fertility rates, so it also is treason against the Selfish Gene. for that matter, monogamy is treason, polygamy is demanded, and the consent of the concubines in the breeding harem is not required, because the gene does not care if you wanted to have happy children, only many children.</p><p>So, logically, if altruism is basic on the Selfish Gene, abducting dancing girls and nubile starlets to the breeding harem is not only licit, it is the highest and most saintly and most moral of all possible actions!</p></blockquote><p>It may not be coincidental that this “morality” is most often advocated by the sort of male atheist whose only chance of any sexual exposure to dancing girls and nubile starlets would be through forcible abduction and rape.</p><p>It should be apparent that if we were to seriously adopt this sort of biology-based “morality” on a large scale, our world would more closely resemble John Norman’s Gor than anything else. The first imperative for any human society that values stability, let alone survival, is to eliminate unrestricted female volition in sexual matters. That is why religions and governments have always concerned themselves with a multitude of rules restricting it in some manner. Because without them, the civilized society will not survive.</p><p>As Camille Paglia pointed out repeatedly in <i>Sexual Personae</i>, the female represents the chaotic and unreasoning aspect of humanity, vital for the survival of the species, fertile when husbanded, and insanely destructive when left unrestrained.</p></div>",
  "content_text": "John C. Wright has entirely too much fun deconstructing\nwhat passes for the logic of an altruism-based morality\nof the sort advocated by midwitted atheists who genuinely believe Richard Dawkins is a formidable philosopher:\nNow, the most common and most persuasive argument an atheist or materialist can make in favor of universal morality is a genetic argument. The argument is that, as a matter of pure game theory, any races and breeds that develops a gene which imposes an instinct for altruism toward other members of one’s own bloodline, will, as a matter of course, have a definite statistical advantage in the lottery of Darwinian survival, and will come to outnumber those races and breeds that do not.\nThe argument is that the purely blind and selfish drive of the genes we carry in us therefore mesmerizes us with an instinct to altruism and self-sacrifice which is not in our immediate self-interest, but unintentionally serves the self-interest of the family, clan, tribe, breed, bloodline, and race.\nThe argument is that this mesmeric spell makes us hallucinate that there is such a thing as a moral code we are bound to obey, but whether this hallucination is true or false, it serves the blind and selfish reasons of the parasites called genes dwelling inside us, whom we much, willy-nilly, serve and obey.\nPutting this argument to the test, I asked a hypothetical question about the following rule of behavior:  “Abducting Nubile Young Woman to Serve as Concubines, Dancing Girls, or Breeding Stock is bad.” Is this a rule that bind only those who share the non-abduction gene, or does it bind all men, including those with not one gene in common with us? I used the hypothetical example of an abductor who is a Man from Mars. He is not of our tribe, nation, or race. He is, at least during the Obama Administration NASA days, beyond the reach of any reasonable expectation of retaliation from Earthlings.\nIs it objectively wrong for the Martian Warlord to abduct a luscious Earthgirl like Yvonne Craig to his horrible harem of terror atop Olympus Mons? Or is it only wrong because the Selfish Gene says it is wrong? Is it wrong objectively, or only genetically?\n(Of course I mean to use this as an excuse to post more pictures!)\nThe genetic argument as a basis of morality makes me laugh until I puke green foam from my nose. It is obvious enough that if my instinct for altruism is proportional to how many selfish genes I have in common with another, that I will always prefer my self over my brother, my brother over my cousin, my cousin over my second cousin, my family over my clan, and my clan over my race, and my race over the Slavs and Jews and Untermenschen.\nRacism, and I mean REAL Nazi-style kill-the-Jews racism, is not only excused by the genetic argument for altruism, it is demanded by it. Aiding anyone outside your clad and clan and bloodline is treason to the Selfish Gene, ergo, by this logic, immoral.\nFor that matter, women’s liberation causes a drop in fertility rates, so it also is treason against the Selfish Gene. for that matter, monogamy is treason, polygamy is demanded, and the consent of the concubines in the breeding harem is not required, because the gene does not care if you wanted to have happy children, only many children.\nSo, logically, if altruism is basic on the Selfish Gene, abducting dancing girls and nubile starlets to the breeding harem is not only licit, it is the highest and most saintly and most moral of all possible actions!\nIt may not be coincidental that this “morality” is most often advocated by the sort of male atheist whose only chance of any sexual exposure to dancing girls and nubile starlets would be through forcible abduction and rape.\nIt should be apparent that if we were to seriously adopt this sort of biology-based “morality” on a large scale, our world would more closely resemble John Norman’s Gor than anything else. The first imperative for any human society that values stability, let alone survival, is to eliminate unrestricted female volition in sexual matters. That is why religions and governments have always concerned themselves with a multitude of rules restricting it in some manner. Because without them, the civilized society will not survive.\nAs Camille Paglia pointed out repeatedly in\nSexual Personae\n, the female represents the chaotic and unreasoning aspect of humanity, vital for the survival of the species, fertile when husbanded, and insanely destructive when left unrestrained.",
  "tags": [
    "atheism",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-05T16:00:00+00:00"
}