{
  "url": "https://voxday.net/2014/06/05/three-hugo-reviews/",
  "scraped_at": "2025-12-16T12:16:25.507434",
  "title": "Three Hugo reviews",
  "date_display": "June 5, 2014",
  "date_iso": "2014-06-05T08:10:00+00:00",
  "date_from_url": "2014-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Technically four, actually. Jeffro’s Space Gaming Blog is reviewing this year’s Hugo nominees. He’s reviewed three in the novelette category so far, one of them being the Puppinette’s <a href=\"http://jeffro.wordpress.com/2014/05/06/review-the-lady-astronaut-of-mars/\">The Lady Astronaut of Mars</a>:</p><blockquote class=\"tr_bq\"><p> The story begins with the confused ramblings of an elderly woman. We<br> know there’s something about Mars and Kansas… but we’re left collating<br> hints and scraps of information given to us by what is possibly an<br> unreliable narrator. If this actually is serious science fiction… then<br> it must be some sort of alternate history because we are shown some kind<br> Mars Mission from the fifties that was engineered with punch card<br> programs. And yet, the doctor from Kansas is named Dorothy and has an<br> Aunt Em and Uncle Henry… and this is so outrageous I can’t tell if this<br> is satire or a some kind of a joke.</br></br></br></br></br></br></br></br></p><p>If you keep reading, you soon discover that it isn’t some kind of drug addled hallucination. There <i>is</i><br> a bit of science folded into the story: a domed colony on mars, an<br> asteroid impact on earth, an inhabitable extrasolar planet…. It’s not a<br> bad little premise there, really… but it is entirely smothered in the<br> details of particularly uninspiring elderly couple. The images and<br> situations are as far from those depicted in Frank Frazetta covers as<br> can possibly get. Instead Dejah Thoris, you get a sixty year old woman’s<br> flabby arms. Instead of gruesome sword fights and pulse pounding<br> action… you have a couple of bureaucrats coaxing a former astronaut to<br> come out of retirement.</br></br></br></br></br></br></br></br></br></p><p>The tone of the work is very even… almost elevated. It’s hard not to<br> read it in the cadence of an open mic slam poetry routine. Sometime like<br> this could be on NPR– it seems to hit all the right notes with a bit of<br> panache– but the story ends up grinding on into more and more graphic<br> and disheartening details.</br></br></br></br></p></blockquote><p>He has also reviewed Brad Torgersen’s <a href=\"http://jeffro.wordpress.com/2014/04/29/book-review-lights-in-the-deep/\">Lights in the Deep</a>, which includes not one, but TWO Hugo-nominated works:</p><blockquote class=\"tr_bq\"><p> I remember the last couple of stories I’d<br> read in magazines like that. Back in the early nineties, I dipped into<br> several of them hoping to find the next Robert A. Heinlein. One story<br> was about a scientist running experiments on computer simulations of<br> pigs and chickens or something. If they passed, he might get to test his<br> drugs on a computer model of a human! (No aliens or explosions there.<br> Heck, I can’t even remember any conflict.) In another story, a painter<br> that specializes in portraits always ends up romancing the women he<br> paints. He’s a real Lothario. Then he gets a gig to paint an alien on<br> Mars or something… and his work just isn’t coming out right. Then it<br> dawns on him that he needs to get freaky with the alien in order paint a<br> good picture of it. Twist ending: the alien with incomprehensible<br> anatomy turns out to be a dude!</br></br></br></br></br></br></br></br></br></br></br></br></p><div style=\"text-align: left;\"> Perhaps  somebody else can confirm this for<br> me, but maybe the magazines have continued to be as godawful as I<br> remember. (I’m afraid to check, honestly. What if they’re <i>worse</i>…?)<br> Maybe “real” science fiction with aliens and space ships and laser<br> beams and exploding planets just isn’t done so much anymore…? Maybe the<br> fans that are deep in the science fiction scene are actually starving<br> for the sort of thing that I would recognize as, you know… being science<br> fiction. Maybe the way that Brad Torgersen’s collection combines<br> apocalyptic catastrophe with a sense of hopefulness really is having an<br> impact.</br></br></br></br></br></br></br></br></br></div><div style=\"text-align: left;\"> That he does this while straining to meet<br> editorial expectations and bending over backwards to not offend the<br> readership’s political and religious sensibilities is perhaps the most<br> obvious constraint holding back these stories. </br></br></br></div></blockquote><p> He also reviewed <a href=\"http://jeffro.wordpress.com/2014/04/25/book-review-the-last-witchking/\">The Last Witchking</a>:</p><blockquote class=\"tr_bq\"><p> There’s nothing like a good pogrom, fatwā, book banning, congressional committee, or concerned citizens group to pique my interest in something. The greater the moral panic, the better the advertising. It was inevitable the hand-wringing surrounding the Hugo nominations this year would be just enough to get me to see what the fuss is about. I dove in to a book by the infamous Vox Day just hoping to be scandalized. (It’s the least I can do after growing up in the shadow of B.A.D.D. and the PMRC.)</p><p>I almost didn’t finish it. The first few pages consisted of two star-crossed lovers saying their last goodbyes to one another. I just about gave up right there, but the depiction of elves shortly after that held my attention. They weren’t the stereotypical tree-hugging types, but had a bit of an edge to them. Before long I was caring about the main character and clicking the page down key. My eyeballs were glued to the monitor and I couldn’t stop reading. (I’d picked up the Kindle edition that was free the other day because of the third story’s controversial Hugo nomination.)</p><p>Now, I’ve been hooked on page turners before that ended up making me feeling disappointed afterwards. You might know you’ve been had, but you keep buying books in the series because you have to know how it ends. This wasn’t like that. The main characters here are all so different from each other: an evil witchking, a goblin warrior, and elvish “seeker.” What’s intriguing to me is the extent to which I became immersed in the perspectives of each one. I really want to see each one to succeed… even when I maybe shouldn’t such as in the case of the titular character…. I’m glad for this brouhaha over the Hugo nominations, because this<br> book would have never crossed my radar otherwise. It was well worth the<br> few hours it took to read it, but I’m skeptical of the idea that a book<br> set in this world could go toe to toe with George R. R. Martin’s epic<br> fantasy series.</br></br></br></br></p></blockquote><p>I don’t know Jeffro and he’s clearly not a reader of this blog, but I find it telling that his perspective as a genuine science fiction fan is so vastly different from that of the self-appointed “fan writers” who have been loudly pronouncing the intrinsic terribleness of my nominated work. Now that the Hugo packet has been made available to the voters, it should be fascinating to learn how many of them share his perception of these works in comparison to the usual suspects. It will certainly be more than a little amusing to hear the shrieks and the popping sound of five hundred heads exploding like Red Viper skulls if there turn out to be more Jeffros than Damiens among the voters.</p><p>In any event, I sent him a copy of A THRONE OF BONES to review, so that he could see for himself how well, or how poorly, it goes toe-to-toe with Mr. Martin’s ever-expanding trilogy.</p><p> UPDATE: Since some of you apparently weren’t aware, the Hugo Voter’s Packet is now available from LonCon and <a href=\"http://loncon3.org/hugo_vote/hugo_voter_packet.php\">can be downloaded here</a> by registered voters.</p></div>",
  "content_text": "Technically four, actually. Jeffro’s Space Gaming Blog is reviewing this year’s Hugo nominees. He’s reviewed three in the novelette category so far, one of them being the Puppinette’s\nThe Lady Astronaut of Mars\n:\nThe story begins with the confused ramblings of an elderly woman. We\nknow there’s something about Mars and Kansas… but we’re left collating\nhints and scraps of information given to us by what is possibly an\nunreliable narrator. If this actually is serious science fiction… then\nit must be some sort of alternate history because we are shown some kind\nMars Mission from the fifties that was engineered with punch card\nprograms. And yet, the doctor from Kansas is named Dorothy and has an\nAunt Em and Uncle Henry… and this is so outrageous I can’t tell if this\nis satire or a some kind of a joke.\nIf you keep reading, you soon discover that it isn’t some kind of drug addled hallucination. There\nis\na bit of science folded into the story: a domed colony on mars, an\nasteroid impact on earth, an inhabitable extrasolar planet…. It’s not a\nbad little premise there, really… but it is entirely smothered in the\ndetails of particularly uninspiring elderly couple. The images and\nsituations are as far from those depicted in Frank Frazetta covers as\ncan possibly get. Instead Dejah Thoris, you get a sixty year old woman’s\nflabby arms. Instead of gruesome sword fights and pulse pounding\naction… you have a couple of bureaucrats coaxing a former astronaut to\ncome out of retirement.\nThe tone of the work is very even… almost elevated. It’s hard not to\nread it in the cadence of an open mic slam poetry routine. Sometime like\nthis could be on NPR– it seems to hit all the right notes with a bit of\npanache– but the story ends up grinding on into more and more graphic\nand disheartening details.\nHe has also reviewed Brad Torgersen’s\nLights in the Deep\n, which includes not one, but TWO Hugo-nominated works:\nI remember the last couple of stories I’d\nread in magazines like that. Back in the early nineties, I dipped into\nseveral of them hoping to find the next Robert A. Heinlein. One story\nwas about a scientist running experiments on computer simulations of\npigs and chickens or something. If they passed, he might get to test his\ndrugs on a computer model of a human! (No aliens or explosions there.\nHeck, I can’t even remember any conflict.) In another story, a painter\nthat specializes in portraits always ends up romancing the women he\npaints. He’s a real Lothario. Then he gets a gig to paint an alien on\nMars or something… and his work just isn’t coming out right. Then it\ndawns on him that he needs to get freaky with the alien in order paint a\ngood picture of it. Twist ending: the alien with incomprehensible\nanatomy turns out to be a dude!\nPerhaps  somebody else can confirm this for\nme, but maybe the magazines have continued to be as godawful as I\nremember. (I’m afraid to check, honestly. What if they’re\nworse\n…?)\nMaybe “real” science fiction with aliens and space ships and laser\nbeams and exploding planets just isn’t done so much anymore…? Maybe the\nfans that are deep in the science fiction scene are actually starving\nfor the sort of thing that I would recognize as, you know… being science\nfiction. Maybe the way that Brad Torgersen’s collection combines\napocalyptic catastrophe with a sense of hopefulness really is having an\nimpact.\nThat he does this while straining to meet\neditorial expectations and bending over backwards to not offend the\nreadership’s political and religious sensibilities is perhaps the most\nobvious constraint holding back these stories.\nHe also reviewed\nThe Last Witchking\n:\nThere’s nothing like a good pogrom, fatwā, book banning, congressional committee, or concerned citizens group to pique my interest in something. The greater the moral panic, the better the advertising. It was inevitable the hand-wringing surrounding the Hugo nominations this year would be just enough to get me to see what the fuss is about. I dove in to a book by the infamous Vox Day just hoping to be scandalized. (It’s the least I can do after growing up in the shadow of B.A.D.D. and the PMRC.)\nI almost didn’t finish it. The first few pages consisted of two star-crossed lovers saying their last goodbyes to one another. I just about gave up right there, but the depiction of elves shortly after that held my attention. They weren’t the stereotypical tree-hugging types, but had a bit of an edge to them. Before long I was caring about the main character and clicking the page down key. My eyeballs were glued to the monitor and I couldn’t stop reading. (I’d picked up the Kindle edition that was free the other day because of the third story’s controversial Hugo nomination.)\nNow, I’ve been hooked on page turners before that ended up making me feeling disappointed afterwards. You might know you’ve been had, but you keep buying books in the series because you have to know how it ends. This wasn’t like that. The main characters here are all so different from each other: an evil witchking, a goblin warrior, and elvish “seeker.” What’s intriguing to me is the extent to which I became immersed in the perspectives of each one. I really want to see each one to succeed… even when I maybe shouldn’t such as in the case of the titular character…. I’m glad for this brouhaha over the Hugo nominations, because this\nbook would have never crossed my radar otherwise. It was well worth the\nfew hours it took to read it, but I’m skeptical of the idea that a book\nset in this world could go toe to toe with George R. R. Martin’s epic\nfantasy series.\nI don’t know Jeffro and he’s clearly not a reader of this blog, but I find it telling that his perspective as a genuine science fiction fan is so vastly different from that of the self-appointed “fan writers” who have been loudly pronouncing the intrinsic terribleness of my nominated work. Now that the Hugo packet has been made available to the voters, it should be fascinating to learn how many of them share his perception of these works in comparison to the usual suspects. It will certainly be more than a little amusing to hear the shrieks and the popping sound of five hundred heads exploding like Red Viper skulls if there turn out to be more Jeffros than Damiens among the voters.\nIn any event, I sent him a copy of A THRONE OF BONES to review, so that he could see for himself how well, or how poorly, it goes toe-to-toe with Mr. Martin’s ever-expanding trilogy.\nUPDATE: Since some of you apparently weren’t aware, the Hugo Voter’s Packet is now available from LonCon and\ncan be downloaded here\nby registered voters.",
  "tags": [
    "books",
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-05T07:10:00+00:00"
}