{
  "url": "https://voxday.net/2014/06/12/tikrit-and-kirkuk-fa/",
  "scraped_at": "2025-12-16T12:17:14.901584",
  "title": "Tikrit and Kirkuk fall",
  "date_display": "June 12, 2014",
  "date_iso": "2014-06-12T17:09:00+00:00",
  "date_from_url": "2014-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Battle for Baghdad <a href=\"http://www.huffingtonpost.com/2014/06/12/iraq-kurds-seize-kirkuk_n_5487184.html\">is about to begin</a>:</p><blockquote class=\"tr_bq\"><p> Iraqi Kurdish  forces took control of the northern oil city of Kirkuk on<br> Thursday, after government troops abandoned their posts in the  face<br> of a triumphant Sunni Islamist rebel march towards Baghdad  that<br> threatens Iraq’s future as a unified state.</br></br></br></p><p>In<br> Mosul, Sunni militants of the Islamic State of Iraq and  the Levant<br> (ISIL) staged a parade of American Humvees seized  from the collapsing<br> Iraqi army in the two days since the  fighters drove out of the desert<br> and overran Iraq’s second  biggest city. Two<br> helicopters, also seized by the militants, flew  overhead, witnesses<br> said, apparently the first time the militant  group has obtained<br> aircraft in years of waging insurgency on  both sides of the<br> Iraqi-Syrian frontier.</br></br></br></br></br></br></br></br></p><p>State television showed<br> what it said was aerial footage of  Iraqi aircraft firing missiles at<br> insurgent targets in Mosul.  The targets could be seen exploding in<br> black clouds. Further south, the fighters<br> extended their lightning advance  to towns only about an hour’s drive<br> from the capital Baghdad,  where Shi’ite militia are mobilizing for a<br> potential replay of  the ethnic and sectarian bloodbath of 2006-2007.</br></br></br></br></br></br></p></blockquote><p>Three of Iraq’s four major cities are under control of one of the rebel forces. This is the natural consequence of the USA foolishly failing to partition Iraq into its three obvious parts, Kurdistan, Shiastan and Sunnistan. It’s also informative to see how quickly the Iraqi government has been forced to stop relying upon its professional army; it has adopted a militia system to reinforce the regular soldiers and is arming volunteers in order to defend Baghdad.</p><p>That is a compelling rebuttal to the modern notion that militia forces are outdated, when the fact is that while smaller, well-trained professional forces are useful for offensive actions, they are considerably less effective in defensive ones.</p></div>",
  "content_text": "The Battle for Baghdad\nis about to begin\n:\nIraqi Kurdish  forces took control of the northern oil city of Kirkuk on\nThursday, after government troops abandoned their posts in the  face\nof a triumphant Sunni Islamist rebel march towards Baghdad  that\nthreatens Iraq’s future as a unified state.\nIn\nMosul, Sunni militants of the Islamic State of Iraq and  the Levant\n(ISIL) staged a parade of American Humvees seized  from the collapsing\nIraqi army in the two days since the  fighters drove out of the desert\nand overran Iraq’s second  biggest city. Two\nhelicopters, also seized by the militants, flew  overhead, witnesses\nsaid, apparently the first time the militant  group has obtained\naircraft in years of waging insurgency on  both sides of the\nIraqi-Syrian frontier.\nState television showed\nwhat it said was aerial footage of  Iraqi aircraft firing missiles at\ninsurgent targets in Mosul.  The targets could be seen exploding in\nblack clouds. Further south, the fighters\nextended their lightning advance  to towns only about an hour’s drive\nfrom the capital Baghdad,  where Shi’ite militia are mobilizing for a\npotential replay of  the ethnic and sectarian bloodbath of 2006-2007.\nThree of Iraq’s four major cities are under control of one of the rebel forces. This is the natural consequence of the USA foolishly failing to partition Iraq into its three obvious parts, Kurdistan, Shiastan and Sunnistan. It’s also informative to see how quickly the Iraqi government has been forced to stop relying upon its professional army; it has adopted a militia system to reinforce the regular soldiers and is arming volunteers in order to defend Baghdad.\nThat is a compelling rebuttal to the modern notion that militia forces are outdated, when the fact is that while smaller, well-trained professional forces are useful for offensive actions, they are considerably less effective in defensive ones.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-12T16:09:00+00:00"
}