{
  "url": "https://voxday.net/2014/06/19/uruguay-v-england/",
  "scraped_at": "2025-12-16T12:18:01.712995",
  "title": "Uruguay v England",
  "date_display": "June 19, 2014",
  "date_iso": "2014-06-19T15:49:00+00:00",
  "date_from_url": "2014-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the game where we discover if England are a second-rate or<br> third-rate team. I didn’t think they showed much against Italy, but<br> then, Italy is one of the premier defensive teams and it’s easy to look<br> hapless and out-of-sorts against Gli Azzurri. Uruguay is always underrated and forgotten, but they are always a talented and technical team that can give absolutely anyone trouble. I’m looking forward to this one.</br></br></br></p><p>And in the meantime, I’m going to sit down and enjoy Columbia v Ivory Coast. Couldn’t care less who wins, but it should be entertaining enough.</p><p>UPDATE: yep, it was entertaining. Drogba had a chance to pull it level, but Columbia wins without too much trouble. The African teams just are not at the same technical level as the South American teams.</p><p>FIRST HALF: Tough miss by Rooney, but the cross to Suarez and his subsequent header were things of beauty. Nice active match between two good teams who are focused on attacking the goal.</p><p>SECOND HALF: Lovely team goal and easy finish for Rooney. But Suarez plays the miss – ALWAYS PLAY THE MISS – and puts away the long ball from the goalie that Gerrard deflected backwards. A pure striker’s goal. You can always tell the true striker, because he a) shoots on goal, and, b) doesn’t drill it right at the keeper. A good win for Uruguay, although there is no way they should have left Alvaro Pereira in the game after he was kneed in the head by Sterling.</p><p>Japan vs Greece has been a snoozer. The Japanese simply have no idea how to attack, even though Greece is down to 10 men after their captain picks up a pair of stupid yellow cards. </p></div>",
  "content_text": "This is the game where we discover if England are a second-rate or\nthird-rate team. I didn’t think they showed much against Italy, but\nthen, Italy is one of the premier defensive teams and it’s easy to look\nhapless and out-of-sorts against Gli Azzurri. Uruguay is always underrated and forgotten, but they are always a talented and technical team that can give absolutely anyone trouble. I’m looking forward to this one.\nAnd in the meantime, I’m going to sit down and enjoy Columbia v Ivory Coast. Couldn’t care less who wins, but it should be entertaining enough.\nUPDATE: yep, it was entertaining. Drogba had a chance to pull it level, but Columbia wins without too much trouble. The African teams just are not at the same technical level as the South American teams.\nFIRST HALF: Tough miss by Rooney, but the cross to Suarez and his subsequent header were things of beauty. Nice active match between two good teams who are focused on attacking the goal.\nSECOND HALF: Lovely team goal and easy finish for Rooney. But Suarez plays the miss – ALWAYS PLAY THE MISS – and puts away the long ball from the goalie that Gerrard deflected backwards. A pure striker’s goal. You can always tell the true striker, because he a) shoots on goal, and, b) doesn’t drill it right at the keeper. A good win for Uruguay, although there is no way they should have left Alvaro Pereira in the game after he was kneed in the head by Sterling.\nJapan vs Greece has been a snoozer. The Japanese simply have no idea how to attack, even though Greece is down to 10 men after their captain picks up a pair of stupid yellow cards.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-19T14:49:00+00:00"
}