{
  "url": "https://voxday.net/2014/06/12/what-could-go-wrong/",
  "scraped_at": "2025-12-16T12:17:11.221635",
  "title": "What could go wrong?",
  "date_display": "June 12, 2014",
  "date_iso": "2014-06-12T08:27:00+00:00",
  "date_from_url": "2014-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://family-studies.org/wp-content/uploads/2014/06/children-two-one-no-parents.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://family-studies.org/wp-content/uploads/2014/06/children-two-one-no-parents.jpg\" width=\"257\"/></a></div><p>Steve Sailer contemplates <a href=\"http://www.unz.com/isteve/a-terrific-graph/\">a possible reason</a> for the rigorous Islamic patriarchy:</p><p><i>“I’ve often wondered if the reactionary strictness of Islamic family<br> morals that irritates us sophisticated Westerners so much has something<br> to do with Islam originating just north of the edge of the black world,<br> with its high levels of familial chaos so evident on this graph. For<br> example, Amman, Jordan has had its own black slum for a long time. The<br> Arab slave trade introduced lots of blacks into Middle East (although<br> the black population didn’t grow quickly like it did in the American<br> South because Arab slaveowners tended to castrate the men and generally<br> work slaves to death).</br></br></br></br></br></br></br></br></i></p><p><i>“If you are from Sweden, the ideas of women working outside the house,<br> divorce, non-marital childbearing, etc. doesn’t seem too threatening to<br> Swedish culture’s stability and efficiency. You look around and ask,<br> “What could possibly go wrong?” On the other hand, in the Islamic countries of North Africa and the<br> Middle East, if you ask what could possibly go wrong if we loosen up our<br> family mores, you look to the south and and say, “Oh, yeah, a lot …””</br></br></br></br></br></i></p><p>This consideration of the discivic implications of single motherhood is rather timely, as over at Alpha Game, I was observing that when successful men are asked about what lessons they learned from their fathers, <a href=\"http://alphagameplan.blogspot.com/2014/06/fathers-are-civilizing-force.html\">the lessons appear to be much the same</a> whether the father is a wealthy corporate magnate or a postman. But it should be alarming to see that the USA’s percentage of children being raised by one or fewer parents (and by parents, that generally means mothers), is already worse than Ethiopia, Mexico, and Nigeria.</p></div>",
  "content_text": "Steve Sailer contemplates\na possible reason\nfor the rigorous Islamic patriarchy:\n“I’ve often wondered if the reactionary strictness of Islamic family\nmorals that irritates us sophisticated Westerners so much has something\nto do with Islam originating just north of the edge of the black world,\nwith its high levels of familial chaos so evident on this graph. For\nexample, Amman, Jordan has had its own black slum for a long time. The\nArab slave trade introduced lots of blacks into Middle East (although\nthe black population didn’t grow quickly like it did in the American\nSouth because Arab slaveowners tended to castrate the men and generally\nwork slaves to death).\n“If you are from Sweden, the ideas of women working outside the house,\ndivorce, non-marital childbearing, etc. doesn’t seem too threatening to\nSwedish culture’s stability and efficiency. You look around and ask,\n“What could possibly go wrong?” On the other hand, in the Islamic countries of North Africa and the\nMiddle East, if you ask what could possibly go wrong if we loosen up our\nfamily mores, you look to the south and and say, “Oh, yeah, a lot …””\nThis consideration of the discivic implications of single motherhood is rather timely, as over at Alpha Game, I was observing that when successful men are asked about what lessons they learned from their fathers,\nthe lessons appear to be much the same\nwhether the father is a wealthy corporate magnate or a postman. But it should be alarming to see that the USA’s percentage of children being raised by one or fewer parents (and by parents, that generally means mothers), is already worse than Ethiopia, Mexico, and Nigeria.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-12T07:27:00+00:00"
}