{
  "url": "https://voxday.net/2014/06/09/why-amazon-are-good-guys/",
  "scraped_at": "2025-12-16T12:16:48.959024",
  "title": "Why Amazon are the good guys",
  "date_display": "June 9, 2014",
  "date_iso": "2014-06-09T07:36:00+00:00",
  "date_from_url": "2014-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hugh Howey <a href=\"http://www.hughhowey.com/winning-at-monopoly/\">makes many of the same points I have</a> concerning the Amazon-Hatchette battle, only in more detail, and he reminds everyone that the behavior of the Big 5 publishing cartel from which Amazon has liberated authors is worse than most people know:</p><blockquote class=\"tr_bq\"><p> The real monopoly, once you start examining business practices and attitudes, is Big Publishing itself, a group so entrenched with one another and indistinguishable from one another that they simply go by the collective moniker: The Big 5.</p><p>Their contracts are functionally identical. Their e-book royalties (and most others terms and clauses) are lockstep and are not negotiable. They have a history of working together in a noncompetitive fashion in order to raise prices for their customers (prices that they would love to set at twice what mass market paperbacks formerly cost). Conferring by phone or email in this culture is considered polite, not illegal. It wasn’t long ago that top editors at the major houses would meet on Wednesdays to discuss the bestseller list, to congratulate one another on acquisitions, and to discuss business plans and practices. All completely normal. Celebrated, even.</p><p>When members of the Big 5 do compete (truly compete, not just offer varying marketing promises and sizes of advances), the offender needs to be reigned in quickly. When Simon &amp; Schuster innovated with print-only deals—thereby landing bestselling authors who were otherwise never going to sign with any major publisher—the resulting press on these deals (and likely pressure from other publishers) caused an immediate retreat. The poor publisher who stepped out of line dutifully pulled back into rank. Print-only deals were no longer on the table. Contracts snapped back to their immutable and noncompetitive form.</p><p>Or what about the “most favored nation clauses?” These pernicious contractual entities stipulate that any authors who get higher royalties in the future will trigger a retroactive match in royalties for select existing authors. This is like a sports contract that simply stipulates “I’ll always be the highest paid player.” It hamstrings all the publishers in a knot of anti-competitiveness. Where is the outrage or the reporting? Once again, we have a hardening of the monoculture where dissent is impossible and innovation stifled. Instead, the major publishers play Monopoly like my boss used to.</p><p>Unable to tolerate a move toward democratic literature, where any voice is free to publish, where authors are paid 70% of list price instead of a mere 17.5%, they rely instead on appeals to litigation, on a public relations campaign within the press, and on collusion.</p></blockquote><p>Another point that I have not seen anyone touch upon is that unlike the Big 5, Amazon gives authors direct access to international book-buying markets. Tomorrow, Castalia House will be releasing its second and third Brazilian Portuguese books, <i>Um Homem Desintegrado</i> and <i>Gravidade Mortal</i>. That simply would not have been possible if Steve and I were publishing through a traditional publisher.</p><p>However, this is the core point: “Why show support for a corporation that <i>may lower royalties to 30% in the future</i> when you can celebrate a corporation that pays 17.5% today? Why show support for a corporation that <i>may raise prices in the future</i> when you can champion a corporation that colludes to raise them today? The groupthink and absence of reason is baffling.”</p><p>There are two reasons. The first is that authors are conditioned to kowtow to the traditional gatekeepers. The second is that authors who are doing well under the current system are terrified that they may not be able to compete as effectively without being the structurally favored sons – and daughters – of the gatekeepers. And given what the gatekeepers have been favoring for the last two decades, I suspect their fears are well-justified.</p><p>One final note: it is ABSOLUTELY INSANE that the conventional publishers aren’t leveraging their one area of historical expertise by doing print-only deals. It’s the one thing they can do very well that the independents and self-publishers can’t as easily do, and in many cases, that the two groups won’t even bother doing. Instead, by insisting on being granted both print and ebook rights, they’ll usually end up with nothing.</p><p>Speaking of Amazon, the Hugo-nominated novelette <a href=\"http://www.amazon.com/Opera-Vita-Aeterna-Vox-Day-ebook/dp/B00KSBQI84\">“Opera Vita Aeterna”</a> is a free download from Amazon today and tomorrow. Not only do the Big 5 publishers give away only a small fraction of the free books that Amazon does, but they junk their unsold stock rather than let anyone read them.</p><p> UPDATE: The Amazonians are voting with their downloads.</p><p><b>Lady Astronaut of Mars:</b> #1,942 Free in Kindle Store<br> <b>Opera Vita Aeterna:</b><br> #628 Free in Kindle Store</br></br></p><p><i>(Relax, I know the rankings are dynamic. This is more of that strange and unfamiliar concept called ‘humor’.)</i></p></div>",
  "content_text": "Hugh Howey\nmakes many of the same points I have\nconcerning the Amazon-Hatchette battle, only in more detail, and he reminds everyone that the behavior of the Big 5 publishing cartel from which Amazon has liberated authors is worse than most people know:\nThe real monopoly, once you start examining business practices and attitudes, is Big Publishing itself, a group so entrenched with one another and indistinguishable from one another that they simply go by the collective moniker: The Big 5.\nTheir contracts are functionally identical. Their e-book royalties (and most others terms and clauses) are lockstep and are not negotiable. They have a history of working together in a noncompetitive fashion in order to raise prices for their customers (prices that they would love to set at twice what mass market paperbacks formerly cost). Conferring by phone or email in this culture is considered polite, not illegal. It wasn’t long ago that top editors at the major houses would meet on Wednesdays to discuss the bestseller list, to congratulate one another on acquisitions, and to discuss business plans and practices. All completely normal. Celebrated, even.\nWhen members of the Big 5 do compete (truly compete, not just offer varying marketing promises and sizes of advances), the offender needs to be reigned in quickly. When Simon & Schuster innovated with print-only deals—thereby landing bestselling authors who were otherwise never going to sign with any major publisher—the resulting press on these deals (and likely pressure from other publishers) caused an immediate retreat. The poor publisher who stepped out of line dutifully pulled back into rank. Print-only deals were no longer on the table. Contracts snapped back to their immutable and noncompetitive form.\nOr what about the “most favored nation clauses?” These pernicious contractual entities stipulate that any authors who get higher royalties in the future will trigger a retroactive match in royalties for select existing authors. This is like a sports contract that simply stipulates “I’ll always be the highest paid player.” It hamstrings all the publishers in a knot of anti-competitiveness. Where is the outrage or the reporting? Once again, we have a hardening of the monoculture where dissent is impossible and innovation stifled. Instead, the major publishers play Monopoly like my boss used to.\nUnable to tolerate a move toward democratic literature, where any voice is free to publish, where authors are paid 70% of list price instead of a mere 17.5%, they rely instead on appeals to litigation, on a public relations campaign within the press, and on collusion.\nAnother point that I have not seen anyone touch upon is that unlike the Big 5, Amazon gives authors direct access to international book-buying markets. Tomorrow, Castalia House will be releasing its second and third Brazilian Portuguese books,\nUm Homem Desintegrado\nand\nGravidade Mortal\n. That simply would not have been possible if Steve and I were publishing through a traditional publisher.\nHowever, this is the core point: “Why show support for a corporation that\nmay lower royalties to 30% in the future\nwhen you can celebrate a corporation that pays 17.5% today? Why show support for a corporation that\nmay raise prices in the future\nwhen you can champion a corporation that colludes to raise them today? The groupthink and absence of reason is baffling.”\nThere are two reasons. The first is that authors are conditioned to kowtow to the traditional gatekeepers. The second is that authors who are doing well under the current system are terrified that they may not be able to compete as effectively without being the structurally favored sons – and daughters – of the gatekeepers. And given what the gatekeepers have been favoring for the last two decades, I suspect their fears are well-justified.\nOne final note: it is ABSOLUTELY INSANE that the conventional publishers aren’t leveraging their one area of historical expertise by doing print-only deals. It’s the one thing they can do very well that the independents and self-publishers can’t as easily do, and in many cases, that the two groups won’t even bother doing. Instead, by insisting on being granted both print and ebook rights, they’ll usually end up with nothing.\nSpeaking of Amazon, the Hugo-nominated novelette\n“Opera Vita Aeterna”\nis a free download from Amazon today and tomorrow. Not only do the Big 5 publishers give away only a small fraction of the free books that Amazon does, but they junk their unsold stock rather than let anyone read them.\nUPDATE: The Amazonians are voting with their downloads.\nLady Astronaut of Mars:\n#1,942 Free in Kindle Store\nOpera Vita Aeterna:\n#628 Free in Kindle Store\n(Relax, I know the rankings are dynamic. This is more of that strange and unfamiliar concept called ‘humor’.)",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-09T06:36:00+00:00"
}