{
  "url": "https://voxday.net/2014/06/01/world-cup-2014/",
  "scraped_at": "2025-12-16T12:16:00.768428",
  "title": "World Cup 2014",
  "date_display": "June 1, 2014",
  "date_iso": "2014-06-01T10:47:00+00:00",
  "date_from_url": "2014-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is shaping up to be an interesting and wide-open <i>Mondiale</i>. Brazil would normally be the big favorites, as the home countries usually do well, but as one newspaper has commented, the corruption of the Brazilian government and the shameless fraud associated with the construction of the tournament stadiums has actually turned the majority of the Brazilians against the World Cup. This is a staggering achievement and is a testimony to the unvarnished corruption rife within FIFA.</p><p>Literally dozens of international friendlies and qualifiers are suspected of having been at least partially fixed; there are even some serious questions about the legitimacy of a number of games <a href=\"http://www.nytimes.com/2014/06/01/sports/soccer/fixed-matches-cast-shadow-over-world-cup.html?_r=0\">leading up to the previous World Cup</a> in South Africa.</p><blockquote class=\"tr_bq\"><p> A soccer referee named Ibrahim Chaibou walked into a bank in a small South African city carrying a bag filled with as much as $100,000 in $100 bills, according to another referee traveling with him. The deposit was so large that a bank employee gave Mr. Chaibou a gift of commemorative coins bearing the likeness of Nelson Mandela.</p><p>Later that night in May 2010, Mr. Chaibou refereed an exhibition match between South Africa and Guatemala in preparation for the World Cup, the world’s most popular sporting event. Even to the casual fan, his calls were suspicious — he called two penalties for hand balls even though the ball went nowhere near the players’ hands.</p><p>Mr. Chaibou, a native of Niger, had been chosen to work the match by a company based in Singapore that was a front for a notorious match-rigging syndicate, according to an internal, confidential report by FIFA, soccer’s world governing body.</p><p>FIFA’s investigative report and related documents, which were obtained by The New York Times and have not been publicly released, raise serious questions about the vulnerability of the World Cup to match fixing. The tournament opens June 12 in Brazil.</p><p>The report found that the match-rigging syndicate and its referees infiltrated the upper reaches of global soccer in order to fix exhibition matches and exploit them for betting purposes. It provides extensive details of the clever and brazen ways that fixers apparently manipulated “at least five matches and possibly more” in South Africa ahead of the last World Cup. As many as 15 matches were targets, including a game between the United States and Australia, according to interviews and emails printed in the FIFA report.</p></blockquote><p>Apparently, it’s nearly as bad as the NBA during the David Stern era. As for the tournament itself, Italy’s slim chances just took a blow with the loss of Riccardo Montolivo. Spain is beginning to look a bit creaky and underpowered up front, and both Argentina and Portugal look more like potential semifinalists than potential champions. In the end, I think Germany and Brazil look like the two teams to beat, with a slight nod to Brazil for being the home team. Let’s face it, once the games actually start, the Brazilians are going to rally round their team.</p><p>Of the lesser teams, Switzerland looks solid. The USA has a decent young team, (although I would have brought Landon Donovan along in-case-of-emergency-break-glass purposes), but I can’t see them getting out of the Group of Death, not with Germany and Portugal in Group G. Ghana isn’t bad either, so it’s not inconceivable that the USA could go pointless despite playing well. Holland is good, but Van Persie isn’t enough to get them past the second round.</p></div>",
  "content_text": "This is shaping up to be an interesting and wide-open\nMondiale\n. Brazil would normally be the big favorites, as the home countries usually do well, but as one newspaper has commented, the corruption of the Brazilian government and the shameless fraud associated with the construction of the tournament stadiums has actually turned the majority of the Brazilians against the World Cup. This is a staggering achievement and is a testimony to the unvarnished corruption rife within FIFA.\nLiterally dozens of international friendlies and qualifiers are suspected of having been at least partially fixed; there are even some serious questions about the legitimacy of a number of games\nleading up to the previous World Cup\nin South Africa.\nA soccer referee named Ibrahim Chaibou walked into a bank in a small South African city carrying a bag filled with as much as $100,000 in $100 bills, according to another referee traveling with him. The deposit was so large that a bank employee gave Mr. Chaibou a gift of commemorative coins bearing the likeness of Nelson Mandela.\nLater that night in May 2010, Mr. Chaibou refereed an exhibition match between South Africa and Guatemala in preparation for the World Cup, the world’s most popular sporting event. Even to the casual fan, his calls were suspicious — he called two penalties for hand balls even though the ball went nowhere near the players’ hands.\nMr. Chaibou, a native of Niger, had been chosen to work the match by a company based in Singapore that was a front for a notorious match-rigging syndicate, according to an internal, confidential report by FIFA, soccer’s world governing body.\nFIFA’s investigative report and related documents, which were obtained by The New York Times and have not been publicly released, raise serious questions about the vulnerability of the World Cup to match fixing. The tournament opens June 12 in Brazil.\nThe report found that the match-rigging syndicate and its referees infiltrated the upper reaches of global soccer in order to fix exhibition matches and exploit them for betting purposes. It provides extensive details of the clever and brazen ways that fixers apparently manipulated “at least five matches and possibly more” in South Africa ahead of the last World Cup. As many as 15 matches were targets, including a game between the United States and Australia, according to interviews and emails printed in the FIFA report.\nApparently, it’s nearly as bad as the NBA during the David Stern era. As for the tournament itself, Italy’s slim chances just took a blow with the loss of Riccardo Montolivo. Spain is beginning to look a bit creaky and underpowered up front, and both Argentina and Portugal look more like potential semifinalists than potential champions. In the end, I think Germany and Brazil look like the two teams to beat, with a slight nod to Brazil for being the home team. Let’s face it, once the games actually start, the Brazilians are going to rally round their team.\nOf the lesser teams, Switzerland looks solid. The USA has a decent young team, (although I would have brought Landon Donovan along in-case-of-emergency-break-glass purposes), but I can’t see them getting out of the Group of Death, not with Germany and Portugal in Group G. Ghana isn’t bad either, so it’s not inconceivable that the USA could go pointless despite playing well. Holland is good, but Van Persie isn’t enough to get them past the second round.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-06-01T09:47:00+00:00"
}