{
  "url": "https://voxday.net/2021/01/04/a-trap-confirmed/",
  "scraped_at": "2025-12-21T22:32:10.477728",
  "title": "A trap confirmed",
  "date_display": "January 4, 2021",
  "date_iso": "2021-01-04T16:14:13+00:00",
  "date_from_url": "2021-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Item: </b><i>“Veritas has had an team of undercover agents in Georgia for months.”</i> – James O’Keefe</p><p><b>Item:</b> <i>“Potus gave Raffensperger, Fuchs, and Kemp many olive branches to come clean. Now the veritable James O’Keefe can make his move and proverbially bury them with clean conscience.”</i> – CodeMonkeyZ</p><p><b>Item: </b><i>“White House planning to refer Brad Raffensperger WaPo leak to Secret Service for investigation under national security grounds of the Espionage Act. Have a feeling Jordan Fuchs isnt going to be having a nice week”</i> – Jack Posobiec</p><p>Contra the mainstream narrative, I didn’t think for one second that it was out of desperation that President Trump made that recorded phone call to the Georgia Secretary of State. It was the merciful act of a man willing to give his enemies one last chance to surrender.</p></div>",
  "content_text": "Item:\n“Veritas has had an team of undercover agents in Georgia for months.”\n– James O’Keefe\nItem:\n“Potus gave Raffensperger, Fuchs, and Kemp many olive branches to come clean. Now the veritable James O’Keefe can make his move and proverbially bury them with clean conscience.”\n– CodeMonkeyZ\nItem:\n“White House planning to refer Brad Raffensperger WaPo leak to Secret Service for investigation under national security grounds of the Espionage Act. Have a feeling Jordan Fuchs isnt going to be having a nice week”\n– Jack Posobiec\nContra the mainstream narrative, I didn’t think for one second that it was out of desperation that President Trump made that recorded phone call to the Georgia Secretary of State. It was the merciful act of a man willing to give his enemies one last chance to surrender.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-04T16:14:13+00:00"
}