{
  "url": "https://voxday.net/2021/01/29/breaking-robinhood/",
  "scraped_at": "2025-12-21T22:35:57.509115",
  "title": "Breaking Robinhood",
  "date_display": "January 29, 2021",
  "date_iso": "2021-01-29T14:21:56+00:00",
  "date_from_url": "2021-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The GameStop investors will be able to go all Sheriff of Nottingham and easily bury Robinhood in arbitration if they wish, as it has the same insanely stupid ban on class arbitration incorporated into its terms of use that many tech firms do. Note that JAMS used to wisely <i>mandate </i>a class arbitration clause in its rules, but <a href=\"https://www.dltlaw.com/alerts/jams-revises-procedures-on-class-wide-arbitration/\" rel=\"noopener\" target=\"_blank\">removed it in 2005</a> because the idiot tech corporations didn’t want to risk losing in arbitration to all their users if they did something shady. Instead, the technocracy forced a system on everyone that can quite literally bankrupt them in order to save a little on potential litigation fees. The stupidity is epic-class.</p><blockquote><p>38. Arbitration.</p><p>A. This Agreement contains a pre-dispute arbitration clause. By signing an arbitration agreement, the parties agree as follows: (1) All parties to this Agreement are giving up the right to sue each other in court, including the right to a trial by jury, except as provided by the rules of the arbitration forum in which a claim is filed. (2) Arbitration awards are generally final and binding; a party’s ability to have a court reverse or modify an arbitration award is very limited. (3) The ability of the parties to obtain documents, witness statements and other discovery is generally more limited in arbitration than in court proceedings. (4) The arbitrators do not have to explain the reason(s) for their award unless, in an eligible case, a joint request for an explained decision has been submitted by all parties to the panel at least 20 days prior to the first scheduled hearing date. (5) The panel of arbitrators will typically include a minority of arbitrators who were or are affiliated with the securities industry. (6) The rules of some arbitration forums may impose time limits for bringing a claim in arbitration. In some cases, a claim that is ineligible for arbitration may be brought in court. (7) The rules of the arbitration forum in which the claim is filed, and any amendments thereto, shall be incorporated into this Agreement. B. Any controversy or claim arising out of or relating to this Agreement, any other agreement between Me and Robinhood, any Account(s) established hereunder, any transaction therein, shall be settled by arbitration in accordance with the rules of FINRA Dispute Resolution, Inc. (“FINRA DR”). I agree to arbitrate any controversy or claim before FINRA DR in the State of California. C. This agreement to arbitrate constitutes a waiver of the right to seek a judicial forum unless such a waiver would be void under the federal securities laws. If I am a foreign national, non-resident alien, or if I do not reside in the United States, I agree to waive My right to file an action against Robinhood in any foreign venue. D. No person shall bring a putative or certified class action to arbitration, nor seek to enforce any pre-dispute arbitration agreement against any person who has initiated in court a putative class action; or who is a member of a putative class who has not opted out of the class with respect to any claims encompassed by the putative class action until: (1) the class certification is denied; or (2) the class is decertified; or (3) the customer is excluded from the class by the court. Such forbearance to enforce an agreement to arbitrate shall not constitute a waiver of any rights under this Agreement except to the extent stated herein.</p></blockquote><p>Two observations:</p><ul style=\"text-align: left;\"><li>Unlike AAA, <a href=\"https://www.finra.org/arbitration-mediation/printable-code-arbitration-procedure-12000#12214.\" rel=\"noopener\" target=\"_blank\">FINRA has no rule</a> allowing an arbitrator to declare an arbitration to be “frivolous”, and furthermore, the right to file even frivolous arbitrations is protected by the Federal Arbitration Act and the Supreme Court rulings <i>Steelworkers </i>and <i>Schein</i>.</li><li>Robinhood’s terms of use specify California law. CCP Section 1284.3 prevents any consumer from being charged anything for an arbitration proceeding beyond the initial filing fee. <i>“No neutral arbitrator or private arbitration company shall administer a consumer arbitration under any agreement or rule requiring that a consumer who is a party to the arbitration pay the fees and costs incurred by an opposing party if the consumer does not prevail in the arbitration, including, but not limited to, the fees and costs of the arbitrator, provider organization, attorney, or witnesses.”</i></li></ul><div>If this sounds like a foreign language to you, I strongly suggest reading <i>Corporate Cancer</i>, particularly chapters 8-10.</div><p>The Ride Never Ends.</p></div>",
  "content_text": "The GameStop investors will be able to go all Sheriff of Nottingham and easily bury Robinhood in arbitration if they wish, as it has the same insanely stupid ban on class arbitration incorporated into its terms of use that many tech firms do. Note that JAMS used to wisely\nmandate\na class arbitration clause in its rules, but\nremoved it in 2005\nbecause the idiot tech corporations didn’t want to risk losing in arbitration to all their users if they did something shady. Instead, the technocracy forced a system on everyone that can quite literally bankrupt them in order to save a little on potential litigation fees. The stupidity is epic-class.\n38. Arbitration.\nA. This Agreement contains a pre-dispute arbitration clause. By signing an arbitration agreement, the parties agree as follows: (1) All parties to this Agreement are giving up the right to sue each other in court, including the right to a trial by jury, except as provided by the rules of the arbitration forum in which a claim is filed. (2) Arbitration awards are generally final and binding; a party’s ability to have a court reverse or modify an arbitration award is very limited. (3) The ability of the parties to obtain documents, witness statements and other discovery is generally more limited in arbitration than in court proceedings. (4) The arbitrators do not have to explain the reason(s) for their award unless, in an eligible case, a joint request for an explained decision has been submitted by all parties to the panel at least 20 days prior to the first scheduled hearing date. (5) The panel of arbitrators will typically include a minority of arbitrators who were or are affiliated with the securities industry. (6) The rules of some arbitration forums may impose time limits for bringing a claim in arbitration. In some cases, a claim that is ineligible for arbitration may be brought in court. (7) The rules of the arbitration forum in which the claim is filed, and any amendments thereto, shall be incorporated into this Agreement. B. Any controversy or claim arising out of or relating to this Agreement, any other agreement between Me and Robinhood, any Account(s) established hereunder, any transaction therein, shall be settled by arbitration in accordance with the rules of FINRA Dispute Resolution, Inc. (“FINRA DR”). I agree to arbitrate any controversy or claim before FINRA DR in the State of California. C. This agreement to arbitrate constitutes a waiver of the right to seek a judicial forum unless such a waiver would be void under the federal securities laws. If I am a foreign national, non-resident alien, or if I do not reside in the United States, I agree to waive My right to file an action against Robinhood in any foreign venue. D. No person shall bring a putative or certified class action to arbitration, nor seek to enforce any pre-dispute arbitration agreement against any person who has initiated in court a putative class action; or who is a member of a putative class who has not opted out of the class with respect to any claims encompassed by the putative class action until: (1) the class certification is denied; or (2) the class is decertified; or (3) the customer is excluded from the class by the court. Such forbearance to enforce an agreement to arbitrate shall not constitute a waiver of any rights under this Agreement except to the extent stated herein.\nTwo observations:\nUnlike AAA,\nFINRA has no rule\nallowing an arbitrator to declare an arbitration to be “frivolous”, and furthermore, the right to file even frivolous arbitrations is protected by the Federal Arbitration Act and the Supreme Court rulings\nSteelworkers\nand\nSchein\n.\nRobinhood’s terms of use specify California law. CCP Section 1284.3 prevents any consumer from being charged anything for an arbitration proceeding beyond the initial filing fee.\n“No neutral arbitrator or private arbitration company shall administer a consumer arbitration under any agreement or rule requiring that a consumer who is a party to the arbitration pay the fees and costs incurred by an opposing party if the consumer does not prevail in the arbitration, including, but not limited to, the fees and costs of the arbitrator, provider organization, attorney, or witnesses.”\nIf this sounds like a foreign language to you, I strongly suggest reading\nCorporate Cancer\n, particularly chapters 8-10.\nThe Ride Never Ends.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-29T14:21:56+00:00"
}