{
  "url": "https://voxday.net/2021/01/09/fire-firefox/",
  "scraped_at": "2025-12-21T22:32:54.081495",
  "title": "Fire Firefox",
  "date_display": "January 9, 2021",
  "date_iso": "2021-01-09T16:47:28+00:00",
  "date_from_url": "2021-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I switched from Firefox to Brave long ago. If you haven’t stopped using Firefox yet, it’s time to do so, because Mozilla has gone beyond mere SJW convergence <a href=\"https://www.newswars.com/mozilla-says-deplatforming-trump-not-enough-wants-to-shield-internet-from-bad-actors-as-users-uninstall-firefox-in-disgust/\" rel=\"noopener\" target=\"_blank\">to full sociofascist superconvergence</a>:</p><blockquote><p>Mozilla, developer of the Firefox internet browser, has argued that more must be done to keep Donald Trump and other “bad actors” out of cyberspace, prompting many to vow to never use the group’s services again.</p><p>In a blog post titled ‘We need more than deplatforming’, the open-source software community said that Twitter’s decision to permanently ban Trump from its platform didn’t go far enough in weeding out “hate” on the internet. While blaming Trump for the “siege and take-over” of the US Capitol on January 6, the non-profit tech group argued that “white supremacy is about more than any one personality.”</p><p><i>“We need solutions that don’t start after untold damage has been done. Changing these dangerous dynamics requires more than just the temporary silencing or permanent removal of bad actors from social media platforms,”</i> Mozilla wrote.</p><p>The group proposed a number of measures to help protect the internet from verboten views. Internet ads should list who paid for them, how much they are paying, and who is being targeted, Mozilla said. There should also be “meaningful transparency” of platform algorithms so that people can examine what kind of content is being promoted. </p><p>The group also demanded that “tools to amplify factual voices over disinformation” are added to the default settings of internet platforms, and said that independent research must be carried out to determine how social media is affecting society and what can be done to “improve things.”</p><p>The blog post concluded by stating that the answer to Trump and other allegedly bad voices was not to “do away with the internet,” but rather to “build a better one” that can “withstand” such “challenges.”</p></blockquote><p>Stop supporting those who hate you. More importantly, stop <i>relying </i>upon them. </p></div>",
  "content_text": "I switched from Firefox to Brave long ago. If you haven’t stopped using Firefox yet, it’s time to do so, because Mozilla has gone beyond mere SJW convergence\nto full sociofascist superconvergence\n:\nMozilla, developer of the Firefox internet browser, has argued that more must be done to keep Donald Trump and other “bad actors” out of cyberspace, prompting many to vow to never use the group’s services again.\nIn a blog post titled ‘We need more than deplatforming’, the open-source software community said that Twitter’s decision to permanently ban Trump from its platform didn’t go far enough in weeding out “hate” on the internet. While blaming Trump for the “siege and take-over” of the US Capitol on January 6, the non-profit tech group argued that “white supremacy is about more than any one personality.”\n“We need solutions that don’t start after untold damage has been done. Changing these dangerous dynamics requires more than just the temporary silencing or permanent removal of bad actors from social media platforms,”\nMozilla wrote.\nThe group proposed a number of measures to help protect the internet from verboten views. Internet ads should list who paid for them, how much they are paying, and who is being targeted, Mozilla said. There should also be “meaningful transparency” of platform algorithms so that people can examine what kind of content is being promoted.\nThe group also demanded that “tools to amplify factual voices over disinformation” are added to the default settings of internet platforms, and said that independent research must be carried out to determine how social media is affecting society and what can be done to “improve things.”\nThe blog post concluded by stating that the answer to Trump and other allegedly bad voices was not to “do away with the internet,” but rather to “build a better one” that can “withstand” such “challenges.”\nStop supporting those who hate you. More importantly, stop\nrelying\nupon them.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-09T16:47:28+00:00"
}