{
  "url": "https://voxday.net/2021/01/26/google-doubles-down/",
  "scraped_at": "2025-12-21T22:35:32.061934",
  "title": "Google doubles down",
  "date_display": "January 26, 2021",
  "date_iso": "2021-01-26T12:19:51+00:00",
  "date_from_url": "2021-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Hello,</i></p><p><i>Thank you for your account suspension appeal. We have decided to keep your account suspended based on our Community Guidelines and Terms of Service. Please visit http://www.youtube.com/t/community_guidelines for more information.</i></p><p><i>Please do not respond to this email. Replies to this email will not be processed. Please refer to our Help Center for more information.</i></p><p><i>Sincerely,</i></p><p><i>The YouTube Team</i></p><p>It’s on! This will not be an arbitration, as the YouTube terms mandate that if one lives in the European Economic Area, or Switzerland, the agreement will be governed by the laws of one’s country of residence, and legal proceedings may be brought in one’s local courts.</p><p>Discovery is certainly going to be interesting, given that we have loads of copies of their internal communications about me.</p><p><b>UPDATE: </b>Please to stop with the retardery. I am completely aware that the channels are still up. <i>That is not the point.</i> It is the account access to them has been blocked by YouTube due to its false and defamatory accusation of “spam, scams or commercially deceptive content” having been previously broadcast. I am fairly confident that I know their grounds for the accusation, which is too monstrously stupid to even mention publicly because you would probably not believe it, but which you should be able to ascertain if you watch the most recent video.</p></div>",
  "content_text": "Hello,\nThank you for your account suspension appeal. We have decided to keep your account suspended based on our Community Guidelines and Terms of Service. Please visit http://www.youtube.com/t/community_guidelines for more information.\nPlease do not respond to this email. Replies to this email will not be processed. Please refer to our Help Center for more information.\nSincerely,\nThe YouTube Team\nIt’s on! This will not be an arbitration, as the YouTube terms mandate that if one lives in the European Economic Area, or Switzerland, the agreement will be governed by the laws of one’s country of residence, and legal proceedings may be brought in one’s local courts.\nDiscovery is certainly going to be interesting, given that we have loads of copies of their internal communications about me.\nUPDATE:\nPlease to stop with the retardery. I am completely aware that the channels are still up.\nThat is not the point.\nIt is the account access to them has been blocked by YouTube due to its false and defamatory accusation of “spam, scams or commercially deceptive content” having been previously broadcast. I am fairly confident that I know their grounds for the accusation, which is too monstrously stupid to even mention publicly because you would probably not believe it, but which you should be able to ascertain if you watch the most recent video.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-26T12:19:51+00:00"
}