{
  "url": "https://voxday.net/2021/01/02/hellmouth-2-0/",
  "scraped_at": "2025-12-21T22:31:50.262027",
  "title": "Hellmouth 2.0",
  "date_display": "January 2, 2021",
  "date_iso": "2021-01-02T01:24:22+00:00",
  "date_from_url": "2021-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When conservatives began to abandon Twitter, the gatekeepers brought you Parler. When nationalism began to rise, the gatekeepers brought you Jordan Peterson. Now that Disney and Netflix have gone off the deep end and consumers are abandoning them, <a href=\"https://www.outkick.com/ben-shapiro-entertainment-hollywood/\" rel=\"noopener\" target=\"_blank\">Ben Shapiro is going to make movies</a> for conservatives:</p><blockquote><p>Industries become more politically-driven each year. Our most influential industries — media, Hollywood, education, sports, and social media — have headed only in a leftward direction, causing the demand for alternatives to grow stronger.</p><p>The most untouched thus far has been Hollywood, which went as far Left in 2020 as Big Tech and news. Big Tech has Parler and Rumble. The media has Fox News, The Blaze, The Daily Caller, and Joe Rogan. Entertainment has thus far had no alternatives, but it soon will.</p><p>The Daily Wire is getting into the entertainment business in 2021, as company co-founder Ben Shapiro explained Friday. Shapiro and the Daily Wire are going to bring out edgy movies that he says won’t mock values. The company will produce TV shows, both comedies and dramas, that “don’t take advantage of your viewership to promote Leftist causes.” In other words, the exact opposite of the “Coming Soon” section on Netflix.</p></blockquote><p>One way or another, the Prometheans are going to try to keep you on their hellish reservation. Isn’t it interesting that someone is going to pump tens of millions of dollars into Shapiro’s efforts despite the fact that he has absolutely no entertainment industry experience, credentials, or talent? And isn’t it telling that all of the existing alternatives are completely ignored?</p><p>Here is my prediction: Arkhaven is going to see multiple acquisition offers in 2021, in addition to various offers to invest in it, after the new site launches in the spring. This is exactly what happened to Castalia very early on. Of course, we made it clear that we had less than zero interest in being acquired. And what we’re introducing with Arkhaven will dwarf everything that we’ve previously done to date.</p><p>As for<i> Rebel’s Run</i>, the script is complete and approved, and casting is in progress. A second script for a comedy is already complete.</p><p><b>UPDATE: </b>the Hellmouth 2.0 project could well be inadvertently comical. It’s not their first attempt, as the guy who made <a href=\"https://www.imdb.com/title/tt0491162/reviews\" rel=\"noopener\" target=\"_blank\">this trainwreck</a> is at the center of the efforts.</p><blockquote><p>As a true lover of film I must advise you to avoid this appalling effort. God knows how funding was approved. Seriously this is one cinematic experience which delivers zero dramatic tension and plods along until nothing happens again and again and again. The only connectivity is two scares which at least keep you awake. Possibly the worst film I have ever witnessed and the acting by the female lead is bordering on criminal intent. One blessing with modern technology you can fast forward and watch it on 12x and it will only last 25 minutes. And you won’t miss any of the plot. No idea how people find this at all interesting and some are giving it high marks!</p></blockquote><p>Oh, I’m pretty sure we know how the funding was obtained… and why some were giving it high marks.</p></div>",
  "content_text": "When conservatives began to abandon Twitter, the gatekeepers brought you Parler. When nationalism began to rise, the gatekeepers brought you Jordan Peterson. Now that Disney and Netflix have gone off the deep end and consumers are abandoning them,\nBen Shapiro is going to make movies\nfor conservatives:\nIndustries become more politically-driven each year. Our most influential industries — media, Hollywood, education, sports, and social media — have headed only in a leftward direction, causing the demand for alternatives to grow stronger.\nThe most untouched thus far has been Hollywood, which went as far Left in 2020 as Big Tech and news. Big Tech has Parler and Rumble. The media has Fox News, The Blaze, The Daily Caller, and Joe Rogan. Entertainment has thus far had no alternatives, but it soon will.\nThe Daily Wire is getting into the entertainment business in 2021, as company co-founder Ben Shapiro explained Friday. Shapiro and the Daily Wire are going to bring out edgy movies that he says won’t mock values. The company will produce TV shows, both comedies and dramas, that “don’t take advantage of your viewership to promote Leftist causes.” In other words, the exact opposite of the “Coming Soon” section on Netflix.\nOne way or another, the Prometheans are going to try to keep you on their hellish reservation. Isn’t it interesting that someone is going to pump tens of millions of dollars into Shapiro’s efforts despite the fact that he has absolutely no entertainment industry experience, credentials, or talent? And isn’t it telling that all of the existing alternatives are completely ignored?\nHere is my prediction: Arkhaven is going to see multiple acquisition offers in 2021, in addition to various offers to invest in it, after the new site launches in the spring. This is exactly what happened to Castalia very early on. Of course, we made it clear that we had less than zero interest in being acquired. And what we’re introducing with Arkhaven will dwarf everything that we’ve previously done to date.\nAs for\nRebel’s Run\n, the script is complete and approved, and casting is in progress. A second script for a comedy is already complete.\nUPDATE:\nthe Hellmouth 2.0 project could well be inadvertently comical. It’s not their first attempt, as the guy who made\nthis trainwreck\nis at the center of the efforts.\nAs a true lover of film I must advise you to avoid this appalling effort. God knows how funding was approved. Seriously this is one cinematic experience which delivers zero dramatic tension and plods along until nothing happens again and again and again. The only connectivity is two scares which at least keep you awake. Possibly the worst film I have ever witnessed and the acting by the female lead is bordering on criminal intent. One blessing with modern technology you can fast forward and watch it on 12x and it will only last 25 minutes. And you won’t miss any of the plot. No idea how people find this at all interesting and some are giving it high marks!\nOh, I’m pretty sure we know how the funding was obtained… and why some were giving it high marks.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-02T01:24:22+00:00"
}