{
  "url": "https://voxday.net/2021/01/10/il-papa-arrestato/",
  "scraped_at": "2025-12-21T22:33:03.359840",
  "title": "Il papa arrestato?",
  "date_display": "January 10, 2021",
  "date_iso": "2021-01-10T16:06:51+00:00",
  "date_from_url": "2021-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not merely huge, absolutely <a href=\"https://www.conservativebeaver.com/2021/01/10/vatican-blackout-pope-arrested-on-80-count-indictment-for-child-trafficking-fraud/\" rel=\"noopener\" target=\"_blank\">MASSIVE, if true</a>:</p><blockquote><p>VATICAN / ITALY – Pope Francis aka Jorge Mario Bergoglio was arrested Saturday in connection with an 80- count indictment of charges including possession of child pornography, human trafficking, incest, possession of drug paraphernalia and felony fraud. The Italian National Prosecutor’s Office confirmed it ordered the arrests, and filed the charges.</p></blockquote><p><b>HOWEVER</b>, there is literally <u>NOTHING</u> in the Italian media about this. Absolutely nothing at all. Nor have any of my contacts in Rome heard anything about this. And there is nothing about the Pope or the Vatican <a href=\"https://www.giustizia.it/giustizia/it/homepage.page\" rel=\"noopener\" target=\"_blank\">on the Ministero della Giustizia site</a> either. That being said, (1) there was definitely a blackout at the Vatican last night, (2) it is true that St. Peter’s Square was empty this morning, and, (3) it is confirmed that the Pope did not say prayers in public at noon as previously scheduled. There simply isn’t any other information out there.</p><p><b>VERDICT: </b>too soon to say. But if it turns out to be real, then we can be very highly confident that The Storm has begun and other significant arrests will follow.</p><p>Happy Rubicon Day!</p><p><b>UPDATE: </b>If all the Smart Boys would please shut up and stop trying to demonstrate their Very Smart Knowledge of international law and the theoretical independence of the Vatican,<i> that would be great</i>. Perhaps they might recall that Iraq was an independent state and Saddam Hussein was a sovereign Head of State too, and that didn’t prevent him from being arrested, tried, and executed without ever being extradited anywhere.</p><p><b>UPDATE: </b>I am dubious too. But if you want to wait until three days after something has happened before even discussing the possibility of it, then go back to Facebook, CNN, and Fox News. You don’t belong here.</p><p><b>UPDATE: </b>Lin Woods has now mentioned the story, but he appears to be citing the same source as everyone else. I remain dubious, but intrigued.</p></div>",
  "content_text": "Not merely huge, absolutely\nMASSIVE, if true\n:\nVATICAN / ITALY – Pope Francis aka Jorge Mario Bergoglio was arrested Saturday in connection with an 80- count indictment of charges including possession of child pornography, human trafficking, incest, possession of drug paraphernalia and felony fraud. The Italian National Prosecutor’s Office confirmed it ordered the arrests, and filed the charges.\nHOWEVER\n, there is literally\nNOTHING\nin the Italian media about this. Absolutely nothing at all. Nor have any of my contacts in Rome heard anything about this. And there is nothing about the Pope or the Vatican\non the Ministero della Giustizia site\neither. That being said, (1) there was definitely a blackout at the Vatican last night, (2) it is true that St. Peter’s Square was empty this morning, and, (3) it is confirmed that the Pope did not say prayers in public at noon as previously scheduled. There simply isn’t any other information out there.\nVERDICT:\ntoo soon to say. But if it turns out to be real, then we can be very highly confident that The Storm has begun and other significant arrests will follow.\nHappy Rubicon Day!\nUPDATE:\nIf all the Smart Boys would please shut up and stop trying to demonstrate their Very Smart Knowledge of international law and the theoretical independence of the Vatican,\nthat would be great\n. Perhaps they might recall that Iraq was an independent state and Saddam Hussein was a sovereign Head of State too, and that didn’t prevent him from being arrested, tried, and executed without ever being extradited anywhere.\nUPDATE:\nI am dubious too. But if you want to wait until three days after something has happened before even discussing the possibility of it, then go back to Facebook, CNN, and Fox News. You don’t belong here.\nUPDATE:\nLin Woods has now mentioned the story, but he appears to be citing the same source as everyone else. I remain dubious, but intrigued.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-10T16:06:51+00:00"
}