{
  "url": "https://voxday.net/2021/01/15/legal-legion-saves-arbitration/",
  "scraped_at": "2025-12-21T22:33:50.491559",
  "title": "Legal Legion saves arbitration",
  "date_display": "January 15, 2021",
  "date_iso": "2021-01-15T13:51:21+00:00",
  "date_from_url": "2021-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Patreon tried to destroy consumer arbitration in America. The Legal Legion stopped them.</b></p><p>This is a little complicated, and obviously I’m not a lawyer, but I’ll try to explain what I am reliably informed by multiple sources has been taking place over the last two months in the Bears vs Patreon arbitrations. Keep in mind that these arbitrations are entirely separate matters from the Patreon vs Bears lawsuit, which has been underway since May in the San Francisco Superior Court.</p><p>Like all corporations that mandate arbitration but forbid group action in their terms of use, Patreon blanched at the cost of actually paying for all the arbitrations that its contract with its users requires it to pay. This is normal, and every company that has been hit by mass arbitrations from employees or consumers, from Uber to Doordash, has desperately – and unsuccessfully – tried to get out of paying for the costs that its own lawyers required it to pay when they wrote the contract that was forced upon its users or employees. I’ve written in some detail about the irony of these entirely predictable reactions in <i>Corporate Cancer</i>.</p><p>Patreon behaved like all the other corporations before it in trying to evade these obligatory expenses, which is why it filed the lawsuit against the Bears in order to try to stop the arbitrations. That lawsuit is doomed to fail, just like all the other previous corporations’ lawsuits have, which is presumably why Patreon’s lawyers came up with a clever, and very nasty, little legal trick that is based on a little-known California law called 998. It’s complicated, I’d never even heard of it, and I’m still not sure I understand it completely despite reading through it several times, but basically it works like this:</p><ol style=\"text-align: left;\"><li>One party makes an offer to declare the second party the winner. This offer is monetary and may or may not include an offer to pay the second party’s legal fees.</li><li>If the second party accepts the offer, it’s over. </li><li>If the second party does not accept the offer, the first party has the right to have all of its legal fees and legal costs paid by the second party if the second party does not win an award that is greater than the amount offered by the first party.</li></ol><p>It’s a sort of legal ju-jitsu, in which one party’s victory in court or arbitration can be transformed into a massively expensive defeat by a properly calibrated 998 offer. Fortunately, the Legal Legion immediately recognized that the way these offers put the Bears in potential danger of being forced to pay Patreon’s legal costs was an obvious violation of the JAMS rules as well as the California consumer protection laws. So, they objected to the offers and pointed out how the offers were a violation of JAMS policy as well as the law. JAMS agreed and banned the offers, but Patreon objected to the ban, so JAMS said its version of the Supreme Court, which interprets the JAMS rules and sets its official policies, would permit all of the interested parties to make their points about the pros and cons of the ban.</p><p>Patreon made its arguments, the Legal Legion presented its arguments, and I’m told that yesterday, the JAMS Supreme Court affirmed the JAMS ban on 998 offers in consumer arbitration, which means that Patreon’s most recent attempt to escape its growing arbitration and legal costs is as dead as all of the previous attempts made by every other corporation that requires arbitration when actually faced with it.</p><p>But this victory is arguably more important than the others, because I’m told that Patreon’s 998 tactic, if successful, would have completely eliminated consumer arbitration in California, which is where most US technology corporations are headquartered. So this is not only good news for the Bears, it is good news for America. It is probably not, however, good news for DLive….</p></div>",
  "content_text": "Patreon tried to destroy consumer arbitration in America. The Legal Legion stopped them.\nThis is a little complicated, and obviously I’m not a lawyer, but I’ll try to explain what I am reliably informed by multiple sources has been taking place over the last two months in the Bears vs Patreon arbitrations. Keep in mind that these arbitrations are entirely separate matters from the Patreon vs Bears lawsuit, which has been underway since May in the San Francisco Superior Court.\nLike all corporations that mandate arbitration but forbid group action in their terms of use, Patreon blanched at the cost of actually paying for all the arbitrations that its contract with its users requires it to pay. This is normal, and every company that has been hit by mass arbitrations from employees or consumers, from Uber to Doordash, has desperately – and unsuccessfully – tried to get out of paying for the costs that its own lawyers required it to pay when they wrote the contract that was forced upon its users or employees. I’ve written in some detail about the irony of these entirely predictable reactions in\nCorporate Cancer\n.\nPatreon behaved like all the other corporations before it in trying to evade these obligatory expenses, which is why it filed the lawsuit against the Bears in order to try to stop the arbitrations. That lawsuit is doomed to fail, just like all the other previous corporations’ lawsuits have, which is presumably why Patreon’s lawyers came up with a clever, and very nasty, little legal trick that is based on a little-known California law called 998. It’s complicated, I’d never even heard of it, and I’m still not sure I understand it completely despite reading through it several times, but basically it works like this:\nOne party makes an offer to declare the second party the winner. This offer is monetary and may or may not include an offer to pay the second party’s legal fees.\nIf the second party accepts the offer, it’s over.\nIf the second party does not accept the offer, the first party has the right to have all of its legal fees and legal costs paid by the second party if the second party does not win an award that is greater than the amount offered by the first party.\nIt’s a sort of legal ju-jitsu, in which one party’s victory in court or arbitration can be transformed into a massively expensive defeat by a properly calibrated 998 offer. Fortunately, the Legal Legion immediately recognized that the way these offers put the Bears in potential danger of being forced to pay Patreon’s legal costs was an obvious violation of the JAMS rules as well as the California consumer protection laws. So, they objected to the offers and pointed out how the offers were a violation of JAMS policy as well as the law. JAMS agreed and banned the offers, but Patreon objected to the ban, so JAMS said its version of the Supreme Court, which interprets the JAMS rules and sets its official policies, would permit all of the interested parties to make their points about the pros and cons of the ban.\nPatreon made its arguments, the Legal Legion presented its arguments, and I’m told that yesterday, the JAMS Supreme Court affirmed the JAMS ban on 998 offers in consumer arbitration, which means that Patreon’s most recent attempt to escape its growing arbitration and legal costs is as dead as all of the previous attempts made by every other corporation that requires arbitration when actually faced with it.\nBut this victory is arguably more important than the others, because I’m told that Patreon’s 998 tactic, if successful, would have completely eliminated consumer arbitration in California, which is where most US technology corporations are headquartered. So this is not only good news for the Bears, it is good news for America. It is probably not, however, good news for DLive….",
  "tags": [
    "ELoE"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-15T13:51:21+00:00"
}