{
  "url": "https://voxday.net/2021/01/23/less-crazy-than-it-sounds/",
  "scraped_at": "2025-12-21T22:35:07.265816",
  "title": "Less crazy than it sounds",
  "date_display": "January 23, 2021",
  "date_iso": "2021-01-23T13:00:08+00:00",
  "date_from_url": "2021-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rest assured that I don’t expect anyone who isn’t already familiar with <a href=\"https://themarshallreport.wordpress.com/2021/01/20/trump-ode-to-the-corporation/\" rel=\"noopener\" target=\"_blank\">this sort of thing</a> to believe it in any way, shape or form. And at this point, you shouldn’t. I highly recommend not taking any of this seriously at the moment, but simply adding it to your general knowledge base in much the same way as you happen to be familiar with <i>The Lord of the Rings</i> or <i>Watership Down</i>. Think of it as a metaphor, or, if you prefer, a palindrome. But in light of all of the post-election anomalies, it might serve you well as a useful conceptual reference point for interpreting events in the future that you happen to find inexplicable.</p><blockquote><p>In 1871 a sedious act was performed by the Government.  A coup was made to rewrite the constitution and put WE THE PEOPLE in all capitals, under a new corporate contract transferring the United States of America into the new Corporation of the United States of America which transferred  the power of We The People and the constitution over to the new corporation. When they did that, it placed the citizens in the United States as property of the Corporation which was centered in Washington D.C..  This action made Washington D.C.  a FOREIGN ENTITY on American soil of sovereign states. It was established through a loan from the Vatican when D.C. was transferred into a city-state, and this corporate entity then ruled over the people. Citizens rights were taken from them in this process. No one realized this.</p><p>When they did the broker deal to get the loan from the Vatican, they did so via the Bank of London. At that time, they transferred all the property in D.C. Columbia over to the Corporate entity of D.C. a foreign corporation.</p><p>The forming of this corporation in D.C. is of major importance to understand, for when President Trump signed an executive order in 2018 on Election Interference/Fraud for entities both foreign and domestic, it outlined how assetts would be seized.  The President and the people knew and had the proof that a coup transpired out of the Corporation of the United States of America along with other foreign nations and was ignored by the Corporation in D.C.. They continued with their illegal steal, and the military is now in the process of seizing the assets of this foreign  country  known as THE CORPORATION OF THE UNITED STATES OF AMERICA.  It appears that President Trump’s executive order was actually directed at the Washington D.C. corporate swamp/cabal all along.  D.C. is now walled in and filled with military guard.</p></blockquote><p>Never forget that things are seldom as they appear at any given moment. This is true of absolutely everything, from a simple running play in an NFL game to international conflicts. </p></div>",
  "content_text": "Rest assured that I don’t expect anyone who isn’t already familiar with\nthis sort of thing\nto believe it in any way, shape or form. And at this point, you shouldn’t. I highly recommend not taking any of this seriously at the moment, but simply adding it to your general knowledge base in much the same way as you happen to be familiar with\nThe Lord of the Rings\nor\nWatership Down\n. Think of it as a metaphor, or, if you prefer, a palindrome. But in light of all of the post-election anomalies, it might serve you well as a useful conceptual reference point for interpreting events in the future that you happen to find inexplicable.\nIn 1871 a sedious act was performed by the Government.  A coup was made to rewrite the constitution and put WE THE PEOPLE in all capitals, under a new corporate contract transferring the United States of America into the new Corporation of the United States of America which transferred  the power of We The People and the constitution over to the new corporation. When they did that, it placed the citizens in the United States as property of the Corporation which was centered in Washington D.C..  This action made Washington D.C.  a FOREIGN ENTITY on American soil of sovereign states. It was established through a loan from the Vatican when D.C. was transferred into a city-state, and this corporate entity then ruled over the people. Citizens rights were taken from them in this process. No one realized this.\nWhen they did the broker deal to get the loan from the Vatican, they did so via the Bank of London. At that time, they transferred all the property in D.C. Columbia over to the Corporate entity of D.C. a foreign corporation.\nThe forming of this corporation in D.C. is of major importance to understand, for when President Trump signed an executive order in 2018 on Election Interference/Fraud for entities both foreign and domestic, it outlined how assetts would be seized.  The President and the people knew and had the proof that a coup transpired out of the Corporation of the United States of America along with other foreign nations and was ignored by the Corporation in D.C.. They continued with their illegal steal, and the military is now in the process of seizing the assets of this foreign  country  known as THE CORPORATION OF THE UNITED STATES OF AMERICA.  It appears that President Trump’s executive order was actually directed at the Washington D.C. corporate swamp/cabal all along.  D.C. is now walled in and filled with military guard.\nNever forget that things are seldom as they appear at any given moment. This is true of absolutely everything, from a simple running play in an NFL game to international conflicts.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-23T13:00:08+00:00"
}