{
  "url": "https://voxday.net/2021/01/10/of-all-the-words-of-screen-and-pen/",
  "scraped_at": "2025-12-21T22:33:01.516990",
  "title": "Of all the words of screen and pen",
  "date_display": "January 10, 2021",
  "date_iso": "2021-01-10T16:02:50+00:00",
  "date_from_url": "2021-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The saddest are these: Vox was right again.</i> The Other McCain muses on <a href=\"https://theothermccain.com/2021/01/10/night-of-the-digital-long-knives/\" rel=\"noopener\" target=\"_blank\">The Night of the Digital Long Knives</a>:</p><blockquote><p>I don’t think anyone except the Silicon Valley oligarchs, who no doubt had this planned well in advance, and Vox Day, who had expected this for some time – expected the whole sale purging of conservative &amp; populist accounts from social media that’s taken place this week….</p><p>People used to accuse Vox Day of being paranoid when he said these things a few years ago. What’s keeping me awake nights is that Vox might not have been paranoid enough.</p></blockquote><p>More is coming. Don’t be complacent. Don’t wait around on ground you have no intention of defending. Don’t give up any ground you intend to keep without being the hard out. And above all, <i>support the alternative platforms.</i> Because if you don’t, there won’t be anything left for you. Don’t kid yourself, the SJW corpocracy knows everything about who you are, they know that you are not on their side, and they have absolutely no intention of sparing you or permitting you to submit in the future.</p><p>You can join SocialGalactic in two ways, either by <a href=\"http://subscribe.unauthorized.tv/join\" rel=\"noopener\" target=\"_blank\">subscribing to Unauthorized</a> or by <a href=\"https://arkhavencomics.com/product/sg-bronze/\" rel=\"noopener\" target=\"_blank\">subscribing to it directly</a>.</p><p><b>MAILVOX: </b>A new subscriber explains why he subscribed this weekend.</p><blockquote><p>I held out from subscribing to Unauthorized.tv for a long time but when you added Razorfist to the lineup, it was impossible to continue making any more excuses for a measly $5 a month. Thank you! To Owen, Razorfist, Rachel, Wranglerstar, the Dread Ilk and the rest of the gang, thank you for the lasting work you are doing. History will remember your efforts to shine a light against the darkness.</p></blockquote></div>",
  "content_text": "The saddest are these: Vox was right again.\nThe Other McCain muses on\nThe Night of the Digital Long Knives\n:\nI don’t think anyone except the Silicon Valley oligarchs, who no doubt had this planned well in advance, and Vox Day, who had expected this for some time – expected the whole sale purging of conservative & populist accounts from social media that’s taken place this week….\nPeople used to accuse Vox Day of being paranoid when he said these things a few years ago. What’s keeping me awake nights is that Vox might not have been paranoid enough.\nMore is coming. Don’t be complacent. Don’t wait around on ground you have no intention of defending. Don’t give up any ground you intend to keep without being the hard out. And above all,\nsupport the alternative platforms.\nBecause if you don’t, there won’t be anything left for you. Don’t kid yourself, the SJW corpocracy knows everything about who you are, they know that you are not on their side, and they have absolutely no intention of sparing you or permitting you to submit in the future.\nYou can join SocialGalactic in two ways, either by\nsubscribing to Unauthorized\nor by\nsubscribing to it directly\n.\nMAILVOX:\nA new subscriber explains why he subscribed this weekend.\nI held out from subscribing to Unauthorized.tv for a long time but when you added Razorfist to the lineup, it was impossible to continue making any more excuses for a measly $5 a month. Thank you! To Owen, Razorfist, Rachel, Wranglerstar, the Dread Ilk and the rest of the gang, thank you for the lasting work you are doing. History will remember your efforts to shine a light against the darkness.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-10T16:02:50+00:00"
}