{
  "url": "https://voxday.net/2021/01/20/sendoff-ceremony-andrews-afb/",
  "scraped_at": "2025-12-21T22:34:41.903325",
  "title": "Sendoff ceremony Andrews AFB",
  "date_display": "January 20, 2021",
  "date_iso": "2021-01-20T15:30:49+00:00",
  "date_from_url": "2021-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" loading=\"lazy\" src=\"https://www.youtube.com/embed/jebuWS871IQ\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><p>One curious anomaly: 17 US flags behind the podium.</p><p><b>UPDATE: </b>FFS, who gives a flying fuck about vaccines at this point? If this is a headfake, it’s a damnably convincing one. About the only good thing one can say is that Melania looks great.</p><p><b>UPDATE: </b>Okay, “we will be back in some form” and “we will see you soon” is mildly encouraging. Still no mention of the election, Biden, or a concession. It looks over, to be sure, but it isn’t actually over. Not yet, anyhow.</p><p><b>UPDATE: </b>Shills, please note that Biden is still not the President of the United States. If, against my expectations, he does somehow become President of the United States in the next 24 hours, we will all be sure to note that you were the first to surrender and that you did so before the battle was over.</p><p><b>UPDATE:</b> I took down the Madrid explosion post as it does not appear to have any connection to any international events. CNN has reported a bomb threat at the U.S. Supreme Court, but the all-clear was just given.</p></div>",
  "content_text": "One curious anomaly: 17 US flags behind the podium.\nUPDATE:\nFFS, who gives a flying fuck about vaccines at this point? If this is a headfake, it’s a damnably convincing one. About the only good thing one can say is that Melania looks great.\nUPDATE:\nOkay, “we will be back in some form” and “we will see you soon” is mildly encouraging. Still no mention of the election, Biden, or a concession. It looks over, to be sure, but it isn’t actually over. Not yet, anyhow.\nUPDATE:\nShills, please note that Biden is still not the President of the United States. If, against my expectations, he does somehow become President of the United States in the next 24 hours, we will all be sure to note that you were the first to surrender and that you did so before the battle was over.\nUPDATE:\nI took down the Madrid explosion post as it does not appear to have any connection to any international events. CNN has reported a bomb threat at the U.S. Supreme Court, but the all-clear was just given.",
  "tags": [
    "news"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-20T15:30:49+00:00"
}