{
  "url": "https://voxday.net/2021/01/15/sports-journalists-are-sjw-masochists/",
  "scraped_at": "2025-12-21T22:33:55.633124",
  "title": "Sports journalists are SJW masochists",
  "date_display": "January 15, 2021",
  "date_iso": "2021-01-15T21:00:00+00:00",
  "date_from_url": "2021-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Who really <a href=\"https://www.si.com/college/2021/01/15/john-calipari-kentucky-kneeling-anthem-blowback\" rel=\"noopener\" target=\"_blank\">want to lose their jobs</a>. That’s the only thing you can conclude after reading this article at Sports Illustrated which celebrates the fact that Kentucky basketball coach John Calipari is consciously infuriating Kentucky basketball boosters by taking the BLM knee before Kentucky games.</p><blockquote><p>When he took the knee, John Calipari had to know what was coming.</p><p>He’s lived in Kentucky, one of America’s reddest states, since 2009. In the November presidential election, Donald Trump captured 62 percent of the vote in the state and won 118 out of 120 counties—the only exceptions were the two biggest, Jefferson and Fayette, home to the University of Louisville and University of Kentucky, respectively. Jefferson might be the only county in the state that isn’t a majority UK fan base, and even here the Big Blue following is sizable.</p><p>In other words, it stands to reason that the fans who passionately follow Calipari’s team are overwhelmingly conservative Republicans. And conservative Republicans are overwhelmingly not in favor of athletes kneeling in protest during the national anthem—especially college athletes. And yet there was Cal joining his Kentucky players on one knee before the Wildcats played at Florida Saturday, three days after the deadly insurrection in Washington, D.C.</p><p>It was absolutely the time to make the statement. Risks and all. Maybe this was the eternally combative Cal picking a new fight—with his own constituency.</p><p>In that moment, a coach whose approval rating already had plunged after a 1-6 season start—worst for Kentucky in more than a century—took even more on his shoulders. In the authoritarian world of college sports, some coaches would have vetoed the idea altogether. Others would have tried to talk their players out of making a statement at a charged moment in time. Still others would have approved it but not participated.</p><p>Cal joined them, putting him on a very short list of college coaches who have taken a knee during the national anthem before a game. </p></blockquote><p>Same SI journo six months later: <i>“why come Coach Calipari lose job? why come ME lose job?” </i>Because you know what is a great idea in a collapsing economy? Drive away everyone who provides the revenue. </p></div>",
  "content_text": "Who really\nwant to lose their jobs\n. That’s the only thing you can conclude after reading this article at Sports Illustrated which celebrates the fact that Kentucky basketball coach John Calipari is consciously infuriating Kentucky basketball boosters by taking the BLM knee before Kentucky games.\nWhen he took the knee, John Calipari had to know what was coming.\nHe’s lived in Kentucky, one of America’s reddest states, since 2009. In the November presidential election, Donald Trump captured 62 percent of the vote in the state and won 118 out of 120 counties—the only exceptions were the two biggest, Jefferson and Fayette, home to the University of Louisville and University of Kentucky, respectively. Jefferson might be the only county in the state that isn’t a majority UK fan base, and even here the Big Blue following is sizable.\nIn other words, it stands to reason that the fans who passionately follow Calipari’s team are overwhelmingly conservative Republicans. And conservative Republicans are overwhelmingly not in favor of athletes kneeling in protest during the national anthem—especially college athletes. And yet there was Cal joining his Kentucky players on one knee before the Wildcats played at Florida Saturday, three days after the deadly insurrection in Washington, D.C.\nIt was absolutely the time to make the statement. Risks and all. Maybe this was the eternally combative Cal picking a new fight—with his own constituency.\nIn that moment, a coach whose approval rating already had plunged after a 1-6 season start—worst for Kentucky in more than a century—took even more on his shoulders. In the authoritarian world of college sports, some coaches would have vetoed the idea altogether. Others would have tried to talk their players out of making a statement at a charged moment in time. Still others would have approved it but not participated.\nCal joined them, putting him on a very short list of college coaches who have taken a knee during the national anthem before a game.\nSame SI journo six months later:\n“why come Coach Calipari lose job? why come ME lose job?”\nBecause you know what is a great idea in a collapsing economy? Drive away everyone who provides the revenue.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2021-01-15T21:00:00+00:00"
}