{
  "url": "https://voxday.net/2021/01/28/the-tiger-approaches/",
  "scraped_at": "2025-12-21T22:35:51.962913",
  "title": "The tiger approaches",
  "date_display": "January 28, 2021",
  "date_iso": "2021-01-28T19:02:01+00:00",
  "date_from_url": "2021-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The elections are fake. The stock markets are fake. The money is fake. The courts are fake. The police are frauds. The military is gay, trans, and fabulous. It appears that Tiger Time <a href=\"https://charleshughsmith.blogspot.com/2021/01/the-coming-revolt-of-middle-class.html\" rel=\"noopener\" target=\"_blank\">is rapidly approaching</a> the once-great United States empire.</p><blockquote><p>The Great American Middle Class has stood meekly by while the New Nobility stripmined $50 trillion from the middle and working classes. As this RAND report documents, $50 trillion has been siphoned from labor and the lower 90{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} of the workforce to the New Nobility and their technocrat lackeys who own the vast majority of the capital: Trends in Income From 1975 to 2018.</p><p>Why has the Great American Middle Class meekly accepted their new role as debt-serfs and powerless peasants in a Neofeudal Economy ruled by the New Nobility of Big Tech / monopolies / cartels / financiers? The basic answer is the New Nobility’s PR has been so persuasive and ubiquitous: soaring inequality and Neofeudalism has nothing to do with us, it’s just the natural result of technology and globalization–forces nobody can resist. Sorry about your debt-serfdom, but hey, your student loan payment is overdue, so it’s the rack for you.</p><p>The recent <i>Foreign Affairs</i> article referenced here last week <i>Monopoly Versus Democracy</i> describes the net result of the economic propaganda that the stripmining of the working and middle classes was ordained and irresistible: Today, Americans tend to see grotesque accumulations of wealth and power as normal. That’s how far we’ve fallen:</p><p>“As the journalist Barry Lynn points out in his book <i>Liberty from All Masters: The New American Autocracy vs. the Will of the People</i>, the robber barons shared with today’s high-tech monopolists a strategy of encouraging people to see immense inequality as a tragic but unavoidable consequence of capitalism and technological change. But as Lynn shows, one of the main differences between then and now is that, compared to today, fewer Americans accepted such rationalizations during the Gilded Age. Today, Americans tend to see grotesque accumulations of wealth and power as normal. Back then, a critical mass of Americans refused to do so, and they waged a decades-long fight for a fair and democratic society.”</p><p>The bottom 90{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} of the U.S. economy has been decapitalized: debt has been substituted for capital. Capital only flows into the increasingly centralized top tier, which owns and profits from the rising tide of debt that’s been keeping the bottom 90{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} afloat for the past 20 years.</p></blockquote><p>Not only that, but the robber barons were, for the most part, Americans themselves. They felt some sense of obligation to their fellow Americans, and knew that an amount of restraint and <i>noblesse oblige</i> was required. The lawless and mostly foreign elite that presently rules the USA feels no sense of obligation to the American people and therefore knows no restraints. The situation somehow calls to mind a little Chinese poem written by Zhang Xianzhong, who lived in similarly evil times. Consider the history of the man known as the Yellow Tiger.</p><blockquote><p>Towards the end the Ming dynasty, drought, famines and epidemics broke out in various part of China. In the late 1620s, peasants revolted in Shaanxi, resisting attempts by the Ming government to collect grains and taxes. They coalesced into rebel armies called “roving bandits” (liúkòu 流寇) because of their highly mobile nature, and spread into other parts of China. Chang escaped from the army, joined the rebel forces in Mizhi County in 1630, and established himself as a rebel leader, styling himself Bada Wang (八大王, Eighth Great King). His mobile forces would conduct raids along the western edge of Shaanxi, plundering swiftly and hiding out in the hills. Later he moved into other provinces, moving from place to place raiding towns and cities. He was defeated at various times by the Ming forces; Chang would also surrender when it was expedient for him to do so, for example in 1631 and 1638, but would then later regroup and resume rebellion.</p><p>In 1635 he joined a larger confederation of bandits that included another rebel leader, Li Zicheng (Li would later capture Beijing and end the Ming rule there). They devastated Henan and pushed into Anhui. After they had burnt the Ming ancestral temple at Zhongdu (Fengyang) in Anhui and ravaged the area, the rebel armies broke up and Chang headed to Hubei. In 1637, joined by other rebels and with an army now reaching a size of 300,000 men, he again pushed into Anhui, then to Jiangsu, and almost down to Nanjing. But he was defeated there and he retreated back to Hubei. In 1638, he surrendered to Ming supreme commander Xiong Wencan (熊文燦) and was allowed to serve as a regional Ming commander. However, he reneged on the agreement in 1639 and rebelled, and later defeated the Ming forces led by the Ming general Zuo Liangyu (左良玉). In 1640, he suffered defeats at the hand of Zuo and had to flee with few followers into the mountains of Eastern Sichuan. In 1641 he emerged from Sichuan and attacked Xiangyang, capturing and executing the imperial prince there.</p><p>In 1643, he took Macheng in Hubei, and his army swelled to some 57,000 after incorporating the city’s rebels.[12] He then captured the provincial capital of Wuchang, killed the imperial prince there, and proclaimed himself “Xi Wang” (King of the West).</p></blockquote><p>Zhang was apparently a man of literary gifts as well as martial ones. He left words engraved on a stele that are among the most haunting ever written.</p><p style=\"text-align: center;\"><i>Heaven brings forth innumerable things to nurture Man.</i></p><p style=\"text-align: center;\"><i>Man has nothing good with which to recompense Heaven.</i></p><p style=\"text-align: center;\"><i>Kill. Kill. Kill. Kill. Kill. Kill. Kill.</i></p></div>",
  "content_text": "The elections are fake. The stock markets are fake. The money is fake. The courts are fake. The police are frauds. The military is gay, trans, and fabulous. It appears that Tiger Time\nis rapidly approaching\nthe once-great United States empire.\nThe Great American Middle Class has stood meekly by while the New Nobility stripmined $50 trillion from the middle and working classes. As this RAND report documents, $50 trillion has been siphoned from labor and the lower 90{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} of the workforce to the New Nobility and their technocrat lackeys who own the vast majority of the capital: Trends in Income From 1975 to 2018.\nWhy has the Great American Middle Class meekly accepted their new role as debt-serfs and powerless peasants in a Neofeudal Economy ruled by the New Nobility of Big Tech / monopolies / cartels / financiers? The basic answer is the New Nobility’s PR has been so persuasive and ubiquitous: soaring inequality and Neofeudalism has nothing to do with us, it’s just the natural result of technology and globalization–forces nobody can resist. Sorry about your debt-serfdom, but hey, your student loan payment is overdue, so it’s the rack for you.\nThe recent\nForeign Affairs\narticle referenced here last week\nMonopoly Versus Democracy\ndescribes the net result of the economic propaganda that the stripmining of the working and middle classes was ordained and irresistible: Today, Americans tend to see grotesque accumulations of wealth and power as normal. That’s how far we’ve fallen:\n“As the journalist Barry Lynn points out in his book\nLiberty from All Masters: The New American Autocracy vs. the Will of the People\n, the robber barons shared with today’s high-tech monopolists a strategy of encouraging people to see immense inequality as a tragic but unavoidable consequence of capitalism and technological change. But as Lynn shows, one of the main differences between then and now is that, compared to today, fewer Americans accepted such rationalizations during the Gilded Age. Today, Americans tend to see grotesque accumulations of wealth and power as normal. Back then, a critical mass of Americans refused to do so, and they waged a decades-long fight for a fair and democratic society.”\nThe bottom 90{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} of the U.S. economy has been decapitalized: debt has been substituted for capital. Capital only flows into the increasingly centralized top tier, which owns and profits from the rising tide of debt that’s been keeping the bottom 90{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} afloat for the past 20 years.\nNot only that, but the robber barons were, for the most part, Americans themselves. They felt some sense of obligation to their fellow Americans, and knew that an amount of restraint and\nnoblesse oblige\nwas required. The lawless and mostly foreign elite that presently rules the USA feels no sense of obligation to the American people and therefore knows no restraints. The situation somehow calls to mind a little Chinese poem written by Zhang Xianzhong, who lived in similarly evil times. Consider the history of the man known as the Yellow Tiger.\nTowards the end the Ming dynasty, drought, famines and epidemics broke out in various part of China. In the late 1620s, peasants revolted in Shaanxi, resisting attempts by the Ming government to collect grains and taxes. They coalesced into rebel armies called “roving bandits” (liúkòu 流寇) because of their highly mobile nature, and spread into other parts of China. Chang escaped from the army, joined the rebel forces in Mizhi County in 1630, and established himself as a rebel leader, styling himself Bada Wang (八大王, Eighth Great King). His mobile forces would conduct raids along the western edge of Shaanxi, plundering swiftly and hiding out in the hills. Later he moved into other provinces, moving from place to place raiding towns and cities. He was defeated at various times by the Ming forces; Chang would also surrender when it was expedient for him to do so, for example in 1631 and 1638, but would then later regroup and resume rebellion.\nIn 1635 he joined a larger confederation of bandits that included another rebel leader, Li Zicheng (Li would later capture Beijing and end the Ming rule there). They devastated Henan and pushed into Anhui. After they had burnt the Ming ancestral temple at Zhongdu (Fengyang) in Anhui and ravaged the area, the rebel armies broke up and Chang headed to Hubei. In 1637, joined by other rebels and with an army now reaching a size of 300,000 men, he again pushed into Anhui, then to Jiangsu, and almost down to Nanjing. But he was defeated there and he retreated back to Hubei. In 1638, he surrendered to Ming supreme commander Xiong Wencan (熊文燦) and was allowed to serve as a regional Ming commander. However, he reneged on the agreement in 1639 and rebelled, and later defeated the Ming forces led by the Ming general Zuo Liangyu (左良玉). In 1640, he suffered defeats at the hand of Zuo and had to flee with few followers into the mountains of Eastern Sichuan. In 1641 he emerged from Sichuan and attacked Xiangyang, capturing and executing the imperial prince there.\nIn 1643, he took Macheng in Hubei, and his army swelled to some 57,000 after incorporating the city’s rebels.[12] He then captured the provincial capital of Wuchang, killed the imperial prince there, and proclaimed himself “Xi Wang” (King of the West).\nZhang was apparently a man of literary gifts as well as martial ones. He left words engraved on a stele that are among the most haunting ever written.\nHeaven brings forth innumerable things to nurture Man.\nMan has nothing good with which to recompense Heaven.\nKill. Kill. Kill. Kill. Kill. Kill. Kill.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-28T19:02:01+00:00"
}