{
  "url": "https://voxday.net/2021/01/15/the-mysterious-collapse-of-governments/",
  "scraped_at": "2025-12-21T22:33:51.954932",
  "title": "The mysterious collapse of governments",
  "date_display": "January 15, 2021",
  "date_iso": "2021-01-15T16:57:04+00:00",
  "date_from_url": "2021-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><ul style=\"text-align: left;\"><li><i>Germany’s Angela Merkel has said she will step down as chancellor in 2021, following recent election setbacks. “I will not be seeking any political post after my term ends,” she told a news conference in Berlin. She also said she would not seek re-election as leader of the centre-right CDU party in December. She has held the post since 2000.</i></li><li><i>Dutch Rutte government resigns over child welfare fraud scandal.</i></li><li><i>Italy’s former premier Matteo Renzi said on Wednesday he was pulling his party’s ministers from the cabinet, effectively leaving the ruling coalition without a majority in parliament. His decision, announced at a news conference, throws Italy into political chaos….</i></li><li><i>Estonia’s president on Thursday tasked the leader of the main opposition party to form a new government, a day after Prime Minister Juri Ratas and his Cabinet stepped down in the wake of a corruption scandal in Ratas’ ruling Center Party.</i></li><li><i>Kuwait government to resign within 24 hours.</i></li></ul><p>What an astonishing series of coincidences! Five governments collapsing in the same week? It can’t possibly be an international prelude to the events of January 20, 2021, could it?</p><p><b>UPDATE: </b>A Dutch reader emails to add that 42 of the 150 people in the Dutch parliament have announced that they will not run again in the next election.</p><p>On a possibly related note, <a href=\"https://youtu.be/LmUYO5VhgUc?list=RDLmUYO5VhgUc&amp;t=98\" rel=\"noopener\" target=\"_blank\">here is another example</a> of the intentional building of tension I demonstrated in last night’s Darkstream. It was even more excruciating than is shown here, because the clip cuts short the breakdown, which in the Tokyo Dome concert extended for nearly a full three minutes before leading up to the crowd callback at 3.22. Notice in particular the way in which Su-metal, the lead singer, presides impassively over the breakdown doing nothing until the time comes to direct the crowd.</p><p>Enjoy the show.</p></div>",
  "content_text": "Germany’s Angela Merkel has said she will step down as chancellor in 2021, following recent election setbacks. “I will not be seeking any political post after my term ends,” she told a news conference in Berlin. She also said she would not seek re-election as leader of the centre-right CDU party in December. She has held the post since 2000.\nDutch Rutte government resigns over child welfare fraud scandal.\nItaly’s former premier Matteo Renzi said on Wednesday he was pulling his party’s ministers from the cabinet, effectively leaving the ruling coalition without a majority in parliament. His decision, announced at a news conference, throws Italy into political chaos….\nEstonia’s president on Thursday tasked the leader of the main opposition party to form a new government, a day after Prime Minister Juri Ratas and his Cabinet stepped down in the wake of a corruption scandal in Ratas’ ruling Center Party.\nKuwait government to resign within 24 hours.\nWhat an astonishing series of coincidences! Five governments collapsing in the same week? It can’t possibly be an international prelude to the events of January 20, 2021, could it?\nUPDATE:\nA Dutch reader emails to add that 42 of the 150 people in the Dutch parliament have announced that they will not run again in the next election.\nOn a possibly related note,\nhere is another example\nof the intentional building of tension I demonstrated in last night’s Darkstream. It was even more excruciating than is shown here, because the clip cuts short the breakdown, which in the Tokyo Dome concert extended for nearly a full three minutes before leading up to the crowd callback at 3.22. Notice in particular the way in which Su-metal, the lead singer, presides impassively over the breakdown doing nothing until the time comes to direct the crowd.\nEnjoy the show.",
  "tags": [
    "news"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-15T16:57:04+00:00"
}