{
  "url": "https://voxday.net/2021/01/19/the-narrative-is-just-weird/",
  "scraped_at": "2025-12-21T22:34:26.673085",
  "title": "The Narrative is just weird",
  "date_display": "January 19, 2021",
  "date_iso": "2021-01-19T13:00:02+00:00",
  "date_from_url": "2021-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Donald Trump <a href=\"https://www.dailymail.co.uk/news/article-9162205/Trump-furious-Bidens-star-studded-inauguration-lineup-plans-early-morning-sendoff.html\" rel=\"noopener\" target=\"_blank\">is LIVID</a>! So JEALOUS and ENVIOUS of all the Hollywood star power wielded by Joe Biden!</p><blockquote><p>Donald Trump is furious that Joe Biden has managed to attract a star-studded lineup to his inauguration, it has been claimed – in sharp contrast to the president’s own ceremony four years ago. Trump, who will leave the White House before noon on Wednesday, was reported by <i>The Washington Post</i> to be angry that a roll call of stars are signing up to Biden’s event.</p><p>While Trump famously struggled to attract big names, Biden has confirmed Jennifer Lopez, Lady Gaga, Tom Hanks and country star Garth Brooks for his event.</p></blockquote><p>What the Actual? It appears the mainstream media has gone so deeply into hiding that its daily Narrative is now being written by 13-year-old female interns. </p></div>",
  "content_text": "Donald Trump\nis LIVID\n! So JEALOUS and ENVIOUS of all the Hollywood star power wielded by Joe Biden!\nDonald Trump is furious that Joe Biden has managed to attract a star-studded lineup to his inauguration, it has been claimed – in sharp contrast to the president’s own ceremony four years ago. Trump, who will leave the White House before noon on Wednesday, was reported by\nThe Washington Post\nto be angry that a roll call of stars are signing up to Biden’s event.\nWhile Trump famously struggled to attract big names, Biden has confirmed Jennifer Lopez, Lady Gaga, Tom Hanks and country star Garth Brooks for his event.\nWhat the Actual? It appears the mainstream media has gone so deeply into hiding that its daily Narrative is now being written by 13-year-old female interns.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-19T13:00:02+00:00"
}