{
  "url": "https://voxday.net/2021/01/23/the-ride-she-never-ends/",
  "scraped_at": "2025-12-21T22:35:09.105801",
  "title": "The Ride, She Never Ends",
  "date_display": "January 23, 2021",
  "date_iso": "2021-01-23T18:06:51+00:00",
  "date_from_url": "2021-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>D-Live has doubled-down and banned Big Bear. How fortunate that the Patreon lawsuit has already been successfully concluded…. In answer to the obvious question, yes, UATV will have streaming in the future. We will not answer any questions as to when. When it is ready, we will let everyone know.</p><p>If you’re not yet on Unauthorized, well, you know what to do. The cult of free is over. Keep in mind that under the present regime, Big Tech is going to be banning everyone to the right of Hillary Clinton. In related news, Parler is learning why cloud technology <a href=\"https://thenewstack.io/why-parler-cant-rebuild-a-scalable-cloud-service-from-scratch/\" rel=\"noopener\" target=\"_blank\">is not an option</a>.</p><blockquote><p>When Amazon Web Services informed Parler that it was terminating its hosting deal, the social platform initially maintained that it would be back online in a week. It appears to have secured DNS hosting from Epik (the Sammamish, WA-company that hosts sites like 8chan, the Daily Stormer, Gab and Stormfront who have been dropped from other providers and recently lost its relationship with PayPal because of that).</p><p>But a later statement indicated that other providers are not willing to host the platform and as a result, the service may not return: “most people with enough servers to host us have shut their doors to us,” a statement to the Parler user base read and the company’s legal team suggested in court might not return without access to AWS.</p><p>Even if the social network finds a hosting provider, setting up all the different services it needs could be prohibitively slow, or even impossible. For all the talk of hybrid and edge computing, hyperscale cloud still has some hard to beat advantages for organizations with small infrastructure teams and not much capital expenditure budget who need to build large services quickly.</p></blockquote><p>Needless to say, we’re not relying on the cloud for anything, not even brand new projects that are not even remotely political. In not-entirely-unrelated-news, MeWe is<a href=\"https://writeoftech.com/2021/01/11/mewe-ceo-is-a-serial-democratic-party-donor/\" rel=\"noopener\" target=\"_blank\"> not a viable Facebook-alternative</a>.</p></div>",
  "content_text": "D-Live has doubled-down and banned Big Bear. How fortunate that the Patreon lawsuit has already been successfully concluded…. In answer to the obvious question, yes, UATV will have streaming in the future. We will not answer any questions as to when. When it is ready, we will let everyone know.\nIf you’re not yet on Unauthorized, well, you know what to do. The cult of free is over. Keep in mind that under the present regime, Big Tech is going to be banning everyone to the right of Hillary Clinton. In related news, Parler is learning why cloud technology\nis not an option\n.\nWhen Amazon Web Services informed Parler that it was terminating its hosting deal, the social platform initially maintained that it would be back online in a week. It appears to have secured DNS hosting from Epik (the Sammamish, WA-company that hosts sites like 8chan, the Daily Stormer, Gab and Stormfront who have been dropped from other providers and recently lost its relationship with PayPal because of that).\nBut a later statement indicated that other providers are not willing to host the platform and as a result, the service may not return: “most people with enough servers to host us have shut their doors to us,” a statement to the Parler user base read and the company’s legal team suggested in court might not return without access to AWS.\nEven if the social network finds a hosting provider, setting up all the different services it needs could be prohibitively slow, or even impossible. For all the talk of hybrid and edge computing, hyperscale cloud still has some hard to beat advantages for organizations with small infrastructure teams and not much capital expenditure budget who need to build large services quickly.\nNeedless to say, we’re not relying on the cloud for anything, not even brand new projects that are not even remotely political. In not-entirely-unrelated-news, MeWe is\nnot a viable Facebook-alternative\n.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-23T18:06:51+00:00"
}