{
  "url": "https://voxday.net/2021/01/12/the-olde-speech/",
  "scraped_at": "2025-12-21T22:33:25.019714",
  "title": "The Olde Speech",
  "date_display": "January 12, 2021",
  "date_iso": "2021-01-12T22:20:37+00:00",
  "date_from_url": "2021-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> <i>The Forge of Tolkien</i> episode 19, THE OLDE SPEECH, is now available on #UATV.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://social.infogalactic.com/images/posts/d0b53136-632a-4fd8-a132-bdeef74ad157/original-842fa5ca21fb29eb7de9939af69cb9ef.jpg?v=63777709140\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"270\" data-original-width=\"480\" decoding=\"async\" src=\"https://social.infogalactic.com/images/posts/d0b53136-632a-4fd8-a132-bdeef74ad157/original-842fa5ca21fb29eb7de9939af69cb9ef.jpg?v=63777709140\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"270\" data-original-width=\"480\" data-src=\"https://social.infogalactic.com/images/posts/d0b53136-632a-4fd8-a132-bdeef74ad157/original-842fa5ca21fb29eb7de9939af69cb9ef.jpg?v=63777709140\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20480%20270%22%3E%3C/svg%3E\"/></a></div><p>In December 1954, Hugh Brogan wrote to Tolkien to complain about the “archaizing” style of parts of <i>The Lord of the Rings</i>, particularly the chapter “The King of the Golden Hall.” Tolkien drafted his response but never sent it, deferring a proper discussion to a time when they could meet in person. When is archaizing “tushery,” and when is it necessary? What is the difference between a bogus and a genuinely “antique” turn of phrase? </p><p>In this episode Professor Rachel Fulton Brown reads the “linking” passage in <i>The Book of Lost Tales </i>taking Eriol from the hall of the Tale-fire to Rumil’s garden to illustrate Tolkien’s process in discovering his proper style. What did Tolkien mean when he told Brogan he found it easier to think in an archaic mode, and why did he chide Brogan for his “parochialism of time”? Hint: The distance is as great as that between Globe Earth and Flat Earth! </p></div>",
  "content_text": "The Forge of Tolkien\nepisode 19, THE OLDE SPEECH, is now available on #UATV.\nIn December 1954, Hugh Brogan wrote to Tolkien to complain about the “archaizing” style of parts of\nThe Lord of the Rings\n, particularly the chapter “The King of the Golden Hall.” Tolkien drafted his response but never sent it, deferring a proper discussion to a time when they could meet in person. When is archaizing “tushery,” and when is it necessary? What is the difference between a bogus and a genuinely “antique” turn of phrase?\nIn this episode Professor Rachel Fulton Brown reads the “linking” passage in\nThe Book of Lost Tales\ntaking Eriol from the hall of the Tale-fire to Rumil’s garden to illustrate Tolkien’s process in discovering his proper style. What did Tolkien mean when he told Brogan he found it easier to think in an archaic mode, and why did he chide Brogan for his “parochialism of time”? Hint: The distance is as great as that between Globe Earth and Flat Earth!",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-01-12T22:20:37+00:00"
}