{
  "url": "https://voxday.net/2016/07/25/5-reasons-trump-will-win/",
  "scraped_at": "2025-12-18T01:45:46.029679",
  "title": "5 Reasons Trump will win",
  "date_display": "July 25, 2016",
  "date_iso": "2016-07-25T09:46:00+00:00",
  "date_from_url": "2016-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Moore<a href=\"http://michaelmoore.com/trumpwillwin/\"> explains 5 reasons</a> Donald Trump will be the next President:</p><blockquote><p> 1. Midwest Math, or Welcome to Our Rust Belt Brexit.</p><p>I believe Trump is going to focus much of his attention on the four blue states in the rustbelt of the upper Great Lakes – Michigan, Ohio, Pennsylvania and Wisconsin. Four traditionally Democratic states – but each of them have elected a Republican governor since 2010 (only Pennsylvania has now finally elected a Democrat). In the Michigan primary in March, more Michiganders came out to vote for the Republicans (1.32 million) that the Democrats (1.19 million). Trump is ahead of Hillary in the latest polls in Pennsylvania and tied with her in Ohio. Tied? How can the race be this close after everything Trump has said and done? Well maybe it’s because he’s said (correctly) that the Clintons’ support of NAFTA helped to destroy the industrial states of the Upper Midwest. Trump is going to hammer Clinton on this and her support of TPP and other trade policies that have royally screwed the people of these four states. When Trump stood in the shadow of a Ford Motor factory during the Michigan primary, he threatened the corporation that if they did indeed go ahead with their planned closure of that factory and move it to Mexico, he would slap a 35% tariff on any Mexican-built cars shipped back to the United States. It was sweet, sweet music to the ears of the working class of Michigan, and when he tossed in his threat to Apple that he would force them to stop making their iPhones in China and build them here in America, well, hearts swooned and Trump walked away with a big victory that should have gone to the governor next-door, John Kasich.</p><p>From Green Bay to Pittsburgh, this, my friends, is the middle of England – broken, depressed, struggling, the smokestacks strewn across the countryside with the carcass of what we use to call the Middle Class. Angry, embittered working (and nonworking) people who were lied to by the trickle-down of Reagan and abandoned by Democrats who still try to talk a good line but are really just looking forward to rub one out with a lobbyist from Goldman Sachs who’ll write them nice big check before leaving the room. What happened in the UK with Brexit is going to happen here. Elmer Gantry shows up looking like Boris Johnson and just says whatever shit he can make up to convince the masses that this is their chance! To stick to ALL of them, all who wrecked their American Dream!</p><p> And now The Outsider, Donald Trump, has arrived to clean house! You don’t have to agree with him! You don’t even have to like him! He is your personal Molotov cocktail to throw right into the center of the bastards who did this to you! SEND A MESSAGE! TRUMP IS YOUR MESSENGER!</p><p>And this is where the math comes in. In 2012, Mitt Romney lost by 64 electoral votes. Add up the electoral votes cast by Michigan, Ohio, Pennsylvania and Wisconsin. It’s 64. All Trump needs to do to win is to carry, as he’s expected to do, the swath of traditional red states from Idaho to Georgia (states that’ll never vote for Hillary Clinton), and then he just needs these four rust belt states. He doesn’t need Florida. He doesn’t need Colorado or Virginia. Just Michigan, Ohio, Pennsylvania and Wisconsin. And that will put him over the top. This is how it will happen in November.</p><p>2. The Last Stand of the Angry White Man.</p><p>Our male-dominated, 240-year run of the USA is coming to an end. A woman is about to take over! How did this happen?! On our watch! There were warning signs, but we ignored them. Nixon, the gender traitor, imposing Title IX on us, the rule that said girls in school should get an equal chance at playing sports. Then they let them fly commercial jets. Before we knew it, Beyoncé stormed on the field at this year’s Super Bowl (our game!) with an army of Black Women, fists raised, declaring that our domination was hereby terminated! Oh, the humanity!</p><p>That’s a small peek into the mind of the Endangered White Male. There is a sense that the power has slipped out of their hands, that their way of doing things is no longer how things are done. This monster, the “Feminazi,”the thing that as Trump says, “bleeds through her eyes or wherever she bleeds,” has conquered us — and now, after having had to endure eight years of a black man telling us what to do, we’re supposed to just sit back and take eight years of a woman bossing us around? After that it’ll be eight years of the gays in the White House! Then the transgenders! You can see where this is going. By then animals will have been granted human rights and a fuckin’ hamster is going to be running the country. This has to stop!</p><p>3. The Hillary Problem.</p><p>Can we speak honestly, just among ourselves? And before we do, let me state, I actually like Hillary – a lot – and I think she has been given a bad rap she doesn’t deserve. But her vote for the Iraq War made me promise her that I would never vote for her again. To date, I haven’t broken that promise. For the sake of preventing a proto-fascist from becoming our commander-in-chief, I’m breaking that promise. I sadly believe Clinton will find a way to get us in some kind of military action. She’s a hawk, to the right of Obama. But Trump’s psycho finger will be on The Button, and that is that. Done and done.</p><p>Let’s face it: Our biggest problem here isn’t Trump – it’s Hillary. She is hugely unpopular — nearly 70% of all voters think she is untrustworthy and dishonest. She represents the old way of politics, not really believing in anything other than what can get you elected. That’s why she fights against gays getting married one moment, and the next she’s officiating a gay marriage. Young women are among her biggest detractors, which has to hurt considering it’s the sacrifices and the battles that Hillary and other women of her generation endured so that this younger generation would never have to be told by the Barbara Bushes of the world that they should just shut up and go bake some cookies.</p><p>But the kids don’t like her, and not a day goes by that a millennial doesn’t tell me they aren’t voting for her. No Democrat, and certainly no independent, is waking up on November 8th excited to run out and vote for Hillary the way they did the day Obama became president or when Bernie was on the primary ballot. The enthusiasm just isn’t there. And because this election is going to come down to just one thing — who drags the most people out of the house and gets them to the polls — Trump right now is in the catbird seat.</p><p>4. The Depressed Sanders Vote.</p><p>Stop fretting about Bernie’s supporters not voting for Clinton – we’re voting for Clinton! The polls already show that more Sanders voters will vote for Hillary this year than the number of Hillary primary voters in ’08 who then voted for Obama. This is not the problem. The fire alarm that should be going off is that while the average Bernie backer will drag him/herself to the polls that day to somewhat reluctantly vote for Hillary, it will be what’s called a “depressed vote” – meaning the voter doesn’t bring five people to vote with her. He doesn’t volunteer 10 hours in the month leading up to the election. She never talks in an excited voice when asked why she’s voting for Hillary. A depressed voter. Because, when you’re young, you have zero tolerance for phonies and BS.</p><p>Returning to the Clinton/Bush era for them is like suddenly having to pay for music, or using MySpace or carrying around one of those big-ass portable phones. They’re not going to vote for Trump; some will vote third party, but many will just stay home. Hillary Clinton is going to have to do something to give them a reason to support her  — and picking a moderate, bland-o, middle of the road old white guy as her running mate is not the kind of edgy move that tells millenials that their vote is important to Hillary. Having two women on the ticket – that was an exciting idea. But then Hillary got scared and has decided to play it safe. This is just one example of how she is killing the youth vote.</p><p>5. The Jesse Ventura Effect.</p><p>Finally, do not discount the electorate’s ability to be mischievous or underestimate how any millions fancy themselves as closet anarchists once they draw the curtain and are all alone in the voting booth. It’s one of the few places left in society where there are no security cameras, no listening devices, no spouses, no kids, no boss, no cops, there’s not even a friggin’ time limit. You can take as long as you need in there and no one can make you do anything. You can push the button and vote a straight party line, or you can write in Mickey Mouse and Donald Duck. There are no rules. And because of that, and the anger that so many have toward a broken political system, millions are going to vote for Trump not because they agree with him, not because they like his bigotry or ego, but just because they can. Just because it will upset the apple cart and make mommy and daddy mad.</p><p>And in the same way like when you’re standing on the edge of Niagara Falls and your mind wonders for a moment what would that feel like to go over that thing, a lot of people are going to love being in the position of puppetmaster and plunking down for Trump just to see what that might look like.</p><p>Remember back in the ‘90s when the people of Minnesota elected a professional wrestler as their governor? They didn’t do this because they’re stupid or thought that Jesse Ventura was some sort of statesman or political intellectual. They did so just because they could. Minnesota is one of the smartest states in the country. It is also filled with people who have a dark sense of humor — and voting for Ventura was their version of a good practical joke on a sick political system. This is going to happen again with Trump.</p></blockquote><p>It’s amusing to see how Moore can, despite himself, see some of the relevant issues, and yet fail to understand them. And it’s all so typical of an American liberal to vow one thing and then rationalize doing the other. But as wrong as he is about nearly everything, even Moore can see the Trump train barreling down the line; it’s a testimony to the herd-following nature of journalism that so few journalists have cottoned onto it yet.</p><p>Of course, there are at least seven reasons Trump will win, and Moore left out the two biggest, Immigration and Islam, which, though related, are two separate categories. Every time there is a shooting or an attack of any kind, anywhere in the USA or the West, Donald Trump picks up support, because everyone knows that Hillary Clinton isn’t going to do anything about either Immigration or Muslims in America.</p></div>",
  "content_text": "Michael Moore\nexplains 5 reasons\nDonald Trump will be the next President:\n1. Midwest Math, or Welcome to Our Rust Belt Brexit.\nI believe Trump is going to focus much of his attention on the four blue states in the rustbelt of the upper Great Lakes – Michigan, Ohio, Pennsylvania and Wisconsin. Four traditionally Democratic states – but each of them have elected a Republican governor since 2010 (only Pennsylvania has now finally elected a Democrat). In the Michigan primary in March, more Michiganders came out to vote for the Republicans (1.32 million) that the Democrats (1.19 million). Trump is ahead of Hillary in the latest polls in Pennsylvania and tied with her in Ohio. Tied? How can the race be this close after everything Trump has said and done? Well maybe it’s because he’s said (correctly) that the Clintons’ support of NAFTA helped to destroy the industrial states of the Upper Midwest. Trump is going to hammer Clinton on this and her support of TPP and other trade policies that have royally screwed the people of these four states. When Trump stood in the shadow of a Ford Motor factory during the Michigan primary, he threatened the corporation that if they did indeed go ahead with their planned closure of that factory and move it to Mexico, he would slap a 35% tariff on any Mexican-built cars shipped back to the United States. It was sweet, sweet music to the ears of the working class of Michigan, and when he tossed in his threat to Apple that he would force them to stop making their iPhones in China and build them here in America, well, hearts swooned and Trump walked away with a big victory that should have gone to the governor next-door, John Kasich.\nFrom Green Bay to Pittsburgh, this, my friends, is the middle of England – broken, depressed, struggling, the smokestacks strewn across the countryside with the carcass of what we use to call the Middle Class. Angry, embittered working (and nonworking) people who were lied to by the trickle-down of Reagan and abandoned by Democrats who still try to talk a good line but are really just looking forward to rub one out with a lobbyist from Goldman Sachs who’ll write them nice big check before leaving the room. What happened in the UK with Brexit is going to happen here. Elmer Gantry shows up looking like Boris Johnson and just says whatever shit he can make up to convince the masses that this is their chance! To stick to ALL of them, all who wrecked their American Dream!\nAnd now The Outsider, Donald Trump, has arrived to clean house! You don’t have to agree with him! You don’t even have to like him! He is your personal Molotov cocktail to throw right into the center of the bastards who did this to you! SEND A MESSAGE! TRUMP IS YOUR MESSENGER!\nAnd this is where the math comes in. In 2012, Mitt Romney lost by 64 electoral votes. Add up the electoral votes cast by Michigan, Ohio, Pennsylvania and Wisconsin. It’s 64. All Trump needs to do to win is to carry, as he’s expected to do, the swath of traditional red states from Idaho to Georgia (states that’ll never vote for Hillary Clinton), and then he just needs these four rust belt states. He doesn’t need Florida. He doesn’t need Colorado or Virginia. Just Michigan, Ohio, Pennsylvania and Wisconsin. And that will put him over the top. This is how it will happen in November.\n2. The Last Stand of the Angry White Man.\nOur male-dominated, 240-year run of the USA is coming to an end. A woman is about to take over! How did this happen?! On our watch! There were warning signs, but we ignored them. Nixon, the gender traitor, imposing Title IX on us, the rule that said girls in school should get an equal chance at playing sports. Then they let them fly commercial jets. Before we knew it, Beyoncé stormed on the field at this year’s Super Bowl (our game!) with an army of Black Women, fists raised, declaring that our domination was hereby terminated! Oh, the humanity!\nThat’s a small peek into the mind of the Endangered White Male. There is a sense that the power has slipped out of their hands, that their way of doing things is no longer how things are done. This monster, the “Feminazi,”the thing that as Trump says, “bleeds through her eyes or wherever she bleeds,” has conquered us — and now, after having had to endure eight years of a black man telling us what to do, we’re supposed to just sit back and take eight years of a woman bossing us around? After that it’ll be eight years of the gays in the White House! Then the transgenders! You can see where this is going. By then animals will have been granted human rights and a fuckin’ hamster is going to be running the country. This has to stop!\n3. The Hillary Problem.\nCan we speak honestly, just among ourselves? And before we do, let me state, I actually like Hillary – a lot – and I think she has been given a bad rap she doesn’t deserve. But her vote for the Iraq War made me promise her that I would never vote for her again. To date, I haven’t broken that promise. For the sake of preventing a proto-fascist from becoming our commander-in-chief, I’m breaking that promise. I sadly believe Clinton will find a way to get us in some kind of military action. She’s a hawk, to the right of Obama. But Trump’s psycho finger will be on The Button, and that is that. Done and done.\nLet’s face it: Our biggest problem here isn’t Trump – it’s Hillary. She is hugely unpopular — nearly 70% of all voters think she is untrustworthy and dishonest. She represents the old way of politics, not really believing in anything other than what can get you elected. That’s why she fights against gays getting married one moment, and the next she’s officiating a gay marriage. Young women are among her biggest detractors, which has to hurt considering it’s the sacrifices and the battles that Hillary and other women of her generation endured so that this younger generation would never have to be told by the Barbara Bushes of the world that they should just shut up and go bake some cookies.\nBut the kids don’t like her, and not a day goes by that a millennial doesn’t tell me they aren’t voting for her. No Democrat, and certainly no independent, is waking up on November 8th excited to run out and vote for Hillary the way they did the day Obama became president or when Bernie was on the primary ballot. The enthusiasm just isn’t there. And because this election is going to come down to just one thing — who drags the most people out of the house and gets them to the polls — Trump right now is in the catbird seat.\n4. The Depressed Sanders Vote.\nStop fretting about Bernie’s supporters not voting for Clinton – we’re voting for Clinton! The polls already show that more Sanders voters will vote for Hillary this year than the number of Hillary primary voters in ’08 who then voted for Obama. This is not the problem. The fire alarm that should be going off is that while the average Bernie backer will drag him/herself to the polls that day to somewhat reluctantly vote for Hillary, it will be what’s called a “depressed vote” – meaning the voter doesn’t bring five people to vote with her. He doesn’t volunteer 10 hours in the month leading up to the election. She never talks in an excited voice when asked why she’s voting for Hillary. A depressed voter. Because, when you’re young, you have zero tolerance for phonies and BS.\nReturning to the Clinton/Bush era for them is like suddenly having to pay for music, or using MySpace or carrying around one of those big-ass portable phones. They’re not going to vote for Trump; some will vote third party, but many will just stay home. Hillary Clinton is going to have to do something to give them a reason to support her  — and picking a moderate, bland-o, middle of the road old white guy as her running mate is not the kind of edgy move that tells millenials that their vote is important to Hillary. Having two women on the ticket – that was an exciting idea. But then Hillary got scared and has decided to play it safe. This is just one example of how she is killing the youth vote.\n5. The Jesse Ventura Effect.\nFinally, do not discount the electorate’s ability to be mischievous or underestimate how any millions fancy themselves as closet anarchists once they draw the curtain and are all alone in the voting booth. It’s one of the few places left in society where there are no security cameras, no listening devices, no spouses, no kids, no boss, no cops, there’s not even a friggin’ time limit. You can take as long as you need in there and no one can make you do anything. You can push the button and vote a straight party line, or you can write in Mickey Mouse and Donald Duck. There are no rules. And because of that, and the anger that so many have toward a broken political system, millions are going to vote for Trump not because they agree with him, not because they like his bigotry or ego, but just because they can. Just because it will upset the apple cart and make mommy and daddy mad.\nAnd in the same way like when you’re standing on the edge of Niagara Falls and your mind wonders for a moment what would that feel like to go over that thing, a lot of people are going to love being in the position of puppetmaster and plunking down for Trump just to see what that might look like.\nRemember back in the ‘90s when the people of Minnesota elected a professional wrestler as their governor? They didn’t do this because they’re stupid or thought that Jesse Ventura was some sort of statesman or political intellectual. They did so just because they could. Minnesota is one of the smartest states in the country. It is also filled with people who have a dark sense of humor — and voting for Ventura was their version of a good practical joke on a sick political system. This is going to happen again with Trump.\nIt’s amusing to see how Moore can, despite himself, see some of the relevant issues, and yet fail to understand them. And it’s all so typical of an American liberal to vow one thing and then rationalize doing the other. But as wrong as he is about nearly everything, even Moore can see the Trump train barreling down the line; it’s a testimony to the herd-following nature of journalism that so few journalists have cottoned onto it yet.\nOf course, there are at least seven reasons Trump will win, and Moore left out the two biggest, Immigration and Islam, which, though related, are two separate categories. Every time there is a shooting or an attack of any kind, anywhere in the USA or the West, Donald Trump picks up support, because everyone knows that Hillary Clinton isn’t going to do anything about either Immigration or Muslims in America.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-25T08:46:00+00:00"
}