{
  "url": "https://voxday.net/2016/07/15/a-throne-of-bones-review/",
  "scraped_at": "2025-12-18T01:44:13.937914",
  "title": "A Throne of Bones: a review",
  "date_display": "July 15, 2016",
  "date_iso": "2016-07-15T15:30:00+00:00",
  "date_from_url": "2016-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Katrina <a href=\"https://www.amazon.com/gp/customer-reviews/R25A1TKWVTE5L5/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B00I6H0J7S\">reviews ATOB on Amazon</a>:</p><blockquote class=\"tr_bq\"><p> I was pleasantly surprised at how much I enjoyed this book. I picked it up because I’d seen the author’s critiques of the current state of SF/F and was curious to see if he could deliver an improvement on the mediocre works that just about define the genre today. I was also intrigued by the military emphasis- or more specifically the emphasis on an accurate portrayal of warfare. On both accounts, I came away impressed.</p><p>Yes, this is like <i>A Game of Thrones</i>. As I understand it, that’s intentional.It follows a similar format with each chapter named for the character whose perspective is shown, and the general idea is similar, with different warring kingdoms and factions and betrayals going on at the micro level and some vast cyclical magic operating at a macro level.</p><p>Where <i>A Throne of Bones</i> improves upon AGoT is mainly at that macro level. As much as it’s transparent in Martin’s books that he has no idea where the overall story is going, it’s quite clear that Day actually has a plan for <i>Arts of Dark and Light</i>. I get the feeling it’s a good plan, too, and, without giving too much away, I suspect it’s a little more <i>Wheel of Time</i> than <i>Game of Thrones</i>.</p><p>Day also roundly defeats Martin in the military arena. I wasn’t sure if this aspect of the book would interest me, since I’m more a fan of naval history, but I found AToB perfectly balanced realism and detail with excitement and pacing. I got the sense that Day could go on all, well, day, about tactics and logistics and this horse and that infantry, yet he didn’t, which gave the story a sense of depth without growing tedious. I don’t know whether we have the author or the editor to thank for that, but well done, Castalia House, either way.</p><p>(By the way, the human side of warfare is incredibly well illustrated, particularly in the chapter featuring “Eyepopper.” If I didn’t actually cry, it was only because I was too busy double-checking the by-line to make sure it didn’t say “Tolstoy.”)</p><p>I should also offer some praise to the characters whose perspectives we see in the book. Unlike in Martin’s books, there is no one I want to choke to death, no name that makes me dread the coming chapter (*cough* Sansa *cough*). Martin’s greatest strength is his ability to show both sides of every conflict in a sympathetic light. Day exhibits this ability as well, with legitimate heroes representing differing opinions on religion, morality, national identity, and so on. He writes persuasively and genuinely from all of these perspectives, which is enormously refreshing, especially as he avoids appearing to simply hate humanity in the process.</p><p>Which brings me to the worst thing about this book: the sequel isn’t out yet!</p></blockquote><p>It’s in the works, although obviously slower than I’d like. It will be out this year, one way or another, but “this year” is looking more like “November” than “September” now. I’m beginning to understand why editors are so seldom very prolific writers, as once you spend a few hours editing someone else’s book, you’re seldom in much of a mood to work on your own.</p><p>Also, <i>A Sea of Skulls</i> is a more difficult book to write than A Throne of Bones was. Not for the same reasons that have plagued Mr. Martin, but because, as the reviewer noted, I try to write from the perspective of the different characters. It turns out that the level of difficulty rises considerably when one is writing not only from the various perspectives of human, elf, dwarf, and orc, but from those perspectives set within their native cultures. Alas for those who desired a greater sense of the numinous, it appears my vulgar lyrical gifts much better suit the latter two cultures than the elevated elven culture that Tolkien so memorably portrayed.</p><p>Anyhow, if you haven’t read <a href=\"http://amzn.to/1THmHo5\"><b><i>A Throne of Bones</i></b></a> yet, you should probably get started on it now if you’re going to get through it in time for the sequel, since it is an 850-page monster.</p><p>What’s interesting about this review is that it apparently isn’t by a longtime fan or someone familiar with my previous or current works, and yet they nevertheless reach the conclusion that at least the first volume compares favorably with the bestselling works by Mr. Martin. In contrast, those who spuriously claim that I cannot write invariably do so on the basis of not having done more than skimmed a short story or two, and moreover, are less than entirely credible on the basis of their pre-existing enmity for me.</p><p>I will never be a great novelist because I simply don’t have the gift. I know what a great writer is, and I simply cannot do what they do. But that doesn’t mean that I can’t write some of the best epic fantasy out there, because what is required for epic fantasy leans more towards stamina, clear thinking, and a coherent vision than pure literary talent. And that is one reason that I have chosen to focus on it, at least in terms of my fiction, rather than some of the other sub-genres in which I have dabbled.</p></div>",
  "content_text": "Katrina\nreviews ATOB on Amazon\n:\nI was pleasantly surprised at how much I enjoyed this book. I picked it up because I’d seen the author’s critiques of the current state of SF/F and was curious to see if he could deliver an improvement on the mediocre works that just about define the genre today. I was also intrigued by the military emphasis- or more specifically the emphasis on an accurate portrayal of warfare. On both accounts, I came away impressed.\nYes, this is like\nA Game of Thrones\n. As I understand it, that’s intentional.It follows a similar format with each chapter named for the character whose perspective is shown, and the general idea is similar, with different warring kingdoms and factions and betrayals going on at the micro level and some vast cyclical magic operating at a macro level.\nWhere\nA Throne of Bones\nimproves upon AGoT is mainly at that macro level. As much as it’s transparent in Martin’s books that he has no idea where the overall story is going, it’s quite clear that Day actually has a plan for\nArts of Dark and Light\n. I get the feeling it’s a good plan, too, and, without giving too much away, I suspect it’s a little more\nWheel of Time\nthan\nGame of Thrones\n.\nDay also roundly defeats Martin in the military arena. I wasn’t sure if this aspect of the book would interest me, since I’m more a fan of naval history, but I found AToB perfectly balanced realism and detail with excitement and pacing. I got the sense that Day could go on all, well, day, about tactics and logistics and this horse and that infantry, yet he didn’t, which gave the story a sense of depth without growing tedious. I don’t know whether we have the author or the editor to thank for that, but well done, Castalia House, either way.\n(By the way, the human side of warfare is incredibly well illustrated, particularly in the chapter featuring “Eyepopper.” If I didn’t actually cry, it was only because I was too busy double-checking the by-line to make sure it didn’t say “Tolstoy.”)\nI should also offer some praise to the characters whose perspectives we see in the book. Unlike in Martin’s books, there is no one I want to choke to death, no name that makes me dread the coming chapter (*cough* Sansa *cough*). Martin’s greatest strength is his ability to show both sides of every conflict in a sympathetic light. Day exhibits this ability as well, with legitimate heroes representing differing opinions on religion, morality, national identity, and so on. He writes persuasively and genuinely from all of these perspectives, which is enormously refreshing, especially as he avoids appearing to simply hate humanity in the process.\nWhich brings me to the worst thing about this book: the sequel isn’t out yet!\nIt’s in the works, although obviously slower than I’d like. It will be out this year, one way or another, but “this year” is looking more like “November” than “September” now. I’m beginning to understand why editors are so seldom very prolific writers, as once you spend a few hours editing someone else’s book, you’re seldom in much of a mood to work on your own.\nAlso,\nA Sea of Skulls\nis a more difficult book to write than A Throne of Bones was. Not for the same reasons that have plagued Mr. Martin, but because, as the reviewer noted, I try to write from the perspective of the different characters. It turns out that the level of difficulty rises considerably when one is writing not only from the various perspectives of human, elf, dwarf, and orc, but from those perspectives set within their native cultures. Alas for those who desired a greater sense of the numinous, it appears my vulgar lyrical gifts much better suit the latter two cultures than the elevated elven culture that Tolkien so memorably portrayed.\nAnyhow, if you haven’t read\nA Throne of Bones\nyet, you should probably get started on it now if you’re going to get through it in time for the sequel, since it is an 850-page monster.\nWhat’s interesting about this review is that it apparently isn’t by a longtime fan or someone familiar with my previous or current works, and yet they nevertheless reach the conclusion that at least the first volume compares favorably with the bestselling works by Mr. Martin. In contrast, those who spuriously claim that I cannot write invariably do so on the basis of not having done more than skimmed a short story or two, and moreover, are less than entirely credible on the basis of their pre-existing enmity for me.\nI will never be a great novelist because I simply don’t have the gift. I know what a great writer is, and I simply cannot do what they do. But that doesn’t mean that I can’t write some of the best epic fantasy out there, because what is required for epic fantasy leans more towards stamina, clear thinking, and a coherent vision than pure literary talent. And that is one reason that I have chosen to focus on it, at least in terms of my fiction, rather than some of the other sub-genres in which I have dabbled.",
  "tags": [
    "Book Review",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-15T14:30:00+00:00"
}