{
  "url": "https://voxday.net/2016/07/28/alt-right-vs-conservative_28/",
  "scraped_at": "2025-12-18T01:46:18.905362",
  "title": "Alt Right vs conservative",
  "date_display": "July 28, 2016",
  "date_iso": "2016-07-28T12:00:00+00:00",
  "date_from_url": "2016-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CocuhyAWEAAeHl4.jpg:large\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://pbs.twimg.com/media/CocuhyAWEAAeHl4.jpg:large\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://pbs.twimg.com/media/CocuhyAWEAAeHl4.jpg:large\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><p>The difference is material. As are the outcomes. On a not-entirely-unrelated note, Donald Trump answered 12 questions at The Donald sub-reddit yesterday. One of them was from Milo:</p><blockquote><p> yiannopoulos_mMILO<br> America has a proud tradition of stealing the most brilliant and talented people from countries around the world for ourselves. Albert Einstein, Wernher von Braun, Arnold Schwarzenegger, Melania Trump… the list goes on and on. In recent years, however, H-1B visa abuse has become rampant. A program meant bring truly exceptional talent to America has been twisted by globalist politicians and corporations, allowing low-cost, short term labor to steal jobs from everyday Americans and take everything they learn back to their home countries. Will you curb H-1B abuse and make sure visas are going to people who want to become American, stay American, and make America great?</br></p><p>the-realDonaldTrump<br> I have put forward a detailed plan for H-1B reform to protect American workers which can viewed on the immigration paper on my website. My plan is the exact opposite of Crooked Hillary Clinton.</br></p><p>[–]MeowntainMan<br> For the lazy</br></p><ul><li>Increase prevailing wage for H-1Bs. We graduate two times more Americans with STEM degrees each year than find STEM jobs, yet as much as two-thirds of entry-level hiring for IT jobs is accomplished through the H-1B program. More than half of H-1B visas are issued for the program’s lowest allowable wage level, and more than eighty percent for its bottom two. Raising the prevailing wage paid to H-1Bs will force companies to give these coveted entry-level jobs to the existing domestic pool of unemployed native and immigrant workers in the U.S., instead of flying in cheaper workers from overseas. This will improve the number of black, Hispanic and female workers in Silicon Valley who have been passed over in favor of the H-1B program. Mark Zuckerberg’s personal Senator, Marco Rubio, has a bill to triple H-1Bs that would decimate women and minorities.</li><li>Requirement to hire American workers first. Too many visas, like the H-1B, have no such requirement. In the year 2015, with 92 million Americans outside the workforce and incomes collapsing, we need companies to hire from the domestic pool of unemployed. Petitions for workers should be mailed to the unemployment office, not USCIS.</li></ul></blockquote><p>However, it was another answer that was more significant, as once more, Trump stressed the need to change both economic policy and foreign policy, linking both to the corrupt system of politics that is rigged against the interest of most Americans.<br> <i><br/></i><br> <i>Americans in every party are tired of our rigged system and corrupt politicians, and want to reform our government so it no longer benefits the powerful at the expense of everyone else. They know I will fix it so it works for them and their families. Hillary Clinton’s message is that things will never change. My message is that things have to change, and they have to change right now.</i><br> <i><br/></i><br> <i>We have to change a foreign policy that has led us to one economic disaster after another, and an economic policy that has failed our poorest citizens. We will never fix a rigged system by relying on the people who rigged it in the first place.</i><br> <i><br/></i><br> <i>I am going to return the government to the people.</i><br> <i><br/></i><br> <i>Together, we will Make America Great Again. </i></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "The difference is material. As are the outcomes. On a not-entirely-unrelated note, Donald Trump answered 12 questions at The Donald sub-reddit yesterday. One of them was from Milo:\nyiannopoulos_mMILO\nAmerica has a proud tradition of stealing the most brilliant and talented people from countries around the world for ourselves. Albert Einstein, Wernher von Braun, Arnold Schwarzenegger, Melania Trump… the list goes on and on. In recent years, however, H-1B visa abuse has become rampant. A program meant bring truly exceptional talent to America has been twisted by globalist politicians and corporations, allowing low-cost, short term labor to steal jobs from everyday Americans and take everything they learn back to their home countries. Will you curb H-1B abuse and make sure visas are going to people who want to become American, stay American, and make America great?\nthe-realDonaldTrump\nI have put forward a detailed plan for H-1B reform to protect American workers which can viewed on the immigration paper on my website. My plan is the exact opposite of Crooked Hillary Clinton.\n[–]MeowntainMan\nFor the lazy\nIncrease prevailing wage for H-1Bs. We graduate two times more Americans with STEM degrees each year than find STEM jobs, yet as much as two-thirds of entry-level hiring for IT jobs is accomplished through the H-1B program. More than half of H-1B visas are issued for the program’s lowest allowable wage level, and more than eighty percent for its bottom two. Raising the prevailing wage paid to H-1Bs will force companies to give these coveted entry-level jobs to the existing domestic pool of unemployed native and immigrant workers in the U.S., instead of flying in cheaper workers from overseas. This will improve the number of black, Hispanic and female workers in Silicon Valley who have been passed over in favor of the H-1B program. Mark Zuckerberg’s personal Senator, Marco Rubio, has a bill to triple H-1Bs that would decimate women and minorities.\nRequirement to hire American workers first. Too many visas, like the H-1B, have no such requirement. In the year 2015, with 92 million Americans outside the workforce and incomes collapsing, we need companies to hire from the domestic pool of unemployed. Petitions for workers should be mailed to the unemployment office, not USCIS.\nHowever, it was another answer that was more significant, as once more, Trump stressed the need to change both economic policy and foreign policy, linking both to the corrupt system of politics that is rigged against the interest of most Americans.\nAmericans in every party are tired of our rigged system and corrupt politicians, and want to reform our government so it no longer benefits the powerful at the expense of everyone else. They know I will fix it so it works for them and their families. Hillary Clinton’s message is that things will never change. My message is that things have to change, and they have to change right now.\nWe have to change a foreign policy that has led us to one economic disaster after another, and an economic policy that has failed our poorest citizens. We will never fix a rigged system by relying on the people who rigged it in the first place.\nI am going to return the government to the people.\nTogether, we will Make America Great Again.",
  "tags": [
    "#AltRight",
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-28T11:00:00+00:00"
}