{
  "url": "https://voxday.net/2016/07/14/always-excuse/",
  "scraped_at": "2025-12-18T01:44:05.101010",
  "title": "Always an excuse",
  "date_display": "July 14, 2016",
  "date_iso": "2016-07-14T15:30:00+00:00",
  "date_from_url": "2016-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi ✔ @scalzi<br> Friends posting results of an online test to show they have a huge vocabulary. But it’s not how many words you know. It’s how you use them.</br></p><p> John Scalzi ✔ @scalzi<br> Also, I suspect posting the results of an online test to show how smart/learned/nerdy you are is a test in itself, isn’t it.</br></p><p> John Scalzi ✔ @scalzi<br> I mean, don’t get me wrong, have fun with online tests. Just maybe don’t use them to re-litigate your performance on the SAT.</br></p><p>Translation: he scored below the top one percent and is ashamed to admit it.</p><p>Which would be no surprise, considering that he’s not in the top two percent of IQ either. Neither, as it happens, is Wil Wheaton, which didn’t stop him from delivering <a href=\"http://wilwheaton.net/2016/07/my-keynote-address-to-the-2016-mensa-annual-gathering/\">a rather cringe-worthy speech</a> to American Mensa:</p><blockquote class=\"tr_bq\"><p> I am now going to talk to you about something that I think is the geekiest thing of all, a thing that most of us have in common, regardless of which particular part of geek culture we hold closest to our hearts: anxiety.</p><p>I have this thing called Imposter Syndrome, and I guess it’s fairly common among creative people. The way it works is this part of my brain that’s supposed to be on my side but is really a dick about everything goes, “You know, you suck at everything and you don’t deserve to be here and nobody likes you because you suck. Boy do you suck. You are the suckiest bunch of sucks that ever sucked.”</p><p>This voice is relentless, even though I’m supposed to be successful enough to ignore it and show it physical evidence of its bullshit in the form of awards and a happy marriage and two awesome kids, it never, ever, ever shuts up. But while I was preparing for tonight, it overplayed its hand. It filled me with so much anxiety, it reminded me of an article I read about a study which indicated that highly intelligent people tend to have generalized anxiety and other mental health issues at a rate that is significantly greater than a control group.</p><p>And when I read that, I knew that I wanted to talk about it. because it doesn’t matter if I’m just a writer or just an actor or just a geek or just any of the things my stupid brain tells me I “just” am. All of us here, at one time or another in our lives, have had a hard time relating to people who just don’t get us. We are constantly surrounded by people who just see a loaf of bread, or don’t care how things work, as long as they work. They don’t stay up at night, unable to sleep, because they can’t stop thinking about how thin our atmosphere is, relative to the size of our planet, and how terrifying it is that we’re basically these tiny little things on a giant hunk of rock speeding through space at like 30 kilometers per second and what the hell is space, anyway? And if we really are in a computer simulation, what’s the computer running it in? And can I somehow break out of the program to find out? Wait. If I can think that, it’s just part of my programming so does that mean that free will is oh hey the sun is coming up and I haven’t slept at all.</p><p>And it’s not that we want to do this, right? It’s that we can’t help it. It doesn’t matter if you’re an engineer, an artist, an athlete, or a blacksmith. Look around you – everyone here has their own internal monologue. It’s what separates us from animals, that constant conversation going on in all our heads. And when we feel nervous about something – that voice is what helps us rise above the fight or flight instinct of animals – it can soothe us, talk us down, talk us up – or in some cases – blather on and make things worse. When you’re smart, and faced with a problem, this voice starts to break things down, so you can solve it. “Here is the problem. Here are its individual pieces. Now, how do we solve this rationally and logically.” It is not unreasonable to expect that by breaking down a problem into pieces, we should be able to make those pieces follow rules. And rules are comfortable and comforting and make us feel safe.</p><p>But anyone who has ever tried to reason with an unreasonable person knows that more frequently than we’d like, the pieces just will NOT follow the rules, even though they should follow the rules, because that’s the simplest and most efficient and most logical way to get things done. And here comes that voice again, only this time it’s telling us that everything is terrible and nothing will ever follow the rules and we’re all going to die and the frogurt is also cursed.</p><p>That voice speaks to me almost every day, and if I could just make it stop, I would, but I have mental illness. I have anxiety and depression, and I want you to know that if you do, too, you are not alone. If you’re like me, you get frustrated that the thing that makes you special, your big beautiful brain that is so smart and capable of so much more than some muggle’s brain is, actively fucks with you every day.</p><p>And it makes you wonder: If I’m so smart, why is my brain so dumb? Why can’t my brain just get with the program, and stop worrying about everything all the time? My life is great! I love my job. I love my family. I love my home and my pets. I love everything I get to do in this amazing world, and I haven’t even scratched the surface of what there is to explore on this planet! I make art that matters and I inspire people to do cool stuff … so why do I feel so terrible about myself all the time?</p><p>Oh, right. Because my brain is broken. There’s all sorts of interesting medical and neurochemical reasons for it, and I’ve learned everything I can about them, but knowing all of that isn’t enough to make my brain magically start processing serotonin and norepinephrine and dopamine in a balanced way, so that I won’t feel like my career is over when I’m not cast in The Dark Tower or Ready Player One,and feel like nothing is worth doing for days at a time, even though I know how irrational that is.</p><p>This is where being really smart is kind of the worst. All the skills that we’ve learned over the course of our lives, the things that set us apart from average people, they really don’t help. In fact, the frustration that we feel when those skills don’t work can actually make it all worse, because it’s not only unfair, it’s irrational! It isn’t following the rules, and this isn’t Vietnam, Dude.</p><p>And it makes you feel really, really alone. Like, you are the only person who has ever felt this way, and the only person who ever will feel this way, and if you just tried a little harder, you wouldn’t feel this way. But you do feel this way, because you’re alone. Yep, you’re alone and nobody can help you. In fact, it wouldn’t be surprised if you’re the only one with this infernal internal monologue. Look around you – nobody else seems to have this problem. It’s just you.</p></blockquote><p>So anxiety is what makes the geek? No wonder I’ve never fit in with their weird little culture. What Wheaton is describing has nothing to do with being smart; I’m considerably smarter than him and I don’t suffer from anxiety or Imposter Syndrome, much less depression. Moreover, I know many highly intelligent people who don’t suffer from any of those things, but are very happy and well-adjusted individuals.</p><p>While there are probably some purely physical or developmental factors involved, the main reason people like Wheaton and Scalzi are unhappy and mentally broken is spiritual in nature. They are addicted to lies, a philosophical addiction that can be every bit as debilitating as a physical addiction. This addiction is a result of pride, as can be seen in Wheaton’s references to “average people” and “muggles”, and the fact that this pride is unjustified is the reason that Wheaton feels like an imposter. He feels like an imposter because he is an imposter.</p><p>Higher-than-average intelligence doesn’t make you any better than anyone else, any more than being taller, or faster, or stronger does. What it often does, however, is allow others to convince you that you should be something different than you are, or than you want to be. Even worse, it gives you the ability to successfully rationalize away your failures, to both yourself and others. Thus are created the Secret Kings who never, ever lose to anyone at anything, and yet feel like failures and imposters all the same.</p><p>One thing I’ve noticed about all these people with broken minds is that none of them ever seem to have played sports. None of them seems to know what it is like to try your hardest, play your very best, and still fall short. None of them seems to have known the security of winning the respect and approval of an opponent. Thus, they are always attempting to fill the hole of insecurity in their souls through various means that can never do so.</p><p>They also tend to be vehemently irreligious, which again tends to go back to pride.</p><p>So, if you have a broken mind, if you feel anxious and insecure, if you feel like an imposter, I have two pieces of advice.</p><p>1. Humble yourself before God.<br> 2. Give Man the opportunity to humble you.</br></p><p>I’m not self-confident because I’m smart, or because I’m athletic, or because pretty girls like me, I’m self-confident because I have allowed myself to be tested, repeatedly, and I have passed the tests. The test is <i>not</i> winning. The test is getting up after you are knocked down, being a good sport when you are beaten, meeting rejection with grace, meeting failure with good humor, and accepting your assigned place in the social hierarchy without demur or complaint.</p><p>You can’t change the past or the present. All you can change is how you approach the vicissitudes of the future.</p><p>Winning feels great. I like to win as anyone else. I’ve won everything from grade school competitions to NCAA Division One conference championships. But even better than winning, in terms of developing self-respect, is having the rival who has beaten you despite your best efforts treat you with respect, as an equal, and above all, as a <i>worthy</i> opponent.</p><p>And I’m not proud of my intelligence because I know what it is worth in comparison to the glory of the Creator and the magnificence of His Creation, which is precisely nothing. It means nothing more than the color of a spot on a dog’s coat or the pattern on a snake’s skin.</p><p>Wil Wheaton, on the other hand, has a different solution:</p><blockquote class=\"tr_bq\"><p> Here’s what I need you guys to do. I need this entire room of people to make a pact. It’s just us, so what happens here in beautiful downtown San Diego, stays in beautiful downtown San Diego. So here it goes. You are the superheroes we need. But the world doesn’t know it yet. But they will. And something cataclysmic will occur, and the world will cry out, “who will save us?” And I need you to be ready to burst out of the crowd, rip open your shirt to expose your true identity and say proudly, “I’m ready! I am the SUPERHERO YOU NEED!”</p></blockquote><p>Fantastic. Now they’re not just Secret Kings, they’re Secret fucking Superheroes and only these very special snowflakes can save the world.</p><p>No wonder they feel like imposters. They never stop posturing.</p></div>",
  "content_text": "John Scalzi ✔ @scalzi\nFriends posting results of an online test to show they have a huge vocabulary. But it’s not how many words you know. It’s how you use them.\nJohn Scalzi ✔ @scalzi\nAlso, I suspect posting the results of an online test to show how smart/learned/nerdy you are is a test in itself, isn’t it.\nJohn Scalzi ✔ @scalzi\nI mean, don’t get me wrong, have fun with online tests. Just maybe don’t use them to re-litigate your performance on the SAT.\nTranslation: he scored below the top one percent and is ashamed to admit it.\nWhich would be no surprise, considering that he’s not in the top two percent of IQ either. Neither, as it happens, is Wil Wheaton, which didn’t stop him from delivering\na rather cringe-worthy speech\nto American Mensa:\nI am now going to talk to you about something that I think is the geekiest thing of all, a thing that most of us have in common, regardless of which particular part of geek culture we hold closest to our hearts: anxiety.\nI have this thing called Imposter Syndrome, and I guess it’s fairly common among creative people. The way it works is this part of my brain that’s supposed to be on my side but is really a dick about everything goes, “You know, you suck at everything and you don’t deserve to be here and nobody likes you because you suck. Boy do you suck. You are the suckiest bunch of sucks that ever sucked.”\nThis voice is relentless, even though I’m supposed to be successful enough to ignore it and show it physical evidence of its bullshit in the form of awards and a happy marriage and two awesome kids, it never, ever, ever shuts up. But while I was preparing for tonight, it overplayed its hand. It filled me with so much anxiety, it reminded me of an article I read about a study which indicated that highly intelligent people tend to have generalized anxiety and other mental health issues at a rate that is significantly greater than a control group.\nAnd when I read that, I knew that I wanted to talk about it. because it doesn’t matter if I’m just a writer or just an actor or just a geek or just any of the things my stupid brain tells me I “just” am. All of us here, at one time or another in our lives, have had a hard time relating to people who just don’t get us. We are constantly surrounded by people who just see a loaf of bread, or don’t care how things work, as long as they work. They don’t stay up at night, unable to sleep, because they can’t stop thinking about how thin our atmosphere is, relative to the size of our planet, and how terrifying it is that we’re basically these tiny little things on a giant hunk of rock speeding through space at like 30 kilometers per second and what the hell is space, anyway? And if we really are in a computer simulation, what’s the computer running it in? And can I somehow break out of the program to find out? Wait. If I can think that, it’s just part of my programming so does that mean that free will is oh hey the sun is coming up and I haven’t slept at all.\nAnd it’s not that we want to do this, right? It’s that we can’t help it. It doesn’t matter if you’re an engineer, an artist, an athlete, or a blacksmith. Look around you – everyone here has their own internal monologue. It’s what separates us from animals, that constant conversation going on in all our heads. And when we feel nervous about something – that voice is what helps us rise above the fight or flight instinct of animals – it can soothe us, talk us down, talk us up – or in some cases – blather on and make things worse. When you’re smart, and faced with a problem, this voice starts to break things down, so you can solve it. “Here is the problem. Here are its individual pieces. Now, how do we solve this rationally and logically.” It is not unreasonable to expect that by breaking down a problem into pieces, we should be able to make those pieces follow rules. And rules are comfortable and comforting and make us feel safe.\nBut anyone who has ever tried to reason with an unreasonable person knows that more frequently than we’d like, the pieces just will NOT follow the rules, even though they should follow the rules, because that’s the simplest and most efficient and most logical way to get things done. And here comes that voice again, only this time it’s telling us that everything is terrible and nothing will ever follow the rules and we’re all going to die and the frogurt is also cursed.\nThat voice speaks to me almost every day, and if I could just make it stop, I would, but I have mental illness. I have anxiety and depression, and I want you to know that if you do, too, you are not alone. If you’re like me, you get frustrated that the thing that makes you special, your big beautiful brain that is so smart and capable of so much more than some muggle’s brain is, actively fucks with you every day.\nAnd it makes you wonder: If I’m so smart, why is my brain so dumb? Why can’t my brain just get with the program, and stop worrying about everything all the time? My life is great! I love my job. I love my family. I love my home and my pets. I love everything I get to do in this amazing world, and I haven’t even scratched the surface of what there is to explore on this planet! I make art that matters and I inspire people to do cool stuff … so why do I feel so terrible about myself all the time?\nOh, right. Because my brain is broken. There’s all sorts of interesting medical and neurochemical reasons for it, and I’ve learned everything I can about them, but knowing all of that isn’t enough to make my brain magically start processing serotonin and norepinephrine and dopamine in a balanced way, so that I won’t feel like my career is over when I’m not cast in The Dark Tower or Ready Player One,and feel like nothing is worth doing for days at a time, even though I know how irrational that is.\nThis is where being really smart is kind of the worst. All the skills that we’ve learned over the course of our lives, the things that set us apart from average people, they really don’t help. In fact, the frustration that we feel when those skills don’t work can actually make it all worse, because it’s not only unfair, it’s irrational! It isn’t following the rules, and this isn’t Vietnam, Dude.\nAnd it makes you feel really, really alone. Like, you are the only person who has ever felt this way, and the only person who ever will feel this way, and if you just tried a little harder, you wouldn’t feel this way. But you do feel this way, because you’re alone. Yep, you’re alone and nobody can help you. In fact, it wouldn’t be surprised if you’re the only one with this infernal internal monologue. Look around you – nobody else seems to have this problem. It’s just you.\nSo anxiety is what makes the geek? No wonder I’ve never fit in with their weird little culture. What Wheaton is describing has nothing to do with being smart; I’m considerably smarter than him and I don’t suffer from anxiety or Imposter Syndrome, much less depression. Moreover, I know many highly intelligent people who don’t suffer from any of those things, but are very happy and well-adjusted individuals.\nWhile there are probably some purely physical or developmental factors involved, the main reason people like Wheaton and Scalzi are unhappy and mentally broken is spiritual in nature. They are addicted to lies, a philosophical addiction that can be every bit as debilitating as a physical addiction. This addiction is a result of pride, as can be seen in Wheaton’s references to “average people” and “muggles”, and the fact that this pride is unjustified is the reason that Wheaton feels like an imposter. He feels like an imposter because he is an imposter.\nHigher-than-average intelligence doesn’t make you any better than anyone else, any more than being taller, or faster, or stronger does. What it often does, however, is allow others to convince you that you should be something different than you are, or than you want to be. Even worse, it gives you the ability to successfully rationalize away your failures, to both yourself and others. Thus are created the Secret Kings who never, ever lose to anyone at anything, and yet feel like failures and imposters all the same.\nOne thing I’ve noticed about all these people with broken minds is that none of them ever seem to have played sports. None of them seems to know what it is like to try your hardest, play your very best, and still fall short. None of them seems to have known the security of winning the respect and approval of an opponent. Thus, they are always attempting to fill the hole of insecurity in their souls through various means that can never do so.\nThey also tend to be vehemently irreligious, which again tends to go back to pride.\nSo, if you have a broken mind, if you feel anxious and insecure, if you feel like an imposter, I have two pieces of advice.\n1. Humble yourself before God.\n2. Give Man the opportunity to humble you.\nI’m not self-confident because I’m smart, or because I’m athletic, or because pretty girls like me, I’m self-confident because I have allowed myself to be tested, repeatedly, and I have passed the tests. The test is\nnot\nwinning. The test is getting up after you are knocked down, being a good sport when you are beaten, meeting rejection with grace, meeting failure with good humor, and accepting your assigned place in the social hierarchy without demur or complaint.\nYou can’t change the past or the present. All you can change is how you approach the vicissitudes of the future.\nWinning feels great. I like to win as anyone else. I’ve won everything from grade school competitions to NCAA Division One conference championships. But even better than winning, in terms of developing self-respect, is having the rival who has beaten you despite your best efforts treat you with respect, as an equal, and above all, as a\nworthy\nopponent.\nAnd I’m not proud of my intelligence because I know what it is worth in comparison to the glory of the Creator and the magnificence of His Creation, which is precisely nothing. It means nothing more than the color of a spot on a dog’s coat or the pattern on a snake’s skin.\nWil Wheaton, on the other hand, has a different solution:\nHere’s what I need you guys to do. I need this entire room of people to make a pact. It’s just us, so what happens here in beautiful downtown San Diego, stays in beautiful downtown San Diego. So here it goes. You are the superheroes we need. But the world doesn’t know it yet. But they will. And something cataclysmic will occur, and the world will cry out, “who will save us?” And I need you to be ready to burst out of the crowd, rip open your shirt to expose your true identity and say proudly, “I’m ready! I am the SUPERHERO YOU NEED!”\nFantastic. Now they’re not just Secret Kings, they’re Secret fucking Superheroes and only these very special snowflakes can save the world.\nNo wonder they feel like imposters. They never stop posturing.",
  "tags": [
    "McRapey",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-14T14:30:00+00:00"
}