{
  "url": "https://voxday.net/2016/07/07/black-iron-gir/",
  "scraped_at": "2025-12-18T01:43:09.136125",
  "title": "Black Iron Girl",
  "date_display": "July 7, 2016",
  "date_iso": "2016-07-07T12:00:00+00:00",
  "date_from_url": "2016-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I actually rather enjoy it when white SJWs <a href=\"http://time.com/4394478/iron-man-riri-williams-tony-stark/\">attempt to write diversity of one sort or another</a>. It’s reliably hilarious how they believe they’re totally pulling it off when they are doing nothing more than writing men with tits, married suburban housewives with penises, or white people with dark skin.<br/></p><blockquote><p> There’s a new Iron Man. Well, Iron Man for now. She’s still working on the name. The events at the end of the comic-book event series Civil War II will result in Tony Stark stepping out of the Iron Man suit and a new character, Riri Williams, taking over, Marvel tells TIME. (Note: Tony’s departure doesn’t mean you know the end to Civil War II yet.)</p><p>Riri is a science genius who enrolls in MIT at the age of 15. She comes to the attention of Tony when she builds her own Iron Man suit in her dorm. Creator and Iron Man writer Brian Michael Bendis spoke exclusively to TIME about the creation of Riri Williams with comic-book artist Stefano Caselli and Marvel’s increasingly diverse cast of characters.</p><p><i>How did you come up with the character of Riri Williams?</i></p><p>One of the things that stuck with me when I was working in Chicago a couple of years ago on a TV show that didn’t end up airing was the amount of chaos and violence. And this story of this brilliant, young woman whose life was marred by tragedy that could have easily ended her life — just random street violence — and went off to college was very inspiring to me. I thought that was the most modern version of a superhero or superheroine story I had ever heard. And I sat with it for awhile until I had the right character and the right place.</p><p>As we’ve been slowly and hopefully very organically adding all these new characters to the Marvel Universe, it just seemed that sort of violence inspiring a young hero to rise up and act, and using her science acumen, her natural-born abilities that are still raw but so ahead of where even Tony Stark was at that age, was very exciting to me.</p></blockquote><p>One presumes <strike>Rihanna</strike>Riri – even the name comes from the writer’s extensive knowledge of African-American culture; I’m only surprised it wasn’t Beyonce –  must be exceptionally intelligent, considering that she’s been able to fund her technologically advanced R&amp;D with an EBT card.</p><p>I’m looking forward to the plot twist when, like her real-world predecessor, Riri drops out of both MIT and the Avengers in order to work as a stripper.</p><p>From Twitter:<br/></p><blockquote><p> Supreme Dark Lord @voxday<br> If the comics imitated life, Riri aka Black Iron Girl would drop out of both MIT and the Avengers to work as a stripper in Atlanta. #IronMan</br></p><p>A ‏@atmaybury<br> If @voxday was a halfway competent author, he wouldn’t have to run his own vanity press.</br></p><p>Supreme Dark Lord @voxday<br> That “vanity press” is on track to become the largest publisher in science fiction. The Hugos were just a warning shot.</br></p></blockquote><p>We are going to have some very interesting announcements around the end of the month. And I have no doubt that when Castalia passes up the twitching corpse of Tor Books, the event will serve as a tribute to what can be described, at the very least, my <i>competence</i> as well as my vanity.</p></div>",
  "content_text": "I actually rather enjoy it when white SJWs\nattempt to write diversity of one sort or another\n. It’s reliably hilarious how they believe they’re totally pulling it off when they are doing nothing more than writing men with tits, married suburban housewives with penises, or white people with dark skin.\nThere’s a new Iron Man. Well, Iron Man for now. She’s still working on the name. The events at the end of the comic-book event series Civil War II will result in Tony Stark stepping out of the Iron Man suit and a new character, Riri Williams, taking over, Marvel tells TIME. (Note: Tony’s departure doesn’t mean you know the end to Civil War II yet.)\nRiri is a science genius who enrolls in MIT at the age of 15. She comes to the attention of Tony when she builds her own Iron Man suit in her dorm. Creator and Iron Man writer Brian Michael Bendis spoke exclusively to TIME about the creation of Riri Williams with comic-book artist Stefano Caselli and Marvel’s increasingly diverse cast of characters.\nHow did you come up with the character of Riri Williams?\nOne of the things that stuck with me when I was working in Chicago a couple of years ago on a TV show that didn’t end up airing was the amount of chaos and violence. And this story of this brilliant, young woman whose life was marred by tragedy that could have easily ended her life — just random street violence — and went off to college was very inspiring to me. I thought that was the most modern version of a superhero or superheroine story I had ever heard. And I sat with it for awhile until I had the right character and the right place.\nAs we’ve been slowly and hopefully very organically adding all these new characters to the Marvel Universe, it just seemed that sort of violence inspiring a young hero to rise up and act, and using her science acumen, her natural-born abilities that are still raw but so ahead of where even Tony Stark was at that age, was very exciting to me.\nOne presumes\nRihanna\nRiri – even the name comes from the writer’s extensive knowledge of African-American culture; I’m only surprised it wasn’t Beyonce –  must be exceptionally intelligent, considering that she’s been able to fund her technologically advanced R&D with an EBT card.\nI’m looking forward to the plot twist when, like her real-world predecessor, Riri drops out of both MIT and the Avengers in order to work as a stripper.\nFrom Twitter:\nSupreme Dark Lord @voxday\nIf the comics imitated life, Riri aka Black Iron Girl would drop out of both MIT and the Avengers to work as a stripper in Atlanta. #IronMan\nA ‏@atmaybury\nIf @voxday was a halfway competent author, he wouldn’t have to run his own vanity press.\nSupreme Dark Lord @voxday\nThat “vanity press” is on track to become the largest publisher in science fiction. The Hugos were just a warning shot.\nWe are going to have some very interesting announcements around the end of the month. And I have no doubt that when Castalia passes up the twitching corpse of Tor Books, the event will serve as a tribute to what can be described, at the very least, my\ncompetence\nas well as my vanity.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-07T11:00:00+00:00"
}