{
  "url": "https://voxday.net/2016/07/26/conservatism-in-ruins/",
  "scraped_at": "2025-12-18T01:46:00.436052",
  "title": "Conservatism in ruins",
  "date_display": "July 26, 2016",
  "date_iso": "2016-07-26T18:12:00+00:00",
  "date_from_url": "2016-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Andrew Klavan’s first thoughts <a href=\"https://pjmedia.com/andrewklavan/2016/07/24/first-thoughts-on-rebuilding-conservatism/?singlepage=true\">on rebuilding conservatism</a>:</p><blockquote class=\"tr_bq\"><p> The conservative movement has collapsed and is in ruins. Its vehicle for political expression, the Republican Party, is now in the hands of an authoritarian nationalist who has never read the Constitution and does not believe in free expression, free trade or the separation of powers. Its central vehicle for expression in the news media is in disarray as Fox News becomes embroiled in scandal. Even its defenders on talk radio and in the blogosphere are severely at odds as they are forced to choose whether to defend Trump as the lesser of two evils or to stand fast with the founding fathers against both terrible sides.</p></blockquote><p>The conservative movement has collapsed and lies in ruins. And it has done so due to the deceit and dishonesty of conservative commentators like Andrew Klavan, who apparently feel the need to make provably false statements about everyone from Donald Trump to the Founding Fathers.</p><p>Let’s look at the three false statements in this one diagnostic paragraph alone:</p><ol><li>Donald Trump is not an authoritarian.</li><li>Fox News has never been a central vehicle for expressing conservative views. It has, rather, pushed neoconnery as nominal conservatism while serving as a politically moderate alternative to the hard progressivism of the ABCNNBCBS cabal.</li><li>The Founding Fathers believed in trade protectionism and a white America. Whether he gives a damn about the US Constitution or not, Donald Trump has as much or more in common with the Founding Fathers as the conservative movement does. The Constitution exists only to safeguard the unalienable rights of white Americans who are the posterity of the Founding Fathers, that is its sole purpose.</li></ol><div> Now let’s look at Klavan’s proposal for rebuilding conservatism, which strangely enough, he provides without ever considering just why the movement is in ruins.</div><blockquote class=\"tr_bq\"><p> 1. There is no substitute for victory. A political philosophy should be an outgrowth of moral values but it is not a moral value in itself. Its purpose is not to be good; its purpose is to be as good as it can be and still win power. A Christian may count it a victory when he is devoured by lions for his faith, but a conservative who is repeatedly devoured by the opposition in elections is just a self-satisfied schmuck. I am completely opposed to those — like Ross Douthat and Reihan Salam — who essentially argue  that conservatives must win by becoming watered-down liberals. But clearly, the methods by which we have been selling our philosophy to the voters have not just failed but failed utterly, and we should rethink them.</p></blockquote><div> True enough, and yet Klavan observably knows so little about the history of conservatism in America that he doesn’t understand that conservatives have never had a philosophy proper. He obviously hasn’t read Russell Kirk, anyhow. That’s why they can’t sell conservatism to anyone anymore; it doesn’t even exist as a coherent self-contained philosophy. Conservatives have never been much more than philosophical parasites on the Left. Klavan should read <i>Cuckservative</i>; if nothing else it would bring him up to speed on the intellectual inadequacies of conservatism.</div><blockquote class=\"tr_bq\"><p> 2. Win what minority types we can with the truth. The opposition likes to point out that too many conservatives are white men. They’re right — but only because blacks and women have been successfully sold a destructive bill of goods in leftist racialism and feminism. The facts are: black people are not oppressed by the police, women are not underpaid for the same work, white privilege is a destructive and racist myth, and true freedom means people you don’t like are going to say things you disagree with in ways you find offensive. These are hard sayings but they need to be said, and they don’t need to be said by conservatives to other conservatives, they need to be said by conservatives to blacks, women and sexual off-beats of all stripes. The Democrats have co-opted these people with destructive lies that make their lives worse. We can’t win them back by jumping on that bandwagon. We need to proudly, unapologetically (and politely) tell it like it is — to them, in their neighborhoods and organizations. We won’t win a lot of them. Not at first. But facts have a way of getting through over time — if you speak them courageously without being a jackass about it.</p></blockquote><div> This is remarkable. And it’s a tactic doomed to failure; conservatives like Klavan can’t win anyone with the truth for the obvious reason that <i>they don’t know the truth</i>. They religiously subscribe to the idiotic lie of the Proposition Nation and they attempt to win over minorities that will never, ever, be won over in significant percentages by the alien ideals of 18th century whites. Klavan can’t explain historical anomalies that puncture his precious Ellis Island myth like the 1790 Naturalization Act, which means he can’t tell it like it is because he doesn’t actually know what it is.<p>The alternative is that he does know what it is and he is knowingly deceiving his fellow conservatives. But I will give him the benefit of the doubt and assume he is merely ignorant.</p></div><blockquote class=\"tr_bq\"><p> 3. Fight the culture wars in the culture. The culture wars are problematical because too often conservatives come across as anti-freedom or bigoted. That makes victory tough. I feel passionately about some cultural issues and indifferent to others, but I believe all of them should be fought on a cultural and informational level rather than a political one. For instance, I believe that abortion is the taking of a human life and that government therefore has a right to forbid it. But just speaking bluntly and honestly, I don’t think I can win that fight in the political arena right now. Happily, the truth may do what politics cannot. The truth is on my side and the more the truth gets out about what abortion looks like, how it’s done, and who the people who support it are, the more the public will know that it is unacceptable. Then we can win politically. As for sex issues, I confess I care not at all about other people’s sexuality (I’m so deeply immersed in my own), but I do care very deeply about religious liberty and the freedom not to participate in what you abhor. That’s a fight we can win and we should argue it everywhere as a freedom issue.</p></blockquote><p>Correct concept, inept execution. Winning the culture war is NOT getting the truth out. It is rhetorically convincing others what the truth is. This is why the arts are the most vitally important battleground in the cultural war.</p><blockquote class=\"tr_bq\"><p> 4. Some class occasionally would be nice. Conservatives have been all but banned from universities, the news media and show business. In response, we formed our own media in blogs, talk radio and Fox. Those are great venues for informing our own, but we could use some outreach to open-minded Democrats. I’ve wasted too much breath trying to convince conservatives that art is good and can change the world over time. They just won’t believe me. But could we maybe agree that screaming at people and calling them evil and talking like a belligerent loudmouth know-it-all is not always the best way to bring them over to your side? No, huh. Well, it was just a thought.</p></blockquote><p>For fuck’s sake. He’s another hapless tone policeman. This is why the Alt Right is going to win; because we don’t give a quantum of a damn about “class”. Someone once told me the important thing was “to win with grace and style”. No, the important thing <i>is to win, even if you have to get bloody and dirty in the process. </i>Klavan, like a good conservative, is far more interested in going down to noble defeat and surrendering while wearing a nice clean uniform than he is with winning.</p><blockquote class=\"tr_bq\"><p> It very much looks to me right now as if Trump is going to lose this election on pure incompetence and mean spirit. That might actually make it easier for conservatives to regroup in the ruins of the Republican Party. If he wins, we may need a new party of our own. But whichever way things go, I think we need to open a discussion about how conservatives can not only remain conservative but also win elections in modern America.</p></blockquote><p>Is he even watching the political conventions? This sort of wishful thinking is why no one should bother paying any attention to a cuckservative like Klavan now or in the future. Conservatism is dying. Its diseased remnants are flocking to the progressives, as we always knew they would. And we watch them go with dry eyes and a grim smile, because we don’t need a bunch of useless cucks and moderates who were always happier shooting at their own side than the enemy.</p><p>I have never been a conservative. I will never be a conservative. I am delighted to see the conservative movement crumbling into dust. Conservatives conserve nothing, accomplish nothing, and stand for nothing. They will not defend the Church, they will not defend America, and they will not defend the West.</p><p>The Alt Right will. Join us, if you have the steel.</p></div>",
  "content_text": "Andrew Klavan’s first thoughts\non rebuilding conservatism\n:\nThe conservative movement has collapsed and is in ruins. Its vehicle for political expression, the Republican Party, is now in the hands of an authoritarian nationalist who has never read the Constitution and does not believe in free expression, free trade or the separation of powers. Its central vehicle for expression in the news media is in disarray as Fox News becomes embroiled in scandal. Even its defenders on talk radio and in the blogosphere are severely at odds as they are forced to choose whether to defend Trump as the lesser of two evils or to stand fast with the founding fathers against both terrible sides.\nThe conservative movement has collapsed and lies in ruins. And it has done so due to the deceit and dishonesty of conservative commentators like Andrew Klavan, who apparently feel the need to make provably false statements about everyone from Donald Trump to the Founding Fathers.\nLet’s look at the three false statements in this one diagnostic paragraph alone:\nDonald Trump is not an authoritarian.\nFox News has never been a central vehicle for expressing conservative views. It has, rather, pushed neoconnery as nominal conservatism while serving as a politically moderate alternative to the hard progressivism of the ABCNNBCBS cabal.\nThe Founding Fathers believed in trade protectionism and a white America. Whether he gives a damn about the US Constitution or not, Donald Trump has as much or more in common with the Founding Fathers as the conservative movement does. The Constitution exists only to safeguard the unalienable rights of white Americans who are the posterity of the Founding Fathers, that is its sole purpose.\nNow let’s look at Klavan’s proposal for rebuilding conservatism, which strangely enough, he provides without ever considering just why the movement is in ruins.\n1. There is no substitute for victory. A political philosophy should be an outgrowth of moral values but it is not a moral value in itself. Its purpose is not to be good; its purpose is to be as good as it can be and still win power. A Christian may count it a victory when he is devoured by lions for his faith, but a conservative who is repeatedly devoured by the opposition in elections is just a self-satisfied schmuck. I am completely opposed to those — like Ross Douthat and Reihan Salam — who essentially argue  that conservatives must win by becoming watered-down liberals. But clearly, the methods by which we have been selling our philosophy to the voters have not just failed but failed utterly, and we should rethink them.\nTrue enough, and yet Klavan observably knows so little about the history of conservatism in America that he doesn’t understand that conservatives have never had a philosophy proper. He obviously hasn’t read Russell Kirk, anyhow. That’s why they can’t sell conservatism to anyone anymore; it doesn’t even exist as a coherent self-contained philosophy. Conservatives have never been much more than philosophical parasites on the Left. Klavan should read\nCuckservative\n; if nothing else it would bring him up to speed on the intellectual inadequacies of conservatism.\n2. Win what minority types we can with the truth. The opposition likes to point out that too many conservatives are white men. They’re right — but only because blacks and women have been successfully sold a destructive bill of goods in leftist racialism and feminism. The facts are: black people are not oppressed by the police, women are not underpaid for the same work, white privilege is a destructive and racist myth, and true freedom means people you don’t like are going to say things you disagree with in ways you find offensive. These are hard sayings but they need to be said, and they don’t need to be said by conservatives to other conservatives, they need to be said by conservatives to blacks, women and sexual off-beats of all stripes. The Democrats have co-opted these people with destructive lies that make their lives worse. We can’t win them back by jumping on that bandwagon. We need to proudly, unapologetically (and politely) tell it like it is — to them, in their neighborhoods and organizations. We won’t win a lot of them. Not at first. But facts have a way of getting through over time — if you speak them courageously without being a jackass about it.\nThis is remarkable. And it’s a tactic doomed to failure; conservatives like Klavan can’t win anyone with the truth for the obvious reason that\nthey don’t know the truth\n. They religiously subscribe to the idiotic lie of the Proposition Nation and they attempt to win over minorities that will never, ever, be won over in significant percentages by the alien ideals of 18th century whites. Klavan can’t explain historical anomalies that puncture his precious Ellis Island myth like the 1790 Naturalization Act, which means he can’t tell it like it is because he doesn’t actually know what it is.\nThe alternative is that he does know what it is and he is knowingly deceiving his fellow conservatives. But I will give him the benefit of the doubt and assume he is merely ignorant.\n3. Fight the culture wars in the culture. The culture wars are problematical because too often conservatives come across as anti-freedom or bigoted. That makes victory tough. I feel passionately about some cultural issues and indifferent to others, but I believe all of them should be fought on a cultural and informational level rather than a political one. For instance, I believe that abortion is the taking of a human life and that government therefore has a right to forbid it. But just speaking bluntly and honestly, I don’t think I can win that fight in the political arena right now. Happily, the truth may do what politics cannot. The truth is on my side and the more the truth gets out about what abortion looks like, how it’s done, and who the people who support it are, the more the public will know that it is unacceptable. Then we can win politically. As for sex issues, I confess I care not at all about other people’s sexuality (I’m so deeply immersed in my own), but I do care very deeply about religious liberty and the freedom not to participate in what you abhor. That’s a fight we can win and we should argue it everywhere as a freedom issue.\nCorrect concept, inept execution. Winning the culture war is NOT getting the truth out. It is rhetorically convincing others what the truth is. This is why the arts are the most vitally important battleground in the cultural war.\n4. Some class occasionally would be nice. Conservatives have been all but banned from universities, the news media and show business. In response, we formed our own media in blogs, talk radio and Fox. Those are great venues for informing our own, but we could use some outreach to open-minded Democrats. I’ve wasted too much breath trying to convince conservatives that art is good and can change the world over time. They just won’t believe me. But could we maybe agree that screaming at people and calling them evil and talking like a belligerent loudmouth know-it-all is not always the best way to bring them over to your side? No, huh. Well, it was just a thought.\nFor fuck’s sake. He’s another hapless tone policeman. This is why the Alt Right is going to win; because we don’t give a quantum of a damn about “class”. Someone once told me the important thing was “to win with grace and style”. No, the important thing\nis to win, even if you have to get bloody and dirty in the process.\nKlavan, like a good conservative, is far more interested in going down to noble defeat and surrendering while wearing a nice clean uniform than he is with winning.\nIt very much looks to me right now as if Trump is going to lose this election on pure incompetence and mean spirit. That might actually make it easier for conservatives to regroup in the ruins of the Republican Party. If he wins, we may need a new party of our own. But whichever way things go, I think we need to open a discussion about how conservatives can not only remain conservative but also win elections in modern America.\nIs he even watching the political conventions? This sort of wishful thinking is why no one should bother paying any attention to a cuckservative like Klavan now or in the future. Conservatism is dying. Its diseased remnants are flocking to the progressives, as we always knew they would. And we watch them go with dry eyes and a grim smile, because we don’t need a bunch of useless cucks and moderates who were always happier shooting at their own side than the enemy.\nI have never been a conservative. I will never be a conservative. I am delighted to see the conservative movement crumbling into dust. Conservatives conserve nothing, accomplish nothing, and stand for nothing. They will not defend the Church, they will not defend America, and they will not defend the West.\nThe Alt Right will. Join us, if you have the steel.",
  "tags": [
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-26T17:12:00+00:00"
}