{
  "url": "https://voxday.net/2016/07/02/converged-from-botto/",
  "scraped_at": "2025-12-18T01:42:32.456449",
  "title": "Converged from the bottom",
  "date_display": "July 2, 2016",
  "date_iso": "2016-07-02T09:43:00+00:00",
  "date_from_url": "2016-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lest you think I exaggerated when I described <a href=\"http://bookriot.com/2016/06/30/i-was-one-of-the-interns-reading-your-lit-journal-submissions/\">the SJW-converged state of publishing</a> in my latest appearance on Stefan Molyneaux’s podcast:</p><blockquote class=\"tr_bq\"><p> I struggled with rejections, too. Not because I feared crushing someone’s literary dreams (I had faith you’d be okay) but because we were asked to send personalized rejections for promising but still lacking work. There were four templates for rejection: 1) form rejection, 2) I liked a, b, and c but no. Go ahead and submit more work if you want,  3) Wow so close, but not quite. Definitely send us more work though, and 4) I loved this so much that I’m writing a response from scratch instead of inserting my thoughts into a pre-written paragraph, but unfortunately no *frowny face*.  We left #4 to the editors.</p><p>Like the nonexistent length requirements, this take on rejecting work is great for writers. I loved it until I realized it’s way easier to send a form rejection than come up with even a personalized one. Even submissions I loved ended up getting a form rejection after a week trying to convey my appreciation while still saying no. We had to be careful about this because we didn’t want to say something dumb or be too encouraging and have someone resend a piece with whatever corrections we’d accidentally proposed.</p><p>Moving things toward acceptance wasn’t much easier. We passed work we liked to another intern. If that intern liked it, they passed it to another intern. And if they liked it, one of the editors got it and made the final call. So it mattered little, dear author, if I thought your work was a masterpiece. A second or third reader who disagreed could kill it as easily as an editor. Once I got a submission that I thought was a great commentary on race, and another intern dismissed it because she didn’t see the “thematic relevance” – a very annoying phrase uttered so many times it ceased to have meaning.</p><p>I’m sure I annoyed other interns with this, too. Like when I said no to a piece on gentrification in NYC ( two other interns loved it) because its white dude perspective killed its otherwise stellar structure and language for me. I did the same with other pieces that were good except for their sexism or racism or *insert other -ism here*.</p></blockquote><p>Slush reading is a necessary evil for all publishers; Castalia House now have sufficient admissions that we need to extend our one-month review policy to three months. Also, we will <i>not</i> provide any comments or advice on a submission, as Castalia House is a publisher, not a writer’s workshop. However, we have no SJWs involved in the process and your work will be given a fair shake so long as you are not an SJW yourself and your work is not Pink SF or some other SJW strain. We have a “kill-on-sight” policy with regards to SJW-related submissions.</p><p>Hhowever, I will say that in my experience, far too many would-be writers are far too eager to submit what is clearly incomplete, unpolished, and unoriginal work. If you haven’t even demonstrated that you have the discipline to finish a single novel, the chances that anyone is going to be so blown away by the talent demonstrated or the ideas presented in your unfinished work that they will leap to sign it is remote, to put it mildly. And not being Hollywood, Castalia is really not interested in the X meets Y formula. Do something <i>original</i>. And if you can’t do that, you’d better do something great (John C. Wright, Owen Stanley), something genuinely classic (Jerry Pournelle, Rod Walker), or something world-class (Martin van Creveld, William Lind, David the Good.)</p><p>Most writers, and I include myself in this, simply don’t put in the time and effort that even the second-rate successes like George R.R. Martin do. And no one these days goes to the lengths of a Tolkien or an Eco, both world-class academic specialists in fields intimately related to their writing. One reason that <i>The Missionaries</i> is such a stand-out novel is that Owen Stanley not only has first-hand knowledge of “Elephant Island”, he quite clearly knows the Moroks very, very well.</p><p>At this point, the very best thing you can do to get published these days is to either a) become famous or b) develop a large Twitter following. I am reliably informed, by a VERY inside publishing industry insider, that the major publishers are increasingly disinterested in the content of the books they are signing, and their primary concern is the social media outreach of the author. This is not true of Castalia House, of course, as we are getting even more selective about the content we publish.</p><p>As I’ve said before, if there is no sound reason to believe your work has the probability of being a category bestseller, Castalia probably will not publish it. <i>The Missionaries</i> is the first debut novel we have published, <i>Loki’s Child</i> will be the second, and both of them are manifestly not your average genre novel. We are more interested in quality than we are in staying in our genre lane. While we won’t reject your novel because it doesn’t conform to the SJW Narrative, that’s not sufficient reason to publish it either.</p><p>Meanwhile, Barry Malzberg makes it clear that some women <a href=\"https://web.archive.org/web/20160508174111/http://www.galaxysedge.com/mmal.htm\">have always been bent on destroying science fiction</a>.</p><blockquote class=\"tr_bq\"><p> Judith Merril (1920-1997) had big ideas in the 1950s: she was going to take down all of the barriers between what she called the science fiction “ghetto” and the “mainstream.” She was going to prove that the barriers were artificially constructed and made no sense.</p><p>We were living in a science fiction world: Frederik Pohl and Cyril M. Kornbluth had proved that on the social register. And Hiroshima, Nagasaki, and Sputnik demonstrated that this was not a sick little genre for (what Isaac Asimov called) “crazy kids.”</p><p>She embarked upon her campaign, writing book reviews (she eventually became <i>Fantasy &amp; Science Fiction</i>‘s regular reviewer) and inaugurating her <i>Annual Best SF</i> series in 1957, which was taken on by Dell for mass market and which became immediately the most significant and influential of all the annuals. She wrote pandering introductions to stories by Russell Baker and Jorge Luis Borges reprinted in her annuals, arguing that they proved that literary figures and New York Times columnists were writing the stuff just as well or better as the hacks in Astounding and Galaxy.</p><p>She persuaded Anthony Boucher (who had his own shaky and ambivalent fix on the field) that everything was science fiction. And Boucher hired Arthur Jean Cox to write an ongoing movie column in which he noted that the musical Li’l Abner was hard-core science fiction. Her columns in Fantasy &amp; Science Fiction disdained or ignored category publications as largely hackwork, and she used the space to dismiss almost all of it and surely to propagate the British New Wave writers who were really shaking the earth and changing everything. That led to her commercially disastrous Doubleday anthology <i>England Swings!</i> SF, which Donald A. Wollheim, who published the paperback, told me was the worst-selling Ace paperback in history. This is just part of what the former Josephine Grossman was doing in the critical period 1955-1968 after she had essentially written finis to her career as a fiction writer; but it was quite enough to get the job done. A decent writer and a highly intelligent person, she did the field more damage than Raymond Palmer or Roger Corman, Ed Earl Repp or Ed Wood. The field certainly survived, it had demonstrated the pre-Lucas capacity to survive anything, but it was irreversibly damaged.</p><p>It was irreversibly damaged because Merril’s influence in those years was great, and she was on a methodical, hardly understated campaign to tear down the walls and destroy the category. As a failed mainstream writer who had essentially been rescued by her friends Theodore Sturgeon and Philip J. Klass, and pointed toward commercial writing, Merril was determined to find another way into the mainstream. And if that involved rupturing or destroying science fiction, well, that would be collateral damage.</p><p>I had a little of this syndrome myself—like Merril I came to science fiction in my mid-twenties as a failed angry quality lit writer. But I never forgot that science fiction had essentially rescued me, that <i>Final War</i> which had been deemed “too grimly realistic” for The Hudson Review and condescendingly bounced had been taken by Edward L. Ferman, and in that simple act he had saved my creative life, and I was grateful. I was not contemptuous of science fiction or anxious to pummel the misshapen but occasionally beautiful field of literature because it was a means of default. Rather, I was grateful and having read a great deal in the genre at a formative time (so had Merril) I knew that it was a legitimate brand of literature which was being screwed mercilessly by the academy and the quality lit gatekeepers and spirits. Their casual contempt (like the contempt of the Hudson Review) infuriated me and still does. But I never blamed science fiction for what the larger culture had done to it. Merril did. Merril was the kind of liberal who in different circumstances would blame James Baldwin and Cassius Clay for bad manners, for giving their people a bad name.</p></blockquote><p>The SF-SJWs are, of course, furious about this, as they always are when their dreadful behavior is revealed. They want to bury the past and pretend that the present is as it is for no reason beyond inevitable Progress. And it is all too typical of SJW entryism that a woman who hated science fiction would position herself as the arbiter of what was best in the field.</p><p>Which, of course, is how we eventually ended up with dreadful schlock like <i>Redshirts</i> and “The Rain That Falls On You If You’re Gay” and “If You Weren’t Beaten Into a Coma By Political Stand-ins For the Mean Girls Who Called Me Fat in High School, My Love” being deemed the best science fiction has to offer. Just the title of “Space Raptor Butt Invasion” is more thoughtful and entertaining than the sum total of those three award-winning works.</p><p>Also amusing is the protests of the SJWs. “But consider all her contributions to the field!” they cry. That’s the point and that’s also the problem. She did contribute a lot, and those contributions were negative and damaging to the field of science fiction. None of this really matters, though, as the SJW-converged world of mainstream SF is a dying one, and a new world, in which Castalia House is going to be a powerful force, is rising to take its place.</p><p>Thanks to you, June was another record month for Castalia House. Thanks to you, June was another record month of traffic for VP. Thanks to you, our hot new releases and category bestsellers have brought us to the attention of much larger companies who are extremely interested in working with us. Thanks to you, our productive capacities have expanded. Thanks to you, top authors are starting to work with us.</p><p>Thanks to you, the turbo-boosters are being fitted. Buckle up.</p></div>",
  "content_text": "Lest you think I exaggerated when I described\nthe SJW-converged state of publishing\nin my latest appearance on Stefan Molyneaux’s podcast:\nI struggled with rejections, too. Not because I feared crushing someone’s literary dreams (I had faith you’d be okay) but because we were asked to send personalized rejections for promising but still lacking work. There were four templates for rejection: 1) form rejection, 2) I liked a, b, and c but no. Go ahead and submit more work if you want,  3) Wow so close, but not quite. Definitely send us more work though, and 4) I loved this so much that I’m writing a response from scratch instead of inserting my thoughts into a pre-written paragraph, but unfortunately no *frowny face*.  We left #4 to the editors.\nLike the nonexistent length requirements, this take on rejecting work is great for writers. I loved it until I realized it’s way easier to send a form rejection than come up with even a personalized one. Even submissions I loved ended up getting a form rejection after a week trying to convey my appreciation while still saying no. We had to be careful about this because we didn’t want to say something dumb or be too encouraging and have someone resend a piece with whatever corrections we’d accidentally proposed.\nMoving things toward acceptance wasn’t much easier. We passed work we liked to another intern. If that intern liked it, they passed it to another intern. And if they liked it, one of the editors got it and made the final call. So it mattered little, dear author, if I thought your work was a masterpiece. A second or third reader who disagreed could kill it as easily as an editor. Once I got a submission that I thought was a great commentary on race, and another intern dismissed it because she didn’t see the “thematic relevance” – a very annoying phrase uttered so many times it ceased to have meaning.\nI’m sure I annoyed other interns with this, too. Like when I said no to a piece on gentrification in NYC ( two other interns loved it) because its white dude perspective killed its otherwise stellar structure and language for me. I did the same with other pieces that were good except for their sexism or racism or *insert other -ism here*.\nSlush reading is a necessary evil for all publishers; Castalia House now have sufficient admissions that we need to extend our one-month review policy to three months. Also, we will\nnot\nprovide any comments or advice on a submission, as Castalia House is a publisher, not a writer’s workshop. However, we have no SJWs involved in the process and your work will be given a fair shake so long as you are not an SJW yourself and your work is not Pink SF or some other SJW strain. We have a “kill-on-sight” policy with regards to SJW-related submissions.\nHhowever, I will say that in my experience, far too many would-be writers are far too eager to submit what is clearly incomplete, unpolished, and unoriginal work. If you haven’t even demonstrated that you have the discipline to finish a single novel, the chances that anyone is going to be so blown away by the talent demonstrated or the ideas presented in your unfinished work that they will leap to sign it is remote, to put it mildly. And not being Hollywood, Castalia is really not interested in the X meets Y formula. Do something\noriginal\n. And if you can’t do that, you’d better do something great (John C. Wright, Owen Stanley), something genuinely classic (Jerry Pournelle, Rod Walker), or something world-class (Martin van Creveld, William Lind, David the Good.)\nMost writers, and I include myself in this, simply don’t put in the time and effort that even the second-rate successes like George R.R. Martin do. And no one these days goes to the lengths of a Tolkien or an Eco, both world-class academic specialists in fields intimately related to their writing. One reason that\nThe Missionaries\nis such a stand-out novel is that Owen Stanley not only has first-hand knowledge of “Elephant Island”, he quite clearly knows the Moroks very, very well.\nAt this point, the very best thing you can do to get published these days is to either a) become famous or b) develop a large Twitter following. I am reliably informed, by a VERY inside publishing industry insider, that the major publishers are increasingly disinterested in the content of the books they are signing, and their primary concern is the social media outreach of the author. This is not true of Castalia House, of course, as we are getting even more selective about the content we publish.\nAs I’ve said before, if there is no sound reason to believe your work has the probability of being a category bestseller, Castalia probably will not publish it.\nThe Missionaries\nis the first debut novel we have published,\nLoki’s Child\nwill be the second, and both of them are manifestly not your average genre novel. We are more interested in quality than we are in staying in our genre lane. While we won’t reject your novel because it doesn’t conform to the SJW Narrative, that’s not sufficient reason to publish it either.\nMeanwhile, Barry Malzberg makes it clear that some women\nhave always been bent on destroying science fiction\n.\nJudith Merril (1920-1997) had big ideas in the 1950s: she was going to take down all of the barriers between what she called the science fiction “ghetto” and the “mainstream.” She was going to prove that the barriers were artificially constructed and made no sense.\nWe were living in a science fiction world: Frederik Pohl and Cyril M. Kornbluth had proved that on the social register. And Hiroshima, Nagasaki, and Sputnik demonstrated that this was not a sick little genre for (what Isaac Asimov called) “crazy kids.”\nShe embarked upon her campaign, writing book reviews (she eventually became\nFantasy & Science Fiction\n‘s regular reviewer) and inaugurating her\nAnnual Best SF\nseries in 1957, which was taken on by Dell for mass market and which became immediately the most significant and influential of all the annuals. She wrote pandering introductions to stories by Russell Baker and Jorge Luis Borges reprinted in her annuals, arguing that they proved that literary figures and New York Times columnists were writing the stuff just as well or better as the hacks in Astounding and Galaxy.\nShe persuaded Anthony Boucher (who had his own shaky and ambivalent fix on the field) that everything was science fiction. And Boucher hired Arthur Jean Cox to write an ongoing movie column in which he noted that the musical Li’l Abner was hard-core science fiction. Her columns in Fantasy & Science Fiction disdained or ignored category publications as largely hackwork, and she used the space to dismiss almost all of it and surely to propagate the British New Wave writers who were really shaking the earth and changing everything. That led to her commercially disastrous Doubleday anthology\nEngland Swings!\nSF, which Donald A. Wollheim, who published the paperback, told me was the worst-selling Ace paperback in history. This is just part of what the former Josephine Grossman was doing in the critical period 1955-1968 after she had essentially written finis to her career as a fiction writer; but it was quite enough to get the job done. A decent writer and a highly intelligent person, she did the field more damage than Raymond Palmer or Roger Corman, Ed Earl Repp or Ed Wood. The field certainly survived, it had demonstrated the pre-Lucas capacity to survive anything, but it was irreversibly damaged.\nIt was irreversibly damaged because Merril’s influence in those years was great, and she was on a methodical, hardly understated campaign to tear down the walls and destroy the category. As a failed mainstream writer who had essentially been rescued by her friends Theodore Sturgeon and Philip J. Klass, and pointed toward commercial writing, Merril was determined to find another way into the mainstream. And if that involved rupturing or destroying science fiction, well, that would be collateral damage.\nI had a little of this syndrome myself—like Merril I came to science fiction in my mid-twenties as a failed angry quality lit writer. But I never forgot that science fiction had essentially rescued me, that\nFinal War\nwhich had been deemed “too grimly realistic” for The Hudson Review and condescendingly bounced had been taken by Edward L. Ferman, and in that simple act he had saved my creative life, and I was grateful. I was not contemptuous of science fiction or anxious to pummel the misshapen but occasionally beautiful field of literature because it was a means of default. Rather, I was grateful and having read a great deal in the genre at a formative time (so had Merril) I knew that it was a legitimate brand of literature which was being screwed mercilessly by the academy and the quality lit gatekeepers and spirits. Their casual contempt (like the contempt of the Hudson Review) infuriated me and still does. But I never blamed science fiction for what the larger culture had done to it. Merril did. Merril was the kind of liberal who in different circumstances would blame James Baldwin and Cassius Clay for bad manners, for giving their people a bad name.\nThe SF-SJWs are, of course, furious about this, as they always are when their dreadful behavior is revealed. They want to bury the past and pretend that the present is as it is for no reason beyond inevitable Progress. And it is all too typical of SJW entryism that a woman who hated science fiction would position herself as the arbiter of what was best in the field.\nWhich, of course, is how we eventually ended up with dreadful schlock like\nRedshirts\nand “The Rain That Falls On You If You’re Gay” and “If You Weren’t Beaten Into a Coma By Political Stand-ins For the Mean Girls Who Called Me Fat in High School, My Love” being deemed the best science fiction has to offer. Just the title of “Space Raptor Butt Invasion” is more thoughtful and entertaining than the sum total of those three award-winning works.\nAlso amusing is the protests of the SJWs. “But consider all her contributions to the field!” they cry. That’s the point and that’s also the problem. She did contribute a lot, and those contributions were negative and damaging to the field of science fiction. None of this really matters, though, as the SJW-converged world of mainstream SF is a dying one, and a new world, in which Castalia House is going to be a powerful force, is rising to take its place.\nThanks to you, June was another record month for Castalia House. Thanks to you, June was another record month of traffic for VP. Thanks to you, our hot new releases and category bestsellers have brought us to the attention of much larger companies who are extremely interested in working with us. Thanks to you, our productive capacities have expanded. Thanks to you, top authors are starting to work with us.\nThanks to you, the turbo-boosters are being fitted. Buckle up.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-02T08:43:00+00:00"
}