{
  "url": "https://voxday.net/2016/07/10/democracy-debate-part-1/",
  "scraped_at": "2025-12-18T01:43:33.000896",
  "title": "Democracy debate part 1",
  "date_display": "July 10, 2016",
  "date_iso": "2016-07-10T12:00:00+00:00",
  "date_from_url": "2016-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i><a href=\"http://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=2502636\">Konrad Razumovsky</a> challenged me to a debate in response to my contention that direct democracy is superior to representative democracy. This is his initial statement.</i></p><p><b>“My opinion, as I have previously expressed, is that the problems of “mob rule” of which the Founders so famously warned have proven to be considerably fewer and less problematic than the problems of establishing a political elite that uses the illusion of democratic approval as a protective shield. Now that technology makes it viable for larger polities, direct democracy is a moral imperative in any society with a government that is justified by the will of the people.”</b><br>—Vox Day</br></p><p>For the purposes of this, I am using a slightly modified version of the definition of democracy from Merriam-Webster: a democracy is “a form of government in which the people choose leaders, or specific laws, by voting”.</p><p>I do grant, and cannot reasonably dispute the following: one, representative democracies or democratic republics do limit the impact of the will of the people, by intention or accident is irrelevant; two, the most dangerous thing for a nation, in the long run, is a political elite which is divorced from the common man, a political elite who believe they are justified and also able to sell their chicanery to said common man with a gross misrepresentation of the intent of a particular government; third—and finally, technology does many exceptional things, with respect to man’s ability to influence his condition including the methods by which government can be built.  That said, I have no real issue with direct democracy in theory, or in practice, but I am forced to dispute the implicit claim that a democracy is an appropriate form of government for a larger scale polity, with or without technological intervention and irrespective of its moral gravity.  That is to say that a direct democracy has a number of internal issues which render it ineffective, if not outright detrimental, to a civilization of a certain size.  Briefly, these are: one, no amount of technological development is equal to the task of preventing the poor use thereof; two, democracies derive their legitimacy from the collective people of the nation, which would be fine if governments existed to care for the people, which they do not; three, economics applies to voting just as much as everything else; fourth—and finally, though mob rule is, indeed, a historical falsity, something very similar to it does exist and is exactly the thing which placed the silly political elite into power in the current era.  There will then need to be some minor legwork done on historic democracies to determine if the theoretical framework matches the practice.</p><p>While it must be admitted by all reasonable men that modern information based technology has certainly made it possible for a democracy to function on a scale significantly larger than previously possible, in terms of both geography and population, these advances do little to address the frailty of the ballot box.  In the more traditional rendition of a democracy, there are legions of little vote counters who, being human, can each be induced by their own ideologies or the machinations of others to forget or misplace certain votes; there are instances of the dearly departed or even pets casting votes; and there is one supreme holder of the ballots who could, were he so inclined, read a different name than the one at the top of the chart.  I freely admit that technology removes the human element from these scenarios, the vote counters are machines who are incorruptible by their own bias and cannot be blackmailed; a machine is compelled to follow its programming regarding the necessary certification that a particular voter is eligible to cast such a vote, thereby reducing the rate at which Spot or Aunt Mildred interferes with mortal affairs; and a machine is honest about who is where on the final printout. </p><p><a name=\"more\"></a><br> All of this rests on the assumption that the machine(s) administering the vote enjoy a state of being free of that kind of harassment designed to cause a shift in the eventual outcome of the vote being so administered.  Obviously, direct and physical tampering with these Democratic Servers is undesirable, so steps must be taken to remove the possibility of such.  I see two feasible solutions: one, the voting process may be moved entirely to the cloud, divorcing it from a physical existence; or two, the physical Democratic Servers must be fiercely protected against intrusions.  The problem with the first is that everyone on the planet would have access to the voting system, regardless of the level of authentication required to vote, a machine is only a machine—it is easily fooled by anyone with sufficient knowledge of the systems which compose it.  In other words, the account security for these voting systems would need to be impregnable, not only from foreign agents, but also from those running for office.  Due to the grand and illustrious history of impregnable vaults being busted, unsinkable ships being sunk, irrefutable evidence being refuted, and unstoppable armies being crushed, it strikes me as a point of absurdity to assume that any such system built today will last any serious amount of time.</br></p><p>The solution to this seems simple enough: just appoint a certain group, a set of experts—if you will, to continually update the security protocols.  Of course, this puts the entire democracy at the mercy of these programmers for its integrity, which undermines the entire point of a democracy in the first place, in that the government is derived by the will of the people.  We would be better off simply making the computer programmers the oligarchs of the new world order from the get-go to avoid all of the inevitable build up to that point.  Which leaves the second option: defending the physical counting machine.  This is also a doomed scenario because the defenders of the machine become like the programmers in the first scenario, able to unaccountably pick and choose what inputs the machine receives thereby determining the outcome.  Ultimately, this is not a new problem: every democratic system, above a certain size, will have a praetorian guard of some sort.  None of which is meant to say that technology has no place in a democracy, simply that technology does not solve the problem of the concentration of political power into the hands of a few over time.  So, to put a finer point on it, technology does not preclude in any way, shape, or form the establishment of a political elite who use the illusion of democratic approval as a protective shield, either as the wielders of legislative or executive powers.</p><p>Strip away every piece of government and political theory, until the very first portion of it is obvious, and we will see that government cares precisely not at all about the people under it because they are not its purpose and concern, in the West at any rate.  This singular purpose is the recording of property beyond that which is unquestionably within an arbitrary individual’s control.  Indeed, the entire function of government is to provide the threat of violence necessary to keep the integrity of property lines.  I could go into considerable detail regarding this facet of government, but this is neither the time nor the place for that.  Suffice it to say that physical property which is too large to conveniently command as an extension of oneself is the thing which demands the fomentation of a government of any variety.  To put it bluntly, a democracy, even if that democracy functions perfectly, places political power in the hands of all living members of a particular society regardless of their standing in terms of property which requires the existence of a government.  If all members of this democracy share a portion of this property, there is no problem as each member of the democracy ultimately has the same interest: the protection of the integrity of property as defined by the legal code enacted by this democracy; if only some members of the democracy enjoy the privileges of property ownership, then there becomes a schism in the end goals of the populace due to one group having property and the other not.  In times past, I would probably feel compelled to simply dismiss this schism as the product of the basest portions of human nature and therefore an ignorable affliction in an enlightened society, however, the past few decades serve as ample evidence that even the mightiest and most careful cultures can be brought low.  The moral standing of property envy is irrelevant at this point, it exists and must be countenanced and thwarted in some more robust manner than an appeal to fragile culture.  Until such a time as men become wholly divorced from their envy and petty jealousies, such that those without strive to achieve the same status as those who by grace have instead of simply using any and all possible leverage—including the use of government force—to deprive the latter group from their holdings, allowing such men, those who do not bear some interest in the ultimate good of the nation—and, by extension, the weight of property, dilutes or undermines the ultimate point of the establishment of a government in the first place.  Therefore, a democracy will eventually destroy itself.</p><p>Economics, the study of rational choice, is most assuredly a matter of concern for the democrat, simply because it is the ideal means by which men do their voting.  Obviously, the hope is for every voting member of a democracy to make his choices rationally, but the decision to vote is, itself, subject to a rational tradeoff.  It is a common observation that a vote in a democracy above a certain size is functionally useless.  A single vote in a nation of one hundred is worth considerably more than a single vote in a country of millions.  Granted, technological advances can make the costs associated with voting, leaving work early, time consumed casting the ballot, among others, much smaller but does little to ensure that a particular vote is actually worth casting in the grander sense.  Consider California, where it is not uncommon to find men of the right choosing not to vote simply because there is no point in doing so.  The analysis by these men is a simple one: there is a significant number of individuals within the State of California, to the point where an individual vote is insignificant, and the vast majority of Californians simply disagree with these right leaning voters.  A callous solution would be to instruct these people to move elsewhere, where their neighbors tend to agree with them, but this is an implicit admission that the discrete vote matters not at all.  Were the large scale democrat to admit that his ideology necessarily ignores the trees for the forest, I would have considerably less of a problem with the whole system of thought as the link between an increase in large scale democracy and the decline of individual rights could be more adequately documented and discussed.  To put it in a slightly more direct way, if a democracy exceeds a certain population threshold, then the democracy ceases to be able to effectively operate in a manner which is consistent with classically liberal thought.</p><p>Mob rule, or the tyranny of the majority, does not exist, in any meaningful form, but its close cousin, let’s call it the tyranny of geography, does.  For example, communities on the edge of the ocean have considerably different concerns than the community on a mountainside.  It would be unreasonable to expect the mountainside community to build houses on stilts to avoid tidal flooding, and the seaside community to have steeply sloped roofs to more effectively shed snowfall.  Such dichotomies can be found everywhere, with certain areas developing a particular solution to a problem which does not exist elsewhere.  Now, geography and climate can certainly cause people to behave differently discretely, but it has not been established that this would impair the ability of the aggregate of such localities to enact an effective democracy.  Indeed, if the total population of the seaside community and the mountainside community are virtually equivalent, then neither party would be able to force every house to have stilts or steep rooves, instead getting what seems not disagreeable to both.  The only problem is that such an arrangement simply does not happen in reality.  Let us examine New York State.  There is a collection of a few cities along the coast which dominate the entire policy of the state despite the rest of the state being of precisely the opposite political affiliation.  In other words, a concentration of people, brought about by geographic concerns, such as the suitability of a particular place to function as a port or commerce hub, may very well have certain governmental needs which do not exist outside of the densely populated areas, a governmental solution which could very easily eliminate the livelihood of these rural or suburban communities, and a democracy places complete authority over these potentially suffocating policies in the hands of those who choose to live in hyper concentrated areas without providing ser<br> ious recourse to those in the boonies.  In a democracy, cities warp the political landscape to their own benefit, sometimes costing the smaller and more numerous communities which share its jurisdiction greatly.  If the wholesale ruination of the nonurban is permissible, then a democracy with a large footprint is acceptable; if not, then democracy must be limited in geographic size.</br></p><p>To briefly reiterate, a successful democracy would be fairly small in size and scale, encompassing a small area geographically and inhabited by a certain, relatively low, number of residents.  Bold claims to be sure, but not without historic precedence: I would draw your attention to both the Iceni tribes of pre-Roman Britain and the Her Majesty’s Privateers of the colonial era.  Both cases are successful democracies, successful in that they enjoyed social stability and developed cultures which further lubricated the systems put in place, with the community placing authority in an individual, either chief or captain, whose concern ensured that the democracy as a whole was benefited.  Should this figure of authority be found wanting, he did not have armies at his disposal to put down a vote of no confidence because his army consisted of his neighbors and friends who had a real interest in the good of the community as a whole.  In short, if the chief or captain failed to perform their duties in an acceptable manner to the people of the democracy, then removing them was an almost trivial matter: the army which did the removing was the army who followed his orders was the people who did the voting.  Of course, these examples merely show that a democracy does work on a local level but fails to evidence an inability of the system to meet the needs of a larger populace, in terms of both raw numbers and territory.  For this, we should investigate the history of Athens which, after having demonstrated its superiority in every possible field to its harshest critic—Plato, quietly fell apart due to internal issues between the various voting groups as these groups matured past their nascence within a few generations.</p><p>None of which quite addresses the most obvious point of a pure democracy: the laws or leaders enjoying the vote.  How precisely does the leader enact his will?  If historic trends are any indication, then a democracy is simply a form of government used to legitimize a dictator.  Does the democracy then choose to be of the form where every proposed law is voted on by the general populace?  If so, then one of two eventualities arise, either: one, the populace appoints, presumably by democratic means, a body of persons who propose laws, which is the establishment of a political elite who are naturally compelled to use their power for their own purposes; or, the laws are crowdsourced in some fashion, which would probably result in charming little laws akin to the naming of certain Antarctic Icebreakers.</p><p>All of these issues combined, or any one of them—really, is sufficient to fully dissuade the serious political philosopher from accepting democracy as some great panacea for the ills of society.  There is a place for democracy, to be sure—as it is very good at what it does under the appropriate circumstances, but its structural integrity is built solely upon its locality.  If a democracy reigns supreme over too large an expanse of people or places, then it will eventually destroy the very livelihood of those different people and places simply due to the nature of the thing.  This is an observation noted by the Founders, and was solved in their day by establishing requirements beyond that of mere life for voters and building the United States Senate upon the legislatures of the various states.  In fact, there was a little war fought over how ineffective these precautions were in thwarting the tendencies of democracies from 1861 to 1865, with numerous potential solutions being offered by one of the sides in that conflict.  More than any other factor, the spread of the belief of the justness of a pure and true democracy has contributed to the decline which is now so apparent throughout the West.  Insisting that more of the same is the solution is to argue that the United States, and nations like it, should cease to be one nation; a perfectly acceptable assertion, to be sure, but very different from the initial conceit of an objectively superior form of government for a nation of any serious size whose government derives its legitimacy from the will of the people.</p><p><i>I will post my response here sometime in the coming weeks, but I will note that Konrad appears to have completely missed the target by attacking the concept of democracy itself instead of defending the superiority of representative democracy to direct democracy. I have no intention whatsoever of defending the core concept of democracy itself, as my argument is neither theoretical nor idealistic in nature, but entirely practical, eminently possible, and directly relevant to the present political situation.</i></p></div>",
  "content_text": "Konrad Razumovsky\nchallenged me to a debate in response to my contention that direct democracy is superior to representative democracy. This is his initial statement.\n“My opinion, as I have previously expressed, is that the problems of “mob rule” of which the Founders so famously warned have proven to be considerably fewer and less problematic than the problems of establishing a political elite that uses the illusion of democratic approval as a protective shield. Now that technology makes it viable for larger polities, direct democracy is a moral imperative in any society with a government that is justified by the will of the people.”\n—Vox Day\nFor the purposes of this, I am using a slightly modified version of the definition of democracy from Merriam-Webster: a democracy is “a form of government in which the people choose leaders, or specific laws, by voting”.\nI do grant, and cannot reasonably dispute the following: one, representative democracies or democratic republics do limit the impact of the will of the people, by intention or accident is irrelevant; two, the most dangerous thing for a nation, in the long run, is a political elite which is divorced from the common man, a political elite who believe they are justified and also able to sell their chicanery to said common man with a gross misrepresentation of the intent of a particular government; third—and finally, technology does many exceptional things, with respect to man’s ability to influence his condition including the methods by which government can be built.  That said, I have no real issue with direct democracy in theory, or in practice, but I am forced to dispute the implicit claim that a democracy is an appropriate form of government for a larger scale polity, with or without technological intervention and irrespective of its moral gravity.  That is to say that a direct democracy has a number of internal issues which render it ineffective, if not outright detrimental, to a civilization of a certain size.  Briefly, these are: one, no amount of technological development is equal to the task of preventing the poor use thereof; two, democracies derive their legitimacy from the collective people of the nation, which would be fine if governments existed to care for the people, which they do not; three, economics applies to voting just as much as everything else; fourth—and finally, though mob rule is, indeed, a historical falsity, something very similar to it does exist and is exactly the thing which placed the silly political elite into power in the current era.  There will then need to be some minor legwork done on historic democracies to determine if the theoretical framework matches the practice.\nWhile it must be admitted by all reasonable men that modern information based technology has certainly made it possible for a democracy to function on a scale significantly larger than previously possible, in terms of both geography and population, these advances do little to address the frailty of the ballot box.  In the more traditional rendition of a democracy, there are legions of little vote counters who, being human, can each be induced by their own ideologies or the machinations of others to forget or misplace certain votes; there are instances of the dearly departed or even pets casting votes; and there is one supreme holder of the ballots who could, were he so inclined, read a different name than the one at the top of the chart.  I freely admit that technology removes the human element from these scenarios, the vote counters are machines who are incorruptible by their own bias and cannot be blackmailed; a machine is compelled to follow its programming regarding the necessary certification that a particular voter is eligible to cast such a vote, thereby reducing the rate at which Spot or Aunt Mildred interferes with mortal affairs; and a machine is honest about who is where on the final printout.\nAll of this rests on the assumption that the machine(s) administering the vote enjoy a state of being free of that kind of harassment designed to cause a shift in the eventual outcome of the vote being so administered.  Obviously, direct and physical tampering with these Democratic Servers is undesirable, so steps must be taken to remove the possibility of such.  I see two feasible solutions: one, the voting process may be moved entirely to the cloud, divorcing it from a physical existence; or two, the physical Democratic Servers must be fiercely protected against intrusions.  The problem with the first is that everyone on the planet would have access to the voting system, regardless of the level of authentication required to vote, a machine is only a machine—it is easily fooled by anyone with sufficient knowledge of the systems which compose it.  In other words, the account security for these voting systems would need to be impregnable, not only from foreign agents, but also from those running for office.  Due to the grand and illustrious history of impregnable vaults being busted, unsinkable ships being sunk, irrefutable evidence being refuted, and unstoppable armies being crushed, it strikes me as a point of absurdity to assume that any such system built today will last any serious amount of time.\nThe solution to this seems simple enough: just appoint a certain group, a set of experts—if you will, to continually update the security protocols.  Of course, this puts the entire democracy at the mercy of these programmers for its integrity, which undermines the entire point of a democracy in the first place, in that the government is derived by the will of the people.  We would be better off simply making the computer programmers the oligarchs of the new world order from the get-go to avoid all of the inevitable build up to that point.  Which leaves the second option: defending the physical counting machine.  This is also a doomed scenario because the defenders of the machine become like the programmers in the first scenario, able to unaccountably pick and choose what inputs the machine receives thereby determining the outcome.  Ultimately, this is not a new problem: every democratic system, above a certain size, will have a praetorian guard of some sort.  None of which is meant to say that technology has no place in a democracy, simply that technology does not solve the problem of the concentration of political power into the hands of a few over time.  So, to put a finer point on it, technology does not preclude in any way, shape, or form the establishment of a political elite who use the illusion of democratic approval as a protective shield, either as the wielders of legislative or executive powers.\nStrip away every piece of government and political theory, until the very first portion of it is obvious, and we will see that government cares precisely not at all about the people under it because they are not its purpose and concern, in the West at any rate.  This singular purpose is the recording of property beyond that which is unquestionably within an arbitrary individual’s control.  Indeed, the entire function of government is to provide the threat of violence necessary to keep the integrity of property lines.  I could go into considerable detail regarding this facet of government, but this is neither the time nor the place for that.  Suffice it to say that physical property which is too large to conveniently command as an extension of oneself is the thing which demands the fomentation of a government of any variety.  To put it bluntly, a democracy, even if that democracy functions perfectly, places political power in the hands of all living members of a particular society regardless of their standing in terms of property which requires the existence of a government.  If all members of this democracy share a portion of this property, there is no problem as each member of the democracy ultimately has the same interest: the protection of the integrity of property as defined by the legal code enacted by this democracy; if only some members of the democracy enjoy the privileges of property ownership, then there becomes a schism in the end goals of the populace due to one group having property and the other not.  In times past, I would probably feel compelled to simply dismiss this schism as the product of the basest portions of human nature and therefore an ignorable affliction in an enlightened society, however, the past few decades serve as ample evidence that even the mightiest and most careful cultures can be brought low.  The moral standing of property envy is irrelevant at this point, it exists and must be countenanced and thwarted in some more robust manner than an appeal to fragile culture.  Until such a time as men become wholly divorced from their envy and petty jealousies, such that those without strive to achieve the same status as those who by grace have instead of simply using any and all possible leverage—including the use of government force—to deprive the latter group from their holdings, allowing such men, those who do not bear some interest in the ultimate good of the nation—and, by extension, the weight of property, dilutes or undermines the ultimate point of the establishment of a government in the first place.  Therefore, a democracy will eventually destroy itself.\nEconomics, the study of rational choice, is most assuredly a matter of concern for the democrat, simply because it is the ideal means by which men do their voting.  Obviously, the hope is for every voting member of a democracy to make his choices rationally, but the decision to vote is, itself, subject to a rational tradeoff.  It is a common observation that a vote in a democracy above a certain size is functionally useless.  A single vote in a nation of one hundred is worth considerably more than a single vote in a country of millions.  Granted, technological advances can make the costs associated with voting, leaving work early, time consumed casting the ballot, among others, much smaller but does little to ensure that a particular vote is actually worth casting in the grander sense.  Consider California, where it is not uncommon to find men of the right choosing not to vote simply because there is no point in doing so.  The analysis by these men is a simple one: there is a significant number of individuals within the State of California, to the point where an individual vote is insignificant, and the vast majority of Californians simply disagree with these right leaning voters.  A callous solution would be to instruct these people to move elsewhere, where their neighbors tend to agree with them, but this is an implicit admission that the discrete vote matters not at all.  Were the large scale democrat to admit that his ideology necessarily ignores the trees for the forest, I would have considerably less of a problem with the whole system of thought as the link between an increase in large scale democracy and the decline of individual rights could be more adequately documented and discussed.  To put it in a slightly more direct way, if a democracy exceeds a certain population threshold, then the democracy ceases to be able to effectively operate in a manner which is consistent with classically liberal thought.\nMob rule, or the tyranny of the majority, does not exist, in any meaningful form, but its close cousin, let’s call it the tyranny of geography, does.  For example, communities on the edge of the ocean have considerably different concerns than the community on a mountainside.  It would be unreasonable to expect the mountainside community to build houses on stilts to avoid tidal flooding, and the seaside community to have steeply sloped roofs to more effectively shed snowfall.  Such dichotomies can be found everywhere, with certain areas developing a particular solution to a problem which does not exist elsewhere.  Now, geography and climate can certainly cause people to behave differently discretely, but it has not been established that this would impair the ability of the aggregate of such localities to enact an effective democracy.  Indeed, if the total population of the seaside community and the mountainside community are virtually equivalent, then neither party would be able to force every house to have stilts or steep rooves, instead getting what seems not disagreeable to both.  The only problem is that such an arrangement simply does not happen in reality.  Let us examine New York State.  There is a collection of a few cities along the coast which dominate the entire policy of the state despite the rest of the state being of precisely the opposite political affiliation.  In other words, a concentration of people, brought about by geographic concerns, such as the suitability of a particular place to function as a port or commerce hub, may very well have certain governmental needs which do not exist outside of the densely populated areas, a governmental solution which could very easily eliminate the livelihood of these rural or suburban communities, and a democracy places complete authority over these potentially suffocating policies in the hands of those who choose to live in hyper concentrated areas without providing ser\nious recourse to those in the boonies.  In a democracy, cities warp the political landscape to their own benefit, sometimes costing the smaller and more numerous communities which share its jurisdiction greatly.  If the wholesale ruination of the nonurban is permissible, then a democracy with a large footprint is acceptable; if not, then democracy must be limited in geographic size.\nTo briefly reiterate, a successful democracy would be fairly small in size and scale, encompassing a small area geographically and inhabited by a certain, relatively low, number of residents.  Bold claims to be sure, but not without historic precedence: I would draw your attention to both the Iceni tribes of pre-Roman Britain and the Her Majesty’s Privateers of the colonial era.  Both cases are successful democracies, successful in that they enjoyed social stability and developed cultures which further lubricated the systems put in place, with the community placing authority in an individual, either chief or captain, whose concern ensured that the democracy as a whole was benefited.  Should this figure of authority be found wanting, he did not have armies at his disposal to put down a vote of no confidence because his army consisted of his neighbors and friends who had a real interest in the good of the community as a whole.  In short, if the chief or captain failed to perform their duties in an acceptable manner to the people of the democracy, then removing them was an almost trivial matter: the army which did the removing was the army who followed his orders was the people who did the voting.  Of course, these examples merely show that a democracy does work on a local level but fails to evidence an inability of the system to meet the needs of a larger populace, in terms of both raw numbers and territory.  For this, we should investigate the history of Athens which, after having demonstrated its superiority in every possible field to its harshest critic—Plato, quietly fell apart due to internal issues between the various voting groups as these groups matured past their nascence within a few generations.\nNone of which quite addresses the most obvious point of a pure democracy: the laws or leaders enjoying the vote.  How precisely does the leader enact his will?  If historic trends are any indication, then a democracy is simply a form of government used to legitimize a dictator.  Does the democracy then choose to be of the form where every proposed law is voted on by the general populace?  If so, then one of two eventualities arise, either: one, the populace appoints, presumably by democratic means, a body of persons who propose laws, which is the establishment of a political elite who are naturally compelled to use their power for their own purposes; or, the laws are crowdsourced in some fashion, which would probably result in charming little laws akin to the naming of certain Antarctic Icebreakers.\nAll of these issues combined, or any one of them—really, is sufficient to fully dissuade the serious political philosopher from accepting democracy as some great panacea for the ills of society.  There is a place for democracy, to be sure—as it is very good at what it does under the appropriate circumstances, but its structural integrity is built solely upon its locality.  If a democracy reigns supreme over too large an expanse of people or places, then it will eventually destroy the very livelihood of those different people and places simply due to the nature of the thing.  This is an observation noted by the Founders, and was solved in their day by establishing requirements beyond that of mere life for voters and building the United States Senate upon the legislatures of the various states.  In fact, there was a little war fought over how ineffective these precautions were in thwarting the tendencies of democracies from 1861 to 1865, with numerous potential solutions being offered by one of the sides in that conflict.  More than any other factor, the spread of the belief of the justness of a pure and true democracy has contributed to the decline which is now so apparent throughout the West.  Insisting that more of the same is the solution is to argue that the United States, and nations like it, should cease to be one nation; a perfectly acceptable assertion, to be sure, but very different from the initial conceit of an objectively superior form of government for a nation of any serious size whose government derives its legitimacy from the will of the people.\nI will post my response here sometime in the coming weeks, but I will note that Konrad appears to have completely missed the target by attacking the concept of democracy itself instead of defending the superiority of representative democracy to direct democracy. I have no intention whatsoever of defending the core concept of democracy itself, as my argument is neither theoretical nor idealistic in nature, but entirely practical, eminently possible, and directly relevant to the present political situation.",
  "tags": [
    "debate",
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-10T11:00:00+00:00"
}