{
  "url": "https://voxday.net/2016/07/05/gamaliel-unmasked/",
  "scraped_at": "2025-12-18T01:42:54.446239",
  "title": "Gamaliel unmasked",
  "date_display": "July 5, 2016",
  "date_iso": "2016-07-05T12:00:00+00:00",
  "date_from_url": "2016-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Witchfinder General <a href=\"http://archive.is/VPVx9#selection-1097.0-1159.336\">unmasks the anti-GamerGate Wikipedia administrator Gamalie</a>l, who was, until recently, an Arbitration Committee member, Wikimedia DC board member, and the editor-in-chief of Wikipedia’s quasi-newspaper, <i>The Signpost</i>.</p><blockquote class=\"tr_bq\"><p> <b>Unmasking Gamaliel</b></p><p>Your author has decided to name Gamaliel. Last year I concluded that there was no public interest in unmasking Gamaliel. He was a mere administrator and there is a convention that only in exceptional circumstances is a low ranking person in a large organisation named.</p><p>Recent events have caused me to review that decision and I have concluded that it is in the public interest now to name Gamaliel and reveal his occupation and employer—The former Wikipedia Arbitrator and Administrator known as Gamaliel is known as Robert Manuel Fernandez in real life.</p><p>1. Gamaliel is no longer junior. He held an international, policy-setting, elected position on the Wikipedia Arbitration Committee.<br> 2. Gamaliel read my article ‘Paedophiles of Wikipedia’ and breached policy by not banning an admitted paedophile.<br> 3. Gamaliel works in an educational institution as an assistant professor and a librarian and is in a position of trust.<br> 4. Gamaliel has made potentially ruinous allegations against users of Wikipedia like The Devil’s Advocate and afforded them no opportunity to respond – indeed this blog treated Gamaliel and Jimmy Wales better and allowed them the opportunity to comment in advance.<br> 5. When I put this article on hold out of pity for Gamaliel, his acolytes claimed contacting his employers was, ‘extortion’ … before doing far worse to David Auerbach.</br></br></br></br></p><p>Gamaliel is <a href=\"https://archive.is/RCJGe\">Robert Manuel Fernandez</a>, Assistant Professor, Reference / Instructional Librarian at Saint Leo University, Florida.</p></blockquote><p>I don’t know that it’s much of an “unmasking”, <a href=\"https://commons.wikimedia.org/wiki/File:Robert_Fernandez_%28Gamaliel%29_at_WikiConference_USA_2015.JPG\">actually</a>, but regardless, Fernandez is the poster boy for a considerable amount of what is wrong with Wikipedia. He is also a useful study in SJW entryism, even though Wikipedia itself is an SJW-controlled organization, in light of how he continually wormed his way towards positions of internal influence.</p><p>I suspect an inordinate number of Wikipedia administrators are low-level academics at lesser institutions. That’s why they have no shortage of time to spend thought-policing Wikipedia pages for any content that might call the SJW Narrative into question. It also explains why they almost invariably demonstrate terminal midwittery.</p></div>",
  "content_text": "The Witchfinder General\nunmasks the anti-GamerGate Wikipedia administrator Gamalie\nl, who was, until recently, an Arbitration Committee member, Wikimedia DC board member, and the editor-in-chief of Wikipedia’s quasi-newspaper,\nThe Signpost\n.\nUnmasking Gamaliel\nYour author has decided to name Gamaliel. Last year I concluded that there was no public interest in unmasking Gamaliel. He was a mere administrator and there is a convention that only in exceptional circumstances is a low ranking person in a large organisation named.\nRecent events have caused me to review that decision and I have concluded that it is in the public interest now to name Gamaliel and reveal his occupation and employer—The former Wikipedia Arbitrator and Administrator known as Gamaliel is known as Robert Manuel Fernandez in real life.\n1. Gamaliel is no longer junior. He held an international, policy-setting, elected position on the Wikipedia Arbitration Committee.\n2. Gamaliel read my article ‘Paedophiles of Wikipedia’ and breached policy by not banning an admitted paedophile.\n3. Gamaliel works in an educational institution as an assistant professor and a librarian and is in a position of trust.\n4. Gamaliel has made potentially ruinous allegations against users of Wikipedia like The Devil’s Advocate and afforded them no opportunity to respond – indeed this blog treated Gamaliel and Jimmy Wales better and allowed them the opportunity to comment in advance.\n5. When I put this article on hold out of pity for Gamaliel, his acolytes claimed contacting his employers was, ‘extortion’ … before doing far worse to David Auerbach.\nGamaliel is\nRobert Manuel Fernandez\n, Assistant Professor, Reference / Instructional Librarian at Saint Leo University, Florida.\nI don’t know that it’s much of an “unmasking”,\nactually\n, but regardless, Fernandez is the poster boy for a considerable amount of what is wrong with Wikipedia. He is also a useful study in SJW entryism, even though Wikipedia itself is an SJW-controlled organization, in light of how he continually wormed his way towards positions of internal influence.\nI suspect an inordinate number of Wikipedia administrators are low-level academics at lesser institutions. That’s why they have no shortage of time to spend thought-policing Wikipedia pages for any content that might call the SJW Narrative into question. It also explains why they almost invariably demonstrate terminal midwittery.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-05T11:00:00+00:00"
}