{
  "url": "https://voxday.net/2016/07/18/gamma-reviews/",
  "scraped_at": "2025-12-18T01:44:32.667437",
  "title": "Gamma reviews",
  "date_display": "July 18, 2016",
  "date_iso": "2016-07-18T10:10:00+00:00",
  "date_from_url": "2016-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"https://madgeniusclub.com/2016/07/17/reviews-alpha-beta-gamma-delta-all-greek-to-you/\">is not a Gamma review</a>:</p><blockquote class=\"tr_bq\"><p> Gamma Reviews: Advanced Review Copies</p><p>Advanced Review Copies, or ARCs, are the books that the publishers print out early with ordering information including print run size &amp; co-op information instead of a back cover blurb. These are given out to bookstore buyers, professional reviewers, (and, in the case of Baen, lucky people at the Baen Roadshow.)</p></blockquote><p>Now <a href=\"http://whatever.scalzi.com/2016/07/17/a-short-review-of-ghostbusters-and-a-longer-pummel-of-manboys/\">THIS is a Gamma review</a>:</p><blockquote class=\"tr_bq\"><p> What I thought of the new Ghostbusters: I liked it, and would happily rewatch it. It’s definitely the second-best Ghostbusters movie, and much closer to the original in terms of enjoyment than the willfully forgotten Ghostbusters 2. There are legitimate criticisms to make of it: the plot is rote to the point of being slapdash, the action scenes are merely adequate, and Paul Feig is no Ivan Reitman, in terms of creating comedic ambiance. But the film got the two big things right: It has a crackerjack cast that’s great individually and together, and it has all the one-liners you can eat. And now that the origin story of these particular Ghostbusters is out of the way, I’m ready for the sequel.</p><p>But what about the Ghostbusters being all women?!??!?? Yes they were, and it was good. If you can’t enjoy Melissa McCarthy, Kristen Wiig, Kate McKinnon and Leslie Jones snarking it up while zapping ghosts with proton streams, one, the problem is you, not them, and two, no really, what the fuck is wrong with you. The actors and the characters had chemistry with one another and I would have happily watched these Ghostbusters eat lunch, just to listen to them zap on one another. And in particular I want to be McKinnon’s Holtzmann when I grow up; Holtzmann is brilliant and spectrum-y and yet pretty much social anxiety-free and I honestly can’t see any sort of super-nerd not wanting to cosplay the shit out of her forever and ever, amen.</p><p>BUT THEY’VE RUINED MY CHILDHOOD BY BEING WOMEN, wails a certain, entitled subset of male nerd on the Internet. Well, good, you pathetic little shitballs. If your entire childhood can be irrevocably destroyed by four women with proton packs, your childhood clearly sucked and it needs to go up in hearty, crackling flames. Now you are free, boys, free! Enjoy the now. Honestly, I don’t think it’s entirely a coincidence that one of the weakest parts of this film is its villain, who (very minor spoiler) is literally a basement-dwelling man-boy just itchin’ to make the world pay for not making him its king, as he is so clearly meant to be. These feculent lads are annoying enough in the real world. It’s difficult to make them any more interesting on screen.</p><p>But this is just the latest chapter of man-boys whining about women in science fiction culture: Oh noes! Mad Max has womens in it! Yes, and Fury Road was stunning, arguably the best film of its franchise and of 2015, and was improbably but fittingly nominated for Best Picture at the Academy Awards. Oh noes! Star Wars has womens in it! Yes, and The Force Awakens was pretty damn good, the best Star Wars film since Empire, was the highest grossing film of 2015 and of all time in the domestic box office (not accounting for inflation. Accounting for inflation, it’s #11. #1 counting inflation? That super-manly epic, Gone With the Wind).</p><p>And now, Oh noes! Ghostbusters has womens in it! Yes, and it’s been well-reviewed and at $46 million, is the highest grossing opening for its director or any of its stars and perfectly in line with studio estimates for the weekend. Notably, all the surviving principals of the original film make cameos, suggesting they are fine with passing the torch (Harold Ramis is honored in the film too, which is a lovely touch), and Ivan Reitman and Dan Aykroyd are producers of the film. If your childhood has been ruined, boys, then your alleged heroes happily did some of the kicking.</p><p>I’m an 80s kid; my youth is not forever stained by a Ghostbusters remake, any more than it was stained by remakes of Robocop or Point Break or Poltergeist or Endless Love or The Karate Kid or Clash of the Titans or Footloose or Total Recall and on and on. I think most of these remakes were unnecessary, and I don’t think most of them were particularly good, or as good as their originals, and I question why film companies bother, aside from the “all the originals were made before the global movie market matured and there’s money on the table that can be exploited with these existing brands,” which is, of course, its own excuse.</p><p>But after a certain and hopefully relatively early point in your life, you realize remakes are just a thing the film industry does — the first Frankenstein film listed on imdb was made in 1910, and the most recent, 2015, and Universal (maker of the classic 1931 version) is planning yet another reboot in 2018 or 2019 — and maybe you get over yourself and your opinion that your childhood is culturally inviolate, especially from the entities that actually, you know, own the properties you’ve invested so much of your psyche into. It’s fine to roll your eyes when someone announces yet another remake, tweet “UGH WHYYYYYY” and then go about your life. But it causes you genuine emotional upheaval, maybe a reconfigure of your life is not out of the question.</p><p>(Not, mind you, that I think these shitboys are genuinely that invested in Ghostbusters, per se; they’re invested in manprivilege and, as noted above, would have wailed their anguished testeria onto Reddit and 4chan regardless of which cultural property had women “suddenly” show up in it. This is particularly ironic with anything regarding science fiction, which arguably got its successful start in Western culture through the graces of Mary Shelley. Women have always been in it, dudes. Deal.)</p><p>The happy news in this case is that, whether or not this Ghostbusters reboot was necessary, it’s pretty good, and fun to watch. That’s the best argument for it. I’m looking forward to more.</p></blockquote><p> So brave. But having finished demolishing his own reputation as a movie reviewer in the interest of virtue-signaling his feminist superiority to “manboys” and “shitboys”, whatever they are, McRapey also had to be the first to comment on his own post on his shrinking little blog.</p><blockquote class=\"tr_bq\"><p> John Scalzi says:<br> JULY 17, 2016 AT 12:15 PM<br> To get ahead of any potential “but there are women saying their childhood was ruined too!” nonsense: Maybe there were? But if there were, and they weren’t gamergate-like sockpuppet accounts, a) I didn’t see much of them, b) they were swamped by the wailing boys, c) the advice to them is the same as to the whining dudes: Remakes happen, maybe get over it.</br></br></p><p>To get ahead of “it’s sexist to bag on the men here,” argument, leaving the whole larger argument about power stuctures and sexism and all the stuff you recognize play into sexism when you think about sexism on a level higher than “this is a playing card I can slap down in this game called Rhetoric,” you can imagine me in that Wonka meme pose, saying “Tell me again as a man how I can’t criticize men, that’s adorable.”</p><p>Finally, to get ahead of any “beta cuck” stupidity, I’m not the one who just spent half a year wailing about the ruin of my childhood, boys. I do find there’s an correlation between the sort of dude who questions my masculinity and the sort of dude who whines excessively about how mean the world is to him, waaaaaaaaaaaah. And this is me in the Wonka pose again.</p><p>All of which is to say, Mallet is out for general whiny male bullshit. Behave, children.</p></blockquote><p>Spacebunny cracks me up. Her entire response: “Isn’t he married? Why is he trying so hard?” Sadly, despite his brave and heroic efforts, Scalzi got it wrong in the end. You see, the official feminist line is that Grrlbusters is not only <i>better than the original</i>, but <a href=\"http://womenwriteaboutcomics.com/2016/07/15/importance-seeing-ghostbusters/\">seeing it is <i>important</i></a>.</p><blockquote class=\"tr_bq\"><p> <b>The nerdy guy doesn’t get the girl.</b> That was a standard trope in the 80s, and the Ghostbusters of 1984 was no exception. The lack of consent factor that makes all of the Zhoul-possessed Sigourney Weaver scenes difficult to watch is not an issue here, because there is no romance in the new Ghostbusters, creepily possessed or otherwise. Yes, Erin (Kristin Wiig) awkwardly hits on Kevin (Chris Hemsworth) but it’s generally met with disapproval from her fellow Ghostbusters (if not laughter) and Kevin seeming to be oblivious to it. And even better than the nerdy guy being the hero is the fact that the nerdy guy is the villain and the nerdy girls save the world. Boom.</p><p><b>An appreciation for their receptionist by the Ghostbusters.</b> I loved Janine as a kid. As a child, I thought that Janine pining quietly for Egon was romantic. Now it pisses me off. That and the fact that nobody paid any attention to her, generally speaking, because she was competent and therefore invisible. As doofy and dumb as Kevin is, and even though Erin hits on him, the team still values him and learns to work with him because they genuinely care about him. That’s not subtext. That’s actual text.</p><p><b>Using the “ghost” as an allegorical commentary.</b> One of the themes in this movie is the importance of being believed. Yes, in this movie, it’s about being believed about ghosts. Erin talks about how she saw a ghost when she was 8, every night for a year. Her parents didn’t believe her, and she went into therapy. Abby (Melissa McCarthy) was the only one who believed her, which was one of the reasons they became friends. It’s not that much of a stretch to think about all the things that women are also often not believed about, as children or as adults. And that part of the movie, thankfully, and pointedly, doesn’t devolve into comedy. It lets the moment of remembered trauma be serious.</p><p><b>Real friendship between the Ghostbusters.</b> The other moment of seriousness that is allowed to be serious is at the very end, when Jillian (Kate McKinnon) stands up to give the gals a toast. Up to this point, the majority of Kate McKinnon’s screentime has been devoted to sight gags and making straight girls question their sexuality, both of which she excels at.</p></blockquote><p>I wouldn’t hold your breath waiting for that sequel, Johnny. I expect it will be out around the same time that Paramount releases the Old Man’s War movie.  But at least we’ll have <a href=\"http://www.imdb.com/title/tt2826626/\">that television show based on Redshirts</a> to look forward to.</p></div>",
  "content_text": "This\nis not a Gamma review\n:\nGamma Reviews: Advanced Review Copies\nAdvanced Review Copies, or ARCs, are the books that the publishers print out early with ordering information including print run size & co-op information instead of a back cover blurb. These are given out to bookstore buyers, professional reviewers, (and, in the case of Baen, lucky people at the Baen Roadshow.)\nNow\nTHIS is a Gamma review\n:\nWhat I thought of the new Ghostbusters: I liked it, and would happily rewatch it. It’s definitely the second-best Ghostbusters movie, and much closer to the original in terms of enjoyment than the willfully forgotten Ghostbusters 2. There are legitimate criticisms to make of it: the plot is rote to the point of being slapdash, the action scenes are merely adequate, and Paul Feig is no Ivan Reitman, in terms of creating comedic ambiance. But the film got the two big things right: It has a crackerjack cast that’s great individually and together, and it has all the one-liners you can eat. And now that the origin story of these particular Ghostbusters is out of the way, I’m ready for the sequel.\nBut what about the Ghostbusters being all women?!??!?? Yes they were, and it was good. If you can’t enjoy Melissa McCarthy, Kristen Wiig, Kate McKinnon and Leslie Jones snarking it up while zapping ghosts with proton streams, one, the problem is you, not them, and two, no really, what the fuck is wrong with you. The actors and the characters had chemistry with one another and I would have happily watched these Ghostbusters eat lunch, just to listen to them zap on one another. And in particular I want to be McKinnon’s Holtzmann when I grow up; Holtzmann is brilliant and spectrum-y and yet pretty much social anxiety-free and I honestly can’t see any sort of super-nerd not wanting to cosplay the shit out of her forever and ever, amen.\nBUT THEY’VE RUINED MY CHILDHOOD BY BEING WOMEN, wails a certain, entitled subset of male nerd on the Internet. Well, good, you pathetic little shitballs. If your entire childhood can be irrevocably destroyed by four women with proton packs, your childhood clearly sucked and it needs to go up in hearty, crackling flames. Now you are free, boys, free! Enjoy the now. Honestly, I don’t think it’s entirely a coincidence that one of the weakest parts of this film is its villain, who (very minor spoiler) is literally a basement-dwelling man-boy just itchin’ to make the world pay for not making him its king, as he is so clearly meant to be. These feculent lads are annoying enough in the real world. It’s difficult to make them any more interesting on screen.\nBut this is just the latest chapter of man-boys whining about women in science fiction culture: Oh noes! Mad Max has womens in it! Yes, and Fury Road was stunning, arguably the best film of its franchise and of 2015, and was improbably but fittingly nominated for Best Picture at the Academy Awards. Oh noes! Star Wars has womens in it! Yes, and The Force Awakens was pretty damn good, the best Star Wars film since Empire, was the highest grossing film of 2015 and of all time in the domestic box office (not accounting for inflation. Accounting for inflation, it’s #11. #1 counting inflation? That super-manly epic, Gone With the Wind).\nAnd now, Oh noes! Ghostbusters has womens in it! Yes, and it’s been well-reviewed and at $46 million, is the highest grossing opening for its director or any of its stars and perfectly in line with studio estimates for the weekend. Notably, all the surviving principals of the original film make cameos, suggesting they are fine with passing the torch (Harold Ramis is honored in the film too, which is a lovely touch), and Ivan Reitman and Dan Aykroyd are producers of the film. If your childhood has been ruined, boys, then your alleged heroes happily did some of the kicking.\nI’m an 80s kid; my youth is not forever stained by a Ghostbusters remake, any more than it was stained by remakes of Robocop or Point Break or Poltergeist or Endless Love or The Karate Kid or Clash of the Titans or Footloose or Total Recall and on and on. I think most of these remakes were unnecessary, and I don’t think most of them were particularly good, or as good as their originals, and I question why film companies bother, aside from the “all the originals were made before the global movie market matured and there’s money on the table that can be exploited with these existing brands,” which is, of course, its own excuse.\nBut after a certain and hopefully relatively early point in your life, you realize remakes are just a thing the film industry does — the first Frankenstein film listed on imdb was made in 1910, and the most recent, 2015, and Universal (maker of the classic 1931 version) is planning yet another reboot in 2018 or 2019 — and maybe you get over yourself and your opinion that your childhood is culturally inviolate, especially from the entities that actually, you know, own the properties you’ve invested so much of your psyche into. It’s fine to roll your eyes when someone announces yet another remake, tweet “UGH WHYYYYYY” and then go about your life. But it causes you genuine emotional upheaval, maybe a reconfigure of your life is not out of the question.\n(Not, mind you, that I think these shitboys are genuinely that invested in Ghostbusters, per se; they’re invested in manprivilege and, as noted above, would have wailed their anguished testeria onto Reddit and 4chan regardless of which cultural property had women “suddenly” show up in it. This is particularly ironic with anything regarding science fiction, which arguably got its successful start in Western culture through the graces of Mary Shelley. Women have always been in it, dudes. Deal.)\nThe happy news in this case is that, whether or not this Ghostbusters reboot was necessary, it’s pretty good, and fun to watch. That’s the best argument for it. I’m looking forward to more.\nSo brave. But having finished demolishing his own reputation as a movie reviewer in the interest of virtue-signaling his feminist superiority to “manboys” and “shitboys”, whatever they are, McRapey also had to be the first to comment on his own post on his shrinking little blog.\nJohn Scalzi says:\nJULY 17, 2016 AT 12:15 PM\nTo get ahead of any potential “but there are women saying their childhood was ruined too!” nonsense: Maybe there were? But if there were, and they weren’t gamergate-like sockpuppet accounts, a) I didn’t see much of them, b) they were swamped by the wailing boys, c) the advice to them is the same as to the whining dudes: Remakes happen, maybe get over it.\nTo get ahead of “it’s sexist to bag on the men here,” argument, leaving the whole larger argument about power stuctures and sexism and all the stuff you recognize play into sexism when you think about sexism on a level higher than “this is a playing card I can slap down in this game called Rhetoric,” you can imagine me in that Wonka meme pose, saying “Tell me again as a man how I can’t criticize men, that’s adorable.”\nFinally, to get ahead of any “beta cuck” stupidity, I’m not the one who just spent half a year wailing about the ruin of my childhood, boys. I do find there’s an correlation between the sort of dude who questions my masculinity and the sort of dude who whines excessively about how mean the world is to him, waaaaaaaaaaaah. And this is me in the Wonka pose again.\nAll of which is to say, Mallet is out for general whiny male bullshit. Behave, children.\nSpacebunny cracks me up. Her entire response: “Isn’t he married? Why is he trying so hard?” Sadly, despite his brave and heroic efforts, Scalzi got it wrong in the end. You see, the official feminist line is that Grrlbusters is not only\nbetter than the original\n, but\nseeing it is\nimportant\n.\nThe nerdy guy doesn’t get the girl.\nThat was a standard trope in the 80s, and the Ghostbusters of 1984 was no exception. The lack of consent factor that makes all of the Zhoul-possessed Sigourney Weaver scenes difficult to watch is not an issue here, because there is no romance in the new Ghostbusters, creepily possessed or otherwise. Yes, Erin (Kristin Wiig) awkwardly hits on Kevin (Chris Hemsworth) but it’s generally met with disapproval from her fellow Ghostbusters (if not laughter) and Kevin seeming to be oblivious to it. And even better than the nerdy guy being the hero is the fact that the nerdy guy is the villain and the nerdy girls save the world. Boom.\nAn appreciation for their receptionist by the Ghostbusters.\nI loved Janine as a kid. As a child, I thought that Janine pining quietly for Egon was romantic. Now it pisses me off. That and the fact that nobody paid any attention to her, generally speaking, because she was competent and therefore invisible. As doofy and dumb as Kevin is, and even though Erin hits on him, the team still values him and learns to work with him because they genuinely care about him. That’s not subtext. That’s actual text.\nUsing the “ghost” as an allegorical commentary.\nOne of the themes in this movie is the importance of being believed. Yes, in this movie, it’s about being believed about ghosts. Erin talks about how she saw a ghost when she was 8, every night for a year. Her parents didn’t believe her, and she went into therapy. Abby (Melissa McCarthy) was the only one who believed her, which was one of the reasons they became friends. It’s not that much of a stretch to think about all the things that women are also often not believed about, as children or as adults. And that part of the movie, thankfully, and pointedly, doesn’t devolve into comedy. It lets the moment of remembered trauma be serious.\nReal friendship between the Ghostbusters.\nThe other moment of seriousness that is allowed to be serious is at the very end, when Jillian (Kate McKinnon) stands up to give the gals a toast. Up to this point, the majority of Kate McKinnon’s screentime has been devoted to sight gags and making straight girls question their sexuality, both of which she excels at.\nI wouldn’t hold your breath waiting for that sequel, Johnny. I expect it will be out around the same time that Paramount releases the Old Man’s War movie.  But at least we’ll have\nthat television show based on Redshirts\nto look forward to.",
  "tags": [
    "McRapey",
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-18T09:10:00+00:00"
}