{
  "url": "https://voxday.net/2016/07/30/its-not-about-hearts-on-sleeves/",
  "scraped_at": "2025-12-18T01:46:45.889183",
  "title": "It’s not about hearts on sleeves",
  "date_display": "July 30, 2016",
  "date_iso": "2016-07-30T22:32:00+00:00",
  "date_from_url": "2016-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always enjoy it when cucks go straight to rhetoric. It’s just not a field on which they’re really prepared to play.</p><blockquote><p> (((Popehat))) ‏@Popehat<br> When I think about it, my clients who are the most modestly, convincingly, and devotedly patriotic are immigrants. Hearts on their sleeves.</br></p><p>Supreme Dark Lord @voxday<br> And yet, they managed to destroy the nation all the same. It’s not about hearts, but genetics and culture.</br></p><p>(((Popehat))) @Popehat<br> This guy still exists, I guess.</br></p><p>Supreme Dark Lord ‏@voxday<br> Glad to see you’re still out of the funny farm. For the time being, anyhow.</br></p><p>(((Popehat))) ‏@Popehat<br> This is an adequate insult, I suppose, graded on a curve. Hardly MENSA though.</br></p><p>Supreme Dark Lord ‏@voxday<br> I try to keep things at a level the other guy will understand. Communication is so important, after all.</br></p><p>(((Popehat))) ‏@Popehat<br> Yes, I’ve heard your books are very easy to read.</br></p><p>Supreme Dark Lord ‏@voxday<br> That’s why they’re bestsellers.</br></p></blockquote><p>He just never learns, does he. But to return to the point, no matter how much you may like something,  no matter how strongly you may identify with it, that liking for it <i>doesn’t make you that thing</i>. I really like the Minnesota Vikings. I have since I was a child. But that doesn’t make me a professional football player, much less a member of the Vikings. Seriously, this isn’t that hard.</p><p>Do you regard me as an Italian, no different than Garibaldi or Totti or Dante? Or is the dirt of Italy simply less magic than that of America? No, the simple fact is that the <i>state </i>is not the <i>nation</i>. And that is why even the most loyal immigrant can never be a genuine national, even unto the third generation.</p><p>Meanwhile, this proud assimilator apparently doesn’t understand his own (((heritage))) well enough to know that Judaism is matrilineal.</p><blockquote><p> (((Schröd’s Täint))) ‏@SmuggieMike<br> hey pal, I’m a Jew immigrant l who had two kids with a white Christian from the south. #ImGenocidingYou.</br></p><p>Supreme Dark Lord ‏@voxday<br> And now your kids are no longer Jewish. You’re self-holocausting; you’re almost Hitler. </br></p></blockquote></div>",
  "content_text": "I always enjoy it when cucks go straight to rhetoric. It’s just not a field on which they’re really prepared to play.\n(((Popehat))) ‏@Popehat\nWhen I think about it, my clients who are the most modestly, convincingly, and devotedly patriotic are immigrants. Hearts on their sleeves.\nSupreme Dark Lord @voxday\nAnd yet, they managed to destroy the nation all the same. It’s not about hearts, but genetics and culture.\n(((Popehat))) @Popehat\nThis guy still exists, I guess.\nSupreme Dark Lord ‏@voxday\nGlad to see you’re still out of the funny farm. For the time being, anyhow.\n(((Popehat))) ‏@Popehat\nThis is an adequate insult, I suppose, graded on a curve. Hardly MENSA though.\nSupreme Dark Lord ‏@voxday\nI try to keep things at a level the other guy will understand. Communication is so important, after all.\n(((Popehat))) ‏@Popehat\nYes, I’ve heard your books are very easy to read.\nSupreme Dark Lord ‏@voxday\nThat’s why they’re bestsellers.\nHe just never learns, does he. But to return to the point, no matter how much you may like something,  no matter how strongly you may identify with it, that liking for it\ndoesn’t make you that thing\n. I really like the Minnesota Vikings. I have since I was a child. But that doesn’t make me a professional football player, much less a member of the Vikings. Seriously, this isn’t that hard.\nDo you regard me as an Italian, no different than Garibaldi or Totti or Dante? Or is the dirt of Italy simply less magic than that of America? No, the simple fact is that the\nstate\nis not the\nnation\n. And that is why even the most loyal immigrant can never be a genuine national, even unto the third generation.\nMeanwhile, this proud assimilator apparently doesn’t understand his own (((heritage))) well enough to know that Judaism is matrilineal.\n(((Schröd’s Täint))) ‏@SmuggieMike\nhey pal, I’m a Jew immigrant l who had two kids with a white Christian from the south. #ImGenocidingYou.\nSupreme Dark Lord ‏@voxday\nAnd now your kids are no longer Jewish. You’re self-holocausting; you’re almost Hitler.",
  "tags": [
    "freakshow",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-30T21:32:00+00:00"
}