{
  "url": "https://voxday.net/2016/07/25/jerry-pournelle-on-free-trade/",
  "scraped_at": "2025-12-18T01:45:49.721185",
  "title": "Jerry Pournelle on free trade",
  "date_display": "July 25, 2016",
  "date_iso": "2016-07-25T15:30:00+00:00",
  "date_from_url": "2016-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thanks to his <i>There Will Be War</i> series, Jerry Pournelle was one of my biggest intellectual influences as a teenager. If you want to ensure that your teenage sons have an antidote to the progressive and globalist nonsense in which they are engulfed by the mainstream and conservative medias, you simply cannot do better than give them a book or three from that series; the educational aspect of TWBW was the reason it was my absolute top priority to get it back in print. We’ve got seven of <a href=\"http://web.sbu.edu/friedsam/archives/carr/Anthologies_Twbw.htm\">the original nine</a> back in print already, and we’ll have the rest out by the end of the year.</p><p>Now Jerry is turning his still-formidable intellect <a href=\"https://www.jerrypournelle.com/chaosmanor/back-to-normal-beginning-a-discussion-of-free-trade/\">towards one of the great questions of the day</a>: free trade. It is of particular import for conservatives:</p><blockquote><p> One reason Conservatives are advised by Conservative leaders to disagree with Trump is his position on Free Trade. The problem for me is that I do not see Free Trade, particularly laissez faire Free Trade, as necessarily Conservative at all,</p><p>The advantages of Free Trade are lower prices for stuff. That means they are more cheaply produced. As the economist David Ricardo wrote, there is a principle of comparative advantage that coupled with free trade guarantees maximum profits for when there are no trade restrictions, and impediments to free trade are supposed to be mutually disadvantageous.</p><p>But do understand, what is conserved is lower prices. Nor social stability. Not communities. Not family life. Indeed those are often disrupted; it’s part of the economic model. Under free trade theory, it’s better to have free trade than community preservation, better to have ghost towns of people displaced because their jobs have been shipped overseas; better to have Detroit as a wasteland than a thriving dynamic industrial society turning out tail finned Cadillacs and insolent chariots and supporting workers represented by rapacious unions in conflict with pitiless corporate executives.</p><p>The theory of free trade includes liquidity: liquidity in capital flow, and liquidity in labor relocation.</p><p>What was conserved by turning Detroit into a wasteland? How was that conservative? Wouldn’t it be more conservative to argue that if everyone pays a little more for stuff made here, by people who work here, we are better off than having it made south of the border and inviting our people to go work there at their prevailing wages?</p><p>Go further. You don’t have to move. We’ll pay you for not working and you don’t have to move. Of course we’ll have to raise taxes on those who do work to pay those people no longer working, but that’s life. But after unemployment benefits work out – in my days the government would pay you $26 a week for 26 weeks – you’re in trouble. So much so that welfare benefits kept being raised. Food stamps, which became larger and bought more items. Negative income tax. And if you dropped out of the labor force – no longer looking for a job – you are no longer unemployed. The unemployment rate just went down. You stopped looking for a job. Of course you don’t have a job – you are certainly not employed – but you aren’t unemployed and don’t count toward the unemployment rate. I wouldn’t have thought that sort of lying to the people by government officials was a very Conservative thing to do at all.</p><p>Would a 15% tariff on cars have saved Detroit? It would mean that I would have had to pay about $5000 more for my 1988 Ford Eddie Bauer V8 Explorer I bought in 1999. I could have afforded that. And I suspect that I’ve paid more in income taxes sent to welfare recipients in Detroit than that. Is paying people not to work more Conservative than trying to keep their jobs – and manufacturing capabilities and potential here, bot dismantling it and leaving its former site to rust away – Conservative?</p><p>And is encouraging people not to work – at least making it easier and more possible – building a Conservative nation?</p><p>What, precisely, is being conserved here?</p></blockquote><p>At the core of the intellectual case for free trade is the idea that Say’s Law somehow applies to labor, that the aggregate supply of labor necessarily creates an equal quantity of aggregate demand for labor. Hence the claims that since those who had been employed by technologically outdated buggy whip manufacturers found jobs working for automobile manufacturers, those who no longer work for corporations that went offshore will find them doing something else.</p><p>But this is a complete failure of logic. The buggy whip workers were able to go to work for the auto manufacturers because those factories were located in their home states. A Detroit auto worker cannot go to work for a Korean or a German manufacturer, or even for a US automaker who sets up a plant in Mexico.</p><p>Free trade is, in fact, intrinsically anti-conservative, which of course is why revolutionaries such as Karl Marx have historically favored it.</p><p>I should also mention that <i><b><a href=\"https://www.amazon.com/There-Will-Be-War-VI-ebook/dp/B01IMOBC3Y\">There Will Be War Vol. VI</a></b></i> is now out in ebook, and Vols I and II are now available in <a href=\"http://amzn.to/1tkeY6F\">a hardcover omnibus edition</a>.</p></div>",
  "content_text": "Thanks to his\nThere Will Be War\nseries, Jerry Pournelle was one of my biggest intellectual influences as a teenager. If you want to ensure that your teenage sons have an antidote to the progressive and globalist nonsense in which they are engulfed by the mainstream and conservative medias, you simply cannot do better than give them a book or three from that series; the educational aspect of TWBW was the reason it was my absolute top priority to get it back in print. We’ve got seven of\nthe original nine\nback in print already, and we’ll have the rest out by the end of the year.\nNow Jerry is turning his still-formidable intellect\ntowards one of the great questions of the day\n: free trade. It is of particular import for conservatives:\nOne reason Conservatives are advised by Conservative leaders to disagree with Trump is his position on Free Trade. The problem for me is that I do not see Free Trade, particularly laissez faire Free Trade, as necessarily Conservative at all,\nThe advantages of Free Trade are lower prices for stuff. That means they are more cheaply produced. As the economist David Ricardo wrote, there is a principle of comparative advantage that coupled with free trade guarantees maximum profits for when there are no trade restrictions, and impediments to free trade are supposed to be mutually disadvantageous.\nBut do understand, what is conserved is lower prices. Nor social stability. Not communities. Not family life. Indeed those are often disrupted; it’s part of the economic model. Under free trade theory, it’s better to have free trade than community preservation, better to have ghost towns of people displaced because their jobs have been shipped overseas; better to have Detroit as a wasteland than a thriving dynamic industrial society turning out tail finned Cadillacs and insolent chariots and supporting workers represented by rapacious unions in conflict with pitiless corporate executives.\nThe theory of free trade includes liquidity: liquidity in capital flow, and liquidity in labor relocation.\nWhat was conserved by turning Detroit into a wasteland? How was that conservative? Wouldn’t it be more conservative to argue that if everyone pays a little more for stuff made here, by people who work here, we are better off than having it made south of the border and inviting our people to go work there at their prevailing wages?\nGo further. You don’t have to move. We’ll pay you for not working and you don’t have to move. Of course we’ll have to raise taxes on those who do work to pay those people no longer working, but that’s life. But after unemployment benefits work out – in my days the government would pay you $26 a week for 26 weeks – you’re in trouble. So much so that welfare benefits kept being raised. Food stamps, which became larger and bought more items. Negative income tax. And if you dropped out of the labor force – no longer looking for a job – you are no longer unemployed. The unemployment rate just went down. You stopped looking for a job. Of course you don’t have a job – you are certainly not employed – but you aren’t unemployed and don’t count toward the unemployment rate. I wouldn’t have thought that sort of lying to the people by government officials was a very Conservative thing to do at all.\nWould a 15% tariff on cars have saved Detroit? It would mean that I would have had to pay about $5000 more for my 1988 Ford Eddie Bauer V8 Explorer I bought in 1999. I could have afforded that. And I suspect that I’ve paid more in income taxes sent to welfare recipients in Detroit than that. Is paying people not to work more Conservative than trying to keep their jobs – and manufacturing capabilities and potential here, bot dismantling it and leaving its former site to rust away – Conservative?\nAnd is encouraging people not to work – at least making it easier and more possible – building a Conservative nation?\nWhat, precisely, is being conserved here?\nAt the core of the intellectual case for free trade is the idea that Say’s Law somehow applies to labor, that the aggregate supply of labor necessarily creates an equal quantity of aggregate demand for labor. Hence the claims that since those who had been employed by technologically outdated buggy whip manufacturers found jobs working for automobile manufacturers, those who no longer work for corporations that went offshore will find them doing something else.\nBut this is a complete failure of logic. The buggy whip workers were able to go to work for the auto manufacturers because those factories were located in their home states. A Detroit auto worker cannot go to work for a Korean or a German manufacturer, or even for a US automaker who sets up a plant in Mexico.\nFree trade is, in fact, intrinsically anti-conservative, which of course is why revolutionaries such as Karl Marx have historically favored it.\nI should also mention that\nThere Will Be War Vol. VI\nis now out in ebook, and Vols I and II are now available in\na hardcover omnibus edition\n.",
  "tags": [
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-25T14:30:00+00:00"
}