{
  "url": "https://voxday.net/2016/07/01/mailvox-teaching-4gw/",
  "scraped_at": "2025-12-18T01:42:28.706373",
  "title": "Mailvox: teaching 4GW",
  "date_display": "July 1, 2016",
  "date_iso": "2016-07-01T17:03:00+00:00",
  "date_from_url": "2016-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>William S. Lind and LtCol Thiele are improving the state of American university education:</p><blockquote class=\"tr_bq\"><p> I teach undergraduate courses in Political Science and after reading Lind’s <i>Four Generations of Modern War</i> on your recommendation, I had to throw out two whole lectures on war and terrorism.  I’ve gone two semesters with new lectures and I’m looking to expand on this theme in my Intro course through some form of non-lecture activity.  After reading an article from Jeffro on wargaming in the classroom, I’m considering introducing a game which would demonstrate thematic concepts on 4GW, but I have little experience in wargaming beyond Risk and PC gaming. </p><p>Could you recommend an appropriate game?  My classroom size is approximately 10-12, making 2 or 3 person teams possible, and I can probably devote two 1.5 hour sessions to this activity.  Andean Abyss and Cuba Libre have come up but I can’t afford to buy multiple games in a trial-and-error fashion.  Thank you.</p></blockquote><p>Interesting question. Let’s throw this out to everyone and discuss the matter. My first thought was <i>Junta</i>, but that’s probably too focused on the traditional civil unrest. And it has made me think that perhaps it would be worthwhile to design a game around the core 4GW concepts. It wouldn’t be too hard, the first question would be deciding whether to make it totally theoretical or utilizing real and/or historical settings.</p><p>Another possibility would be <i>Fallujah 2004: City Fighting in Iraq</i>. This wouldn’t teach 4GW concepts per se, but would help illustrate some of the challenges involved. However, it’s a solitaire game, which could be seen as a positive or a negative, depending upon the professor’s perspective. <i>Decision Iraq</i> is a two-player game that deals directly with the insurgency, so I’d probably take a close look at that one. The rules can be found on the Decision Games site <a href=\"http://modernwarmagazine.com/mwm/wp-content/uploads/2012/01/MW6_RULES_TXT1.rtf\">here in RTF format</a>.</p></div>",
  "content_text": "William S. Lind and LtCol Thiele are improving the state of American university education:\nI teach undergraduate courses in Political Science and after reading Lind’s\nFour Generations of Modern War\non your recommendation, I had to throw out two whole lectures on war and terrorism.  I’ve gone two semesters with new lectures and I’m looking to expand on this theme in my Intro course through some form of non-lecture activity.  After reading an article from Jeffro on wargaming in the classroom, I’m considering introducing a game which would demonstrate thematic concepts on 4GW, but I have little experience in wargaming beyond Risk and PC gaming.\nCould you recommend an appropriate game?  My classroom size is approximately 10-12, making 2 or 3 person teams possible, and I can probably devote two 1.5 hour sessions to this activity.  Andean Abyss and Cuba Libre have come up but I can’t afford to buy multiple games in a trial-and-error fashion.  Thank you.\nInteresting question. Let’s throw this out to everyone and discuss the matter. My first thought was\nJunta\n, but that’s probably too focused on the traditional civil unrest. And it has made me think that perhaps it would be worthwhile to design a game around the core 4GW concepts. It wouldn’t be too hard, the first question would be deciding whether to make it totally theoretical or utilizing real and/or historical settings.\nAnother possibility would be\nFallujah 2004: City Fighting in Iraq\n. This wouldn’t teach 4GW concepts per se, but would help illustrate some of the challenges involved. However, it’s a solitaire game, which could be seen as a positive or a negative, depending upon the professor’s perspective.\nDecision Iraq\nis a two-player game that deals directly with the insurgency, so I’d probably take a close look at that one. The rules can be found on the Decision Games site\nhere in RTF format\n.",
  "tags": [
    "education",
    "mailvox",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-01T16:03:00+00:00"
}