{
  "url": "https://voxday.net/2016/07/11/mailvox-youre-going-to-need-bigger-state/",
  "scraped_at": "2025-12-18T01:43:40.358065",
  "title": "Mailvox: you’re going to need a bigger state",
  "date_display": "July 11, 2016",
  "date_iso": "2016-07-11T12:00:00+00:00",
  "date_from_url": "2016-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>IreneAthena suggests permitting whites to self-segregate to a reservation:<br/></p><blockquote><p> What’s all this about designating one state, or five, and forcing all the blacks to move there? That idea smacks of the slave trade, with Africans being dragged away from their familiar homes and forced to live in places not of their choosing.</p><p>What we need is a separate state–just one ought to do it — reserved for Whites who can’t manage to live in the same state with any of the other races. If whites want to live in such an exclusive setting, they may, but they’ll have no other options besides that one state. State of the Snow White Princesses Far Away from any Black-Eyed Peas.</p><p>Everyone else can live where they’d like, also. Even the most vocal “we need our safe space” minorities wouldn’t mind living in a mixed-race STATE, or a mixed-race CITY, if not a mixed-race neighborhood. Woik it out, people.</p></blockquote><p>I don’t think she understands how fast tens of millions of white people would move to a state guaranteed to be all-white. Nor does she likely understand how that state would rapidly begin to significantly outperform the rest of the country, or how many non-whites would be clamoring to be permitted entry.</p><p>After all, diversity means nothing more than chasing down white people in an attempt to escape the negative consequences of being surrounded by your own kind. It’s Magic Dirt theory in action.</p><p>The sad thing is that we used to have such a reservation. It was called “America”. Only whites, specifically those of English descent, were truly and properly considered American; that is why all other types of “Americans” are hyphenated or otherwise modified, including “Native Americans”.</p><p>(We American Indians are better understood as pre-Americans in this regard; the concept is concerned with the nation, not the continent.)</p><p>But, rightly or wrongly, the system was designed to permit other whites to become quasi-Americans, which more or less worked until the voluntary nation was transformed into a conventional empire by the force of arms. Which took place, it should not surprise you to know, with considerable assistance from recent immigrants forced into military service.</p><p>I find it both mystifying and amusing that even as many white Americans today lament the disappearance of their rights, the destruction of their communities, and the decline of their society, they continue to cling to the cretinous myth of equality and the equally nonsensical concept of a propositional nation that is, more than <i>anything else</i>, responsible for the very transformations they rightly decry.</p><p>That is why they fully deserve what they are experiencing, and what they are going to experience in the future. It makes absolutely no sense to mourn the decline of America while celebrating equality, diversity, and immigration because it is equality, diversity, and immigration that are the primary causal factors in that decline.</p><p>To quote the great angelic philosopher, Tila Tequila, <i>“People are all angry about what’s happening but guess what? It’s called karma! You cannot stop what is coming for YOU created it!”</i><br> <i><br/></i><br> UPDATE: A reader points out that there are plenty of American blacks who would like to prefer to <a href=\"http://www.breitbart.com/big-government/2016/07/10/exclusive-new-black-panther-leader-country-within/\">have their own homogeneous nation-state</a> too.<br/></br></br></p><blockquote><p> Babu Omowale, the so-called national minister of defense for the People’s New Black Panther Party, says his group and allied organizations have their sights set on establishing “our own government in a nation within a nation.” Omowale used the interview to claim five states as belonging to the “Black Nation”: Louisiana, Mississippi, South Carolina, Alabama, and Georgia.</p><p>The revolutionary stated: “We just need to start migrating back to those states and taking control of the economics in those states. If black people move in, most definitely white people will move out. So it’s not a hard process for us to have our own country within a country.”</p></blockquote><p>I suspect a lot of white Americans would take that deal. After all, only a true racist would oppose African-Americans getting their own sovereign and independent homeland. It’s time for whites to stop oppressing blacks by ruling over them, which is nothing less than a legacy of slavery. It’s time for a national referendum on #Blaxit.</p></div>",
  "content_text": "IreneAthena suggests permitting whites to self-segregate to a reservation:\nWhat’s all this about designating one state, or five, and forcing all the blacks to move there? That idea smacks of the slave trade, with Africans being dragged away from their familiar homes and forced to live in places not of their choosing.\nWhat we need is a separate state–just one ought to do it — reserved for Whites who can’t manage to live in the same state with any of the other races. If whites want to live in such an exclusive setting, they may, but they’ll have no other options besides that one state. State of the Snow White Princesses Far Away from any Black-Eyed Peas.\nEveryone else can live where they’d like, also. Even the most vocal “we need our safe space” minorities wouldn’t mind living in a mixed-race STATE, or a mixed-race CITY, if not a mixed-race neighborhood. Woik it out, people.\nI don’t think she understands how fast tens of millions of white people would move to a state guaranteed to be all-white. Nor does she likely understand how that state would rapidly begin to significantly outperform the rest of the country, or how many non-whites would be clamoring to be permitted entry.\nAfter all, diversity means nothing more than chasing down white people in an attempt to escape the negative consequences of being surrounded by your own kind. It’s Magic Dirt theory in action.\nThe sad thing is that we used to have such a reservation. It was called “America”. Only whites, specifically those of English descent, were truly and properly considered American; that is why all other types of “Americans” are hyphenated or otherwise modified, including “Native Americans”.\n(We American Indians are better understood as pre-Americans in this regard; the concept is concerned with the nation, not the continent.)\nBut, rightly or wrongly, the system was designed to permit other whites to become quasi-Americans, which more or less worked until the voluntary nation was transformed into a conventional empire by the force of arms. Which took place, it should not surprise you to know, with considerable assistance from recent immigrants forced into military service.\nI find it both mystifying and amusing that even as many white Americans today lament the disappearance of their rights, the destruction of their communities, and the decline of their society, they continue to cling to the cretinous myth of equality and the equally nonsensical concept of a propositional nation that is, more than\nanything else\n, responsible for the very transformations they rightly decry.\nThat is why they fully deserve what they are experiencing, and what they are going to experience in the future. It makes absolutely no sense to mourn the decline of America while celebrating equality, diversity, and immigration because it is equality, diversity, and immigration that are the primary causal factors in that decline.\nTo quote the great angelic philosopher, Tila Tequila,\n“People are all angry about what’s happening but guess what? It’s called karma! You cannot stop what is coming for YOU created it!”\nUPDATE: A reader points out that there are plenty of American blacks who would like to prefer to\nhave their own homogeneous nation-state\ntoo.\nBabu Omowale, the so-called national minister of defense for the People’s New Black Panther Party, says his group and allied organizations have their sights set on establishing “our own government in a nation within a nation.” Omowale used the interview to claim five states as belonging to the “Black Nation”: Louisiana, Mississippi, South Carolina, Alabama, and Georgia.\nThe revolutionary stated: “We just need to start migrating back to those states and taking control of the economics in those states. If black people move in, most definitely white people will move out. So it’s not a hard process for us to have our own country within a country.”\nI suspect a lot of white Americans would take that deal. After all, only a true racist would oppose African-Americans getting their own sovereign and independent homeland. It’s time for whites to stop oppressing blacks by ruling over them, which is nothing less than a legacy of slavery. It’s time for a national referendum on #Blaxit.",
  "tags": [
    "decline and fall",
    "immigration",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-11T11:00:00+00:00"
}