{
  "url": "https://voxday.net/2016/07/17/mailvox-stop-posturing-morons/",
  "scraped_at": "2025-12-18T01:44:27.078049",
  "title": "Mailvox: stop posturing, morons",
  "date_display": "July 17, 2016",
  "date_iso": "2016-07-17T09:34:00+00:00",
  "date_from_url": "2016-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The ironically named General Noitall has no idea how clueless he is, but that doesn’t stop him from making confidently authoritative statements that are complete nonsense:</p><blockquote class=\"tr_bq\"><p> Flynn, under Trump, is set to be Sec. of Defense or, more likely, Chairman of the Join Chiefs. And as we know, Flynn “has no idea how to defeat ISIS”. Yet Trump has promised to take out the IS. What’s absolutely clear about Trump is that his understanding of the geopolitical nature of the world amounts to zero. His understanding of force deployment and use is zero. His experience with the military and dealing with the worlds leaders is zero. But, he does have Flynn.</p></blockquote><p>We certainly know that General Noitall’s experience with the military is zero. How, pray tell, is <i>a retired lieutenant general</i> whose background is in intelligence ever going to become Chairman of the Joint Chiefs of Staff?</p><p>For those who don’t know how it works, while the Chairman of the Joint Chiefs is appointed by the President, he is usually selected from among the chiefs of staff – the four highest-ranking generals and admirals- from one of the four armed services. One seldom becomes CJCS without first being Army Chief of Staff, USMC Commandant, Chief of Naval Operations, or Air Force Chief of Staff, and more often than not, Vice-Chairman of the Joint Chiefs of Staff as well. These top officers almost invariably have a strong background of field commands, they don’t come from intelligence or logistics.</p><p>A three-star officer such as a lieutenant general or a vice-admiral is simply not in the running, particularly one <i>who is not even in the service anymore</i>.</p><p>That doesn’t mean Michael Flynn couldn’t be named Secretary of Defense, but then, if elected, Trump could just as easily name the science fiction author Michael Flynn too. Regardless, Michael T. Flynn won’t be commanding any military operations, much less all of them. He’s a civilian.</p><p>Look, you’re not fooling anyone when you strike knowledgeable poses concerning things you know nothing about, and make stupid pronouncements that only suffice to demonstrate your ignorance. So stop trying!</p><p>None of us know what Donald Trump is going to do when he’s elected. Possibly Trump himself doesn’t know. But I think we can be quite confident that he’s not going to follow Michael Ledeen’s idiotic lead and declare war on radical Islam, Iran, Russia, China, North Korea, Cuba, and whoever else Ledeen suspects might be in his imaginary Global Alliance of Evil.</p></div>",
  "content_text": "The ironically named General Noitall has no idea how clueless he is, but that doesn’t stop him from making confidently authoritative statements that are complete nonsense:\nFlynn, under Trump, is set to be Sec. of Defense or, more likely, Chairman of the Join Chiefs. And as we know, Flynn “has no idea how to defeat ISIS”. Yet Trump has promised to take out the IS. What’s absolutely clear about Trump is that his understanding of the geopolitical nature of the world amounts to zero. His understanding of force deployment and use is zero. His experience with the military and dealing with the worlds leaders is zero. But, he does have Flynn.\nWe certainly know that General Noitall’s experience with the military is zero. How, pray tell, is\na retired lieutenant general\nwhose background is in intelligence ever going to become Chairman of the Joint Chiefs of Staff?\nFor those who don’t know how it works, while the Chairman of the Joint Chiefs is appointed by the President, he is usually selected from among the chiefs of staff – the four highest-ranking generals and admirals- from one of the four armed services. One seldom becomes CJCS without first being Army Chief of Staff, USMC Commandant, Chief of Naval Operations, or Air Force Chief of Staff, and more often than not, Vice-Chairman of the Joint Chiefs of Staff as well. These top officers almost invariably have a strong background of field commands, they don’t come from intelligence or logistics.\nA three-star officer such as a lieutenant general or a vice-admiral is simply not in the running, particularly one\nwho is not even in the service anymore\n.\nThat doesn’t mean Michael Flynn couldn’t be named Secretary of Defense, but then, if elected, Trump could just as easily name the science fiction author Michael Flynn too. Regardless, Michael T. Flynn won’t be commanding any military operations, much less all of them. He’s a civilian.\nLook, you’re not fooling anyone when you strike knowledgeable poses concerning things you know nothing about, and make stupid pronouncements that only suffice to demonstrate your ignorance. So stop trying!\nNone of us know what Donald Trump is going to do when he’s elected. Possibly Trump himself doesn’t know. But I think we can be quite confident that he’s not going to follow Michael Ledeen’s idiotic lead and declare war on radical Islam, Iran, Russia, China, North Korea, Cuba, and whoever else Ledeen suspects might be in his imaginary Global Alliance of Evil.",
  "tags": [
    "mailvox",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-17T08:34:00+00:00"
}