{
  "url": "https://voxday.net/2016/07/19/never-trust-drama-queen/",
  "scraped_at": "2025-12-18T01:44:50.683234",
  "title": "Never trust a drama queen",
  "date_display": "July 19, 2016",
  "date_iso": "2016-07-19T22:50:00+00:00",
  "date_from_url": "2016-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not at all surprised that Megyn Kelly is acting up <a href=\"https://deadline.com/2016/07/roger-ailes-out-at-fox-news-1201788998/\">at the expense of Fox New</a>s. No woman that self-centered is capable of restraining herself for the good of the network, even if it is in her own long-term interests. My guess is that she is upset at how Ailes and Fox News didn’t white-knight for her when she took on Donald Trump and lost.</p><blockquote class=\"tr_bq\"><p> Fox News boss Roger Ailes is negotiating his exit, Deadline has confirmed.</p><p>Blogger Matt Drudge put up a headline at the top of his popular aggregation website The Drudge Report this afternoon that Ailes will exit the company with a “$40+ million parachute.” There is no link to a story, but a source subsequently told Deadline that Ailes is in exit talks, saying terms of the settlement are being hammered out tonight.</p><p>“With internal allegations mounting, it was deemed time for him to go,” the well-placed source said. 21st Century Fox, however, said in a statement: “Roger is at work  The review is ongoing. And the only agreement that is in place is his existing employment agreement.”</p><p>Ailes’ ouster comes after Fox News host Gretchen Carlson filed a sexual harassment lawsuit against him on July 6 after her contract was not renewed.</p><p>Ailes, the architect of the Fox News as a ratings behemoth and political force, in of June 2015, signed a multi-year contract to continue running Fox News, Fox Business Network, and Fox Television Stations.</p><p>Earlier this morning, Drudge linked a headline to today’s New York Magazine story, alleging Fox News star Megyn Kelly had told 21st Century Fox’s investigators that she had been the recipient of unwanted sexual advances from Ailes about a decade ago when she was a correspondent in the Washington bureau.</p></blockquote><p>I have no idea, nor do I care, whether Ailes hit on her or not. I suspect that Kelly assumes any man who looks at her for more than 5 seconds is hitting on her. But regardless, it’s <i>prodigiously </i>stupid to break up a situation that is that good for everyone involved.</p></div>",
  "content_text": "I’m not at all surprised that Megyn Kelly is acting up\nat the expense of Fox New\ns. No woman that self-centered is capable of restraining herself for the good of the network, even if it is in her own long-term interests. My guess is that she is upset at how Ailes and Fox News didn’t white-knight for her when she took on Donald Trump and lost.\nFox News boss Roger Ailes is negotiating his exit, Deadline has confirmed.\nBlogger Matt Drudge put up a headline at the top of his popular aggregation website The Drudge Report this afternoon that Ailes will exit the company with a “$40+ million parachute.” There is no link to a story, but a source subsequently told Deadline that Ailes is in exit talks, saying terms of the settlement are being hammered out tonight.\n“With internal allegations mounting, it was deemed time for him to go,” the well-placed source said. 21st Century Fox, however, said in a statement: “Roger is at work  The review is ongoing. And the only agreement that is in place is his existing employment agreement.”\nAiles’ ouster comes after Fox News host Gretchen Carlson filed a sexual harassment lawsuit against him on July 6 after her contract was not renewed.\nAiles, the architect of the Fox News as a ratings behemoth and political force, in of June 2015, signed a multi-year contract to continue running Fox News, Fox Business Network, and Fox Television Stations.\nEarlier this morning, Drudge linked a headline to today’s New York Magazine story, alleging Fox News star Megyn Kelly had told 21st Century Fox’s investigators that she had been the recipient of unwanted sexual advances from Ailes about a decade ago when she was a correspondent in the Washington bureau.\nI have no idea, nor do I care, whether Ailes hit on her or not. I suspect that Kelly assumes any man who looks at her for more than 5 seconds is hitting on her. But regardless, it’s\nprodigiously\nstupid to break up a situation that is that good for everyone involved.",
  "tags": [
    "corpocracy",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-19T21:50:00+00:00"
}