{
  "url": "https://voxday.net/2016/07/23/no-one-foresaw-i/",
  "scraped_at": "2025-12-18T01:45:33.088396",
  "title": "No one foresaw it",
  "date_display": "July 23, 2016",
  "date_iso": "2016-07-23T17:30:00+00:00",
  "date_from_url": "2016-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s no wonder the SF-SJWs are always a few steps behind.</p><blockquote class=\"tr_bq\"><p> It had been believed that the slaters would lose interest if they couldn’t sweep entire categories, since it that would mean that they could neither get awards for their own favorites (since fans would No Award them) nor “burn down” the awards, since fans would have at least a couple of organic works to give awards to. No one foresaw the “griefing” strategy of nominating works whose mere presence on the finalist list would cast the awards into disrepute.<br> – Greg Hullender at File 770</br></p></blockquote><p>They still don’t quite get it, do they? Rabid Puppies didn’t nominate “If You Were a Dinosaur My Love” or “Shadow War of the Night Dragons: Book One: The Dead City: Prologue” for the Hugo Award. We didn’t give a Best Novel Nebula to<i> The Quantum Rose (</i><i>Book 6 in the Saga of the Skolian Empire) </i>or a Best Novel Hugo to <i>Redshirts</i>.</p><p>We’re not casting the awards into disrepute, we are highlighting the fact that the SJWs in science fiction have already made them disreputable. I wonder what they will fail to foresee next? That’s a rhetorical question, of course. I already know.</p><p><a href=\"https://images-na.ssl-images-amazon.com/images/I/51V1IEbabkL.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://images-na.ssl-images-amazon.com/images/I/51V1IEbabkL.jpg\" width=\"191\"/></a>As an aside, I continue to find it funny that the SF-SJWs get so furiously upset about my dismissing so much of their concept of science fiction without the science as mere romance in space. I mean, everyone else clearly gets it, including the publisher.</p><p><i>Ascendant Sun is the direct sequel to The Last Hawk, in which Kelric, heir to the Skolian Empire, crash-landed his fighter on the Restricted planet of Coba. He was imprisoned by the powerful mistresses of the great estates–women who, over time, fell in love with him. After 18 years of living in their gilded cage, Kelric finally made his escape.</i><br> <i><br/></i><br> <i>In Ascendant Sun, Kelric returns to Skolian space, only to find the Empire in control of the Allied forces of Earth. With little more than the clothes on his back, Kelric is forced to take work on a merchant vessel. But when that vessel enters Euban space, Kelric finds his worst nightmare realized: he becomes a slave to the cruel Aristos–humans who use torture and sex as the ultimate aphrodesiac.</i></br></br></p><p>Robert Heinlein, Isaac Asimov, eat your heart out! Remember, <i>Ascendant Sun</i>, Book 5 of 14 in the <i>Saga of the Skolian Empire</i>, is the immediate predecessor to what the SJWs informed us was the very Best Novel in science fiction that year.</p></div>",
  "content_text": "It’s no wonder the SF-SJWs are always a few steps behind.\nIt had been believed that the slaters would lose interest if they couldn’t sweep entire categories, since it that would mean that they could neither get awards for their own favorites (since fans would No Award them) nor “burn down” the awards, since fans would have at least a couple of organic works to give awards to. No one foresaw the “griefing” strategy of nominating works whose mere presence on the finalist list would cast the awards into disrepute.\n– Greg Hullender at File 770\nThey still don’t quite get it, do they? Rabid Puppies didn’t nominate “If You Were a Dinosaur My Love” or “Shadow War of the Night Dragons: Book One: The Dead City: Prologue” for the Hugo Award. We didn’t give a Best Novel Nebula to\nThe Quantum Rose (\nBook 6 in the Saga of the Skolian Empire)\nor a Best Novel Hugo to\nRedshirts\n.\nWe’re not casting the awards into disrepute, we are highlighting the fact that the SJWs in science fiction have already made them disreputable. I wonder what they will fail to foresee next? That’s a rhetorical question, of course. I already know.\nAs an aside, I continue to find it funny that the SF-SJWs get so furiously upset about my dismissing so much of their concept of science fiction without the science as mere romance in space. I mean, everyone else clearly gets it, including the publisher.\nAscendant Sun is the direct sequel to The Last Hawk, in which Kelric, heir to the Skolian Empire, crash-landed his fighter on the Restricted planet of Coba. He was imprisoned by the powerful mistresses of the great estates–women who, over time, fell in love with him. After 18 years of living in their gilded cage, Kelric finally made his escape.\nIn Ascendant Sun, Kelric returns to Skolian space, only to find the Empire in control of the Allied forces of Earth. With little more than the clothes on his back, Kelric is forced to take work on a merchant vessel. But when that vessel enters Euban space, Kelric finds his worst nightmare realized: he becomes a slave to the cruel Aristos–humans who use torture and sex as the ultimate aphrodesiac.\nRobert Heinlein, Isaac Asimov, eat your heart out! Remember,\nAscendant Sun\n, Book 5 of 14 in the\nSaga of the Skolian Empire\n, is the immediate predecessor to what the SJWs informed us was the very Best Novel in science fiction that year.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-23T16:30:00+00:00"
}