{
  "url": "https://voxday.net/2016/07/03/selling-vaporware-expensively/",
  "scraped_at": "2025-12-18T01:42:41.620512",
  "title": "Selling vaporware, expensively",
  "date_display": "July 3, 2016",
  "date_iso": "2016-07-03T15:30:00+00:00",
  "date_from_url": "2016-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is why we are going to crush Tor Books in time. Not so much because our quality is superior, although it is, not so much because people are sick of the SJW bullshit they are selling, although they are. But due to this:<br> <a href=\"http://amzn.to/1Xr3UA5\"><i><br/></i></a><br> <a href=\"http://amzn.to/1Xr3UA5\"><i>Brings the Lightning</i></a>, Peter Grant<br> Kindle: $4.99, Hardcover $19.99, Paperback $12.99, KU free<br> available now</br></br></br></br></p><p><a href=\"http://amzn.to/29Ec3gW\"><i>Empire Games</i></a>, Charles Stross<br> Kindle: $19.99, Hardcover $25.99<br> available January 17, 2017</br></br></p><p><a href=\"http://amzn.to/29eRyeQ\"><i><strike>Foundation</strike>The Collapsing Empire</i></a>, John Scalzi <br> Kindle: $12.99, Hardcover $19.99<br> available March 21, 2017</br></br></p><p>They simply can’t compete, not on quality, not on price, not on value, and not on delivery. Although we signed <i>Brings the Lightning</i> long after Tor signed <i>Foundation’s Collapse</i>, we will likely publish its sequel before the Scalzi book is out. They are cumbersome dinosaurs. We are fast-moving mammals. Vicious, fast-moving mammals who eat dinosaur eggs for breakfast and smash those we’re too full to eat.</p><p>I’m amused at the fact that the PNH-Scalzi-Stross cabal is finally united at Tor Books. SJWs flock together. Stross could have been a great science fiction writer – on the basis of his early work, he <i>should</i> have been a great science fiction writer – but his gamma instincts combined with his mindless devotion to the SJW Narrative led him astray and ruined him. Tor Books will make a fitting grave for his literary career.</p><p>It’s interesting to observe that Tor is already marking down the price of Scalzi’s next book considering that it’s precisely the same page count as Stross’s. We charge less because we have no overhead, and unlike Tor Books, I don’t believe in taking advantage of readers to cover nonexistent print costs on the Kindle versions. At 336 pages and $19.99, allowing for the usual channel discounts, Tor appears to be selling hardcover at very near cost.</p><p>I wonder what that signifies? Does it, perchance, have anything to do with the fact that Tor’s owner, Pan Macmillan, suffered the biggest sales decline of all the Big Five in 2015, -7.7 percent?</p><p>We may have interpreted John Scalzi incorrectly. He may not be the Bernie Madoff of science fiction after all, but the <i>Star Citizen</i> of Tor Books.</p></div>",
  "content_text": "This is why we are going to crush Tor Books in time. Not so much because our quality is superior, although it is, not so much because people are sick of the SJW bullshit they are selling, although they are. But due to this:\nBrings the Lightning\n, Peter Grant\nKindle: $4.99, Hardcover $19.99, Paperback $12.99, KU free\navailable now\nEmpire Games\n, Charles Stross\nKindle: $19.99, Hardcover $25.99\navailable January 17, 2017\nFoundation\nThe Collapsing Empire\n, John Scalzi\nKindle: $12.99, Hardcover $19.99\navailable March 21, 2017\nThey simply can’t compete, not on quality, not on price, not on value, and not on delivery. Although we signed\nBrings the Lightning\nlong after Tor signed\nFoundation’s Collapse\n, we will likely publish its sequel before the Scalzi book is out. They are cumbersome dinosaurs. We are fast-moving mammals. Vicious, fast-moving mammals who eat dinosaur eggs for breakfast and smash those we’re too full to eat.\nI’m amused at the fact that the PNH-Scalzi-Stross cabal is finally united at Tor Books. SJWs flock together. Stross could have been a great science fiction writer – on the basis of his early work, he\nshould\nhave been a great science fiction writer – but his gamma instincts combined with his mindless devotion to the SJW Narrative led him astray and ruined him. Tor Books will make a fitting grave for his literary career.\nIt’s interesting to observe that Tor is already marking down the price of Scalzi’s next book considering that it’s precisely the same page count as Stross’s. We charge less because we have no overhead, and unlike Tor Books, I don’t believe in taking advantage of readers to cover nonexistent print costs on the Kindle versions. At 336 pages and $19.99, allowing for the usual channel discounts, Tor appears to be selling hardcover at very near cost.\nI wonder what that signifies? Does it, perchance, have anything to do with the fact that Tor’s owner, Pan Macmillan, suffered the biggest sales decline of all the Big Five in 2015, -7.7 percent?\nWe may have interpreted John Scalzi incorrectly. He may not be the Bernie Madoff of science fiction after all, but the\nStar Citizen\nof Tor Books.",
  "tags": [
    "books",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-03T14:30:00+00:00"
}