{
  "url": "https://voxday.net/2016/07/16/star-citizen-backers-perspective/",
  "scraped_at": "2025-12-18T01:44:23.086887",
  "title": "Star Citizen: a backer’s perspective",
  "date_display": "July 16, 2016",
  "date_iso": "2016-07-16T15:00:00+00:00",
  "date_from_url": "2016-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An old school Wing Commander fan explains why he backed Star Citizen and why, despite being a critic of Derek Smart, he has reluctantly come to conclude that Derek <a href=\"http://www.kristoffer.com/?p=6632\">appears to be more or less correct</a>:</p><blockquote class=\"tr_bq\"><p> After the initial crowdfunding campaign they kept promising more and more stuff. Not only had the game gone from being the “spiritual successor of Wing Commander” (a single player game), it was blowing up to be a full MMORPG. And I was fine with that. At first. I was so fine that when they showed off the Retaliator bomber I loved it and dished out $225 for one. And the idea of being information smuggler sounded cool so I dished out money for that too. But then as they continued to get millions of dollars every month I kinda saw it getting out of hand. I fully realise I know very little of what it actually takes to deliver a game and I know it takes a lot of time to make a game. A delay can easily be a year. But when they were promising new features, new ships without actually releasing much I kinda saw the problems of this ever being released. If they take two-three months to get a ship to “flight ready” and they keep coming up with 7-8 new ships every year, how are they ever to get done? If they add new feature to the scope before releasing the basic ones promised during Kickstarter like trading, how are they ever gonna get done?</p><p>And during July of 2015 Derek Smart happened. He’s a game maker who has tried to pull off these grand space games for years and never really made it. Which means he knows some of the pitfalls of even trying. He started criticising the “Star Citizen” project – very vocally, bullyuishly, annoyingly, contrived, “deliberately wanting to turn everything into a bad thing” way. And he got very personal against Chris Roberts, his wife and his lawyer (that all co-founded the studio) in a way that was really uncool. But he always stopped right at the border of lying or making shit up. Yes, he twisted everything into a negative thing. And I was right there to point out the actual facts. But the problem of trying to argue with him was the fact that “CIG” (the studio making the game) never managed to prove him wrong. They never managed to shut him up by stepping up to the plate and deliver. Instead, they made his case stronger by coming up with more irrelevant features (plants anyone?), more subscriber flare, more ship-concept sales, more of everything except actual game content. An all this while constantly missing “estimated” release dates that they themselves estimated and set.</p><p>Then they went ahead and wrote a new Terms of Service that we have to accept. Which is fine, Blizzard does it all the time. But I actually read those things, it’s a result of working with lawyers for 8 years – I actually read before I sign. And in this Terms of Service they had removed any accountability what so ever, every chance of demanding a refund. It was basically a carté blanche for them to sail away with the $117+ million they had gotten from backers and as long as the company CIG was still “active” and stating the game was still being worked on (without ever actually delivering anything) then we had no rights at all as consumers. I really wasn’t OK with that. So I refused to accept the terms of service. That had the side effect of me not being able to login to the so called “game”.</p></blockquote><p> Hey, I assumed Derek was full of it too at first, but that was a consequence of my complete ignorance about what he’d been up to since the <i>Battlecruiser 3000 AD</i> days. After he appeared on Brainstorm last year, and convinced a number of game devs, who were far more dubious about him than the average gamer can likely understand, that he knew what he was talking about and that there were intractable problems designed into the development plan, I freely admitted I’d misjudged him.</p><p>I even invited him to speak at DevGame, which he did, and where he was a hit with many of the larval game developers there.</p><p>The ironic thing is that I’ve known and liked Chris for a long time. I even tried to help him get funding for the Wing Commander reboot, and I could have easily been an early team member of Star Citizen; he was very interested in using my psychological AI approach for the AI-controlled wingmen back when it was still going to be a Wing Commander-style game.</p><p>But no amount of doubts about Derek or respect for Chris changes the facts on the ground. They are what they are. And repeatedly, they have demonstrated that Derek is correct, the skeptical industry observers are correct, and the final meltdown is coming into view. This TOS fiasco looks exceptionally shady to me, and likely marks the beginning of the end.</p><p>However, Chris may have one last maneuver in him. Derek and I were discussing this – Derek was initially of the opinion that there is no way out – but it’s what I would do if Chris unexpectedly asked me to rescue the project.</p><ol><li>Freeze all game development and release all game dev personnel.</li><li>Take the massive amount of footage and effects and turn them into a movie.</li><li>Release the movie and pray for sufficient success to provide the funding for developing a new Wing Commander-style game of the sort that people wanted in the first place.</li></ol><p>It’s a Hail Mary, but it’s the one approach for which Chris still has the resources, and perhaps more importantly, which still has the capability to provide outcomes that will keep everyone more or less happy, employed, and out of prison. Movies are much simpler than games, particularly big budget games, and although the chances of Chris making a good movie that will be successful enough to kick out the $25 million needed to remake Wing Commander are slim, slim is always a damned sight better than none.</p></div>",
  "content_text": "An old school Wing Commander fan explains why he backed Star Citizen and why, despite being a critic of Derek Smart, he has reluctantly come to conclude that Derek\nappears to be more or less correct\n:\nAfter the initial crowdfunding campaign they kept promising more and more stuff. Not only had the game gone from being the “spiritual successor of Wing Commander” (a single player game), it was blowing up to be a full MMORPG. And I was fine with that. At first. I was so fine that when they showed off the Retaliator bomber I loved it and dished out $225 for one. And the idea of being information smuggler sounded cool so I dished out money for that too. But then as they continued to get millions of dollars every month I kinda saw it getting out of hand. I fully realise I know very little of what it actually takes to deliver a game and I know it takes a lot of time to make a game. A delay can easily be a year. But when they were promising new features, new ships without actually releasing much I kinda saw the problems of this ever being released. If they take two-three months to get a ship to “flight ready” and they keep coming up with 7-8 new ships every year, how are they ever to get done? If they add new feature to the scope before releasing the basic ones promised during Kickstarter like trading, how are they ever gonna get done?\nAnd during July of 2015 Derek Smart happened. He’s a game maker who has tried to pull off these grand space games for years and never really made it. Which means he knows some of the pitfalls of even trying. He started criticising the “Star Citizen” project – very vocally, bullyuishly, annoyingly, contrived, “deliberately wanting to turn everything into a bad thing” way. And he got very personal against Chris Roberts, his wife and his lawyer (that all co-founded the studio) in a way that was really uncool. But he always stopped right at the border of lying or making shit up. Yes, he twisted everything into a negative thing. And I was right there to point out the actual facts. But the problem of trying to argue with him was the fact that “CIG” (the studio making the game) never managed to prove him wrong. They never managed to shut him up by stepping up to the plate and deliver. Instead, they made his case stronger by coming up with more irrelevant features (plants anyone?), more subscriber flare, more ship-concept sales, more of everything except actual game content. An all this while constantly missing “estimated” release dates that they themselves estimated and set.\nThen they went ahead and wrote a new Terms of Service that we have to accept. Which is fine, Blizzard does it all the time. But I actually read those things, it’s a result of working with lawyers for 8 years – I actually read before I sign. And in this Terms of Service they had removed any accountability what so ever, every chance of demanding a refund. It was basically a carté blanche for them to sail away with the $117+ million they had gotten from backers and as long as the company CIG was still “active” and stating the game was still being worked on (without ever actually delivering anything) then we had no rights at all as consumers. I really wasn’t OK with that. So I refused to accept the terms of service. That had the side effect of me not being able to login to the so called “game”.\nHey, I assumed Derek was full of it too at first, but that was a consequence of my complete ignorance about what he’d been up to since the\nBattlecruiser 3000 AD\ndays. After he appeared on Brainstorm last year, and convinced a number of game devs, who were far more dubious about him than the average gamer can likely understand, that he knew what he was talking about and that there were intractable problems designed into the development plan, I freely admitted I’d misjudged him.\nI even invited him to speak at DevGame, which he did, and where he was a hit with many of the larval game developers there.\nThe ironic thing is that I’ve known and liked Chris for a long time. I even tried to help him get funding for the Wing Commander reboot, and I could have easily been an early team member of Star Citizen; he was very interested in using my psychological AI approach for the AI-controlled wingmen back when it was still going to be a Wing Commander-style game.\nBut no amount of doubts about Derek or respect for Chris changes the facts on the ground. They are what they are. And repeatedly, they have demonstrated that Derek is correct, the skeptical industry observers are correct, and the final meltdown is coming into view. This TOS fiasco looks exceptionally shady to me, and likely marks the beginning of the end.\nHowever, Chris may have one last maneuver in him. Derek and I were discussing this – Derek was initially of the opinion that there is no way out – but it’s what I would do if Chris unexpectedly asked me to rescue the project.\nFreeze all game development and release all game dev personnel.\nTake the massive amount of footage and effects and turn them into a movie.\nRelease the movie and pray for sufficient success to provide the funding for developing a new Wing Commander-style game of the sort that people wanted in the first place.\nIt’s a Hail Mary, but it’s the one approach for which Chris still has the resources, and perhaps more importantly, which still has the capability to provide outcomes that will keep everyone more or less happy, employed, and out of prison. Movies are much simpler than games, particularly big budget games, and although the chances of Chris making a good movie that will be successful enough to kick out the $25 million needed to remake Wing Commander are slim, slim is always a damned sight better than none.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-16T14:00:00+00:00"
}