{
  "url": "https://voxday.net/2016/07/29/talking-sjws-with-tom-woods/",
  "scraped_at": "2025-12-18T01:46:27.693277",
  "title": "Talking SJWs with Tom Woods",
  "date_display": "July 29, 2016",
  "date_iso": "2016-07-29T12:00:00+00:00",
  "date_from_url": "2016-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>What exactly is the ideology of the “Social Justice Warrior”? What do you do when you’re targeted by one, whether at work or in general? Vox Day — popular blogger, author, SJW slayer, and polymath — joins me for background and strategy.</i></p><p>Tom Woods was kind enough to have me as a guest on Episode 703 of his podcast, <i><a href=\"http://tomwoods.com/podcast/ep-703-social-justice-warriors-who-they-are-and-how-to-deal-with-them/\">Social Justice Warriors: Who They Are and How to Deal With Them</a></i>. Tom is a sharp guy and I always enjoy speaking with him.</p><p>Of course, we were discussing the book that has been a political philosophy bestseller for nearly a year now, <b><i><a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie: Taking Down the Thought Police</a></i></b>. As its first year of publication comes to a close, it is still a top 2 book in the category, trailing only Plato’s <i>Republic</i>.</p><p>Which reminds me. How many people here would be interested in reading annotated editions of classics like the <i>Republic </i>or Aristotle’s<i> Rhetoric</i>, which would consist of the text with my commentary on the text woven into it. We could even do it with other classic works and commentators; I would love to have a copy of Clausewitz’s <i>On War</i> annotated by Martin van Creveld. I’m not promising anything, as I have three – no, four – books I’m already writing, but it’s an idea that might be worth exploring.</p></div>",
  "content_text": "What exactly is the ideology of the “Social Justice Warrior”? What do you do when you’re targeted by one, whether at work or in general? Vox Day — popular blogger, author, SJW slayer, and polymath — joins me for background and strategy.\nTom Woods was kind enough to have me as a guest on Episode 703 of his podcast,\nSocial Justice Warriors: Who They Are and How to Deal With Them\n. Tom is a sharp guy and I always enjoy speaking with him.\nOf course, we were discussing the book that has been a political philosophy bestseller for nearly a year now,\nSJWs Always Lie: Taking Down the Thought Police\n. As its first year of publication comes to a close, it is still a top 2 book in the category, trailing only Plato’s\nRepublic\n.\nWhich reminds me. How many people here would be interested in reading annotated editions of classics like the\nRepublic\nor Aristotle’s\nRhetoric\n, which would consist of the text with my commentary on the text woven into it. We could even do it with other classic works and commentators; I would love to have a copy of Clausewitz’s\nOn War\nannotated by Martin van Creveld. I’m not promising anything, as I have three – no, four – books I’m already writing, but it’s an idea that might be worth exploring.",
  "tags": [
    "media",
    "SJW",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-29T11:00:00+00:00"
}