{
  "url": "https://voxday.net/2016/07/29/the-pillaging-of-russia/",
  "scraped_at": "2025-12-18T01:46:31.492187",
  "title": "The pillaging of Russia",
  "date_display": "July 29, 2016",
  "date_iso": "2016-07-29T17:32:00+00:00",
  "date_from_url": "2016-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://takimag.com/article/putin_1_internation_vampires_0_costin_alamariu#axzz4Fl7mEPdO\">Why the globalists hate Vladimir Putin</a> and why they are terrified that Donald Trump will win the US election:<br/></p><blockquote><p> The international interests that financially wrecked Russia in the ’90s are doing the same to the United States now. Putin stopped them in Russia and Trump is promising to stop them in America. They recognize Trump as the enemy and slander in the only style they know—the paranoid style.</p><p>“The international interests that financially wrecked Russia in the ’90s are doing the same to the United States now.”</p><p>Trump was once blamed for praising Putin’s performance. But he was right. Pensions, salaries, GDP, and the value of gold reserves in Russia have risen greatly since 1999—in some cases tenfold or more. This was while both inflation and the debt-to-GDP ratio declined by orders of magnitude. The rise in living standard under Putin is reflected in longer life expectancy: It had dropped to a third-world level during the 1990s, to around 55–57, and has now risen back up to 70 by most measures. Birthrates have normalized and recently overtaken the United States. Visit Moscow and you will see infrastructure, buildings, and development that are more impressive than those found in any American city—though the same could be said, of course, for many other countries now.</p><p>By contrast, Russians remember the liberal and globalist experiment of the ’90s as a time of great suffering. The early death of literally millions of people from economic deprivation, the utter ruin of many of Russia’s formerly world-class industries: This is the legacy of economic liberalization in Russia. How did it happen?</p><p>In short, “entrepreneurs” would run fraudulently acquired businesses into the ground, fire-sale the assets internationally, and move abroad with the profits. This is globalism in its purest form, without the slogans and boosterism. American economists, academics, and businessmen played an important part in all of this. Marc Rich—a fugitive later pardoned by Bill Clinton—was, for example, “the largest trader of Russia’s oil and aluminum on a spot basis,” according to Steve Sailer, who has documented the “rape of Russia” in some detail. George Soros was a large investor in these ventures, which provided the international market with financial backing, and cover for the oligarchs’ robbery of their own people. This was done especially under Boris Jordan’s CS First Boston bank and later Renaissance Capital, Moscow “investment banks” staffed by Soros associates.</p><p>Even more important was a group of Harvard and MIT economists who advised and assisted the Russian government in the reforms. These are men still involved in public life in the United States: current vice chairman of the Federal Reserve Stanley Fischer, Jeffrey Sachs, Jonathan Hay, Andrei Shleifer, and Larry Summers, who was later Secretary of the Treasury under Bill Clinton. As late as 1998, months before Russia defaulted, Fischer claimed that the Yeltsin regime had to be praised for following the advice of this group. Using the rhetoric of liberalization and globalism, American academics and financiers played a key role in the pillaging of Russia.</p></blockquote><p>The fact that those who financially raped Russia are opposed to Donald Trump is, in itself, reason to support the man’s campaign for the Presidency. And for those who are inclined to cry “anti-semitism” due to the (((heritage))) of more than a few of the individuals named, is this sort of behavior <i>really </i>the sort of thing you want to go on the public record defending?</p><p><i>The Economist</i> was right about one thing. The battle is no longer about Left and Right factions of a nation, but rather, between Globalism and Nationalism. It’s the battle between vampires and humans. And if you support Globalism, you’re on the wrong side, no matter who you are or why you support it.</p></div>",
  "content_text": "Why the globalists hate Vladimir Putin\nand why they are terrified that Donald Trump will win the US election:\nThe international interests that financially wrecked Russia in the ’90s are doing the same to the United States now. Putin stopped them in Russia and Trump is promising to stop them in America. They recognize Trump as the enemy and slander in the only style they know—the paranoid style.\n“The international interests that financially wrecked Russia in the ’90s are doing the same to the United States now.”\nTrump was once blamed for praising Putin’s performance. But he was right. Pensions, salaries, GDP, and the value of gold reserves in Russia have risen greatly since 1999—in some cases tenfold or more. This was while both inflation and the debt-to-GDP ratio declined by orders of magnitude. The rise in living standard under Putin is reflected in longer life expectancy: It had dropped to a third-world level during the 1990s, to around 55–57, and has now risen back up to 70 by most measures. Birthrates have normalized and recently overtaken the United States. Visit Moscow and you will see infrastructure, buildings, and development that are more impressive than those found in any American city—though the same could be said, of course, for many other countries now.\nBy contrast, Russians remember the liberal and globalist experiment of the ’90s as a time of great suffering. The early death of literally millions of people from economic deprivation, the utter ruin of many of Russia’s formerly world-class industries: This is the legacy of economic liberalization in Russia. How did it happen?\nIn short, “entrepreneurs” would run fraudulently acquired businesses into the ground, fire-sale the assets internationally, and move abroad with the profits. This is globalism in its purest form, without the slogans and boosterism. American economists, academics, and businessmen played an important part in all of this. Marc Rich—a fugitive later pardoned by Bill Clinton—was, for example, “the largest trader of Russia’s oil and aluminum on a spot basis,” according to Steve Sailer, who has documented the “rape of Russia” in some detail. George Soros was a large investor in these ventures, which provided the international market with financial backing, and cover for the oligarchs’ robbery of their own people. This was done especially under Boris Jordan’s CS First Boston bank and later Renaissance Capital, Moscow “investment banks” staffed by Soros associates.\nEven more important was a group of Harvard and MIT economists who advised and assisted the Russian government in the reforms. These are men still involved in public life in the United States: current vice chairman of the Federal Reserve Stanley Fischer, Jeffrey Sachs, Jonathan Hay, Andrei Shleifer, and Larry Summers, who was later Secretary of the Treasury under Bill Clinton. As late as 1998, months before Russia defaulted, Fischer claimed that the Yeltsin regime had to be praised for following the advice of this group. Using the rhetoric of liberalization and globalism, American academics and financiers played a key role in the pillaging of Russia.\nThe fact that those who financially raped Russia are opposed to Donald Trump is, in itself, reason to support the man’s campaign for the Presidency. And for those who are inclined to cry “anti-semitism” due to the (((heritage))) of more than a few of the individuals named, is this sort of behavior\nreally\nthe sort of thing you want to go on the public record defending?\nThe Economist\nwas right about one thing. The battle is no longer about Left and Right factions of a nation, but rather, between Globalism and Nationalism. It’s the battle between vampires and humans. And if you support Globalism, you’re on the wrong side, no matter who you are or why you support it.",
  "tags": [
    "#AltRight",
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-29T16:32:00+00:00"
}