{
  "url": "https://voxday.net/2016/07/06/the-media-comes-after-alt-rig/",
  "scraped_at": "2025-12-18T01:42:59.921378",
  "title": "The media comes after the Alt-Right",
  "date_display": "July 6, 2016",
  "date_iso": "2016-07-06T10:22:00+00:00",
  "date_from_url": "2016-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I mentioned a few days ago, it’s a big mistake for anyone on the Right to talk to the mainstream media. As I was explaining to one of the Dread Ilk yesterday, only a complete amateur believes he can somehow spin media coverage to his advantage, and only a complete innocent believes the media is genuinely interested in his story, giving him the chance to set the record straight, or wants to present both sides of the situation.</p><p>When a journalist contacts you, he already has the story outlined, the narrative is already established, and often, it has already been approved by an editor. Unbeknownst to you, your role has already been established, and if you are on the Right, you are almost certainly playing the role of the villain of the piece. The reason they are calling you, and will spend up to six hours talking to you, is to glean that single sentence or two they can use to put you on stage in your appointed character as Richard III or Iago.</p><p>You’re not going to play them. The average journalist has successfully played hundreds of people and is an expert at pretending to be a new and sympathetic friend before ritually sacrificing you before the public. They don’t hesitate to edit and elide, to insert nonexistent dialogue and false reaction faces, in order to present an intentionally false version of events. They are more cunning and insidious than you suspect. Consider that despite my customary caution, Amy Wallace of <i>Wired</i> managed to disarm my defenses by first interviewing Larry Correia and Brad Torgerson in an entirely friendly manner, then reading the pre-release version of SJWAL before interviewing me.</p><p>She then spent three freaking hours talking to me about the Hugos and science fiction, when all she was really after was a means of character-assassination required to support the SF-SJW Narrative of racist Puppies. She didn’t care about Correia or Torgerson or the Hugo Awards, I was the target all along. The only reason she failed was due to her being a parochial American; she didn’t realize the kill-quote that sounded so horrendously racist to Americans was, in fact, an accurate reference to a genuine and widespread problem in Europe, an issue that soon after broke into the English-language media via the UK.</p><p>Anyhow, several major news organization are now working on a stories about the Alt Right and connecting it to the rise of Trump. All of us have refused to talk to them, which means that they will have to make do with putting on their Kabuki play without an on-screen villain, or at best, a foolish lesser player or two dressed up in the villain’s clothes.</p><p>As Cernovich rightly points out, they need us more than we need them. We can help them sell their Narrative if we are foolish enough to play along, but we have no need of their exposure or their false promises of presenting our side of the story to the public. We will do that ourselves, and we will ultimately replace them as people increasingly turn to us for the simple reason that we tell the truth exactly as we see it, we do not knowingly push false narratives on the public and pretend that they are true.</p><p>My media policy is fairly straightforward. I will only do recorded radio or podcast interviews with Alt Right-friendly parties who are not part of any mainstream organization. Any interview with a newspaper or a blog must be written; no telephone or Skype interviews. No television period. No radio unless it is live and the purpose of the interview is clearly provided beforehand.</p><p>UPDATE: One of the organizations has asked me if I am willing to respond in writing to their written questions. While I’m not quite certain how that will work in a broadcast environment, I have agreed to do so, partly as an experiment, but mostly because I would prefer to provide the quotes being utilized rather than have them resort to cherry-picking them from my various writings.</p></div>",
  "content_text": "As I mentioned a few days ago, it’s a big mistake for anyone on the Right to talk to the mainstream media. As I was explaining to one of the Dread Ilk yesterday, only a complete amateur believes he can somehow spin media coverage to his advantage, and only a complete innocent believes the media is genuinely interested in his story, giving him the chance to set the record straight, or wants to present both sides of the situation.\nWhen a journalist contacts you, he already has the story outlined, the narrative is already established, and often, it has already been approved by an editor. Unbeknownst to you, your role has already been established, and if you are on the Right, you are almost certainly playing the role of the villain of the piece. The reason they are calling you, and will spend up to six hours talking to you, is to glean that single sentence or two they can use to put you on stage in your appointed character as Richard III or Iago.\nYou’re not going to play them. The average journalist has successfully played hundreds of people and is an expert at pretending to be a new and sympathetic friend before ritually sacrificing you before the public. They don’t hesitate to edit and elide, to insert nonexistent dialogue and false reaction faces, in order to present an intentionally false version of events. They are more cunning and insidious than you suspect. Consider that despite my customary caution, Amy Wallace of\nWired\nmanaged to disarm my defenses by first interviewing Larry Correia and Brad Torgerson in an entirely friendly manner, then reading the pre-release version of SJWAL before interviewing me.\nShe then spent three freaking hours talking to me about the Hugos and science fiction, when all she was really after was a means of character-assassination required to support the SF-SJW Narrative of racist Puppies. She didn’t care about Correia or Torgerson or the Hugo Awards, I was the target all along. The only reason she failed was due to her being a parochial American; she didn’t realize the kill-quote that sounded so horrendously racist to Americans was, in fact, an accurate reference to a genuine and widespread problem in Europe, an issue that soon after broke into the English-language media via the UK.\nAnyhow, several major news organization are now working on a stories about the Alt Right and connecting it to the rise of Trump. All of us have refused to talk to them, which means that they will have to make do with putting on their Kabuki play without an on-screen villain, or at best, a foolish lesser player or two dressed up in the villain’s clothes.\nAs Cernovich rightly points out, they need us more than we need them. We can help them sell their Narrative if we are foolish enough to play along, but we have no need of their exposure or their false promises of presenting our side of the story to the public. We will do that ourselves, and we will ultimately replace them as people increasingly turn to us for the simple reason that we tell the truth exactly as we see it, we do not knowingly push false narratives on the public and pretend that they are true.\nMy media policy is fairly straightforward. I will only do recorded radio or podcast interviews with Alt Right-friendly parties who are not part of any mainstream organization. Any interview with a newspaper or a blog must be written; no telephone or Skype interviews. No television period. No radio unless it is live and the purpose of the interview is clearly provided beforehand.\nUPDATE: One of the organizations has asked me if I am willing to respond in writing to their written questions. While I’m not quite certain how that will work in a broadcast environment, I have agreed to do so, partly as an experiment, but mostly because I would prefer to provide the quotes being utilized rather than have them resort to cherry-picking them from my various writings.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-06T09:22:00+00:00"
}