{
  "url": "https://voxday.net/2016/07/19/the-hero-of-nice-lives/",
  "scraped_at": "2025-12-18T01:44:45.195051",
  "title": "The hero of Nice lives",
  "date_display": "July 19, 2016",
  "date_iso": "2016-07-19T08:36:00+00:00",
  "date_from_url": "2016-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m glad to learn that <a href=\"http://www.dailymail.co.uk/news/article-3696234/I-tried-open-door-pulled-gun-Hero-motorcyclist-reveals-moment-jumped-bike-stop-ISIS-killer-truck.html\">the courageous motorcyclist who attacked the truck in Nice survived</a>; I didn’t realize that he was actually helped stop the truck in the end. It had been assumed that he’d been killed due to the scooter under the truck, but it turns out that the scooter was thrown there intentionally.</p><blockquote class=\"tr_bq\"><p> A hero motorcyclist has told of his frantic bid to stop ISIS truck terrorist Mohamed Bouhlel by trying to jump from his bike and onto the lorry as it ploughed at high speed into crowds in Nice. In an act of astonishing bravery, Alexander Migues sped his bike alongside the 19-tonne truck as Bouhlel ran over 84 people watching fireworks on Bastille Day.</p><p>Speaking for the time, he revealed how he leapt onto the moving death machine and clung on as he tried to wrestle the driver’s-side door open several times as the truck sped along the promenade.</p><p>‘I saw the truck rise (over the median strip) and run over a lady, he told Nice Martin. ‘He was on the sidewalk and then he returned to the road and he tried to run me over too. It was instinctive, I cannot even explain how I managed to go chasing a truck. When I saw that he was really determined, I tried something,’ Migues said</p><p>Despite his bravery, Migues was forced to abandon his attempt when the terrorist pulled a gun on him. The Frenchman has been credited with saving lives by slowing the truck enough to give another motorcyclist time to throw his scooter under the wheels of the lorry.</p><p>‘He arrived in a scooter and threw it under the wheels of the truck to stop. I let go of the door and when the scooter tapped the truck I heard the noise of bullets,’ Migues said.</p><p>He said he wished he could have hung onto the truck longer and slowed it more so that victims would have had more time to flee its deadly path. But he can take comfort that the time when the scooter went under the truck to when the police engaged in a firefight there were no more killed.</p></blockquote><p>In one of the non-fiction articles that will either appear in RTRH 2 or TWBW 11, the special forces author recommends that the best way to survive an urban attack is to adopt an attacker’s mentality, to <i>move</i>, and to act without hesitation. Alexander Migues is an exceptional example of a man who did just that.</p><p>And if Migues hadn’t forced Mohamed Bouhlel to deal with his attempts to get into the cab, Bouhlel would not have slowed down enough for the scooter to stop the truck.</p></div>",
  "content_text": "I’m glad to learn that\nthe courageous motorcyclist who attacked the truck in Nice survived\n; I didn’t realize that he was actually helped stop the truck in the end. It had been assumed that he’d been killed due to the scooter under the truck, but it turns out that the scooter was thrown there intentionally.\nA hero motorcyclist has told of his frantic bid to stop ISIS truck terrorist Mohamed Bouhlel by trying to jump from his bike and onto the lorry as it ploughed at high speed into crowds in Nice. In an act of astonishing bravery, Alexander Migues sped his bike alongside the 19-tonne truck as Bouhlel ran over 84 people watching fireworks on Bastille Day.\nSpeaking for the time, he revealed how he leapt onto the moving death machine and clung on as he tried to wrestle the driver’s-side door open several times as the truck sped along the promenade.\n‘I saw the truck rise (over the median strip) and run over a lady, he told Nice Martin. ‘He was on the sidewalk and then he returned to the road and he tried to run me over too. It was instinctive, I cannot even explain how I managed to go chasing a truck. When I saw that he was really determined, I tried something,’ Migues said\nDespite his bravery, Migues was forced to abandon his attempt when the terrorist pulled a gun on him. The Frenchman has been credited with saving lives by slowing the truck enough to give another motorcyclist time to throw his scooter under the wheels of the lorry.\n‘He arrived in a scooter and threw it under the wheels of the truck to stop. I let go of the door and when the scooter tapped the truck I heard the noise of bullets,’ Migues said.\nHe said he wished he could have hung onto the truck longer and slowed it more so that victims would have had more time to flee its deadly path. But he can take comfort that the time when the scooter went under the truck to when the police engaged in a firefight there were no more killed.\nIn one of the non-fiction articles that will either appear in RTRH 2 or TWBW 11, the special forces author recommends that the best way to survive an urban attack is to adopt an attacker’s mentality, to\nmove\n, and to act without hesitation. Alexander Migues is an exceptional example of a man who did just that.\nAnd if Migues hadn’t forced Mohamed Bouhlel to deal with his attempts to get into the cab, Bouhlel would not have slowed down enough for the scooter to stop the truck.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-19T07:36:00+00:00"
}