{
  "url": "https://voxday.net/2016/07/21/the-cucks-concur/",
  "scraped_at": "2025-12-18T01:45:10.855368",
  "title": "The cucks concur",
  "date_display": "July 21, 2016",
  "date_iso": "2016-07-21T19:30:00+00:00",
  "date_from_url": "2016-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lion Ted Cruz wowed America and all but secured the 2020 nomination with his amazing non-endorsement speech at the RNC:</p><blockquote class=\"tr_bq\"><p> Erick Erickson ‏@EWErickson<br> LION TED CRUZ</br></p><p>David Frum ‏@davidfrum<br> Ted Cruz earned the most honorable boos at a GOP convention since those for Nelson Rockefeller for condemning the John Birch Society.</br></p><p>Erick Erickson ‏@EWErickson<br> Ted Cruz is the only one in Cleveland not willing to whore himself to Cheeto Jesus. History will favor him.</br></p><p>Matthew Continetti ‏@continetti<br> The nationalists may very well take over the GOP for years to come. That doesn’t mean conservatives should be quiet. @tedcruz won’t be.</br></p><p>Jonah Goldberg‏@JonahNRO<br> I choose Ted.</br></p><p>Robert P. George ‏@McCormickProf<br> Ted has never been afraid to enter a hostile environment and speak his mind. He was like that even as an undergrad. He can’t be intimidated.</br></p><p>Erick Erickson ‏@EWErickson<br> Trump supporters have so much butt hurt over Cruz, who said to go vote in November and congratulated Trump.</br></p><p>Meghan McCain ‏@MeghanMcCain<br> Ted Cruz. Mic drop. Thank god someone still cares about the soul of the party of Lincoln and Reagan.</br></p><p>Erick Erickson ‏@EWErickson<br> Of note, Ted Cruz is getting praised from both the left and right of the GOP, but not from the establishment. Perfect set up for 2020.</br></p><p>Jim Treacher ‏@jtLOL<br> Ted Cruz Had His Vito Corleone Moment; Trump And The RNC Hate It Didn’t Backfire</br></p></blockquote><p> Now, my thought is that you might want to look at those names and consider: if your opinion of of Ted Cruz’s self-immolation on the national stage is even remotely in line with theirs, you <i>just might</i> want to reconsider it.</p></div>",
  "content_text": "Lion Ted Cruz wowed America and all but secured the 2020 nomination with his amazing non-endorsement speech at the RNC:\nErick Erickson ‏@EWErickson\nLION TED CRUZ\nDavid Frum ‏@davidfrum\nTed Cruz earned the most honorable boos at a GOP convention since those for Nelson Rockefeller for condemning the John Birch Society.\nErick Erickson ‏@EWErickson\nTed Cruz is the only one in Cleveland not willing to whore himself to Cheeto Jesus. History will favor him.\nMatthew Continetti ‏@continetti\nThe nationalists may very well take over the GOP for years to come. That doesn’t mean conservatives should be quiet. @tedcruz won’t be.\nJonah Goldberg‏@JonahNRO\nI choose Ted.\nRobert P. George ‏@McCormickProf\nTed has never been afraid to enter a hostile environment and speak his mind. He was like that even as an undergrad. He can’t be intimidated.\nErick Erickson ‏@EWErickson\nTrump supporters have so much butt hurt over Cruz, who said to go vote in November and congratulated Trump.\nMeghan McCain ‏@MeghanMcCain\nTed Cruz. Mic drop. Thank god someone still cares about the soul of the party of Lincoln and Reagan.\nErick Erickson ‏@EWErickson\nOf note, Ted Cruz is getting praised from both the left and right of the GOP, but not from the establishment. Perfect set up for 2020.\nJim Treacher ‏@jtLOL\nTed Cruz Had His Vito Corleone Moment; Trump And The RNC Hate It Didn’t Backfire\nNow, my thought is that you might want to look at those names and consider: if your opinion of of Ted Cruz’s self-immolation on the national stage is even remotely in line with theirs, you\njust might\nwant to reconsider it.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-21T18:30:00+00:00"
}