{
  "url": "https://voxday.net/2016/07/23/the-importance-of-rhetoric-2/",
  "scraped_at": "2025-12-18T01:45:28.184844",
  "title": "The importance of rhetoric",
  "date_display": "July 23, 2016",
  "date_iso": "2016-07-23T08:40:00+00:00",
  "date_from_url": "2016-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>James Carville explains, <strike>in an email released by Wikileaks as part of the #DNCleaks</strike> in a note of unknown provenance:</p><blockquote><p> Ideologies aren’t all that important. What’s important is psychology.</p><p>The Democratic constituency is just like a herd of cows. All you have to do is lay out enough silage and they come running. That’s why I became an operative working with Democrats. With Democrats all you have to do is make a lot of noise, lay out the hay, and be ready to use the ole cattle prod in case a few want to bolt the herd.</p><p>Eighty percent of the people who call themselves Democrats don’t have a clue as to political reality.</p><p>What amazes me is that you could take a group of people who are hard workers and convince them that they should support social programs that were the exact opposite of their own personal convictions.<br> – James Carville, Clinton strategist</br></p></blockquote><p>What Carville is talking about is rhetoric. 80 percent of the people are limited to rhetoric; per Aristotle, they<i> cannot be convinced</i> by information. They can only be moved by an appeal to their emotions or appetites.</p><p>UPDATE: The Carville note appears to be a fake being passed around under cover of the DNCleaks; I thought it was a little strange that the wily Carville would come right out and say that. But whether he said it or not, it is true, moreover, it is true of Republicans as well. It is true of everyone and it has been true since Aristotle’s day. Most people simply don’t speak or think in terms of dialectic.</p><p>As for those who think Hillary Clinton is a shoe-in due to demographics, note that the DNC doesn’t believe so. And this is a genuine day one DNCleak.<br> <i><br/></i><br> <i>“HRC will go into gen election as vulnerable candidate. Clinton Foundation quid-pro-quo worries are lingering, will be exploited in general.”</i></br></br></p><p>Translation: she sold out the USA while Secretary of State.</p></div>",
  "content_text": "James Carville explains,\nin an email released by Wikileaks as part of the #DNCleaks\nin a note of unknown provenance:\nIdeologies aren’t all that important. What’s important is psychology.\nThe Democratic constituency is just like a herd of cows. All you have to do is lay out enough silage and they come running. That’s why I became an operative working with Democrats. With Democrats all you have to do is make a lot of noise, lay out the hay, and be ready to use the ole cattle prod in case a few want to bolt the herd.\nEighty percent of the people who call themselves Democrats don’t have a clue as to political reality.\nWhat amazes me is that you could take a group of people who are hard workers and convince them that they should support social programs that were the exact opposite of their own personal convictions.\n– James Carville, Clinton strategist\nWhat Carville is talking about is rhetoric. 80 percent of the people are limited to rhetoric; per Aristotle, they\ncannot be convinced\nby information. They can only be moved by an appeal to their emotions or appetites.\nUPDATE: The Carville note appears to be a fake being passed around under cover of the DNCleaks; I thought it was a little strange that the wily Carville would come right out and say that. But whether he said it or not, it is true, moreover, it is true of Republicans as well. It is true of everyone and it has been true since Aristotle’s day. Most people simply don’t speak or think in terms of dialectic.\nAs for those who think Hillary Clinton is a shoe-in due to demographics, note that the DNC doesn’t believe so. And this is a genuine day one DNCleak.\n“HRC will go into gen election as vulnerable candidate. Clinton Foundation quid-pro-quo worries are lingering, will be exploited in general.”\nTranslation: she sold out the USA while Secretary of State.",
  "tags": [
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-23T07:40:00+00:00"
}