{
  "url": "https://voxday.net/2016/07/17/the-black-art-of-theology/",
  "scraped_at": "2025-12-18T01:44:28.963188",
  "title": "The black art of theology",
  "date_display": "July 17, 2016",
  "date_iso": "2016-07-17T12:00:00+00:00",
  "date_from_url": "2016-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dalrock observes <a href=\"https://dalrock.wordpress.com/2016/07/16/cbmws-evolving-position-on-spiritual-headship/\">the evolution of Christian complementarianism</a>:</p><blockquote class=\"tr_bq\"><p> From the beginning complementarianism has been an effort to split the<br> difference with Christian feminists (egalitarians).  This comes<br> naturally from their belief that feminism isn’t a manifestation of the<br> same discontent that caused Eve to want to be like God in the garden of<br> Eden.  Instead, complementarians see feminism as a misguided (but<br> entirely understandable) rebellion caused by the provocation of cruel<br> men.</br></br></br></br></br></br></p><p>Complementarians believe if they are nice enough to women, feminist<br> rebellion will go away as the reason for the rebellion is thereby<br> withdrawn (examples <a href=\"https://dalrock.wordpress.com/2016/02/24/stoking-feminist-resentment/\">here</a> and <a href=\"https://dalrock.wordpress.com/2016/03/03/the-cause-of-feminist-resentment/\">here</a>).  This requires compromise when Scripture offends feminists, and this has lead complementarians to invent <a href=\"https://dalrock.wordpress.com/2016/03/07/the-biblical-case-for-women-teaching-women/\">novel interpretations of Scripture</a>. <br> But this compromise is by no means a one time deal.  The compromises of<br> yesterday become the starting position for bargaining today, and<br> today’s new compromise will become the starting point for bargaining<br> tomorrow.</br></br></br></br></br></br></p><p>We can see this with the complementarian position on spiritual<br> headship.  Complementarians had to find an interpretation for Ephesians<br> 5:26-27** that formally set them apart from egalitarians but caused<br> minimal offense to feminists.  But no amount of compromise with<br> feminists will actually avoid offending feminists, and this has lead to<br> multiple complementarian stances on the topic of spiritual headship.</br></br></br></br></br></p><p>In the latest CBMW quarterly journal David Croteau describes the two predominant complementarian compromises on spiritual headship, and then proposes rejecting the concept of spiritual headship altogether.</p></blockquote><p>Theology: the art of convincing Christians that the Bible doesn’t mean what it says and God doesn’t want them to do what the Bible tells them to do.</p><p>And any woman who identifies herself as a “feminist” – or man, for that matter – should be expelled from the Church, no hesitation, no debate, no questions asked. Feminism is observably less compatible with Christianity than Satanism or Islam.</p></div>",
  "content_text": "Dalrock observes\nthe evolution of Christian complementarianism\n:\nFrom the beginning complementarianism has been an effort to split the\ndifference with Christian feminists (egalitarians).  This comes\nnaturally from their belief that feminism isn’t a manifestation of the\nsame discontent that caused Eve to want to be like God in the garden of\nEden.  Instead, complementarians see feminism as a misguided (but\nentirely understandable) rebellion caused by the provocation of cruel\nmen.\nComplementarians believe if they are nice enough to women, feminist\nrebellion will go away as the reason for the rebellion is thereby\nwithdrawn (examples\nhere\nand\nhere\n).  This requires compromise when Scripture offends feminists, and this has lead complementarians to invent\nnovel interpretations of Scripture\n.\nBut this compromise is by no means a one time deal.  The compromises of\nyesterday become the starting position for bargaining today, and\ntoday’s new compromise will become the starting point for bargaining\ntomorrow.\nWe can see this with the complementarian position on spiritual\nheadship.  Complementarians had to find an interpretation for Ephesians\n5:26-27** that formally set them apart from egalitarians but caused\nminimal offense to feminists.  But no amount of compromise with\nfeminists will actually avoid offending feminists, and this has lead to\nmultiple complementarian stances on the topic of spiritual headship.\nIn the latest CBMW quarterly journal David Croteau describes the two predominant complementarian compromises on spiritual headship, and then proposes rejecting the concept of spiritual headship altogether.\nTheology: the art of convincing Christians that the Bible doesn’t mean what it says and God doesn’t want them to do what the Bible tells them to do.\nAnd any woman who identifies herself as a “feminist” – or man, for that matter – should be expelled from the Church, no hesitation, no debate, no questions asked. Feminism is observably less compatible with Christianity than Satanism or Islam.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-17T11:00:00+00:00"
}