{
  "url": "https://voxday.net/2016/07/08/the-predictive-mode/",
  "scraped_at": "2025-12-18T01:43:21.587886",
  "title": "The predictive model",
  "date_display": "July 8, 2016",
  "date_iso": "2016-07-08T19:46:00+00:00",
  "date_from_url": "2016-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>As William S. Lind predicted it would in his book ON WAR, 4GW has arrived in America and is targeting the police. Because the police have militarized and lost their moral authority, they are now deemed legitimate enemy targets by a growing number of armed individuals.</i><br> – December 20, 2014</br></p><p><i>Demilitarization is without question in the material interests of the police as well.  They have started a war of escalation and attrition that they cannot possibly win…. It does not take a master logician to observe that all the “whatever I need to do to get home safe” mentality guarantees is that abusive police homes will soon be unsafe.  And the growing Hispanic population means that there will likely be more Latin American-style infiltration, assassination, and terror directed at the lower levels of law enforcement. </i><br> – July 20, 2013</br></p><p><i>I am not at all surprised that the police are now being targeted for murder due to nothing more than their membership in the Badge Gang. And there isn’t a soul in the country who can reasonably argue that the police haven’t collectively begged for such targeting, considering how many innocent Americans they have killed with shameless impunity in the last two decades…. Some protest, some shoot.  If the police don’t abandon their present<br> path of violence and start prosecuting police killers instead of<br> protecting them, they can expect more of the latter and less of the<br> former.</br></br></br></i><br> – May 31, 2011</br></p><p><i>No doubt some readers will have the usual hissy fit that my utter lack<br> of regard for the police means that I’m some kind of liberal hippy.  But<br> for those who are inclined to believe that, I’d merely ask: what is so<br> conservative, what is so very freedom-loving, about a police state? When<br> the police put down the machine guns, stop dressing like Darth Vader in<br> a Wehrmacht-style helmet and start behaving politely again instead of<br> knocking down doors and shooting pets, I’ll be happy to reconsider the<br> issue.</br></br></br></br></br></br></br></i><br> – February 21, 2007</br></p><p>In the aftermath of the Dallas police shooting, it is understandable that many Americans are shocked, scared, and upset. The post-Civil Rights Act America has not turned out to be the society they thought it was, indeed, it is becoming increasingly obvious that those terrible racist Southern segregationists were correct all along. Targeted assassinations of authority figures are not a sign of a stable, well-ordered society.</p><p>But I have neither patience nor sympathy for those who have been emailing, commenting, and Tweeting to say that they are shocked by my comments with regards to Dallas and the overly militarized US police. I have said nothing I have not said many times before. My position has not changed one iota on the subject for over a decade. I have repeatedly predicted such events would take place, nor am I alone in that, as William S. Lind repeatedly warned about it as a consequence of 4GW coming to America in his book of collected columns,<i> On War</i>.</p><p>I am neither shocked nor surprised that the events I predicted are taking place, any more than I am surprised that the post-1965 demographic changes have led to a less intelligent, less prosperous, and less stable country.</p><p>So, you’ll have to excuse me if I’m not inclined to pay any attention to the emotionally incontinent ravings of people who are not only surprised, but observably shocked by what recently took place in Dallas. I told you this was going to happen and I even told you why. If you didn’t do the same, if you can’t point to ten years of correct predictions, then I suggest that you learn to shut up and listen when more perspicacious individuals are explaining the situation to you. Ask questions if you don’t understand something. But regardless, understand that your emotional reaction in the heat of the moment is simply not as relevant as the cold and logical analysis of those who have been thinking calmly about the subject for more than ten years.</p><p>Now, as for the binary-thinking idiots who think if you don’t support the cops means you are a murderous BLM-supporting Black Panther, let me explain something to you. Nothing the police do – nothing – is going to turn America’s blacks into whites. They cannot keep a nonexistent peace. History clearly teaches there are four ways to permanently resolve the current situation: amalgamation, segregation, deportation, and elimination.</p><p>Which of those do you support? If you don’t support one of them, you’re not serious and your opinion doesn’t count. Yes, they’re all terrible options. Yes, they’re all ugly and awful and horrific. So is history.</p><p>BLM is the proximate cause. But I didn’t predict that the police would become targets because I knew, back in 2007, that BLM would one day come to be. I predicted it because the police abandoned the moral authority that rendered them untouchable, and which protected them much better than any body armor, bigger guns, or “shoot when scared” rules of engagement.</p><p>If you want to virtue-signal or strike dramatic poses about how you’ll never read this blog again or buy any of my books, that’s fine. No one is going to try to convince you otherwise. But you should understand that it is completely apparent to everyone here that you were never paying very much attention in the first place.</p></div>",
  "content_text": "As William S. Lind predicted it would in his book ON WAR, 4GW has arrived in America and is targeting the police. Because the police have militarized and lost their moral authority, they are now deemed legitimate enemy targets by a growing number of armed individuals.\n– December 20, 2014\nDemilitarization is without question in the material interests of the police as well.  They have started a war of escalation and attrition that they cannot possibly win…. It does not take a master logician to observe that all the “whatever I need to do to get home safe” mentality guarantees is that abusive police homes will soon be unsafe.  And the growing Hispanic population means that there will likely be more Latin American-style infiltration, assassination, and terror directed at the lower levels of law enforcement.\n– July 20, 2013\nI am not at all surprised that the police are now being targeted for murder due to nothing more than their membership in the Badge Gang. And there isn’t a soul in the country who can reasonably argue that the police haven’t collectively begged for such targeting, considering how many innocent Americans they have killed with shameless impunity in the last two decades…. Some protest, some shoot.  If the police don’t abandon their present\npath of violence and start prosecuting police killers instead of\nprotecting them, they can expect more of the latter and less of the\nformer.\n– May 31, 2011\nNo doubt some readers will have the usual hissy fit that my utter lack\nof regard for the police means that I’m some kind of liberal hippy.  But\nfor those who are inclined to believe that, I’d merely ask: what is so\nconservative, what is so very freedom-loving, about a police state? When\nthe police put down the machine guns, stop dressing like Darth Vader in\na Wehrmacht-style helmet and start behaving politely again instead of\nknocking down doors and shooting pets, I’ll be happy to reconsider the\nissue.\n– February 21, 2007\nIn the aftermath of the Dallas police shooting, it is understandable that many Americans are shocked, scared, and upset. The post-Civil Rights Act America has not turned out to be the society they thought it was, indeed, it is becoming increasingly obvious that those terrible racist Southern segregationists were correct all along. Targeted assassinations of authority figures are not a sign of a stable, well-ordered society.\nBut I have neither patience nor sympathy for those who have been emailing, commenting, and Tweeting to say that they are shocked by my comments with regards to Dallas and the overly militarized US police. I have said nothing I have not said many times before. My position has not changed one iota on the subject for over a decade. I have repeatedly predicted such events would take place, nor am I alone in that, as William S. Lind repeatedly warned about it as a consequence of 4GW coming to America in his book of collected columns,\nOn War\n.\nI am neither shocked nor surprised that the events I predicted are taking place, any more than I am surprised that the post-1965 demographic changes have led to a less intelligent, less prosperous, and less stable country.\nSo, you’ll have to excuse me if I’m not inclined to pay any attention to the emotionally incontinent ravings of people who are not only surprised, but observably shocked by what recently took place in Dallas. I told you this was going to happen and I even told you why. If you didn’t do the same, if you can’t point to ten years of correct predictions, then I suggest that you learn to shut up and listen when more perspicacious individuals are explaining the situation to you. Ask questions if you don’t understand something. But regardless, understand that your emotional reaction in the heat of the moment is simply not as relevant as the cold and logical analysis of those who have been thinking calmly about the subject for more than ten years.\nNow, as for the binary-thinking idiots who think if you don’t support the cops means you are a murderous BLM-supporting Black Panther, let me explain something to you. Nothing the police do – nothing – is going to turn America’s blacks into whites. They cannot keep a nonexistent peace. History clearly teaches there are four ways to permanently resolve the current situation: amalgamation, segregation, deportation, and elimination.\nWhich of those do you support? If you don’t support one of them, you’re not serious and your opinion doesn’t count. Yes, they’re all terrible options. Yes, they’re all ugly and awful and horrific. So is history.\nBLM is the proximate cause. But I didn’t predict that the police would become targets because I knew, back in 2007, that BLM would one day come to be. I predicted it because the police abandoned the moral authority that rendered them untouchable, and which protected them much better than any body armor, bigger guns, or “shoot when scared” rules of engagement.\nIf you want to virtue-signal or strike dramatic poses about how you’ll never read this blog again or buy any of my books, that’s fine. No one is going to try to convince you otherwise. But you should understand that it is completely apparent to everyone here that you were never paying very much attention in the first place.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-08T18:46:00+00:00"
}