{
  "url": "https://voxday.net/2016/07/30/two-million-monthly/",
  "scraped_at": "2025-12-18T01:46:44.047386",
  "title": "Two million page views monthly",
  "date_display": "July 30, 2016",
  "date_iso": "2016-07-30T18:35:00+00:00",
  "date_from_url": "2016-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>VP just hit its two millionth pageview for the month. I’ll have a more detailed report once the final numbers are in, but it’s a particularly satisfying milestone in light of this section from <i><b><a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie</a></b></i>:</p><blockquote><p> The discrepancies were starting to accumulate, and the increasingly wordy, increasingly elaborate defensiveness on Scalzi’s part made me increasingly certain that he was lying. But how to prove it to everyone else?</p><p>Then it occurred to me that anyone who was willing to shamelessly exaggerate in an interview with the <i>New York Times</i> was probably not doing so for the first time. In my experience, most people who are self-promoters never stop promoting themselves. They have a tendency to talk themselves up, and they will often exaggerate when they have no need to do so. Given that the <i>New York Times</i> is at the top of the U.S. cultural heap, I figured the chances were very high that Scalzi had similarly inflated his traffic in previous interviews with other reporters. And, sure enough, I found an interview he had given almost exactly three years before to Erin Stocks at a science fiction magazine called <i>Lightspeed</i>.</p><p><i>Anything you ever wanted to know about science fiction writer John Scalzi you can find online at the public and rather opinionated blog that he’s kept since 1998, Whatever.scalzi.com/. His bio page holds all the usual info—education, past jobs, present jobs, books published, awards won—and is wrapped up with the tongue-in-cheek coda: “For more detailed information, including a complete bibliography, visit the Wikipedia entry on me. It’s generally accurate.” But spend a little more time browsing, and you’ll learn that beyond the dry stats and quippy bon mots, there’s more to John Scalzi and his writing than meets the eye. For one thing, his blog gets an extraordinary amount of traffic for a writer’s website–Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.</i></p><p>—“Interview: John Scalzi”, <i>Lightspeed</i>, September 2010 (Issue 4)</p><p>Extraordinary indeed. It’s fascinating, isn’t it? Three years before the <i>New York Times</i> interview that struck me as anomalous, John Scalzi had been publicly claiming to have very nearly the same number of readers, as well as an absolutely impossible number of pageviews. And how could Whatever possibly have had “more than two million page views monthly” in September 2010 when he later reported 5,131,194 pageviews for the whole of the year?</p></blockquote><p>Alpha Game is seeing record traffic as well, and will hit 500,000 monthly pageviews later today. Thanks to all of you who made this possible by stopping by, and to those who have helped make it a destination by adding to the discourse.</p><p>I’d say on to 3 million, but I’ve been hanging around Cernovich too much and you know how he is about always thinking big. On to 10 million.</p></div>",
  "content_text": "VP just hit its two millionth pageview for the month. I’ll have a more detailed report once the final numbers are in, but it’s a particularly satisfying milestone in light of this section from\nSJWs Always Lie\n:\nThe discrepancies were starting to accumulate, and the increasingly wordy, increasingly elaborate defensiveness on Scalzi’s part made me increasingly certain that he was lying. But how to prove it to everyone else?\nThen it occurred to me that anyone who was willing to shamelessly exaggerate in an interview with the\nNew York Times\nwas probably not doing so for the first time. In my experience, most people who are self-promoters never stop promoting themselves. They have a tendency to talk themselves up, and they will often exaggerate when they have no need to do so. Given that the\nNew York Times\nis at the top of the U.S. cultural heap, I figured the chances were very high that Scalzi had similarly inflated his traffic in previous interviews with other reporters. And, sure enough, I found an interview he had given almost exactly three years before to Erin Stocks at a science fiction magazine called\nLightspeed\n.\nAnything you ever wanted to know about science fiction writer John Scalzi you can find online at the public and rather opinionated blog that he’s kept since 1998, Whatever.scalzi.com/. His bio page holds all the usual info—education, past jobs, present jobs, books published, awards won—and is wrapped up with the tongue-in-cheek coda: “For more detailed information, including a complete bibliography, visit the Wikipedia entry on me. It’s generally accurate.” But spend a little more time browsing, and you’ll learn that beyond the dry stats and quippy bon mots, there’s more to John Scalzi and his writing than meets the eye. For one thing, his blog gets an extraordinary amount of traffic for a writer’s website–Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.\n—“Interview: John Scalzi”,\nLightspeed\n, September 2010 (Issue 4)\nExtraordinary indeed. It’s fascinating, isn’t it? Three years before the\nNew York Times\ninterview that struck me as anomalous, John Scalzi had been publicly claiming to have very nearly the same number of readers, as well as an absolutely impossible number of pageviews. And how could Whatever possibly have had “more than two million page views monthly” in September 2010 when he later reported 5,131,194 pageviews for the whole of the year?\nAlpha Game is seeing record traffic as well, and will hit 500,000 monthly pageviews later today. Thanks to all of you who made this possible by stopping by, and to those who have helped make it a destination by adding to the discourse.\nI’d say on to 3 million, but I’ve been hanging around Cernovich too much and you know how he is about always thinking big. On to 10 million.",
  "tags": [
    "McRapey",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-30T17:35:00+00:00"
}