{
  "url": "https://voxday.net/2016/07/06/two-weeks/",
  "scraped_at": "2025-12-18T01:43:03.621702",
  "title": "Two weeks",
  "date_display": "July 6, 2016",
  "date_iso": "2016-07-06T14:30:00+00:00",
  "date_from_url": "2016-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Adam Piggott, Gentleman Adventurer, <a href=\"https://pushingrubberdownhill.com/2016/07/03/the-missionaries-book-review/\">reviews Owen Stanley’s <i>The Missionaries</i></a>:</p><blockquote class=\"tr_bq\"><p> When I lived in Uganda there was an old joke that would routinely do the rounds:</p><p>“In Africa, what’s the difference between a tourist and a racist?”</p><p>Answer: “Two weeks.”</p><p>Occasionally I would recount this joke to a particularly inane group of Swedes who were about to depart for a gorilla trekking excursion into the remote Bwindi forest. They would get all self-righteous and mutter at my blatant prejudice and soon after they would depart. It was not uncommon to bump into them again after they had returned from their excursion.</p><p>“Ya, now your joke, we understands.”</p><p>Like all good jokes its premise is founded in truth and also of shared experience.</p><p>“The Missionaries,” by Owen Stanley, depicts a fictitious land known as Elephant Island, located somewhere in the confines of the Bismarck Sea, its people closely resembling the ways and mannerisms of Papua New Guinea. As colonialism no longer allows the natives to practice their favorite pastime of headhunting, the burden of keeping law and order falls to a small group of misfit expats, who despite their individual shortcomings, keenly understand the idiosyncrasies of the local population….</p><p>I have not enjoyed a novel as much as this in a very long time. In fact,<br> this novel could not have been published by the regular publishing<br> industry as it skewers the type of people who haunt that industry as<br> much as NGOs in misbegotten locales in the far corners of the globe. It<br> is a credit to Castalia House that the author has sought them out and I<br> sense that this will be a breakthrough work not just for Stanley but for<br> this small publishing house as well.</br></br></br></br></br></br></p></blockquote><p>It appears his instincts are correct. Not only have we recently signed a number of new authors about whom we are <i>extremely</i> enthusiastic, but some of the existing authors have stepped up their game as well. Just as <a href=\"http://amzn.to/1PTLarZ\"><b><i>Mutiny in Space</i></b></a> will not be our only SF juvenile and <a href=\"http://amzn.to/1Xr3UA5\"><b><i>Brings the Lightning</i></b></a> will not be our only Western, <a href=\"http://amzn.to/28Y2gEi\"><b><i>The Missionaries</i></b></a> will not be our only literary satire.</p></div>",
  "content_text": "Adam Piggott, Gentleman Adventurer,\nreviews Owen Stanley’s\nThe Missionaries\n:\nWhen I lived in Uganda there was an old joke that would routinely do the rounds:\n“In Africa, what’s the difference between a tourist and a racist?”\nAnswer: “Two weeks.”\nOccasionally I would recount this joke to a particularly inane group of Swedes who were about to depart for a gorilla trekking excursion into the remote Bwindi forest. They would get all self-righteous and mutter at my blatant prejudice and soon after they would depart. It was not uncommon to bump into them again after they had returned from their excursion.\n“Ya, now your joke, we understands.”\nLike all good jokes its premise is founded in truth and also of shared experience.\n“The Missionaries,” by Owen Stanley, depicts a fictitious land known as Elephant Island, located somewhere in the confines of the Bismarck Sea, its people closely resembling the ways and mannerisms of Papua New Guinea. As colonialism no longer allows the natives to practice their favorite pastime of headhunting, the burden of keeping law and order falls to a small group of misfit expats, who despite their individual shortcomings, keenly understand the idiosyncrasies of the local population….\nI have not enjoyed a novel as much as this in a very long time. In fact,\nthis novel could not have been published by the regular publishing\nindustry as it skewers the type of people who haunt that industry as\nmuch as NGOs in misbegotten locales in the far corners of the globe. It\nis a credit to Castalia House that the author has sought them out and I\nsense that this will be a breakthrough work not just for Stanley but for\nthis small publishing house as well.\nIt appears his instincts are correct. Not only have we recently signed a number of new authors about whom we are\nextremely\nenthusiastic, but some of the existing authors have stepped up their game as well. Just as\nMutiny in Space\nwill not be our only SF juvenile and\nBrings the Lightning\nwill not be our only Western,\nThe Missionaries\nwill not be our only literary satire.",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-06T13:30:00+00:00"
}