{
  "url": "https://voxday.net/2016/07/27/what-he-doesnt-understand-is-magic/",
  "scraped_at": "2025-12-18T01:46:04.146093",
  "title": "What he doesn’t understand is magic",
  "date_display": "July 27, 2016",
  "date_iso": "2016-07-27T09:21:00+00:00",
  "date_from_url": "2016-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonah Goldberg is defeated and depressed, but he’s still not willing to admit that <a href=\"http://www.nationalreview.com/article/438248/donald-trump-republican-convention-supporters-magical-thinking\">he chose the wrong side</a>:<br/></p><blockquote><p> Personally, I thought Trump’s stentorian address was awful, albeit with a few effective bits, particularly at the end. There was no poetry, no arc, no uplift or modulation. It was like he spent 75 out of 76 minutes shouting the final conclusions on one PowerPoint slide after another. Over time, the sentences seemed to be getting shorter and more blunt. It looked like he might even devolve into just barking random vowels and glottal stops. His delivery reminded me of that old SNL newsroom skit when Garrett Morris’s head pops up in an oval and he just re-shouts everything Chevy Chase says for the hard of hearing.</p><p>Thematically, it was an anvil chorus minus the melody. There was plenty of conservative boilerplate, some of which I agree with. But the message last night had nothing to do with conservative litmus tests or checklists. No, the desired takeaway was, “Behold this Man of Strength! Cast your gaze Trumpwards, plebes, for our new Caesar is here to bring a New Rome (or restore the old one) through force of will.”</p><p>Nowhere in his speech did Trump give any sense that he knew — or cared — how he would get things done through his “sheer force of will.” That’s the thing about magical thinking, you don’t need to explain it. The Ones We’ve Been Waiting For get it, and everyone else never will.</p></blockquote><p>All Goldberg manages to demonstrate here is that he will see what he’s determined to see. Trump’s speech was too long, but it was otherwise extremely effective. Poetry, arc, uplift, and modulation are merely tools of the orator, the objective of a political speech is to give the voters a reason to vote for you. Trump’s speech did that, and the polls have responded accordingly.</p><p>As has long been the case, Goldberg, the good conservative, is focused on HOW a politician does things rather than WHAT he is doing. These conservative tone police are happy to vote for collective suicide so long as the politician promising to kill everyone does so in well-modulated, gracefully-composed tones while dressed nicely. Goldberg’s reference to “magical thinking” is pure cuckservative projection given that he is one of the many conservative fools who thinks 61 million post-1965 immigrants were transformed into Real Americans through the application of Magic Dirt, and believes a 19th century poem is the Zeroth Amendment to the U.S. Constitution.</p><p>Goldberg’s complete lack of business experience also shows glaringly here. The CEO doesn’t tell you HOW something is going to be done. That’s not his role. Steve Jobs didn’t introduce the iPhone by explaining how it was going to be manufactured in China, who would be writing the operating system, and how much RAM it would take up. If he had, it would have failed. The CEO’s job is to <i>establish </i>the vision and <i>inspire </i>others to embrace it. That Trump has done, extremely well, with his Make America Great Again, which is the best campaign vision since Reagain’s Morning in America.</p><p>In fact, Goldberg even admits that he is babbling and denying the evidence of his own eyes and ears, as this passage shows: <i>By the normal rules the speech should have been a disaster. But as we all know the normal rules do not apply. I am fairly certain Trump will get his post-convention bump. I am less confident Trump is a guaranteed loser come November.</i> In other words, it was not awful, it was effective.<br> <i><br/></i><br> But the deeper theme of Goldberg’s piece is his shock and despair that so many people are refusing to buy into the Noble Conservative Who Knows What is Good For You schtick anymore.<br/></br></br></p><blockquote><p> I hate everything about this year, politically and (not counting some great TV) culturally. It’s clear many of my friends on the pro-Trump right are giddy with resentment-justifying glee at the alleged comeuppance of Trump opponents. One need only listen to quite literally anything Laura Ingraham or Sean Hannity say about Trump critics to see how large a role spite plays in the now-unbreachable divide between the new nationalists and the old conservatives….</p><p>But the truth is conservatism has become shot-through with a kind of vindictiveness that reflects poorly on everyone, friend and foe alike. I hate that after 20 years of fighting what I believe to be the good fight, so many can’t muster the will or generosity to consider that I’m doing what I think is right.</p><p>I hate that after 20 years of fighting what I believe to be the good fight, so many can’t muster the will or generosity to consider that I’m doing what I think is right. I’m entirely open to the argument that my analysis and judgment is wrong. But I am resentful, furious and, most of all, contemptuous of the lazy and self-justifying assumption that my motives are malign.</p></blockquote><p>That’s just it, Jonah. You didn’t fight the good fight. You fought<i> the wrong fight</i>. As a conservative opinion leader, you didn’t manage to conserve one single damn thing, and even more damning, many of your opinions changed over time with the progressive tide. Now you’re choosing to side with the globalists and the progressives because you were <i>never on the side of Americans</i> at all. You fought the wrong fight and now you’ve chosen the wrong side.</p><p>Through your open opposition to America’s nationalists, you have revealed that your motives and your objectives are, at the very least, opposed to the interests of Americans and the United States of America.</p><p>We don’t care that you think what you’re doing is right. We care that you have declared yourself to be an enemy of those who are trying to make America great again. We care that you have openly declared yourself to be an enemy of the American identity.</p><p>Frankly, I’m very disappointed in Jonah. I genuinely thought he was smarter than this. I defended him many times from those who regarded him with suspicion on the basis of his (((heritage))) and who considered him nothing more than a typical neocon. Unfortunately, when the time came to choose between America and his imaginary proposition nation, he chose the latter.</p></div>",
  "content_text": "Jonah Goldberg is defeated and depressed, but he’s still not willing to admit that\nhe chose the wrong side\n:\nPersonally, I thought Trump’s stentorian address was awful, albeit with a few effective bits, particularly at the end. There was no poetry, no arc, no uplift or modulation. It was like he spent 75 out of 76 minutes shouting the final conclusions on one PowerPoint slide after another. Over time, the sentences seemed to be getting shorter and more blunt. It looked like he might even devolve into just barking random vowels and glottal stops. His delivery reminded me of that old SNL newsroom skit when Garrett Morris’s head pops up in an oval and he just re-shouts everything Chevy Chase says for the hard of hearing.\nThematically, it was an anvil chorus minus the melody. There was plenty of conservative boilerplate, some of which I agree with. But the message last night had nothing to do with conservative litmus tests or checklists. No, the desired takeaway was, “Behold this Man of Strength! Cast your gaze Trumpwards, plebes, for our new Caesar is here to bring a New Rome (or restore the old one) through force of will.”\nNowhere in his speech did Trump give any sense that he knew — or cared — how he would get things done through his “sheer force of will.” That’s the thing about magical thinking, you don’t need to explain it. The Ones We’ve Been Waiting For get it, and everyone else never will.\nAll Goldberg manages to demonstrate here is that he will see what he’s determined to see. Trump’s speech was too long, but it was otherwise extremely effective. Poetry, arc, uplift, and modulation are merely tools of the orator, the objective of a political speech is to give the voters a reason to vote for you. Trump’s speech did that, and the polls have responded accordingly.\nAs has long been the case, Goldberg, the good conservative, is focused on HOW a politician does things rather than WHAT he is doing. These conservative tone police are happy to vote for collective suicide so long as the politician promising to kill everyone does so in well-modulated, gracefully-composed tones while dressed nicely. Goldberg’s reference to “magical thinking” is pure cuckservative projection given that he is one of the many conservative fools who thinks 61 million post-1965 immigrants were transformed into Real Americans through the application of Magic Dirt, and believes a 19th century poem is the Zeroth Amendment to the U.S. Constitution.\nGoldberg’s complete lack of business experience also shows glaringly here. The CEO doesn’t tell you HOW something is going to be done. That’s not his role. Steve Jobs didn’t introduce the iPhone by explaining how it was going to be manufactured in China, who would be writing the operating system, and how much RAM it would take up. If he had, it would have failed. The CEO’s job is to\nestablish\nthe vision and\ninspire\nothers to embrace it. That Trump has done, extremely well, with his Make America Great Again, which is the best campaign vision since Reagain’s Morning in America.\nIn fact, Goldberg even admits that he is babbling and denying the evidence of his own eyes and ears, as this passage shows:\nBy the normal rules the speech should have been a disaster. But as we all know the normal rules do not apply. I am fairly certain Trump will get his post-convention bump. I am less confident Trump is a guaranteed loser come November.\nIn other words, it was not awful, it was effective.\nBut the deeper theme of Goldberg’s piece is his shock and despair that so many people are refusing to buy into the Noble Conservative Who Knows What is Good For You schtick anymore.\nI hate everything about this year, politically and (not counting some great TV) culturally. It’s clear many of my friends on the pro-Trump right are giddy with resentment-justifying glee at the alleged comeuppance of Trump opponents. One need only listen to quite literally anything Laura Ingraham or Sean Hannity say about Trump critics to see how large a role spite plays in the now-unbreachable divide between the new nationalists and the old conservatives….\nBut the truth is conservatism has become shot-through with a kind of vindictiveness that reflects poorly on everyone, friend and foe alike. I hate that after 20 years of fighting what I believe to be the good fight, so many can’t muster the will or generosity to consider that I’m doing what I think is right.\nI hate that after 20 years of fighting what I believe to be the good fight, so many can’t muster the will or generosity to consider that I’m doing what I think is right. I’m entirely open to the argument that my analysis and judgment is wrong. But I am resentful, furious and, most of all, contemptuous of the lazy and self-justifying assumption that my motives are malign.\nThat’s just it, Jonah. You didn’t fight the good fight. You fought\nthe wrong fight\n. As a conservative opinion leader, you didn’t manage to conserve one single damn thing, and even more damning, many of your opinions changed over time with the progressive tide. Now you’re choosing to side with the globalists and the progressives because you were\nnever on the side of Americans\nat all. You fought the wrong fight and now you’ve chosen the wrong side.\nThrough your open opposition to America’s nationalists, you have revealed that your motives and your objectives are, at the very least, opposed to the interests of Americans and the United States of America.\nWe don’t care that you think what you’re doing is right. We care that you have declared yourself to be an enemy of those who are trying to make America great again. We care that you have openly declared yourself to be an enemy of the American identity.\nFrankly, I’m very disappointed in Jonah. I genuinely thought he was smarter than this. I defended him many times from those who regarded him with suspicion on the basis of his (((heritage))) and who considered him nothing more than a typical neocon. Unfortunately, when the time came to choose between America and his imaginary proposition nation, he chose the latter.",
  "tags": [
    "cuckservative",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-27T08:21:00+00:00"
}