{
  "url": "https://voxday.net/2016/07/21/when-white-knighting-goes-awry-2/",
  "scraped_at": "2025-12-18T01:45:05.395996",
  "title": "When white-knighting goes awry",
  "date_display": "July 21, 2016",
  "date_iso": "2016-07-21T12:00:00+00:00",
  "date_from_url": "2016-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Due to their self-absorption and addiction to self-delusion, Gammas render themselves so completely incompetent that they can’t even white-knight properly. Jim Treacher is a commentator for the Daily Caller who nobly white-knighted for Michelle Fields when she was raped, her arm was ripped off, and she was beaten to death with it by Corey Lewandowski on the direct orders of Donald Trump.</p><p>His outrage at this horribly unchivalrous, ungallant behavior was stoked by Mike Cernovich’s infamous endorsement of Miss Field’s rape, mutilation, and murder, so it’s quite natural that he should have been even more inflamed at Spacebunny’s ignoble failure to decry and denounce the pure and unadulterated evil that is Mike Cernovich.</p><blockquote class=\"tr_bq\"><p> Jim Treacher@jtLOL <br> If you want to know why I want nothing to do with you: Just look at the shit Cernovich says, every day.</br></p><p><i>Mike Cernovich @Cernovich<br>Did Michelle Fields fiancé, who is violent and angry, abuse her? Could be source of those bruises she posted…</br></i></p><p>This is why we can’t be friends.</p><p>Space Bunnyopoulos ‏@Spacebunnyday <br> We can’t be friends because of something someone else said that has nothing to do with either of us.  Gotcha.</br></p><p>Jim Treacher@jtLOL  <br> There is no square centimeter of Cernovich’s nutsack that you haven’t licked. Don’t even pretend.</br></p><p>Jim Treacher@jtLOL<br> He took great delight in hurting my friend Michelle, because his demigod Trump had already hurt her.</br></p><p>Jim Treacher@jtLOL<br> Fuck all of you fucking shitheads.</br></p><p>Jim Treacher@jtLOL<br> Have fun eating Cernovich’s shit.</br></p></blockquote><p>This demonstrates the fundamental way that being emotionally incontinent renders Gammas totally incoherent. In order to virtue-signal and defend the honor of Michelle Fields, Jim Treacher is spewing vulgar nonsense at Spacebunny simply because she would not agree with him.</p><p>The reason for this is threefold. First, Gammas usually double down, at least in the short term. Second, Gammas HATE HATE HATE Alphas, mostly because they envy them. Third, and perhaps most important here, is that Gammas place inordinate importance on the approval of women. Nothing burns them more painfully than female disapproval or rejection.</p><p>The fact that Treacher perceived Spacebunny as siding with the evil Alpha rather than him, the noble Defender of Women meant that he felt she was disapproving of him, which therefore justified, in his delusional Gamma mind, treating her far worse than Cernovich has ever treated the memory of the late Michelle Fields.</p><p>It’s best not to white-knight at all. But if you absolutely have to white-knight for one psychological reason or another, you might want to, at the very least, refrain from cursing at women and accusing them of being adulterous whores. It’s appalling, really, that The Daily Caller permits its commentators to treat women in such a grotesquely sexist way. Do they really endorse this sort of behavior?</p><p>UPDATE: Just because <a href=\"https://mobile.twitter.com/jtLOL/status/408132586347585536\">it is almost too funny to believe</a>. And to think he wanted to take on <i>Spacebunny</i>, of all women. She’d fillet him and serve him to his cats without even blinking.</p><blockquote class=\"tr_bq\"><p> Jim Treacher ‏@jtLOL<br> As I sat there handcuffed, one Metro DC cop mocked me for crying and another one made fun of my weight. Can’t say I blame them for either.</br></p></blockquote></div>",
  "content_text": "Due to their self-absorption and addiction to self-delusion, Gammas render themselves so completely incompetent that they can’t even white-knight properly. Jim Treacher is a commentator for the Daily Caller who nobly white-knighted for Michelle Fields when she was raped, her arm was ripped off, and she was beaten to death with it by Corey Lewandowski on the direct orders of Donald Trump.\nHis outrage at this horribly unchivalrous, ungallant behavior was stoked by Mike Cernovich’s infamous endorsement of Miss Field’s rape, mutilation, and murder, so it’s quite natural that he should have been even more inflamed at Spacebunny’s ignoble failure to decry and denounce the pure and unadulterated evil that is Mike Cernovich.\nJim Treacher@jtLOL\nIf you want to know why I want nothing to do with you: Just look at the shit Cernovich says, every day.\nMike Cernovich @Cernovich\nDid Michelle Fields fiancé, who is violent and angry, abuse her? Could be source of those bruises she posted…\nThis is why we can’t be friends.\nSpace Bunnyopoulos ‏@Spacebunnyday\nWe can’t be friends because of something someone else said that has nothing to do with either of us.  Gotcha.\nJim Treacher@jtLOL\nThere is no square centimeter of Cernovich’s nutsack that you haven’t licked. Don’t even pretend.\nJim Treacher@jtLOL\nHe took great delight in hurting my friend Michelle, because his demigod Trump had already hurt her.\nJim Treacher@jtLOL\nFuck all of you fucking shitheads.\nJim Treacher@jtLOL\nHave fun eating Cernovich’s shit.\nThis demonstrates the fundamental way that being emotionally incontinent renders Gammas totally incoherent. In order to virtue-signal and defend the honor of Michelle Fields, Jim Treacher is spewing vulgar nonsense at Spacebunny simply because she would not agree with him.\nThe reason for this is threefold. First, Gammas usually double down, at least in the short term. Second, Gammas HATE HATE HATE Alphas, mostly because they envy them. Third, and perhaps most important here, is that Gammas place inordinate importance on the approval of women. Nothing burns them more painfully than female disapproval or rejection.\nThe fact that Treacher perceived Spacebunny as siding with the evil Alpha rather than him, the noble Defender of Women meant that he felt she was disapproving of him, which therefore justified, in his delusional Gamma mind, treating her far worse than Cernovich has ever treated the memory of the late Michelle Fields.\nIt’s best not to white-knight at all. But if you absolutely have to white-knight for one psychological reason or another, you might want to, at the very least, refrain from cursing at women and accusing them of being adulterous whores. It’s appalling, really, that The Daily Caller permits its commentators to treat women in such a grotesquely sexist way. Do they really endorse this sort of behavior?\nUPDATE: Just because\nit is almost too funny to believe\n. And to think he wanted to take on\nSpacebunny\n, of all women. She’d fillet him and serve him to his cats without even blinking.\nJim Treacher ‏@jtLOL\nAs I sat there handcuffed, one Metro DC cop mocked me for crying and another one made fun of my weight. Can’t say I blame them for either.",
  "tags": [
    "Alpha Game",
    "freakshow",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-21T11:00:00+00:00"
}