{
  "url": "https://voxday.net/2016/07/12/wounded-gamma-loses-again/",
  "scraped_at": "2025-12-18T01:43:47.743620",
  "title": "Wounded Gamma loses again",
  "date_display": "July 12, 2016",
  "date_iso": "2016-07-12T12:00:00+00:00",
  "date_from_url": "2016-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One significant characteristic of the Gamma male is that he cannot deal with being publicly shown to be wrong. Such an event punctures the delusion bubble in which he, the Secret King, always triumphs, so it creates a wound that never heals, and festers much longer than any higher-rank man can imagine. Even if he manages to control himself and not let it show immediately, it eats away at him and preys on his mind.</p><p>The way the Gamma usually deals with a festering wound is to attempt to negate it by subsequently demonstrating his superiority to the party who dealt it to him. This means that he will lie in wait, for years if need be, for what he sees as an opportunity to prove the offending party wrong. This, he believes, will disqualify and discredit the party, which somehow means that the Gamma was not wrong the first time, even though he was. But no matter, the Secret King triumphs in the end!</p><p>This behavior is so predictable that I not infrequently find myself able to correctly anticipate when a previously wounded Gamma is going to think he sees an opening and launch what I am coming to think of as a restorative rebuttal. However, I did not see this one coming; I did not think that Camestros Felapton was dumb enough <a href=\"https://t.co/gcELgsETUS\">to launch what is either his third or his fourth attempt</a> to repair his delusion bubble since being so publicly humiliated about his lack of knowledge concerning rhetoric in <a href=\"http://www.milobookclub.com/2016/05/01/of-enthymemes-and-false-erudition/\">Of Enthymemes and False Erudition</a>. Apparently the sting of his repeated defeats at my hands has become more than he can bear, because he is really grasping at straws now.</p><blockquote><p> The other day Vox was disparaging about the value of scientific evidence. I’m not entirely sure if he is clear himself about what he means but when it comes to IQ he is happy to post anything that he feels supports his case. This time, it is a pair of studies that point to a 4 point decline in IQ in France in a 9-10 year period. Vox quotes a second study that was an analysis of the first. This second study was an attempt to discern the cause of the decline by looking at the magnitude of the changes at a subtest level. This second paper concluded that the decline ‘likely has a primarily biological cause’. Vox declares it was due to immigration.</p></blockquote><p>Did I now? What did I actually write? <a href=\"http://www.milobookclub.com/2016/07/11/the-enstupidation-of-france/\">Let’s review</a>:</p><p><i>My estimate of a post-1965 four-point IQ loss in the USA was a minimum estimate based solely on replacement migration, but considering that dysgenic fertility is also a factor in the USA, the actual decline is almost certainly worse.</i><br> <i><br/></i><br> <i>If replacement migration is also the lesser factor in the US case, then the post-1965 IQ decline in the USA could be as much as 10 points. However, US immigration has been higher and US native birth rates have remained higher than in France, so something on the order of 7-8 points is more likely. This is not insignificant; it is the difference between the current USA and Sierra Leone.</i><br> <i><br/></i><br> So, Camestros is obviously wrong. I did not say the decline was due solely to immigration, I merely repeated what the study said, which is that the reported IQ decline in France was primarily due to dysgenic fertility and secondarily due to immigration.</br></br></br></br></p><p>Moreover, this shows that Camestros was not merely wrong, he was lying, because I even pointed out that while dysgenic fertility appears to have been the primary factor responsible in France, in the US it is more likely that immigration is nearly as important a factor for two reasons: US immigration rates are higher and US native birth rates are higher. There is a third reason as well; higher abortion rates among the lowest-IQ population tend to partially counterbalance the lower fertility rate of the highest-IQ population.</p><p>We had damn well better hope I am right, because we know the immigration-related decline of IQ in the USA is <i>at least</i> 4 points based on population averages. If the dysgenic fertility decline in the USA is, like France, even worse than the immigration-related decline, then we will have already seen a catastrophic decline in average US IQ of 9 points or more! In his desperation to declare me wrong about immigration and IQ, (and therefore retroactively wrong about Aristotle and rhetoric) Camestros fails to even notice the horrific implications of his argument. Who cares about that, what is important is to patch up that punctured delusion bubble stat!</p><p>Finally, after again trying to cast doubt on IQ as a reasonable metric for intelligence as well as upon the possibility of comparing average national intelligence levels, Camestros ends by saying, “neither paper ends up agreeing with Vox’s conclusion.”</p><p>Considering that neither paper addresses the USA at all, it would be absolutely remarkable if either of them had.</p><p>Once more, Camestros provides us with sufficient evidence to safely conclude that if IQ is a reasonable measure of innate intelligence, his is considerably lower than mine. It’s funny that despite being such a questionable metric, a similar percentile just seems to keep showing up <a href=\"http://www.arealme.com/vocabulary-size-test/en/\">no matter how it’s measured</a>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2016/07/vocab_vox.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/07/vocab_vox.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2016/07/vocab_vox.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> Of course, my actual vocabulary is probably more than twice that, but then, we’re not counting Italian, German, French, or Japanese vocabularies.</p><p>UPDATE: Gammas never learn. And they never stop lying.</p><blockquote class=\"tr_bq\"><p> Camestros Felapton ‏@CamestrosF<br> @voxday declares me beneath his consideration, again</br></p><p>Supreme Dark Lord @voxday<br>You’re lying, again. I take on all comers. Even hapless, midwitted gamma males like you. </br></p></blockquote></div>",
  "content_text": "One significant characteristic of the Gamma male is that he cannot deal with being publicly shown to be wrong. Such an event punctures the delusion bubble in which he, the Secret King, always triumphs, so it creates a wound that never heals, and festers much longer than any higher-rank man can imagine. Even if he manages to control himself and not let it show immediately, it eats away at him and preys on his mind.\nThe way the Gamma usually deals with a festering wound is to attempt to negate it by subsequently demonstrating his superiority to the party who dealt it to him. This means that he will lie in wait, for years if need be, for what he sees as an opportunity to prove the offending party wrong. This, he believes, will disqualify and discredit the party, which somehow means that the Gamma was not wrong the first time, even though he was. But no matter, the Secret King triumphs in the end!\nThis behavior is so predictable that I not infrequently find myself able to correctly anticipate when a previously wounded Gamma is going to think he sees an opening and launch what I am coming to think of as a restorative rebuttal. However, I did not see this one coming; I did not think that Camestros Felapton was dumb enough\nto launch what is either his third or his fourth attempt\nto repair his delusion bubble since being so publicly humiliated about his lack of knowledge concerning rhetoric in\nOf Enthymemes and False Erudition\n. Apparently the sting of his repeated defeats at my hands has become more than he can bear, because he is really grasping at straws now.\nThe other day Vox was disparaging about the value of scientific evidence. I’m not entirely sure if he is clear himself about what he means but when it comes to IQ he is happy to post anything that he feels supports his case. This time, it is a pair of studies that point to a 4 point decline in IQ in France in a 9-10 year period. Vox quotes a second study that was an analysis of the first. This second study was an attempt to discern the cause of the decline by looking at the magnitude of the changes at a subtest level. This second paper concluded that the decline ‘likely has a primarily biological cause’. Vox declares it was due to immigration.\nDid I now? What did I actually write?\nLet’s review\n:\nMy estimate of a post-1965 four-point IQ loss in the USA was a minimum estimate based solely on replacement migration, but considering that dysgenic fertility is also a factor in the USA, the actual decline is almost certainly worse.\nIf replacement migration is also the lesser factor in the US case, then the post-1965 IQ decline in the USA could be as much as 10 points. However, US immigration has been higher and US native birth rates have remained higher than in France, so something on the order of 7-8 points is more likely. This is not insignificant; it is the difference between the current USA and Sierra Leone.\nSo, Camestros is obviously wrong. I did not say the decline was due solely to immigration, I merely repeated what the study said, which is that the reported IQ decline in France was primarily due to dysgenic fertility and secondarily due to immigration.\nMoreover, this shows that Camestros was not merely wrong, he was lying, because I even pointed out that while dysgenic fertility appears to have been the primary factor responsible in France, in the US it is more likely that immigration is nearly as important a factor for two reasons: US immigration rates are higher and US native birth rates are higher. There is a third reason as well; higher abortion rates among the lowest-IQ population tend to partially counterbalance the lower fertility rate of the highest-IQ population.\nWe had damn well better hope I am right, because we know the immigration-related decline of IQ in the USA is\nat least\n4 points based on population averages. If the dysgenic fertility decline in the USA is, like France, even worse than the immigration-related decline, then we will have already seen a catastrophic decline in average US IQ of 9 points or more! In his desperation to declare me wrong about immigration and IQ, (and therefore retroactively wrong about Aristotle and rhetoric) Camestros fails to even notice the horrific implications of his argument. Who cares about that, what is important is to patch up that punctured delusion bubble stat!\nFinally, after again trying to cast doubt on IQ as a reasonable metric for intelligence as well as upon the possibility of comparing average national intelligence levels, Camestros ends by saying, “neither paper ends up agreeing with Vox’s conclusion.”\nConsidering that neither paper addresses the USA at all, it would be absolutely remarkable if either of them had.\nOnce more, Camestros provides us with sufficient evidence to safely conclude that if IQ is a reasonable measure of innate intelligence, his is considerably lower than mine. It’s funny that despite being such a questionable metric, a similar percentile just seems to keep showing up\nno matter how it’s measured\n.\nOf course, my actual vocabulary is probably more than twice that, but then, we’re not counting Italian, German, French, or Japanese vocabularies.\nUPDATE: Gammas never learn. And they never stop lying.\nCamestros Felapton ‏@CamestrosF\n@voxday declares me beneath his consideration, again\nSupreme Dark Lord @voxday\nYou’re lying, again. I take on all comers. Even hapless, midwitted gamma males like you.",
  "tags": [
    "Alpha Game",
    "immigration",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-07-12T11:00:00+00:00"
}