{
  "url": "https://voxday.net/2013/06/20/46-million-more-americans/",
  "scraped_at": "2025-12-14T22:32:36.935071",
  "title": "46 million more Americans",
  "date_display": "June 20, 2013",
  "date_iso": "2013-06-20T18:01:00+00:00",
  "date_from_url": "2013-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s the CBO estimate for <a href=\"http://dailycaller.com/2013/06/19/senate-bill-allows-46-million-immigrants-by-2033-says-cbo/\">the Senate’s immigration bill</a>:</p><blockquote class=\"tr_bq\"><p> The Senate’s pending immigration bill will pave the way for the<br> arrival of 46 million legal immigrants over the next 20 years, increase<br> the federal debt in the same time period and shrink Americans’ average<br> wage, according Alabama Republican Sen. Jeff Session’s critical reading<br> of two new reports on the pending immigration reform bill provided by<br> the Congressional Budget Office. But Florida Republican Sen. Marco Rubio, the most prominent GOP<br> advocate for the immigration reform bill, says the CBO reports are good<br> news for Americans.</br></br></br></br></br></br></br></p></blockquote><p>Marco Rubio wants more Hispanic immigrants.  That’s almost as much of a surprise as Italy’s new Congolese Minister of the Interior, whose first action in office was to argue for the importance of making it easier for Africans to get Italian citizenship.  Isn’t it a remarkable coincidence that the absolute top priority of every immigrant who achieves any political power is to bring in more people just like them?</p><p>Anyhow, this should suffice to snuff out the last remnants of any grass roots Republican enthusiasm for Marco Rubio.  And I can’t help but notice the reference to that portentous year. 2033. By the time there are 357 million people living in the lower 48, I very much doubt they will still be a single political entity.</p></div>",
  "content_text": "That’s the CBO estimate for\nthe Senate’s immigration bill\n:\nThe Senate’s pending immigration bill will pave the way for the\narrival of 46 million legal immigrants over the next 20 years, increase\nthe federal debt in the same time period and shrink Americans’ average\nwage, according Alabama Republican Sen. Jeff Session’s critical reading\nof two new reports on the pending immigration reform bill provided by\nthe Congressional Budget Office. But Florida Republican Sen. Marco Rubio, the most prominent GOP\nadvocate for the immigration reform bill, says the CBO reports are good\nnews for Americans.\nMarco Rubio wants more Hispanic immigrants.  That’s almost as much of a surprise as Italy’s new Congolese Minister of the Interior, whose first action in office was to argue for the importance of making it easier for Africans to get Italian citizenship.  Isn’t it a remarkable coincidence that the absolute top priority of every immigrant who achieves any political power is to bring in more people just like them?\nAnyhow, this should suffice to snuff out the last remnants of any grass roots Republican enthusiasm for Marco Rubio.  And I can’t help but notice the reference to that portentous year. 2033. By the time there are 357 million people living in the lower 48, I very much doubt they will still be a single political entity.",
  "tags": [
    "Invasion",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-20T17:01:00+00:00"
}