{
  "url": "https://voxday.net/2013/06/13/a-black-female-fantasis/",
  "scraped_at": "2025-12-14T22:31:45.784922",
  "title": "A black female fantasist calls for Reconciliation",
  "date_display": "June 13, 2013",
  "date_iso": "2013-06-13T08:29:00+00:00",
  "date_from_url": "2013-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NK Jemisin <a href=\"http://nkjemisin.com/2013/06/continuum-goh-speech/\">is publicly lying about me and a few other things</a> in Australia as she blithely advocates the continued self-destruction of science fiction:</p><blockquote class=\"tr_bq\"><p> Right now American politicians are doing their best to roll back<br> voting rights won during our own Civil Rights movement.  They are<br> putting in place educational “reforms” which disproportionately have a<br> negative impact on black and brown and poor white kids, and will<br> essentially help to solidify a permanent underclass.  Right now there<br> are laws in places like Florida and Texas which are intended to make it<br> essentially legal for white people to just shoot people like me, without<br> consequence, as long as they feel threatened by my presence.  So:<br> admitting that the land we live on was stolen from hundreds of other<br> nations and peoples?  Acknowledging that the prosperity the United<br> States enjoys was bought with blood?  That’s a pipe dream.</br></br></br></br></br></br></br></br></br></br></p><p>I want you to understand that what you’ve done makes me want to weep with envy, and bitterness, and hope.</p><p>So:  segue time.  Let’s scale down.  Let’s talk about the community — the microcosmic nation — of science fiction and fantasy.</p><p>For the past few days I’ve also been observing a “kerfuffle”, as some<br> call it, in reaction to the Science Fiction and Fantasy Writers’ of<br> America’s latest professional journal, the Bulletin.  Some of you may<br> also have been following the discussion; hopefully not all of you.  To<br> summarize:  two of the genre’s most venerable white male writers made<br> some comments in a series of recent articles which have been decried as<br> sexist and racist by most of the organization’s membership.  Now, to put<br> this in context:  the membership of SFWA also recently voted in a new<br> president.  There were two candidates — one of whom was a self-described<br> misogynist, racist, anti-Semite, and a few other flavors of asshole.<br> In this election he lost by a landslide… but he still earned ten percent<br> of the vote.  SFWA is small; only about 500 people voted in total, so<br> we’re talking less than 50 people.  But scale up again.  Imagine if ten<br> percent of this country’s population was busy making active efforts to<br> take away not mere privileges, not even dignity, but your most basic<br> rights.  Imagine if ten percent of the people you interacted with, on a<br> daily basis, did not regard you as human.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Just ten percent.  But <i>such</i> a ten percent.</p><p>And beyond that ten percent are the silent majority — the great<br> unmeasured mass of enablers.  These are the folks who don’t object to<br> the treatment of women as human beings, and who may even have the odd<br> black or gay friend that they genuinely like.  However, when the ten<br> percent starts up in their frothing rage, these are the people who say<br> nothing in response.  When women and other marginalized groups respond<br> with anger to the hatred of the ten percent, these are the people who do<br> not support them, and in fact suggest that maybe they’re overreacting.<br> When they read a novel set in a human society which contains only one<br> or two female characters, these are the people who don’t decry this as<br> implausible.  Or worse, they simply don’t notice.  These are the people<br> who successfully campaigned for Star Trek to return to television after<br> 25 years, but have no intention of campaigning for Roddenberry’s vision<br> to be complete, with gay characters joining the rainbow brigade on the<br> bridge.  These are the people who gleefully nitpick the scientific<br> plausibility of stopping a volcano with “cold fusion”, yet who fail to<br> notice that an author has written a future earth in which somehow<br> seventeen percent of the human race dominates ninety percent of the<br> characterization.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Let me be perfectly clear.  I do not describe myself as a “misogynist, racist, anti-Semite, and a few other flavors of asshole”.  John Scalzi, Patrick Nielsen Hayden, and Theresa Nielsen Hayden, among others, have described me that way.  Of course, John Scalzi also <a href=\"http://whatever.scalzi.com/2012/10/25/a-fan-letter-to-certain-conservative-politicians/\">describes himself as a rapist</a>, Patrick Nielsen Hayden took his wife’s name when he got married, and Theresa Nielsen Hayden is dumb enough to have claimed a prominent Game blogger with three Billboard-charting club hits “is not acquainted with actual women.”</p><p>Granted, <a href=\"https://si0.twimg.com/profile_images/188396807/SBWorkout.jpg\">Spacebunny </a>and <a href=\"http://farm2.staticflickr.com/1163/602423809_6fdb37e856.jpg\">the fat frog that is Nielsen Hayden</a> don’t look as if they belong to the same phylum, let alone the same species, so perhaps the key word is not “women, but “actual” in the sense of “grotesquely malformed”.</p><p>I therefore suggest that their assertions should be taken with at least a small grain of salt rather than credited to me. And it should be obvious that, being a libertarian, I am not actively attempting to take away anyone’s “most basic rights”.  Jemisin has it wrong; it is not that I, and others, do not view her as human, (although genetic science presently suggests that we are not equally homo sapiens sapiens), it is that we simply do not view her as being fully civilized for the obvious historical reason that she is not.</p><p>She is lying about the laws in Texas and Florida too.  The laws are not there to let whites ” just shoot people like me, without<br> consequence, as long as they feel threatened by my presence”, those self-defense laws have been put in place to let whites defend their lives and their property from people, like her, who are half-savages engaged in attacking them.</br></p><p>Jemisin’s disregard for the truth is no different than the average Chicago gangbanger’s disregard for the traditional Western code of civilized conduct. She could, if she wished, claim that <a href=\"http://takimag.com/article/a_requiem_for_science_john_derbyshire/print#axzz2VRscg5Hq\">privileged white males</a> are responsible for the decline of Detroit, for the declining sales of science fiction, even for the economic and cultural decline of the United States, but that would not make it true.  It would not even make it credible.  Anyone who is paying sufficient attention will understand who is genuinely responsible for these problems.</p><p>Unlike the white males she excoriates, there is no evidence to be found anywhere on the planet that a society of NK Jemisins is capable of building an advanced civilization, or even successfully maintaining one without significant external support from those white males.  If one considers that it took my English and German ancestors more than one thousand years to become fully civilized after their first contact with advanced Greco-Roman civilization, it should be patently obvious that it is illogical to imagine, let alone insist, that Africans have somehow managed to do the same in less than half the time at a greater geographic distance.  These things take time.</p><p>Being an educated, but ignorant half-savage, with little more understanding of what it took to build a new literature by “a bunch of beardy old middle-class middle-American guys” than an illiterate Igbotu tribesman has of how to build a jet engine, Jemisin clearly does not understand that her dishonest call for “reconciliation” and even more diversity within SF/F is tantamount to a call for its decline into irrelevance. Nor do the back-patting Samuel Johnsons wiping their eyes and congratulating her for her ever-so-touching speech understand that.</p><p>There can be no reconciliation between the observant and the delusional.</p><p>UPDATE: It may amuse some of you to know that in making her false claim, NK Jemisin appears to have violated the SFWA Forum rules, which state: “<i>[A]ll posts made here are confidential. Material may not be re-posted<br> outside these forums without the explicit permission of their authors.”</br></i>   I am confident the moderators of the SFWA will be swift to deal with this violation of the organization’s rules.</p><p>UPDATE 2: The Spitefully Fascist Writers of America are on the job!  This post was resulted in the following email:  <i>“Your blog feed has been removed from the @SFWAauthors aggregator due to violating of the policies of this service, specifically:  “Marking blog posts for inclusion that include threats or personal attacks or obvious trolling will also be grounds for removal.”” </i></p><p>UPDATE 3: Now the SFWA moderators have, at least temporarily, wiped my comments off the SFWA Forum thread while leaving the attacks on me untouched.  What a pity that 20x more people will read everything here instead.  Keep this in mind when you’re trying to argue that there are no ideological gatekeepers in the SF/F publishing world.  They <i>desperately </i>want to silence all disssent, and they’re tremendously frustrated that they don’t have the wherewithal.<i></i><br> <i><br/></i><br> UPDATE 4: As always, I am quite willing to publicly debate Ms Jemisin, Mr. Sanford, or any other member of the SFWA concerning the issues raised here, be it on the SFWA Forum, this blog, or any other written venue.  And if all these passionate champions of human equality are afraid to defend their views in public, as were Messrs Myers and McRapey in the past, well, everyone knows perfectly well what that signifies, their protestations notwithstanding.<i></i><br> <i><br/></i><br> UPDATE 5: McRapey has the perfect solution to the Problem that Must Not Be Named.  He’s going to <a href=\"http://whatever.scalzi.com/2013/06/13/pledge-matching-today-for-the-carl-brandon-society/\">give money to ANOTHER charity</a>. That will show me!<i>  </i>When did “donation” replace “education” as the left-liberal solution to all evils?<i><br/></i></br></br></br></br></p></div>",
  "content_text": "NK Jemisin\nis publicly lying about me and a few other things\nin Australia as she blithely advocates the continued self-destruction of science fiction:\nRight now American politicians are doing their best to roll back\nvoting rights won during our own Civil Rights movement.  They are\nputting in place educational “reforms” which disproportionately have a\nnegative impact on black and brown and poor white kids, and will\nessentially help to solidify a permanent underclass.  Right now there\nare laws in places like Florida and Texas which are intended to make it\nessentially legal for white people to just shoot people like me, without\nconsequence, as long as they feel threatened by my presence.  So:\nadmitting that the land we live on was stolen from hundreds of other\nnations and peoples?  Acknowledging that the prosperity the United\nStates enjoys was bought with blood?  That’s a pipe dream.\nI want you to understand that what you’ve done makes me want to weep with envy, and bitterness, and hope.\nSo:  segue time.  Let’s scale down.  Let’s talk about the community — the microcosmic nation — of science fiction and fantasy.\nFor the past few days I’ve also been observing a “kerfuffle”, as some\ncall it, in reaction to the Science Fiction and Fantasy Writers’ of\nAmerica’s latest professional journal, the Bulletin.  Some of you may\nalso have been following the discussion; hopefully not all of you.  To\nsummarize:  two of the genre’s most venerable white male writers made\nsome comments in a series of recent articles which have been decried as\nsexist and racist by most of the organization’s membership.  Now, to put\nthis in context:  the membership of SFWA also recently voted in a new\npresident.  There were two candidates — one of whom was a self-described\nmisogynist, racist, anti-Semite, and a few other flavors of asshole.\nIn this election he lost by a landslide… but he still earned ten percent\nof the vote.  SFWA is small; only about 500 people voted in total, so\nwe’re talking less than 50 people.  But scale up again.  Imagine if ten\npercent of this country’s population was busy making active efforts to\ntake away not mere privileges, not even dignity, but your most basic\nrights.  Imagine if ten percent of the people you interacted with, on a\ndaily basis, did not regard you as human.\nJust ten percent.  But\nsuch\na ten percent.\nAnd beyond that ten percent are the silent majority — the great\nunmeasured mass of enablers.  These are the folks who don’t object to\nthe treatment of women as human beings, and who may even have the odd\nblack or gay friend that they genuinely like.  However, when the ten\npercent starts up in their frothing rage, these are the people who say\nnothing in response.  When women and other marginalized groups respond\nwith anger to the hatred of the ten percent, these are the people who do\nnot support them, and in fact suggest that maybe they’re overreacting.\nWhen they read a novel set in a human society which contains only one\nor two female characters, these are the people who don’t decry this as\nimplausible.  Or worse, they simply don’t notice.  These are the people\nwho successfully campaigned for Star Trek to return to television after\n25 years, but have no intention of campaigning for Roddenberry’s vision\nto be complete, with gay characters joining the rainbow brigade on the\nbridge.  These are the people who gleefully nitpick the scientific\nplausibility of stopping a volcano with “cold fusion”, yet who fail to\nnotice that an author has written a future earth in which somehow\nseventeen percent of the human race dominates ninety percent of the\ncharacterization.\nLet me be perfectly clear.  I do not describe myself as a “misogynist, racist, anti-Semite, and a few other flavors of asshole”.  John Scalzi, Patrick Nielsen Hayden, and Theresa Nielsen Hayden, among others, have described me that way.  Of course, John Scalzi also\ndescribes himself as a rapist\n, Patrick Nielsen Hayden took his wife’s name when he got married, and Theresa Nielsen Hayden is dumb enough to have claimed a prominent Game blogger with three Billboard-charting club hits “is not acquainted with actual women.”\nGranted,\nSpacebunny\nand\nthe fat frog that is Nielsen Hayden\ndon’t look as if they belong to the same phylum, let alone the same species, so perhaps the key word is not “women, but “actual” in the sense of “grotesquely malformed”.\nI therefore suggest that their assertions should be taken with at least a small grain of salt rather than credited to me. And it should be obvious that, being a libertarian, I am not actively attempting to take away anyone’s “most basic rights”.  Jemisin has it wrong; it is not that I, and others, do not view her as human, (although genetic science presently suggests that we are not equally homo sapiens sapiens), it is that we simply do not view her as being fully civilized for the obvious historical reason that she is not.\nShe is lying about the laws in Texas and Florida too.  The laws are not there to let whites ” just shoot people like me, without\nconsequence, as long as they feel threatened by my presence”, those self-defense laws have been put in place to let whites defend their lives and their property from people, like her, who are half-savages engaged in attacking them.\nJemisin’s disregard for the truth is no different than the average Chicago gangbanger’s disregard for the traditional Western code of civilized conduct. She could, if she wished, claim that\nprivileged white males\nare responsible for the decline of Detroit, for the declining sales of science fiction, even for the economic and cultural decline of the United States, but that would not make it true.  It would not even make it credible.  Anyone who is paying sufficient attention will understand who is genuinely responsible for these problems.\nUnlike the white males she excoriates, there is no evidence to be found anywhere on the planet that a society of NK Jemisins is capable of building an advanced civilization, or even successfully maintaining one without significant external support from those white males.  If one considers that it took my English and German ancestors more than one thousand years to become fully civilized after their first contact with advanced Greco-Roman civilization, it should be patently obvious that it is illogical to imagine, let alone insist, that Africans have somehow managed to do the same in less than half the time at a greater geographic distance.  These things take time.\nBeing an educated, but ignorant half-savage, with little more understanding of what it took to build a new literature by “a bunch of beardy old middle-class middle-American guys” than an illiterate Igbotu tribesman has of how to build a jet engine, Jemisin clearly does not understand that her dishonest call for “reconciliation” and even more diversity within SF/F is tantamount to a call for its decline into irrelevance. Nor do the back-patting Samuel Johnsons wiping their eyes and congratulating her for her ever-so-touching speech understand that.\nThere can be no reconciliation between the observant and the delusional.\nUPDATE: It may amuse some of you to know that in making her false claim, NK Jemisin appears to have violated the SFWA Forum rules, which state: “\n[A]ll posts made here are confidential. Material may not be re-posted\noutside these forums without the explicit permission of their authors.”\nI am confident the moderators of the SFWA will be swift to deal with this violation of the organization’s rules.\nUPDATE 2: The Spitefully Fascist Writers of America are on the job!  This post was resulted in the following email:\n“Your blog feed has been removed from the @SFWAauthors aggregator due to violating of the policies of this service, specifically:  “Marking blog posts for inclusion that include threats or personal attacks or obvious trolling will also be grounds for removal.””\nUPDATE 3: Now the SFWA moderators have, at least temporarily, wiped my comments off the SFWA Forum thread while leaving the attacks on me untouched.  What a pity that 20x more people will read everything here instead.  Keep this in mind when you’re trying to argue that there are no ideological gatekeepers in the SF/F publishing world.  They\ndesperately\nwant to silence all disssent, and they’re tremendously frustrated that they don’t have the wherewithal.\nUPDATE 4: As always, I am quite willing to publicly debate Ms Jemisin, Mr. Sanford, or any other member of the SFWA concerning the issues raised here, be it on the SFWA Forum, this blog, or any other written venue.  And if all these passionate champions of human equality are afraid to defend their views in public, as were Messrs Myers and McRapey in the past, well, everyone knows perfectly well what that signifies, their protestations notwithstanding.\nUPDATE 5: McRapey has the perfect solution to the Problem that Must Not Be Named.  He’s going to\ngive money to ANOTHER charity\n. That will show me!\nWhen did “donation” replace “education” as the left-liberal solution to all evils?",
  "tags": [
    "SFWA",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-13T07:29:00+00:00"
}