{
  "url": "https://voxday.net/2013/06/23/a-different-kind-of-awesome/",
  "scraped_at": "2025-12-14T22:33:00.854734",
  "title": "A different kind of awesome",
  "date_display": "June 23, 2013",
  "date_iso": "2013-06-23T20:00:00+00:00",
  "date_from_url": "2013-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It may strike some as ironic, but I have to confess, I very much enjoy reading through <a href=\"http://requireshate.wordpress.com/reviews-index/\">the book reviews/rants</a> by the rabid lady reviewer known as Requires Only That You Hate. The fascinating thing is that despite her ability to detect misogyny in a gust of wind and racism in a blade of grass, she’s actually less inclined to give the mediocre writers of the SF/F field a pass on the basis of their sex and color than most readers and reviewers are. </p><p>Consider <a href=\"https://requireshate.wordpress.com/2011/04/14/over-9000-kingdoms-sex-and-whales-with-faces-of-long-lost-friends/\">her review of one ignorant half-savage’s ludicrously overpraised work</a>, the condescending plaudits for which are more intrinsically racist than most historical KKK pamphlets.</p><blockquote class=\"tr_bq\"><p> As I speed-read through <i>The Hundred Thousand Kingdoms</i>, I couldn’t get rid of the nagging suspicion that I’ve read this before. At first I thought Laurell K. Hamilton, because some of the sex descriptions are very silly, but that’s not it. Then I thought that the obligatory dark-haired bishounen Nahadoth shares several qualities with a certain breed of demon lovers from trashy paranormal romances or possibly Edward Cullen.</p><p>It wasn’t until I read a review that gushes something along the line of “fans of Anne Bishop’s Daemon won’t be able to help being just a bit in love with Nahadoth” that it finally clicked: this is the Black Jewels trilogy sans the giant Mary Sue, horrible writing, and creepy pedophilia….</p><p>Jemisin is much like Bishop in that she doesn’t give a shit about her<br> setting or, if she does, lacks the life to breathe into it. You might<br> wonder: what does the world/country/land look like? No clue, beyond that<br> Sky is white and pearly. What’s their technology level? Who knows (the<br> author answered this in an interview, but if you can’t tell by reading<br> the book alone, <i>well then</i>). The setting’s a cardboard backdrop<br> that might fall over and crumble any minute. One of the novel’s selling<br> points is that it supposedly veers from a typical medieval European<br> culture and the protagonist is dark-skinned, but frankly, you can’t<br> tell. When I said Borgias on steroids, I meant it: the Arameri is one<br> big lump of implied incest, sadism, corruption, and loads of other<br> things that would have impressed the Lannisters except every single one<br> of them–except for Yeine’s mother–is a blithering idiot. They behave in<br> exactly the way you would expect from my description. Their customs are<br> as generic fantasy as they come….</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Easily the most overrated thing ever to come out recently, and I’m going<br> to assume that people who gush over how groundbreaking it all is have<br> only ever read Tolkien and <i>Eragon</i>.</br></br></p></blockquote><p>I think this may be the woman against whom R. Scott Bakker was so desperate to set me when he was being hit from both sides for his unseemly fascination with raping every female character that so much as twitched in his novels.  Regardless, aside from her ideologically driven preferences, RH has reasonably good taste in SF/F, as she thinks well of Tanith Lee, Joan D. Vinge, and China Mieville, while turning up her nose at overrated mediocrities like Jemisin, Sheri Tepper, Jasper Fforde, and Saladin Ahmed. </p><p>She’s a bit harsh on Jim Butcher, but for some of the right reasons as she correctly identifies the psychosexual development of his characters as being stuck at the teenage level and Harry Dresden being an idealized stand-in for his gamma male creator.  She accurately nails Joe Abercrombie for writing primarily for effect. And she’s uncommonly observant with regards to Neil Gaiman, whose fans will likely never be able to regard his work in quite the same way after reading her adroit demonstration of how Gaiman keeps writing the same book over and over and over again.</p><blockquote class=\"tr_bq\"><p> After a certain point it’s no longer fun and you ram up against the realization that they are all the same fucking story.</p><p>Oh sure, the characters have different names. They have different tones–Stardust is, I think, meant to be young adult. But observe this:</p><ul><li>gutless, spineless everyman-loser protagonist with limited personality, intelligence, and no charm: hereafter known as Mr. Cliched Stock Type</li><li>the woman who henpecks Mr. Cliched Stock Type</li><li>Mr. Cliched Stock Type discovers a hidden magical world</li><li>Mr. Cliched Stock Type discovers a special destiny, either prophesied, part of his secret magic heritage, or both</li><li>Mr. Cliched Stock Type fulfills special destiny</li></ul><p>Now you’re going to go BUT HERO’S JOURNEY JOHN CAMPBELL and I’m going to go SHUT THE FUCK UP. Setting aside for a moment that I’m willing to punch anybody who cites Campbell’s “monomyth” as an excuse for shitty writing, lack of imagination, and all around inability to write–setting aside that, it’s not only the similarity in structure. It’s that Neverwhere, Stardust, American Gods and Anansi Boys are written by the exact same man. It’s that Mr. Stock Type shows up for all four, each iteration as dull and insufferable as the last, distinguishable only faintly by his name.</p><p>Leaving American Gods and Stardust alone for now, this isn’t so much a matter of “oh you could do this to any fantasy book,” itself an asinine proposition, because not all fantasy books feature a timid Londoner devoid of ambition who has relationship troubles with a demanding sweetheart/fiancee. The sweethearts in question(respectively Rosie Noah, Jessica, and Victoria Forrester) are likewise identical: thinly written, demanding, henpecking, and not the brightest. Really Gaiman kind of sucks at writing women, and apart from this one incredibly tertiary character in American Gods I don’t think he’s particularly comfortable with gay men–certainly not enough to write them as protagonists. Similarly, the catalyst to “finding the secret magic world” is always more or less the same: through colliding with one of said secret world’s inhabitants.</p></blockquote><p>It does tend to raise certain questions about Mr. Gaiman’s past relationships, does it not? And although she doesn’t quite grasp the point of Mieville’s excellent <i>Embassytown</i>, (nor is she able to grok either his <i>Kraken</i>, or <i>City and the City</i>), she does at least recognize that it is an unusual and highly intelligent work.</p><p>Given her pure and burning hatred for all things civilizational, I suspect it would be more than a little hilarious if she were to review <i>A Throne of Bones</i>.  RH, if you happen to read this, I should be absolutely delighted to send you an ebook and discover what panoply of horrors you are capable of discerning there.</p></div>",
  "content_text": "It may strike some as ironic, but I have to confess, I very much enjoy reading through\nthe book reviews/rants\nby the rabid lady reviewer known as Requires Only That You Hate. The fascinating thing is that despite her ability to detect misogyny in a gust of wind and racism in a blade of grass, she’s actually less inclined to give the mediocre writers of the SF/F field a pass on the basis of their sex and color than most readers and reviewers are.\nConsider\nher review of one ignorant half-savage’s ludicrously overpraised work\n, the condescending plaudits for which are more intrinsically racist than most historical KKK pamphlets.\nAs I speed-read through\nThe Hundred Thousand Kingdoms\n, I couldn’t get rid of the nagging suspicion that I’ve read this before. At first I thought Laurell K. Hamilton, because some of the sex descriptions are very silly, but that’s not it. Then I thought that the obligatory dark-haired bishounen Nahadoth shares several qualities with a certain breed of demon lovers from trashy paranormal romances or possibly Edward Cullen.\nIt wasn’t until I read a review that gushes something along the line of “fans of Anne Bishop’s Daemon won’t be able to help being just a bit in love with Nahadoth” that it finally clicked: this is the Black Jewels trilogy sans the giant Mary Sue, horrible writing, and creepy pedophilia….\nJemisin is much like Bishop in that she doesn’t give a shit about her\nsetting or, if she does, lacks the life to breathe into it. You might\nwonder: what does the world/country/land look like? No clue, beyond that\nSky is white and pearly. What’s their technology level? Who knows (the\nauthor answered this in an interview, but if you can’t tell by reading\nthe book alone,\nwell then\n). The setting’s a cardboard backdrop\nthat might fall over and crumble any minute. One of the novel’s selling\npoints is that it supposedly veers from a typical medieval European\nculture and the protagonist is dark-skinned, but frankly, you can’t\ntell. When I said Borgias on steroids, I meant it: the Arameri is one\nbig lump of implied incest, sadism, corruption, and loads of other\nthings that would have impressed the Lannisters except every single one\nof them–except for Yeine’s mother–is a blithering idiot. They behave in\nexactly the way you would expect from my description. Their customs are\nas generic fantasy as they come….\nEasily the most overrated thing ever to come out recently, and I’m going\nto assume that people who gush over how groundbreaking it all is have\nonly ever read Tolkien and\nEragon\n.\nI think this may be the woman against whom R. Scott Bakker was so desperate to set me when he was being hit from both sides for his unseemly fascination with raping every female character that so much as twitched in his novels.  Regardless, aside from her ideologically driven preferences, RH has reasonably good taste in SF/F, as she thinks well of Tanith Lee, Joan D. Vinge, and China Mieville, while turning up her nose at overrated mediocrities like Jemisin, Sheri Tepper, Jasper Fforde, and Saladin Ahmed.\nShe’s a bit harsh on Jim Butcher, but for some of the right reasons as she correctly identifies the psychosexual development of his characters as being stuck at the teenage level and Harry Dresden being an idealized stand-in for his gamma male creator.  She accurately nails Joe Abercrombie for writing primarily for effect. And she’s uncommonly observant with regards to Neil Gaiman, whose fans will likely never be able to regard his work in quite the same way after reading her adroit demonstration of how Gaiman keeps writing the same book over and over and over again.\nAfter a certain point it’s no longer fun and you ram up against the realization that they are all the same fucking story.\nOh sure, the characters have different names. They have different tones–Stardust is, I think, meant to be young adult. But observe this:\ngutless, spineless everyman-loser protagonist with limited personality, intelligence, and no charm: hereafter known as Mr. Cliched Stock Type\nthe woman who henpecks Mr. Cliched Stock Type\nMr. Cliched Stock Type discovers a hidden magical world\nMr. Cliched Stock Type discovers a special destiny, either prophesied, part of his secret magic heritage, or both\nMr. Cliched Stock Type fulfills special destiny\nNow you’re going to go BUT HERO’S JOURNEY JOHN CAMPBELL and I’m going to go SHUT THE FUCK UP. Setting aside for a moment that I’m willing to punch anybody who cites Campbell’s “monomyth” as an excuse for shitty writing, lack of imagination, and all around inability to write–setting aside that, it’s not only the similarity in structure. It’s that Neverwhere, Stardust, American Gods and Anansi Boys are written by the exact same man. It’s that Mr. Stock Type shows up for all four, each iteration as dull and insufferable as the last, distinguishable only faintly by his name.\nLeaving American Gods and Stardust alone for now, this isn’t so much a matter of “oh you could do this to any fantasy book,” itself an asinine proposition, because not all fantasy books feature a timid Londoner devoid of ambition who has relationship troubles with a demanding sweetheart/fiancee. The sweethearts in question(respectively Rosie Noah, Jessica, and Victoria Forrester) are likewise identical: thinly written, demanding, henpecking, and not the brightest. Really Gaiman kind of sucks at writing women, and apart from this one incredibly tertiary character in American Gods I don’t think he’s particularly comfortable with gay men–certainly not enough to write them as protagonists. Similarly, the catalyst to “finding the secret magic world” is always more or less the same: through colliding with one of said secret world’s inhabitants.\nIt does tend to raise certain questions about Mr. Gaiman’s past relationships, does it not? And although she doesn’t quite grasp the point of Mieville’s excellent\nEmbassytown\n, (nor is she able to grok either his\nKraken\n, or\nCity and the City\n), she does at least recognize that it is an unusual and highly intelligent work.\nGiven her pure and burning hatred for all things civilizational, I suspect it would be more than a little hilarious if she were to review\nA Throne of Bones\n.  RH, if you happen to read this, I should be absolutely delighted to send you an ebook and discover what panoply of horrors you are capable of discerning there.",
  "tags": [
    "books",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-23T19:00:00+00:00"
}