{
  "url": "https://voxday.net/2013/06/09/a-hero-of-human-liberty/",
  "scraped_at": "2025-12-14T22:31:22.473990",
  "title": "A hero of human liberty",
  "date_display": "June 9, 2013",
  "date_iso": "2013-06-09T23:11:00+00:00",
  "date_from_url": "2013-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Edward Snowden <a href=\"http://www.guardian.co.uk/world/2013/jun/09/edward-snowden-nsa-whistleblower-surveillance?guni=Network%20front:network-front%20full-width-1%20bento-box:Bento%20box:Position1\">made the brave, self-sacrificing choice</a> that hundreds of thousands of servants of the machine could make, but do not, every single day.  He informed the American people, and the people of the world, what the US government is doing to them.  I think it is entirely possible that he will one day come to be considered an American Solzhenitsyn:</p><blockquote class=\"tr_bq\"><p>  The individual responsible for one of the most significant leaks in US political history is Edward Snowden, a 29-year-old former technical assistant for the CIA and current employee of the defence contractor Booz Allen Hamilton. Snowden has been working at the National Security Agency for the last four years as an employee of various outside contractors, including Booz Allen and Dell.</p><p>The Guardian, after several days of interviews, is revealing his identity at his request. From the moment he decided to disclose numerous top-secret documents to the public, he was determined not to opt for the protection of anonymity. “I have no intention of hiding who I am because I know I have done nothing wrong,” he said….</p><p>He does not fear the consequences of going public, he said, only that<br> doing so will distract attention from the issues raised by his<br> disclosures. “I know the media likes to personalise political debates,<br> and I know the government will demonise me.”</br></br></br></p><p>Despite these fears,<br> he remained hopeful his outing will not divert attention from the<br> substance of his disclosures. “I really want the focus to be on these<br> documents and the debate which I hope this will trigger among citizens<br> around the globe about what kind of world we want to live in.” He added:<br> “My sole motive is to inform the public as to that which is done in<br> their name and that which is done against them.”</br></br></br></br></br></br></p><p>He has had “a<br> very comfortable life” that included a salary of roughly $200,000, a<br> girlfriend with whom he shared a home in Hawaii, a stable career, and a<br> family he loves. “I’m willing to sacrifice all of that because I can’t<br> in good conscience allow the US government to destroy privacy, internet freedom and basic liberties for people around the world with<br> this massive surveillance machine they’re secretly building.”</br></br></br></br></br></p></blockquote><p>I know it is very difficult for most Americans to grasp this, but the US government are not the good guys here.  They are even worse than the bad guys from whom they claim to be protecting you.  Before you condemn Snowden as a traitor, remember, George Washington, Samuel Adams, and Thomas Jefferson were, from the perspective of the British crown, traitors too.</p></div>",
  "content_text": "Edward Snowden\nmade the brave, self-sacrificing choice\nthat hundreds of thousands of servants of the machine could make, but do not, every single day.  He informed the American people, and the people of the world, what the US government is doing to them.  I think it is entirely possible that he will one day come to be considered an American Solzhenitsyn:\nThe individual responsible for one of the most significant leaks in US political history is Edward Snowden, a 29-year-old former technical assistant for the CIA and current employee of the defence contractor Booz Allen Hamilton. Snowden has been working at the National Security Agency for the last four years as an employee of various outside contractors, including Booz Allen and Dell.\nThe Guardian, after several days of interviews, is revealing his identity at his request. From the moment he decided to disclose numerous top-secret documents to the public, he was determined not to opt for the protection of anonymity. “I have no intention of hiding who I am because I know I have done nothing wrong,” he said….\nHe does not fear the consequences of going public, he said, only that\ndoing so will distract attention from the issues raised by his\ndisclosures. “I know the media likes to personalise political debates,\nand I know the government will demonise me.”\nDespite these fears,\nhe remained hopeful his outing will not divert attention from the\nsubstance of his disclosures. “I really want the focus to be on these\ndocuments and the debate which I hope this will trigger among citizens\naround the globe about what kind of world we want to live in.” He added:\n“My sole motive is to inform the public as to that which is done in\ntheir name and that which is done against them.”\nHe has had “a\nvery comfortable life” that included a salary of roughly $200,000, a\ngirlfriend with whom he shared a home in Hawaii, a stable career, and a\nfamily he loves. “I’m willing to sacrifice all of that because I can’t\nin good conscience allow the US government to destroy privacy, internet freedom and basic liberties for people around the world with\nthis massive surveillance machine they’re secretly building.”\nI know it is very difficult for most Americans to grasp this, but the US government are not the good guys here.  They are even worse than the bad guys from whom they claim to be protecting you.  Before you condemn Snowden as a traitor, remember, George Washington, Samuel Adams, and Thomas Jefferson were, from the perspective of the British crown, traitors too.",
  "tags": [
    "conspiracy",
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-09T22:11:00+00:00"
}