{
  "url": "https://voxday.net/2013/06/23/a-mysterious-sinking/",
  "scraped_at": "2025-12-14T22:32:57.165777",
  "title": "A mysterious sinking",
  "date_display": "June 23, 2013",
  "date_iso": "2013-06-23T12:43:00+00:00",
  "date_from_url": "2013-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote class=\"tr_bq\"><p> <b>MOL Comfort Suffers Broken Back, Sinks Off Yemen <a href=\"http://gcaptain.com/mol-box-ship-suffers-broken-back-sinks-off-yeme/\">Remains Adrift Off Yemen</a></b><br> 26 crewmembers of an MOL container ship were forced to abandon ship<br> Monday off Yemen after the ship suffered from catastrophic hull failure<br> and <br> reportedly sankbroke in two. The MV MOL Comfort, an 8,000 TEU-type container ship cracked in half<br> about 200 miles from the Yemeni coast at about 12’30″N 60′E while<br> enroute from Singapore to Jeddah with a load of 7,041 TEUs. All 26 crew –<br> made up 11 Russians, 1 Ukrainian and 14 Filipinos – escaped the sinking<br> ship on two life rafts and a lifeboat.</br></br></br></br></br></br></br></br></p></blockquote><p>So, do the Russians have an attack sub called “<a href=\"http://beforeitsnews.com/alternative/2013/06/container-ship-carrying-weapons-for-syrian-rebels-splits-in-halfsinks-2689692.html\">Yet Unclear Reasons</a>“? Or, as appears more likely, did one of those Russian crew members take a creative approach to ship’s maintenance<b>?</b> If it is true that the MOL Comfort was carrying arms intended for the Syrian rebels, it would appear that Mr. Putin has called Mr. Obama’s decision to raise the ante.</p></div>",
  "content_text": "MOL Comfort Suffers Broken Back, Sinks Off Yemen\nRemains Adrift Off Yemen\n26 crewmembers of an MOL container ship were forced to abandon ship\nMonday off Yemen after the ship suffered from catastrophic hull failure\nand\nreportedly sankbroke in two. The MV MOL Comfort, an 8,000 TEU-type container ship cracked in half\nabout 200 miles from the Yemeni coast at about 12’30″N 60′E while\nenroute from Singapore to Jeddah with a load of 7,041 TEUs. All 26 crew –\nmade up 11 Russians, 1 Ukrainian and 14 Filipinos – escaped the sinking\nship on two life rafts and a lifeboat.\nSo, do the Russians have an attack sub called “\nYet Unclear Reasons\n“? Or, as appears more likely, did one of those Russian crew members take a creative approach to ship’s maintenance\n?\nIf it is true that the MOL Comfort was carrying arms intended for the Syrian rebels, it would appear that Mr. Putin has called Mr. Obama’s decision to raise the ante.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-23T11:43:00+00:00"
}