{
  "url": "https://voxday.net/2013/06/11/a-robot-doubles-down/",
  "scraped_at": "2025-12-14T22:31:36.918493",
  "title": "A Robot doubles down",
  "date_display": "June 11, 2013",
  "date_iso": "2013-06-11T20:20:00+00:00",
  "date_from_url": "2013-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The remarkable thing about these leftist idiots is how shameless they are.  It doesn’t matter how badly they are caught out, or how completely they are shown to be wrong, they will double-down without hesitation, as A Robot does <a href=\"http://www.amazon.com/review/R23EUJ2AO1E50A/ref=cm_cr_rev_detmd_pl?ie=UTF8&amp;asin=1594036756&amp;cdForum=Fx237TMB1YZ2SWT&amp;cdMsgID=Mx30TK0Y46L4ASD&amp;cdMsgNo=4&amp;cdPage=1&amp;cdSort=oldest&amp;cdThread=Tx3JCX1YBKXB8E3&amp;store=books#Mx30TK0Y46L4ASD\">in defense of his “review”</a> of Men on Strike:</p><blockquote class=\"tr_bq\"><p> In reviewing scientific literature, which Men On Strike purports to be,<br> one must review the source material which the author uses to support the<br> claims and assertions of the author. The source material is the basic<br> evidence that the author uses to show the person reading the book, “hey,<br> these things that I’m writing? They’re supported by facts, evidence,<br> and research. You can trust me and my work because a lot of time and<br> effort has gone into reviewing this material and making sure the most<br> accurate depiction of the facts of the matter at hand is presented.”</br></br></br></br></br></br></br></p><p>You<br> cannot separate reviewing the source material from reviewing the book<br> at hand, because the source material is the entire reason that one<br> should believe the assertions of the book. If you’re reading a book that<br> seriously studies any natural, social, or scientific phenomenon, you<br> have to check the source material. Theodore Beale is just one of many<br> sources not worth trusting that are liberally sourced in Helen Smith’s<br> book: Vox Day taken as a serious source of unbiased, well-researched<br> material is just the most egregious example and the one that could be<br> most easily demonstrated due to the great deal of material Beale puts<br> online.</br></br></br></br></br></br></br></br></br></br></p><p>That said, even without the contributions of Vox Day, Men<br> On Strike suffers greatly from a serious lack of actual research. The<br> vast majority of claims that it makes about men and women<br> (psychologically, socially, or otherwise) are not based on verifiable<br> data, instead relying on the anecdotes of whoever Smith could find that<br> supported the view she puts forth in Men On Strike. The book has not<br> gone through the peer review process that scientific literature goes<br> through to ensure accuracy. I’ve been totally unable to find any amount<br> of literature written by Helen Smith from any sort of peer-reviewed<br> journal or database. The only things I’ve been able to find written by<br> Helen Smith appear on her personal web site, and on the web sites of<br> people or organizations who share her political beliefs.</br></br></br></br></br></br></br></br></br></br></br></p><p>Real<br> scientists write and research for the purpose of scientific advancement,<br> and a big part of doing that is making sure that their research stands<br> up to peer review. The acknowledgements make no mention of any person<br> who reviewed Men On Strike to make sure it was scientifically accurate.<br> She mentions “friends and colleagues who have helped and encouraged”<br> her, but that is the only thing close to acknowledging scientific peer<br> review. Helen Smith intentionally decided not to bring her book to the<br> attention of the scientific community while presenting her book as<br> supported by scientific research and scrutiny. Her footnotes are filled<br> with references to her own research, and there are more citations of<br> blogs and of political organizations than of real scientific literature<br> on any subject even ostensibly related to the subject of sexual<br> inequality.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Men On Strike is, above all else, a compilation of<br> anecdote and political bias. It has no basis in research or verifiable<br> evidence beyond the quotations in her book having actually existed. </br></br></p></blockquote><p>The amusing thing is that this defense proves, beyond any shadow of a doubt, that he didn’t read the book.  Dr. Helen directly addresses this line of criticism in the book, pointing out that she is being held to a standard to which no female writer attacking men is ever held.   Men on Strike isn’t “scientific literature”; it doesn’t pretend to be.</p><p>Ironically enough, in his attempt to keep people from reading Dr. Helen’s book, he’s only brought new people to the blog, such as KC:</p><blockquote class=\"tr_bq\"><p> I just stumbled upon your blog yesterday, ironically through the<br> 1-star Men On Strike review that pointed me to your site.  (“Nobody can possibly be as<br> wacked-out as this person is saying,” I thought to myself, intent<br> on verification.) So far, I’ve found your site by turns<br> interesting, thought-provoking, and mildly infuriating.  (Thanks<br> for all the fantasy and SF links, by the way.) I just have one<br> question.  Since your views on Christianity are, well, not the<br> most mainstream, I’m wondering if you came by them on your own or<br> if there are any particular theologians or books you’ve drawn on<br> for inspiration.</br></br></br></br></br></br></br></br></br></p></blockquote><p>KC, didn’t you know you’re always supposed to accept the claims of a leftist, no matter how absurd, without verifying them?  How are they supposed to be taken seriously if you’re actually going to look into what they are saying?  Anyhow, in answer to KC’s question, GK Chesterton and CS Lewis are the two Christian writers I have found most inspiring.</p></div>",
  "content_text": "The remarkable thing about these leftist idiots is how shameless they are.  It doesn’t matter how badly they are caught out, or how completely they are shown to be wrong, they will double-down without hesitation, as A Robot does\nin defense of his “review”\nof Men on Strike:\nIn reviewing scientific literature, which Men On Strike purports to be,\none must review the source material which the author uses to support the\nclaims and assertions of the author. The source material is the basic\nevidence that the author uses to show the person reading the book, “hey,\nthese things that I’m writing? They’re supported by facts, evidence,\nand research. You can trust me and my work because a lot of time and\neffort has gone into reviewing this material and making sure the most\naccurate depiction of the facts of the matter at hand is presented.”\nYou\ncannot separate reviewing the source material from reviewing the book\nat hand, because the source material is the entire reason that one\nshould believe the assertions of the book. If you’re reading a book that\nseriously studies any natural, social, or scientific phenomenon, you\nhave to check the source material. Theodore Beale is just one of many\nsources not worth trusting that are liberally sourced in Helen Smith’s\nbook: Vox Day taken as a serious source of unbiased, well-researched\nmaterial is just the most egregious example and the one that could be\nmost easily demonstrated due to the great deal of material Beale puts\nonline.\nThat said, even without the contributions of Vox Day, Men\nOn Strike suffers greatly from a serious lack of actual research. The\nvast majority of claims that it makes about men and women\n(psychologically, socially, or otherwise) are not based on verifiable\ndata, instead relying on the anecdotes of whoever Smith could find that\nsupported the view she puts forth in Men On Strike. The book has not\ngone through the peer review process that scientific literature goes\nthrough to ensure accuracy. I’ve been totally unable to find any amount\nof literature written by Helen Smith from any sort of peer-reviewed\njournal or database. The only things I’ve been able to find written by\nHelen Smith appear on her personal web site, and on the web sites of\npeople or organizations who share her political beliefs.\nReal\nscientists write and research for the purpose of scientific advancement,\nand a big part of doing that is making sure that their research stands\nup to peer review. The acknowledgements make no mention of any person\nwho reviewed Men On Strike to make sure it was scientifically accurate.\nShe mentions “friends and colleagues who have helped and encouraged”\nher, but that is the only thing close to acknowledging scientific peer\nreview. Helen Smith intentionally decided not to bring her book to the\nattention of the scientific community while presenting her book as\nsupported by scientific research and scrutiny. Her footnotes are filled\nwith references to her own research, and there are more citations of\nblogs and of political organizations than of real scientific literature\non any subject even ostensibly related to the subject of sexual\ninequality.\nMen On Strike is, above all else, a compilation of\nanecdote and political bias. It has no basis in research or verifiable\nevidence beyond the quotations in her book having actually existed.\nThe amusing thing is that this defense proves, beyond any shadow of a doubt, that he didn’t read the book.  Dr. Helen directly addresses this line of criticism in the book, pointing out that she is being held to a standard to which no female writer attacking men is ever held.   Men on Strike isn’t “scientific literature”; it doesn’t pretend to be.\nIronically enough, in his attempt to keep people from reading Dr. Helen’s book, he’s only brought new people to the blog, such as KC:\nI just stumbled upon your blog yesterday, ironically through the\n1-star Men On Strike review that pointed me to your site.  (“Nobody can possibly be as\nwacked-out as this person is saying,” I thought to myself, intent\non verification.) So far, I’ve found your site by turns\ninteresting, thought-provoking, and mildly infuriating.  (Thanks\nfor all the fantasy and SF links, by the way.) I just have one\nquestion.  Since your views on Christianity are, well, not the\nmost mainstream, I’m wondering if you came by them on your own or\nif there are any particular theologians or books you’ve drawn on\nfor inspiration.\nKC, didn’t you know you’re always supposed to accept the claims of a leftist, no matter how absurd, without verifying them?  How are they supposed to be taken seriously if you’re actually going to look into what they are saying?  Anyhow, in answer to KC’s question, GK Chesterton and CS Lewis are the two Christian writers I have found most inspiring.",
  "tags": [
    "books",
    "Christianity",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-11T19:20:00+00:00"
}