{
  "url": "https://voxday.net/2013/06/11/a-token-republican-defends-big-brother/",
  "scraped_at": "2025-12-14T22:31:34.971459",
  "title": "A token Republican defends Big Brother",
  "date_display": "June 11, 2013",
  "date_iso": "2013-06-11T15:30:00+00:00",
  "date_from_url": "2013-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Brooks exposes himself as the old statist whore he’s always been in his ludicrous <a href=\"http://www.nytimes.com/2013/06/11/opinion/brooks-the-solitary-leaker.html?hp\">attack on the NSA whistleblower</a> in the New York Times:</p><blockquote class=\"tr_bq\"><p> It’s logical, given this background and mind-set, that Snowden would sacrifice his career to expose data mining procedures of the National Security Agency. Even if he has not been able to point to any specific abuses, he was bound to be horrified by the confidentiality endemic to military and intelligence activities. And, of course, he’s right that the procedures he’s unveiled could lend themselves to abuse in the future.</p><p>But Big Brother is not the only danger facing the country. Another is the rising tide of distrust, the corrosive spread of cynicism, the fraying of the social fabric and the rise of people who are so individualistic in their outlook that they have no real understanding of how to knit others together and look after the common good.</p><p>This is not a danger Snowden is addressing. In fact, he is making everything worse.</p><p>For society to function well, there have to be basic levels of trust and cooperation, a respect for institutions and deference to common procedures. By deciding to unilaterally leak secret N.S.A. documents, Snowden has betrayed all of these things.</p><p>He betrayed honesty and integrity, the foundation of all cooperative activity. He made explicit and implicit oaths to respect the secrecy of the information with which he was entrusted. He betrayed his oaths.</p><p>He betrayed his friends. Anybody who worked with him will be suspect. Young people in positions like that will no longer be trusted with responsibility for fear that they will turn into another Snowden.</p><p>He betrayed his employers. Booz Allen and the C.I.A. took a high-school dropout and offered him positions with lavish salaries. He is violating the honor codes of all those who enabled him to rise.</p><p>He betrayed the cause of open government. Every time there is a leak like this, the powers that be close the circle of trust a little tighter. They limit debate a little more.</p><p>He betrayed the privacy of us all. If federal security agencies can’t do vast data sweeps, they will inevitably revert to the older, more intrusive eavesdropping methods.</p><p>He betrayed the Constitution. The founders did not create the United States so that some solitary 29-year-old could make unilateral decisions about what should be exposed. Snowden self-indulgently short-circuited the democratic structures of accountability, putting his own preferences above everything else.</p></blockquote><p>Edward Snowden isn’t the betrayer.  The betrayers are the Bush administration, the Obama administration, the NSA, and the Congress.  For Brooks to claim, with a straight faith, that it is <i>Snowden </i>who betrayed his oaths and the Constitution, that is is <i>Edward Snowden </i>who “betrayed the privacy of us all” when he exposed the NSA’s lawless domestic spying program, is to tell a far bigger lie than Joseph Goebbels ever told.</p><p>Of course, he’s only following the lead of the Republican’s Chief Executive Oompa-Loompa:</p><p><i>“Speaker John Boehner (R-Ohio) on Tuesday called Edward Snowden, the contractor who leaked details of the National Security Agency’s surveillance programs, a “traitor.” “He’s a traitor,” Boehner said on ABC’s “Good Morning America.” “The disclosure of this information puts Americans at risk.  It shows our adversaries what our capabilities are, and it’s a giant violation of the law.”” </i></p><p>And some of you used to wonder why I have such total contempt for the Republican Party, and why I have always been totally unmoved by the quadrennial “we gots to vote agin’ the Demoncrat” appeals.  Notice that the bi-factional ruling party is quick to drop their superficial differences when a real threat to their regime appears:</p><p><i>On Monday Senate Intelligence Committee Chairwoman Dianne Feinstein<br> (D-Calif.) said Snowden’s leaking of NSA information was treasonous. “I don’t look at this as being a whistle-blower. I think it’s an act of treason,” Feinstein said. </br></i></p></div>",
  "content_text": "David Brooks exposes himself as the old statist whore he’s always been in his ludicrous\nattack on the NSA whistleblower\nin the New York Times:\nIt’s logical, given this background and mind-set, that Snowden would sacrifice his career to expose data mining procedures of the National Security Agency. Even if he has not been able to point to any specific abuses, he was bound to be horrified by the confidentiality endemic to military and intelligence activities. And, of course, he’s right that the procedures he’s unveiled could lend themselves to abuse in the future.\nBut Big Brother is not the only danger facing the country. Another is the rising tide of distrust, the corrosive spread of cynicism, the fraying of the social fabric and the rise of people who are so individualistic in their outlook that they have no real understanding of how to knit others together and look after the common good.\nThis is not a danger Snowden is addressing. In fact, he is making everything worse.\nFor society to function well, there have to be basic levels of trust and cooperation, a respect for institutions and deference to common procedures. By deciding to unilaterally leak secret N.S.A. documents, Snowden has betrayed all of these things.\nHe betrayed honesty and integrity, the foundation of all cooperative activity. He made explicit and implicit oaths to respect the secrecy of the information with which he was entrusted. He betrayed his oaths.\nHe betrayed his friends. Anybody who worked with him will be suspect. Young people in positions like that will no longer be trusted with responsibility for fear that they will turn into another Snowden.\nHe betrayed his employers. Booz Allen and the C.I.A. took a high-school dropout and offered him positions with lavish salaries. He is violating the honor codes of all those who enabled him to rise.\nHe betrayed the cause of open government. Every time there is a leak like this, the powers that be close the circle of trust a little tighter. They limit debate a little more.\nHe betrayed the privacy of us all. If federal security agencies can’t do vast data sweeps, they will inevitably revert to the older, more intrusive eavesdropping methods.\nHe betrayed the Constitution. The founders did not create the United States so that some solitary 29-year-old could make unilateral decisions about what should be exposed. Snowden self-indulgently short-circuited the democratic structures of accountability, putting his own preferences above everything else.\nEdward Snowden isn’t the betrayer.  The betrayers are the Bush administration, the Obama administration, the NSA, and the Congress.  For Brooks to claim, with a straight faith, that it is\nSnowden\nwho betrayed his oaths and the Constitution, that is is\nEdward Snowden\nwho “betrayed the privacy of us all” when he exposed the NSA’s lawless domestic spying program, is to tell a far bigger lie than Joseph Goebbels ever told.\nOf course, he’s only following the lead of the Republican’s Chief Executive Oompa-Loompa:\n“Speaker John Boehner (R-Ohio) on Tuesday called Edward Snowden, the contractor who leaked details of the National Security Agency’s surveillance programs, a “traitor.” “He’s a traitor,” Boehner said on ABC’s “Good Morning America.” “The disclosure of this information puts Americans at risk.  It shows our adversaries what our capabilities are, and it’s a giant violation of the law.””\nAnd some of you used to wonder why I have such total contempt for the Republican Party, and why I have always been totally unmoved by the quadrennial “we gots to vote agin’ the Demoncrat” appeals.  Notice that the bi-factional ruling party is quick to drop their superficial differences when a real threat to their regime appears:\nOn Monday Senate Intelligence Committee Chairwoman Dianne Feinstein\n(D-Calif.) said Snowden’s leaking of NSA information was treasonous. “I don’t look at this as being a whistle-blower. I think it’s an act of treason,” Feinstein said.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2013-06-11T14:30:00+00:00"
}