{
  "url": "https://voxday.net/2013/06/16/anti-racism-and-law-of-unintended/",
  "scraped_at": "2025-12-14T22:32:07.404642",
  "title": "Anti-racism and the Law of Unintended Consequences",
  "date_display": "June 16, 2013",
  "date_iso": "2013-06-16T09:41:00+00:00",
  "date_from_url": "2013-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even Barack Obama appears to be aware that racism is not the credible culprit for the greater challenges facing Africa and Africans today, <a href=\"http://www.telegraph.co.uk/news/worldnews/africaandindianocean/5778804/Barack-Obama-tells-Africa-to-stop-blaming-colonialism-for-problems.html\">according to this 2009 article</a>, which, for some reason, popped up today on The Telegraph’s Most Shared:</p><blockquote class=\"tr_bq\"><p> Ahead of a visit to Ghana at the weekend, he said: “Ultimately, I’m a big believer that Africans are responsible for Africa.</p><p>“I<br> think part of what’s hampered advancement in Africa is that for many<br> years we’ve made excuses about corruption or poor governance, that this<br> was somehow the consequence of neo-colonialism, or the West has been<br> oppressive, or racism – I’m not a big – I’m not a believer in excuses.</br></br></br></br></p><p>Mr<br> Obama, the son of a Kenyan, added: “I’d say I’m probably as<br> knowledgeable about African history as anybody who’s occupied my office.<br> And I can give you chapter and verse on why the colonial maps that were<br> drawn helped to spur on conflict, and the terms of trade that were<br> uneven emerging out of colonialism.</br></br></br></br></br></p><p>“And<br> yet the fact is we’re in 2009,” continued the US president. “The West<br> and the United States has not been responsible for what’s happened to<br> Zimbabwe’s economy over the last 15 or 20 years.</br></br></br></p><p>“It<br> hasn’t been responsible for some of the disastrous policies that we’ve<br> seen elsewhere in Africa. And I think that it’s very important for<br> African leadership to take responsibility and be held accountable.”</br></br></br></p></blockquote><p>This touches on what I’ve written previously concerning the grand transocietal challenges posed by the time-to-civilization hypothesis.  The problem faced by the equalitarian crowd is that due to the civil rights movement in the USA and the independence movement in Africa, whites largely shed what Kipling once described as “the White Man’s Burden” and generally did the best they could to remove themselves from proximity to, and responsibility for, African-Americans and Africans.  In addition to the socially deleterious effects of the US and European welfare systems, this global racial disengagement appears to have largely removed the civilizational restraints that were previously imposed upon the various African communities against their will.</p><p>Moreover, the Caribbean immigration into Britain and the African immigration into the European continent created a situation where millions of Europeans came into contact with Africans for the first time in history.  There are three reasons that Europeans are much more open about the qualitative behavioral differences between Europeans and Africans than white Americans; the first is that there is no legacy of slavery to obscure and excuse the differences or inspire white guilt. The second is that, in Europe, it is almost impossible to not notice the vast difference in the crime rates between the various populations.  The third is that African-Americans are simply less African; nearly all African-Americans are either of Yoruba, Mandenka, Bantu, San, or Blaka descent, and they are on average 22 percent white.</p><p>I talk to two European policemen from time to time at the gym.  Both have told me that, aside from the occasional car crash, they spend all their time dealing with crime committed by Africans.  Not part of it, or most of it, but ALL of it.  I suspect that is a slight exaggeration, but not by much. Even I noticed, for example, that in a very small town where everyone knows everyone and there is virtually no crime, the arrival of a fairly small number of African “refugees” soon resulted in a large number of apartment burglaries and a bomb being used to access the money in an ATM machine.</p><p>Nor are Europeans inclined to tolerate such behavior.  Six months later, I was walking through the center of that town and realized that nearly all of the Africans I’d seen before were gone.  Deported.</p><p>It used to be at least potentially credible to blame racism for black social pathology when whites were, quite literally, systematically oppressing blacks, both in the USA and in Africa.  But the inescapable conclusion, if one looks at a broad measure of social health measures for individuals and communities over the time since African liberation took place, is that with a few exceptions, oppressive paternalism was genuinely in the objective interest of black individuals and communities alike.  I am not saying that it was right, or even justified, for Europeans and White Americans to have engaged in that oppressive paternalism, I’m merely pointing out that it appears to have been effective in terms of rendering those societies more functional, and, more importantly, sustainable in the long term.</p><p>Now, being a libertarian, I do not accept the idea that a cognitive or racial or aristocratic or scientific elite has any right or responsibility to rule over the non-elite, regardless of how disastrously hoi polloi may choose to govern itself.  The fact that post-colonial Nigeria can no longer feed itself and is producing 80 percent less in some agricultural sectors than it was when it became independent in 1960, (when it had 45 million people compared to 170 million now), is not anyone’s problem but Nigeria’s… at least not so long as international borders are maintained and immigration is not permitted.</p><p>The increasingly dangerous Nigerian situation illustrates the large scale human tragedy that is almost certainly bound to take place so long as it is widely believed that the partially civilized are capable of maintaining an advanced civilization on their own.  Not even the most firmly equalitarian individual believes that the mostly savage are capable of doing so; no one is selling nuclear power plants and satellites to <a href=\"http://www.indexmundi.com/energy.aspx?country=pg&amp;product=nuclear&amp;graph=production\">Papua New Guinea</a>.  In such cases, people are content to support intervention in a paternal manner, as they once did in Africa, and to labor to prevent the savages from burning sorcerers, engaging in constant tribal warfare, and <a href=\"http://www.theglobalmail.org/feature/the-last-laughing-death/470/\">eating each other’s brains</a>.  But it is, at the very least, possible that the partially civilized are no more able to maintain advanced technological societies in the medium-to-long term on their own than the uncivilized.  The evidence tends to suggest that this is probably the case although we will not know with any degree of certainty until large scale societal collapses begin to occur.</p><p>I fully understand that what I am observing here flies in the face of more than sixty years of firmly held belief that independence and liberation would cause Africa to flourish, and that desegregation, civil rights, and black empowerment would enable the black community in America to better conform to the behavioral norms of the white community.  But that has not turned out to be the case, and indeed, advances in genetic science has increasingly tended to confirm many of those old 19th century beliefs concerning the importance of seeming superficialities such as cranial capacity and brain size, which are almost surely linked to the observably shorter time preferences that are so reliably disastrous with regards to economic decisions and social behavior alike.</p><p>I hope the reader will understand that I am neither advocating a return to paternalistic oppression nor claiming that one’s humanity is dependent upon one’s place upon the civilizational scale; there are certainly no shortage of whites who are observably post-civilized and whose behavior is increasingly feral in comparison with the behavior of their grandparents 50 years ago.  I am merely, in the same way that I raised concerns about the global financial system in 2002, six years before the crisis, observing that the failure of the equalitarian race model looks to have the potential for considerably more global trauma and human tragedy than was experienced during and after the global financial crisis of 2008.</p><p>I don’t have any solutions for this.  I don’t even have any specific recommendations, other than to immediately stop the mass migrations that will only make it vastly more difficult for the advanced societies to assist the less advanced ones when the crises arise. I’m only beginning to think about these patterns in a manner that might allow me to eventually develop some sort of metric to utilize in the way that I use Z1 credit to track the status of the US economy.</p><p>Most of those who consider themselves to be “anti-racist” will, no doubt, refuse to consider these readily observable facts until their consequences become undeniable.  But just as the “anti-fascists” have been seen to behave <a href=\"http://www.telegraph.co.uk/journalists/andrew-gilligan/10122496/Anti-fascists-fuel-the-fire-of-hate.html\">in a counter-productive and unexpectedly fascist manner</a>, perhaps the smarter “anti-racists” will at least consider entertaining the possibility that they are not, by virtue of their ideological purity, rendered intrinsically immune from the Law of Unintended Consequences.</p></div>",
  "content_text": "Even Barack Obama appears to be aware that racism is not the credible culprit for the greater challenges facing Africa and Africans today,\naccording to this 2009 article\n, which, for some reason, popped up today on The Telegraph’s Most Shared:\nAhead of a visit to Ghana at the weekend, he said: “Ultimately, I’m a big believer that Africans are responsible for Africa.\n“I\nthink part of what’s hampered advancement in Africa is that for many\nyears we’ve made excuses about corruption or poor governance, that this\nwas somehow the consequence of neo-colonialism, or the West has been\noppressive, or racism – I’m not a big – I’m not a believer in excuses.\nMr\nObama, the son of a Kenyan, added: “I’d say I’m probably as\nknowledgeable about African history as anybody who’s occupied my office.\nAnd I can give you chapter and verse on why the colonial maps that were\ndrawn helped to spur on conflict, and the terms of trade that were\nuneven emerging out of colonialism.\n“And\nyet the fact is we’re in 2009,” continued the US president. “The West\nand the United States has not been responsible for what’s happened to\nZimbabwe’s economy over the last 15 or 20 years.\n“It\nhasn’t been responsible for some of the disastrous policies that we’ve\nseen elsewhere in Africa. And I think that it’s very important for\nAfrican leadership to take responsibility and be held accountable.”\nThis touches on what I’ve written previously concerning the grand transocietal challenges posed by the time-to-civilization hypothesis.  The problem faced by the equalitarian crowd is that due to the civil rights movement in the USA and the independence movement in Africa, whites largely shed what Kipling once described as “the White Man’s Burden” and generally did the best they could to remove themselves from proximity to, and responsibility for, African-Americans and Africans.  In addition to the socially deleterious effects of the US and European welfare systems, this global racial disengagement appears to have largely removed the civilizational restraints that were previously imposed upon the various African communities against their will.\nMoreover, the Caribbean immigration into Britain and the African immigration into the European continent created a situation where millions of Europeans came into contact with Africans for the first time in history.  There are three reasons that Europeans are much more open about the qualitative behavioral differences between Europeans and Africans than white Americans; the first is that there is no legacy of slavery to obscure and excuse the differences or inspire white guilt. The second is that, in Europe, it is almost impossible to not notice the vast difference in the crime rates between the various populations.  The third is that African-Americans are simply less African; nearly all African-Americans are either of Yoruba, Mandenka, Bantu, San, or Blaka descent, and they are on average 22 percent white.\nI talk to two European policemen from time to time at the gym.  Both have told me that, aside from the occasional car crash, they spend all their time dealing with crime committed by Africans.  Not part of it, or most of it, but ALL of it.  I suspect that is a slight exaggeration, but not by much. Even I noticed, for example, that in a very small town where everyone knows everyone and there is virtually no crime, the arrival of a fairly small number of African “refugees” soon resulted in a large number of apartment burglaries and a bomb being used to access the money in an ATM machine.\nNor are Europeans inclined to tolerate such behavior.  Six months later, I was walking through the center of that town and realized that nearly all of the Africans I’d seen before were gone.  Deported.\nIt used to be at least potentially credible to blame racism for black social pathology when whites were, quite literally, systematically oppressing blacks, both in the USA and in Africa.  But the inescapable conclusion, if one looks at a broad measure of social health measures for individuals and communities over the time since African liberation took place, is that with a few exceptions, oppressive paternalism was genuinely in the objective interest of black individuals and communities alike.  I am not saying that it was right, or even justified, for Europeans and White Americans to have engaged in that oppressive paternalism, I’m merely pointing out that it appears to have been effective in terms of rendering those societies more functional, and, more importantly, sustainable in the long term.\nNow, being a libertarian, I do not accept the idea that a cognitive or racial or aristocratic or scientific elite has any right or responsibility to rule over the non-elite, regardless of how disastrously hoi polloi may choose to govern itself.  The fact that post-colonial Nigeria can no longer feed itself and is producing 80 percent less in some agricultural sectors than it was when it became independent in 1960, (when it had 45 million people compared to 170 million now), is not anyone’s problem but Nigeria’s… at least not so long as international borders are maintained and immigration is not permitted.\nThe increasingly dangerous Nigerian situation illustrates the large scale human tragedy that is almost certainly bound to take place so long as it is widely believed that the partially civilized are capable of maintaining an advanced civilization on their own.  Not even the most firmly equalitarian individual believes that the mostly savage are capable of doing so; no one is selling nuclear power plants and satellites to\nPapua New Guinea\n.  In such cases, people are content to support intervention in a paternal manner, as they once did in Africa, and to labor to prevent the savages from burning sorcerers, engaging in constant tribal warfare, and\neating each other’s brains\n.  But it is, at the very least, possible that the partially civilized are no more able to maintain advanced technological societies in the medium-to-long term on their own than the uncivilized.  The evidence tends to suggest that this is probably the case although we will not know with any degree of certainty until large scale societal collapses begin to occur.\nI fully understand that what I am observing here flies in the face of more than sixty years of firmly held belief that independence and liberation would cause Africa to flourish, and that desegregation, civil rights, and black empowerment would enable the black community in America to better conform to the behavioral norms of the white community.  But that has not turned out to be the case, and indeed, advances in genetic science has increasingly tended to confirm many of those old 19th century beliefs concerning the importance of seeming superficialities such as cranial capacity and brain size, which are almost surely linked to the observably shorter time preferences that are so reliably disastrous with regards to economic decisions and social behavior alike.\nI hope the reader will understand that I am neither advocating a return to paternalistic oppression nor claiming that one’s humanity is dependent upon one’s place upon the civilizational scale; there are certainly no shortage of whites who are observably post-civilized and whose behavior is increasingly feral in comparison with the behavior of their grandparents 50 years ago.  I am merely, in the same way that I raised concerns about the global financial system in 2002, six years before the crisis, observing that the failure of the equalitarian race model looks to have the potential for considerably more global trauma and human tragedy than was experienced during and after the global financial crisis of 2008.\nI don’t have any solutions for this.  I don’t even have any specific recommendations, other than to immediately stop the mass migrations that will only make it vastly more difficult for the advanced societies to assist the less advanced ones when the crises arise. I’m only beginning to think about these patterns in a manner that might allow me to eventually develop some sort of metric to utilize in the way that I use Z1 credit to track the status of the US economy.\nMost of those who consider themselves to be “anti-racist” will, no doubt, refuse to consider these readily observable facts until their consequences become undeniable.  But just as the “anti-fascists” have been seen to behave\nin a counter-productive and unexpectedly fascist manner\n, perhaps the smarter “anti-racists” will at least consider entertaining the possibility that they are not, by virtue of their ideological purity, rendered intrinsically immune from the Law of Unintended Consequences.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-16T08:41:00+00:00"
}