{
  "url": "https://voxday.net/2013/06/07/belief-in-god-is-good-for-you_7/",
  "scraped_at": "2025-12-14T22:31:04.683170",
  "title": "Belief in God is good for you",
  "date_display": "June 7, 2013",
  "date_iso": "2013-06-07T08:30:00+00:00",
  "date_from_url": "2013-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I pointed out five years ago in TIA, the New Atheist attempt to<br> kick out the supposed crutch of religious faith is not only churlish, <a href=\"http://psychcentral.com/news/2013/04/26/belief-in-god-improves-mental-health-outcomes/54121.html\">it is actively harmful</a> to those individuals who happen to need a crutch in<br> order to walk through life.</br></br></p><blockquote class=\"tr_bq\"><p> A new study<br> suggests belief in God may significantly improve the outcome of those<br> receiving short-term treatment for psychiatric illness. Researchers<br> followed patients receiving care from a hospital-based behavioral health<br> program to investigate the relationship between patients’ level of<br> belief in God, expectations for treatment and actual treatment outcomes.</br></br></br></br></br></p><p>In<br> the study, published in the current issue of Journal of Affective<br> Disorders, researchers comment that people with a moderate to high level<br> of belief in a higher power do significantly better in short-term<br> psychiatric treatment than those without.</br></br></br></br></p><p>“Belief was<br> associated with not only improved psychological well-being, but<br> decreases in depression and intention to self-harm,” says David H.<br> Rosmarin, Ph.D., an instructor in the Department of Psychiatry at<br> Harvard Medical School….</br></br></br></br></p><p>Patients with “no” or only “slight” belief in God were twice as<br> likely not to respond to treatment as patients with higher levels of<br> belief. Investigators believe the study demonstrates that a belief in God is<br> associated with improved treatment outcomes in psychiatric care.</br></br></br></p></blockquote><p>It’s<br> fascinating to see how some atheists believe that Templeton funding<br> renders a study intrinsically unscientific, while blithely citing<br> studies funded by Big Pharma to argue for the safety of<br> government-mandated chemical injections.  All the while ignoring the<br> disproportionate tendency of atheists to kill themselves and others.</br></br></br></br></br></p><p>I<br> suspect it won’t be long before there is additional scientific support<br> for my hypothesis that atheism is a consequence of a mild form of<br> autism.</br></br></br></p></div>",
  "content_text": "As I pointed out five years ago in TIA, the New Atheist attempt to\nkick out the supposed crutch of religious faith is not only churlish,\nit is actively harmful\nto those individuals who happen to need a crutch in\norder to walk through life.\nA new study\nsuggests belief in God may significantly improve the outcome of those\nreceiving short-term treatment for psychiatric illness. Researchers\nfollowed patients receiving care from a hospital-based behavioral health\nprogram to investigate the relationship between patients’ level of\nbelief in God, expectations for treatment and actual treatment outcomes.\nIn\nthe study, published in the current issue of Journal of Affective\nDisorders, researchers comment that people with a moderate to high level\nof belief in a higher power do significantly better in short-term\npsychiatric treatment than those without.\n“Belief was\nassociated with not only improved psychological well-being, but\ndecreases in depression and intention to self-harm,” says David H.\nRosmarin, Ph.D., an instructor in the Department of Psychiatry at\nHarvard Medical School….\nPatients with “no” or only “slight” belief in God were twice as\nlikely not to respond to treatment as patients with higher levels of\nbelief. Investigators believe the study demonstrates that a belief in God is\nassociated with improved treatment outcomes in psychiatric care.\nIt’s\nfascinating to see how some atheists believe that Templeton funding\nrenders a study intrinsically unscientific, while blithely citing\nstudies funded by Big Pharma to argue for the safety of\ngovernment-mandated chemical injections.  All the while ignoring the\ndisproportionate tendency of atheists to kill themselves and others.\nI\nsuspect it won’t be long before there is additional scientific support\nfor my hypothesis that atheism is a consequence of a mild form of\nautism.",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-07T07:30:00+00:00"
}