{
  "url": "https://voxday.net/2013/06/12/bishop-vs-boomers/",
  "scraped_at": "2025-12-14T22:31:40.639894",
  "title": "Bishop vs Boomers",
  "date_display": "June 12, 2013",
  "date_iso": "2013-06-12T12:00:00+00:00",
  "date_from_url": "2013-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even the myopic Church of England is able to recognize <a href=\"http://www.telegraph.co.uk/news/religion/10113694/Take-less-bishop-tells-baby-boomers.html\">the great generational black hole</a>, if a little belatedly:</p><blockquote class=\"tr_bq\"><div class=\"firstPar\"> Baby boomers are a “fortunate generation” who have enjoyed dramatic<br> improvements in living standards but are now “absorbing” more than their<br> fair share of taxpayers’ money, one of the Church of England’s most senior<br> clerics has suggested.</br></br></br></div><div class=\"secondPar\"> <br> The Bishop of London, the Rt Rev Richard Chartres, who is 65, said there were<br> “severe questions” about the share of government spending that goes on his<br> own generation. He said the world was in the midst of a transformation that had left many<br> believing that our best days could be “behind us”. He likened the early years of the 21st century, which he said have seen a<br> dramatic shift in the global balance of power, to the unstable period in the<br> run-up to the First World War.</br></br></br></br></br></br></div><p> Figures published by the Organisation for Economic Cooperation and Development<br> last year showed that while elderly people make up about 15 per cent of the<br> population in the leading economies, they account for 40 per cent of all<br> public social spending.</br></br></br></p></blockquote><p>It’s long past time to cut the Boomers off.  They changed the world, now let them live with the consequences.  Why should we put our children and our grandchildren in debt simply to allow Boomers to continue living well beyond their collective means?</p><p>The responsible minority among the Boomers will be fine.  Those who weren’t possessed by the zeitgeist of the Grasshopper Generation have sufficient resources upon which to retire and live comfortably.  I have no problem with them. But I also see no reason to sacrifice the well-being of future generations to the always-gaping, never-satisfied maw of the great majority of Boomers.</p></div>",
  "content_text": "Even the myopic Church of England is able to recognize\nthe great generational black hole\n, if a little belatedly:\nBaby boomers are a “fortunate generation” who have enjoyed dramatic\nimprovements in living standards but are now “absorbing” more than their\nfair share of taxpayers’ money, one of the Church of England’s most senior\nclerics has suggested.\nThe Bishop of London, the Rt Rev Richard Chartres, who is 65, said there were\n“severe questions” about the share of government spending that goes on his\nown generation. He said the world was in the midst of a transformation that had left many\nbelieving that our best days could be “behind us”. He likened the early years of the 21st century, which he said have seen a\ndramatic shift in the global balance of power, to the unstable period in the\nrun-up to the First World War.\nFigures published by the Organisation for Economic Cooperation and Development\nlast year showed that while elderly people make up about 15 per cent of the\npopulation in the leading economies, they account for 40 per cent of all\npublic social spending.\nIt’s long past time to cut the Boomers off.  They changed the world, now let them live with the consequences.  Why should we put our children and our grandchildren in debt simply to allow Boomers to continue living well beyond their collective means?\nThe responsible minority among the Boomers will be fine.  Those who weren’t possessed by the zeitgeist of the Grasshopper Generation have sufficient resources upon which to retire and live comfortably.  I have no problem with them. But I also see no reason to sacrifice the well-being of future generations to the always-gaping, never-satisfied maw of the great majority of Boomers.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2013-06-12T11:00:00+00:00"
}