{
  "url": "https://voxday.net/2013/06/28/blood-on-their-green-hands/",
  "scraped_at": "2025-12-14T22:33:29.603483",
  "title": "Blood on their green hands",
  "date_display": "June 28, 2013",
  "date_iso": "2013-06-28T06:00:00+00:00",
  "date_from_url": "2013-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whether it is God or the Devil, someone clearly has <a href=\"http://www.telegraph.co.uk/earth/environment/10146081/Twitchers-flocking-to-see-rare-bird-saw-it-killed-by-wind-turbine.html\">a wicked sense of humor</a>:</p><blockquote class=\"tr_bq\"><p> The White-throated Needletail – the world’s fastest flying bird – was<br> thousands of miles off course after turning up at Tarbert on the Isle of<br> Harris. It was first seen by two bird spotters from Northumberland on Monday.  There has not been a sighting of the species in Britain since 1991 when a<br> single bird was seen four times – in Kent, Staffordshire, Derbyshire and<br> finally Shetland.</br></br></br></br></p><p>Now 22 years later another White-throated Needletail turned up in the UK, but after<br> more than 80 twitchers flocked to Harris – with scores more on their way –<br> the bird flew into a wind turbine at Tarbert, witnessed by around 40 people….</br></br></p><p>“It is tragic. More than 80 people had already arrived on the island and<br> others were coming from all over the country. But it just flew into the<br> turbine. It was killed instantly. The corpse will be sent to a museum but obviously this is just<br> terrible.”</br></br></br></p></blockquote><p>I can see where he’s coming from, but sometimes, one man’s tragedy is another man’s chuckle.</p></div>",
  "content_text": "Whether it is God or the Devil, someone clearly has\na wicked sense of humor\n:\nThe White-throated Needletail – the world’s fastest flying bird – was\nthousands of miles off course after turning up at Tarbert on the Isle of\nHarris. It was first seen by two bird spotters from Northumberland on Monday.  There has not been a sighting of the species in Britain since 1991 when a\nsingle bird was seen four times – in Kent, Staffordshire, Derbyshire and\nfinally Shetland.\nNow 22 years later another White-throated Needletail turned up in the UK, but after\nmore than 80 twitchers flocked to Harris – with scores more on their way –\nthe bird flew into a wind turbine at Tarbert, witnessed by around 40 people….\n“It is tragic. More than 80 people had already arrived on the island and\nothers were coming from all over the country. But it just flew into the\nturbine. It was killed instantly. The corpse will be sent to a museum but obviously this is just\nterrible.”\nI can see where he’s coming from, but sometimes, one man’s tragedy is another man’s chuckle.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-28T05:00:00+00:00"
}