{
  "url": "https://voxday.net/2013/06/12/book-review-hailstone-mountain/",
  "scraped_at": "2025-12-14T22:31:38.754944",
  "title": "Book Review: Hailstone Mountain",
  "date_display": "June 12, 2013",
  "date_iso": "2013-06-12T09:49:00+00:00",
  "date_from_url": "2013-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><i><a href=\"http://www.amazon.com/Hailstone-Mountain-Erling-Skjalgsson-ebook/dp/B00BU3WK1S/ref=sr_1_1?ie=UTF8&amp;qid=1371025678&amp;sr=8-1&amp;keywords=hailstone+mountain\">HAILSTONE MOUNTAIN</a></i><br>Lars Walker<br>Rating: 7 of 10<br> </br></br></br></b></p><p><i>Hailstone Mountain</i> is three-quarters historical fiction, one-quarter fantasy. It is the tale of Father Ailill, an Irish priest who is the good friend of the heroic figure in Walker’s ongoing saga, Erling Skjalgsson. Although it is not the first book in the series, it stands alone very well; as it happens, it is the first book of Walker’s that I have read.</p><p>Walker’s genre is an unusual one and could almost be described as historical magical realism, as it reflects the largely pagan worldview and beliefs of 12th century Scandinavia. Agricultural Fantasy, if you will.  It is a realistic, if slightly sanitized, portrayal of a brutal, uncompromising culture in which life is tenuous, unspeakable dangers lurk nearby, and the tenets of Christianity are just beginning to penetrate.  Walker clearly knows the world of the Viking very well and he introduces the reader to it with the ease of an expert.</p><p>The book is rather slow going at first.  A certain amount of discipline is required to get through the occasionally modern internal dialogue and a plot that is not immediately compelling.  The dialogue is at times stilted, the characters sometimes appear to be walking through the steps of a choreographed plot, and the some of the Christian elements feel a little forced.  One can see what Walker is seeking to do, but the execution is not always entirely adroit. There was even a moment at which I put the book aside in favor of Joe Abercrombie’s latest novel.</p><p>However, I was pleased to discover that the book picks up considerably following a brief and unconvincing descent into thralldom and despair, and I was downright surprised to learn that as it continued, <i>Hailstone Mountain</i> didn’t suffer much by the comparison with <i>Red Country</i>. Not only does the quest go into strange and unexpected directions that appear to be based on genuine Nordic legends, but Walker unexpectedly finds his literary stride, building up to a scene of genuine power and emotional resonance under the titular mountain. Many authors have mined various aspects of religion to imbue their tales with significance, but I have seldom, if ever, seen an author more effectively utilize the aspect of Christian hope, as opposed to faith, sacrifice, love, or redemption, than Walker does in <i>Hailstone Mountain</i>.</p><p>Having done that and apparently concluded the tale, Walker then throws the reader a serious curve ball with the denouement, which is every bit as violent, ruthless, and abrupt as the historical sagas by which the novel is palpably inspired.  It is an unexpected reminder that the savage world of the Viking is not a place for Hollywood-style happy endings, but rather, a world in which the struggle always continues and the wolf is always just outside the door.</p><p><b>Story:</b> 3 of 5. <i>Hailstone Mountain</i> is a quest.  More to the point, it’s a saga, readily identifiable to anyone sufficiently familiar with historical Viking literature as a modernized version of the classic sagas such as Arrow-Odd, Njall, and Halfdan Eysteinsson.  And as such, it is abrupt and merciless in a manner similar to those sagas, in which a happy ending often means that the hero died well. The book also features some of the creepiest villains one will ever encounter in fiction, although upon reflection I suppose it should come as no surprise that the much-feared Vikings would have managed to produce such ghastly boogeymen.</p><p><b>Style:</b> 3 of 5.  It does clunk a bit in places, mostly when the author is going for pathos and overdoes it a little.  But, for the most part, it is sufficient for the purpose, by which I mean it advances the story without getting in the way.  Moreover, the style is fitting for the saga storyline.</p><p><b>Characters:</b> 3.5 of 5.  The characters were distinct and credible.  I did find the Irish priest’s internal monologue to be a bit overly dramatic and I think one bad guy would have been considerably more compelling if there had been more positive aspects to his character to balance the negative ones.  Walker also does a competent job of showing the reader some of the cultural constraints upon the characters through their interactions with each other.</p><p><b>Creativity:</b> 4 of 5. Based on it is on a history with which most readers are much less familiar than they tend to think, <i>Hailstone Mountain</i> is considerably more creative than the average fantasy novel.  I liked how Walker mimicked the way in which saga plots tend to advance and turn abruptly, without much in the way of warning.  It’s a fascinating blend of old and new, and will be a pleasure for anyone tired of the formulaic plots and predictable characters that presently infest so much of modern fantasy.  Jonathan Moeller has remarked how epublishing has broadened the scope of fantasy fiction, and <i>Hailstone Mountain</i> is an excellent example of this phenomenon.</p><p><b>Text sample:  </b><i>At breakfast Jarl Svein told us what he needed.<br>“My people are being raided,” he said. “Men clad in furs, barbered like thralls and armed with clubs, attack farms in the night and steal the folk away. We’ve captured some of these raiders, ones who were wounded and dying, and they told us they’d been sent by their masters, who need more thralls. We try to track them, but lose their trails in the mountains. The folk are afraid. They blame me for not protecting them. They say… they say that if Erik were here he’d stop it.” He spoke the last words with some bitterness.<br>“Why do you ask my help?” Erling replied. “You’re lord in the north. You’ve easily the strength of men and the wealth I have.”<br>“I want neither your strength of men nor your wealth,” said Svein. “I want you present with me-you and Father Ailill.”<br>“Why?”<br>“Because there’s no one in the north-perhaps in the world-with the practice in fighting the forces of the Other World Erling and his priest have. Everyone knows this. They sing of it in the halls, on winter nights.”<br>Oh jubilation, I thought. More of the Other World.<br>“I know not if I can help you,” said Erling. “In spite of all you’ve done for me, I remain Olaf’s kinsman. It would take a very great need to bring me to your side.”<br>“Listen then,” said the jarl. “There is evil in the north.”<br>He paused for the question that had to be asked.<br>“What sort of evil?” asked Sigrid, who had little Asbjorn at her breast.<br>“Have you heard,” he asked, “of the Children of the Mountain?”<br>We all traded looks, and said we had not.<br>“The Children of the Mountain are a clan of witches and warlocks who live under Hailstone Mountain, in Halogaland. They are said to live forever.”<br>“What?” I asked.<br>“It’s said they eat their children. All their children. Because you only need children if you look to die, so that your line will live on. If you mean never to die, you can use the children for other things.”<br>“They live forever by eating their children,” I said.<br>Jarl Svein stared at me. “You’ve heard of this?”<br>“When we came north we came with a man called Lemming, a freedman of Erling’s,” I said. “He came along to seek his niece who, it would seem, was of this witch-clan, on her mother’s side. The girl disappeared. Lemming knew straight away what had happened to her. Her kin had taken her. He seeks her now, in the north country, to find her and bring her out before the time of the ceremony.”<br>“When they eat the children,” said Svein.<br>“Yes. On Winter Night.”<br>“Winter Night. That is the time indeed.” He turned to look at Erling. “I set out to hunt the Mountain’s Children because they raid my folk. You came on this errand to fight the same enemy. The case is not that you would join my adventure. I would join yours. May I join you? May I walk by your side a little while, in this business that touches us both? Would that betray your wife’s brother’s blood?”<br>“When I throw into the scales the fact that you rescued us from so great a dishonor,” said Erling, “there can be but one answer. We shall sail together.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></i><i>”</i></p></div>",
  "content_text": "HAILSTONE MOUNTAIN\nLars Walker\nRating: 7 of 10\nHailstone Mountain\nis three-quarters historical fiction, one-quarter fantasy. It is the tale of Father Ailill, an Irish priest who is the good friend of the heroic figure in Walker’s ongoing saga, Erling Skjalgsson. Although it is not the first book in the series, it stands alone very well; as it happens, it is the first book of Walker’s that I have read.\nWalker’s genre is an unusual one and could almost be described as historical magical realism, as it reflects the largely pagan worldview and beliefs of 12th century Scandinavia. Agricultural Fantasy, if you will.  It is a realistic, if slightly sanitized, portrayal of a brutal, uncompromising culture in which life is tenuous, unspeakable dangers lurk nearby, and the tenets of Christianity are just beginning to penetrate.  Walker clearly knows the world of the Viking very well and he introduces the reader to it with the ease of an expert.\nThe book is rather slow going at first.  A certain amount of discipline is required to get through the occasionally modern internal dialogue and a plot that is not immediately compelling.  The dialogue is at times stilted, the characters sometimes appear to be walking through the steps of a choreographed plot, and the some of the Christian elements feel a little forced.  One can see what Walker is seeking to do, but the execution is not always entirely adroit. There was even a moment at which I put the book aside in favor of Joe Abercrombie’s latest novel.\nHowever, I was pleased to discover that the book picks up considerably following a brief and unconvincing descent into thralldom and despair, and I was downright surprised to learn that as it continued,\nHailstone Mountain\ndidn’t suffer much by the comparison with\nRed Country\n. Not only does the quest go into strange and unexpected directions that appear to be based on genuine Nordic legends, but Walker unexpectedly finds his literary stride, building up to a scene of genuine power and emotional resonance under the titular mountain. Many authors have mined various aspects of religion to imbue their tales with significance, but I have seldom, if ever, seen an author more effectively utilize the aspect of Christian hope, as opposed to faith, sacrifice, love, or redemption, than Walker does in\nHailstone Mountain\n.\nHaving done that and apparently concluded the tale, Walker then throws the reader a serious curve ball with the denouement, which is every bit as violent, ruthless, and abrupt as the historical sagas by which the novel is palpably inspired.  It is an unexpected reminder that the savage world of the Viking is not a place for Hollywood-style happy endings, but rather, a world in which the struggle always continues and the wolf is always just outside the door.\nStory:\n3 of 5.\nHailstone Mountain\nis a quest.  More to the point, it’s a saga, readily identifiable to anyone sufficiently familiar with historical Viking literature as a modernized version of the classic sagas such as Arrow-Odd, Njall, and Halfdan Eysteinsson.  And as such, it is abrupt and merciless in a manner similar to those sagas, in which a happy ending often means that the hero died well. The book also features some of the creepiest villains one will ever encounter in fiction, although upon reflection I suppose it should come as no surprise that the much-feared Vikings would have managed to produce such ghastly boogeymen.\nStyle:\n3 of 5.  It does clunk a bit in places, mostly when the author is going for pathos and overdoes it a little.  But, for the most part, it is sufficient for the purpose, by which I mean it advances the story without getting in the way.  Moreover, the style is fitting for the saga storyline.\nCharacters:\n3.5 of 5.  The characters were distinct and credible.  I did find the Irish priest’s internal monologue to be a bit overly dramatic and I think one bad guy would have been considerably more compelling if there had been more positive aspects to his character to balance the negative ones.  Walker also does a competent job of showing the reader some of the cultural constraints upon the characters through their interactions with each other.\nCreativity:\n4 of 5. Based on it is on a history with which most readers are much less familiar than they tend to think,\nHailstone Mountain\nis considerably more creative than the average fantasy novel.  I liked how Walker mimicked the way in which saga plots tend to advance and turn abruptly, without much in the way of warning.  It’s a fascinating blend of old and new, and will be a pleasure for anyone tired of the formulaic plots and predictable characters that presently infest so much of modern fantasy.  Jonathan Moeller has remarked how epublishing has broadened the scope of fantasy fiction, and\nHailstone Mountain\nis an excellent example of this phenomenon.\nText sample:\nAt breakfast Jarl Svein told us what he needed.\n“My people are being raided,” he said. “Men clad in furs, barbered like thralls and armed with clubs, attack farms in the night and steal the folk away. We’ve captured some of these raiders, ones who were wounded and dying, and they told us they’d been sent by their masters, who need more thralls. We try to track them, but lose their trails in the mountains. The folk are afraid. They blame me for not protecting them. They say… they say that if Erik were here he’d stop it.” He spoke the last words with some bitterness.\n“Why do you ask my help?” Erling replied. “You’re lord in the north. You’ve easily the strength of men and the wealth I have.”\n“I want neither your strength of men nor your wealth,” said Svein. “I want you present with me-you and Father Ailill.”\n“Why?”\n“Because there’s no one in the north-perhaps in the world-with the practice in fighting the forces of the Other World Erling and his priest have. Everyone knows this. They sing of it in the halls, on winter nights.”\nOh jubilation, I thought. More of the Other World.\n“I know not if I can help you,” said Erling. “In spite of all you’ve done for me, I remain Olaf’s kinsman. It would take a very great need to bring me to your side.”\n“Listen then,” said the jarl. “There is evil in the north.”\nHe paused for the question that had to be asked.\n“What sort of evil?” asked Sigrid, who had little Asbjorn at her breast.\n“Have you heard,” he asked, “of the Children of the Mountain?”\nWe all traded looks, and said we had not.\n“The Children of the Mountain are a clan of witches and warlocks who live under Hailstone Mountain, in Halogaland. They are said to live forever.”\n“What?” I asked.\n“It’s said they eat their children. All their children. Because you only need children if you look to die, so that your line will live on. If you mean never to die, you can use the children for other things.”\n“They live forever by eating their children,” I said.\nJarl Svein stared at me. “You’ve heard of this?”\n“When we came north we came with a man called Lemming, a freedman of Erling’s,” I said. “He came along to seek his niece who, it would seem, was of this witch-clan, on her mother’s side. The girl disappeared. Lemming knew straight away what had happened to her. Her kin had taken her. He seeks her now, in the north country, to find her and bring her out before the time of the ceremony.”\n“When they eat the children,” said Svein.\n“Yes. On Winter Night.”\n“Winter Night. That is the time indeed.” He turned to look at Erling. “I set out to hunt the Mountain’s Children because they raid my folk. You came on this errand to fight the same enemy. The case is not that you would join my adventure. I would join yours. May I join you? May I walk by your side a little while, in this business that touches us both? Would that betray your wife’s brother’s blood?”\n“When I throw into the scales the fact that you rescued us from so great a dishonor,” said Erling, “there can be but one answer. We shall sail together.\n”",
  "tags": [
    "books",
    "Standout Authors"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-12T08:49:00+00:00"
}