{
  "url": "https://voxday.net/2013/06/04/boomer-suicide/",
  "scraped_at": "2025-12-14T22:30:48.504408",
  "title": "Boomer Suicide",
  "date_display": "June 4, 2013",
  "date_iso": "2013-06-04T17:00:00+00:00",
  "date_from_url": "2013-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reading <a href=\"http://www.washingtonpost.com/local/baby-boomers-are-killing-themselves-at-an-alarming-rate-begging-question-why/2013/06/03/d98acc7a-c41f-11e2-8c3b-0b5e9247e8ca_story.html\">this Washington Post headline</a> just makes this Generation Xer feel like bursting into song:<br>  Boomer suicide (Just do it)<br>Boomer suicide, (they blew it)Boomer suicide (we knew it)Boomer suicide (yeah, do it)  Age and arrogance don’t mix <br>Your generation’s so over<br>We’ll read your last statement from your credit cardLife was so easy but you made it so hard<br>Feel the power of revenge Your children parked you all alone<br>Your future’s dark and your bills are biggerPut the gun in your mouth and we’ll pull the damn trigger<br> Boomer suicide (dumb fuckers)Boomer suicide (thumbsuckers)Boomer suicide (old bastards)Boomer suicide (die faster)  <i>“Baby boomers are killing themselves at an alarming rate, raising question: Why?  He is part of an alarming trend among baby boomers, whose suicide rates shot up precipitously between 1999 and 2010.” </i> Why?  The journalist obviously is not an American of Generation X. The generation that has had to put up with the vagaries of the Baby Boomers for literally its entire existence knows very well why they are killing themselves at an unusually high rate. It is because Baby Boomers are disproportionately inclined to be narcissistic, selfish, short-sighted, superficial bastards who don’t give a damn about anything except themselves, and they are psychologically incapable of grasping the basic concepts of mortality or graceful old age. <br> <i>““We’ve been a pretty youth-oriented generation,” said Bob Knight,<br> professor of gerontology and psychology at the University of Southern<br> California, who is also a baby boomer. “We haven’t idealized growing up<br> and getting mature in the same way that other cohorts have.”  Even<br> as they become grandparents and deal with normal signs of getting old,<br> such as hearing and vision losses, many boomers are reluctant to accept<br> the realities of aging, Knight said.”</br></br></br></br></br></br></i><br>   You don’t say…. The realization that 65 is not, in fact, the new 18, and they really and truly are not cool anymore, is simply proving too much for them to bear.</br></br></br></br></br></br></br></br></br></p><p>Now, I wouldn’t want anyone to think Generation X is actually inclined to celebrate these rampant Boomer suicides.  It doesn’t fill us with glee to know they are offing themselves en masse, merely a modicum of appreciation for the first positive and non-selfish consequences their generation’s actions have ever produced.  Say what you will about them, but at least they are saving us an amount of effort.</p></div>",
  "content_text": "Reading\nthis Washington Post headline\njust makes this Generation Xer feel like bursting into song:\nBoomer suicide (Just do it)\nBoomer suicide, (they blew it)Boomer suicide (we knew it)Boomer suicide (yeah, do it)  Age and arrogance don’t mix\nYour generation’s so over\nWe’ll read your last statement from your credit cardLife was so easy but you made it so hard\nFeel the power of revenge Your children parked you all alone\nYour future’s dark and your bills are biggerPut the gun in your mouth and we’ll pull the damn trigger\nBoomer suicide (dumb fuckers)Boomer suicide (thumbsuckers)Boomer suicide (old bastards)Boomer suicide (die faster)\n“Baby boomers are killing themselves at an alarming rate, raising question: Why?  He is part of an alarming trend among baby boomers, whose suicide rates shot up precipitously between 1999 and 2010.”\nWhy?  The journalist obviously is not an American of Generation X. The generation that has had to put up with the vagaries of the Baby Boomers for literally its entire existence knows very well why they are killing themselves at an unusually high rate. It is because Baby Boomers are disproportionately inclined to be narcissistic, selfish, short-sighted, superficial bastards who don’t give a damn about anything except themselves, and they are psychologically incapable of grasping the basic concepts of mortality or graceful old age.\n““We’ve been a pretty youth-oriented generation,” said Bob Knight,\nprofessor of gerontology and psychology at the University of Southern\nCalifornia, who is also a baby boomer. “We haven’t idealized growing up\nand getting mature in the same way that other cohorts have.”  Even\nas they become grandparents and deal with normal signs of getting old,\nsuch as hearing and vision losses, many boomers are reluctant to accept\nthe realities of aging, Knight said.”\nYou don’t say…. The realization that 65 is not, in fact, the new 18, and they really and truly are not cool anymore, is simply proving too much for them to bear.\nNow, I wouldn’t want anyone to think Generation X is actually inclined to celebrate these rampant Boomer suicides.  It doesn’t fill us with glee to know they are offing themselves en masse, merely a modicum of appreciation for the first positive and non-selfish consequences their generation’s actions have ever produced.  Say what you will about them, but at least they are saving us an amount of effort.",
  "tags": [
    "Americana",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-04T16:00:00+00:00"
}