{
  "url": "https://voxday.net/2013/06/24/conservatives-are-still-stupid/",
  "scraped_at": "2025-12-14T22:33:02.686459",
  "title": "Conservatives are still stupid",
  "date_display": "June 24, 2013",
  "date_iso": "2013-06-24T07:47:00+00:00",
  "date_from_url": "2013-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Hawkins took a poll of right-wing bloggers concerning the immigration bill. They mostly had enough sense to oppose it, but this was the pair of questions that revealed <a href=\"http://www.rightwingnews.com/bloggers-select/poll-results-conservative-bloggers-on-the-immigration-bill-being-voted-on-the-senate-this-week/\">the irrational position of conservatives</a> on immigration:</p><blockquote class=\"tr_bq\"><p> <b>6) On the whole, which of these sentiments best describes your thoughts about illegal aliens?</b><br> B) They make America a worse place to live? 88.6% (31 votes)<br> A) They make America a better place to live? 11.4% (4 votes)</br></br></p><p><b>7) On the whole, which of these sentiments best describes your thoughts about legal immigrants?</b><br> A) They make America a better place to live? 88.6% (31 votes)<br> B) They make America a worse place to live? 11.4% (4 votes)</br></br></p></blockquote><p>Most conservatives genuinely believe that the legality of an action determines the qualitative nature of it.  This is why they so often blithely support whatever evils that the previous generation of progressives have managed to slip past previous conservatives.</p><p>It doesn’t matter if 100 million Nigerians and 300 million Chinese enter the country legally or illegally next year, they will substantially change what America is by virtue of their entry.  The legality or illegality of that entry will have no effect whatsoever on the impact they will have over time on American society.</p><p>For all their supposed reverence for the Founding Fathers, conservatives have forgotten their wisdom on these matters:</p><p>“<i>The opinion advanced in the<br> Notes on Virginia [by Thomas Jefferson] is undoubtedly correct, that foreigners will<br> generally be apt to bring with them attachments to the persons they have<br> left behind; to the country of their nativity; and to its particular<br> customs and manners. They will also entertain opinions on government<br> congenial with those under which they have lived; or if they should be<br> led hither from a preference to ours, how extremely unlikely is it that<br> they will bring with them that temperate love of liberty, so essential<br> to real republicanism?”</br></br></br></br></br></br></br></br></i></p></div>",
  "content_text": "John Hawkins took a poll of right-wing bloggers concerning the immigration bill. They mostly had enough sense to oppose it, but this was the pair of questions that revealed\nthe irrational position of conservatives\non immigration:\n6) On the whole, which of these sentiments best describes your thoughts about illegal aliens?\nB) They make America a worse place to live? 88.6% (31 votes)\nA) They make America a better place to live? 11.4% (4 votes)\n7) On the whole, which of these sentiments best describes your thoughts about legal immigrants?\nA) They make America a better place to live? 88.6% (31 votes)\nB) They make America a worse place to live? 11.4% (4 votes)\nMost conservatives genuinely believe that the legality of an action determines the qualitative nature of it.  This is why they so often blithely support whatever evils that the previous generation of progressives have managed to slip past previous conservatives.\nIt doesn’t matter if 100 million Nigerians and 300 million Chinese enter the country legally or illegally next year, they will substantially change what America is by virtue of their entry.  The legality or illegality of that entry will have no effect whatsoever on the impact they will have over time on American society.\nFor all their supposed reverence for the Founding Fathers, conservatives have forgotten their wisdom on these matters:\n“\nThe opinion advanced in the\nNotes on Virginia [by Thomas Jefferson] is undoubtedly correct, that foreigners will\ngenerally be apt to bring with them attachments to the persons they have\nleft behind; to the country of their nativity; and to its particular\ncustoms and manners. They will also entertain opinions on government\ncongenial with those under which they have lived; or if they should be\nled hither from a preference to ours, how extremely unlikely is it that\nthey will bring with them that temperate love of liberty, so essential\nto real republicanism?”",
  "tags": [
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-24T06:47:00+00:00"
}