{
  "url": "https://voxday.net/2013/06/30/datagate-goes-internationa/",
  "scraped_at": "2025-12-14T22:33:42.954005",
  "title": "Datagate goes international",
  "date_display": "June 30, 2013",
  "date_iso": "2013-06-30T10:02:00+00:00",
  "date_from_url": "2013-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was catching up on the Italian news this morning and saw that <a href=\"http://www.repubblica.it/esteri/2013/06/29/news/snowden_der_spiegel_spiati_diplomatici_ue_in_usa_e_a_onu-62097355/?ref=HREA-1\">Datagate </a>is what the Italian press is calling the explosive new revelations that the NSA has secret agreements with European countries to spy on European citizens as well. The news is not quite so readily available in English, although Prachi Gupta’s <a href=\"http://www.salon.com/2013/06/29/nsa_reportedly_has_secret_data_collection_agreement_with_several_european_countries/\">article at Salon is still accessible</a>:</p><blockquote class=\"tr_bq\"><p> The<br> NSA has been working with at least seven European other countries to<br> collect personal communications data, according to Wayne Madsen, a<br> former NSA contractor who has come forward because he does not think the<br> public should not be “kept in the dark.” According to Madsen, Denmark,<br> the Netherlands, France, Germany, Spain and Italy all have formed secret<br> agreements with the US to submit sensitive data.</br></br></br></br></br></br></p><p>The <a href=\"http://www.guardian.co.uk/world/2013/jun/29/european-private-data-america\">Guardian</a> reports:</p><p><i>Under<br> international intelligence agreements, confirmed by declassified<br> documents, nations are categorised by the US according to their trust<br> level. The US is first party while the UK, Canada, Australia and New<br> Zealand enjoy second party relationships. Germany and France have third<br> party relationships.</br></br></br></br></br></i></p><p><i>In an interview published last night on the <a href=\"http://www.privacysurgeon.org/blog/incision/former-nsa-contractor-warns-of-murky-interception-arrangements/\">PrivacySurgeon.org blog</a>,<br> Madsen, who has been attacked for holding controversial views on<br> espionage issues, said he had decided to speak out after becoming<br> concerned about the “half story” told by EU politicians regarding the<br> extent of the NSA’s activities in Europe.</br></br></br></br></i></p><p><i>He said that under the<br> agreements, which were drawn up after the second world war, the “NSA<br> gets the lion’s share” of the sigint “take”. In return, the third<br> parties to the NSA agreements received “highly sanitised intelligence”.</br></br></br></i></p><p>The<br> news could be potentially damaging to countries, particularly Germany,<br> whose chancellor Angela Merkel has vocally condemned the NSA program<br> that recently came to light by whistleblower Edward Snowden.</br></br></br></p></blockquote><div class=\"articleContent\"> This sounds like Echelon on steroids, dwarfing anything Orwell imagined in Big Brother. Moreover, as La Repubblica reports, the Observer article has already been removed from the web “pending an investigation: <p><i>“Datagate, anche l’Italia collabora” </i><br> <i>Poi il Guardian rimuove la pagina web<br>Il Telegraph: <a href=\"http://www.repubblica.it/esteri/2013/06/30/news/datagate_guardian_rimuove_pagina-62119614/\">quella fonte è inaffidabile</a><br>Foto <a href=\"http://www.repubblica.it/esteri/2013/06/30/foto/datagate_l_articolo_cancellato_sull_italia_finisce_sulla_prima_pagina_dell_observer-62120359/1/\">Ma l’articolo è comunque finito in edicola</a></br></br></i></br></p><p>“Datagate, Italy also collaborates”<br> Afterwards the Guardian removes the web page<br> The Telegraph[sic]: that source is not found<br> Photo But the article is nevertheless still on the newspaper stand</br></br></br></p><p>Note that La Repubblica mistakenly refers to The Telegraph when the link actually refers to The Guardian.  These revelations should give a massive boost to the growing anti-Merkel forces in Germany, as it reveals her to be a shameless and bald-faced liar.</p></div></div>",
  "content_text": "I was catching up on the Italian news this morning and saw that\nDatagate\nis what the Italian press is calling the explosive new revelations that the NSA has secret agreements with European countries to spy on European citizens as well. The news is not quite so readily available in English, although Prachi Gupta’s\narticle at Salon is still accessible\n:\nThe\nNSA has been working with at least seven European other countries to\ncollect personal communications data, according to Wayne Madsen, a\nformer NSA contractor who has come forward because he does not think the\npublic should not be “kept in the dark.” According to Madsen, Denmark,\nthe Netherlands, France, Germany, Spain and Italy all have formed secret\nagreements with the US to submit sensitive data.\nThe\nGuardian\nreports:\nUnder\ninternational intelligence agreements, confirmed by declassified\ndocuments, nations are categorised by the US according to their trust\nlevel. The US is first party while the UK, Canada, Australia and New\nZealand enjoy second party relationships. Germany and France have third\nparty relationships.\nIn an interview published last night on the\nPrivacySurgeon.org blog\n,\nMadsen, who has been attacked for holding controversial views on\nespionage issues, said he had decided to speak out after becoming\nconcerned about the “half story” told by EU politicians regarding the\nextent of the NSA’s activities in Europe.\nHe said that under the\nagreements, which were drawn up after the second world war, the “NSA\ngets the lion’s share” of the sigint “take”. In return, the third\nparties to the NSA agreements received “highly sanitised intelligence”.\nThe\nnews could be potentially damaging to countries, particularly Germany,\nwhose chancellor Angela Merkel has vocally condemned the NSA program\nthat recently came to light by whistleblower Edward Snowden.\nThis sounds like Echelon on steroids, dwarfing anything Orwell imagined in Big Brother. Moreover, as La Repubblica reports, the Observer article has already been removed from the web “pending an investigation:\n“Datagate, anche l’Italia collabora”\nPoi il Guardian rimuove la pagina web\nIl Telegraph:\nquella fonte è inaffidabile\nFoto\nMa l’articolo è comunque finito in edicola\n“Datagate, Italy also collaborates”\nAfterwards the Guardian removes the web page\nThe Telegraph[sic]: that source is not found\nPhoto But the article is nevertheless still on the newspaper stand\nNote that La Repubblica mistakenly refers to The Telegraph when the link actually refers to The Guardian.  These revelations should give a massive boost to the growing anti-Merkel forces in Germany, as it reveals her to be a shameless and bald-faced liar.",
  "tags": [
    "conspiracy",
    "EU",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-30T09:02:00+00:00"
}