{
  "url": "https://voxday.net/2013/06/29/deen-proves-hoyt-rig/",
  "scraped_at": "2025-12-14T22:33:38.450361",
  "title": "Deen proves Hoyt right",
  "date_display": "June 29, 2013",
  "date_iso": "2013-06-29T13:00:00+00:00",
  "date_from_url": "2013-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Prof. Stephen Clark <a href=\"http://pjmedia.com/instapundit/171584/\">writes in to Instapundit</a>:</p><blockquote class=\"tr_bq\"><p> The cancellation of Paula Deen’s book at this time is about avoiding<br> being seen as enabling what appears to be an evolving protest as<br> expressed through the advance orders, coupled with a desire to flip off<br> the protesters.  Just another page in the ongoing cultural aggression<br> being waged by the bicoastal elite. It does, however, neatly illustrate<br> the inherent viciousness of the class.</br></br></br></br></br></p></blockquote><p>Taken in<br> combination with the complete inactivity concerning Alec Baldwin’s<br> recent comments on Twitter, it also shows the utter hypocrisy of that<br> class.  By the elite’s standard metric, Baldwin’s speech was every bit<br> as hateful and unforgivable as Deen’s theatrics, if not more so, but he<br> hasn’t been fired from his show or lost any endorsement contracts.</br></br></br></br></br></p><p>Now,<br> I certainly don’t pity Mrs. Deen in the slightest, as like James<br> Frenkel, she is simply reaping the harvest that she helped sow with her<br> active support of progressives and the establishment of today’s<br> political elite.  And there are worse fates than <a href=\"http://www.nytimes.com/2013/06/29/business/media/publisher-drops-book-deal-with-tv-chef-paula-deen.html?hpw\">being paid millions of dollars to not write a book</a> or two. But she does serve as what should be an educational<br> example to all the Scalzis and Hineses and Goulds of the world; no<br> amount of goodthink, political posturing, or progressive flag-waving is<br> going to save you when the pinkshirts and/or savages you have championed<br> turn on you and tear you apart without warning.</br></br></br></br></br></br></br></br></p><p>John<br> Scalzi was very fortunate that his inept political satire last year was<br> accepted as such. That didn’t have to be the case; it was far more<br> potentially offensive than the “lady editor” comment that sparked<br> Bulletingate. If it had served the whims of the pinkshirts to destroy<br> him, (for example, if they had had a candidate for SFWA president they<br> wished to push), he would have found himself the bewildered recipient of<br> the same sort of ideological hysteria to which Messrs. Resnick and<br> Malzberg were inflicted.  As readers here have probably noted,<br> pinkshirts tend to fall silent and run away as soon as they meet with<br> direct opposition willing to openly confront them; the only thing even<br> the most abject apologizing accomplishes is to inspire them to go into a<br> feeding frenzy.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>In fact, because he has shown obvious Scalzi-like weakness in his obvious desire to appease the pinkshirts, I think it<br> quite likely that Steven Gould, the incoming president, will soon come<br> under attack from the organizational left for one reason or another.</br></br></p><p>To return to Mrs. Deen, the cancellation of her book, which at the time was Amazon’s #1<br> bestseller prior to its release, also shows that Sarah Hoyt was<br> absolutely right and that “business reasons” have absolutely nothing to<br> do with the ideologically driven decisions of the publishing<br> gatekeepers.  That defense, which was never the least bit convincing to<br> anyone with actual experience of mainstream publishing, has now been<br> exploded in a very public and undeniable manner.</br></br></br></br></br></br></p><p>And it also demonstrates the importance of building distribution channels that circumnavigate the attempts of the gatekeepers to control what is made available to the public.</p></div>",
  "content_text": "Prof. Stephen Clark\nwrites in to Instapundit\n:\nThe cancellation of Paula Deen’s book at this time is about avoiding\nbeing seen as enabling what appears to be an evolving protest as\nexpressed through the advance orders, coupled with a desire to flip off\nthe protesters.  Just another page in the ongoing cultural aggression\nbeing waged by the bicoastal elite. It does, however, neatly illustrate\nthe inherent viciousness of the class.\nTaken in\ncombination with the complete inactivity concerning Alec Baldwin’s\nrecent comments on Twitter, it also shows the utter hypocrisy of that\nclass.  By the elite’s standard metric, Baldwin’s speech was every bit\nas hateful and unforgivable as Deen’s theatrics, if not more so, but he\nhasn’t been fired from his show or lost any endorsement contracts.\nNow,\nI certainly don’t pity Mrs. Deen in the slightest, as like James\nFrenkel, she is simply reaping the harvest that she helped sow with her\nactive support of progressives and the establishment of today’s\npolitical elite.  And there are worse fates than\nbeing paid millions of dollars to not write a book\nor two. But she does serve as what should be an educational\nexample to all the Scalzis and Hineses and Goulds of the world; no\namount of goodthink, political posturing, or progressive flag-waving is\ngoing to save you when the pinkshirts and/or savages you have championed\nturn on you and tear you apart without warning.\nJohn\nScalzi was very fortunate that his inept political satire last year was\naccepted as such. That didn’t have to be the case; it was far more\npotentially offensive than the “lady editor” comment that sparked\nBulletingate. If it had served the whims of the pinkshirts to destroy\nhim, (for example, if they had had a candidate for SFWA president they\nwished to push), he would have found himself the bewildered recipient of\nthe same sort of ideological hysteria to which Messrs. Resnick and\nMalzberg were inflicted.  As readers here have probably noted,\npinkshirts tend to fall silent and run away as soon as they meet with\ndirect opposition willing to openly confront them; the only thing even\nthe most abject apologizing accomplishes is to inspire them to go into a\nfeeding frenzy.\nIn fact, because he has shown obvious Scalzi-like weakness in his obvious desire to appease the pinkshirts, I think it\nquite likely that Steven Gould, the incoming president, will soon come\nunder attack from the organizational left for one reason or another.\nTo return to Mrs. Deen, the cancellation of her book, which at the time was Amazon’s #1\nbestseller prior to its release, also shows that Sarah Hoyt was\nabsolutely right and that “business reasons” have absolutely nothing to\ndo with the ideologically driven decisions of the publishing\ngatekeepers.  That defense, which was never the least bit convincing to\nanyone with actual experience of mainstream publishing, has now been\nexploded in a very public and undeniable manner.\nAnd it also demonstrates the importance of building distribution channels that circumnavigate the attempts of the gatekeepers to control what is made available to the public.",
  "tags": [
    "politics",
    "SFWA",
    "Standout Authors"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-29T12:00:00+00:00"
}