{
  "url": "https://voxday.net/2013/06/22/devouring-their-elders/",
  "scraped_at": "2025-12-14T22:32:49.782156",
  "title": "Devouring their elders",
  "date_display": "June 22, 2013",
  "date_iso": "2013-06-22T08:39:00+00:00",
  "date_from_url": "2013-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Instapundit urges <a href=\"http://pjmedia.com/instapundit/171142/\">support for Malzberg and Resnick</a> and quite rightly suspects “that the real ‘radioactive aura’ is more likely to attach to the SFWA”, while Andrew Fox excoriates the recent attempt of the SFWA’s pinkshirted stormtroopers <a href=\"http://www.fantasticalandrewfox.com/2013/06/20/burn-the-witch-swarm-cyber-shaming-in-science-fiction/\">to mau-mau their feminist forebears</a> in considerable detail:</p><blockquote class=\"tr_bq\"><p> I feel compelled to point out, or at least suggest, that a vocal and<br> very cyber-visible portion of the SF pro and fan community have not been<br> covering themselves in glory recently.  In fact, they have been acting<br> like a mob.  A cyber-mob.  And a mob is an ugly thing….</br></br></br></p><p>Given the prevalence of academic jargon from Cultural Studies or<br> other Studies departments in their comments, I imagine a goodly number<br> of the criticizers on the SWFA discussion boards and the broader<br> Internet are either university instructors or possessors of an advanced<br> degree from one of those programs.  For many individuals under the age<br> of forty who have been through the university system, mau-mauing may<br> seem normative, or at least unremarkable.  They have seen it at work<br> through divestment campaigns of various kinds (divestment from Israeli<br> companies or U.S. companies which provide goods to Israel which might be<br> used in security operations against Palestinians, or from companies<br> involved in fossil fuel production, or from companies connected to<br> certain figures active on the Right, such as the Koch brothers) and<br> through shout-downs and other disruptions of speakers invited to campus<br> whose backgrounds or viewpoints are contrary to those favored by student<br> activists.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Many of the criticizers may not consciously realize that they are<br> mau-mauing Mike and Barry, but mau-mauing is what they are engaged in.<br> Some commentators have pointed out the criticism is not censorship.<br> True; but in this instance, rather irrelevant.  Other commentators have<br> stated that freedom of speech does not imply a right to a paid platform<br> (such as that enjoyed until now by Barry and Mike with their quarterly<br> columns for the <i>Bulletin</i>).  Again – true, but irrelevant.  For<br> what the protesters either seek to do or end up abetting is not<br> censorship, but what can be called <i>shunning and shaming</i>, an application of a radioactive aura to these two men which will make not only the future editors of the <i>Bulletin</i><br> but also editors at other periodicals and publishing houses, organizers<br> of conventions, literary prize juries, and media outlets shy away from<br> wanting any connection with these two and their works.  Remember, this<br> story has now broken out into mainstream outlets such as <i>Salon</i> and the <i>Guardian</i>;<br> people who previously had never heard of Mike Resnick or Barry Malzberg<br> or any of their books will now have their initial (and most likely<br> only) impression of them branded with a scarlet “S” for “Sexist,” as<br> detrimental a negative label in our time as “Adulterer” was in the time<br> of the Puritans.  As Barry himself stated in the column “Talk Radio<br> Redux,” the most potent form of censorship is <i>self-censorship</i>,<br> the type that occurs in a writer’s head before he or she sets fingers to<br> keyboard.  The mau-mauers, consciously or not, are using Mike and Barry<br> as cautionary examples – “Look what we’ve been able to do to the<br> reputations of a WorldCon Guest of Honor and to a man who has written<br> close to a hundred novels and over 250 short stories, several nominated<br> for Hugo or Nebula Awards.  If we could do this to them, what do you<br> think we could do to <i>you</i> if you commit ThoughtCrime?”</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>The virtually thoughtless piling on is perhaps the most appalling.<br> So many of the criticizers whose comments I have come across admit <i>they haven’t even read the columns in question</i>.  Once the ball of <i>shunning and shaming</i><br> got rolling, hundreds of onlookers, alerted by social media, jumped on<br> the bandwagon, attracted by the enticing glow of participating in shared<br> moral outrage.  Moral preening is on overload; industry professionals<br> and would-be professionals frantically signal to each other that they<br> are right-thinkers.  According to the mau-mauers, Mike and Barry did not<br> merely misspeak (miswrite?); they did not have decent-enough intentions<br> which were ruined by Paleolithic habits and blinkered upbringings; they<br> are morally suspect, <i>malign</i> and <i>vicious</i> and <i>evil</i>.  It’s <i>burn the witch!</i> all over again, but this time on a pyre of blog posts and Tweets.</br></br></br></br></br></br></br></br></br></p><p>I mentioned before that I completely understand the vehemence of<br> Barry’s reaction to all this.  One sadly ironic aspect of this brouhaha<br> is that Barry is a lifelong man of the Left.  He was staunchly antiwar<br> during the Vietnam era (see early stories such as “Final War”), and his<br> dream president was (and remains) Eugene McCarthy.  I fully believe,<br> based on his writings about Alice Sheldon and Judith Merril, that Barry<br> considers himself a feminist, and an avid one.  Condemnation from one’s<br> “own side” always burns hotter in one’s craw than condemnation from “the<br> other guys,” which can be easily rationalized away; just as criticism<br> (especially when viewed as unfair) from one’s own family hurts much<br> worse than criticism from relative strangers.  Forty years ago (and in<br> all the years since), Barry was a fierce advocate of the New Wave in<br> science fiction, whose practitioners (with the sole exception of R. A.<br> Lafferty) were all politically aligned with the Left, as opposed to<br> old-timers such as John W. Campbell and Robert Heinlein.  Now Barry must<br/> feel as though the children of the Revolution are eating their elders<br/> (as so frequently happens, it seems).</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>The amusing thing about this is that the SFWA folks involved, from Scalzi on down, genuinely believe that it was Mike and Barry making the organization look bad.  But they’re doing a fabulous job of doing that all on their own and they just keep digging the hole deeper… especially in light of the recent announcement of a <strike>5-Year</strike> 4-Step Plan in which the SFWA Bulletin has been put on hiatus for up to six months while the pinkshirted task force <strike>ideologically cleanses</strike> redefines the “goals and mission of the magazine.”</p><p>As for devouring their elders, Fox may not realize quite how literally that has been true.  Although, to be fair, if Laura Resnick has not deigned to publicly defend her father, she has at least refrained from throwing in with the pinkshirted maenads.</p></div>",
  "content_text": "Instapundit urges\nsupport for Malzberg and Resnick\nand quite rightly suspects “that the real ‘radioactive aura’ is more likely to attach to the SFWA”, while Andrew Fox excoriates the recent attempt of the SFWA’s pinkshirted stormtroopers\nto mau-mau their feminist forebears\nin considerable detail:\nI feel compelled to point out, or at least suggest, that a vocal and\nvery cyber-visible portion of the SF pro and fan community have not been\ncovering themselves in glory recently.  In fact, they have been acting\nlike a mob.  A cyber-mob.  And a mob is an ugly thing….\nGiven the prevalence of academic jargon from Cultural Studies or\nother Studies departments in their comments, I imagine a goodly number\nof the criticizers on the SWFA discussion boards and the broader\nInternet are either university instructors or possessors of an advanced\ndegree from one of those programs.  For many individuals under the age\nof forty who have been through the university system, mau-mauing may\nseem normative, or at least unremarkable.  They have seen it at work\nthrough divestment campaigns of various kinds (divestment from Israeli\ncompanies or U.S. companies which provide goods to Israel which might be\nused in security operations against Palestinians, or from companies\ninvolved in fossil fuel production, or from companies connected to\ncertain figures active on the Right, such as the Koch brothers) and\nthrough shout-downs and other disruptions of speakers invited to campus\nwhose backgrounds or viewpoints are contrary to those favored by student\nactivists.\nMany of the criticizers may not consciously realize that they are\nmau-mauing Mike and Barry, but mau-mauing is what they are engaged in.\nSome commentators have pointed out the criticism is not censorship.\nTrue; but in this instance, rather irrelevant.  Other commentators have\nstated that freedom of speech does not imply a right to a paid platform\n(such as that enjoyed until now by Barry and Mike with their quarterly\ncolumns for the\nBulletin\n).  Again – true, but irrelevant.  For\nwhat the protesters either seek to do or end up abetting is not\ncensorship, but what can be called\nshunning and shaming\n, an application of a radioactive aura to these two men which will make not only the future editors of the\nBulletin\nbut also editors at other periodicals and publishing houses, organizers\nof conventions, literary prize juries, and media outlets shy away from\nwanting any connection with these two and their works.  Remember, this\nstory has now broken out into mainstream outlets such as\nSalon\nand the\nGuardian\n;\npeople who previously had never heard of Mike Resnick or Barry Malzberg\nor any of their books will now have their initial (and most likely\nonly) impression of them branded with a scarlet “S” for “Sexist,” as\ndetrimental a negative label in our time as “Adulterer” was in the time\nof the Puritans.  As Barry himself stated in the column “Talk Radio\nRedux,” the most potent form of censorship is\nself-censorship\n,\nthe type that occurs in a writer’s head before he or she sets fingers to\nkeyboard.  The mau-mauers, consciously or not, are using Mike and Barry\nas cautionary examples – “Look what we’ve been able to do to the\nreputations of a WorldCon Guest of Honor and to a man who has written\nclose to a hundred novels and over 250 short stories, several nominated\nfor Hugo or Nebula Awards.  If we could do this to them, what do you\nthink we could do to\nyou\nif you commit ThoughtCrime?”\nThe virtually thoughtless piling on is perhaps the most appalling.\nSo many of the criticizers whose comments I have come across admit\nthey haven’t even read the columns in question\n.  Once the ball of\nshunning and shaming\ngot rolling, hundreds of onlookers, alerted by social media, jumped on\nthe bandwagon, attracted by the enticing glow of participating in shared\nmoral outrage.  Moral preening is on overload; industry professionals\nand would-be professionals frantically signal to each other that they\nare right-thinkers.  According to the mau-mauers, Mike and Barry did not\nmerely misspeak (miswrite?); they did not have decent-enough intentions\nwhich were ruined by Paleolithic habits and blinkered upbringings; they\nare morally suspect,\nmalign\nand\nvicious\nand\nevil\n.  It’s\nburn the witch!\nall over again, but this time on a pyre of blog posts and Tweets.\nI mentioned before that I completely understand the vehemence of\nBarry’s reaction to all this.  One sadly ironic aspect of this brouhaha\nis that Barry is a lifelong man of the Left.  He was staunchly antiwar\nduring the Vietnam era (see early stories such as “Final War”), and his\ndream president was (and remains) Eugene McCarthy.  I fully believe,\nbased on his writings about Alice Sheldon and Judith Merril, that Barry\nconsiders himself a feminist, and an avid one.  Condemnation from one’s\n“own side” always burns hotter in one’s craw than condemnation from “the\nother guys,” which can be easily rationalized away; just as criticism\n(especially when viewed as unfair) from one’s own family hurts much\nworse than criticism from relative strangers.  Forty years ago (and in\nall the years since), Barry was a fierce advocate of the New Wave in\nscience fiction, whose practitioners (with the sole exception of R. A.\nLafferty) were all politically aligned with the Left, as opposed to\nold-timers such as John W. Campbell and Robert Heinlein.  Now Barry must\nfeel as though the children of the Revolution are eating their elders\n(as so frequently happens, it seems).\nThe amusing thing about this is that the SFWA folks involved, from Scalzi on down, genuinely believe that it was Mike and Barry making the organization look bad.  But they’re doing a fabulous job of doing that all on their own and they just keep digging the hole deeper… especially in light of the recent announcement of a\n5-Year\n4-Step Plan in which the SFWA Bulletin has been put on hiatus for up to six months while the pinkshirted task force\nideologically cleanses\nredefines the “goals and mission of the magazine.”\nAs for devouring their elders, Fox may not realize quite how literally that has been true.  Although, to be fair, if Laura Resnick has not deigned to publicly defend her father, she has at least refrained from throwing in with the pinkshirted maenads.",
  "tags": [
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-22T07:39:00+00:00"
}