{
  "url": "https://voxday.net/2013/06/20/diversity-is-death-of-republic_20/",
  "scraped_at": "2025-12-14T22:32:38.761568",
  "title": "Diversity is the death of the republic",
  "date_display": "June 20, 2013",
  "date_iso": "2013-06-20T22:00:00+00:00",
  "date_from_url": "2013-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This isn’t a thought that is new to me; HongKongCharlie reminds us that the Founding Fathers knew it very well:</p><p><i>“The safety of a republic depends essentially on the energy of a common<br> national sentiment; on a uniformity of principles and habits; on the<br> exemption of the citizens from foreign bias and prejudice; and on that<br> love of country which will almost invariably be found to be closely<br> connected with birth, education, and family. The opinion advanced in the<br> Notes on Virginia [by Thomas Jefferson] is undoubtedly correct, that foreigners will<br> generally be apt to bring with them attachments to the persons they have<br> left behind; to the country of their nativity; and to its particular<br> customs and manners. They will also entertain opinions on government<br> congenial with those under which they have lived; or if they should be<br> led hither from a preference to ours, how extremely unlikely is it that<br> they will bring with them that temperate love of liberty, so essential<br> to real republicanism?”</br></br></br></br></br></br></br></br></br></br></br></br></i><br> -Alexander Hamilton, From the New York Evening Post: an Examination of the President’s Message, Continued, No. VIII, 1802″</br></p><p>Those<br> who advocate diversity and immigration are not merely foolish, or<br> ignorant, they are as actively and effectively anti-American as the most<br> antipathetic individuals who are consciously attempting to destroy what<br> is left of traditional, constitutional, civilized, European America.</br></br></br></br></p><p>So,<br> do keep this in mind:  The rabbits and pinkshirts loudly proclaim that<br> my opinion is outrageous, offensive, and intrinsically unworthy of<br> debate… despite that opinion being, in the words of Alexander<br> Hamilton, “undoubtedly correct”.</br></br></br></br></p></div>",
  "content_text": "This isn’t a thought that is new to me; HongKongCharlie reminds us that the Founding Fathers knew it very well:\n“The safety of a republic depends essentially on the energy of a common\nnational sentiment; on a uniformity of principles and habits; on the\nexemption of the citizens from foreign bias and prejudice; and on that\nlove of country which will almost invariably be found to be closely\nconnected with birth, education, and family. The opinion advanced in the\nNotes on Virginia [by Thomas Jefferson] is undoubtedly correct, that foreigners will\ngenerally be apt to bring with them attachments to the persons they have\nleft behind; to the country of their nativity; and to its particular\ncustoms and manners. They will also entertain opinions on government\ncongenial with those under which they have lived; or if they should be\nled hither from a preference to ours, how extremely unlikely is it that\nthey will bring with them that temperate love of liberty, so essential\nto real republicanism?”\n-Alexander Hamilton, From the New York Evening Post: an Examination of the President’s Message, Continued, No. VIII, 1802″\nThose\nwho advocate diversity and immigration are not merely foolish, or\nignorant, they are as actively and effectively anti-American as the most\nantipathetic individuals who are consciously attempting to destroy what\nis left of traditional, constitutional, civilized, European America.\nSo,\ndo keep this in mind:  The rabbits and pinkshirts loudly proclaim that\nmy opinion is outrageous, offensive, and intrinsically unworthy of\ndebate… despite that opinion being, in the words of Alexander\nHamilton, “undoubtedly correct”.",
  "tags": [
    "history",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-20T21:00:00+00:00"
}