{
  "url": "https://voxday.net/2013/06/17/edward-snowdons-liveblog-q/",
  "scraped_at": "2025-12-14T22:32:15.677840",
  "title": "Edward Snowdon’s liveblog Q&A",
  "date_display": "June 17, 2013",
  "date_iso": "2013-06-17T15:49:00+00:00",
  "date_from_url": "2013-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If there is any doubt that Snowdon is a hero, the fact that he is openly <a href=\"http://www.guardian.co.uk/world/2013/jun/17/edward-snowden-nsa-files-whistleblower\">taking questions from the public and addressing them </a>should settle that one.</p><blockquote class=\"tr_bq\"><p> 1) Why did you choose Hong Kong to go to and then tell them about US hacking on their research facilities and universities?<br> 2)<br> How many sets of the documents you disclosed did you make, and how many<br> different people have them? If anything happens to you, do they still<br> exist?<br> <b><br/></b><br> 1) First, the US Government, just as they did with other<br> whistleblowers, immediately and predictably destroyed any possibility of<br> a fair trial at home, openly declaring me guilty of treason and that<br> the disclosure of secret, criminal, and even unconstitutional acts is an<br> unforgivable crime. That’s not justice, and it would be foolish to<br> volunteer yourself to it if you can do more good outside of prison than<br> in it.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Second, let’s be clear: I did not reveal any US operations against<br> legitimate military targets. I pointed out where the NSA has hacked<br> civilian infrastructure such as universities, hospitals, and private<br> businesses because it is dangerous. These nakedly, aggressively criminal<br> acts are wrong no matter the target. Not only that, when NSA makes a<br> technical mistake during an exploitation operation, critical systems<br> crash. Congress hasn’t declared war on the countries – the majority of<br> them are our allies – but without asking for public permission, NSA is<br> running network operations against them that affect millions of innocent<br> people.</br></br></br></br></br></br></br></br></br></p><p>And for what? So we can have secret access to a computer in a<br> country we’re not even fighting? So we can potentially reveal a<br> potential terrorist with the potential to kill fewer Americans than our<br> own Police? No, the public needs to know the kinds of things a<br> government does in its name, or the “consent of the governed” is<br> meaningless.</br></br></br></br></br></p><p>2) All I can say right now is the US Government is not going to be<br> able to cover this up by jailing or murdering me. Truth is coming, and<br> it cannot be stopped.</br></br></p></blockquote><p>Two great quotes:</p><p>“The consent of the governed is not consent if it is not informed.” </p><p>“Citizens with a conscience are not going to ignore wrong-doing simply<br> because they’ll be destroyed for it: the conscience forbids it.”</br></p><p>Those are the words of a free man and a hero of human liberty.</p></div>",
  "content_text": "If there is any doubt that Snowdon is a hero, the fact that he is openly\ntaking questions from the public and addressing them\nshould settle that one.\n1) Why did you choose Hong Kong to go to and then tell them about US hacking on their research facilities and universities?\n2)\nHow many sets of the documents you disclosed did you make, and how many\ndifferent people have them? If anything happens to you, do they still\nexist?\n1) First, the US Government, just as they did with other\nwhistleblowers, immediately and predictably destroyed any possibility of\na fair trial at home, openly declaring me guilty of treason and that\nthe disclosure of secret, criminal, and even unconstitutional acts is an\nunforgivable crime. That’s not justice, and it would be foolish to\nvolunteer yourself to it if you can do more good outside of prison than\nin it.\nSecond, let’s be clear: I did not reveal any US operations against\nlegitimate military targets. I pointed out where the NSA has hacked\ncivilian infrastructure such as universities, hospitals, and private\nbusinesses because it is dangerous. These nakedly, aggressively criminal\nacts are wrong no matter the target. Not only that, when NSA makes a\ntechnical mistake during an exploitation operation, critical systems\ncrash. Congress hasn’t declared war on the countries – the majority of\nthem are our allies – but without asking for public permission, NSA is\nrunning network operations against them that affect millions of innocent\npeople.\nAnd for what? So we can have secret access to a computer in a\ncountry we’re not even fighting? So we can potentially reveal a\npotential terrorist with the potential to kill fewer Americans than our\nown Police? No, the public needs to know the kinds of things a\ngovernment does in its name, or the “consent of the governed” is\nmeaningless.\n2) All I can say right now is the US Government is not going to be\nable to cover this up by jailing or murdering me. Truth is coming, and\nit cannot be stopped.\nTwo great quotes:\n“The consent of the governed is not consent if it is not informed.”\n“Citizens with a conscience are not going to ignore wrong-doing simply\nbecause they’ll be destroyed for it: the conscience forbids it.”\nThose are the words of a free man and a hero of human liberty.",
  "tags": [
    "corpocracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-17T14:49:00+00:00"
}