{
  "url": "https://voxday.net/2013/06/26/ideology-of-gatekeepers/",
  "scraped_at": "2025-12-14T22:33:18.423386",
  "title": "Ideology of the gatekeepers",
  "date_display": "June 26, 2013",
  "date_iso": "2013-06-26T13:00:00+00:00",
  "date_from_url": "2013-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amanda at the Mad Genius Club <a href=\"http://madgeniusclub.com/2013/06/25/why/\">notes the connection</a> between the rise of the Left’s ideological gatekeepers in publishing and the alarming discovery that boys no longer read books:</p><blockquote class=\"tr_bq\"><p> I’m happy with just writing stories folks want to read. After all, isn’t that really what we’re supposed to be doing? Writing<br> stories that entertain? If a story doesn’t entertain, folks aren’t<br> going to read it — or at least not finish it. If they don’t read it,<br> then what good is any message we might put into it? That message will be<br> lost because it was never read.</br></br></br></br></p><p>But that isn’t enough for the literati, for all too many editors and,<br> unfortunately, for the boards of too many professional organizations<br> these days. No, you have to be socially relevant and enlightened in your<br> writing. You have to promote what is “right” — as is defined by those<br> who have the loudest voice. Heaven help you if you write something that<br> might offend someone else, especially if you are a male of a certain<br> age.</br></br></br></br></br></br></p><p>Maybe I’m old-fashioned (and I know that means I have the wrong<br> beliefs and should probably be silenced now. Sorry, I’m a loud-mouthed<br> woman who isn’t afraid to exercise my First Amendment rights). But I<br> still feel that the story is the thing we should be concerned with and<br> not the message. As I said earlier, folks won’t read the message if they<br> don’t read the story. The corollary to this is: why is publishing in<br> trouble? Because it forgot that readers, on the whole, read to be<br> entertained and to forget about their troubles….</br></br></br></br></br></br></br></p><p>Don’t believe me, ask yourself why so many in publishing are trying<br> to convince us that boys don’t read….</br></p><p>Then we have those publishers and editors and writers who feel that<br> we must address all of society’s ills with our writing and “educate” our<br> readers so there will never be any racism or sexism or any other ism<br> they don’t approve of ever again.</br></br></br></p></blockquote><p>She’s merely pointing out the readily apparent, but in light of how some writers have nevertheless attempted to deny there is any ideological bias in the SFWA and in SF/F publishing, and it is either a) one’s imagination, or, b) just a complete coincidence to observe that the field is now policed by gatekeepers who assiduously work to prevent the publication of any makehurt or crimethink, I think it is useful to have a look at what sort of works the publishers are actively seeking:</p><p>Here is <a href=\"http://crossedgenres.com/submissions/novel/#sthash.vzPvpMkl.dpuf\">an informative example</a> from one publishing house that freely admits it is “of a progressive bent”:</p><blockquote class=\"tr_bq\"><h3> What are we looking for?</h3><p>As mentioned above, we’re now considering submissions within any<br> genres. We’re specifically looking for novels or collections which<br> demonstrate a significant crossover between genres – as the name or our<br> press suggests. CGP has always been a press with a progressive bent. Bearing that in mind, here are some things we want to see MORE of:<br/></br></br></br></p><ul><li>Queer Main Characters</li><li>MC’s of Color</li><li>Women MC’s</li><li>Disabled MC’s</li><li>Science saves the day!</li><li>Far future</li><li>Stories set outside North America</li></ul><p>Beyond that, there is no hard-and-fast rule; any story that follows the above guidelines will be considered.</p><h3> What are we <u>NOT</u> looking for?</h3><p></p><ul><li>Stories based off the assumption that any particular religion’s beliefs are real</li><li>Weak women being rescued by macho guys</li><li>“Science-as-villain”</li><li>Vampires, zombies, werewolves, Arthurian retellings, Eurocentric faeries, or ghost stories</li><li>Time travel</li></ul><p>Though it should go without saying, any submissions promoting<br> discrimination, misogyny, bigotry, and/or hatred will be deleted without<br> notice or consideration.</br></br></p></blockquote><p>Now, consider how many works of the Golden Age are unpublishable by these standards, particularly in light of the opinion of the majority of SFWA members that using the term “lady” as an adjective is competely unacceptable misogyny. And notice how the publisher is not only expressly anti-religious and anti-American, but is actively looking to publish secular science propaganda.  Religion can be the villain – so long as its tenets are shown to be false – but science cannot be.</p><p>Obviously, this is a small publisher, but don’t deceive yourself.  The major genre publishers may be much more open to vampires, zombies, and time travel than this one, but their standards, the books they have been publishing, and the books they are looking to publish, are all based on the same ideological standard even though they are less open about it.</p><p>Speaking of gatekeepers, if you’re submitting for ing-game publication, please keep in mind that we’re focused on action and story uber alles; the objective is most certainly NOT to become the mirror image of the conventional gatekeepers.</p></div>",
  "content_text": "Amanda at the Mad Genius Club\nnotes the connection\nbetween the rise of the Left’s ideological gatekeepers in publishing and the alarming discovery that boys no longer read books:\nI’m happy with just writing stories folks want to read. After all, isn’t that really what we’re supposed to be doing? Writing\nstories that entertain? If a story doesn’t entertain, folks aren’t\ngoing to read it — or at least not finish it. If they don’t read it,\nthen what good is any message we might put into it? That message will be\nlost because it was never read.\nBut that isn’t enough for the literati, for all too many editors and,\nunfortunately, for the boards of too many professional organizations\nthese days. No, you have to be socially relevant and enlightened in your\nwriting. You have to promote what is “right” — as is defined by those\nwho have the loudest voice. Heaven help you if you write something that\nmight offend someone else, especially if you are a male of a certain\nage.\nMaybe I’m old-fashioned (and I know that means I have the wrong\nbeliefs and should probably be silenced now. Sorry, I’m a loud-mouthed\nwoman who isn’t afraid to exercise my First Amendment rights). But I\nstill feel that the story is the thing we should be concerned with and\nnot the message. As I said earlier, folks won’t read the message if they\ndon’t read the story. The corollary to this is: why is publishing in\ntrouble? Because it forgot that readers, on the whole, read to be\nentertained and to forget about their troubles….\nDon’t believe me, ask yourself why so many in publishing are trying\nto convince us that boys don’t read….\nThen we have those publishers and editors and writers who feel that\nwe must address all of society’s ills with our writing and “educate” our\nreaders so there will never be any racism or sexism or any other ism\nthey don’t approve of ever again.\nShe’s merely pointing out the readily apparent, but in light of how some writers have nevertheless attempted to deny there is any ideological bias in the SFWA and in SF/F publishing, and it is either a) one’s imagination, or, b) just a complete coincidence to observe that the field is now policed by gatekeepers who assiduously work to prevent the publication of any makehurt or crimethink, I think it is useful to have a look at what sort of works the publishers are actively seeking:\nHere is\nan informative example\nfrom one publishing house that freely admits it is “of a progressive bent”:\nWhat are we looking for?\nAs mentioned above, we’re now considering submissions within any\ngenres. We’re specifically looking for novels or collections which\ndemonstrate a significant crossover between genres – as the name or our\npress suggests. CGP has always been a press with a progressive bent. Bearing that in mind, here are some things we want to see MORE of:\nQueer Main Characters\nMC’s of Color\nWomen MC’s\nDisabled MC’s\nScience saves the day!\nFar future\nStories set outside North America\nBeyond that, there is no hard-and-fast rule; any story that follows the above guidelines will be considered.\nWhat are we\nNOT\nlooking for?\nStories based off the assumption that any particular religion’s beliefs are real\nWeak women being rescued by macho guys\n“Science-as-villain”\nVampires, zombies, werewolves, Arthurian retellings, Eurocentric faeries, or ghost stories\nTime travel\nThough it should go without saying, any submissions promoting\ndiscrimination, misogyny, bigotry, and/or hatred will be deleted without\nnotice or consideration.\nNow, consider how many works of the Golden Age are unpublishable by these standards, particularly in light of the opinion of the majority of SFWA members that using the term “lady” as an adjective is competely unacceptable misogyny. And notice how the publisher is not only expressly anti-religious and anti-American, but is actively looking to publish secular science propaganda.  Religion can be the villain – so long as its tenets are shown to be false – but science cannot be.\nObviously, this is a small publisher, but don’t deceive yourself.  The major genre publishers may be much more open to vampires, zombies, and time travel than this one, but their standards, the books they have been publishing, and the books they are looking to publish, are all based on the same ideological standard even though they are less open about it.\nSpeaking of gatekeepers, if you’re submitting for ing-game publication, please keep in mind that we’re focused on action and story uber alles; the objective is most certainly NOT to become the mirror image of the conventional gatekeepers.",
  "tags": [
    "SFWA",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-26T12:00:00+00:00"
}