{
  "url": "https://voxday.net/2013/06/18/ideological-cleansing/",
  "scraped_at": "2025-12-14T22:32:22.592204",
  "title": "Ideological cleansing",
  "date_display": "June 18, 2013",
  "date_iso": "2013-06-18T17:00:00+00:00",
  "date_from_url": "2013-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In much the same way Sami Abu Al-Ala was recently calling for ethnically cleansing Egypt of Jews, a pinkshirt by the name of Amal El-Mohtar was calling for the ideological cleansing of SFWA the other day.  She appears to find me insufficiently enthusiastic about the equalitarian jihad and is obviously hoping to make use of Twittergate in order to expel me from the organization   I didn’t bother responding to her call initially, since El-Mohtar’s opinion is no more important to me than Al-Ala’s.</p><p>What was amusing about the post with which she followed up that call, however, was the shock and dismay it reveals about her discovery that many sane and intelligent individuals actually tend to agree with me rather than with the fascist pinkshirts of the SFWA.  A number of my critics quite clearly do not recognize how the numbers line up; they’re still babbling about the problem of giving me “a platform” and clearly failing to recognize that I already have a much bigger platform than most of my outspoken critics.  For all that the pinkshirts are desperately trying to pretend something else is at stake, this is a very clear test of where one stands on the freedom of speech and expression.</p><p>Anyhow, this brave pinkshirt is feeling drained and wearied and constrained in her speech and expression by the fact that people actually disagree with her about “the horrors” of my opinion, despite the fact that I paid her no attention at all.  So, clearly, that is <a href=\"http://tithenai.livejournal.com/400215.html\">a situation that requires rectifying</a>:</p><blockquote class=\"tr_bq\"><p> There are roughly seven thousand things I would rather be talking about<br> right now, but nevertheless. This is very important to me.</br></p><p>On Wednesday I <a href=\"http://amalelmohtar.com/2013/06/13/calling-for-the-expulsion-of-theodore-beale-from-sfwa/\" rel=\"noopener\" target=\"_blank\">called for the expulsion of Theodore Beale</a>,<br> aka Vox Day, from SFWA. The reasons and proposed methodology are<br> detailed in the link. In brief, he very obviously, knowingly, and<br> deliberately broke the rules over what kind of posts could be tagged for<br> inclusion in SFWA’s promotional Twitter feed by posting a racist attack<br> on N. K. Jemisin. This is not a one-time occurence, but part of a<br> pattern of behaviour that shows malicious contempt for the organization<br> as a whole.</br></br></br></br></br></br></br></p><p>While the vast majority of responses — through<br> pingbacks on the post, in e-mail, over Twitter — have been positive and<br> supportive, over the last few days I have seen the following in various<br> places on the internet:</br></br></br></p><p>– people refusing to acknowledge that there was anything racist or misogynistic about Beale’s post<br> –<br> people wringing their hands over how we shouldn’t ban people from<br> organizations for their opinions (when that is not the argument I am<br> making)<br> – people saying we should just ignore him — that banning him from the Twitter feed is enough of a reprimand<br> –<br> people being more outraged at the idea that I would call Beale’s post<br> racist than at the fact that he called a black woman “an ignorant<br> half-savage” who couldn’t possibly be “fully civilized” on account of<br> her ethnic heritage.</br></br></br></br></br></br></br></br></br></br></p><p>I have also seen people belligerently<br> questioning or deriding my command of the English language, my religion,<br> my ethnicity, and my nationality, as a consequence of having made that<br> post.</br></br></br></p></blockquote><p>I would be remiss if I failed to note that like NK Jemisin before her, El-Mohtar is lying about me.  I did not deliberately break the rules concerning the Twitter feed, I simply forgot them.  Nor do I have contempt for the entire organization, as my contempt is reserved for the current set of SFWA officers who are steering the organization into self-parody and complete irrelevance, as well as for the pinkshirts, who are mostly relatively new and unaccomplished members attempting to ideologically cleanse the organization of dissenting opinions.</p><p>UPDATE: Since I hadn’t read the woman’s entire first post, I didn’t realize quite how cognititively handicapable she is.  Check out her bolding-for-emphasis:</p><blockquote class=\"tr_bq\"><p> <b>Marking blog posts for inclusion that include threats or personal attacks or obvious trolling will also be grounds for removal.</b> (Emphasis mine.)</p></blockquote><p>The woman obviously doesn’t realize that “removal” does not mean “expulsion from the organization”, but rather, “removal of the offending blog from the Twitter feed”.  Which, you will note, has already taken place.</p><p>El-Moron also lies again when she claims that I have “repeatedly and aggressively used SFWA platforms to<br> broadcast and disseminate these views with obvious malicious intent.”  I used the Twitter feed once.  Ever.  And I never used any “SFWA platform”, because the Twitterfeed guidelines clearly state: <i>“While SFWA does maintain the @sfwaauthors Twitter feed for the benefit of its members, ultimately the posts that appear in the feed are the responsibility of the authors of those posts, and are in no way endorsed by SFWA, nor do such posts reflect the opinions or policy of SFWA.”   </i>It’s not as if I spoke as an officer of the organization, hijacked the SFWA Twitter account, posted anything on the SFWA web site or published an article in the SFWA Bulletin.</br></p><p>Finally, she doesn’t so much lie as display outright neuroticism by claiming <i>“This last reads to me very much like a threat, especially coming from a<br> white man to a black woman in a country where public lynchings are a<br> matter of living memory.”</br></br></i></p><p>This last bit certainly helps explain why people have been deriding El-Moron’s command of the English language. First, it’s obviously not a threat.  I’m the only one who has actually, and repeatedly, been threatened here. Second, Jemisin made her speech in Australia.  Third, I live in Europe, not in the Americas.</p><p>Let rhetoric be silent when the readily observable facts gainsay its blather.</p></div>",
  "content_text": "In much the same way Sami Abu Al-Ala was recently calling for ethnically cleansing Egypt of Jews, a pinkshirt by the name of Amal El-Mohtar was calling for the ideological cleansing of SFWA the other day.  She appears to find me insufficiently enthusiastic about the equalitarian jihad and is obviously hoping to make use of Twittergate in order to expel me from the organization   I didn’t bother responding to her call initially, since El-Mohtar’s opinion is no more important to me than Al-Ala’s.\nWhat was amusing about the post with which she followed up that call, however, was the shock and dismay it reveals about her discovery that many sane and intelligent individuals actually tend to agree with me rather than with the fascist pinkshirts of the SFWA.  A number of my critics quite clearly do not recognize how the numbers line up; they’re still babbling about the problem of giving me “a platform” and clearly failing to recognize that I already have a much bigger platform than most of my outspoken critics.  For all that the pinkshirts are desperately trying to pretend something else is at stake, this is a very clear test of where one stands on the freedom of speech and expression.\nAnyhow, this brave pinkshirt is feeling drained and wearied and constrained in her speech and expression by the fact that people actually disagree with her about “the horrors” of my opinion, despite the fact that I paid her no attention at all.  So, clearly, that is\na situation that requires rectifying\n:\nThere are roughly seven thousand things I would rather be talking about\nright now, but nevertheless. This is very important to me.\nOn Wednesday I\ncalled for the expulsion of Theodore Beale\n,\naka Vox Day, from SFWA. The reasons and proposed methodology are\ndetailed in the link. In brief, he very obviously, knowingly, and\ndeliberately broke the rules over what kind of posts could be tagged for\ninclusion in SFWA’s promotional Twitter feed by posting a racist attack\non N. K. Jemisin. This is not a one-time occurence, but part of a\npattern of behaviour that shows malicious contempt for the organization\nas a whole.\nWhile the vast majority of responses — through\npingbacks on the post, in e-mail, over Twitter — have been positive and\nsupportive, over the last few days I have seen the following in various\nplaces on the internet:\n– people refusing to acknowledge that there was anything racist or misogynistic about Beale’s post\n–\npeople wringing their hands over how we shouldn’t ban people from\norganizations for their opinions (when that is not the argument I am\nmaking)\n– people saying we should just ignore him — that banning him from the Twitter feed is enough of a reprimand\n–\npeople being more outraged at the idea that I would call Beale’s post\nracist than at the fact that he called a black woman “an ignorant\nhalf-savage” who couldn’t possibly be “fully civilized” on account of\nher ethnic heritage.\nI have also seen people belligerently\nquestioning or deriding my command of the English language, my religion,\nmy ethnicity, and my nationality, as a consequence of having made that\npost.\nI would be remiss if I failed to note that like NK Jemisin before her, El-Mohtar is lying about me.  I did not deliberately break the rules concerning the Twitter feed, I simply forgot them.  Nor do I have contempt for the entire organization, as my contempt is reserved for the current set of SFWA officers who are steering the organization into self-parody and complete irrelevance, as well as for the pinkshirts, who are mostly relatively new and unaccomplished members attempting to ideologically cleanse the organization of dissenting opinions.\nUPDATE: Since I hadn’t read the woman’s entire first post, I didn’t realize quite how cognititively handicapable she is.  Check out her bolding-for-emphasis:\nMarking blog posts for inclusion that include threats or personal attacks or obvious trolling will also be grounds for removal.\n(Emphasis mine.)\nThe woman obviously doesn’t realize that “removal” does not mean “expulsion from the organization”, but rather, “removal of the offending blog from the Twitter feed”.  Which, you will note, has already taken place.\nEl-Moron also lies again when she claims that I have “repeatedly and aggressively used SFWA platforms to\nbroadcast and disseminate these views with obvious malicious intent.”  I used the Twitter feed once.  Ever.  And I never used any “SFWA platform”, because the Twitterfeed guidelines clearly state:\n“While SFWA does maintain the @sfwaauthors Twitter feed for the benefit of its members, ultimately the posts that appear in the feed are the responsibility of the authors of those posts, and are in no way endorsed by SFWA, nor do such posts reflect the opinions or policy of SFWA.”\nIt’s not as if I spoke as an officer of the organization, hijacked the SFWA Twitter account, posted anything on the SFWA web site or published an article in the SFWA Bulletin.\nFinally, she doesn’t so much lie as display outright neuroticism by claiming\n“This last reads to me very much like a threat, especially coming from a\nwhite man to a black woman in a country where public lynchings are a\nmatter of living memory.”\nThis last bit certainly helps explain why people have been deriding El-Moron’s command of the English language. First, it’s obviously not a threat.  I’m the only one who has actually, and repeatedly, been threatened here. Second, Jemisin made her speech in Australia.  Third, I live in Europe, not in the Americas.\nLet rhetoric be silent when the readily observable facts gainsay its blather.",
  "tags": [
    "SFWA",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-18T16:00:00+00:00"
}