{
  "url": "https://voxday.net/2013/06/25/inflation-vs-deflation-xi/",
  "scraped_at": "2025-12-14T22:33:11.062705",
  "title": "Inflation vs deflation XI",
  "date_display": "June 25, 2013",
  "date_iso": "2013-06-25T13:00:00+00:00",
  "date_from_url": "2013-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"margin-bottom: 0in;\"> I’ll start off this last round in<br> the debate by pointing out that I have most certainly not claimed that<br> federal spending somehow doesn’t count as inflation.  I was simply<br> pointing out that the Federal Reserve’s attempt to inject money into<br> the economy has been effectively limited to one delivery vehicle because<br> the banks and households have proven to be surprisingly ineffective channels for doing so.<br> Again, Nate inadvertently shows how his refusal to accept the intrinsic relationship between credit and money renders his analysis<br> incorrect.</br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> I very much agree that “for the<br> purposes on inflation it doesn’t matter who’s spending the new<br> money”.  And I agree that “government spending is merely the<br> delivery method for injecting it into the economy”, but what Nate<br> is failing to mention here is that government spending isn’t the only, or<br> even the primary, delivery method used by the Federal Reserve.  The<br> significant thing is that government spending is the only delivery method of the<br> four the Fed has been attempting to utilize for the past five years<br> that has worked at all.  Despite the larger part of the Fed’s efforts<br> being directed at the financial sector, that credit sector has<br> continued to shrink.  So has the household sector despite the<br> attempts to replace the housing sector bubble with an education<br> bubble.  The corporate sector has responded, a little, but the $1.8<br> trillion increase since 2008 is barely more than half the contraction in<br> the financial sector.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Nate claims that prices are rising<br> everywhere across the board and that it doesn’t matter where the<br> government spends the new money. Both assertions are incorrect.  Gold<br> prices are down 24 percent since the start of the year. Home prices<br> are up 1.1 percent in that same time frame, but are still down 29<br> percent from their 2006 peak.  Gasoline prices are up from January,<br> but have been trending down since the spring of 2012.  And the<br> inflated stock market is showing every sign of a steep, long-overdue<br> price correction.  But these are merely symptoms, and short-term<br> symptoms at that.  I see them as reflections of the credit<br> disinflation, Nate sees them as signs of incipient hyperinflation.<br> Only time will tell who was correct, so there is no point in further<br> belaboring the price issue.</br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Nor do I see any point in providing an<br> extended explanation of why Ben Bernanke appears to be signaling an<br> end to the quantitative easing program, or the significance of the<br> initial indications that Shinzo Abe’s massive attempt to print money<br> in Japan is failing, because Nate took things in a rather different<br> direction with his focus on the idea that hyperinflation is a<br> psychological phenomenon rather than a material one.  Those who are<br> interested can find effective summaries of those two<br> not-insignificant events on Zerohedge.  Nate wrote:</br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> <i>Hyperinflation is what happens when<br> people decide that the fiat money they have in their pockets and in<br> their accounts is no longer going to be honored in the future and<br> start spending it as quickly as possible.  That is the<br> unstoppable train of inflation.  The printing presses cannot be<br> stopped because the people will not stop spending the money as soon<br> as they get it. </br></br></br></br></br></br></i></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> But this perspective on hyperinflation again fails to<br> account for credit, which is how most people are spending most of<br> their money these days. Even when literal credit cards aren’t<br> involved, they are paying their bills with direct bank debits and<br> debit cards that draw from their credit money account. If one<br> considers the recently reported fact that 68 percent of Americans<br> possess less than $800 in savings, it should be clear that they<br> simply don’t have any fiat money in their pockets.  To quote the<br> report: “<b>After paying debts</b> and taking care of housing, car<br> and child care-related expenses, the respondents said there just<br> isn’t enough money left over for saving more.” Emphasis added.<br> Nate’s unstoppable train simply doesn’t have enough of an engine to<br> leave the station, especially when the credit money that is in those<br> accounts begins vanishing in the inevitable bail-ins. </br></br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> In considering the possibility of hyperinflation versus the likelihood of deflation, it is important to do something we have not yet done in this debate, which is to examine the differences between the present situation and the most famous historical hyperinflation. As has been previously noted, in the USA, L1 total credit has remained very close to flat since 2008, increasing only 11.2 percent in five years. By contrast, in the period leading up to <a href=\"http://www.usagold.com/germannightmare.html\">the Weimar hyperinflation</a>, the Reichsbank debt increased from 3 billion to 55 billion marks between 1914 and 1918, and to 110 billion by 1920.  </div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> <i>“Businessmen found it very profitable to borrow money from the bank and buy up goods, shares and companies. Their debt was wiped out within weeks by the rapid inflation, and the businessman remained holding the valuable assets he had bought. The net result was a huge “private inflation” caused by the rapid expansion of credit…. By October 1923, 1% of government income came from taxes and 99% from the creation of new money.”</i></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> It should be readily apparent that Weimar represented a very different scenario than the one we observe today.  We are not seeing an increase in private borrowing, but rather, a net contraction. This means the only way<br> hyperinflation can even theoretically begin in the present circumstances is if<br> the Federal Reserve elects to permit the debtors in the various debt<br> sectors to pay off their debts rather than encouraging them to default by raising interest rates, and uses the<br> government to begin electronically injecting dozens of trillions of<br> dollars into the economy through the mainstream equivalent of food stamp<br/> cards.</br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Is it possible?  Theoretically.  Is it<br/> improbable. I think so, which brings this entire debate back to the<br/> beginning, which is that one’s opinion on hyperinflation versus<br/> deflation depends entirely on one’s belief that the Federal Reserve<br/> is willing and able to choose the former over the latter.  Setting<br/> aside the fact that there are already those who believe that Bernanke<br/> has followed the Depression-era Fed’s lead in choosing the latter on<br/> the basis of his cryptic remarks concerning “tapering”, it is my<br/> contention that the Fed is not only <b><i>unable </i></b>to massively inflate, but<br/> that it is totally <i><b>unwilling </b></i>to do so.</div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Nate will have the last word, but since you’ve indulged his<br/> imagination concerning the widespread abandonment of the dollar,<br/> perhaps you’ll indulge mine concerning the motivations and mindset of the Federal Reserve in the present environment. Inflation and hyperinflation benefit<br/> borrowers. Deflation benefits lenders, as they are repaid in<br/> increasingly valuable currency. Default also benefits lenders as long as the collateral backing the loan exceeds the value of the outstanding debt.<br/> So, in closing, I will simply ask you one simple question: at this point in time, is the<br/> Federal Reserve a net borrower or a net lender?</div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> By way of example, let me propose a hypothetical scenario that is perhaps a little outlandish,<br/> if not completely in the zone of economic science fiction. The Ciceronian<br/> political cycle predicts aristocracy, not tyranny, as the post-democratic political system. And what would be a more effective way to legally<br/> establish a wealthy aristocracy with a relative minimum of societal disorder<br/> than to encourage vast indebtedness, then trigger mass defaults by raising interest rates,<br/> which then results in the acquisition of title to all of the defaulted collateral?  Even the most hard core libertarian couldn’t find anything to complain about such an action; (merely the idiocy of the centralized structure that permitted it to happen), and it would be a damn sight more legal than three-quarters of the activities with which the administration’s agencies occupy themselves these days.</div></div>",
  "content_text": "I’ll start off this last round in\nthe debate by pointing out that I have most certainly not claimed that\nfederal spending somehow doesn’t count as inflation.  I was simply\npointing out that the Federal Reserve’s attempt to inject money into\nthe economy has been effectively limited to one delivery vehicle because\nthe banks and households have proven to be surprisingly ineffective channels for doing so.\nAgain, Nate inadvertently shows how his refusal to accept the intrinsic relationship between credit and money renders his analysis\nincorrect.\nI very much agree that “for the\npurposes on inflation it doesn’t matter who’s spending the new\nmoney”.  And I agree that “government spending is merely the\ndelivery method for injecting it into the economy”, but what Nate\nis failing to mention here is that government spending isn’t the only, or\neven the primary, delivery method used by the Federal Reserve.  The\nsignificant thing is that government spending is the only delivery method of the\nfour the Fed has been attempting to utilize for the past five years\nthat has worked at all.  Despite the larger part of the Fed’s efforts\nbeing directed at the financial sector, that credit sector has\ncontinued to shrink.  So has the household sector despite the\nattempts to replace the housing sector bubble with an education\nbubble.  The corporate sector has responded, a little, but the $1.8\ntrillion increase since 2008 is barely more than half the contraction in\nthe financial sector.\nNate claims that prices are rising\neverywhere across the board and that it doesn’t matter where the\ngovernment spends the new money. Both assertions are incorrect.  Gold\nprices are down 24 percent since the start of the year. Home prices\nare up 1.1 percent in that same time frame, but are still down 29\npercent from their 2006 peak.  Gasoline prices are up from January,\nbut have been trending down since the spring of 2012.  And the\ninflated stock market is showing every sign of a steep, long-overdue\nprice correction.  But these are merely symptoms, and short-term\nsymptoms at that.  I see them as reflections of the credit\ndisinflation, Nate sees them as signs of incipient hyperinflation.\nOnly time will tell who was correct, so there is no point in further\nbelaboring the price issue.\nNor do I see any point in providing an\nextended explanation of why Ben Bernanke appears to be signaling an\nend to the quantitative easing program, or the significance of the\ninitial indications that Shinzo Abe’s massive attempt to print money\nin Japan is failing, because Nate took things in a rather different\ndirection with his focus on the idea that hyperinflation is a\npsychological phenomenon rather than a material one.  Those who are\ninterested can find effective summaries of those two\nnot-insignificant events on Zerohedge.  Nate wrote:\nHyperinflation is what happens when\npeople decide that the fiat money they have in their pockets and in\ntheir accounts is no longer going to be honored in the future and\nstart spending it as quickly as possible.  That is the\nunstoppable train of inflation.  The printing presses cannot be\nstopped because the people will not stop spending the money as soon\nas they get it.\nBut this perspective on hyperinflation again fails to\naccount for credit, which is how most people are spending most of\ntheir money these days. Even when literal credit cards aren’t\ninvolved, they are paying their bills with direct bank debits and\ndebit cards that draw from their credit money account. If one\nconsiders the recently reported fact that 68 percent of Americans\npossess less than $800 in savings, it should be clear that they\nsimply don’t have any fiat money in their pockets.  To quote the\nreport: “\nAfter paying debts\nand taking care of housing, car\nand child care-related expenses, the respondents said there just\nisn’t enough money left over for saving more.” Emphasis added.\nNate’s unstoppable train simply doesn’t have enough of an engine to\nleave the station, especially when the credit money that is in those\naccounts begins vanishing in the inevitable bail-ins.\nIn considering the possibility of hyperinflation versus the likelihood of deflation, it is important to do something we have not yet done in this debate, which is to examine the differences between the present situation and the most famous historical hyperinflation. As has been previously noted, in the USA, L1 total credit has remained very close to flat since 2008, increasing only 11.2 percent in five years. By contrast, in the period leading up to\nthe Weimar hyperinflation\n, the Reichsbank debt increased from 3 billion to 55 billion marks between 1914 and 1918, and to 110 billion by 1920.\n“Businessmen found it very profitable to borrow money from the bank and buy up goods, shares and companies. Their debt was wiped out within weeks by the rapid inflation, and the businessman remained holding the valuable assets he had bought. The net result was a huge “private inflation” caused by the rapid expansion of credit…. By October 1923, 1% of government income came from taxes and 99% from the creation of new money.”\nIt should be readily apparent that Weimar represented a very different scenario than the one we observe today.  We are not seeing an increase in private borrowing, but rather, a net contraction. This means the only way\nhyperinflation can even theoretically begin in the present circumstances is if\nthe Federal Reserve elects to permit the debtors in the various debt\nsectors to pay off their debts rather than encouraging them to default by raising interest rates, and uses the\ngovernment to begin electronically injecting dozens of trillions of\ndollars into the economy through the mainstream equivalent of food stamp\ncards.\nIs it possible?  Theoretically.  Is it\nimprobable. I think so, which brings this entire debate back to the\nbeginning, which is that one’s opinion on hyperinflation versus\ndeflation depends entirely on one’s belief that the Federal Reserve\nis willing and able to choose the former over the latter.  Setting\naside the fact that there are already those who believe that Bernanke\nhas followed the Depression-era Fed’s lead in choosing the latter on\nthe basis of his cryptic remarks concerning “tapering”, it is my\ncontention that the Fed is not only\nunable\nto massively inflate, but\nthat it is totally\nunwilling\nto do so.\nNate will have the last word, but since you’ve indulged his\nimagination concerning the widespread abandonment of the dollar,\nperhaps you’ll indulge mine concerning the motivations and mindset of the Federal Reserve in the present environment. Inflation and hyperinflation benefit\nborrowers. Deflation benefits lenders, as they are repaid in\nincreasingly valuable currency. Default also benefits lenders as long as the collateral backing the loan exceeds the value of the outstanding debt.\nSo, in closing, I will simply ask you one simple question: at this point in time, is the\nFederal Reserve a net borrower or a net lender?\nBy way of example, let me propose a hypothetical scenario that is perhaps a little outlandish,\nif not completely in the zone of economic science fiction. The Ciceronian\npolitical cycle predicts aristocracy, not tyranny, as the post-democratic political system. And what would be a more effective way to legally\nestablish a wealthy aristocracy with a relative minimum of societal disorder\nthan to encourage vast indebtedness, then trigger mass defaults by raising interest rates,\nwhich then results in the acquisition of title to all of the defaulted collateral?  Even the most hard core libertarian couldn’t find anything to complain about such an action; (merely the idiocy of the centralized structure that permitted it to happen), and it would be a damn sight more legal than three-quarters of the activities with which the administration’s agencies occupy themselves these days.",
  "tags": [
    "debate",
    "economics",
    "inflation"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-25T12:00:00+00:00"
}