{
  "url": "https://voxday.net/2013/06/26/inflation-vs-deflation-xii/",
  "scraped_at": "2025-12-14T22:33:21.494513",
  "title": "Inflation vs Deflation XII",
  "date_display": "June 26, 2013",
  "date_iso": "2013-06-26T17:00:00+00:00",
  "date_from_url": "2013-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nate closes out the Great Inflation Debate with <a href=\"http://bloggerblaster.blogspot.com/2013/06/the-great-debate-hangmans-body-count.html\">his final entry</a>:</p><blockquote class=\"tr_bq\"><p> So at long last we understand how hyper-inflation works.  It is caused<br> by hyper-velocity.  Meaning folks are spending their money as soon as<br> they get it.  I’m not going to go much into the differences in Weimar<br> and today… because honestly the differences are actually smaller than<br> Vox indicates.  See we have the worlds leading reserve currency.  <br> Companies and governments have enormous amounts of cash on hand ready to<br> dump.  As I showed previously… the Fed has no idea how much cash is<br> actually out there in the international market.  We know that there is<br> roughly 2 trillion in corporate cash reserves in the domestic market…<br> but we’re told its actually as much as 5 or 6 trillion in the<br> international market.. and that’s on the low end.  Kids… that isn’t<br> even counting what the governments around the world are hoarding.<br>  Remember one of the benefits of being the foremost reserve currency is<br> that oil is priced in dollars…  so to buy oil you first have to buy<br> dollars. That’s important  Its a big deal.  So there is a lot of demand<br> for dollars out there.  And a lot of dollars hoarded up.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>And thus we see that the engine is certainly sufficient to put the<br> train in motion.  In fact there is probably enough cash out there to<br> blow it to hell and gone.  No.. its not like Weimar.  Its different.<br>  Its very different.  But history doesn’t repeat.  It rhymes.</br></br></br></p><p>A common, but often ignored, phenomenon is that even during<br> hyper-inflation the central bankers think that there isn’t enough money<br> to go around.  Why?  Because I have explained it is velocity driving the<br> problem.  Not an increased supply in money.  Remember that central<br> bankers are all worshipers of John Maynard Keynes.  Damn his eyes.  So<br> they see complex economic situations as simplistic equations that can be<br> manipulated with god-like precision.  They have equations that they<br> really believe accurately can describe something as complex as an<br> economy.  To much X?  Add a little Y.  To much V?  take away some Q.  I<br> know this sounds insane… because well… it is… insane.<br>  Keynesianism is far more idiotic than you probably think it is.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I leave it to the readers to decide which case they found more convincing. Of course, time will be the only meaningful judge, as for all we know, the current state of monetary disinflation could, at least in principle, continue until the sun grows cold.  In this regard, I somewhat disagree with Nate, in that if hyperinflation doesn’t at least begin to appear by 2016, I don’t think it would be necessary for him to concede. In any event, as one reader commented, there are no winners in this debate, everyone, including Ben Bernanke and Goldman Sachs, looks to lose out in some way.  It is better to be a shopkeeper in peacetime than a king in chaos; those whose times are ignored by the historians because “nothing happened” are the fortunate ones.</p><p>It might be interesting, however, to learn if your views were modified at all as a result of the debate.  By which I mean if you were formerly inclined to expect deflation but now consider hyperinflation more likely, or vice-versa.</p><p>Nate is putting the debate into epub format which will be cleaned up a little for typos and then made available as a free ebook for future reference.</p></div>",
  "content_text": "Nate closes out the Great Inflation Debate with\nhis final entry\n:\nSo at long last we understand how hyper-inflation works.  It is caused\nby hyper-velocity.  Meaning folks are spending their money as soon as\nthey get it.  I’m not going to go much into the differences in Weimar\nand today… because honestly the differences are actually smaller than\nVox indicates.  See we have the worlds leading reserve currency.\nCompanies and governments have enormous amounts of cash on hand ready to\ndump.  As I showed previously… the Fed has no idea how much cash is\nactually out there in the international market.  We know that there is\nroughly 2 trillion in corporate cash reserves in the domestic market…\nbut we’re told its actually as much as 5 or 6 trillion in the\ninternational market.. and that’s on the low end.  Kids… that isn’t\neven counting what the governments around the world are hoarding.\nRemember one of the benefits of being the foremost reserve currency is\nthat oil is priced in dollars…  so to buy oil you first have to buy\ndollars. That’s important  Its a big deal.  So there is a lot of demand\nfor dollars out there.  And a lot of dollars hoarded up.\nAnd thus we see that the engine is certainly sufficient to put the\ntrain in motion.  In fact there is probably enough cash out there to\nblow it to hell and gone.  No.. its not like Weimar.  Its different.\nIts very different.  But history doesn’t repeat.  It rhymes.\nA common, but often ignored, phenomenon is that even during\nhyper-inflation the central bankers think that there isn’t enough money\nto go around.  Why?  Because I have explained it is velocity driving the\nproblem.  Not an increased supply in money.  Remember that central\nbankers are all worshipers of John Maynard Keynes.  Damn his eyes.  So\nthey see complex economic situations as simplistic equations that can be\nmanipulated with god-like precision.  They have equations that they\nreally believe accurately can describe something as complex as an\neconomy.  To much X?  Add a little Y.  To much V?  take away some Q.  I\nknow this sounds insane… because well… it is… insane.\nKeynesianism is far more idiotic than you probably think it is.\nI leave it to the readers to decide which case they found more convincing. Of course, time will be the only meaningful judge, as for all we know, the current state of monetary disinflation could, at least in principle, continue until the sun grows cold.  In this regard, I somewhat disagree with Nate, in that if hyperinflation doesn’t at least begin to appear by 2016, I don’t think it would be necessary for him to concede. In any event, as one reader commented, there are no winners in this debate, everyone, including Ben Bernanke and Goldman Sachs, looks to lose out in some way.  It is better to be a shopkeeper in peacetime than a king in chaos; those whose times are ignored by the historians because “nothing happened” are the fortunate ones.\nIt might be interesting, however, to learn if your views were modified at all as a result of the debate.  By which I mean if you were formerly inclined to expect deflation but now consider hyperinflation more likely, or vice-versa.\nNate is putting the debate into epub format which will be cleaned up a little for typos and then made available as a free ebook for future reference.",
  "tags": [
    "debate",
    "economics",
    "inflation"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-26T16:00:00+00:00"
}