{
  "url": "https://voxday.net/2013/06/28/it-just-keeps-getting-better/",
  "scraped_at": "2025-12-14T22:33:32.952135",
  "title": "It’s not science, but it sure looks like fiction",
  "date_display": "June 28, 2013",
  "date_iso": "2013-06-28T18:18:00+00:00",
  "date_from_url": "2013-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I’m not at all surprised that the SFWA warren is hopping madly with news of a shocking sexual harassment scandal now that it has been made clear by the SFWA owsla that it is open season on all non-crossdressing men in the organization – and at the annual gathering of angry land whales known as WisCon, no less – but even I assumed it would take more than a few weeks before the next inevitable pinkshirt scandal exploded all over the increasingly dysfunctional organization’s face.</p><p>As it happens, I <strike>may actually have met </strike>know <a href=\"http://en.wikipedia.org/wiki/Elise_Matthesen\">the woman</a> who is accusing a Tor editor of sexual harassment. <strike> If </strike>Elise Matthesen<strike> is the same the Elise I knew back in the late nineties, she</strike> was a completely useless and not terribly ornamental member of an otherwise excellent writing group in Minneapolis, she never actually did any writing, and all she wanted to do was talk about herself and babble about feminism, sexual harassment, and so forth.  And <strike>if  </strike>since it is her, I will not be at all surprised if it is eventually determined by the publishing house and the convention alike that the “harassment” was nothing more than a product of her fevered but uncreative imagination.</p><p><a href=\"http://whatever.scalzi.com/2013/06/28/reporting-harassment-at-a-convention-a-first-person-how-to/#comment-485695\">According to Ms Matthesen</a>, the gentleman who sexually harassed her was a Tor editor, albeit one of the old school Tor editors who actually published genuine science fiction once upon a time: <i>“My name is Sigrid Ellis. I was one of the co-hosts of the party Elise<br> mentions. The person Elise reported for harassment is <a href=\"http://en.wikipedia.org/wiki/James_Frenkel\">James Frenkel</a>.”</br></i></p><p>Now, I have no idea what actually happened, nor do I care in the slightest, but I have to say, I’m a little bit <strike>dubious </strike>surprised to learn that it is the Elise of my erstwhile acquaintance, not because she appears to have made a false claim of sexual harassment, (if you’d asked me about her yesterday, I’d have told you that I’d be surprised if she didn’t have dozens of them to her credit), but because the following account would make for the longest piece of fiction she has ever actually managed to write:</p><blockquote class=\"tr_bq\"><p>  “We’re geeks. We learn things and share, right? Well, this year at<br> WisCon I learned firsthand how to report sexual harassment. In case you<br> ever need or want to know, here’s what I learned and how it went.</br></br></p><p>Two editors I knew were throwing a book release party on Friday night<br> at the convention. I was there, standing around with a drink talking<br> about <i>Babylon 5,</i> the work of China Mieville, and Marxist<br> theories of labor (like you do) when an editor from a different house<br> joined the conversation briefly and decided to do the thing that I<br> reported. A minute or two after he left, one of the hosts came over to<br> check on me. I was lucky: my host was alert and aware. On hearing what<br> had happened, he gave me the name of a mandated reporter at the company<br> the harasser was representing at the convention.</br></br></br></br></br></br></br></br></p><p>The mandated reporter was respectful and professional. Even though I<br> knew them, reporting this stuff is scary, especially about someone who’s<br> been with a company for a long time, so I was really glad to be<br> listened to. Since the incident happened during Memorial Day weekend, I<br> was told Human Resources would follow up with me on Tuesday.</br></br></br></br></p><p>There was most of a convention between then and Tuesday, and I didn’t<br> like the thought of more of this nonsense (there’s a polite word for<br> it!) happening, so I went and found a convention Safety staffer. He<br> asked me right away whether I was okay and whether I wanted someone with<br> me while we talked or would rather speak privately. A friend was<br> nearby, a previous Guest of Honor at the convention, and I asked her to<br> stay for the conversation. The Safety person asked whether I’d like to<br> make a formal report. I told him, “I’d just like to tell you what<br> happened informally, I guess, while I figure out what I want to do.”</br></br></br></br></br></br></br></br></p><p>It may seem odd to hesitate to make a formal report to a convention<br> when one has just called somebody’s employer and begun the process of<br> formally reporting there, but that’s how it was. I think I was a little<br> bit in shock. (I kept shaking my head and thinking, “Dude, seriously??”)<br> So the Safety person closed his notebook and listened attentively.<br> Partway through my account, I said, “Okay, open your notebook, because<br> yeah, this should be official.” Thus began the formal report to the<br> convention. We listed what had happened, when and where, the names of<br> other people who were there when it happened, and so forth. The Safety<br> person told me he would be taking the report up to the next level,<br> checked again to see whether I was okay, and then went.</br></br></br></br></br></br></br></br></br></br></p><p>I had been nervous about doing it, even though the Safety person and<br> the friend sitting with us were people I have known for years. Sitting<br> there, I tried to imagine how nervous I would have been if I were<br> twenty-some years old and at my first convention. What if I were just<br> starting out and had been hoping to show a manuscript to that editor?<br> Would I have thought this kind of behavior was business as usual? What<br> if I were afraid that person would blacklist me if I didn’t make nice<br> and go along with it? If I had been less experienced, less surrounded by<br> people I could call on for strength and encouragement, would I have<br> been able to report it at all?</br></br></br></br></br></br></br></br></br></p><p>Well, I actually know the answer to that one: I wouldn’t have. I know<br> this because I did not report it when it happened to me in my twenties.<br> I didn’t report it when it happened to me in my forties either. There<br> are lots of reasons people might not report things, and I’m not going to<br> tell someone they’re wrong for choosing not to report. What I intend to<br> do by writing this is to give some kind of road map to someone who is<br> considering reporting. We’re geeks, right? Learning something and<br> sharing is what we do.</br></br></br></br></br></br></br></p><p>So I reported it to the convention. Somewhere in there they asked,<br> “Shall we use your name?” I thought for a millisecond and said, “Oh,<br> hell yes.”<br> This is an important thing. A formal report has a name attached. More about this later.</br></br></br></p><p>The Safety team kept checking in with me. The coordinators of the<br> convention were promptly involved. Someone told me that since it was the<br> first report, the editor would not be asked to leave the convention. I<br> was surprised it was the first report, but hey, if it was and if that’s<br> the process, follow the process. They told me they had instructed him to<br> keep away from me for the rest of the convention. I thanked them.</br></br></br></br></br></p><p>Starting on Tuesday, the HR department of his company got in touch<br> with me. They too were respectful and took the incident very seriously.<br> Again I described what, where and when, and who had been present for the<br> incident and aftermath. They asked me if I was making a formal report<br> and wanted my name used. Again I said, “Hell, yes.”</br></br></br></br></p><p>Both HR and Legal were in touch with me over the following weeks. HR<br> called and emailed enough times that my husband started calling them<br> “your good friends at HR.” They also followed through on checking with<br> the other people, and did so with a promptness that was good to see.</br></br></br></p><p>Although their behavior was professional and respectful, I was<br> stunned when I found out that mine was the first formal report filed<br/> there as well. From various discussions in person and online, I knew for<br/> certain that I was not the only one to have reported inappropriate<br/> behavior by this person to his employer. It turned out that the previous<br/> reports had been made confidentially and not through HR and Legal.<br/> Therefore my report was the first one, because it was the first one that<br/> had ever been formally recorded.</br></p><p>Corporations (and conventions with formal procedures) live and die by<br/> the written word. “Records, or it didn’t happen” is how it works, at<br/> least as far as doing anything official about it. So here I was, and<br/> here we all were, with a situation where this had definitely happened<br/> before, but which we had to treat as if it were the first time — because<br/> for formal purposes, it was.</p><p>I asked whether people who had originally made confidential reports<br/> could go ahead and file formal ones now. There was a bit of confusion<br/> around an erroneous answer by someone in another department, but then<br/> the person at Legal clearly said that “the past is past” is not an<br/> accurate summation of company policy, and that she (and all the other<br/> people listed in the company’s publically-available code of conduct)<br/> would definitely accept formal reports regardless of whether the<br/> behavior took place last week or last year.</p><p>If you choose to report, I hope this writing is useful to you. If<br/> you’re new to the genre, please be assured that sexual harassment is NOT<br/> acceptable business-as-usual. I have had numerous editors tell me that<br/> reporting harassment will NOT get you blacklisted, that they WANT the<br/> bad apples reported and dealt with, and that this is very important to<br/> them, because this kind of thing is bad for everyone and is not okay.<br/> The thing is, though, that I’m fifty-two years old, familiar with the<br/> field and the world of conventions, moderately well known to many<br/> professionals in the field, and relatively well-liked. I’ve got a lot of<br/> social credit. And yet even I was nervous and a little in shock when<br/> faced with deciding whether or not to report what happened. Even I was<br/> thinking, “Oh, God, do I have to? What if this gets really ugly?”</p><p>But every time I got that scared feeling in my guts and the sensation<br/> of having a target between my shoulder blades, I thought, “How much<br/> worse would this be if I were inexperienced, if I were new to the field,<br/> if I were a lot younger?” A thousand times worse. So I took a deep<br/> breath and squared my shoulders and said, “Hell, yes, use my name.” And<br/> while it’s scary to write this now, and while various people are worried<br/> that parts of the Internet may fall on my head, I’m going to share the<br/> knowledge — because I’m a geek, and that’s what we do.</p></blockquote><p>It should be fascinating to see just how interested the pinkshirts are in continuing their crusade, not against elderly writers and maverick outsiders, but an editor at the largest genre publisher who is married to one of the finest female SF writers.  Especially in light of the fact that his accuser is a well-known whack-job.  Which, of course, doesn’t mean she’s lying or delusional, only that she’d better be able to produce some evidence or eyewitnesses to back up her claim.</p><p>The best part is that the SFWA leadership genuinely believes that it is people like Resnick, Malzberg, and me who are the problem.  They don’t realize that they can get rid of every single non-crossdressing male who has ever published in the genre and that won’t even slow down the more radical pinkshirts, as those women are so angry, narcissistic, and delusional that they are capable of seeing racism in a stiff breeze and sexual harassment in a handshake.</p><p>If I ever went to an SF/F convention, I can only imagine the pinkshirts would no sooner catch sight of me in the distance before they’d burst into tears and start racing for the “mandated reporters” to be the first to claim that I beat them to death and abused their corpses.</p></div>",
  "content_text": "Now, I’m not at all surprised that the SFWA warren is hopping madly with news of a shocking sexual harassment scandal now that it has been made clear by the SFWA owsla that it is open season on all non-crossdressing men in the organization – and at the annual gathering of angry land whales known as WisCon, no less – but even I assumed it would take more than a few weeks before the next inevitable pinkshirt scandal exploded all over the increasingly dysfunctional organization’s face.\nAs it happens, I\nmay actually have met\nknow\nthe woman\nwho is accusing a Tor editor of sexual harassment.\nIf\nElise Matthesen\nis the same the Elise I knew back in the late nineties, she\nwas a completely useless and not terribly ornamental member of an otherwise excellent writing group in Minneapolis, she never actually did any writing, and all she wanted to do was talk about herself and babble about feminism, sexual harassment, and so forth.  And\nif\nsince it is her, I will not be at all surprised if it is eventually determined by the publishing house and the convention alike that the “harassment” was nothing more than a product of her fevered but uncreative imagination.\nAccording to Ms Matthesen\n, the gentleman who sexually harassed her was a Tor editor, albeit one of the old school Tor editors who actually published genuine science fiction once upon a time:\n“My name is Sigrid Ellis. I was one of the co-hosts of the party Elise\nmentions. The person Elise reported for harassment is\nJames Frenkel\n.”\nNow, I have no idea what actually happened, nor do I care in the slightest, but I have to say, I’m a little bit\ndubious\nsurprised to learn that it is the Elise of my erstwhile acquaintance, not because she appears to have made a false claim of sexual harassment, (if you’d asked me about her yesterday, I’d have told you that I’d be surprised if she didn’t have dozens of them to her credit), but because the following account would make for the longest piece of fiction she has ever actually managed to write:\n“We’re geeks. We learn things and share, right? Well, this year at\nWisCon I learned firsthand how to report sexual harassment. In case you\never need or want to know, here’s what I learned and how it went.\nTwo editors I knew were throwing a book release party on Friday night\nat the convention. I was there, standing around with a drink talking\nabout\nBabylon 5,\nthe work of China Mieville, and Marxist\ntheories of labor (like you do) when an editor from a different house\njoined the conversation briefly and decided to do the thing that I\nreported. A minute or two after he left, one of the hosts came over to\ncheck on me. I was lucky: my host was alert and aware. On hearing what\nhad happened, he gave me the name of a mandated reporter at the company\nthe harasser was representing at the convention.\nThe mandated reporter was respectful and professional. Even though I\nknew them, reporting this stuff is scary, especially about someone who’s\nbeen with a company for a long time, so I was really glad to be\nlistened to. Since the incident happened during Memorial Day weekend, I\nwas told Human Resources would follow up with me on Tuesday.\nThere was most of a convention between then and Tuesday, and I didn’t\nlike the thought of more of this nonsense (there’s a polite word for\nit!) happening, so I went and found a convention Safety staffer. He\nasked me right away whether I was okay and whether I wanted someone with\nme while we talked or would rather speak privately. A friend was\nnearby, a previous Guest of Honor at the convention, and I asked her to\nstay for the conversation. The Safety person asked whether I’d like to\nmake a formal report. I told him, “I’d just like to tell you what\nhappened informally, I guess, while I figure out what I want to do.”\nIt may seem odd to hesitate to make a formal report to a convention\nwhen one has just called somebody’s employer and begun the process of\nformally reporting there, but that’s how it was. I think I was a little\nbit in shock. (I kept shaking my head and thinking, “Dude, seriously??”)\nSo the Safety person closed his notebook and listened attentively.\nPartway through my account, I said, “Okay, open your notebook, because\nyeah, this should be official.” Thus began the formal report to the\nconvention. We listed what had happened, when and where, the names of\nother people who were there when it happened, and so forth. The Safety\nperson told me he would be taking the report up to the next level,\nchecked again to see whether I was okay, and then went.\nI had been nervous about doing it, even though the Safety person and\nthe friend sitting with us were people I have known for years. Sitting\nthere, I tried to imagine how nervous I would have been if I were\ntwenty-some years old and at my first convention. What if I were just\nstarting out and had been hoping to show a manuscript to that editor?\nWould I have thought this kind of behavior was business as usual? What\nif I were afraid that person would blacklist me if I didn’t make nice\nand go along with it? If I had been less experienced, less surrounded by\npeople I could call on for strength and encouragement, would I have\nbeen able to report it at all?\nWell, I actually know the answer to that one: I wouldn’t have. I know\nthis because I did not report it when it happened to me in my twenties.\nI didn’t report it when it happened to me in my forties either. There\nare lots of reasons people might not report things, and I’m not going to\ntell someone they’re wrong for choosing not to report. What I intend to\ndo by writing this is to give some kind of road map to someone who is\nconsidering reporting. We’re geeks, right? Learning something and\nsharing is what we do.\nSo I reported it to the convention. Somewhere in there they asked,\n“Shall we use your name?” I thought for a millisecond and said, “Oh,\nhell yes.”\nThis is an important thing. A formal report has a name attached. More about this later.\nThe Safety team kept checking in with me. The coordinators of the\nconvention were promptly involved. Someone told me that since it was the\nfirst report, the editor would not be asked to leave the convention. I\nwas surprised it was the first report, but hey, if it was and if that’s\nthe process, follow the process. They told me they had instructed him to\nkeep away from me for the rest of the convention. I thanked them.\nStarting on Tuesday, the HR department of his company got in touch\nwith me. They too were respectful and took the incident very seriously.\nAgain I described what, where and when, and who had been present for the\nincident and aftermath. They asked me if I was making a formal report\nand wanted my name used. Again I said, “Hell, yes.”\nBoth HR and Legal were in touch with me over the following weeks. HR\ncalled and emailed enough times that my husband started calling them\n“your good friends at HR.” They also followed through on checking with\nthe other people, and did so with a promptness that was good to see.\nAlthough their behavior was professional and respectful, I was\nstunned when I found out that mine was the first formal report filed\nthere as well. From various discussions in person and online, I knew for\ncertain that I was not the only one to have reported inappropriate\nbehavior by this person to his employer. It turned out that the previous\nreports had been made confidentially and not through HR and Legal.\nTherefore my report was the first one, because it was the first one that\nhad ever been formally recorded.\nCorporations (and conventions with formal procedures) live and die by\nthe written word. “Records, or it didn’t happen” is how it works, at\nleast as far as doing anything official about it. So here I was, and\nhere we all were, with a situation where this had definitely happened\nbefore, but which we had to treat as if it were the first time — because\nfor formal purposes, it was.\nI asked whether people who had originally made confidential reports\ncould go ahead and file formal ones now. There was a bit of confusion\naround an erroneous answer by someone in another department, but then\nthe person at Legal clearly said that “the past is past” is not an\naccurate summation of company policy, and that she (and all the other\npeople listed in the company’s publically-available code of conduct)\nwould definitely accept formal reports regardless of whether the\nbehavior took place last week or last year.\nIf you choose to report, I hope this writing is useful to you. If\nyou’re new to the genre, please be assured that sexual harassment is NOT\nacceptable business-as-usual. I have had numerous editors tell me that\nreporting harassment will NOT get you blacklisted, that they WANT the\nbad apples reported and dealt with, and that this is very important to\nthem, because this kind of thing is bad for everyone and is not okay.\nThe thing is, though, that I’m fifty-two years old, familiar with the\nfield and the world of conventions, moderately well known to many\nprofessionals in the field, and relatively well-liked. I’ve got a lot of\nsocial credit. And yet even I was nervous and a little in shock when\nfaced with deciding whether or not to report what happened. Even I was\nthinking, “Oh, God, do I have to? What if this gets really ugly?”\nBut every time I got that scared feeling in my guts and the sensation\nof having a target between my shoulder blades, I thought, “How much\nworse would this be if I were inexperienced, if I were new to the field,\nif I were a lot younger?” A thousand times worse. So I took a deep\nbreath and squared my shoulders and said, “Hell, yes, use my name.” And\nwhile it’s scary to write this now, and while various people are worried\nthat parts of the Internet may fall on my head, I’m going to share the\nknowledge — because I’m a geek, and that’s what we do.\nIt should be fascinating to see just how interested the pinkshirts are in continuing their crusade, not against elderly writers and maverick outsiders, but an editor at the largest genre publisher who is married to one of the finest female SF writers.  Especially in light of the fact that his accuser is a well-known whack-job.  Which, of course, doesn’t mean she’s lying or delusional, only that she’d better be able to produce some evidence or eyewitnesses to back up her claim.\nThe best part is that the SFWA leadership genuinely believes that it is people like Resnick, Malzberg, and me who are the problem.  They don’t realize that they can get rid of every single non-crossdressing male who has ever published in the genre and that won’t even slow down the more radical pinkshirts, as those women are so angry, narcissistic, and delusional that they are capable of seeing racism in a stiff breeze and sexual harassment in a handshake.\nIf I ever went to an SF/F convention, I can only imagine the pinkshirts would no sooner catch sight of me in the distance before they’d burst into tears and start racing for the “mandated reporters” to be the first to claim that I beat them to death and abused their corpses.",
  "tags": [
    "freakshow",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-28T17:18:00+00:00"
}