{
  "url": "https://voxday.net/2013/06/20/john-c-wright-explains-laffaire-sauvage/",
  "scraped_at": "2025-12-14T22:32:35.111049",
  "title": "John C. Wright explains l’affaire sauvage",
  "date_display": "June 20, 2013",
  "date_iso": "2013-06-20T13:00:00+00:00",
  "date_from_url": "2013-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In his philosophical explication of <a href=\"http://www.scifiwright.com/2013/06/on-politics-part-six-barbarism-oppression-tyranny/#more-8743\">the differences between the Conservative, Liberal, and Libertarian political theories</a>, Standout Author John C. Wright explains why the conflict between me and the writers presently dominating SFWA was not only inevitable, but will remain unresolvable.</p><blockquote class=\"tr_bq\"><p> The reason why political discussions between partisans of these theories<br> are so often futile is that their goals are unrelated to each other,<br> and the fears of one seem highly theoretical, if not ridiculous, to the<br> other…. Libertarian views of Liberals is one of deep seated and scathing<br> contempt. Where Libertarians are fundamentally intellectual and<br> conservatives fundamentally men of passion and honor, Liberals are<br> entirely emotional, and do not have the metaphysical or philosophical<br> groundwork needed to erect an intellectual defense of their position to<br> Libertarians, or to mount an intellectual criticism of Libertarianism.</br></br></br></br></br></br></br></br></p></blockquote><p>It’s intriguing to see how closely his observations serve well as a predictive model concerning the behavior of both myself and my critics.  I certainly tend to regard this particular set of critics with “deep seated and scathing contempt”.  And, as we have seen, the SFWA writers have not only failed to erect an intellectual defense of their position, or mount an intellectual criticism of mine, [REDACTED PENDING APPROVAL TO QUOTE FROM SFWA FORUM].  They definitely regard me as evil.</p><blockquote class=\"tr_bq\"><p> This speculation is admittedly harsh.</p><p>It would have been gentler had I been asked my opinion in the days<br> before I exchanged many, many arguments with liberals of all stripes.<br> The one thing they all have in common, and this includes Catholic<br> liberals as well as atheist liberals, male and female, young and old,<br> all of them, all of them, all I have ever met: their argument is<br> primarily emotional, and they interpret disagreement as a moral failure,<br> not just an intellectual one.</br></br></br></br></br></br></p><p>They do not think you are wrong, my dear conservative and<br> libertarians readers, they think you are evil. Not one I have met thinks<br> that there can be honest disagreement with their positions, or that the<br> matter is one where reasonable men can differ.</br></br></br></p><p>This is not due to the personality of the liberals I have met, but it<br> is due to their theory. I have had angry Catholic socialists denounce<br> me angrily as wicked for not believing his nonsense, but I have also had<br> gentle grandmotherly socialists do the same in mild tones, and sneering<br> atheist socialists utter the same denunciation in sneering tones<br> without even bother to discover what the argument is or the objections<br> are. The tone depends on the personality of the liberal, and they are as<br> different as the whole spectrum the human race affords.</br></br></br></br></br></br></br></p><p>But the the automatic imputation of vile motives and conspiracies by<br> one mass against another mass is not due to a character flaw in the<br> liberal psychology. Rather, the flaw is built into their theory. It is<br> what they have to say. They can say nothing else, since if they did,<br> they would no longer be liberals. The institutions of civilization are the enemy, since they and only they are the source of mass-oppression and inequality.</br></br></br></br></p></blockquote><p>Wright’s observations are 100 percent in line with my own considerable experience of what he describes as the Liberal. And this explains why Jamsco’s assertion about the need for inoffensive dialogue is not only wrong, but futile.  Because he only thinks about what he sees as being obviously offensive, he doesn’t recognize that it is not the sharper points of the rhetoric that offend, but rather the way in which the use of that sharper rhetoric correctly communicates to the Liberal that the non-Liberal is immune to their primary emotion-based tactics.  He’s only looking at the surface, and in doing so, he’s failing to see the more substantial forces operating beneath it.</p><p>You cannot use Aristotelian dialectic with a Liberal.  You cannot reason with him because he is not reasonable.  You cannot engage in rational discourse with him because he is not rational. To paraphrase Aristotle, you can only rhetorically flay him alive while dialectically exposing the flaws in what passes for his arguments in order to persuade undecided third parties.  And the more cruelly you flay them, the louder they shriek, and the more third parties are eventually inspired to see the difference between your reason-based arguments and the emptiness of their emotion-based non-arguments.</p><p>It would surprise – no, it would horrify – the rabbits if they had any idea how more and more people are coming over to agree with my positions as a direct result of Liberal pointing-and-shrieking combined with their total inability to make a coherent case, let alone a compelling one.  Perhaps you recall how only last year various rabbits were trumpeting the significance of how popular Whatever was and asserting that I was jealous of their Chief Rabbit’s massive blog traffic?  Less than a year later, my blogs have <strike>45</strike>53 percent more pageviews than the Chief Rabbit’s warren.</p><p>Now, Wright’s series of posts – <a href=\"http://www.scifiwright.com/2013/06/on-politics-part-one-the-metaphysics-of-politics/\">read the whole thing from the start</a> – are not about my conflict with a group of SFWA members, and yet they demonstrate that those who see that conflict as a petty writers squabble are entirely missing the point.  It is, rather, a micro-model of the great civilizational conflict that is already engulfing the entire West, whether most of those on either side realize it yet or not.</p></div>",
  "content_text": "In his philosophical explication of\nthe differences between the Conservative, Liberal, and Libertarian political theories\n, Standout Author John C. Wright explains why the conflict between me and the writers presently dominating SFWA was not only inevitable, but will remain unresolvable.\nThe reason why political discussions between partisans of these theories\nare so often futile is that their goals are unrelated to each other,\nand the fears of one seem highly theoretical, if not ridiculous, to the\nother…. Libertarian views of Liberals is one of deep seated and scathing\ncontempt. Where Libertarians are fundamentally intellectual and\nconservatives fundamentally men of passion and honor, Liberals are\nentirely emotional, and do not have the metaphysical or philosophical\ngroundwork needed to erect an intellectual defense of their position to\nLibertarians, or to mount an intellectual criticism of Libertarianism.\nIt’s intriguing to see how closely his observations serve well as a predictive model concerning the behavior of both myself and my critics.  I certainly tend to regard this particular set of critics with “deep seated and scathing contempt”.  And, as we have seen, the SFWA writers have not only failed to erect an intellectual defense of their position, or mount an intellectual criticism of mine, [REDACTED PENDING APPROVAL TO QUOTE FROM SFWA FORUM].  They definitely regard me as evil.\nThis speculation is admittedly harsh.\nIt would have been gentler had I been asked my opinion in the days\nbefore I exchanged many, many arguments with liberals of all stripes.\nThe one thing they all have in common, and this includes Catholic\nliberals as well as atheist liberals, male and female, young and old,\nall of them, all of them, all I have ever met: their argument is\nprimarily emotional, and they interpret disagreement as a moral failure,\nnot just an intellectual one.\nThey do not think you are wrong, my dear conservative and\nlibertarians readers, they think you are evil. Not one I have met thinks\nthat there can be honest disagreement with their positions, or that the\nmatter is one where reasonable men can differ.\nThis is not due to the personality of the liberals I have met, but it\nis due to their theory. I have had angry Catholic socialists denounce\nme angrily as wicked for not believing his nonsense, but I have also had\ngentle grandmotherly socialists do the same in mild tones, and sneering\natheist socialists utter the same denunciation in sneering tones\nwithout even bother to discover what the argument is or the objections\nare. The tone depends on the personality of the liberal, and they are as\ndifferent as the whole spectrum the human race affords.\nBut the the automatic imputation of vile motives and conspiracies by\none mass against another mass is not due to a character flaw in the\nliberal psychology. Rather, the flaw is built into their theory. It is\nwhat they have to say. They can say nothing else, since if they did,\nthey would no longer be liberals. The institutions of civilization are the enemy, since they and only they are the source of mass-oppression and inequality.\nWright’s observations are 100 percent in line with my own considerable experience of what he describes as the Liberal. And this explains why Jamsco’s assertion about the need for inoffensive dialogue is not only wrong, but futile.  Because he only thinks about what he sees as being obviously offensive, he doesn’t recognize that it is not the sharper points of the rhetoric that offend, but rather the way in which the use of that sharper rhetoric correctly communicates to the Liberal that the non-Liberal is immune to their primary emotion-based tactics.  He’s only looking at the surface, and in doing so, he’s failing to see the more substantial forces operating beneath it.\nYou cannot use Aristotelian dialectic with a Liberal.  You cannot reason with him because he is not reasonable.  You cannot engage in rational discourse with him because he is not rational. To paraphrase Aristotle, you can only rhetorically flay him alive while dialectically exposing the flaws in what passes for his arguments in order to persuade undecided third parties.  And the more cruelly you flay them, the louder they shriek, and the more third parties are eventually inspired to see the difference between your reason-based arguments and the emptiness of their emotion-based non-arguments.\nIt would surprise – no, it would horrify – the rabbits if they had any idea how more and more people are coming over to agree with my positions as a direct result of Liberal pointing-and-shrieking combined with their total inability to make a coherent case, let alone a compelling one.  Perhaps you recall how only last year various rabbits were trumpeting the significance of how popular Whatever was and asserting that I was jealous of their Chief Rabbit’s massive blog traffic?  Less than a year later, my blogs have\n45\n53 percent more pageviews than the Chief Rabbit’s warren.\nNow, Wright’s series of posts –\nread the whole thing from the start\n– are not about my conflict with a group of SFWA members, and yet they demonstrate that those who see that conflict as a petty writers squabble are entirely missing the point.  It is, rather, a micro-model of the great civilizational conflict that is already engulfing the entire West, whether most of those on either side realize it yet or not.",
  "tags": [
    "politics",
    "Standout Authors"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-20T12:00:00+00:00"
}