{
  "url": "https://voxday.net/2013/06/07/mailvox-shes-not-biggest-fan/",
  "scraped_at": "2025-12-14T22:31:02.839528",
  "title": "Mailvox: she’s not the biggest fan",
  "date_display": "June 7, 2013",
  "date_iso": "2013-06-07T08:00:00+00:00",
  "date_from_url": "2013-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sunny reflects on the various responses to AA, the engineering student:</p><blockquote class=\"tr_bq\"><p> Just about everyone here disgusts me. Vox, and just about all the people commenting, with the exception of a few. I happened to stumble on this blog yesterday and I have to say its one of the worst things I have ever discovered. I’ve found only one post by Vox that isn’t completely infuriating. Which was his opinion on Abortion.</p><p>Everyone is telling AA that she has to see reason. To marry and further the evolutionary cycle by having children. The world is over populated. For proof of this, please go check up on China’s policy on bearing children. Honestly, who are any of you to presume to tell anyone what to do or how to live? You’re all nothing more than a bunch of cult members flocking to Vox who has an insane world view.</p></blockquote><p>No one is telling AA she has to see reason.  She doesn’t.  She can do whatever she likes.  I don’t care what she does, in fact, I expressly pointed out that neither I nor anyone else cares what she does, says, thinks, or feels.  The point about marriage and children is that a) she will probably want them sooner or later, regardless of how she feels now, and, b) there is nothing else she can do that will be as important to species and society as bearing and raising children.</p><p>The world is not overpopulated with people like AA.  Moreover, if there is overpopulation, AA replacing herself and her eventual husband cannot possibly contribute to it.  If overpopulation is a genuine concern, then the West should stop sending food to Africa, stop intervening in Third World wars, and permit the African and Asian populations to fall back to the levels they were prior to World War II.  But China’s policy for how to deal with one billion Chinese has nothing to do with how the English should deal with 50 million English.</p><p>Overpopulation is a Third World phenomenon, not a First World one.  The entire population of Europe, the USA, and Canada is only one-seventh of the global population, therefore, if it is a problem, it is one for which the West is neither responsible nor capable of resolving without actively reducing non-Western populations.</p><p>Sunny appears to have forgotten that AA emailed me and asked me to explain myself.  I merely did as she requested and she is certainly free to ignore my advice if she chooses.</p><p>Sunny doubles down:</p><blockquote class=\"tr_bq\"><p> As I’m sure the comments are about to be spammed with his cult members<br> agreeing with him.  I’m 100% it would take me far too long to reply to<br> everyone.</br></br></p><p>I am not, in any way, telling you that you were wrong<br> in explaining yourself.  However explaining yourself does not equate to<br> to the harsh judgement you rendered. Knowing full well that your<br> followers would leap to agree with anything you said.   Absolutely no one deserves that.</br></br></br></p><p>As<br> you’ll also find, I also commented on the fact that I do not agree with<br> your beliefs.  I was not just simply leaping in to defend AA. Although<br> as I said, your treatment of her was extremely harsh.</br></br></br></p><p>I hope that<br> one day, the words you speak and your disregard for other people will<br> have consequences and you will truly see how you have erred.</br></br></p><p>Also, my point of China was not me agreeing on the methods they use. Simply pointing out that there IS overpopulation. </p></blockquote><p>Oh Sweet Sade.  My dear Sunny, perhaps you do not realize it, but my response to AA was far from harsh.  It was a delicate shower of rose petals compared to the way in which I normally respond to anklebiters and midwitted critics.  You see, I am an Award Winning Cruelty Artist.  My gentle admonishments once inspired a strong, independent, well-educated woman, in the middle of a debate with me, to run off to Nevada to become a stripper and prostitute.</p><p>The amusing thing is that you probably think I’m joking….</p><p>I do find it strange, however, that you seem to think no one deserves for me to render judgment upon them, for fear that my followers will agree with me.  Would it be truly more kind to simply smile, pat AA on her little head, and leave her to a barren life of petty material accomplishments and a lonely death?  Why do you think it is disregard to warn others they are on a self-destructive path that leads to misery?</p><p>I am entirely aware that actions have consequences.  Just last week, I lost a book contract because the publisher does not believe they have the ability to defend my inclination to speak the truth about the world as I see it.  Many people, perhaps most, prefer to dwell amidst their pretty little lies.  That is their prerogative.  But they have no right to ask me to confirm their lies and expect me to lie to them.</p><p>As for China, you are still missing the point, which is that no government policy of any government is sufficient to prove that the Earth is overpopulated.  And you also failed to understand that further suppressing white upper-middle class births will not help solve the purported overpopulation problem, for the very obvious reason that white, upper-middle class people are a very small percentage of the total global population.</p></div>",
  "content_text": "Sunny reflects on the various responses to AA, the engineering student:\nJust about everyone here disgusts me. Vox, and just about all the people commenting, with the exception of a few. I happened to stumble on this blog yesterday and I have to say its one of the worst things I have ever discovered. I’ve found only one post by Vox that isn’t completely infuriating. Which was his opinion on Abortion.\nEveryone is telling AA that she has to see reason. To marry and further the evolutionary cycle by having children. The world is over populated. For proof of this, please go check up on China’s policy on bearing children. Honestly, who are any of you to presume to tell anyone what to do or how to live? You’re all nothing more than a bunch of cult members flocking to Vox who has an insane world view.\nNo one is telling AA she has to see reason.  She doesn’t.  She can do whatever she likes.  I don’t care what she does, in fact, I expressly pointed out that neither I nor anyone else cares what she does, says, thinks, or feels.  The point about marriage and children is that a) she will probably want them sooner or later, regardless of how she feels now, and, b) there is nothing else she can do that will be as important to species and society as bearing and raising children.\nThe world is not overpopulated with people like AA.  Moreover, if there is overpopulation, AA replacing herself and her eventual husband cannot possibly contribute to it.  If overpopulation is a genuine concern, then the West should stop sending food to Africa, stop intervening in Third World wars, and permit the African and Asian populations to fall back to the levels they were prior to World War II.  But China’s policy for how to deal with one billion Chinese has nothing to do with how the English should deal with 50 million English.\nOverpopulation is a Third World phenomenon, not a First World one.  The entire population of Europe, the USA, and Canada is only one-seventh of the global population, therefore, if it is a problem, it is one for which the West is neither responsible nor capable of resolving without actively reducing non-Western populations.\nSunny appears to have forgotten that AA emailed me and asked me to explain myself.  I merely did as she requested and she is certainly free to ignore my advice if she chooses.\nSunny doubles down:\nAs I’m sure the comments are about to be spammed with his cult members\nagreeing with him.  I’m 100% it would take me far too long to reply to\neveryone.\nI am not, in any way, telling you that you were wrong\nin explaining yourself.  However explaining yourself does not equate to\nto the harsh judgement you rendered. Knowing full well that your\nfollowers would leap to agree with anything you said.   Absolutely no one deserves that.\nAs\nyou’ll also find, I also commented on the fact that I do not agree with\nyour beliefs.  I was not just simply leaping in to defend AA. Although\nas I said, your treatment of her was extremely harsh.\nI hope that\none day, the words you speak and your disregard for other people will\nhave consequences and you will truly see how you have erred.\nAlso, my point of China was not me agreeing on the methods they use. Simply pointing out that there IS overpopulation.\nOh Sweet Sade.  My dear Sunny, perhaps you do not realize it, but my response to AA was far from harsh.  It was a delicate shower of rose petals compared to the way in which I normally respond to anklebiters and midwitted critics.  You see, I am an Award Winning Cruelty Artist.  My gentle admonishments once inspired a strong, independent, well-educated woman, in the middle of a debate with me, to run off to Nevada to become a stripper and prostitute.\nThe amusing thing is that you probably think I’m joking….\nI do find it strange, however, that you seem to think no one deserves for me to render judgment upon them, for fear that my followers will agree with me.  Would it be truly more kind to simply smile, pat AA on her little head, and leave her to a barren life of petty material accomplishments and a lonely death?  Why do you think it is disregard to warn others they are on a self-destructive path that leads to misery?\nI am entirely aware that actions have consequences.  Just last week, I lost a book contract because the publisher does not believe they have the ability to defend my inclination to speak the truth about the world as I see it.  Many people, perhaps most, prefer to dwell amidst their pretty little lies.  That is their prerogative.  But they have no right to ask me to confirm their lies and expect me to lie to them.\nAs for China, you are still missing the point, which is that no government policy of any government is sufficient to prove that the Earth is overpopulated.  And you also failed to understand that further suppressing white upper-middle class births will not help solve the purported overpopulation problem, for the very obvious reason that white, upper-middle class people are a very small percentage of the total global population.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-07T07:00:00+00:00"
}