{
  "url": "https://voxday.net/2013/06/11/mailvox-clive-staples-award/",
  "scraped_at": "2025-12-14T22:31:31.330303",
  "title": "Mailvox: Clive Staples award",
  "date_display": "June 11, 2013",
  "date_iso": "2013-06-11T06:00:00+00:00",
  "date_from_url": "2013-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was under the impression that I was more likely to be nominated for<br> both the Nebula and the Hugo than for any Christian fiction award, but<br> apparently I was wrong.  I received the following email concerning the<br> Clive Staples award for Christian Speculative Fiction:</br></br></br></p><blockquote class=\"tr_bq\"><p> Greetings,</p><p>As<br> you may know, the Clive Staples Award for Christian Speculative Fiction<br> has been revived, with Speculative Faith hosting it, and one or more of<br> your books has been nominated by a reader. We’re also happy to announce<br> that the new Realm Makers writers’ conference is partnering with us to<br> announce the award winner at the Friday dinner (August 2) and to provide<br> a modest cash prize.</br></br></br></br></br></br></p><p>The CSA is entirely a readers’<br> choice award, from nominations to final selection (which means that<br> authors associated with Spec Faith or Realm Makers ARE eligible).<br> However, we are opposed to popularity-contest awards, which makes the<br> request I’m about to make a little tricky.</br></br></br></br></p><p>We need<br> readers to know about the award and their opportunity to vote, but we<br> also need to communicate the need to honor good writing, not just<br> popular authors. To achieve this, we’ve put a minimal requirement on<br> voters: they must have read at least two of the nominations. I’ve also<br> written several posts at Speculative Faith (see links below) explaining<br> the standards we want readers to use when voting.</br></br></br></br></br></br></p><p>My<br> request is that you would help your readers know about CSA and our<br> goals, their opportunity to vote, and the requirements to do so. Without<br> voters, a readers’ choice award is not possible. But to appeal to you<br> to bring in readers, risks the possibility of the award devolving to a<br> popularity contest. In reality, whether this award works depends on how<br> widely we can spread the word and how determined the readers are to vote<br> for quality stories. Whatever you can do to help achieve this would be<br> greatly appreciated!</br></br></br></br></br></br></br></br></p><p>Below is a list of the books that<br> have been nominated and the links to the Spec Faith articles about the<br> award. Congratulations on your book(s) being included! And thank you for<br> any help you can give in notifying readers about the award.</br></br></br></p></blockquote><p>I<br> believe I have been abundantly clear about my skepticism concerning<br> literary awards, but since I was asked to notify readers about the<br> award, I am doing so.  I’m not asking you to vote for <i>A Throne of Bones</i>, and I would request that anyone who is interested in <a href=\"http://www.speculativefaith.com/2013/06/10/art-and-the-clive-staples-award-continued/\">voting for any of the nominated books on the list</a><br> to please be sure to follow the voting guidelines.  I’m a little<br> surprised, to be honest, given that I’ve actually been expressly banned<br> from being nominated for at least one Christian fiction award, but<br> apparently that was a different one.</br></br></br></br></br></br></br></p></div>",
  "content_text": "I was under the impression that I was more likely to be nominated for\nboth the Nebula and the Hugo than for any Christian fiction award, but\napparently I was wrong.  I received the following email concerning the\nClive Staples award for Christian Speculative Fiction:\nGreetings,\nAs\nyou may know, the Clive Staples Award for Christian Speculative Fiction\nhas been revived, with Speculative Faith hosting it, and one or more of\nyour books has been nominated by a reader. We’re also happy to announce\nthat the new Realm Makers writers’ conference is partnering with us to\nannounce the award winner at the Friday dinner (August 2) and to provide\na modest cash prize.\nThe CSA is entirely a readers’\nchoice award, from nominations to final selection (which means that\nauthors associated with Spec Faith or Realm Makers ARE eligible).\nHowever, we are opposed to popularity-contest awards, which makes the\nrequest I’m about to make a little tricky.\nWe need\nreaders to know about the award and their opportunity to vote, but we\nalso need to communicate the need to honor good writing, not just\npopular authors. To achieve this, we’ve put a minimal requirement on\nvoters: they must have read at least two of the nominations. I’ve also\nwritten several posts at Speculative Faith (see links below) explaining\nthe standards we want readers to use when voting.\nMy\nrequest is that you would help your readers know about CSA and our\ngoals, their opportunity to vote, and the requirements to do so. Without\nvoters, a readers’ choice award is not possible. But to appeal to you\nto bring in readers, risks the possibility of the award devolving to a\npopularity contest. In reality, whether this award works depends on how\nwidely we can spread the word and how determined the readers are to vote\nfor quality stories. Whatever you can do to help achieve this would be\ngreatly appreciated!\nBelow is a list of the books that\nhave been nominated and the links to the Spec Faith articles about the\naward. Congratulations on your book(s) being included! And thank you for\nany help you can give in notifying readers about the award.\nI\nbelieve I have been abundantly clear about my skepticism concerning\nliterary awards, but since I was asked to notify readers about the\naward, I am doing so.  I’m not asking you to vote for\nA Throne of Bones\n, and I would request that anyone who is interested in\nvoting for any of the nominated books on the list\nto please be sure to follow the voting guidelines.  I’m a little\nsurprised, to be honest, given that I’ve actually been expressly banned\nfrom being nominated for at least one Christian fiction award, but\napparently that was a different one.",
  "tags": [
    "books",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-11T05:00:00+00:00"
}