{
  "url": "https://voxday.net/2013/06/14/mailvox-sincere-apology_14/",
  "scraped_at": "2025-12-14T22:31:53.071052",
  "title": "Mailvox: a sincere apology",
  "date_display": "June 14, 2013",
  "date_iso": "2013-06-14T06:00:00+00:00",
  "date_from_url": "2013-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It seems I have inadvertently caused offense, for which I am indeed deeply sorry.  Remo hopped onto the keyboard and <a href=\"http://alphagameplan.blogspot.com/2013/06/when-women-play-sex-card.html\">took me to task</a>:</p><blockquote class=\"tr_bq\"><p> As a Sonoran desert toad, I find the labeling of Ms. Hayden as a<br> “grotesque toad” offensive.  I quote the good Sir Thomas Browne: “I<br> cannot tell by what logic we call a toad, a bear, or an elephant ugly;<br> they being created in those outward shapes and figures which best<br> express the actions of their inward frames; and having passed that<br> general visitation of God, who saw that all that he had made was good.”<br> -Sir Thomas Browne, 1642.</br></br></br></br></br></br></p><p>I would point out that<br> licking *me*<br> brings on a state of euphoria and a series of pleasant<br> hallucinations, while licking Ms. Nielson would cause spastic<br> uncontrolled vomiting and give you herpes.  Please be more sensitive in<br> your use of the word “toad” in the future.  As you can see here our<br> couplings are *FAR* less offensive looking than Ms. Nielson’s.</br></br></br></br></br></br></p><p>*Ribbit*</p></blockquote><p>I sincerely apologize to Remo, all Sonoran desert<br> toads, and indeed, the families Bufonidae, Bombinatoridae,<br> Discoglossidae, Pelobatidae, Rhinophrynidae, Scaphiopodidae, and<br> Microhylidae for any offense I have caused.  I deeply regret my<br> thoughtless, hurtful remarks, and in the future, will be sure to avoid<br> any further invidious and unflattering comparisons.</br></br></br></br></br></p></div>",
  "content_text": "It seems I have inadvertently caused offense, for which I am indeed deeply sorry.  Remo hopped onto the keyboard and\ntook me to task\n:\nAs a Sonoran desert toad, I find the labeling of Ms. Hayden as a\n“grotesque toad” offensive.  I quote the good Sir Thomas Browne: “I\ncannot tell by what logic we call a toad, a bear, or an elephant ugly;\nthey being created in those outward shapes and figures which best\nexpress the actions of their inward frames; and having passed that\ngeneral visitation of God, who saw that all that he had made was good.”\n-Sir Thomas Browne, 1642.\nI would point out that\nlicking *me*\nbrings on a state of euphoria and a series of pleasant\nhallucinations, while licking Ms. Nielson would cause spastic\nuncontrolled vomiting and give you herpes.  Please be more sensitive in\nyour use of the word “toad” in the future.  As you can see here our\ncouplings are *FAR* less offensive looking than Ms. Nielson’s.\n*Ribbit*\nI sincerely apologize to Remo, all Sonoran desert\ntoads, and indeed, the families Bufonidae, Bombinatoridae,\nDiscoglossidae, Pelobatidae, Rhinophrynidae, Scaphiopodidae, and\nMicrohylidae for any offense I have caused.  I deeply regret my\nthoughtless, hurtful remarks, and in the future, will be sure to avoid\nany further invidious and unflattering comparisons.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-14T05:00:00+00:00"
}