{
  "url": "https://voxday.net/2013/06/19/mailvox-time-preferences-and/",
  "scraped_at": "2025-12-14T22:32:29.920035",
  "title": "Mailvox: time-preferences and civilization",
  "date_display": "June 19, 2013",
  "date_iso": "2013-06-19T13:00:00+00:00",
  "date_from_url": "2013-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JC is is wondering at the intrinsically anti-scientific bent of the SFWA:</p><blockquote class=\"tr_bq\"><div> I’m a white, Christian, American male of slightly above average<br> intelligence – but far from a super intelligence.  I’ve been ejoying<br> your writings since the WND days.  Since you left them, and I was forced<br> to discover and follow your Vox Popoli blog – my mind has been quite<br> blown away by the content.  I eagerly digest (or attempt to follow) the<br> economic posts, and love the cultural posts.  The science fiction<br> generally doesn’t interest me, but this latest uproar re: SWFA makes me<br> sick.  I just wanted to drop a note of thanks and support.  Between you<br> and Ann Barnhardt, I truly feel blessed to be able to see the examples<br> you set in steadfastly standing for Truth.</br></br></br></br></br></br></br></br></br></div><div></div><div> Thank you.</div><div></div><div> Now for a question.  I may have missed it, but your “h8ers” seem to<br> imply you’ve conferred a superior/inferior distinction to the various<br> human sub-species.  I don’t recall seeing anything of the sort, I<br> thought you just noted that they are provably different.   I<br> would personally assume that different groups should have nothing<br> approaching “equality” for quite a number of characteristics, in general<br> from a statistical perspective.  An overall ranking of<br> “superior/inferior” doesn’t seem like it would make any sense at all<br> unless we are discussing specific characteristics.  For instance, a<br> Jimmy the Greek foul in discussing fast twitch muscle fiber and athletic<br> performance, or perhaps predisposition to certain hereditary medical<br> conditions.  Or demonstrated contributions to advanced science.  </br></br></br></br></br></br></br></br></br></br></br></div><div></div><div> There’s nothing in my mind that would necessarily judge one of<br> God’s children as better/worse from an overall intrinsic value sense<br> simply by noting a particular subspecies (or intermingling thereof, such<br> as with my mixed heritage children), but it’s absurd to say we can’t<br> talk about relative comparisons of discrete characteristics.  I’ve<br> wandered a bit here, but I assure you I’m no rabbit or troll.  I guess<br> my question was about the conclusions drawn from the variations in<br> subspecies:  you never made any claims that the homo sapiens sapiens are<br> just dirty pieces of shit with no worth, as your critics seem to be<br> claiming, right?  I don’t know how you put up with these clowns without<br> having their insanity rub off on you just a little bit.</br></br></br></br></br></br></br></br></br></br></div></blockquote><p>I have repeatedly stated that it is absolutely meaningless to claim general superiority or inferiority for any of the various human subspecies, (or, if you prefer, genetically distinct population groups), because it completely depends upon the specific metric involved.  Is a Great Dane superior to a Siberian Husky?  Is a bluebird superior to an eagle?  It all depends upon what the basis for comparison is.</p><p>Now, the reason that the SFWA pinkshirts are upset is because if one chooses the metric of “civilized”, by which I mean “the ability to participate in, maintain, and build a complex, technologically advanced civilization”, one can both observe and explain which subspecies are more and less capable of it than others, and therefore it is possible to claim that Group X is superior to Group Y on that particular basis.  As it happens, that particular ability is largely predicated on time-preferences, as longer time-preferences are required in order to a) practice self-discipline, and, b) build wealth, which are two of the primary prerequisites for maintaining and building civilizations.</p><p>One can even go so far as to say that the civilizational process, which I observe appears to take around 1,000 years on average, is largely the result of artificially selecting for individuals with longer time-preferences.  If a society regularly gets rid of its short-preferenced, hot-tempered predators and its non-savers, it will eventually find that it has built up considerable wealth as well as a population capable of cooperating and living together in relative peace.  And with cooperation and wealth, a society has the wherewithal to begin advancing technologically so long as it has entrepreneurs and elects to foster them rather than crush them in the interest of established parties.</p><p>Having shorter time preferences doesn’t make anyone “dirty pieces of shit with no worth”, any more than being physically shorter does, it simply makes them human beings with the same intrinsic human value as everyone else who happen to be less able to participate in, maintain, or build an advanced civilization.  The pure savage lives entirely in the moment and does not control his impulses. The entirely civilized individual is self-disciplined and is always capable of putting off for tomorrow, or next year, options that are available today.  This may explain why Christianity tends to be a civilizing force, as it reinforces longer time preferences by extending them beyond one’s lifetime, and why atheism, despite the higher-than-average intelligence of atheists, tends to be a barbarising force. Intelligence, while not entirely irrelevant, is somewhat of a red herring in this discussion.</p><p>The idea that there are meaningfully different time-preferences between genetically distinct population groups is a testable scientific hypothesis, although aside from some very small-scale studies on children, “the Stanford marshmallow experiment”, I am not aware of any studies that have been done in this regard.  In order for it to be useful, I would recommend a study with randomly selected adults, (corrected for income and debt), who would be offered a choice between receiving $200 in cash immediately and a check for a randomly selected amount between $250 and $1,000 in a randomly determined period of time ranging from three months to one year.  A second study would then test the ranges of the time preferences of the various population groups based on the information from the first study, and a third would test children to see if the range of their time preferences were consistent with the adult ranges.</p><p>Perhaps the hypothesis that pure homo sapiens sapiens have shorter time preferences than the various homo sapiens-homo neanderthalensis blends would hold up, or perhaps not.  But that is the primary purpose of science, to formulate and test hypotheses.  It is, I think, more than a little ironic that so many self-professed “science fiction” writers are not only horrified by a scientific perspective, but are openly and avowedly anti-science whenever science threatens to upend their cherished ideological beliefs.</p><p>Anyhow, it is because the entire concept of a racial supremacist is intrinsically nonsensical that I occasionally describe myself as an “Esquimaux supremacist”.  Having grown up in Minnesota, and having lived through more than a few bitterly cold Minnesota winters, I have a particular appreciation for the obvious and undeniable superiority of that noble people of the north.</p></div>",
  "content_text": "JC is is wondering at the intrinsically anti-scientific bent of the SFWA:\nI’m a white, Christian, American male of slightly above average\nintelligence – but far from a super intelligence.  I’ve been ejoying\nyour writings since the WND days.  Since you left them, and I was forced\nto discover and follow your Vox Popoli blog – my mind has been quite\nblown away by the content.  I eagerly digest (or attempt to follow) the\neconomic posts, and love the cultural posts.  The science fiction\ngenerally doesn’t interest me, but this latest uproar re: SWFA makes me\nsick.  I just wanted to drop a note of thanks and support.  Between you\nand Ann Barnhardt, I truly feel blessed to be able to see the examples\nyou set in steadfastly standing for Truth.\nThank you.\nNow for a question.  I may have missed it, but your “h8ers” seem to\nimply you’ve conferred a superior/inferior distinction to the various\nhuman sub-species.  I don’t recall seeing anything of the sort, I\nthought you just noted that they are provably different.   I\nwould personally assume that different groups should have nothing\napproaching “equality” for quite a number of characteristics, in general\nfrom a statistical perspective.  An overall ranking of\n“superior/inferior” doesn’t seem like it would make any sense at all\nunless we are discussing specific characteristics.  For instance, a\nJimmy the Greek foul in discussing fast twitch muscle fiber and athletic\nperformance, or perhaps predisposition to certain hereditary medical\nconditions.  Or demonstrated contributions to advanced science.\nThere’s nothing in my mind that would necessarily judge one of\nGod’s children as better/worse from an overall intrinsic value sense\nsimply by noting a particular subspecies (or intermingling thereof, such\nas with my mixed heritage children), but it’s absurd to say we can’t\ntalk about relative comparisons of discrete characteristics.  I’ve\nwandered a bit here, but I assure you I’m no rabbit or troll.  I guess\nmy question was about the conclusions drawn from the variations in\nsubspecies:  you never made any claims that the homo sapiens sapiens are\njust dirty pieces of shit with no worth, as your critics seem to be\nclaiming, right?  I don’t know how you put up with these clowns without\nhaving their insanity rub off on you just a little bit.\nI have repeatedly stated that it is absolutely meaningless to claim general superiority or inferiority for any of the various human subspecies, (or, if you prefer, genetically distinct population groups), because it completely depends upon the specific metric involved.  Is a Great Dane superior to a Siberian Husky?  Is a bluebird superior to an eagle?  It all depends upon what the basis for comparison is.\nNow, the reason that the SFWA pinkshirts are upset is because if one chooses the metric of “civilized”, by which I mean “the ability to participate in, maintain, and build a complex, technologically advanced civilization”, one can both observe and explain which subspecies are more and less capable of it than others, and therefore it is possible to claim that Group X is superior to Group Y on that particular basis.  As it happens, that particular ability is largely predicated on time-preferences, as longer time-preferences are required in order to a) practice self-discipline, and, b) build wealth, which are two of the primary prerequisites for maintaining and building civilizations.\nOne can even go so far as to say that the civilizational process, which I observe appears to take around 1,000 years on average, is largely the result of artificially selecting for individuals with longer time-preferences.  If a society regularly gets rid of its short-preferenced, hot-tempered predators and its non-savers, it will eventually find that it has built up considerable wealth as well as a population capable of cooperating and living together in relative peace.  And with cooperation and wealth, a society has the wherewithal to begin advancing technologically so long as it has entrepreneurs and elects to foster them rather than crush them in the interest of established parties.\nHaving shorter time preferences doesn’t make anyone “dirty pieces of shit with no worth”, any more than being physically shorter does, it simply makes them human beings with the same intrinsic human value as everyone else who happen to be less able to participate in, maintain, or build an advanced civilization.  The pure savage lives entirely in the moment and does not control his impulses. The entirely civilized individual is self-disciplined and is always capable of putting off for tomorrow, or next year, options that are available today.  This may explain why Christianity tends to be a civilizing force, as it reinforces longer time preferences by extending them beyond one’s lifetime, and why atheism, despite the higher-than-average intelligence of atheists, tends to be a barbarising force. Intelligence, while not entirely irrelevant, is somewhat of a red herring in this discussion.\nThe idea that there are meaningfully different time-preferences between genetically distinct population groups is a testable scientific hypothesis, although aside from some very small-scale studies on children, “the Stanford marshmallow experiment”, I am not aware of any studies that have been done in this regard.  In order for it to be useful, I would recommend a study with randomly selected adults, (corrected for income and debt), who would be offered a choice between receiving $200 in cash immediately and a check for a randomly selected amount between $250 and $1,000 in a randomly determined period of time ranging from three months to one year.  A second study would then test the ranges of the time preferences of the various population groups based on the information from the first study, and a third would test children to see if the range of their time preferences were consistent with the adult ranges.\nPerhaps the hypothesis that pure homo sapiens sapiens have shorter time preferences than the various homo sapiens-homo neanderthalensis blends would hold up, or perhaps not.  But that is the primary purpose of science, to formulate and test hypotheses.  It is, I think, more than a little ironic that so many self-professed “science fiction” writers are not only horrified by a scientific perspective, but are openly and avowedly anti-science whenever science threatens to upend their cherished ideological beliefs.\nAnyhow, it is because the entire concept of a racial supremacist is intrinsically nonsensical that I occasionally describe myself as an “Esquimaux supremacist”.  Having grown up in Minnesota, and having lived through more than a few bitterly cold Minnesota winters, I have a particular appreciation for the obvious and undeniable superiority of that noble people of the north.",
  "tags": [
    "mailvox",
    "science",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-19T12:00:00+00:00"
}