{
  "url": "https://voxday.net/2013/06/16/mailvox-lessons-of-history/",
  "scraped_at": "2025-12-14T22:32:11.038940",
  "title": "Mailvox: the lessons of history",
  "date_display": "June 16, 2013",
  "date_iso": "2013-06-16T21:00:00+00:00",
  "date_from_url": "2013-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JD demonstrates that one of the benefits of aging is that one has the ability to look back and determine who was, and who was not, correct:</p><blockquote class=\"tr_bq\"><p> At college in 1980, my Government Studies prof also served as Secretary<br> of the Socialist Workers Party of Minnesota (the real one, not the DFL).<br> We clashed over Robert Mugabe, just coming to power in Zimbabwe, he<br> asserting it spelled salvation and I, that it spelled ruin.</br></br></br></p><p>I<br> e-mailed him a year or two ago, asking if I could get a retroactive<br> grade increase since my predictions had proven more accurate than his.<br> His explanation was that he truly believed Mugabe was an agrarian<br> reformer whose program of taking land from Whites to give to Blacks<br> would benefit the country; but things just hadn’t worked out as hoped.</br></br></br></br></br></p><p>I<br> didn’t bother to send him the famous Heinlein quote about Bad Luck. And<br> I didn’t really expect the grade change.  But it certainly was<br> satisfying to say “I told you so” 30 years later.</br></br></br></p></blockquote><p>I doubt it will take until 2043 for “anti-racists” and those who are blinded by rage at the suggestion that not all human populations are equally civilized to ruefully explain that they truly believed that Africans were every bit as capable of maintaining and sustaining advanced technological civilizations as Europeans.</p><p>The question is: how many human beings will have to die by starvation and mass slaughter in America, Africa, and Europe before they consider the possibility that they might be wrong?  Based on how long it took the same sort of people to begin considering that perhaps communism was not, in fact, capable of economically outperforming capitalism, my estimate would be around 250 million.</p><p>It is an interesting question to direct towards my critics, though.  Is there any number of deaths caused by starvation and mass slaughter in a five-year period as a result of the structural breakdown of society in one or more countries that would convince you to at least consider my time-to-civilization hypothesis?  If so, how many?</p></div>",
  "content_text": "JD demonstrates that one of the benefits of aging is that one has the ability to look back and determine who was, and who was not, correct:\nAt college in 1980, my Government Studies prof also served as Secretary\nof the Socialist Workers Party of Minnesota (the real one, not the DFL).\nWe clashed over Robert Mugabe, just coming to power in Zimbabwe, he\nasserting it spelled salvation and I, that it spelled ruin.\nI\ne-mailed him a year or two ago, asking if I could get a retroactive\ngrade increase since my predictions had proven more accurate than his.\nHis explanation was that he truly believed Mugabe was an agrarian\nreformer whose program of taking land from Whites to give to Blacks\nwould benefit the country; but things just hadn’t worked out as hoped.\nI\ndidn’t bother to send him the famous Heinlein quote about Bad Luck. And\nI didn’t really expect the grade change.  But it certainly was\nsatisfying to say “I told you so” 30 years later.\nI doubt it will take until 2043 for “anti-racists” and those who are blinded by rage at the suggestion that not all human populations are equally civilized to ruefully explain that they truly believed that Africans were every bit as capable of maintaining and sustaining advanced technological civilizations as Europeans.\nThe question is: how many human beings will have to die by starvation and mass slaughter in America, Africa, and Europe before they consider the possibility that they might be wrong?  Based on how long it took the same sort of people to begin considering that perhaps communism was not, in fact, capable of economically outperforming capitalism, my estimate would be around 250 million.\nIt is an interesting question to direct towards my critics, though.  Is there any number of deaths caused by starvation and mass slaughter in a five-year period as a result of the structural breakdown of society in one or more countries that would convince you to at least consider my time-to-civilization hypothesis?  If so, how many?",
  "tags": [
    "mailvox",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-16T20:00:00+00:00"
}