{
  "url": "https://voxday.net/2013/06/05/mailvox-writing-back-to-young-female/",
  "scraped_at": "2025-12-14T22:30:57.346214",
  "title": "Mailvox: writing back to a young female engineer",
  "date_display": "June 5, 2013",
  "date_iso": "2013-06-05T23:29:00+00:00",
  "date_from_url": "2013-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AA inquires concerning some inexplicable views that she finds both contradictory and insulting:</p><blockquote class=\"tr_bq\"><p> Dear Sir,</p><p>I don’t think you’ll answer me, or read my message… But this is worth a try. I will try very hard to keep polite about all this. It will be difficult, but I’ll try.</p><p>See, I’m a young woman. I’m currently 20 years old and a student in environmental engineering in one of the best engineering schools in the world. I got in fair and square. I didn’t get a special grant for being female or any favors. I have to work my butt off to get good grades in fluid mechanics, calculus, environmental chemistry…</p><p>I have had the opportunity to read some of the posts you’ve written in your blog and I feel very insulted by them. What happened to you that made your brain go this wrong? How can you claim that women’s rights are wrong? You defend forbidding abortion by claiming unborn children of rape merit all “the legal protections and rights afforded all other human beings”, yet claim that women shouldn’t have those same rights because we “ruin everything”?</p><p>I am working hard to be an engineer. My goal in life isn’t to get married or to stay at home and take care of the children. I am not here on this planet to serve a man and raise his children. I have my own goals and my own motivations.</p><p>I would continue, but I have finals to prepare and I’ve lost enough of my time on you already.</p><p>I would wish you a nice day, but it would be a lie.</p></blockquote><p>Dear AA,</p><p>First of all, as a young woman studying engineering, you have very<br> likely been granted special favors whether you know it or not.  All<br> those programs designed to encourage young women like you to pursue a<br> career in engineering exist for a reason.  And the reason is that most<br> women just don’t enjoy engineering the way men do.  You’re obviously<br> smart, you can do the schoolwork, but it is unlikely that you will want<br> to do the real thing for very long.  Assuming you don’t drop out in<br> favor of an easier discipline before you graduate, the probabilities indicate that you won’t spend much time actually working as an engineer; you’ll<br> soon be moved into some sort of management or marketing position. <br> Whether you have been told as much or not, that is the conventional path<br> for smart, educated women like you in the corporate world.</br></br></br></br></br></br></br></br></br></br></p><p>There is no shame in that.  I started out in engineering myself.  I had<br> the ability, but not the aptitude, and quickly switched to a field I<br> vastly preferred.  If you’re smart enough, you’ll likely figure that out<br> before long. Whatever you do, don’t waste your life doing something you<br> don’t really enjoy simply because you are capable of doing it. <br> Remember that actual engineering is very, very different than studying<br> engineering, and being very good at the latter is not necessarily<br> indicative of real interest in the former.</br></br></br></br></br></br></br></p><p>Now I’m going to teach you a hard, but very important lesson.  You see, I<br> don’t care you how feel.  I really don’t.  More importantly, neither<br> does anyone else.  Only about 200 people on a planet of 7 billion<br> actually care about your feelings, and that’s if you’re lucky.  The<br> sooner you grasp this lesson, the better off you will be.  And since<br> almost no one gives a damn what you do, say, think, or feel, appealing<br> to your feelings when you encounter differences of opinion is not only<br> illogical, but useless.</br></br></br></br></br></br></br></p><p>What happened to me to make my brain go this wrong?  The short answer is: living life with my eyes open.  Keep in mind<br> that I’m more intelligent than you are.  The fact that you can’t<br> understand the way I think doesn’t make my brain wrong, it merely means<br> you aren’t keeping up.  But more important is the fact that I’m<br> considerably more experienced than you are.  I’ve had three decades to<br> observe the differences between all those school lessons about valuing<br> equality, diversity, and vibrancy and the way human beings actually<br> behave.  Equality is a myth; it doesn’t exist anymore than fairies and<br> unicorns do.  As for women’s rights, well, a young woman as intelligent<br> as you should be able to handle the math that dictates what happens to a<br> society when an insufficient number of young women marry and have<br> children.  Since women’s rights are very strongly correlated with<br> demographic decline, they are not sustainable and are, in fact,<br> societally deleterious.  They are not so much wrong as fatal when viewed<br> from the macro perspective.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>I do believe women should have the same legal rights and protections<br> afforded to unborn children.  There is no contradiction there.  You see,<br> I don’t believe that unborn children should be given the right to vote<br> or permitted to murder other unborn children either.</br></br></br></p><p>I understand you have your own goals.  That’s fine. The problem is that<br> women are not only valuable to society, they are invaluable.  They are<br> necessary. The one and only thing both society and the human race<br> actually need from you is for you to marry and raise children.  If<br> you’re not going to do that, then it really doesn’t matter if you’re<br> going to become a human resources manager with an engineering degree or<br> drop out of school and become a stripper.  If you’re only  going to do<br> what any man of similar capabilities can do, then you are an<br> evolutionary dead end and as unimportant to society as the average man<br> is.</br></br></br></br></br></br></br></br></br></p><p>In the entire history of the human race, the actions of a few thousand men have actually made much of a difference one way or the other.  If that. But without women deciding to marry and have children, the species would die out.  Do you really want to limit yourself to the same sort of irrelevance as the average man?</p><p>Another thing you have no reason to know is that young women are<br> reliably bad at foreseeing what they will want to do in the near<br> future.  I graduated with a number of women like you.  None of them<br> thought they were interested in marriage and children until they were<br> about 27.  Then they suddenly changed their minds and some of them were<br> very upset that they had spent the previous ten years pursuing goals<br> that were now unimportant to them.  I even wrote a column about it<br> called Spiting Their Pretty Faces back in 2003, you can google it. <br> Think about 2003.  You were ten.  Are your goals the same now as they<br> were then?  If not, then how can you be certain that your goals, and<br> your opinion about marriage and children, will be the same when you are<br> 30?</br></br></br></br></br></br></br></br></br></br></br></p><p>In any event, I wish you good fortune regardless of what path you eventually choose.</p><p>Regards, etc.<br> Vox</br></p></div>",
  "content_text": "AA inquires concerning some inexplicable views that she finds both contradictory and insulting:\nDear Sir,\nI don’t think you’ll answer me, or read my message… But this is worth a try. I will try very hard to keep polite about all this. It will be difficult, but I’ll try.\nSee, I’m a young woman. I’m currently 20 years old and a student in environmental engineering in one of the best engineering schools in the world. I got in fair and square. I didn’t get a special grant for being female or any favors. I have to work my butt off to get good grades in fluid mechanics, calculus, environmental chemistry…\nI have had the opportunity to read some of the posts you’ve written in your blog and I feel very insulted by them. What happened to you that made your brain go this wrong? How can you claim that women’s rights are wrong? You defend forbidding abortion by claiming unborn children of rape merit all “the legal protections and rights afforded all other human beings”, yet claim that women shouldn’t have those same rights because we “ruin everything”?\nI am working hard to be an engineer. My goal in life isn’t to get married or to stay at home and take care of the children. I am not here on this planet to serve a man and raise his children. I have my own goals and my own motivations.\nI would continue, but I have finals to prepare and I’ve lost enough of my time on you already.\nI would wish you a nice day, but it would be a lie.\nDear AA,\nFirst of all, as a young woman studying engineering, you have very\nlikely been granted special favors whether you know it or not.  All\nthose programs designed to encourage young women like you to pursue a\ncareer in engineering exist for a reason.  And the reason is that most\nwomen just don’t enjoy engineering the way men do.  You’re obviously\nsmart, you can do the schoolwork, but it is unlikely that you will want\nto do the real thing for very long.  Assuming you don’t drop out in\nfavor of an easier discipline before you graduate, the probabilities indicate that you won’t spend much time actually working as an engineer; you’ll\nsoon be moved into some sort of management or marketing position.\nWhether you have been told as much or not, that is the conventional path\nfor smart, educated women like you in the corporate world.\nThere is no shame in that.  I started out in engineering myself.  I had\nthe ability, but not the aptitude, and quickly switched to a field I\nvastly preferred.  If you’re smart enough, you’ll likely figure that out\nbefore long. Whatever you do, don’t waste your life doing something you\ndon’t really enjoy simply because you are capable of doing it.\nRemember that actual engineering is very, very different than studying\nengineering, and being very good at the latter is not necessarily\nindicative of real interest in the former.\nNow I’m going to teach you a hard, but very important lesson.  You see, I\ndon’t care you how feel.  I really don’t.  More importantly, neither\ndoes anyone else.  Only about 200 people on a planet of 7 billion\nactually care about your feelings, and that’s if you’re lucky.  The\nsooner you grasp this lesson, the better off you will be.  And since\nalmost no one gives a damn what you do, say, think, or feel, appealing\nto your feelings when you encounter differences of opinion is not only\nillogical, but useless.\nWhat happened to me to make my brain go this wrong?  The short answer is: living life with my eyes open.  Keep in mind\nthat I’m more intelligent than you are.  The fact that you can’t\nunderstand the way I think doesn’t make my brain wrong, it merely means\nyou aren’t keeping up.  But more important is the fact that I’m\nconsiderably more experienced than you are.  I’ve had three decades to\nobserve the differences between all those school lessons about valuing\nequality, diversity, and vibrancy and the way human beings actually\nbehave.  Equality is a myth; it doesn’t exist anymore than fairies and\nunicorns do.  As for women’s rights, well, a young woman as intelligent\nas you should be able to handle the math that dictates what happens to a\nsociety when an insufficient number of young women marry and have\nchildren.  Since women’s rights are very strongly correlated with\ndemographic decline, they are not sustainable and are, in fact,\nsocietally deleterious.  They are not so much wrong as fatal when viewed\nfrom the macro perspective.\nI do believe women should have the same legal rights and protections\nafforded to unborn children.  There is no contradiction there.  You see,\nI don’t believe that unborn children should be given the right to vote\nor permitted to murder other unborn children either.\nI understand you have your own goals.  That’s fine. The problem is that\nwomen are not only valuable to society, they are invaluable.  They are\nnecessary. The one and only thing both society and the human race\nactually need from you is for you to marry and raise children.  If\nyou’re not going to do that, then it really doesn’t matter if you’re\ngoing to become a human resources manager with an engineering degree or\ndrop out of school and become a stripper.  If you’re only  going to do\nwhat any man of similar capabilities can do, then you are an\nevolutionary dead end and as unimportant to society as the average man\nis.\nIn the entire history of the human race, the actions of a few thousand men have actually made much of a difference one way or the other.  If that. But without women deciding to marry and have children, the species would die out.  Do you really want to limit yourself to the same sort of irrelevance as the average man?\nAnother thing you have no reason to know is that young women are\nreliably bad at foreseeing what they will want to do in the near\nfuture.  I graduated with a number of women like you.  None of them\nthought they were interested in marriage and children until they were\nabout 27.  Then they suddenly changed their minds and some of them were\nvery upset that they had spent the previous ten years pursuing goals\nthat were now unimportant to them.  I even wrote a column about it\ncalled Spiting Their Pretty Faces back in 2003, you can google it.\nThink about 2003.  You were ten.  Are your goals the same now as they\nwere then?  If not, then how can you be certain that your goals, and\nyour opinion about marriage and children, will be the same when you are\n30?\nIn any event, I wish you good fortune regardless of what path you eventually choose.\nRegards, etc.\nVox",
  "tags": [
    "education",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-05T22:29:00+00:00"
}