{
  "url": "https://voxday.net/2013/06/27/not-exactly-best-and-brightes/",
  "scraped_at": "2025-12-14T22:33:22.950803",
  "title": "Not exactly the best and brightest",
  "date_display": "June 27, 2013",
  "date_iso": "2013-06-27T09:03:00+00:00",
  "date_from_url": "2013-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The linked article on <a href=\"http://junctrebellion.wordpress.com/2012/08/12/how-the-american-university-was-killed-in-five-easy-steps/\">the destruction of the American university</a> was mildly interesting, mostly for its complete wrongheadedness about what parties have been responsible for the drastic decline in higher education, but the discussion in the comments were considerably better, as one tenured PhD schooled an untenured one. In doing so, he illustrated that at least part of the problem is an intellectually-challenged higher education faculty that simply does not understand economics and supports the very immigration that has rendered them permanently poor.</p><p>The amazing thing is that these maleducated wretches are STILL spouting Marxist nonsense, blaming the conservatives they hate instead of the progressive elite responsible, and failing to realize that a modicum of basic Adam Smith is all that is necessary to understand why their expensive degrees are almost completely worthless and why their employment prospects are so dim:</p><blockquote class=\"tr_bq\"><p> There seems to be a highly questionable premise running throughout<br> the discussion on this blog — that people have ever been able to make a<br> decent liviing working as adjuncts, or that they will ever be able to do<br> so in the future.  Given the economics of the situation, and the<br> enormous hurdles to unionizing or organizing in any meaningful way, the<br> primary goal should be to reestablish a greater number of full-time<br> positions.  The harsh economic reality is that most community colleges<br> will probably never be able to pay adjuncts enough to make a living, and<br> most decent four-year colleges will not pay adjuncts a decent wage<br> because they don’t have to.</br></br></br></br></br></br></br></br></br></p><p>A fundamental problem for adjuncts, especially in professional fields<br> like law, business, engineering and communications (but also in many<br> other fields), is that decent colleges have an almost endless supply of<br> people willing to teach for non-economic reasons.  My university<br> generally pays adjuncts $2,000-3,000 per course (depending on the field)<br> and basically hasn’t raised adjunct pay in at least 15 years.  Some<br> other local colleges pay even less than we do.  It’s embarrassing and<br> shameful.  Yet we have a queue of people ready and willing to teach<br> courses for us.  Many of them are retired and looking to stay active<br> intellectually; some are successful professionals wanting to “give back”<br> to their alma mater; still others are wanting to add a brownie point to<br> their resume by being associated with a university.  Virtually no one<br> does it for the money.  This is not a new phenomenon.  Almost thirty<br> years ago, when I was a businessman and taught as an adjunct, I<br> considered my adjunct teaching at the University of Hawaii to be a<br> public service, and I donated the money (about $2,500 a course, even<br> then, as I recall) back to the university for student scholarships.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Somewhere along the line, some people got the idea that one could<br> make a living teaching as an adjunct.  I don’t think that’s realistic.<br> In fact, it will probably become increasingly unrealistic, given the<br> education model that many universities are exploring (video and internet<br> lectures in which “master” professors will teach thousands of students<br> in basic courses, leaving more time for full-time faculty to teach<br> upper-division and graduate courses and to conduct research).  So my<br> advice to people who can’t get a full-time teaching job is to get some<br> other full-time job, outside of academe.  In the meantime, I would<br> highly encourage them to moonlight as adjuncts and continue their<br> efforts to organize or unionize if they feel that’s the best solution.<br> But I think a far smarter strategy would be to focus on restoring<br> full-time positions that would pay a living wage.</br></br></br></br></br></br></br></br></br></br></br></br></p><p> <i>I believe your analysis of the situation has some validity.  There<br> are many people who will adjunct for little or no remuneration.  But<br> higher education institutions are not charity organizations. </br></br></i></p><p><i>Personally, I spent several years to get a Ph.D. and expected to find<br> full-time work, but it hasn’t happened, and I am indigent.  For seven<br> years I worked as a prison guard and caseworker to make ends meet (and<br> actually attain a middle-class lifestyle).  Why should I make 60K (with<br> benefits) as a prison worker but only expect 16K as a community college<br> teacher at three schools? </br></br></br></br></br></i></p><p><i><br> </br></i><i>I know other administrators who feel the same as you do yet go along<br> with the exploitation of labor and the taking of surplus value.  You<br> know in your heart that you are complicit in the slow unraveling of<br> higher education in the US.</br></br></br></i></p><p>Some questions for you:</p><p>*  Why would anyone possibly think that getting a certain degree<br> automatically entitles them to a certain kind of job?  (Tell that to the<br> hundreds of thousands of students who are have graduated in recent<br> years who are unemployed or underemployed. )</br></br></br></p><p>*  How oblivious would one have to be to spend years working on a PhD<br> without understanding what the job prospects were for that degree?</br></p><p>*  What kind of self-delusion and self-entitlement would it take for a<br> person to think that just because they spent years doing a certain thing<br> that the world somehow owes them a living wage for doing that thing?<br> (Every human being on earth would love to get paid well for doing<br> something they love.  But not many of us are so naïve that we think we<br> are good enough to make a living wage playing basketball, playing golf<br> or taking travel photographs – my preferred occupations. )</br></br></br></br></br></br></p><p>*  How could anyone who has spent time in the academy not understand<br> that good colleges and universities are, in numerous respects,<br> charitable organizations?  (Benefactors give billions of dollars to<br> higher education, just like other kinds of charities.  Hundreds of<br> thousands of people volunteer their time and money to colleges as guest<br> speakers, sponsors, advisors, fundraisers, etc., just like other kinds<br> of charities.  And thousands of people like me give up lucrative<br> professional careers to teach – while most of our former colleagues are<br/> getting rich and retiring early – because we believe that education is<br/> something worth devoting/donating our time and energy to, even though we<br/> receive pay that is far below what we could earn in our previous jobs.)</br></br></br></br></br></br></br></p><p>*  Why should adjunct college professors be exempt from the laws of<br/> supply and demand, while almost everyone else in the country is bound by<br/> them?   (If you are so unhappy with the laws of supply and demand in<br/> the U.S., why don’t you just move to a communist country where such laws<br/> don’t apply so much?)</p><p>*  Where were you (or others like you) 30 years ago, when I was raising<br/> hell about the inappropriate formation of an adjunct/non-tenure-track<br/> underclass?  (There was a real opportunity to address the problem then,<br/> before it became the intractable problem that it is today.)</p><p>*  Where were you (and others like you) when I stood up in an<br/> all-faculty meeting, with virtually no support from my faculty<br/> colleagues, and told the president of my university that he needed to<br/> resign because the central administration’s incompetence and greed were<br/> destroying the finances and educational integrity of my university?</p><p>*  Where were you (and others like you) when I was giving speeches and<br/> writing academic articles and a book on the dangers of treating<br/> universities like businesses instead of like educational organizations?</p><p>*  What are you doing now (besides whining), while I am engaging the<br/> trustees and central administration of my university in an attempt to<br/> pressure them into getting rid of the silly business model that they are<br/> using to run the university, which treats adjuncts as nothing more than<br/> a cheap source of labor?</p><p>*  Why should I continue to care about the plight of adjuncts like you,<br/> when you blame innocent people for your own problems, when you refuse to<br/> listen to basic facts and logic, and when you insult the very people<br/> who are probably the best hope for solving the problem?</p><p>In no way, shape or form am I complicit in unraveling higher<br/> education, as you so incorrectly suggested.   Nor do I know in my heart<br/> that I am guilty of any such thing, as you so dishonestly stated in your<br/> posting.  My job is not to ensure that you have a job.  And I cannot<br/> help you at all, if you are too thick-headed to act in your own best<br/> interest by first understanding the problem and accepting responsibility<br/> for your role in helping to create the problem in the first place.</p></blockquote><div class=\"reply\"></div><p>One doesn’t have to be in denial about the dire state of American higher education to fail to feel any sympathy for the entitled, badly educated, would-be education professionals who have not only helped sow the seeds of their own indebted servitude, but still actively serve as intellectual shock troops and recruiters for the very system that oppresses them.</p><p>They also don’t seem to understand that all the social spending on the elderly, the vibrant, and the foreign they support means that there is little remaining for the liberal arts that the aspirational middle class used to proudly fund.  The same people that previously had no objection to paying for government-funded orchestras and theatres now resist being taxed to pay for the diversification of their schools and neighborhoods.</p><p>Furthermore, a graduate student with inside access notes that the tenured faculty absolutely bears considerable responsibility for the academic decline:</p><blockquote class=\"tr_bq\"><p> I’m currently a graduate student and a staff person at a major<br/> college. I have the dubious honor of sitting in and taking notes during<br/> the faculty meetings of one department. Our faculty have, at every<br/> budget crunch opportunity, cut the funding for graduate students,<br/> student activities, and part-time instructors. Our faculty bemoan their<br/> salaries to any and every ear, but given a single whisper of power<br/> behave as cruelly as any member of the relative 1% and abuse, exploit,<br/> and exhaust the students.</p><p>College has been destroyed by the abuse of tenure. The faculty are<br/> the 1%, the students and part-timers are the 99%. The Administration ARE<br/> former faculty.<br/> Our faculty are the -sole- source of the corruption, laziness, and<br/> weakness of the department. They are each required to teach 2 courses a<br/> semester and each of them asks for a ‘course buy out’ on the<br/> justification their research is more important than students. Of 24<br/> Professors, 11 are currently teaching. While our university has courses<br/> with 500 students, our part-time instructors, the abused 3rd class, or<br/> our graduate students teach those sections. Our professors select<br/> ’boutique’ courses, some of which enroll 5 students (undergraduate<br/> courses with course caps of 55, but only 5 interested students because<br/> the class is irrelevant to the major but interesting to the professor).<br/> When professors buyout courses they ‘pay’ from their salary or a grant<br/> approximately $4000. It costs our department over $11000 to reassign the<br/> course (I do the budget). Our faculty declare tenure is end-all-be-all.</p><p>Tenure committees value research and publication, not teaching,<br/> therefore so do our professors. They publish drek that goes straight to<br/> archive, get tenure, and sit on their title for another 30 years. They<br/> are not assets and are barely intellectuals. When we recently had a vote<br/> in my department on whether to fund graduate student scholarships or<br/> faculty travel, travel won in a vote of 2:22.</p><p>The administration, which is so denigrated, and rightfully so, in<br/> this article is in fact made of up of former professors. My Dean is an<br/> English PhD. He has pulled half of our TA and GA positions, leaving our<br/> students without funding and forcing those who want to continue their<br/> education into massive debt. He simply increased the minimum number of<br/> students the other TAs had to teach (for the same amount of money). He<br/> hired over 70 new faculty with the money ‘saved.’</p><p>Our Associate Dean in charge of curriculum is a Chemistry PhD who<br/> taught for 20 years. He personally made the announcement, taking public<br/> credit for the idea, to no longer require fine arts or foreign language<br/> credits for undergraduates. This decision resulted in a huge reduction<br/> of registrations and effectively killed our German, Russian, French,<br/> Italian, Mandarin, and foreign literature programs. Without<br/> undergraduate classes to teach, the graduate program is disappearing<br/> too.</p></blockquote><p>Of course, it hardly comes as a surprise to anyone with a university degree to be informed that most tenured academics are narrow-minded, self-centered bastards.</p></div>",
  "content_text": "The linked article on\nthe destruction of the American university\nwas mildly interesting, mostly for its complete wrongheadedness about what parties have been responsible for the drastic decline in higher education, but the discussion in the comments were considerably better, as one tenured PhD schooled an untenured one. In doing so, he illustrated that at least part of the problem is an intellectually-challenged higher education faculty that simply does not understand economics and supports the very immigration that has rendered them permanently poor.\nThe amazing thing is that these maleducated wretches are STILL spouting Marxist nonsense, blaming the conservatives they hate instead of the progressive elite responsible, and failing to realize that a modicum of basic Adam Smith is all that is necessary to understand why their expensive degrees are almost completely worthless and why their employment prospects are so dim:\nThere seems to be a highly questionable premise running throughout\nthe discussion on this blog — that people have ever been able to make a\ndecent liviing working as adjuncts, or that they will ever be able to do\nso in the future.  Given the economics of the situation, and the\nenormous hurdles to unionizing or organizing in any meaningful way, the\nprimary goal should be to reestablish a greater number of full-time\npositions.  The harsh economic reality is that most community colleges\nwill probably never be able to pay adjuncts enough to make a living, and\nmost decent four-year colleges will not pay adjuncts a decent wage\nbecause they don’t have to.\nA fundamental problem for adjuncts, especially in professional fields\nlike law, business, engineering and communications (but also in many\nother fields), is that decent colleges have an almost endless supply of\npeople willing to teach for non-economic reasons.  My university\ngenerally pays adjuncts $2,000-3,000 per course (depending on the field)\nand basically hasn’t raised adjunct pay in at least 15 years.  Some\nother local colleges pay even less than we do.  It’s embarrassing and\nshameful.  Yet we have a queue of people ready and willing to teach\ncourses for us.  Many of them are retired and looking to stay active\nintellectually; some are successful professionals wanting to “give back”\nto their alma mater; still others are wanting to add a brownie point to\ntheir resume by being associated with a university.  Virtually no one\ndoes it for the money.  This is not a new phenomenon.  Almost thirty\nyears ago, when I was a businessman and taught as an adjunct, I\nconsidered my adjunct teaching at the University of Hawaii to be a\npublic service, and I donated the money (about $2,500 a course, even\nthen, as I recall) back to the university for student scholarships.\nSomewhere along the line, some people got the idea that one could\nmake a living teaching as an adjunct.  I don’t think that’s realistic.\nIn fact, it will probably become increasingly unrealistic, given the\neducation model that many universities are exploring (video and internet\nlectures in which “master” professors will teach thousands of students\nin basic courses, leaving more time for full-time faculty to teach\nupper-division and graduate courses and to conduct research).  So my\nadvice to people who can’t get a full-time teaching job is to get some\nother full-time job, outside of academe.  In the meantime, I would\nhighly encourage them to moonlight as adjuncts and continue their\nefforts to organize or unionize if they feel that’s the best solution.\nBut I think a far smarter strategy would be to focus on restoring\nfull-time positions that would pay a living wage.\nI believe your analysis of the situation has some validity.  There\nare many people who will adjunct for little or no remuneration.  But\nhigher education institutions are not charity organizations.\nPersonally, I spent several years to get a Ph.D. and expected to find\nfull-time work, but it hasn’t happened, and I am indigent.  For seven\nyears I worked as a prison guard and caseworker to make ends meet (and\nactually attain a middle-class lifestyle).  Why should I make 60K (with\nbenefits) as a prison worker but only expect 16K as a community college\nteacher at three schools?\nI know other administrators who feel the same as you do yet go along\nwith the exploitation of labor and the taking of surplus value.  You\nknow in your heart that you are complicit in the slow unraveling of\nhigher education in the US.\nSome questions for you:\n*  Why would anyone possibly think that getting a certain degree\nautomatically entitles them to a certain kind of job?  (Tell that to the\nhundreds of thousands of students who are have graduated in recent\nyears who are unemployed or underemployed. )\n*  How oblivious would one have to be to spend years working on a PhD\nwithout understanding what the job prospects were for that degree?\n*  What kind of self-delusion and self-entitlement would it take for a\nperson to think that just because they spent years doing a certain thing\nthat the world somehow owes them a living wage for doing that thing?\n(Every human being on earth would love to get paid well for doing\nsomething they love.  But not many of us are so naïve that we think we\nare good enough to make a living wage playing basketball, playing golf\nor taking travel photographs – my preferred occupations. )\n*  How could anyone who has spent time in the academy not understand\nthat good colleges and universities are, in numerous respects,\ncharitable organizations?  (Benefactors give billions of dollars to\nhigher education, just like other kinds of charities.  Hundreds of\nthousands of people volunteer their time and money to colleges as guest\nspeakers, sponsors, advisors, fundraisers, etc., just like other kinds\nof charities.  And thousands of people like me give up lucrative\nprofessional careers to teach – while most of our former colleagues are\ngetting rich and retiring early – because we believe that education is\nsomething worth devoting/donating our time and energy to, even though we\nreceive pay that is far below what we could earn in our previous jobs.)\n*  Why should adjunct college professors be exempt from the laws of\nsupply and demand, while almost everyone else in the country is bound by\nthem?   (If you are so unhappy with the laws of supply and demand in\nthe U.S., why don’t you just move to a communist country where such laws\ndon’t apply so much?)\n*  Where were you (or others like you) 30 years ago, when I was raising\nhell about the inappropriate formation of an adjunct/non-tenure-track\nunderclass?  (There was a real opportunity to address the problem then,\nbefore it became the intractable problem that it is today.)\n*  Where were you (and others like you) when I stood up in an\nall-faculty meeting, with virtually no support from my faculty\ncolleagues, and told the president of my university that he needed to\nresign because the central administration’s incompetence and greed were\ndestroying the finances and educational integrity of my university?\n*  Where were you (and others like you) when I was giving speeches and\nwriting academic articles and a book on the dangers of treating\nuniversities like businesses instead of like educational organizations?\n*  What are you doing now (besides whining), while I am engaging the\ntrustees and central administration of my university in an attempt to\npressure them into getting rid of the silly business model that they are\nusing to run the university, which treats adjuncts as nothing more than\na cheap source of labor?\n*  Why should I continue to care about the plight of adjuncts like you,\nwhen you blame innocent people for your own problems, when you refuse to\nlisten to basic facts and logic, and when you insult the very people\nwho are probably the best hope for solving the problem?\nIn no way, shape or form am I complicit in unraveling higher\neducation, as you so incorrectly suggested.   Nor do I know in my heart\nthat I am guilty of any such thing, as you so dishonestly stated in your\nposting.  My job is not to ensure that you have a job.  And I cannot\nhelp you at all, if you are too thick-headed to act in your own best\ninterest by first understanding the problem and accepting responsibility\nfor your role in helping to create the problem in the first place.\nOne doesn’t have to be in denial about the dire state of American higher education to fail to feel any sympathy for the entitled, badly educated, would-be education professionals who have not only helped sow the seeds of their own indebted servitude, but still actively serve as intellectual shock troops and recruiters for the very system that oppresses them.\nThey also don’t seem to understand that all the social spending on the elderly, the vibrant, and the foreign they support means that there is little remaining for the liberal arts that the aspirational middle class used to proudly fund.  The same people that previously had no objection to paying for government-funded orchestras and theatres now resist being taxed to pay for the diversification of their schools and neighborhoods.\nFurthermore, a graduate student with inside access notes that the tenured faculty absolutely bears considerable responsibility for the academic decline:\nI’m currently a graduate student and a staff person at a major\ncollege. I have the dubious honor of sitting in and taking notes during\nthe faculty meetings of one department. Our faculty have, at every\nbudget crunch opportunity, cut the funding for graduate students,\nstudent activities, and part-time instructors. Our faculty bemoan their\nsalaries to any and every ear, but given a single whisper of power\nbehave as cruelly as any member of the relative 1% and abuse, exploit,\nand exhaust the students.\nCollege has been destroyed by the abuse of tenure. The faculty are\nthe 1%, the students and part-timers are the 99%. The Administration ARE\nformer faculty.\nOur faculty are the -sole- source of the corruption, laziness, and\nweakness of the department. They are each required to teach 2 courses a\nsemester and each of them asks for a ‘course buy out’ on the\njustification their research is more important than students. Of 24\nProfessors, 11 are currently teaching. While our university has courses\nwith 500 students, our part-time instructors, the abused 3rd class, or\nour graduate students teach those sections. Our professors select\n’boutique’ courses, some of which enroll 5 students (undergraduate\ncourses with course caps of 55, but only 5 interested students because\nthe class is irrelevant to the major but interesting to the professor).\nWhen professors buyout courses they ‘pay’ from their salary or a grant\napproximately $4000. It costs our department over $11000 to reassign the\ncourse (I do the budget). Our faculty declare tenure is end-all-be-all.\nTenure committees value research and publication, not teaching,\ntherefore so do our professors. They publish drek that goes straight to\narchive, get tenure, and sit on their title for another 30 years. They\nare not assets and are barely intellectuals. When we recently had a vote\nin my department on whether to fund graduate student scholarships or\nfaculty travel, travel won in a vote of 2:22.\nThe administration, which is so denigrated, and rightfully so, in\nthis article is in fact made of up of former professors. My Dean is an\nEnglish PhD. He has pulled half of our TA and GA positions, leaving our\nstudents without funding and forcing those who want to continue their\neducation into massive debt. He simply increased the minimum number of\nstudents the other TAs had to teach (for the same amount of money). He\nhired over 70 new faculty with the money ‘saved.’\nOur Associate Dean in charge of curriculum is a Chemistry PhD who\ntaught for 20 years. He personally made the announcement, taking public\ncredit for the idea, to no longer require fine arts or foreign language\ncredits for undergraduates. This decision resulted in a huge reduction\nof registrations and effectively killed our German, Russian, French,\nItalian, Mandarin, and foreign literature programs. Without\nundergraduate classes to teach, the graduate program is disappearing\ntoo.\nOf course, it hardly comes as a surprise to anyone with a university degree to be informed that most tenured academics are narrow-minded, self-centered bastards.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-27T08:03:00+00:00"
}