{
  "url": "https://voxday.net/2013/06/18/nsa-whistleblowers-back-snowden/",
  "scraped_at": "2025-12-14T22:32:24.411846",
  "title": "NSA whistleblowers back Snowden",
  "date_display": "June 18, 2013",
  "date_iso": "2013-06-18T20:00:00+00:00",
  "date_from_url": "2013-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>More importantly, they note that <a href=\"http://www.theatlantic.com/politics/archive/2013/06/3-former-nsa-employees-praise-edward-snowden-corroborate-key-claims/276964/\">his approach was more successful</a> than theirs:</p><blockquote class=\"tr_bq\"><p> <i>USA Today</i> has published an extraordinary interview with three<br> former NSA employees who praise Edward Snowden’s leaks, corroborate some<br> of his claims, and warn about unlawful government acts….</br></br></p><p>In other words, they blew the whistle in the way Snowden’s critics suggest he should have done. Their<br> method didn’t get through to the members of Congress who are saying, in<br> the wake of the Snowden leak, that they had no idea what was going on.<br> But they are nonetheless owed thanks.<br> And among them, they’ve now said all of the following:</br></br></br></br></p><ul><li>His disclosures did not cause grave damage to national security.</li></ul><ul><li>What Snowden discovered is “material evidence of an institutional crime.”</li></ul><ul><li>As<br> a system administrator, Snowden “could go on the network or go into any<br> file or any system and<br> change it or add to it or whatever, just to make sure — because he<br> would<br> be responsible to get it back up and running if, in fact, it failed. So<br> that meant he had access to go in and put anything. That’s why he<br> said, I think, ‘I can even target the president or a judge.’ If he knew<br> their phone numbers or attributes, he could insert them into the target<br> list which would be distributed worldwide. And then it would be<br> collected, yeah, that’s right. As a super-user, he could do that.”</br></br></br></br></br></br></br></br></br></br></li></ul><ul><li>“The idea that we have robust checks and balances on this is a myth.”</li></ul><ul><li>Congressional overseers “have no real way of seeing into what these agencies are doing. They are<br> totally dependent on the agencies briefing them on programs, telling<br> them what they are doing.”</br></br></li></ul><ul><li>Lawmakers “don’t really don’t understand what the NSA does and how it<br> operates. Even when they get briefings, they still don’t understand.”</br></li></ul><ul><li>Asked<br> what Edward Snowden should expect to happen to him, one of the men,<br> William Binney, answered, “first tortured, then maybe even rendered and<br> tortured and then incarcerated and then tried and incarcerated or even<br> executed.” Interesting that this is what a whistleblower thinks the U.S.<br> government will do to a citizen. The abuse of Bradley Manning worked.</br></br></br></br></br></li></ul><ul><li>“There is no path for intelligence-community whistle-blowers who know<br> wrong is being done. There is none. It’s a toss of the coin, and the<br> odds are you are going to be hammered.”</br></br></li></ul></blockquote><p>What a tremendous surprise to learn that the government isn’t telling the truth about Snowdon and his revelations!</p></div>",
  "content_text": "More importantly, they note that\nhis approach was more successful\nthan theirs:\nUSA Today\nhas published an extraordinary interview with three\nformer NSA employees who praise Edward Snowden’s leaks, corroborate some\nof his claims, and warn about unlawful government acts….\nIn other words, they blew the whistle in the way Snowden’s critics suggest he should have done. Their\nmethod didn’t get through to the members of Congress who are saying, in\nthe wake of the Snowden leak, that they had no idea what was going on.\nBut they are nonetheless owed thanks.\nAnd among them, they’ve now said all of the following:\nHis disclosures did not cause grave damage to national security.\nWhat Snowden discovered is “material evidence of an institutional crime.”\nAs\na system administrator, Snowden “could go on the network or go into any\nfile or any system and\nchange it or add to it or whatever, just to make sure — because he\nwould\nbe responsible to get it back up and running if, in fact, it failed. So\nthat meant he had access to go in and put anything. That’s why he\nsaid, I think, ‘I can even target the president or a judge.’ If he knew\ntheir phone numbers or attributes, he could insert them into the target\nlist which would be distributed worldwide. And then it would be\ncollected, yeah, that’s right. As a super-user, he could do that.”\n“The idea that we have robust checks and balances on this is a myth.”\nCongressional overseers “have no real way of seeing into what these agencies are doing. They are\ntotally dependent on the agencies briefing them on programs, telling\nthem what they are doing.”\nLawmakers “don’t really don’t understand what the NSA does and how it\noperates. Even when they get briefings, they still don’t understand.”\nAsked\nwhat Edward Snowden should expect to happen to him, one of the men,\nWilliam Binney, answered, “first tortured, then maybe even rendered and\ntortured and then incarcerated and then tried and incarcerated or even\nexecuted.” Interesting that this is what a whistleblower thinks the U.S.\ngovernment will do to a citizen. The abuse of Bradley Manning worked.\n“There is no path for intelligence-community whistle-blowers who know\nwrong is being done. There is none. It’s a toss of the coin, and the\nodds are you are going to be hammered.”\nWhat a tremendous surprise to learn that the government isn’t telling the truth about Snowdon and his revelations!",
  "tags": [
    "corpocracy",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-18T19:00:00+00:00"
}