{
  "url": "https://voxday.net/2013/06/08/playing-in-sandbox/",
  "scraped_at": "2025-12-14T22:31:15.111204",
  "title": "Playing in the sandbox",
  "date_display": "June 8, 2013",
  "date_iso": "2013-06-08T19:00:00+00:00",
  "date_from_url": "2013-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Digital Book World mentioned, we will be publishing both original fiction and previously published work through our in-game retail store.  Unfortunately, the piece didn’t happen to mention that the system is not theoretical, but is already fully operational; the author bought a copy of <i>The Wardog’s Coin</i> with game coins we’d given him and received an epub on his system in less than two seconds.</p><p>We’re open to anything that is likely to appeal to our player base.  But we’re particularly interested in extending the world of Selenoth with the help of talented and creative writers.  Think Thieves World, only with 500 years of history on an entire continent in which to play.  The stories should range between 1,500 words at a minimum and 12,500 maximum; stories that somehow involve a gladiatorial angle will be given particular consideration.  And, of course, they will have to avoid conflicting with canon in any serious manner; I would encourage those interested to focus on small, localized conflicts and to keep in mind that First Sword is set more than 100 years before the events that take place in <i>A Throne of Bones</i>.</p><p>We haven’t worked out the contractual arrangements yet, but most likely we will give the author the choice between a conventional short fiction arrangement at SFWA-defined professional rate of 5¢/word and a 25 percent royalty share of the revenues derived from sales of the piece.</p><p>We’ll put out information on selling already published novels and short fiction unrelated to Selenoth in the near future.  We’ve already heard from several publishers and authors; so please keep in mind that we want to go out with a catalog of about 50 ebooks, and 10 of the spots are already filled.  In general, we’re interested in action-oriented fantasy, military science fiction, and the sort of SF/F in which the major genre publishers are presently uninterested.</p><p>Anyhow, if this is of interest to you, let me know.  We’ve already got two original stories we’ll be publishing through the game, one dealing with the trolls, and another with the mer.</p></div>",
  "content_text": "As Digital Book World mentioned, we will be publishing both original fiction and previously published work through our in-game retail store.  Unfortunately, the piece didn’t happen to mention that the system is not theoretical, but is already fully operational; the author bought a copy of\nThe Wardog’s Coin\nwith game coins we’d given him and received an epub on his system in less than two seconds.\nWe’re open to anything that is likely to appeal to our player base.  But we’re particularly interested in extending the world of Selenoth with the help of talented and creative writers.  Think Thieves World, only with 500 years of history on an entire continent in which to play.  The stories should range between 1,500 words at a minimum and 12,500 maximum; stories that somehow involve a gladiatorial angle will be given particular consideration.  And, of course, they will have to avoid conflicting with canon in any serious manner; I would encourage those interested to focus on small, localized conflicts and to keep in mind that First Sword is set more than 100 years before the events that take place in\nA Throne of Bones\n.\nWe haven’t worked out the contractual arrangements yet, but most likely we will give the author the choice between a conventional short fiction arrangement at SFWA-defined professional rate of 5¢/word and a 25 percent royalty share of the revenues derived from sales of the piece.\nWe’ll put out information on selling already published novels and short fiction unrelated to Selenoth in the near future.  We’ve already heard from several publishers and authors; so please keep in mind that we want to go out with a catalog of about 50 ebooks, and 10 of the spots are already filled.  In general, we’re interested in action-oriented fantasy, military science fiction, and the sort of SF/F in which the major genre publishers are presently uninterested.\nAnyhow, if this is of interest to you, let me know.  We’ve already got two original stories we’ll be publishing through the game, one dealing with the trolls, and another with the mer.",
  "tags": [
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-08T18:00:00+00:00"
}