{
  "url": "https://voxday.net/2013/06/24/post-christian-pagan-reviva/",
  "scraped_at": "2025-12-14T22:33:06.039914",
  "title": "Post-Christian pagan revival",
  "date_display": "June 24, 2013",
  "date_iso": "2013-06-24T17:00:00+00:00",
  "date_from_url": "2013-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall that a pan-European pagan revival was something I predicted a few years ago ago.  Secularism is not an option because it has nothing to offer philosophically or spiritually; that’s precisely why the humanists are always producing manifestos as well as books attempting to explain why it is possible for someone to square a circle even though no one has managed it yet.  This <a href=\"http://homelands.org/worlds/hellenes.html\">petty Greek paganism</a> is insignificant today, but if they are successful in marrying it to the powerful nationalist revival represented by Golden Dawn, it could prove surprisingly popular.</p><blockquote class=\"tr_bq\"><p> In the last few years, though, some have come to<br> distrust  that prism, and to say so in public. While Church membership<br> is  still extremely high (more than 95% of all Greeks are at least<br> nominally Orthodox) and the leadership is  still highly involved in<br> state affairs, there has been a resurgence of popular interest in the pre-Christian<br> past. With it has come a small explosion of pagan groups, philosophical<br> societies,  Spartan schools, “Hellenist” magazines and<br> performances  of classical theater….</br></br></br></br></br></br></br></p><p>One of the most visible facets of the revivalist movement has<br> been  the campaign for recognition for the Dodecatheon, or “Religion<br> of the Twelve Gods.” The campaign has hardly been successful: polytheists have twice applied to the<br> Greek religion ministry for official status, and twice they have<br> been ignored. Coverage of the movement in the popular press has<br> not been flattering. (The word many Greeks use when asked about<br> the pagans is “funny.”) But the movement has been attracting attention. </br></br></br></br></br></br></p></blockquote><p>Paganism looks funny from the perspective of the post-Christian, who has the benefit of more than a thousand years of Christian civilization.  It’s not quite so funny if you happen to be sufficiently well-educated about historical paganism; there is a reason why “the Dark Ages” historically refers to the time before the coming of Jesus Christ, The Light of the World.</p><p>(The so-called “Enlightenment”, like all Satanic inspirations, is nothing more than a cheap and perverted knock-off of the original concept.)</p><p>In any event, the history of the 20th century should demonstrate that pagan nationalists, particularly those with pan-European ambitions, are no laughing matter.</p></div>",
  "content_text": "You may recall that a pan-European pagan revival was something I predicted a few years ago ago.  Secularism is not an option because it has nothing to offer philosophically or spiritually; that’s precisely why the humanists are always producing manifestos as well as books attempting to explain why it is possible for someone to square a circle even though no one has managed it yet.  This\npetty Greek paganism\nis insignificant today, but if they are successful in marrying it to the powerful nationalist revival represented by Golden Dawn, it could prove surprisingly popular.\nIn the last few years, though, some have come to\ndistrust  that prism, and to say so in public. While Church membership\nis  still extremely high (more than 95% of all Greeks are at least\nnominally Orthodox) and the leadership is  still highly involved in\nstate affairs, there has been a resurgence of popular interest in the pre-Christian\npast. With it has come a small explosion of pagan groups, philosophical\nsocieties,  Spartan schools, “Hellenist” magazines and\nperformances  of classical theater….\nOne of the most visible facets of the revivalist movement has\nbeen  the campaign for recognition for the Dodecatheon, or “Religion\nof the Twelve Gods.” The campaign has hardly been successful: polytheists have twice applied to the\nGreek religion ministry for official status, and twice they have\nbeen ignored. Coverage of the movement in the popular press has\nnot been flattering. (The word many Greeks use when asked about\nthe pagans is “funny.”) But the movement has been attracting attention.\nPaganism looks funny from the perspective of the post-Christian, who has the benefit of more than a thousand years of Christian civilization.  It’s not quite so funny if you happen to be sufficiently well-educated about historical paganism; there is a reason why “the Dark Ages” historically refers to the time before the coming of Jesus Christ, The Light of the World.\n(The so-called “Enlightenment”, like all Satanic inspirations, is nothing more than a cheap and perverted knock-off of the original concept.)\nIn any event, the history of the 20th century should demonstrate that pagan nationalists, particularly those with pan-European ambitions, are no laughing matter.",
  "tags": [
    "Christianity",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-24T16:00:00+00:00"
}