{
  "url": "https://voxday.net/2013/06/20/prelude/",
  "scraped_at": "2025-12-14T22:32:33.251062",
  "title": "Prelude",
  "date_display": "June 20, 2013",
  "date_iso": "2013-06-20T08:41:00+00:00",
  "date_from_url": "2013-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even the historically illiterate, stunted intellectuals of Red America are beginning to observe <a href=\"http://www.nytimes.com/2013/06/20/opinion/blow-a-nation-divided-against-itself.html?hp&amp;_r=0\">the signs of the eventual breakup</a>.</p><blockquote class=\"tr_bq\"><p> Along with — and because of — dramatic social and demographic changes,<br> America is quickly dividing itself into two separate nations, regional<br> enclaves of rigid politics, as the idea of common national priorities<br> fades further into a distant past….  And the country’s seismic demographic and cultural shifts threaten to make our tribalism permanent.</br></br></br></p><p>There has been the rapid rise of minority populations and stagnation in the growth of the non-Hispanic white population in this country. Now, Hispanics represent a majority of all births in America, and last week The New York Times reported on census data that revealed that “deaths exceeded births among non-Hispanic white Americans for the first time in at least a century.”</p><p>In fact, according to an Associated Press report last week, which cited government reports: “For the first time, America’s racial and ethnic minorities now make up about half of the under-5 age group.”</p><p>But there were also some worrisome statistics in the report that could help to signal those children’s views on policy…. And, we are becoming less blindly religious and more blindly militaristic. (The former is a good thing; the latter, not so much.)</p></blockquote><p>Blow is wrong about one thing: there is no “nation divided against itself”, because as I’ve previously noted, there are not merely two separate nations, there are four.  There are the Reds of progressive, secular America, there are the Whites<br> of traditional religious America, there are the Browns of third world<br> America, and there are the Blacks of feral America. They may broadly follow the racial demographics, but the lines are not hard; for example, Charles Blow is a black man who is clearly Red, rather than Black, just as David Brooks is Red, not White.</br></br></p><p>Given how people have expressed considerable doubt concerning my  negative outlook on the continued union of these four Americas, it should be interesting to see how they respond to a black, left-wing New York Times columnist who has, despite our very different perspectives, reached similar conclusions. Note, in particular, that damning admission: “because of dramatic… demographic changes”.</p><p>The fruits of diversity are bloodshed and war.  They always have been.  Populations of sufficiently differing time preferences simply cannot live together for long. And the only successful way to keep those fruits from ripening has is a powerful militaristic state willing and able to commit atrocities in order to keep the otherwise warring parties in line.  Consider, for example, the difference between segregation as it was practiced in the pre-1960s USA and the way it was practiced in the USSR and China.  Or the way it is presently practiced in Africa with the various tribes vying for power in the national government.</p><p>It won’t surprise me if those who oppose deportations now and are horrified by the WWII Japanese internment live long enought to one day find themselves supporting a Red American government that is engaged in internal deportations of Hispanics to its Aztlan Autonomous Oblast.</p></div>",
  "content_text": "Even the historically illiterate, stunted intellectuals of Red America are beginning to observe\nthe signs of the eventual breakup\n.\nAlong with — and because of — dramatic social and demographic changes,\nAmerica is quickly dividing itself into two separate nations, regional\nenclaves of rigid politics, as the idea of common national priorities\nfades further into a distant past….  And the country’s seismic demographic and cultural shifts threaten to make our tribalism permanent.\nThere has been the rapid rise of minority populations and stagnation in the growth of the non-Hispanic white population in this country. Now, Hispanics represent a majority of all births in America, and last week The New York Times reported on census data that revealed that “deaths exceeded births among non-Hispanic white Americans for the first time in at least a century.”\nIn fact, according to an Associated Press report last week, which cited government reports: “For the first time, America’s racial and ethnic minorities now make up about half of the under-5 age group.”\nBut there were also some worrisome statistics in the report that could help to signal those children’s views on policy…. And, we are becoming less blindly religious and more blindly militaristic. (The former is a good thing; the latter, not so much.)\nBlow is wrong about one thing: there is no “nation divided against itself”, because as I’ve previously noted, there are not merely two separate nations, there are four.  There are the Reds of progressive, secular America, there are the Whites\nof traditional religious America, there are the Browns of third world\nAmerica, and there are the Blacks of feral America. They may broadly follow the racial demographics, but the lines are not hard; for example, Charles Blow is a black man who is clearly Red, rather than Black, just as David Brooks is Red, not White.\nGiven how people have expressed considerable doubt concerning my  negative outlook on the continued union of these four Americas, it should be interesting to see how they respond to a black, left-wing New York Times columnist who has, despite our very different perspectives, reached similar conclusions. Note, in particular, that damning admission: “because of dramatic… demographic changes”.\nThe fruits of diversity are bloodshed and war.  They always have been.  Populations of sufficiently differing time preferences simply cannot live together for long. And the only successful way to keep those fruits from ripening has is a powerful militaristic state willing and able to commit atrocities in order to keep the otherwise warring parties in line.  Consider, for example, the difference between segregation as it was practiced in the pre-1960s USA and the way it was practiced in the USSR and China.  Or the way it is presently practiced in Africa with the various tribes vying for power in the national government.\nIt won’t surprise me if those who oppose deportations now and are horrified by the WWII Japanese internment live long enought to one day find themselves supporting a Red American government that is engaged in internal deportations of Hispanics to its Aztlan Autonomous Oblast.",
  "tags": [
    "decline and fall",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-20T07:41:00+00:00"
}