{
  "url": "https://voxday.net/2013/06/14/presenting-this-summers-distraction/",
  "scraped_at": "2025-12-14T22:31:54.898887",
  "title": "Presenting this summer’s distraction",
  "date_display": "June 14, 2013",
  "date_iso": "2013-06-14T13:00:00+00:00",
  "date_from_url": "2013-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If there were any doubts about the wisdom of the US getting militarily involved in Syria, the combination of the Benghazi, IRS, and NSA scandals <a href=\"http://www.cbsnews.com/8301-250_162-57589252/u.s.-syria-used-chemical-weapons-crossing-red-line/\">appears to have resolved them</a>:</p><blockquote class=\"tr_bq\"><p> The Obama administration has concluded that Syrian President Bashar<br> Assad’s government used chemical weapons against the rebels seeking to<br> overthrow him and, in a major policy shift, President Obama has decided<br> to supply military support to the rebels, the White House announced<br> Thursday. “The president has made a decision about providing more<br> support to the opposition that will involve providing direct support to<br> the [Supreme Military Council]. That includes military support,” Deputy<br> National Security Adviser for Strategic Communication Ben Rhodes told<br> reporters.</br></br></br></br></br></br></br></br></p></blockquote><p>Well, it’s better than a false flag event.  It’s probably preferable to give the administration the easy foreign policy distraction they are seeking than force them to generate one.  And as an added bonus, the country <a href=\"http://www.breitbart.com/Big-Peace/2013/06/11/Obama-Admin-Considers-Resettling-Thousands-of-Syrian-Refugees-in-U-S\">will receive about 800,000 Syrian immigrants</a>, which will help replace the now-declining native white population.</p><blockquote class=\"tr_bq\"><p> The Obama administration is considering resettling thousands of refugees who left Syria during the country’s ongoing civil war to multiple towns and cities across the United States, the L.A. Times reports. A resettlement plan under discussion in Washington and other capitals is aimed at relieving pressure on Middle Eastern countries straining to support 1.6 million refugees, as well as assisting hard-hit Syrian families…. The United States usually accepts about half the refugees that the U.N. agency proposes for resettlement.</p></blockquote><p>More diversity = more better, right?</p></div>",
  "content_text": "If there were any doubts about the wisdom of the US getting militarily involved in Syria, the combination of the Benghazi, IRS, and NSA scandals\nappears to have resolved them\n:\nThe Obama administration has concluded that Syrian President Bashar\nAssad’s government used chemical weapons against the rebels seeking to\noverthrow him and, in a major policy shift, President Obama has decided\nto supply military support to the rebels, the White House announced\nThursday. “The president has made a decision about providing more\nsupport to the opposition that will involve providing direct support to\nthe [Supreme Military Council]. That includes military support,” Deputy\nNational Security Adviser for Strategic Communication Ben Rhodes told\nreporters.\nWell, it’s better than a false flag event.  It’s probably preferable to give the administration the easy foreign policy distraction they are seeking than force them to generate one.  And as an added bonus, the country\nwill receive about 800,000 Syrian immigrants\n, which will help replace the now-declining native white population.\nThe Obama administration is considering resettling thousands of refugees who left Syria during the country’s ongoing civil war to multiple towns and cities across the United States, the L.A. Times reports. A resettlement plan under discussion in Washington and other capitals is aimed at relieving pressure on Middle Eastern countries straining to support 1.6 million refugees, as well as assisting hard-hit Syrian families…. The United States usually accepts about half the refugees that the U.N. agency proposes for resettlement.\nMore diversity = more better, right?",
  "tags": [
    "politics",
    "Vibrancy is our strength",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-14T12:00:00+00:00"
}