{
  "url": "https://voxday.net/2013/06/14/pz-myers-professional-biologis/",
  "scraped_at": "2025-12-14T22:31:58.537324",
  "title": "PZ Myers, professional “biologist”",
  "date_display": "June 14, 2013",
  "date_iso": "2013-06-14T20:25:00+00:00",
  "date_from_url": "2013-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, before you read this, keep in mind that PZ Myers <a href=\"http://freethoughtblogs.com/pharyngula/2013/06/14/theodore-beale-racist-asshat-and-embarrassed-by-it/\">is actually employed to teach</a> college students biology:</p><blockquote class=\"tr_bq\"><p> Keep in mind that Jemisin is black. Here’s Theodore Beale coming right out and saying that while she’s <i>human</i>, she’s not fully equal to a white man, himself (and please, his invocation of “genetic science” is reeking bullshit).</p></blockquote><p>The amusing thing is that Myers not only didn’t understand what it meant when I pointed out that NK Jemisin and I are not equally homo sapiens sapiens, he also doesn’t have a clue about current genetic science.  In fact, most of the people who have taken offense at the statement that “genetic science presently suggests that we are not equally homo sapiens sapiens” have done nothing more than demonstrate they have not kept up with relatively recent developments in genetics by interpreting my words in a manner that is not only ignorant, but precisely backward.</p><p>You see, Africans are pure homo sapiens sapiens.  Non-Africans are not. NK Jemisin, being of African extraction, is almost surely <a href=\"http://io9.com/5939148/new-dna-evidence-could-explain-what-happened-to-the-neanderthals\">more purely homo sapiens sapiens than I am</a>.  Or, for that matter, than PZ Myers is. </p><p><i>“Previous research has revealed that Neanderthal DNA can be found in the<br> genomes of everyone who isn’t of African extraction. But, as Pääbo said,<br> “The Denisovans had contributed DNA only to people in Papua New Guinea,<br> Fiji, Australia, and other places in Melanesia.” In other words, modern<br> humans entering Asia interbred with Denisovans. But the Denisovan DNA<br> didn’t wind up circulating to other areas of the world the way<br> Neanderthal DNA did.”</br></br></br></br></br></br></i></p><p>So, everyone who isn’t African possesses DNA from other homo species, including Homo neanderthalensis and what is either Homo denisova or Homo sapiens denisova.  This is why I often mock those who believe in both evolution by natural selection and human equality, because humanity is not only NOT all the same under our skin, we are not, according to current genetic science, even all entirely the same subspecies.  If we apply their idiot logic, then I was actually claiming that I am not fully equal to Jemisin rather than the other way around.</p><p>That’s not the only thing that the excitable and characteristically buffoonish Myers gets wrong.  I’m not annoyed at being called a racist, I’m not demanding any apologies for it, and I’m certainly not threatening any lawsuits over it.  For crying out loud, John Scalzi has been calling me a Racist Sexist Homophobic Dipshit for months and it doesn’t bother me in the slightest since I am none of those things.  I demanded an apology because NK Jemisin broke SFWA confidentiality rules by misreading part of my presidential campaign platform, then claimed that I am a “self-described<br> misogynist, racist, anti-Semite, and a few other flavors of asshole.”  However, I have never described myself as any of those four things.</br></p><p>I assume Myers would similarly object if Ms. Jemisin claimed PZ Myers is a self-described Catholic pedophile who teaches puppetry to kindergarteners.</p><p>Myers is also wrong about my having modified my original post in any way.  The incompetent philosopher is confusing a later post for the original one because he didn’t scroll down the page.  <a href=\"http://www.milobookclub.com/2013/06/13/a-black-female-fantasis/\">It’s still there in its entirety</a>.  Everything it contains is factually true, utterly defensible, and I will note that not a single person who is throwing hissy fits about it has dared to take up my offer to debate them on any of its contents.  The abysmal scientific ignorance of a collegiate biology teacher concerning the subject may offer an indication of why those who are even less cognizant of the relevant genetic science and its implications are nervous about doing so.</p><p>It appears Myers also failed to read Jemisin’s speech.  She is the one who asserted that the “racist stand-your-ground laws” were passed against people like her.  I merely pointed out WHY those laws were passed; because people were being violently attacked by the aforementioned people and needed a legal right to self defense.</p><p>Myers doesn’t even attempt to address any of the factual statements I made or try to challenge their accuracy, he merely points-and-shrieks.  No wonder he has twice run away from debates with me; he’s not capable of rational dialectic.  As for not being embarrassed, why would I ever be embarrassed by being aware of history, capable of logic, and reasonably up-to-date on genetic science?  If the hysterical left is really going to abandon history, logic, and science in favor of its precious equality myths, it’s simply not going to be possible for anyone with a functioning brain to take it seriously much longer.</p><p>Forget the SFWA kerfluffle.  The real scandal is that a science illiterate like PZ Myers is employed to teach science to college students.</p></div>",
  "content_text": "Now, before you read this, keep in mind that PZ Myers\nis actually employed to teach\ncollege students biology:\nKeep in mind that Jemisin is black. Here’s Theodore Beale coming right out and saying that while she’s\nhuman\n, she’s not fully equal to a white man, himself (and please, his invocation of “genetic science” is reeking bullshit).\nThe amusing thing is that Myers not only didn’t understand what it meant when I pointed out that NK Jemisin and I are not equally homo sapiens sapiens, he also doesn’t have a clue about current genetic science.  In fact, most of the people who have taken offense at the statement that “genetic science presently suggests that we are not equally homo sapiens sapiens” have done nothing more than demonstrate they have not kept up with relatively recent developments in genetics by interpreting my words in a manner that is not only ignorant, but precisely backward.\nYou see, Africans are pure homo sapiens sapiens.  Non-Africans are not. NK Jemisin, being of African extraction, is almost surely\nmore purely homo sapiens sapiens than I am\n.  Or, for that matter, than PZ Myers is.\n“Previous research has revealed that Neanderthal DNA can be found in the\ngenomes of everyone who isn’t of African extraction. But, as Pääbo said,\n“The Denisovans had contributed DNA only to people in Papua New Guinea,\nFiji, Australia, and other places in Melanesia.” In other words, modern\nhumans entering Asia interbred with Denisovans. But the Denisovan DNA\ndidn’t wind up circulating to other areas of the world the way\nNeanderthal DNA did.”\nSo, everyone who isn’t African possesses DNA from other homo species, including Homo neanderthalensis and what is either Homo denisova or Homo sapiens denisova.  This is why I often mock those who believe in both evolution by natural selection and human equality, because humanity is not only NOT all the same under our skin, we are not, according to current genetic science, even all entirely the same subspecies.  If we apply their idiot logic, then I was actually claiming that I am not fully equal to Jemisin rather than the other way around.\nThat’s not the only thing that the excitable and characteristically buffoonish Myers gets wrong.  I’m not annoyed at being called a racist, I’m not demanding any apologies for it, and I’m certainly not threatening any lawsuits over it.  For crying out loud, John Scalzi has been calling me a Racist Sexist Homophobic Dipshit for months and it doesn’t bother me in the slightest since I am none of those things.  I demanded an apology because NK Jemisin broke SFWA confidentiality rules by misreading part of my presidential campaign platform, then claimed that I am a “self-described\nmisogynist, racist, anti-Semite, and a few other flavors of asshole.”  However, I have never described myself as any of those four things.\nI assume Myers would similarly object if Ms. Jemisin claimed PZ Myers is a self-described Catholic pedophile who teaches puppetry to kindergarteners.\nMyers is also wrong about my having modified my original post in any way.  The incompetent philosopher is confusing a later post for the original one because he didn’t scroll down the page.\nIt’s still there in its entirety\n.  Everything it contains is factually true, utterly defensible, and I will note that not a single person who is throwing hissy fits about it has dared to take up my offer to debate them on any of its contents.  The abysmal scientific ignorance of a collegiate biology teacher concerning the subject may offer an indication of why those who are even less cognizant of the relevant genetic science and its implications are nervous about doing so.\nIt appears Myers also failed to read Jemisin’s speech.  She is the one who asserted that the “racist stand-your-ground laws” were passed against people like her.  I merely pointed out WHY those laws were passed; because people were being violently attacked by the aforementioned people and needed a legal right to self defense.\nMyers doesn’t even attempt to address any of the factual statements I made or try to challenge their accuracy, he merely points-and-shrieks.  No wonder he has twice run away from debates with me; he’s not capable of rational dialectic.  As for not being embarrassed, why would I ever be embarrassed by being aware of history, capable of logic, and reasonably up-to-date on genetic science?  If the hysterical left is really going to abandon history, logic, and science in favor of its precious equality myths, it’s simply not going to be possible for anyone with a functioning brain to take it seriously much longer.\nForget the SFWA kerfluffle.  The real scandal is that a science illiterate like PZ Myers is employed to teach science to college students.",
  "tags": [
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-14T19:25:00+00:00"
}