{
  "url": "https://voxday.net/2013/06/15/pz-tries-to-cover-his-ample-posterior/",
  "scraped_at": "2025-12-14T22:32:03.695889",
  "title": "PZ tries to cover his ample posterior",
  "date_display": "June 15, 2013",
  "date_iso": "2013-06-15T17:50:00+00:00",
  "date_from_url": "2013-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Our favorite professional biologist is blushing behind his beard.  He knows he was caught out, so now <a href=\"http://freethoughtblogs.com/pharyngula/2013/06/15/im-a-professional-biologist/\">he’s trying to make up for it</a> by quickly posting again in order to claim that I’m capitalizing improperly.  Never mind that he completely exposed his chunky backside by completely failing to grasp the reference to human subspecies rather than species.</p><blockquote class=\"tr_bq\"><p> Pure what? What is a “pure” human? Every single person on this planet belongs to the same identical species, <i>Homo sapiens</i>,<br> so his distinctions by differences in alleles is irrelevant. I must<br> also mention that his habit of capitalizing the binomial name is a bit<br> irritating. We teach a class in science writing here that hammers on a<br> lot of the scientific conventions, and we literally tell our students<br> that one of the first signs you’re dealing with someone who doesn’t know<br> basic biology is that they get the punctuation wrong.</br></br></br></br></br></br></p><p>The existence of individual variants, even regional patterns, is an<br> expected aspect of the genetic complement of a population. A species is<br> not ever assumed to be genetically homogeneous, so it’s ridiculous to<br> point to one member with a particular admixture of genes within a group<br> and say they’re more a member of the group than someone else with a<br> slightly different genetic complement. It’s pure typological thinking. Theodore Beale has a crude version of<br> 19th century biology (to be generous) rattling around in his head, and<br> he thinks it makes sense.</br></br></br></br></br></br></br></p></blockquote><p>The amusing thing here is that PZ doesn’t realize that he’s denying evolution by natural selection here.  Notice that when push comes to shove, the left-wing scientist will throw his science overboard rather than surrender his religious devotion to progressive propaganda.</p><p>I’m assuming Myers is not actually dumb enough to fail to grasp the distinction between species and subspecies, so what he’s doing here is playing games by conflating the two in an attempt to gloss over his errors.  I never said anything about “pure human”.  I referred to “pure <i>Homo sapiens sapiens</i>“.  What does that mean?  It means not <i>Homo erectus.  </i>It means not <i>Homo floriensus</i>.  And it also means not <i>Homo sapiens sapiens </i>mixed with <i>Homo neanderthalensis</i> or <i>Homo denisova.</i></p><p>This is a very good example of what I mean when I say that correctly applied logic is capable of trumping credentialed expertise.  Appealing to punctuation in a futile attempt to convince third parties that he really does know what he’s talking about after an error of this magnitude only underlines how haplessly inept Myers is. </p></div>",
  "content_text": "Our favorite professional biologist is blushing behind his beard.  He knows he was caught out, so now\nhe’s trying to make up for it\nby quickly posting again in order to claim that I’m capitalizing improperly.  Never mind that he completely exposed his chunky backside by completely failing to grasp the reference to human subspecies rather than species.\nPure what? What is a “pure” human? Every single person on this planet belongs to the same identical species,\nHomo sapiens\n,\nso his distinctions by differences in alleles is irrelevant. I must\nalso mention that his habit of capitalizing the binomial name is a bit\nirritating. We teach a class in science writing here that hammers on a\nlot of the scientific conventions, and we literally tell our students\nthat one of the first signs you’re dealing with someone who doesn’t know\nbasic biology is that they get the punctuation wrong.\nThe existence of individual variants, even regional patterns, is an\nexpected aspect of the genetic complement of a population. A species is\nnot ever assumed to be genetically homogeneous, so it’s ridiculous to\npoint to one member with a particular admixture of genes within a group\nand say they’re more a member of the group than someone else with a\nslightly different genetic complement. It’s pure typological thinking. Theodore Beale has a crude version of\n19th century biology (to be generous) rattling around in his head, and\nhe thinks it makes sense.\nThe amusing thing here is that PZ doesn’t realize that he’s denying evolution by natural selection here.  Notice that when push comes to shove, the left-wing scientist will throw his science overboard rather than surrender his religious devotion to progressive propaganda.\nI’m assuming Myers is not actually dumb enough to fail to grasp the distinction between species and subspecies, so what he’s doing here is playing games by conflating the two in an attempt to gloss over his errors.  I never said anything about “pure human”.  I referred to “pure\nHomo sapiens sapiens\n“.  What does that mean?  It means not\nHomo erectus.\nIt means not\nHomo floriensus\n.  And it also means not\nHomo sapiens sapiens\nmixed with\nHomo neanderthalensis\nor\nHomo denisova.\nThis is a very good example of what I mean when I say that correctly applied logic is capable of trumping credentialed expertise.  Appealing to punctuation in a futile attempt to convince third parties that he really does know what he’s talking about after an error of this magnitude only underlines how haplessly inept Myers is.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2013-06-15T16:50:00+00:00"
}