{
  "url": "https://voxday.net/2013/06/15/rabbit-reviews/",
  "scraped_at": "2025-12-14T22:32:00.003534",
  "title": "Rabbit reviews",
  "date_display": "June 15, 2013",
  "date_iso": "2013-06-15T08:51:00+00:00",
  "date_from_url": "2013-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As we saw <a href=\"http://www.milobookclub.com/2013/06/10/men-on-strike-ultimate-review/\">with Dr. Helen’s new book</a>, one can always tell when the warren is hopping mad about something, because immediately they start throwing money at charities and “reviewing” books.  Icefog, for one, has been a very busy little rabbit.  It’s really remarkable how many books she managed to read through in just one day!</p><p>It would certainly be fascinating to discover this “reviewer” is an SFWA member given Amazon’s review policies.<b>  </b>And it’s interesting to learn that GoodReads is even more prone to fake reviewery.  Of course, as always, I look forward to the usual suspects whining “but how do you KNOW they’re fake reviews?”</p><blockquote class=\"tr_bq\"><p> <a href=\"http://www.amazon.com/review/R55EL3SL1O744/ref=cm_cr_rdp_perm\"><b>A throne of garbage</b></a></p><div style=\"margin-bottom: 0.5em;\"> June 14, 2013</div><p>Where to begin? This is tripe by any other name. There’s really no<br> story, and the language is infantile. When writing this the author must<br> have worn out his thesaurus, as this wordy little book looks like every<br> sentence is gleaned from Roget. The dialogue is hopeless, and the<br> characters laughable. Unless you can find nothing whatsoever to do with<br> your time, do anything other than waste it on this book.</br></br></br></br></br></p><p><a href=\"http://www.amazon.com/review/R3O2SV64G0ZS3T/ref=cm_cr_rdp_perm\"><b>A waste of $2.99</b></a></p><div style=\"margin-bottom: 0.5em;\"> June 14, 2013</div><p>Yes, I know it’s just $2.99, but surely you can find something better to<br> spend it on. This author, self-avowed racist and mysogynist does not<br> deserve you money, however paltry the sum.</br></br></p><p><a href=\"http://www.amazon.com/review/R6NMKWI51ZJHN/ref=cm_cr_rdp_perm\"><b>Author dimentia</b></a></p><div style=\"margin-bottom: 0.5em;\"> June 14, 2013</div><p>There is no evidence inthis book that the author is capable of writing a<br> book, or even successfully pretending to without significant external<br> support. Perhaps his writing should be taken with at least a small grain<br> of salt. It is not that I, and others, do view him as human, (although<br> genetic science presently suggests that we are not equally homo sapiens<br> sapiens), it is that I do not view him as being fully civilized for the<br> obvious reason that he is not.</br></br></br></br></br></br></p><p><a href=\"http://www.amazon.com/review/R2ZMJ0ZRT7U4UT/ref=cm_cr_rdp_perm\"><b>Infantile writing</b></a></p><div style=\"margin-bottom: 0.5em;\"> June 14, 2013</div><p>The quality of the writing in this weak attempt at wrting is truly<br> pathetic. It shows what one man with a thesaurus and an elementary<br> understanding of the English language can accomplish. Save your time;<br> save your money. Do anything other than read this trash. </br></br></br></p></blockquote><p>I post these here in case they are removed by Amazon, because they serve as evidence that NK Jemisin’s false and malicious claims about me have already led to real and material damages.  They also show that SFWA has abetted those claims by permitting her to break Forum confidentiality without reprimanding her in the manner that I, and other members, have previously been reprimanded for doing the same.</p><p>In addition to those damages, there is the serious emotional trauma that I have suffered due to the multiple threats of violence being directed against me, in some cases by SFWA members, as a direct result of Ms Jemisin’s breach of confidentiality.  There are even indications that certain parties are concocting an organized plot to physically assault me involving an SF author with highly trained martial arts skills, the threat of which now renders me unable to attend professional conferences and materially harms my ability to secure future book contracts.</p><p><i>“And there is white-hot anger, so fierce you become the eye within the<br> maelstrom of your own rage, calm as your pulse exceeds the beats of a<br> marathon runner, calm as your fingers grasp and clench, calm as you grip<br> your aggressor’s throat and squeeze.  This last I feel for Theodore Beale.”</br></br></br></i><br>  – Foz Meadows, <a href=\"http://fozmeadows.wordpress.com/2013/06/14/reconciliation-a-response-to-theodore-beale/\">June 14, 2013</a></br></p><p><i>“You are a better person than I am; I can think of another response to Beale.</i><i> Because I am incapable of stripping myself of irony, it’s a solution he’d approve, because he is not as fully civilized as I am. I’m sure it would be a lively, if sparsely-attended, wake.”</i><br> – Rafe Bronx, <a href=\"http://fozmeadows.wordpress.com/2013/06/14/reconciliation-a-response-to-theodore-beale/#comment-9917\">June 14, 2013 </a><br> <i><br/></i><br> <i>“Ignoring it hasn’t made it go away, and it never will. That has become undeniably apparent between this and the Sarkeesian<br> mess in the gaming community, and I have gone past the point of anger to<br> disbelief to exhaustion to numbness and back to blinding white-hot<br> rage. Time to put on the shitkicking boots.”</br></br></br></i><br> – Samantha, <a href=\"http://fozmeadows.wordpress.com/2013/06/14/reconciliation-a-response-to-theodore-beale/#comment-9959\">June 14, 2013</a></br></br></br></br></p><p><i>“There is<br> something….spectacularly unpleasant about him. He strikes me as someone<br> who is just itching for a really thorough arse kicking. I think it would<br> actual count as a medical intervention and possibly do him a lot of<br> good.”</br></br></br></br></i><br> – Louis, <a href=\"http://freethoughtblogs.com/pharyngula/2013/06/14/theodore-beale-racist-asshat-and-embarrassed-by-it/comment-page-1/#comment-637117\">June 14, 2013 </a></br></p><p><i>“I also can’t wait for the day when Theo literally gets his ass kicked by<br> a progressive SF author / martial artist like Matthew Woodring<br> Stover… just wait”</br></br></i><br> – Educated Professor, <a href=\"http://voxday.blogspot.com/2013/06/sfwa-forum-moderated-posts.html#c169818005900772652\">June 14, 2013</a></br></p><p><i>“i really would just love to meet up with him and deliver my personal<br> feelings in a direct and nonverbal way. ugh. the bad taste in my mouth,<br> make it go away.”</br></br></i><br> – Mark Monday, <a href=\"http://www.goodreads.com/review/show/641014243#comment_76206496\">June 13, 2013</a> </br></p><p>The very troubling thing here is that SFWA has a history of turning a blind eye to threats of violence made by its members.  Just to give two of several examples, it took no action of any kind even though I complained to the SFWA Board about the following threats, one made by one of the organization’s own board members, the other made on the SFWA President’s own blog.  I cannot post more due to the forum confidentiality rules.</p><p><i>“Ah, yes. Mr. Beale. When I decided to run for re-election as SFWA<br> South-Central Regional Director, someone asked me what I would do if Mr.<br> Beale won the Presidential election. I replied, “Ask my friends to<br> start a bail fund.” </br></br></br></i><br> – Lee Martindale, SFWA South-Central Regional Director, <a href=\"http://jimhines.livejournal.com/668807.html?thread=19751047#t19751047\">February 1, 2013</a></br></p><p><i>“Whever I think “alpha male”… my daydream quickly becomes a Sweeney Todd<br> nightmare in which I’m serving the remains to my dinner guests,<br> disguised as some sort of heavy-seasoned stew beneath puff pastry,<br> because I wound up killing said Alpha Male in sheer exasperation before<br> sundown and need to get rid of the body….”</br></br></br></br></i> <br> – Laura Resnick, SFWA member, <a href=\"http://whatever.scalzi.com/2012/08/17/your-second-thought-for-the-day/\">August 17, 2012</a></br></p></div>",
  "content_text": "As we saw\nwith Dr. Helen’s new book\n, one can always tell when the warren is hopping mad about something, because immediately they start throwing money at charities and “reviewing” books.  Icefog, for one, has been a very busy little rabbit.  It’s really remarkable how many books she managed to read through in just one day!\nIt would certainly be fascinating to discover this “reviewer” is an SFWA member given Amazon’s review policies.\nAnd it’s interesting to learn that GoodReads is even more prone to fake reviewery.  Of course, as always, I look forward to the usual suspects whining “but how do you KNOW they’re fake reviews?”\nA throne of garbage\nJune 14, 2013\nWhere to begin? This is tripe by any other name. There’s really no\nstory, and the language is infantile. When writing this the author must\nhave worn out his thesaurus, as this wordy little book looks like every\nsentence is gleaned from Roget. The dialogue is hopeless, and the\ncharacters laughable. Unless you can find nothing whatsoever to do with\nyour time, do anything other than waste it on this book.\nA waste of $2.99\nJune 14, 2013\nYes, I know it’s just $2.99, but surely you can find something better to\nspend it on. This author, self-avowed racist and mysogynist does not\ndeserve you money, however paltry the sum.\nAuthor dimentia\nJune 14, 2013\nThere is no evidence inthis book that the author is capable of writing a\nbook, or even successfully pretending to without significant external\nsupport. Perhaps his writing should be taken with at least a small grain\nof salt. It is not that I, and others, do view him as human, (although\ngenetic science presently suggests that we are not equally homo sapiens\nsapiens), it is that I do not view him as being fully civilized for the\nobvious reason that he is not.\nInfantile writing\nJune 14, 2013\nThe quality of the writing in this weak attempt at wrting is truly\npathetic. It shows what one man with a thesaurus and an elementary\nunderstanding of the English language can accomplish. Save your time;\nsave your money. Do anything other than read this trash.\nI post these here in case they are removed by Amazon, because they serve as evidence that NK Jemisin’s false and malicious claims about me have already led to real and material damages.  They also show that SFWA has abetted those claims by permitting her to break Forum confidentiality without reprimanding her in the manner that I, and other members, have previously been reprimanded for doing the same.\nIn addition to those damages, there is the serious emotional trauma that I have suffered due to the multiple threats of violence being directed against me, in some cases by SFWA members, as a direct result of Ms Jemisin’s breach of confidentiality.  There are even indications that certain parties are concocting an organized plot to physically assault me involving an SF author with highly trained martial arts skills, the threat of which now renders me unable to attend professional conferences and materially harms my ability to secure future book contracts.\n“And there is white-hot anger, so fierce you become the eye within the\nmaelstrom of your own rage, calm as your pulse exceeds the beats of a\nmarathon runner, calm as your fingers grasp and clench, calm as you grip\nyour aggressor’s throat and squeeze.  This last I feel for Theodore Beale.”\n– Foz Meadows,\nJune 14, 2013\n“You are a better person than I am; I can think of another response to Beale.\nBecause I am incapable of stripping myself of irony, it’s a solution he’d approve, because he is not as fully civilized as I am. I’m sure it would be a lively, if sparsely-attended, wake.”\n– Rafe Bronx,\nJune 14, 2013\n“Ignoring it hasn’t made it go away, and it never will. That has become undeniably apparent between this and the Sarkeesian\nmess in the gaming community, and I have gone past the point of anger to\ndisbelief to exhaustion to numbness and back to blinding white-hot\nrage. Time to put on the shitkicking boots.”\n– Samantha,\nJune 14, 2013\n“There is\nsomething….spectacularly unpleasant about him. He strikes me as someone\nwho is just itching for a really thorough arse kicking. I think it would\nactual count as a medical intervention and possibly do him a lot of\ngood.”\n– Louis,\nJune 14, 2013\n“I also can’t wait for the day when Theo literally gets his ass kicked by\na progressive SF author / martial artist like Matthew Woodring\nStover… just wait”\n– Educated Professor,\nJune 14, 2013\n“i really would just love to meet up with him and deliver my personal\nfeelings in a direct and nonverbal way. ugh. the bad taste in my mouth,\nmake it go away.”\n– Mark Monday,\nJune 13, 2013\nThe very troubling thing here is that SFWA has a history of turning a blind eye to threats of violence made by its members.  Just to give two of several examples, it took no action of any kind even though I complained to the SFWA Board about the following threats, one made by one of the organization’s own board members, the other made on the SFWA President’s own blog.  I cannot post more due to the forum confidentiality rules.\n“Ah, yes. Mr. Beale. When I decided to run for re-election as SFWA\nSouth-Central Regional Director, someone asked me what I would do if Mr.\nBeale won the Presidential election. I replied, “Ask my friends to\nstart a bail fund.”\n– Lee Martindale, SFWA South-Central Regional Director,\nFebruary 1, 2013\n“Whever I think “alpha male”… my daydream quickly becomes a Sweeney Todd\nnightmare in which I’m serving the remains to my dinner guests,\ndisguised as some sort of heavy-seasoned stew beneath puff pastry,\nbecause I wound up killing said Alpha Male in sheer exasperation before\nsundown and need to get rid of the body….”\n– Laura Resnick, SFWA member,\nAugust 17, 2012",
  "tags": [
    "anklebiters",
    "books",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-15T07:51:00+00:00"
}