{
  "url": "https://voxday.net/2013/06/05/seriously-fascist-womens-association/",
  "scraped_at": "2025-12-14T22:30:52.221588",
  "title": "Seriously Fascist Women’s Association",
  "date_display": "June 5, 2013",
  "date_iso": "2013-06-05T08:23:00+00:00",
  "date_from_url": "2013-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.geekingoutabout.com/wp-content/uploads/SFWA-Bulletin-Cover-vol-47-1.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.geekingoutabout.com/wp-content/uploads/SFWA-Bulletin-Cover-vol-47-1.jpg\" width=\"248\"/></a>One of the cross-dressing lights of the New Equalitarians created a helpful list of the most censorious liberal fascists in the SFWA.  With one or two exceptions, it’s a useful list of nobodies and mediocrities whose books you now know you can safely continue to ignore.</p><p>It’s a bit amusing to read through it and realize there are precisely two authors on it whose work can reasonably be compared to that of the two men who are being so widely castigated… and I’m not a fan of either Resnick or Malzberg.  I merely support their right to write opinion pieces and freely express their opinions in them, regardless of how offensive these delicate, fainting flowers may find those opinions to be.  Of course, in the present SFWA, such support for free speech renders me a radical extremist, nearly as dangerous as the deeply offensive cover of Issue 200.</p><ul><li>Foz Meadows: <a href=\"http://fozmeadows.wordpress.com/2013/06/02/old-men-yelling-at-clouds-sfwa-lunacy/\">Old Men Yelling at Clouds</a>.<br> “I could make a drinking game about this article: take a shot every<br> time the author deliberately highlights the femaleness of the women he<br> mentions, the better to explain how <i>these ladies never said I was sexist</i>…”</br></br></br></li><li>Peter Brett: <a href=\"http://www.petervbrett.com/2013/06/02/why-im-renewing-my-sfwa-membership/\">Why I’m Renewing my SFWA Membership</a>.<br> “ I won’t get into the details of their remarks here, save to say that<br> having read them for myself, I agree they were unprofessional,<br> inappropriate, and not representative of the SF industry as a whole.”</br></br></br></li><li>Amal El-Mohtar: <a href=\"http://storify.com/tithenai/responses-to-sexism-in-sfwa-s-bulletin\">Responses to Sexism in SFWA’s Bulletin</a>.<br> “VP, Regional Directors, hosts of volunteers in @sfwa, all working<br> hard, are made invisible by the effort it took Resnick/Malzberg to<br> wank.”</br></br></br></li><li>Kameron Hurley: <a href=\"http://www.kameronhurley.com/dear-sfwa-writers-lets-chat-about-censorship-bullying/\">Dear SFWA Writers: Let’s Chat About Censorship and Bullying</a>.<br> “Nobody has to agree with you anymore. Nobody is afraid of you anymore.<br> I know this may come as a massive shock to folks used to a position of<br> power, insulated by groups of people who are happy to stroke their egos<br> and soothe their souls.”</br></br></br></br></li><li>E. Catherine Tobler: <a href=\"http://ecatherine.com/dear-sfwa/\">Dear SFWA</a>.<br> “In all the complaints that were voiced, there was never a call for<br> censorship. There was never a call for suppression. There was a call for<br> respect.”</br></br></br></li><li>Jess Haines: <a href=\"http://jesshaines.com/blog/2013/06/01/sfwa-sexism-misogyny-and-a-call-for-change/\">SFWA, Sexism, Misogyny, and a Call For Change</a>. “Mr. Resnick, Mr. Malzberg, I am not an anonymous voice. I am telling you now: what you wrote was not okay.”</li><li>Katherine Kerr: <a href=\"https://twitter.com/Kit_Kerr/status/341041390047858688\">“Since when is good taste censorship?</a>“</li><li>Jamie Wyman: <a href=\"http://www.jamiewyman.com/an-open-letter-to-john-scalzi-president-of-the-sfwa/\">An Open Letter to John Scalzi</a>.<br> “It’s not okay. And the reactions–these men saying that they are being<br> bullied or censored because they are being called out as sexist<br> bigots–is not okay.”</br></br></br></li><li>Natalie Luhrs: <a href=\"http://radishreviews.com/2013/05/31/linkspam-53113-edition/\">Linkspam, 5/31/13 Edition</a>.<br> “NOPE, NO SEXISM HERE. Also, a lady totally told them it was okay to<br> write this stuff and as everyone knows, one lady speaks for all ladies.”</br></br></li><li>Chris Gerwel: <a href=\"http://elflands2ndcousin.com/2013/05/31/the-sfwa-bulletin-censorship-anonymity-and-representation/\">The SFWA Bulletin, Censorship, Anonymity, and Representation</a>. “I have a huge problem with Resnick/Malzberg’s attitude. I consider it regressive, out-dated, and condescending.”</li><li>SL Huang: <a href=\"http://www.slhuang.com/blog/2013/06/01/more-on-sfwa-and-the-bulletin/\">More on SFWA and the Bulletin</a>.<br> “The people you really should be angry with are Resnick, Malzberg, and<br> whatever editor(s) let their article through.  They’re the people who<br> let down SFWA.  They’re the people who made your public face into sexist<br> douchebaggery.”</br></br></br></br></li><li>Trisha Lynn: <a href=\"http://www.geekingoutabout.com/2013/06/01/trishas-take-how-jean-rabe-screwed-the-pooch-for-the-sfwa-bulletin-and-how-the-sfwa-can-make-things-better-going-forward/\">How Jean Rabe screwed the pooch for the SFWA Bulletin and how the SFWA can make things better going forward</a>.<br> “I’m going to instead talk about how the entire mess could have been<br> avoided in the first place. And to do that, I have to throw Bulletin<br> writer/editor Jean Rabe under a bus.”</br></br></br></li><li>Samantha Henderson: <a href=\"http://samanthahenderson.com/2013/06/01/re-sfwa-bulletin-202/\">Re: SFWA Bulletin #202</a>. “I am not sure if I’m done with SFWA, which is more than its Bulletin and members with 1960s sensibilities.”</li><li>Michael Capobianco: “<a href=\"https://twitter.com/michaelcapobian/status/340874350435659776\">As a further indication that the R/M dialog doesn’t represent #SFWA, Barry Malzberg isn’t even a member</a>.”</li><li>Silvia Moreno-Garcia: <a href=\"http://silviamoreno-garcia.com/blog/2013/05/oh-sfwa/\">Oh, Bulletin</a>.<br> “In their latest Bulletin rant, Mike Resnick and Barry Malzberg insist,<br> among other things, that they appeared on an issue with a Warrior Woman<br> on the cover. They lie … They appeared in an issue with Sexy Cheesecake<br> Lady. If they can’t tell the difference, maybe that explains a LOT.”</br></br></br></br></li><li>Catherine Lundoff: “<a href=\"https://twitter.com/clundoff/status/340863988495691776\">Ongoing egregious sexism in the Bulletin, which is @sfwa’s official membership magazine</a>.”</li><li>Dean Gilbert: “<a href=\"https://twitter.com/ArcaneSpringbrd/status/340855288368340992\">Finally found out what the SFWA controversy is. Wow. Will not be buying any Resnick or Maltzburg books again for sure</a>.”</li><li>Patrick Hume: “<a href=\"https://twitter.com/patrickhume/status/340842338932891649\">As<br> far as Resnick and Malzberg go, well, I imagine it must be very<br> frightening being dinosaurs. Misogynistic, irrelevant dinosaurs</br></br></a>.”</li><li>Alisa Krasnostein: “<a href=\"https://twitter.com/Krasnostein/status/340794601214459904\">What<br> I see is several issues that have caused offense, incl a ridiculous<br> cover, and no stand from the SFWA in light of complaints.</br></br></a>“</li><li>Jenny Thurman: “<a href=\"https://twitter.com/jennygadget/status/340759145424748544\">Why,<br> @sfwa, do you need a task force to determine if your own members should<br> be given professional respect within your own publication?</br></br></a>“</li><li>Ross E. Lockhart: <a href=\"http://www.haresrocklots.com/to-sfwa-or-not-to-sfwa-that-is-the-question/\">To SFWA or not to SFWA? That is the question</a>.<br> “Recently, when it comes to respecting female authors and editors, SFWA<br> has chosen a counterproductive path, giving a platform in the official<br> SFWA Bulletin to a handful of male authors who have decided to wear<br> their sexism outrageously…”</br></br></br></br></li><li>Ursula Vernon: <a href=\"http://ursulav.livejournal.com/1541487.html\">SFWA — Housebreaking a Puppy or Abusive Relationship</a>?<br> “…let me just say that it’s sad when you finally get to interact with<br> some of the Big Names of science fiction and they turn out to be old men<br> yelling at clouds.”</br></br></br></li><li>A. J. Fitzwater: “<a href=\"https://twitter.com/AJFitzwater/status/340644350679740416\">I don’t want to join a union that majority men in power think women have no place amongst them. So sad to have a dream destroyed</a>.”</li><li>Ann Kopchik: “<a href=\"https://twitter.com/amergina/status/340600007398920192\">I really have no words about the whole #sfwa thing. Except that I’m tired of needing a dick to be respected</a>.”</li><li>Rick Novy: “<a href=\"https://twitter.com/RickNovy/status/340570111620550656\">Those<br> who don’t get the uproar over the SFWA bulletin article, read it<br> replacing words meaning ‘female’ with words meaning ‘black.’</br></br></a>“</li><li>Jenn Reese: “<a href=\"https://twitter.com/jennreese/status/340511134006255616\">SFWA is the most backwards-looking organization I belong to. We can write the future, but we can’t even live in the present.</a>“</li><li>Damien Walter: “<a href=\"https://twitter.com/damiengwalter/status/340553212597764096\">The issues with the bulletin are not acceptable, but don’t change my sense of the SFWA as a whole as very hardworking and useful</a>.”</li><li>Kay Holt: “<a href=\"https://twitter.com/sandykidd/status/340523433513336832\">Not<br> saying SFWA is bad. Just that we shouldn’t put up with embedded<br> misogyny just because we otherwise benefit from an organization</br></br></a>.”</li><li>Kyle Weems: “<a href=\"https://twitter.com/cssquirrel/status/340519979269095426\">Shame on you @sfwa. That’s hideous, backwards, and strangely atavistic for an org that writes about the future</a>.”</li><li>Patrick Nielsen Hayden: “<a href=\"https://twitter.com/pnh/status/340787331067940864\">An<br> underreported aspect of being around for a long time: the horror of<br> watching your once-admired elders turn into blithering nincompoops</br></br></a>.”</li><li>Ann Aguirre: “<a href=\"https://twitter.com/MsAnnAguirre/status/341239367005782016\">I’m<br> sad SFWA published antiquated dogma, then a defense of it. I’m tired of<br> being made to feel like I’m so cute for thinking I can write SF</br></br></a>.”</li><li>Rachael Acks: <a href=\"http://katsudon.net/?p=1845\">Dear Barry Malzberg and Mike Resnick: F*** You.</a><br> “If I hadn’t already had a lot of positive experiences with the older<br> male membership of the organization, I would honestly be really<br> wondering about that as well, since the attitude Malzberg and Resnick<br> display with such pride belongs in an era that thankfully ended before I<br> was born.”</br></br></br></br></br></li><li>Mary Robinette Kowal: <a href=\"http://www.maryrobinettekowal.com/journal/my-very-complicated-reaction-to-issue-202-of-the-bulletin/\">My Very Complicated Reaction to Issue 202 of the Bulletin</a>.<br> “I’m furious, because they can undo all of the good that SFWA does. And<br> like it or not, people are right to be angry. The column is deeply<br> offensive.”</br></br></br></li><li>Kate Milford: <a href=\"http://clockworkfoundry.com/2013/06/kerfluffle-watch-sfwa-edition-call-your-detractors-liberal-fascists-lose-the-argument/\">Kerfluffle Watch, SFWA Edition: Call Your Detractors Liberal Fascists, Lose the Argument</a>.<br> “…I had learned this much: the authors consider that either those who<br> objected to the cover and dialogue in Issue 200 are at best stupid and<br> at worst censorious.”</br></br></br></li><li>Alma Alexander: <a href=\"http://anghara.livejournal.com/612583.html\">The Issue 202 Controversy</a>.<br> “This might involve biting the bullet, calling one tradition’s tenure<br/> in the Bulletin a day, and dropping the Malzberg/Resnick conversations …<br/> It might even be time to start letting the WOMEN have a turn at having a<br/> Conversation.”</br></li><li>Lilith Saintcrow: <a href=\"http://www.lilithsaintcrow.com/journal/2013/06/i-hope-gandhi-is-right/\">I Hope Gandhi is Right</a>. “…this sort of shit makes me so. damn. tired.”</li><li>Tracy Cembor: <a href=\"http://tracycembor.com/2013/06/02/genre-drama/\">Genre Drama</a>. “Writers should be respected as partners in the process, and writers should treat one another as professionals and equals.”</li><li>Ferrett Steinmetz: <a href=\"http://www.theferrett.com/ferrettworks/2013/06/achievement-unlocked-womens-rights-advocate/\">Achievement Unlocked: Women’s Rights Advocate</a>.<br/> “You’ve got more work to do.   You’ve got to see that calling them<br/> ‘lady editors’ is actually diminishing them, that women in chainmail<br/> bikinis may be a long tradition but so are grinning Negro lawn jockeys…”</li><li>Steven Saus: <a href=\"http://ideatrash.net/2013/05/what-to-do-about-sexism-in-our-official.html\">What to Do About Sexism In Our Official Publications</a>. “This is a matter of being professional and treating <i>all</i> sf/f authors professionally.”</li><li>Benjamin Rosenbaum: <a href=\"http://www.benjaminrosenbaum.com/blog/archives/2013_06.html#001017\">Dear Barry &amp; Mike</a>. “Please cut it out. You’re better than that. Act like the men you want to be.”</li><li>Kelly McCullough: “<a href=\"https://twitter.com/KellyDMcC/status/341592910904582145\">For<br/> the record, the sexist dippery in the recent SFWA bulletin makes this<br/> male author &amp; SFWA member very unhappy. Not OK Resnick &amp;<br/> Malzberg.</a>“</li><li>K. Tempest Bradford: <a href=\"http://tempest.fluidartist.com/demanding-the-best/\">Demanding the Best</a>.<br/> “What needs to happen is that the all of people who belong to and run<br/> SFWA need to demand the best of their community. Demand that sexism no<br/> longer be treated lightly, that it be called out and put down and not<br/> tolerated.”</li><li>Shiloh Walker: <a href=\"http://www.shilohwalker.com/website/2013/06/im-no-barbie/\">I’m no Barbie</a>.<br/> “Being a woman very often means you’re going to be insulted, ignored,<br/> condescended, treated as insignificant, devalued, viewed as an object,<br/> and the list goes on and on and on…we get so blind to the shit that<br/> comes our way at times.  Maybe the problem is that we carried on with<br/> quiet dignity for too long.”</li><li>Harry Connolly: <a href=\"http://www.harryjconnolly.com/blog/index.php/sfwa-bulletin-and-sexism-in-the-genre/\">SFWA Bulletin and Sexism in the Genre</a>.<br/> “Speech has consequences. Speech sways the opinion of others, and<br/> maybe–just maybe–that might have an effect on your life. Resnick has<br/> that power; he’s going to have to get used to the idea that others have<br/> it, too.”</li><li>Juliette Wade: <a href=\"http://talktoyouniverse.blogspot.com/2013/06/this-feminists-thoughts-on-sfwa-and.html\">This Feminist’s Thoughts on SFWA and Cultural Change</a>.<br/> “…they were performing a culture that is sorely out of date, and I’m<br/> sure they realize that because they are defending their right to do so.<br/> Fine (though the context was inappropriate, and I’ll address that<br/> below), but they deserve the heat they are getting in response to those<br/> ideas.”</li><li>Stina Leicht: <a href=\"http://stina-leicht.livejournal.com/507836.html\">Feminist Monday</a>.<br/> “This whole thing has been building up for three issues which is why<br/> there’s so much noise being made over it … And sadly, this controversy<br/> is just the tip of the misogyny iceberg.”</li><li>Amy McLane. <a href=\"http://parkinglotconfessional.com/2013/06/03/attack-of-the-liberal-fascists/\">Attack of the Liberal Fascists</a>.<br/> “It is bad enough to read old men rating the hotness levels of various<br/> writers and editors and then getting indignant about being called out on<br/> it. It is gross, but you can almost sort of see how those two have<br/> gotten to the point of thinking that they’ve earned the right to be<br/> gross…”</li><li>Andrea Phillips: <a href=\"http://deusexmachinatio.com/blog/2013/6/3/barbies-quiet-dignity-and-progress.html\">Barbie’s Quiet Dignity and Progress</a>. “And that’s just one more drop in what seems like a never-ending stream of sexism.”</li><li>Selma Wolfe: <a href=\"http://selmawolfe.blogspot.com/2013/06/choose-to-be-better.html\">Choose to be Better</a>.<br/> “The men that endlessly defend their own sexism could choose not to<br/> defend it. They could choose to focus on women’s opinions, rather than<br/> their appearances.”</li><li>T. M. Thomas. <a href=\"http://www.tmthomas.com/2013/06/03/sfwa-in-the-news/\">SFWA in the News</a>.<br/> “And it’s why I think, perhaps deluded and defensive and not malicious<br/> at first, why the dinosaurs of the SFWA need to offer immediate<br/> apologies and stop trying to make themselves the victims of the piece.”</li><li>Lindsey Bieda. “<a href=\"https://twitter.com/lindseybieda/status/341624516256071681\">‘Hey,<br/> this thing you are doing is shitty’ is not censorship and free speech<br/> does not mean freedom from consequences or criticism.</a>“</li><li>Jeaniene Frost: <a href=\"http://jeanienefrost.com/2013/06/sfwa-not-today/\">SFWA – Not Today</a>.<br/> “I’m glad Scalzi agrees these are legitimate concerns that affect all<br/> SFWA members/associates and isn’t falling for the ‘but it’s just whining<br/> from a few liberal fascists!’ defense, but I also heave a weary sigh of<br/> agreement with author Jenny Truman’s Tweet: ‘Why, @sfwa, do you need a<br/> task force to determine if your own members should be given professional<br/> respect within your own publication?’”</li><li>Matt Yaeger: <a href=\"http://whipt.wordpress.com/2013/06/03/space-sexism/\">Space Sexism</a>.<br/> “If you can’t defend yourself without wrapping it up in an irrelevant<br/> conclusion that people who disagree with you must be censorship Nazis<br/> (hows that for loaded terms?) then you’ve already lost your position.”</li><li>Karina Cooper: <a href=\"http://karinacooper.com/damned-if-you-dont-being-a-woman-writing-as-a-woman-about-women-but-not-just-for-women/\">Damned If You Do(n’t)</a>.<br/> “We live in a world where men are judged by the quality and quantity of<br/> their bodies of work, and women are judged by their bodies; where men<br/> are called writers, authors, artists and creatives, and women are called<br/> lady writers and authoresses and ‘beauty pageant beautiful’.”</li><li>Lauren Roy: <a href=\"http://www.falconesse.com/2013/06/04/being-part-of-the-solution/\">Being Part of the Solution</a>.<br/> “It can make newbies feel quite unwelcome when you see that someone out<br/> there — someones who are big names! — think you’re not a writer but a <i>lady writer</i>, as though my gender puts an asterisk beside anything I do.”</li><li>Barbara Barnett: <a href=\"http://babarnett.com/2013/06/03/not-that-the-intrawebs-need-another-post-on-the-sfwa-kerfluffle/\">Not that the Intrawebs Need Another Post on the SFWA Kerfuffle</a>.<br/> “…the publication of a professional organization should not serve as a<br/> megaphone for speech that disrespects a large portion of the<br/> organization’s membership.”</li><li>Alisa Krasnostein: <a href=\"http://champagneandsocks.com/2013/06/04/observations-from-the-sfwa-bulletin-fiasco-part-1/\">Observations from the SFWA Bulletin Fiasco – Part 1</a>. “But here’s what really gets me annoyed. How does freedom of speech, the concept, mean that it only applies to you?”</li><li>J. N. Duncan: “<a href=\"https://twitter.com/jimnduncan/status/341769096863571968\">Dear<br/> SFWA, it’s not your job to be sexism-free (you can’t), but you do have<br/> obligation to pursue awareness and act on it with due-diligence.</a>“</li><li>Alan Baxter: <a href=\"http://www.alanbaxteronline.com/swfa-sexism-sff/\">SFWA, Sexism in SFF and Missing the Point</a>.<br/> “…members of the Science Fiction and Fantasy Writers of America wrote a<br/> piece in the official publication, the SFWA Bulletin, that is<br/> astounding in its prehistoric approach to gender and dealing with<br/> justifiable complaints.”</li><li>Jane Little (Dear Author): <a href=\"http://dearauthor.com/news/monday-news-sff-old-guard/\">SFF Old Guard</a>.<br/> “…the official bulletin of the Science Fiction Writer’s Association for<br/> the last three months has kind of been an embarrassment to SFWA, at<br/> least to those of us looking from the outside in.”</li><li>Ilona Andrews: “<a href=\"http://www.ilona-andrews.com/snippet-writing/an-alpha-magic-breaks-snippet-no-spoilers\">I’ve looked at their Bulletin talks and they are out of touch</a>.”</li><li>Ann Laurel Kopchik: <a href=\"http://annlaurelkopchik.com/2013/06/04/my-letter-to-sfwa/\">My Letter to SFWA</a>.<br/> “But the continuing problems with blatant sexism in an official<br/> publication of SFWA makes me wonder if I’ll be treated as an equal when I<br/> do meet the requirements to join SFWA.”</li><li>Shaun Duke: <a href=\"http://wisb.blogspot.com/2013/06/sfwa-sexism-and-progress-response-to.html\">SFWA, Sexism, and Progress</a>.<br/> “ Sexism is … bullshit.  We should call it out when we see it, no<br/> matter our genders.  And we should definitely make sure it no longer<br/> uses the voice of the various professional organizations in our field…”</li><li>Thomas Pluck: <a href=\"http://thomaspluck.com/2013/06/04/everyday-sexism-and-giant-space-dicks/\">Everyday Sexism and Giant Space-Dicks</a>.<br/> “…if science fiction writers can imagine unheard-of future<br/> civilizations, they can unshackle their brains from the ’60s when they<br/> were cocks of the walk, and start treating women as equals…”</li><li>M. E. Garber: <a href=\"http://megarber.wordpress.com/2013/06/04/are-we-still-here-really/\">Are We Still Here? Really?</a><br/> “What woman wants to become part of an organization that objectifies<br/> her, and belittles both her and her ability to work and achieve?”</li></ul><p>Bonus points for whomever can figure out how many of these<br/> self-appointed censors have published novels with more “offensive”<br/> covers than the Red Sonja illustration on the Bulletin cover that has<br/> inspired such an epic collective hissy fit.</p><p>It’s been interesting to see that Laura Resnick, who is usually very quick to leap in and loudly condemn anyone suspected of insufficient enthusiasm for equalitarianism, has been silent concerning the public witchburning of her father. It’s also intriguing to see how these liberal fascists claim labeling two old men “sexist<br/> bigots” and openly calling for an end to their column is acceptable, but<br/> identifying them as “censorious” is, and here I quote the SFWA<br/> moderator, “abusive behavior”.</p><ul></ul></div>",
  "content_text": "One of the cross-dressing lights of the New Equalitarians created a helpful list of the most censorious liberal fascists in the SFWA.  With one or two exceptions, it’s a useful list of nobodies and mediocrities whose books you now know you can safely continue to ignore.\nIt’s a bit amusing to read through it and realize there are precisely two authors on it whose work can reasonably be compared to that of the two men who are being so widely castigated… and I’m not a fan of either Resnick or Malzberg.  I merely support their right to write opinion pieces and freely express their opinions in them, regardless of how offensive these delicate, fainting flowers may find those opinions to be.  Of course, in the present SFWA, such support for free speech renders me a radical extremist, nearly as dangerous as the deeply offensive cover of Issue 200.\nFoz Meadows:\nOld Men Yelling at Clouds\n.\n“I could make a drinking game about this article: take a shot every\ntime the author deliberately highlights the femaleness of the women he\nmentions, the better to explain how\nthese ladies never said I was sexist\n…”\nPeter Brett:\nWhy I’m Renewing my SFWA Membership\n.\n“ I won’t get into the details of their remarks here, save to say that\nhaving read them for myself, I agree they were unprofessional,\ninappropriate, and not representative of the SF industry as a whole.”\nAmal El-Mohtar:\nResponses to Sexism in SFWA’s Bulletin\n.\n“VP, Regional Directors, hosts of volunteers in @sfwa, all working\nhard, are made invisible by the effort it took Resnick/Malzberg to\nwank.”\nKameron Hurley:\nDear SFWA Writers: Let’s Chat About Censorship and Bullying\n.\n“Nobody has to agree with you anymore. Nobody is afraid of you anymore.\nI know this may come as a massive shock to folks used to a position of\npower, insulated by groups of people who are happy to stroke their egos\nand soothe their souls.”\nE. Catherine Tobler:\nDear SFWA\n.\n“In all the complaints that were voiced, there was never a call for\ncensorship. There was never a call for suppression. There was a call for\nrespect.”\nJess Haines:\nSFWA, Sexism, Misogyny, and a Call For Change\n. “Mr. Resnick, Mr. Malzberg, I am not an anonymous voice. I am telling you now: what you wrote was not okay.”\nKatherine Kerr:\n“Since when is good taste censorship?\n“\nJamie Wyman:\nAn Open Letter to John Scalzi\n.\n“It’s not okay. And the reactions–these men saying that they are being\nbullied or censored because they are being called out as sexist\nbigots–is not okay.”\nNatalie Luhrs:\nLinkspam, 5/31/13 Edition\n.\n“NOPE, NO SEXISM HERE. Also, a lady totally told them it was okay to\nwrite this stuff and as everyone knows, one lady speaks for all ladies.”\nChris Gerwel:\nThe SFWA Bulletin, Censorship, Anonymity, and Representation\n. “I have a huge problem with Resnick/Malzberg’s attitude. I consider it regressive, out-dated, and condescending.”\nSL Huang:\nMore on SFWA and the Bulletin\n.\n“The people you really should be angry with are Resnick, Malzberg, and\nwhatever editor(s) let their article through.  They’re the people who\nlet down SFWA.  They’re the people who made your public face into sexist\ndouchebaggery.”\nTrisha Lynn:\nHow Jean Rabe screwed the pooch for the SFWA Bulletin and how the SFWA can make things better going forward\n.\n“I’m going to instead talk about how the entire mess could have been\navoided in the first place. And to do that, I have to throw Bulletin\nwriter/editor Jean Rabe under a bus.”\nSamantha Henderson:\nRe: SFWA Bulletin #202\n. “I am not sure if I’m done with SFWA, which is more than its Bulletin and members with 1960s sensibilities.”\nMichael Capobianco: “\nAs a further indication that the R/M dialog doesn’t represent #SFWA, Barry Malzberg isn’t even a member\n.”\nSilvia Moreno-Garcia:\nOh, Bulletin\n.\n“In their latest Bulletin rant, Mike Resnick and Barry Malzberg insist,\namong other things, that they appeared on an issue with a Warrior Woman\non the cover. They lie … They appeared in an issue with Sexy Cheesecake\nLady. If they can’t tell the difference, maybe that explains a LOT.”\nCatherine Lundoff: “\nOngoing egregious sexism in the Bulletin, which is @sfwa’s official membership magazine\n.”\nDean Gilbert: “\nFinally found out what the SFWA controversy is. Wow. Will not be buying any Resnick or Maltzburg books again for sure\n.”\nPatrick Hume: “\nAs\nfar as Resnick and Malzberg go, well, I imagine it must be very\nfrightening being dinosaurs. Misogynistic, irrelevant dinosaurs\n.”\nAlisa Krasnostein: “\nWhat\nI see is several issues that have caused offense, incl a ridiculous\ncover, and no stand from the SFWA in light of complaints.\n“\nJenny Thurman: “\nWhy,\n@sfwa, do you need a task force to determine if your own members should\nbe given professional respect within your own publication?\n“\nRoss E. Lockhart:\nTo SFWA or not to SFWA? That is the question\n.\n“Recently, when it comes to respecting female authors and editors, SFWA\nhas chosen a counterproductive path, giving a platform in the official\nSFWA Bulletin to a handful of male authors who have decided to wear\ntheir sexism outrageously…”\nUrsula Vernon:\nSFWA — Housebreaking a Puppy or Abusive Relationship\n?\n“…let me just say that it’s sad when you finally get to interact with\nsome of the Big Names of science fiction and they turn out to be old men\nyelling at clouds.”\nA. J. Fitzwater: “\nI don’t want to join a union that majority men in power think women have no place amongst them. So sad to have a dream destroyed\n.”\nAnn Kopchik: “\nI really have no words about the whole #sfwa thing. Except that I’m tired of needing a dick to be respected\n.”\nRick Novy: “\nThose\nwho don’t get the uproar over the SFWA bulletin article, read it\nreplacing words meaning ‘female’ with words meaning ‘black.’\n“\nJenn Reese: “\nSFWA is the most backwards-looking organization I belong to. We can write the future, but we can’t even live in the present.\n“\nDamien Walter: “\nThe issues with the bulletin are not acceptable, but don’t change my sense of the SFWA as a whole as very hardworking and useful\n.”\nKay Holt: “\nNot\nsaying SFWA is bad. Just that we shouldn’t put up with embedded\nmisogyny just because we otherwise benefit from an organization\n.”\nKyle Weems: “\nShame on you @sfwa. That’s hideous, backwards, and strangely atavistic for an org that writes about the future\n.”\nPatrick Nielsen Hayden: “\nAn\nunderreported aspect of being around for a long time: the horror of\nwatching your once-admired elders turn into blithering nincompoops\n.”\nAnn Aguirre: “\nI’m\nsad SFWA published antiquated dogma, then a defense of it. I’m tired of\nbeing made to feel like I’m so cute for thinking I can write SF\n.”\nRachael Acks:\nDear Barry Malzberg and Mike Resnick: F*** You.\n“If I hadn’t already had a lot of positive experiences with the older\nmale membership of the organization, I would honestly be really\nwondering about that as well, since the attitude Malzberg and Resnick\ndisplay with such pride belongs in an era that thankfully ended before I\nwas born.”\nMary Robinette Kowal:\nMy Very Complicated Reaction to Issue 202 of the Bulletin\n.\n“I’m furious, because they can undo all of the good that SFWA does. And\nlike it or not, people are right to be angry. The column is deeply\noffensive.”\nKate Milford:\nKerfluffle Watch, SFWA Edition: Call Your Detractors Liberal Fascists, Lose the Argument\n.\n“…I had learned this much: the authors consider that either those who\nobjected to the cover and dialogue in Issue 200 are at best stupid and\nat worst censorious.”\nAlma Alexander:\nThe Issue 202 Controversy\n.\n“This might involve biting the bullet, calling one tradition’s tenure\nin the Bulletin a day, and dropping the Malzberg/Resnick conversations …\nIt might even be time to start letting the WOMEN have a turn at having a\nConversation.”\nLilith Saintcrow:\nI Hope Gandhi is Right\n. “…this sort of shit makes me so. damn. tired.”\nTracy Cembor:\nGenre Drama\n. “Writers should be respected as partners in the process, and writers should treat one another as professionals and equals.”\nFerrett Steinmetz:\nAchievement Unlocked: Women’s Rights Advocate\n.\n“You’ve got more work to do.   You’ve got to see that calling them\n‘lady editors’ is actually diminishing them, that women in chainmail\nbikinis may be a long tradition but so are grinning Negro lawn jockeys…”\nSteven Saus:\nWhat to Do About Sexism In Our Official Publications\n. “This is a matter of being professional and treating\nall\nsf/f authors professionally.”\nBenjamin Rosenbaum:\nDear Barry & Mike\n. “Please cut it out. You’re better than that. Act like the men you want to be.”\nKelly McCullough: “\nFor\nthe record, the sexist dippery in the recent SFWA bulletin makes this\nmale author & SFWA member very unhappy. Not OK Resnick &\nMalzberg.\n“\nK. Tempest Bradford:\nDemanding the Best\n.\n“What needs to happen is that the all of people who belong to and run\nSFWA need to demand the best of their community. Demand that sexism no\nlonger be treated lightly, that it be called out and put down and not\ntolerated.”\nShiloh Walker:\nI’m no Barbie\n.\n“Being a woman very often means you’re going to be insulted, ignored,\ncondescended, treated as insignificant, devalued, viewed as an object,\nand the list goes on and on and on…we get so blind to the shit that\ncomes our way at times.  Maybe the problem is that we carried on with\nquiet dignity for too long.”\nHarry Connolly:\nSFWA Bulletin and Sexism in the Genre\n.\n“Speech has consequences. Speech sways the opinion of others, and\nmaybe–just maybe–that might have an effect on your life. Resnick has\nthat power; he’s going to have to get used to the idea that others have\nit, too.”\nJuliette Wade:\nThis Feminist’s Thoughts on SFWA and Cultural Change\n.\n“…they were performing a culture that is sorely out of date, and I’m\nsure they realize that because they are defending their right to do so.\nFine (though the context was inappropriate, and I’ll address that\nbelow), but they deserve the heat they are getting in response to those\nideas.”\nStina Leicht:\nFeminist Monday\n.\n“This whole thing has been building up for three issues which is why\nthere’s so much noise being made over it … And sadly, this controversy\nis just the tip of the misogyny iceberg.”\nAmy McLane.\nAttack of the Liberal Fascists\n.\n“It is bad enough to read old men rating the hotness levels of various\nwriters and editors and then getting indignant about being called out on\nit. It is gross, but you can almost sort of see how those two have\ngotten to the point of thinking that they’ve earned the right to be\ngross…”\nAndrea Phillips:\nBarbie’s Quiet Dignity and Progress\n. “And that’s just one more drop in what seems like a never-ending stream of sexism.”\nSelma Wolfe:\nChoose to be Better\n.\n“The men that endlessly defend their own sexism could choose not to\ndefend it. They could choose to focus on women’s opinions, rather than\ntheir appearances.”\nT. M. Thomas.\nSFWA in the News\n.\n“And it’s why I think, perhaps deluded and defensive and not malicious\nat first, why the dinosaurs of the SFWA need to offer immediate\napologies and stop trying to make themselves the victims of the piece.”\nLindsey Bieda. “\n‘Hey,\nthis thing you are doing is shitty’ is not censorship and free speech\ndoes not mean freedom from consequences or criticism.\n“\nJeaniene Frost:\nSFWA – Not Today\n.\n“I’m glad Scalzi agrees these are legitimate concerns that affect all\nSFWA members/associates and isn’t falling for the ‘but it’s just whining\nfrom a few liberal fascists!’ defense, but I also heave a weary sigh of\nagreement with author Jenny Truman’s Tweet: ‘Why, @sfwa, do you need a\ntask force to determine if your own members should be given professional\nrespect within your own publication?’”\nMatt Yaeger:\nSpace Sexism\n.\n“If you can’t defend yourself without wrapping it up in an irrelevant\nconclusion that people who disagree with you must be censorship Nazis\n(hows that for loaded terms?) then you’ve already lost your position.”\nKarina Cooper:\nDamned If You Do(n’t)\n.\n“We live in a world where men are judged by the quality and quantity of\ntheir bodies of work, and women are judged by their bodies; where men\nare called writers, authors, artists and creatives, and women are called\nlady writers and authoresses and ‘beauty pageant beautiful’.”\nLauren Roy:\nBeing Part of the Solution\n.\n“It can make newbies feel quite unwelcome when you see that someone out\nthere — someones who are big names! — think you’re not a writer but a\nlady writer\n, as though my gender puts an asterisk beside anything I do.”\nBarbara Barnett:\nNot that the Intrawebs Need Another Post on the SFWA Kerfuffle\n.\n“…the publication of a professional organization should not serve as a\nmegaphone for speech that disrespects a large portion of the\norganization’s membership.”\nAlisa Krasnostein:\nObservations from the SFWA Bulletin Fiasco – Part 1\n. “But here’s what really gets me annoyed. How does freedom of speech, the concept, mean that it only applies to you?”\nJ. N. Duncan: “\nDear\nSFWA, it’s not your job to be sexism-free (you can’t), but you do have\nobligation to pursue awareness and act on it with due-diligence.\n“\nAlan Baxter:\nSFWA, Sexism in SFF and Missing the Point\n.\n“…members of the Science Fiction and Fantasy Writers of America wrote a\npiece in the official publication, the SFWA Bulletin, that is\nastounding in its prehistoric approach to gender and dealing with\njustifiable complaints.”\nJane Little (Dear Author):\nSFF Old Guard\n.\n“…the official bulletin of the Science Fiction Writer’s Association for\nthe last three months has kind of been an embarrassment to SFWA, at\nleast to those of us looking from the outside in.”\nIlona Andrews: “\nI’ve looked at their Bulletin talks and they are out of touch\n.”\nAnn Laurel Kopchik:\nMy Letter to SFWA\n.\n“But the continuing problems with blatant sexism in an official\npublication of SFWA makes me wonder if I’ll be treated as an equal when I\ndo meet the requirements to join SFWA.”\nShaun Duke:\nSFWA, Sexism, and Progress\n.\n“ Sexism is … bullshit.  We should call it out when we see it, no\nmatter our genders.  And we should definitely make sure it no longer\nuses the voice of the various professional organizations in our field…”\nThomas Pluck:\nEveryday Sexism and Giant Space-Dicks\n.\n“…if science fiction writers can imagine unheard-of future\ncivilizations, they can unshackle their brains from the ’60s when they\nwere cocks of the walk, and start treating women as equals…”\nM. E. Garber:\nAre We Still Here? Really?\n“What woman wants to become part of an organization that objectifies\nher, and belittles both her and her ability to work and achieve?”\nBonus points for whomever can figure out how many of these\nself-appointed censors have published novels with more “offensive”\ncovers than the Red Sonja illustration on the Bulletin cover that has\ninspired such an epic collective hissy fit.\nIt’s been interesting to see that Laura Resnick, who is usually very quick to leap in and loudly condemn anyone suspected of insufficient enthusiasm for equalitarianism, has been silent concerning the public witchburning of her father. It’s also intriguing to see how these liberal fascists claim labeling two old men “sexist\nbigots” and openly calling for an end to their column is acceptable, but\nidentifying them as “censorious” is, and here I quote the SFWA\nmoderator, “abusive behavior”.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-05T07:23:00+00:00"
}