{
  "url": "https://voxday.net/2013/06/19/setting-record-straig-3/",
  "scraped_at": "2025-12-14T22:32:31.772205",
  "title": "Setting the record straight",
  "date_display": "June 19, 2013",
  "date_iso": "2013-06-19T17:35:00+00:00",
  "date_from_url": "2013-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Two days ago, I referenced one of our previous game innovations in discussing the latest one, which naturally inspired the sort of individual who firmly believes their ideological opponents cannot possibly have ever accomplished anything of note to leap in with his ignorant version of events:</p><blockquote class=\"tr_bq\"><p> Vox: It will probably surprise no one to discover that the primary response of the forward-thinking futurists was to declare their opinion that <i>First Sword</i> was unlikely to sell enough ebooks to matter one way or the other, as if the universal adoption of 3D hardware texture-mapped acceleration that Big Chilly and I introduced in <i>Rebel Moon</i>, and the 16-bit color we introduced in <i>Rebel Moon Rising</i>, had anything at all to do with how many copies of those games were sold. </p><p>Obvious: It’s really too bad that the game POD had full MMX support and was released a full six months before <i>Rebel Moon Rising</i>.</p></blockquote><p>First of all, if one was to go by the publicly available information from IGN and GameSpy – which is wrong, by the way – one would learn that RMR was released by GT Interactive on December 22, 1996, which is obviously before POD was released by UbiSoft on February 28, 1997.  But the fact is that both games were actually released together for the first time on the same CD by Intel on January 8, 1997. However, the following YouTube video should make it clear that not only were both of us incorrect, the entire MMX-related discussion is irrelevant as I’d forgotten that Big Chilly and I actually introduced both 16-bit color and dynamic lighting in <i>Rebel Moon</i>, which was released as part of the original VL bus 3D Blaster package back in November 1995.</p><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/c7tTYwNDWlU?feature=player_detailpage\" width=\"640\"></iframe></p><p>I don’t know what possesses these people with the desperate need to denigrate everything I do, but history tends to render their efforts pointless.  I have little doubt that if in-game digital sales are successful and become standard in the industry, the anklebiters of tomorrow will do their best to deny that I had anything to do with it, let alone came up with the concept. Anyhow, this sort of thing suffices to indicate how the Left’s revisionist instincts penetrate even to the pettiest micro level.</p><p>I was wondering how I’d managed to forget that we had the advanced lighting model in our first game, and I realized that I tend to think of the dynamic lighting in terms of the laser effects.  The colored lighting is so much more effective when the lasers light up the corridors as they fly back and forth, that since the first one was lacking that particular application of it, I assumed that we’d been still using the same 8-bit palette that everyone else had been until then. </p><p>One bit of trivia that might be interesting; we were also the very first to discover the reason for the huge gap between expectations for MMX and the disappointing results.  And by very first, I mean that I was the one who had to call Intel and give the guy managing the project the bad news.  We couldn’t figure out why the game was running at about one-quarter the Intel-estimated frame rates when Big Chilly decided to simplify things as much as possible and simply blit a black rectangle.</p><p>I still remember his eyes narrowing in suspicion as he stared at the results, pointed to them, and said, “now why does that number look familiar?”  It was because it was precisely the same as the speed limit of the PCI bus.  It quickly became clear that Intel had produced a very fast CPU capable of processing graphics at four times the rate that the communications bus on the graphics card could accomodate them.  This had a huge effect on everything, because it meant that we couldn’t use the higher resolutions for which we’d been creating the art, but had to back it all down to the same resolution we’d used previously with the Creative Labs card.</p><p>The game still looked pretty enough and got a decent review from CGW, but it wasn’t anywhere nearly as graphically beautiful as it should have been, even considering that it was a 2.5D game.</p><p>And that wasn’t our only contribution to the MMX project.  I was also responsible for killing what was intended as Intel’s original marketing slogan for it: “On the<br> ‘Net/Off the ‘Net”.  But that is a story for another time.  And on a tangentially related note that no one but Big Chilly will grasp the connection, SWEET BILLY GATES but the insanity of certain console makers truly knows no bounds.</br></p><p>“<i>The new Oddworld game <i>New ‘n’ Tasty</i> is coming to every platform in the current generation and even the next generation but <a href=\"http://www.forbes.com/sites/insertcoin/2013/06/16/why-oddworld-is-coming-to-every-platform-except-xbox/?partner=yahootix\">not the Xbox One</a>.<br> It’s not that developer Oddworld Inhabitants isn’t porting the game.<br> It’s not that they hate Microsoft or the Xbox One. No, it’s that<br> Microsoft has taken an anti-indie dev stance with the Xbox One. While<br> the game industry is moving to Kickstarter and self-funded shops,<br> Microsoft has decided all developers must have a publisher to grace<br> their console.”</br></br></br></br></br></br></i></p><p>This Xbox One launch is reminding me more and more of the Sega Dreamcast. </p></div>",
  "content_text": "Two days ago, I referenced one of our previous game innovations in discussing the latest one, which naturally inspired the sort of individual who firmly believes their ideological opponents cannot possibly have ever accomplished anything of note to leap in with his ignorant version of events:\nVox: It will probably surprise no one to discover that the primary response of the forward-thinking futurists was to declare their opinion that\nFirst Sword\nwas unlikely to sell enough ebooks to matter one way or the other, as if the universal adoption of 3D hardware texture-mapped acceleration that Big Chilly and I introduced in\nRebel Moon\n, and the 16-bit color we introduced in\nRebel Moon Rising\n, had anything at all to do with how many copies of those games were sold.\nObvious: It’s really too bad that the game POD had full MMX support and was released a full six months before\nRebel Moon Rising\n.\nFirst of all, if one was to go by the publicly available information from IGN and GameSpy – which is wrong, by the way – one would learn that RMR was released by GT Interactive on December 22, 1996, which is obviously before POD was released by UbiSoft on February 28, 1997.  But the fact is that both games were actually released together for the first time on the same CD by Intel on January 8, 1997. However, the following YouTube video should make it clear that not only were both of us incorrect, the entire MMX-related discussion is irrelevant as I’d forgotten that Big Chilly and I actually introduced both 16-bit color and dynamic lighting in\nRebel Moon\n, which was released as part of the original VL bus 3D Blaster package back in November 1995.\nI don’t know what possesses these people with the desperate need to denigrate everything I do, but history tends to render their efforts pointless.  I have little doubt that if in-game digital sales are successful and become standard in the industry, the anklebiters of tomorrow will do their best to deny that I had anything to do with it, let alone came up with the concept. Anyhow, this sort of thing suffices to indicate how the Left’s revisionist instincts penetrate even to the pettiest micro level.\nI was wondering how I’d managed to forget that we had the advanced lighting model in our first game, and I realized that I tend to think of the dynamic lighting in terms of the laser effects.  The colored lighting is so much more effective when the lasers light up the corridors as they fly back and forth, that since the first one was lacking that particular application of it, I assumed that we’d been still using the same 8-bit palette that everyone else had been until then.\nOne bit of trivia that might be interesting; we were also the very first to discover the reason for the huge gap between expectations for MMX and the disappointing results.  And by very first, I mean that I was the one who had to call Intel and give the guy managing the project the bad news.  We couldn’t figure out why the game was running at about one-quarter the Intel-estimated frame rates when Big Chilly decided to simplify things as much as possible and simply blit a black rectangle.\nI still remember his eyes narrowing in suspicion as he stared at the results, pointed to them, and said, “now why does that number look familiar?”  It was because it was precisely the same as the speed limit of the PCI bus.  It quickly became clear that Intel had produced a very fast CPU capable of processing graphics at four times the rate that the communications bus on the graphics card could accomodate them.  This had a huge effect on everything, because it meant that we couldn’t use the higher resolutions for which we’d been creating the art, but had to back it all down to the same resolution we’d used previously with the Creative Labs card.\nThe game still looked pretty enough and got a decent review from CGW, but it wasn’t anywhere nearly as graphically beautiful as it should have been, even considering that it was a 2.5D game.\nAnd that wasn’t our only contribution to the MMX project.  I was also responsible for killing what was intended as Intel’s original marketing slogan for it: “On the\n‘Net/Off the ‘Net”.  But that is a story for another time.  And on a tangentially related note that no one but Big Chilly will grasp the connection, SWEET BILLY GATES but the insanity of certain console makers truly knows no bounds.\n“\nThe new Oddworld game\nNew ‘n’ Tasty\nis coming to every platform in the current generation and even the next generation but\nnot the Xbox One\n.\nIt’s not that developer Oddworld Inhabitants isn’t porting the game.\nIt’s not that they hate Microsoft or the Xbox One. No, it’s that\nMicrosoft has taken an anti-indie dev stance with the Xbox One. While\nthe game industry is moving to Kickstarter and self-funded shops,\nMicrosoft has decided all developers must have a publisher to grace\ntheir console.”\nThis Xbox One launch is reminding me more and more of the Sega Dreamcast.",
  "tags": [
    "anklebiters",
    "games",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-19T16:35:00+00:00"
}