{
  "url": "https://voxday.net/2013/06/14/sf-vs-science/",
  "scraped_at": "2025-12-14T22:31:56.709570",
  "title": "SF vs science",
  "date_display": "June 14, 2013",
  "date_iso": "2013-06-14T16:30:00+00:00",
  "date_from_url": "2013-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Shattersnipe would appear to favor <a href=\"http://fozmeadows.wordpress.com/2013/06/14/reconciliation-a-response-to-theodore-beale/\">a rhetorical approach</a> to the seemingly indisputable observation that not all human population groups are equally civilized:</p><blockquote class=\"tr_bq\"><p> And there is white-hot anger, so fierce you become the eye within the<br> maelstrom of your own rage, calm as your pulse exceeds the beats of a<br> marathon runner, calm as your fingers grasp and clench, calm as you grip<br> your aggressor’s throat and <i>squeeze</i>.</br></br></br></p><p>This last I feel for Theodore Beale.</p><div style=\"text-align: left;\"> Recently, I blogged about <a href=\"http://fozmeadows.wordpress.com/2013/06/02/old-men-yelling-at-clouds-sfwa-lunacy/\">sexism in the SFWA Bulletin</a>.<br> I wrote that piece as a self-declared comic rant, the tone inspired by<br> anger at men who ultimately meant well, however offensive and outdated<br> their efforts at showing it. I received a lot of support for having done<br> so; but of course, there was a flipside. My anger, said some, was<br> unseemly and unprofessional. My arguments were poorly reasoned. I was<br> preaching to the choir. I was the gendered pejorative of choice. But the<br> thing is, I can shrug that off. I deal out enough criticism that I<br> expect to receive my share in return, and whatever form that pushback<br> takes, it very rarely shocks me. By the standards of women on the<br> internet, in fact, I’m pretty lucky. I’ve received a minimum of rape<br> threats, I rarely get called a cunt, and if some of my detractors are<br> uncivil, then I can usually dish it out in return. I was bullied,<br> harassed, attacked and assaulted enough at school for being forthright,<br> female and unfeminine that written threats just don’t chill me the way<br> they used to. (They still chill me, of course. And I didn’t suffer<br> nearly as much as others. Nonetheless, the comparison stands – and no,<br> this isn’t an invitation to try harder.)</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"text-align: left;\"></div><div style=\"text-align: left;\"> The point being, I have privilege, and that<br> privilege protects me. I’m a middle-class, well-educated, straight white<br> ciswoman with a functional, middle-class white family, and however much<br> the misogyny gets to me at times, I can draw on that privilege – on<br> that firmly entrenched sense of self-worth and the emotional, social and<br> financial safety net which supports it – and fight back. I belong to<br> the second most privileged group of people on the planet, and whatever<br> abuse I still suffer regardless of that, I have the cultural status to<br> counter it and be heard. As an individual, therefore, I’m hard to<br> oppress. I have privilege. I have resilience. I have opinions.</br></br></br></br></br></br></br></br></br></div><div style=\"text-align: left;\"></div><div style=\"text-align: left;\"> And I have anger….</div><div style=\"text-align: left;\"></div><div style=\"text-align: left;\"> I feel poisoned even typing that. Sickened.<br> Trembling. I cannot even imagine how Jemisin feels. Nor am I attempting<br> to speak for her. She is, without a doubt, one of the most brilliant<br> women – one of the most brilliant people and writers, period – active in<br> SFF today, and my voice in this matter is not a replacement for hers.</br></br></br></br></div><div style=\"text-align: left;\"></div><div style=\"text-align: left;\"> I am speaking because it would be a crime against conscience not to.</div><div style=\"text-align: left;\"></div><div style=\"text-align: left;\"> I am speaking because a world where men like<br> Theodore Beale are left to speak unchallenged by the weariness of their<br> opponents is not a world I want to live in. I am speaking because my privilege affords me a chance to be heard.</br></br></div><div style=\"text-align: left;\"></div><div style=\"text-align: left;\"> And I am speaking because of the bodily<br> disgust, the rage and hatred and putrescence I feel for members of my<br> own race, both now and throughout history, who speak of savages and<br> lesser beings, of civilisation and the right to kill those outside or<br> perceived to be incapable of it; who speak, as Beale does, as though<br> people of colour are a genetically different, inferior species of human<br> when compared to his Aryan ancestors.</br></br></br></br></br></br></div><div style=\"text-align: left;\"></div><div style=\"text-align: left;\"> This is my Reconciliation.</div></blockquote><div style=\"text-align: left;\"> The passion of it all just gives you shivers, doesn’t it?  It’s hard to decide what is the most amusing part of this hysterical “dabacle”.  It’s a little subtle, perhaps, but I think, in the end, my favorite part is where she declares the “bodily<br> disgust, the rage and hatred and putrescence” she feels for the idea that “people of colour” are “genetically different”.</br></div><div style=\"text-align: left;\"> What is so funny about this is that it all goes back to 2005, and a WND column when I pointed out that women don’t write much hard science fiction because they have little aptitude or inclination for science.  And now, eight years later, we see a spelling-challenged female SFWA writer who is frothing-at-the-mouth furious at the idea that Africans are a genetically distinct population group, a group that therefore must necessarily be either inferior or superior to other population groups.</div><div style=\"text-align: left;\"> In other words, she is a science fiction writer who is deeply and violently offended by science.  This should suffice to explain why science fiction has qualitatively declined over the years.</div><p>But we shouldn’t be too harsh on her.  After all, she does an excellent job of proving my original point in my response to Ms Jemisin, which is that there can be no reconciliation between the observant and the delusional.  This isn’t a challenge to my views, but rather, an exemplary underlining of them.</p></div>",
  "content_text": "Shattersnipe would appear to favor\na rhetorical approach\nto the seemingly indisputable observation that not all human population groups are equally civilized:\nAnd there is white-hot anger, so fierce you become the eye within the\nmaelstrom of your own rage, calm as your pulse exceeds the beats of a\nmarathon runner, calm as your fingers grasp and clench, calm as you grip\nyour aggressor’s throat and\nsqueeze\n.\nThis last I feel for Theodore Beale.\nRecently, I blogged about\nsexism in the SFWA Bulletin\n.\nI wrote that piece as a self-declared comic rant, the tone inspired by\nanger at men who ultimately meant well, however offensive and outdated\ntheir efforts at showing it. I received a lot of support for having done\nso; but of course, there was a flipside. My anger, said some, was\nunseemly and unprofessional. My arguments were poorly reasoned. I was\npreaching to the choir. I was the gendered pejorative of choice. But the\nthing is, I can shrug that off. I deal out enough criticism that I\nexpect to receive my share in return, and whatever form that pushback\ntakes, it very rarely shocks me. By the standards of women on the\ninternet, in fact, I’m pretty lucky. I’ve received a minimum of rape\nthreats, I rarely get called a cunt, and if some of my detractors are\nuncivil, then I can usually dish it out in return. I was bullied,\nharassed, attacked and assaulted enough at school for being forthright,\nfemale and unfeminine that written threats just don’t chill me the way\nthey used to. (They still chill me, of course. And I didn’t suffer\nnearly as much as others. Nonetheless, the comparison stands – and no,\nthis isn’t an invitation to try harder.)\nThe point being, I have privilege, and that\nprivilege protects me. I’m a middle-class, well-educated, straight white\nciswoman with a functional, middle-class white family, and however much\nthe misogyny gets to me at times, I can draw on that privilege – on\nthat firmly entrenched sense of self-worth and the emotional, social and\nfinancial safety net which supports it – and fight back. I belong to\nthe second most privileged group of people on the planet, and whatever\nabuse I still suffer regardless of that, I have the cultural status to\ncounter it and be heard. As an individual, therefore, I’m hard to\noppress. I have privilege. I have resilience. I have opinions.\nAnd I have anger….\nI feel poisoned even typing that. Sickened.\nTrembling. I cannot even imagine how Jemisin feels. Nor am I attempting\nto speak for her. She is, without a doubt, one of the most brilliant\nwomen – one of the most brilliant people and writers, period – active in\nSFF today, and my voice in this matter is not a replacement for hers.\nI am speaking because it would be a crime against conscience not to.\nI am speaking because a world where men like\nTheodore Beale are left to speak unchallenged by the weariness of their\nopponents is not a world I want to live in. I am speaking because my privilege affords me a chance to be heard.\nAnd I am speaking because of the bodily\ndisgust, the rage and hatred and putrescence I feel for members of my\nown race, both now and throughout history, who speak of savages and\nlesser beings, of civilisation and the right to kill those outside or\nperceived to be incapable of it; who speak, as Beale does, as though\npeople of colour are a genetically different, inferior species of human\nwhen compared to his Aryan ancestors.\nThis is my Reconciliation.\nThe passion of it all just gives you shivers, doesn’t it?  It’s hard to decide what is the most amusing part of this hysterical “dabacle”.  It’s a little subtle, perhaps, but I think, in the end, my favorite part is where she declares the “bodily\ndisgust, the rage and hatred and putrescence” she feels for the idea that “people of colour” are “genetically different”.\nWhat is so funny about this is that it all goes back to 2005, and a WND column when I pointed out that women don’t write much hard science fiction because they have little aptitude or inclination for science.  And now, eight years later, we see a spelling-challenged female SFWA writer who is frothing-at-the-mouth furious at the idea that Africans are a genetically distinct population group, a group that therefore must necessarily be either inferior or superior to other population groups.\nIn other words, she is a science fiction writer who is deeply and violently offended by science.  This should suffice to explain why science fiction has qualitatively declined over the years.\nBut we shouldn’t be too harsh on her.  After all, she does an excellent job of proving my original point in my response to Ms Jemisin, which is that there can be no reconciliation between the observant and the delusional.  This isn’t a challenge to my views, but rather, an exemplary underlining of them.",
  "tags": [
    "science",
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-14T15:30:00+00:00"
}