{
  "url": "https://voxday.net/2013/06/13/sfwa-forum-moderated-posts/",
  "scraped_at": "2025-12-14T22:31:49.427524",
  "title": "SFWA Forum: the “moderated” posts",
  "date_display": "June 13, 2013",
  "date_iso": "2013-06-13T17:00:00+00:00",
  "date_from_url": "2013-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since the freethinkers at the SFWA Forum are presently debating whether my comments can be permitted in the very place where I am attacked with the most badthink words the rabbits can produce, I hereby give myself permission, as per the SFWA Forum guidelines, to quote my posts here before they are disappeared again:</p><div class=\"posted_info desc lighter ipsType_small\"> <b>1. Posted Today, 03:41 AM</b></div><div class=\"posted_info desc lighter ipsType_small\">  </div><p>Her speech is ridiculous, her call for reconciliation is impossible, and, it should be noted, MS Jemisin is lying about me:</p><p><i>“For the past few days I’ve also been observing a “kerfuffle”, as<br> some call it, in reaction to the Science Fiction and Fantasy Writers’<br> of America’s latest professional journal, the Bulletin. Some of you may<br> also have been following the discussion; hopefully not all of you. To<br> summarize: two of the genre’s most venerable white male writers made<br> some comments in a series of recent articles which have been decried as<br> sexist and racist by most of the organization’s membership. Now, to put<br> this in context: the membership of SFWA also recently voted in a new<br> president. There were two candidates — one of whom was a self-described<br> misogynist, racist, anti-Semite, and a few other flavors of asshole. In<br> this election he lost by a landslide… but he still earned ten percent of<br> the vote. SFWA is small; only about 500 people voted in total, so we’re<br> talking less than 50 people.”</br></br></br></br></br></br></br></br></br></br></br></br></i></p><p>I am not “a self-described misogynist, racist, anti-Semite, and a few<br> other flavors of asshole”.  It is John Scalzi, Patrick Nielsen Hayden,<br> and Theresa Nielsen Hayden who have described me that way.  I merely<br> posited that even if their false claims were true, I would still be the<br> right choice for SFWA president given my industry connections and<br> executive experience. Nor have I ever made any active efforts to take<br> away the woman’s “most basic rights”; I am in fact a libertarian. NK<br> Jemisin’s speech is not only ignorant, it is blatantly and provably<br> dishonest with regards to me, with regards to the history of science<br> fiction, and with regards to Florida and Texas state law.</br></br></br></br></br></br></br></br></br></p><p>I hereby demand a public apology from Ms Jemisin.</p><p>Moreover, based on the particular nature of her false claim, Ms Jemisin has clearly violated the Forum rules, which state <i>“The<br> SFWA discussion forums are for SFWA members only, and all posts made<br> here are confidential. Material may not be re-posted outside these<br> forums without the explicit permission of their authors.”</br></br></br></i>  Her false statement was clearly based on my announcement which was posted here in the forums by Lawrence Schoen.</p><p>I therefore also request that she be given a warning point by a Forum moderator.</p><p><b>2. Posted Today, 07:52 AM</b></p><p>[PERMISSION TO QUOTE REQUESTED]</p><p>She did nothing of the kind.  I have never described myself anywhere<br> as misogynist, racist, or anti-Semite and a search of my blog will prove<br> that.  The only time I’ve even bothered to address such stupid<br> accusations together is here, in the Forum, which is why it is obvious<br> that she violated SFWA confidentiality.  I have zero interest in<br> debating with you, Mr. Sanford. I enjoy challenges and you’re not half<br> as intelligent as people I’ve crushed in three exchanges.</br></br></br></br></br></br></p><p>[PERMISSION TO QUOTE REQUESTED]</p><p> I should certainly hope so.  I was warned for violating SFWA<br> confidentiality once because I was unaware even partial quotes were not<br> permitted.  I expect Ms Jemisin to be similarly disciplined.  If not,<br> well, then we’ll know just how impartial the moderators are.  Anyhow,<br> 20x more people will read this on my blog than will read it here.</br></br></br></br></p><p>[PERMISSION TO QUOTE REQUESTED]</p><p> Reality isn’t racist, Mr. Sanford.  Neither is history.  They simply<br> are.  And you can’t escape the fact that Ms Jemisin lied about me and<br> about the state laws of Texas and Florida.  As some of my Australian<br> readers have already pointed out, Ms Jemisin has no idea what she’s<br> talking about concerning Australian race relations either.</br></br></br></br></p><p><b>3. Posted Today, 08:15 AM</b></p><p>[PERMISSION TO QUOTE REQUESTED]</p><p>So, if I’d simply written: “That post on her blog is one of the most<br> racist attacks I’ve seen in a long time.”, that would not require<br> moderation?  Who are you trying to kid?</br></br></p><p>Meanwhile, the President-elect, Steven Gould, notes: “Lots<br> of people calling for the expulsion of this guy. With reason.”</br></p><p>Well, my lawyer and I would certainly enjoy seeing them try to expel a paid-up Lifetime member for the thoughtcrime of expressing his opinion.  You see, I’ve already got the entire SF Forum on record, so it would be fascinating to see them attempt to defend various statements by certain authors while claiming that mine were worthy of expulsion.</p></div>",
  "content_text": "Since the freethinkers at the SFWA Forum are presently debating whether my comments can be permitted in the very place where I am attacked with the most badthink words the rabbits can produce, I hereby give myself permission, as per the SFWA Forum guidelines, to quote my posts here before they are disappeared again:\n1. Posted Today, 03:41 AM\nHer speech is ridiculous, her call for reconciliation is impossible, and, it should be noted, MS Jemisin is lying about me:\n“For the past few days I’ve also been observing a “kerfuffle”, as\nsome call it, in reaction to the Science Fiction and Fantasy Writers’\nof America’s latest professional journal, the Bulletin. Some of you may\nalso have been following the discussion; hopefully not all of you. To\nsummarize: two of the genre’s most venerable white male writers made\nsome comments in a series of recent articles which have been decried as\nsexist and racist by most of the organization’s membership. Now, to put\nthis in context: the membership of SFWA also recently voted in a new\npresident. There were two candidates — one of whom was a self-described\nmisogynist, racist, anti-Semite, and a few other flavors of asshole. In\nthis election he lost by a landslide… but he still earned ten percent of\nthe vote. SFWA is small; only about 500 people voted in total, so we’re\ntalking less than 50 people.”\nI am not “a self-described misogynist, racist, anti-Semite, and a few\nother flavors of asshole”.  It is John Scalzi, Patrick Nielsen Hayden,\nand Theresa Nielsen Hayden who have described me that way.  I merely\nposited that even if their false claims were true, I would still be the\nright choice for SFWA president given my industry connections and\nexecutive experience. Nor have I ever made any active efforts to take\naway the woman’s “most basic rights”; I am in fact a libertarian. NK\nJemisin’s speech is not only ignorant, it is blatantly and provably\ndishonest with regards to me, with regards to the history of science\nfiction, and with regards to Florida and Texas state law.\nI hereby demand a public apology from Ms Jemisin.\nMoreover, based on the particular nature of her false claim, Ms Jemisin has clearly violated the Forum rules, which state\n“The\nSFWA discussion forums are for SFWA members only, and all posts made\nhere are confidential. Material may not be re-posted outside these\nforums without the explicit permission of their authors.”\nHer false statement was clearly based on my announcement which was posted here in the forums by Lawrence Schoen.\nI therefore also request that she be given a warning point by a Forum moderator.\n2. Posted Today, 07:52 AM\n[PERMISSION TO QUOTE REQUESTED]\nShe did nothing of the kind.  I have never described myself anywhere\nas misogynist, racist, or anti-Semite and a search of my blog will prove\nthat.  The only time I’ve even bothered to address such stupid\naccusations together is here, in the Forum, which is why it is obvious\nthat she violated SFWA confidentiality.  I have zero interest in\ndebating with you, Mr. Sanford. I enjoy challenges and you’re not half\nas intelligent as people I’ve crushed in three exchanges.\n[PERMISSION TO QUOTE REQUESTED]\nI should certainly hope so.  I was warned for violating SFWA\nconfidentiality once because I was unaware even partial quotes were not\npermitted.  I expect Ms Jemisin to be similarly disciplined.  If not,\nwell, then we’ll know just how impartial the moderators are.  Anyhow,\n20x more people will read this on my blog than will read it here.\n[PERMISSION TO QUOTE REQUESTED]\nReality isn’t racist, Mr. Sanford.  Neither is history.  They simply\nare.  And you can’t escape the fact that Ms Jemisin lied about me and\nabout the state laws of Texas and Florida.  As some of my Australian\nreaders have already pointed out, Ms Jemisin has no idea what she’s\ntalking about concerning Australian race relations either.\n3. Posted Today, 08:15 AM\n[PERMISSION TO QUOTE REQUESTED]\nSo, if I’d simply written: “That post on her blog is one of the most\nracist attacks I’ve seen in a long time.”, that would not require\nmoderation?  Who are you trying to kid?\nMeanwhile, the President-elect, Steven Gould, notes: “Lots\nof people calling for the expulsion of this guy. With reason.”\nWell, my lawyer and I would certainly enjoy seeing them try to expel a paid-up Lifetime member for the thoughtcrime of expressing his opinion.  You see, I’ve already got the entire SF Forum on record, so it would be fascinating to see them attempt to defend various statements by certain authors while claiming that mine were worthy of expulsion.",
  "tags": [
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-13T16:00:00+00:00"
}