{
  "url": "https://voxday.net/2013/06/21/spontaneous-automotive-combustion/",
  "scraped_at": "2025-12-14T22:32:42.765122",
  "title": "Spontaneous automotive combustion",
  "date_display": "June 21, 2013",
  "date_iso": "2013-06-21T12:50:00+00:00",
  "date_from_url": "2013-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The LAPD <a href=\"http://www.latimes.com/local/lanow/la-me-ln-no-foul-play-suspected-in-michael-hastings-death-lapd-saysd-20130620,0,7630869.story\">quickly rules out foul play</a> in the fiery demise of Michael Hastings, investigative reporter:</p><blockquote class=\"tr_bq\"><p> The <a class=\"taxInlineTagLink\" href=\"http://www.latimes.com/topic/crime-law-justice/police/los-angeles-police-department-ORGOV000939.topic\" id=\"ORGOV000939\" title=\"Los Angeles Police Department\">Los Angeles Police Department</a> said there appears to be no foul play in the one-vehicle accident that killed <a href=\"http://www.latimes.com/local/lanow/la-me-ln-michael-hastings-dies-car-crash-20130618,0,7611310.story\" rel=\"noopener\" target=\"_blank\">journalist Michael Hastings</a>.</p><p>The Los Angeles County coroner on Thursday<br> positively identified Hastings as the driver of a Mercedes that crashed<br> on Highland Avenue near Melrose Avenue on Tuesday morning. Hastings’ involvement with hot-button stories has led to a<br> variety of conspiracy theories arising on the Internet over his death.<br> But LAPD officials said the incident appears to have been an accident<br> and that no other vehicles were involved. Officials are trying to<br> determine whether there was a mechanical problem with the car. The<br> sources spoke on the condition of anonymity because the case was<br> ongoing….</br></br></br></br></br></br></br></br></p><p>Hastings was best known for a <a href=\"http://www.rollingstone.com/politics/news/the-runaway-general-20100622\" rel=\"noopener\" target=\"_blank\">2010 Rolling Stone profile</a> that led to the resignation of Gen. Stanley McChrystal. Hastings was a contributing editor to the magazine.</p></blockquote><p>In related news, the Federal Security Service announced that it suspects no foul play in the recent series of Russian emigrant deaths in the United Kingdom.  Has anyone informed the LAPD that it is only in the movies that Mercedes automobiles explode on impact?</p><p>Steve Sailer, who lives very close to the scene, appears to have <a href=\"http://isteve.blogspot.com/2013/06/im-glad-thats-all-cleared-up.html\">a few doubts </a>himself:</p><blockquote class=\"tr_bq\"><p> Nothing to see here, folks, move along, nothing to see here. It’s just<br> the top investigative journalist of his generation charbroiled in his<br> new Mercedes, so keep moving. Hey, did you hear about Kim Kardashian?<br> Now, that’s what I call <i>news</i>.</br></br></br></p></blockquote><p>I wonder if <a href=\"http://www.rollingstone.com/politics/blogs/taibblog/michael-hastings-reporter-20130619\">Matt Taibbi</a> is considering a move to Hong Kong?  First Breitbart, now Hastings.  At the very least, he should stay away from Los Angeles.</p><p> UPDATE: One of the witnesses said: “It sounded like a bomb going off.  The house shook; the windows were rattling.”</p></div>",
  "content_text": "The LAPD\nquickly rules out foul play\nin the fiery demise of Michael Hastings, investigative reporter:\nThe\nLos Angeles Police Department\nsaid there appears to be no foul play in the one-vehicle accident that killed\njournalist Michael Hastings\n.\nThe Los Angeles County coroner on Thursday\npositively identified Hastings as the driver of a Mercedes that crashed\non Highland Avenue near Melrose Avenue on Tuesday morning. Hastings’ involvement with hot-button stories has led to a\nvariety of conspiracy theories arising on the Internet over his death.\nBut LAPD officials said the incident appears to have been an accident\nand that no other vehicles were involved. Officials are trying to\ndetermine whether there was a mechanical problem with the car. The\nsources spoke on the condition of anonymity because the case was\nongoing….\nHastings was best known for a\n2010 Rolling Stone profile\nthat led to the resignation of Gen. Stanley McChrystal. Hastings was a contributing editor to the magazine.\nIn related news, the Federal Security Service announced that it suspects no foul play in the recent series of Russian emigrant deaths in the United Kingdom.  Has anyone informed the LAPD that it is only in the movies that Mercedes automobiles explode on impact?\nSteve Sailer, who lives very close to the scene, appears to have\na few doubts\nhimself:\nNothing to see here, folks, move along, nothing to see here. It’s just\nthe top investigative journalist of his generation charbroiled in his\nnew Mercedes, so keep moving. Hey, did you hear about Kim Kardashian?\nNow, that’s what I call\nnews\n.\nI wonder if\nMatt Taibbi\nis considering a move to Hong Kong?  First Breitbart, now Hastings.  At the very least, he should stay away from Los Angeles.\nUPDATE: One of the witnesses said: “It sounded like a bomb going off.  The house shook; the windows were rattling.”",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-21T11:50:00+00:00"
}