{
  "url": "https://voxday.net/2013/06/10/stampeding-herd/",
  "scraped_at": "2025-12-14T22:31:29.818149",
  "title": "Stampeding the herd",
  "date_display": "June 10, 2013",
  "date_iso": "2013-06-10T20:30:00+00:00",
  "date_from_url": "2013-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sarah Hoyt <a href=\"http://accordingtohoyt.com/2013/06/10/moo-like-this/\">contemplates the bovine thinking</a> that led to the SFWA’s recent “storm in a B-cup”.  After all, it’s hard for the older members of the herd to keep up:</p><blockquote class=\"tr_bq\"><p> I got very – as opposed to a bit – worried in the eighties when women<br> started claiming that men talking them into sex was “rape.”  The<br> reasoning seemed to be that men had awesome talking skills and a mere<br> woman could not defend herself against all those double-slick words.</br></br></br></p><p>I thought “OMG, they’re going Victorian.”</p><p>Since then we’ve gone to lookism (the ugly girl’s attempt to take<br> attention from the pretty one) and to a man even looking at a woman too<br> long, or asking for a date being considered “harassment.”</br></br></p><p>In fact, any man NOTICING another person is female is now harassment<br> (witness the offense at “ladies” in Barry and Mike’s article.)</br></p><p>I feel for Barry and Mike.  I’m sure they were full supporters of the<br> initial feminism which only wanted to give women access but assumed<br> that evolution was not going to be reversed in a generation, and if<br> women wanted to work alongside men, they’d have to endure men being…<br> male.  And if they used a little of female wiles to get what they<br> wanted… well, that’s how humans are and they go two by two.  This was a<br> somewhat rational idea, and if it had stopped there…<br> It didn’t.</br></br></br></br></br></br></br></p><p>Their articles were salutes of the women who made it in (at that time) a very hostile male environment.</p><p>Barry and Mike had no idea that the herd had changed step and that<br> the mooing signals from the top had changed.  Cattle are very stupid<br> animals.  They identify their herd by a series of not very rational<br> signals.  Fall out of step, and you risk being mistaken for an intruder<br> and gored.  And people who didn’t realize there was herd behavior going<br> on, and who got to their positions by rational thought, are more than<br> likely to get that treatment.  I know, it’s happened to me.</br></br></br></br></br></br></p><p>And meanwhile the herd of tough grrrl Victorian maidens, “don’t call<br> me slut” but “I’ll sleep with guys I’m not even interested in, and I’ll<br> call myself slut,”  “asking me on a date is sexism” and “I can’t<br> understand where all the good men have gone”, “we’re just as good as<br> men”, “it’s rape if a man talks a woman into sex because men have<br> awesome men neurons we can’t compete with” goes on its merry way<br> changing directions as the leaders change rationals and demanding more<br> government intervention to handicap men more, because otherwise, how can<br> they compete with wonderful male superpowers?  They who are fragile<br> flowers who get peristaltic disturbances because someone mentions most<br> top scientists aren’t female?</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>The irony is the lesson being taught to younger men who have watched the Resnick-Malzberg debacle is that my way is the right way.  Kowtowing to the feminist cows only leads to being trampled, but standing up to them, challenging them, and contemptuously exposing them for the pathetic intellectual frauds they are will send them stampeding away, mooing in distress, every single time.</p><p>Barry and Mike were full supporters of the initial feminism.  Most men of their age were. Having been steeped in it my entire life, I’m a full-fledged enemy of it.  And I’m very, very far from being alone in that regard.</p></div>",
  "content_text": "Sarah Hoyt\ncontemplates the bovine thinking\nthat led to the SFWA’s recent “storm in a B-cup”.  After all, it’s hard for the older members of the herd to keep up:\nI got very – as opposed to a bit – worried in the eighties when women\nstarted claiming that men talking them into sex was “rape.”  The\nreasoning seemed to be that men had awesome talking skills and a mere\nwoman could not defend herself against all those double-slick words.\nI thought “OMG, they’re going Victorian.”\nSince then we’ve gone to lookism (the ugly girl’s attempt to take\nattention from the pretty one) and to a man even looking at a woman too\nlong, or asking for a date being considered “harassment.”\nIn fact, any man NOTICING another person is female is now harassment\n(witness the offense at “ladies” in Barry and Mike’s article.)\nI feel for Barry and Mike.  I’m sure they were full supporters of the\ninitial feminism which only wanted to give women access but assumed\nthat evolution was not going to be reversed in a generation, and if\nwomen wanted to work alongside men, they’d have to endure men being…\nmale.  And if they used a little of female wiles to get what they\nwanted… well, that’s how humans are and they go two by two.  This was a\nsomewhat rational idea, and if it had stopped there…\nIt didn’t.\nTheir articles were salutes of the women who made it in (at that time) a very hostile male environment.\nBarry and Mike had no idea that the herd had changed step and that\nthe mooing signals from the top had changed.  Cattle are very stupid\nanimals.  They identify their herd by a series of not very rational\nsignals.  Fall out of step, and you risk being mistaken for an intruder\nand gored.  And people who didn’t realize there was herd behavior going\non, and who got to their positions by rational thought, are more than\nlikely to get that treatment.  I know, it’s happened to me.\nAnd meanwhile the herd of tough grrrl Victorian maidens, “don’t call\nme slut” but “I’ll sleep with guys I’m not even interested in, and I’ll\ncall myself slut,”  “asking me on a date is sexism” and “I can’t\nunderstand where all the good men have gone”, “we’re just as good as\nmen”, “it’s rape if a man talks a woman into sex because men have\nawesome men neurons we can’t compete with” goes on its merry way\nchanging directions as the leaders change rationals and demanding more\ngovernment intervention to handicap men more, because otherwise, how can\nthey compete with wonderful male superpowers?  They who are fragile\nflowers who get peristaltic disturbances because someone mentions most\ntop scientists aren’t female?\nThe irony is the lesson being taught to younger men who have watched the Resnick-Malzberg debacle is that my way is the right way.  Kowtowing to the feminist cows only leads to being trampled, but standing up to them, challenging them, and contemptuously exposing them for the pathetic intellectual frauds they are will send them stampeding away, mooing in distress, every single time.\nBarry and Mike were full supporters of the initial feminism.  Most men of their age were. Having been steeped in it my entire life, I’m a full-fledged enemy of it.  And I’m very, very far from being alone in that regard.",
  "tags": [
    "SFWA",
    "society",
    "Standout Authors"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-10T19:30:00+00:00"
}