{
  "url": "https://voxday.net/2013/06/19/summa-review/",
  "scraped_at": "2025-12-14T22:32:26.250901",
  "title": "Summa review",
  "date_display": "June 19, 2013",
  "date_iso": "2013-06-19T06:00:00+00:00",
  "date_from_url": "2013-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Frank Luke <a href=\"http://frankluke.com/2013/06/10/review-summa-elvetica/\">reviews <i>Summa Elvetica</i></a>:</p><blockquote class=\"tr_bq\"><p> One book that I recently gave a second read to was Theodore Beale’s Summa Elvetica. (Beale sometimes writes under the pen name Vox Day.) When I saw the title, I immediately thought of Aquinas‘ masterpiece Summa Theologia. When I read the blurb, I saw Beale had been going for that very connection. It’s a good connection, and the book makes good on the promised link without being heavy handed in the debate department….</p><p>I thoroughly enjoyed how Marcus’ journey from Amora to the Elven lands<br> paralleled his journey into becoming his own man and making his own<br> choices. Two other members of the envoy are fellow church men on<br> opposite sides of the debate. Marcus will be writing his own opinion for<br> the Sanctiff (though the Sanctiff will make the final decision on the<br> question of elves and souls).</br></br></br></br></br></p></blockquote><p>In very much related news, I’m pleased to say that I’ve received several emails from people telling me that the new <i>Summa Elvetica</i> hardcovers have arrived and that it is a worthy companion to <i>A Throne of Bones</i> on the bookshelf.</p></div>",
  "content_text": "Frank Luke\nreviews\nSumma Elvetica\n:\nOne book that I recently gave a second read to was Theodore Beale’s Summa Elvetica. (Beale sometimes writes under the pen name Vox Day.) When I saw the title, I immediately thought of Aquinas‘ masterpiece Summa Theologia. When I read the blurb, I saw Beale had been going for that very connection. It’s a good connection, and the book makes good on the promised link without being heavy handed in the debate department….\nI thoroughly enjoyed how Marcus’ journey from Amora to the Elven lands\nparalleled his journey into becoming his own man and making his own\nchoices. Two other members of the envoy are fellow church men on\nopposite sides of the debate. Marcus will be writing his own opinion for\nthe Sanctiff (though the Sanctiff will make the final decision on the\nquestion of elves and souls).\nIn very much related news, I’m pleased to say that I’ve received several emails from people telling me that the new\nSumma Elvetica\nhardcovers have arrived and that it is a worthy companion to\nA Throne of Bones\non the bookshelf.",
  "tags": [
    "books",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-19T05:00:00+00:00"
}