{
  "url": "https://voxday.net/2013/06/30/teachers-are-really-really-dumb/",
  "scraped_at": "2025-12-14T22:33:44.803710",
  "title": "Teachers are substandard",
  "date_display": "June 30, 2013",
  "date_iso": "2013-06-30T16:34:00+00:00",
  "date_from_url": "2013-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have previously calculated, on the basis of their SAT scores, that school teachers today have an average IQ of approximately 95.  And <a href=\"http://www.jerrypournelle.com/chaosmanor/?p=14454\">based on this email</a> posted at Chaos Manor, it is clear that education majors have been the absolute dregs of academia for quite some time now:</p><blockquote class=\"tr_bq\"><p> I worked my way through college. The university I attended generously<br> provided jobs to many students. One job I held was that of Computer<br> Operator on the IBM 360/70 in the university computer center.</br></br></p><p>After my first semester working in the computer center, I worked the<br> wake-up shift, 0600 – 0900. Many of the universities administrative<br> computational jobs came to me to run because things were quiet at that<br> time, and, thus, the demands on the CPU were less.</br></br></br></p><p>The university faculty senate had expressed some concerns about the<br> school’s reputation, or rather the lack of it. They wanted to know why<br> this was. So they compiled years of grades, punched them onto 80-column<br> cards, and toted those cards down to the computer center where they<br> spilled those data onto a tape. That took the better part of a day and<br> all that evening which meant they did not have time to run the<br> statistics on those data and print them out. Problem was that the<br> computer center had promised Dr R, the president of the faculty senate,<br> the report the following morning.</br></br></br></br></br></br></br></br></p><p>Charlie, my boss, left it to me on the morning shift to run the stats<br> and print out the results. As soon as I woke the Beast, I ran the job.<br> It printed out half a box of fanfold paper. I tore off the last page,<br> picked up the printout, and took it to the counter to look through it.</br></br></br></p><p>Of course, I knew what this was and what it meant. I scanned to the<br> math department. As, Bs, Cs, Ds, Fs, a few incompletes ― all the grades<br> in the table. The distribution was normal but the mean was shifted<br> slightly toward the lower end; that is, the department gave fewer As<br> than expected and more Fs than expected.  I scanned to the physics department. Much the same story as with the<br> math department but shifted even more toward the lower end.</br></br></br></br></br></p><p>I scanned to the department of education, and I said to myself, said<br> I, “Oh, the shit’s gonna hit the fan.” ED gave 80% As, 20% Bs, and<br> nothing below a B.</br></br></p><p>This report exploded like a bomb in the faculty senate. Dr R, the<br> president of the senate, made a motion his own self to sever the<br> Department of Education from the rest of the university and another that<br> admission to the School of Education would not give admission to the<br> rest of the university. The recriminations were many and bitter. I heard<br> that the President of the University called in the campus cops to<br> restore order and prevent the threatened assaults.</br></br></br></br></br></br></p><p>I ran this report when I was a sophomore. When I graduated, the war was still on. So if you are an education major and you think I have no respect for you . . . you’re right. I don’t. Moreover, I won’t.</p></blockquote><p>This also serves as a fitting response to those who ask how a mother can homeschool without a degree in physics, math, or womyn’s studies.  The correct answer is: why do you think your children can be adequately educated by a collection of women with a sub-normal IQs whose only education is in what is quite literally the easiest possible course of collegiate study.</p></div>",
  "content_text": "I have previously calculated, on the basis of their SAT scores, that school teachers today have an average IQ of approximately 95.  And\nbased on this email\nposted at Chaos Manor, it is clear that education majors have been the absolute dregs of academia for quite some time now:\nI worked my way through college. The university I attended generously\nprovided jobs to many students. One job I held was that of Computer\nOperator on the IBM 360/70 in the university computer center.\nAfter my first semester working in the computer center, I worked the\nwake-up shift, 0600 – 0900. Many of the universities administrative\ncomputational jobs came to me to run because things were quiet at that\ntime, and, thus, the demands on the CPU were less.\nThe university faculty senate had expressed some concerns about the\nschool’s reputation, or rather the lack of it. They wanted to know why\nthis was. So they compiled years of grades, punched them onto 80-column\ncards, and toted those cards down to the computer center where they\nspilled those data onto a tape. That took the better part of a day and\nall that evening which meant they did not have time to run the\nstatistics on those data and print them out. Problem was that the\ncomputer center had promised Dr R, the president of the faculty senate,\nthe report the following morning.\nCharlie, my boss, left it to me on the morning shift to run the stats\nand print out the results. As soon as I woke the Beast, I ran the job.\nIt printed out half a box of fanfold paper. I tore off the last page,\npicked up the printout, and took it to the counter to look through it.\nOf course, I knew what this was and what it meant. I scanned to the\nmath department. As, Bs, Cs, Ds, Fs, a few incompletes ― all the grades\nin the table. The distribution was normal but the mean was shifted\nslightly toward the lower end; that is, the department gave fewer As\nthan expected and more Fs than expected.  I scanned to the physics department. Much the same story as with the\nmath department but shifted even more toward the lower end.\nI scanned to the department of education, and I said to myself, said\nI, “Oh, the shit’s gonna hit the fan.” ED gave 80% As, 20% Bs, and\nnothing below a B.\nThis report exploded like a bomb in the faculty senate. Dr R, the\npresident of the senate, made a motion his own self to sever the\nDepartment of Education from the rest of the university and another that\nadmission to the School of Education would not give admission to the\nrest of the university. The recriminations were many and bitter. I heard\nthat the President of the University called in the campus cops to\nrestore order and prevent the threatened assaults.\nI ran this report when I was a sophomore. When I graduated, the war was still on. So if you are an education major and you think I have no respect for you . . . you’re right. I don’t. Moreover, I won’t.\nThis also serves as a fitting response to those who ask how a mother can homeschool without a degree in physics, math, or womyn’s studies.  The correct answer is: why do you think your children can be adequately educated by a collection of women with a sub-normal IQs whose only education is in what is quite literally the easiest possible course of collegiate study.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-30T15:34:00+00:00"
}