{
  "url": "https://voxday.net/2013/06/17/technology-and-decline-of-gatekeepers/",
  "scraped_at": "2025-12-14T22:32:12.502135",
  "title": "Technology and the decline of the gatekeepers",
  "date_display": "June 17, 2013",
  "date_iso": "2013-06-17T08:14:00+00:00",
  "date_from_url": "2013-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The same forces are at work <a href=\"http://www.salon.com/2013/06/15/lynda_obst_hollywoods_completely_broken/\">undermining the power of gatekeepers</a> in every entertainment industry, film, books, and games:</p><blockquote class=\"tr_bq\"><p> “Let me give you the simplest math,” he replied. “The simple, simple, simple math.” <br> Good,<br> I thought. Because my friends and I are not so great at math. I can<br> guesstimate the budget of a big movie to within a hundred thousand<br> dollars by reading the script, but I can’t add the columns therein.<br> “The<br> movie business,” Peter said, “the historical studio business, if you<br> put all the studios together, runs at about a ten percent profit margin.<br> For every billion dollars in revenue, they make a hundred million<br> dollars in profits. That’s the business, right?”<br> I nodded, the good student, excited that someone was finally going to explain this to me.<br> “The<br> DVD business represented fifty percent of their profits,” he went on.<br> “Fifty percent. The decline of that business means their entire profit<br> could come down between forty and fifty percent for new movies.”<br> For<br> those of you like me who are not good at math, let me make Peter’s<br> statement even simpler. If a studio’s margin of profit was only 10<br> percent in the Old Abnormal, now with the collapsing DVD market that<br> profit margin was hovering around 6 percent. The loss of profit on those<br> little silver discs had nearly halved our profit margin.<br> This<br> was, literally, a Great Contraction. Something drastic had happened to<br> our industry, and this was it. Surely there were other factors: Young<br> males were disappearing into video games; there were hundreds of home<br> entertainment choices available for nesting families; the Net. But<br> slicing a huge chunk of reliable profits right out of the bottom line<br> forever?<br> This was mind-boggling to me, and I’ve been in the business for thirty years….<br> When Peter referred to the “transition of the DVD market,” and<br> technology destroying the DVD, he was talking about the implications<br> of the fact that our movies were now proliferating for free—not just on<br> the streets of Beijing and Hong Kong and Rio. And even legitimate users,<br> as Peter pointed out, who would never pirate, were going for $3 or $4<br> video-on-demand (VOD) rentals instead of $15 DVD purchases.<br> “When did the collapse begin?”<br> “The bad news started in 2008,” he said. “Bad 2009. Bad 2010. Bad 2011.”<br> It was as if he were scolding those years. They were bad, very bad. I wouldn’t want to be those years.<br> “The<br> international market will still grow,” he said, “but the DVD<br> sell-through business is not coming back again. Consumers will buy their<br> movies on Netflix, iTunes, Amazon et al. before they will purchase a<br> DVD.” What had been our profit margin has gone the way of the old media.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This is the very point that the SFWA members didn’t understand when I tried to warn them about the sale of ebooks through non-Amazon channels such as games.  The big mainstream publishers, (and more importantly, the genre publishers owned by them), not only don’t have these channels, <i>they can’t even sell through them </i>because their legacy distribution contracts prohibit them from selling books for virtual currencies.  And I very much doubt Ingram or Barnes &amp; Noble is going to allow publishers to rewrite contracts in order to help them bypass the conventional channels into which they are locked.</p><p>Amazon is putting serious pressure on ebook pricing, but it is also maintaining a strong floor.  That floor will disappear once the in-game channel starts to see decent volume. So on the one side, their profit margins are going to decline as ebook prices continue to fall – the average price of an ebook bestseller fell from $11.79 in October 2012 to $6.59 in May 2013 – on the other, they’re not going to be able to sell game tie-in books much longer once Microsoft starts selling HALO ebooks through the Xbox and Disney starts selling Star Wars ebooks through its in-game stores.</p><p>It will probably surprise no one to discover that the primary response of the forward-thinking futurists was to declare their opinion that <i>First Sword</i> was unlikely to sell enough ebooks to matter one way or the other, as if the universal adoption of 3D hardware texture-mapped acceleration that Big Chilly and I introduced in <i>Rebel Moon</i>, and the 16-bit color we introduced in <i>Rebel Moon Rising</i>, had anything at all to do with how many copies of those games were sold. </p><p>Speaking of <i>First Sword</i>, I’m working on the standard contract for in-game ebook sales right now, and I would welcome any comments or suggestions those interested in selling either original Selenoth-related fiction or unrelated material through First Sword and other games might have.</p></div>",
  "content_text": "The same forces are at work\nundermining the power of gatekeepers\nin every entertainment industry, film, books, and games:\n“Let me give you the simplest math,” he replied. “The simple, simple, simple math.”\nGood,\nI thought. Because my friends and I are not so great at math. I can\nguesstimate the budget of a big movie to within a hundred thousand\ndollars by reading the script, but I can’t add the columns therein.\n“The\nmovie business,” Peter said, “the historical studio business, if you\nput all the studios together, runs at about a ten percent profit margin.\nFor every billion dollars in revenue, they make a hundred million\ndollars in profits. That’s the business, right?”\nI nodded, the good student, excited that someone was finally going to explain this to me.\n“The\nDVD business represented fifty percent of their profits,” he went on.\n“Fifty percent. The decline of that business means their entire profit\ncould come down between forty and fifty percent for new movies.”\nFor\nthose of you like me who are not good at math, let me make Peter’s\nstatement even simpler. If a studio’s margin of profit was only 10\npercent in the Old Abnormal, now with the collapsing DVD market that\nprofit margin was hovering around 6 percent. The loss of profit on those\nlittle silver discs had nearly halved our profit margin.\nThis\nwas, literally, a Great Contraction. Something drastic had happened to\nour industry, and this was it. Surely there were other factors: Young\nmales were disappearing into video games; there were hundreds of home\nentertainment choices available for nesting families; the Net. But\nslicing a huge chunk of reliable profits right out of the bottom line\nforever?\nThis was mind-boggling to me, and I’ve been in the business for thirty years….\nWhen Peter referred to the “transition of the DVD market,” and\ntechnology destroying the DVD, he was talking about the implications\nof the fact that our movies were now proliferating for free—not just on\nthe streets of Beijing and Hong Kong and Rio. And even legitimate users,\nas Peter pointed out, who would never pirate, were going for $3 or $4\nvideo-on-demand (VOD) rentals instead of $15 DVD purchases.\n“When did the collapse begin?”\n“The bad news started in 2008,” he said. “Bad 2009. Bad 2010. Bad 2011.”\nIt was as if he were scolding those years. They were bad, very bad. I wouldn’t want to be those years.\n“The\ninternational market will still grow,” he said, “but the DVD\nsell-through business is not coming back again. Consumers will buy their\nmovies on Netflix, iTunes, Amazon et al. before they will purchase a\nDVD.” What had been our profit margin has gone the way of the old media.\nThis is the very point that the SFWA members didn’t understand when I tried to warn them about the sale of ebooks through non-Amazon channels such as games.  The big mainstream publishers, (and more importantly, the genre publishers owned by them), not only don’t have these channels,\nthey can’t even sell through them\nbecause their legacy distribution contracts prohibit them from selling books for virtual currencies.  And I very much doubt Ingram or Barnes & Noble is going to allow publishers to rewrite contracts in order to help them bypass the conventional channels into which they are locked.\nAmazon is putting serious pressure on ebook pricing, but it is also maintaining a strong floor.  That floor will disappear once the in-game channel starts to see decent volume. So on the one side, their profit margins are going to decline as ebook prices continue to fall – the average price of an ebook bestseller fell from $11.79 in October 2012 to $6.59 in May 2013 – on the other, they’re not going to be able to sell game tie-in books much longer once Microsoft starts selling HALO ebooks through the Xbox and Disney starts selling Star Wars ebooks through its in-game stores.\nIt will probably surprise no one to discover that the primary response of the forward-thinking futurists was to declare their opinion that\nFirst Sword\nwas unlikely to sell enough ebooks to matter one way or the other, as if the universal adoption of 3D hardware texture-mapped acceleration that Big Chilly and I introduced in\nRebel Moon\n, and the 16-bit color we introduced in\nRebel Moon Rising\n, had anything at all to do with how many copies of those games were sold.\nSpeaking of\nFirst Sword\n, I’m working on the standard contract for in-game ebook sales right now, and I would welcome any comments or suggestions those interested in selling either original Selenoth-related fiction or unrelated material through First Sword and other games might have.",
  "tags": [
    "books",
    "movies",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-17T07:14:00+00:00"
}