{
  "url": "https://voxday.net/2013/06/17/the-raw-terror-of-gun/",
  "scraped_at": "2025-12-14T22:32:14.204886",
  "title": "The raw terror of the gun",
  "date_display": "June 17, 2013",
  "date_iso": "2013-06-17T14:26:00+00:00",
  "date_from_url": "2013-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A woman <a href=\"http://msmagazine.com/blog/2013/06/12/my-month-with-a-gun-week-one/\">nearly scares herself to death</a> by wearing an gun on her hip… an empty gun:</p><blockquote class=\"tr_bq\"><p> I started my 30-day gun trial with a little window-shopping. I visited a gun show and two gun dealers. I ended up buying a <a href=\"http://www.glockmeister.com/9-mm/products/4/\">Glock 9mm</a><br> handgun from Tony, a gun dealer four miles from my house. I settled on<br> this model because it was a smallish gun and because Tony recommended it<br> for my stated purposes of protecting myself and my home.</br></br></br></p><p>It was obvious from the way I handled the gun that I knew nothing<br> about firearms. Tony sold it to me anyway. The whole thing took 7<br> minutes. As a gratified consumer, I thought, “Well, that was easy.” Then<br> the terrifying reality hit me, “Holy hell, that was EASY.”  Too easy. I<br> still knew nothing about firearms.</br></br></br></br></p><p>Tony told me a Glock doesn’t have an external safety feature, so when<br> I got home and opened the box and saw the magazine in the gun I<br> freaked. I was too scared to try and eject it as thoughts flooded my<br> mind of me accidentally shooting the gun and a bullet hitting my son in<br> the house or rupturing the gas tank of my car, followed by an<br> earth-shaking explosion. This was the first time my hands shook from the<br> adrenaline surge and the first time I questioned the wisdom of this<br> 30-day experiment.</br></br></br></br></br></br></br></p><p>I needed help. I drove to where a police officer had pulled over<br> another driver. Now, writing this, I realize that rolling up on an<br> on-duty cop with a handgun in tow might not have been fully thought<br> through….</br></br></br></p><p>I told him I just bought a gun, had no clue how to use it. I asked<br> him to make sure there were no bullets in the magazine or chamber. He<br> took the magazine out and cleared the chamber. He assured me it was<br> empty and showed me how to look. Then he told me how great the gun was<br> and how he had one just like it.</br></br></br></br></p><p>The cop thought I was an idiot and suggested I take a class. But up to that point I’d done nothing wrong, nothing illegal.</p><p>So here I sit at Starbucks, and the irony couldn’t be thicker. On<br> March 12, 2010, I was surrounded by big hairy men with guns on their<br> hips, yelling at me as I led a protest against Starbuck’s gun policy.<br> Today, I’m surrounded by five-year-old boys sitting with their moms at<br> the next table. Now I’m the one with a gun on her hip.</br></br></br></br></p><p>The gun makes me<br> more fearful than I could have imagined.</br></p></blockquote><p>Keep in mind that there are people who genuinely think I’m crazy because I believe permitting terrified little mice like this a voice in governance is likely to lead to the loss of human liberty.  What the writer clearly doesn’t understand that it is not the gun that makes her fearful, fearfulness is her essential state of being.</p><p>She’s not the only one.  I have personally witnessed women reduced to tears by the sight and sound of men checking to confirm that their guns are completely unloaded. It was like seeing someone come unglued because the driver buckled his seatbelt.</p></div>",
  "content_text": "A woman\nnearly scares herself to death\nby wearing an gun on her hip… an empty gun:\nI started my 30-day gun trial with a little window-shopping. I visited a gun show and two gun dealers. I ended up buying a\nGlock 9mm\nhandgun from Tony, a gun dealer four miles from my house. I settled on\nthis model because it was a smallish gun and because Tony recommended it\nfor my stated purposes of protecting myself and my home.\nIt was obvious from the way I handled the gun that I knew nothing\nabout firearms. Tony sold it to me anyway. The whole thing took 7\nminutes. As a gratified consumer, I thought, “Well, that was easy.” Then\nthe terrifying reality hit me, “Holy hell, that was EASY.”  Too easy. I\nstill knew nothing about firearms.\nTony told me a Glock doesn’t have an external safety feature, so when\nI got home and opened the box and saw the magazine in the gun I\nfreaked. I was too scared to try and eject it as thoughts flooded my\nmind of me accidentally shooting the gun and a bullet hitting my son in\nthe house or rupturing the gas tank of my car, followed by an\nearth-shaking explosion. This was the first time my hands shook from the\nadrenaline surge and the first time I questioned the wisdom of this\n30-day experiment.\nI needed help. I drove to where a police officer had pulled over\nanother driver. Now, writing this, I realize that rolling up on an\non-duty cop with a handgun in tow might not have been fully thought\nthrough….\nI told him I just bought a gun, had no clue how to use it. I asked\nhim to make sure there were no bullets in the magazine or chamber. He\ntook the magazine out and cleared the chamber. He assured me it was\nempty and showed me how to look. Then he told me how great the gun was\nand how he had one just like it.\nThe cop thought I was an idiot and suggested I take a class. But up to that point I’d done nothing wrong, nothing illegal.\nSo here I sit at Starbucks, and the irony couldn’t be thicker. On\nMarch 12, 2010, I was surrounded by big hairy men with guns on their\nhips, yelling at me as I led a protest against Starbuck’s gun policy.\nToday, I’m surrounded by five-year-old boys sitting with their moms at\nthe next table. Now I’m the one with a gun on her hip.\nThe gun makes me\nmore fearful than I could have imagined.\nKeep in mind that there are people who genuinely think I’m crazy because I believe permitting terrified little mice like this a voice in governance is likely to lead to the loss of human liberty.  What the writer clearly doesn’t understand that it is not the gun that makes her fearful, fearfulness is her essential state of being.\nShe’s not the only one.  I have personally witnessed women reduced to tears by the sight and sound of men checking to confirm that their guns are completely unloaded. It was like seeing someone come unglued because the driver buckled his seatbelt.",
  "tags": [
    "freakshow",
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-17T13:26:00+00:00"
}