{
  "url": "https://voxday.net/2013/06/08/the-truth-will-ou/",
  "scraped_at": "2025-12-14T22:31:13.535826",
  "title": "The truth will out",
  "date_display": "June 8, 2013",
  "date_iso": "2013-06-08T15:47:00+00:00",
  "date_from_url": "2013-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those lamenting <a href=\"http://pjmedia.com/rogerkimball/2013/06/06/the-assault-on-truth-continues/?singlepage=true\">the increased sound and fury of the gatekeepers</a> of academia, media, and publishing as they attempt to kick out anyone and everyone who rejects the received dogma are failing to keep one very important thing in mind: No amount of credentials, social pressure, and financial carrots will suffice to prevent an honest man from understanding what he is seeing and experiencing:</p><blockquote class=\"tr_bq\"><p> If you take certain positions, you will be cast into outer darkness. Whether your statements are empirically accurate is irrelevant. Translation: truth doesn’t matter when ideology triumphs. White is black, day is night, there are no IQ differences among ethnic groups.</p><p>We are used to this sort of politically motivated mendacity in the university, where “diversity” has come to mean “conformity.” Murray merely states the obvious when he observes that “In academia, only the tenured can safely write on these topics. Assistant professors know that their chances of getting tenure will be close to zero if they publish politically incorrect findings on climate change, homosexuality, race differences, gender differences, or renewable energy. Their chances will not be much higher if they have published anything with a distinctly conservative perspective of any sort.”</p><p>That is bad enough. Here we have institutions, whose very raison d’être is the pursuit of truth, constrained to parrot politically-sanctioned untruth on a wide range of sensitive topics. Even worse is the metastasis of this freedom-and truth-blighting habit of mendacity. Increasingly, this sort of craven doublethink has oozed out of the academy and into the corridors of business, the media, and culture at large. Where will it end?</p></blockquote><p>It will end when it always does; when reality squashes the lies with all the restraint and mercy of a semi running over a rabbit.  The most sincere diversity advocates suddenly lose their religion when vibrant thugs and rapists move in next door to them. The most heartfelt Keynesian feels seeds of doubt sprouting in his mind when the economy enters into a fourth year of declining employment despite trillions in stimulus.  And even the Vote Red/Vote Blue crowd is beginning to wonder how their votes can possibly make any difference at all as the first glimpses of the extent of the IRS and NSA scandals begin to take form.</p><p>The world is actively opposed to the Truth, so it should not be any surprise that its institutions are opposed to the truth as well as anyone bold enough to stand up for it.</p></div>",
  "content_text": "Those lamenting\nthe increased sound and fury of the gatekeepers\nof academia, media, and publishing as they attempt to kick out anyone and everyone who rejects the received dogma are failing to keep one very important thing in mind: No amount of credentials, social pressure, and financial carrots will suffice to prevent an honest man from understanding what he is seeing and experiencing:\nIf you take certain positions, you will be cast into outer darkness. Whether your statements are empirically accurate is irrelevant. Translation: truth doesn’t matter when ideology triumphs. White is black, day is night, there are no IQ differences among ethnic groups.\nWe are used to this sort of politically motivated mendacity in the university, where “diversity” has come to mean “conformity.” Murray merely states the obvious when he observes that “In academia, only the tenured can safely write on these topics. Assistant professors know that their chances of getting tenure will be close to zero if they publish politically incorrect findings on climate change, homosexuality, race differences, gender differences, or renewable energy. Their chances will not be much higher if they have published anything with a distinctly conservative perspective of any sort.”\nThat is bad enough. Here we have institutions, whose very raison d’être is the pursuit of truth, constrained to parrot politically-sanctioned untruth on a wide range of sensitive topics. Even worse is the metastasis of this freedom-and truth-blighting habit of mendacity. Increasingly, this sort of craven doublethink has oozed out of the academy and into the corridors of business, the media, and culture at large. Where will it end?\nIt will end when it always does; when reality squashes the lies with all the restraint and mercy of a semi running over a rabbit.  The most sincere diversity advocates suddenly lose their religion when vibrant thugs and rapists move in next door to them. The most heartfelt Keynesian feels seeds of doubt sprouting in his mind when the economy enters into a fourth year of declining employment despite trillions in stimulus.  And even the Vote Red/Vote Blue crowd is beginning to wonder how their votes can possibly make any difference at all as the first glimpses of the extent of the IRS and NSA scandals begin to take form.\nThe world is actively opposed to the Truth, so it should not be any surprise that its institutions are opposed to the truth as well as anyone bold enough to stand up for it.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-08T14:47:00+00:00"
}