{
  "url": "https://voxday.net/2013/06/02/the-dangerous-vision-of-sfwa/",
  "scraped_at": "2025-12-14T22:30:35.232926",
  "title": "The dangerous vision of the SFWA",
  "date_display": "June 2, 2013",
  "date_iso": "2013-06-02T06:54:00+00:00",
  "date_from_url": "2013-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"margin-bottom: 0in;\"> I posted a pair of comments that were in line with <a href=\"http://www.milobookclub.com/2013/06/01/women-ruin-everything-sfwa-edition/\">my post yesterday</a> on the SFWA Forum.  (Forum posts are private and one is not allowed to quote them elsewhere, otherwise I would quote the posts to which I was responding.) This resulted in numerous complaints to the moderator, a warning for “abusive behavior”, the deletion of the following posts, and a temporary removal of my posting abilities there by a creature with the unlikely Warrior Woman name of Cat Rambo.</div><blockquote class=\"tr_bq\"><div style=\"margin-bottom: 0in;\"> Not that it will likely make a<br> difference, but I don’t see how “Moahr Titz” is going to<br> improve the Bulletin. As for more diversity, that’s a fantastic idea<br> if you want to render the Bulletin of absolutely no interest to<br> anyone except women who derive vicarious pleasure from listening to<br> other people moan about the travails of life. If this was the<br> Organization for Respecting Women and not the SFWA, hey, these<br> various suggestions are fine. But they have absolutely nothing to do<br> with science fiction. Consider: it will be a pretty hollow victory to<br> claim that everyone in professional science fiction is finally<br> respecting women, minorities, dwarves, and fairies in the desired<br> manner if in the process you manage to drive away three-quarters of<br> the science fiction readership.</br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> The Bulletin absolutely should have<br> scantily clad women being rescued by manly men from bug-eyed aliens<br> on the cover from time to time. It should have robots and spaceships<br> too. Whether you find that offensive or not, that’s part of what<br> science fiction was, and is. Science fiction is supposed to be the<br> literature of dangerous ideas, not safe and inoffensive and<br> respectful and politically correct ones.</br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> And if you can’t handle that<br> concept, then you should get the hell out of the field and the<br> organization. You don’t belong in either of them.</br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> I therefore encourage every member<br> of the SFWA who is offended by the Dialogues or the Bulletin covers<br> to follow e. Catherine Tobler’s excellent example and resign from the<br> organization. Because regardless of your literary talents and<br> interests, you are clearly not fit to be a science fiction writer.<br> Science fiction isn’t about respect, equality, or inoffensiveness, it<br> is about science and the future.</br></br></br></br></br></br></div></blockquote><p>I also addressed the idea that the Dialogues column between Mike Resnick and Barry Salzberg should be forcibly retired with alacrity.</p><blockquote class=\"tr_bq\"><div style=\"margin-bottom: 0in;\"> How about a regular column by women<br> writers complaining about sexism in [science<br> fiction/fantasy/horror/publishing/games] and how there are not enough<br> female [fill-in-the-blank].  That would be totally new and different<br> and impossible to find anywhere else!</br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Maybe every four issues we could<br> change it up with a column by a black writer complaining about racism<br> in [science fiction/fantasy/horror/publishing/games] and how there<br> are not enough black [fill-in-the-blank].</br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Who wants to read about the history<br> of yucky old science fiction by some old white guys of whom nobody<br> has ever heard anyway?</br></br></div></blockquote><p>So, praising the decision of a member to quit, expressing the opinion that others of similarly delicate minds would do well to follow her example, and noting that women are inordinately inclined to be easily offended, speech-controlling fascists resulted immediately in fascistic, speech-repressing activity by an offended woman.  In the eyes of the present SFWA, criticism equals abuse.</p><p>And you thought the Sports Guy was joking.  Women really do ruin everything. Even for themselves. Perhaps especially for themselves.</p><p>No wonder a number of SFWA members refuse to post on the Forum and stubbornly stick with the old ones on SFF.net.  The SFWA Forum doesn’t just stifle discourse, it actively eliminates it altogether.</p><p>Harlan Ellison wept.</p></div>",
  "content_text": "I posted a pair of comments that were in line with\nmy post yesterday\non the SFWA Forum.  (Forum posts are private and one is not allowed to quote them elsewhere, otherwise I would quote the posts to which I was responding.) This resulted in numerous complaints to the moderator, a warning for “abusive behavior”, the deletion of the following posts, and a temporary removal of my posting abilities there by a creature with the unlikely Warrior Woman name of Cat Rambo.\nNot that it will likely make a\ndifference, but I don’t see how “Moahr Titz” is going to\nimprove the Bulletin. As for more diversity, that’s a fantastic idea\nif you want to render the Bulletin of absolutely no interest to\nanyone except women who derive vicarious pleasure from listening to\nother people moan about the travails of life. If this was the\nOrganization for Respecting Women and not the SFWA, hey, these\nvarious suggestions are fine. But they have absolutely nothing to do\nwith science fiction. Consider: it will be a pretty hollow victory to\nclaim that everyone in professional science fiction is finally\nrespecting women, minorities, dwarves, and fairies in the desired\nmanner if in the process you manage to drive away three-quarters of\nthe science fiction readership.\nThe Bulletin absolutely should have\nscantily clad women being rescued by manly men from bug-eyed aliens\non the cover from time to time. It should have robots and spaceships\ntoo. Whether you find that offensive or not, that’s part of what\nscience fiction was, and is. Science fiction is supposed to be the\nliterature of dangerous ideas, not safe and inoffensive and\nrespectful and politically correct ones.\nAnd if you can’t handle that\nconcept, then you should get the hell out of the field and the\norganization. You don’t belong in either of them.\nI therefore encourage every member\nof the SFWA who is offended by the Dialogues or the Bulletin covers\nto follow e. Catherine Tobler’s excellent example and resign from the\norganization. Because regardless of your literary talents and\ninterests, you are clearly not fit to be a science fiction writer.\nScience fiction isn’t about respect, equality, or inoffensiveness, it\nis about science and the future.\nI also addressed the idea that the Dialogues column between Mike Resnick and Barry Salzberg should be forcibly retired with alacrity.\nHow about a regular column by women\nwriters complaining about sexism in [science\nfiction/fantasy/horror/publishing/games] and how there are not enough\nfemale [fill-in-the-blank].  That would be totally new and different\nand impossible to find anywhere else!\nMaybe every four issues we could\nchange it up with a column by a black writer complaining about racism\nin [science fiction/fantasy/horror/publishing/games] and how there\nare not enough black [fill-in-the-blank].\nWho wants to read about the history\nof yucky old science fiction by some old white guys of whom nobody\nhas ever heard anyway?\nSo, praising the decision of a member to quit, expressing the opinion that others of similarly delicate minds would do well to follow her example, and noting that women are inordinately inclined to be easily offended, speech-controlling fascists resulted immediately in fascistic, speech-repressing activity by an offended woman.  In the eyes of the present SFWA, criticism equals abuse.\nAnd you thought the Sports Guy was joking.  Women really do ruin everything. Even for themselves. Perhaps especially for themselves.\nNo wonder a number of SFWA members refuse to post on the Forum and stubbornly stick with the old ones on SFF.net.  The SFWA Forum doesn’t just stifle discourse, it actively eliminates it altogether.\nHarlan Ellison wept.",
  "tags": [
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-02T05:54:00+00:00"
}