{
  "url": "https://voxday.net/2013/06/15/the-extent-of-facebook-spying/",
  "scraped_at": "2025-12-14T22:32:05.551808",
  "title": "The extent of Facebook spying",
  "date_display": "June 15, 2013",
  "date_iso": "2013-06-15T19:30:00+00:00",
  "date_from_url": "2013-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or, at least, this is <a href=\"http://newsroom.fb.com/News/636/Facebook-Releases-Data-Including-All-National-Security-Requests\">what they’re willing to admit</a> to for the present:</p><blockquote class=\"tr_bq\"><p> For the six months ending December 31, 2012, the total number of<br> user-data requests Facebook received from any and all government<br> entities in the U.S. (including local, state, and federal, and including<br> criminal and national security-related requests) – was between 9,000<br> and 10,000.  These requests run the gamut – from things like a local<br> sheriff trying to find a missing child, to a federal marshal tracking a<br> fugitive, to a police department investigating an assault, to a national<br> security official investigating a terrorist threat. The total number of<br> Facebook user accounts for which data was requested pursuant to the<br> entirety of those 9-10 thousand requests was between 18,000 and 19,000<br> accounts.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>And, of course, the fact that they’re handing over about <i>40,000 accounts per year</i> doesn’t eliminate the NSA’s widely rumored backdoor access.</p></div>",
  "content_text": "Or, at least, this is\nwhat they’re willing to admit\nto for the present:\nFor the six months ending December 31, 2012, the total number of\nuser-data requests Facebook received from any and all government\nentities in the U.S. (including local, state, and federal, and including\ncriminal and national security-related requests) – was between 9,000\nand 10,000.  These requests run the gamut – from things like a local\nsheriff trying to find a missing child, to a federal marshal tracking a\nfugitive, to a police department investigating an assault, to a national\nsecurity official investigating a terrorist threat. The total number of\nFacebook user accounts for which data was requested pursuant to the\nentirety of those 9-10 thousand requests was between 18,000 and 19,000\naccounts.\nAnd, of course, the fact that they’re handing over about\n40,000 accounts per year\ndoesn’t eliminate the NSA’s widely rumored backdoor access.",
  "tags": [
    "corpocracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-15T18:30:00+00:00"
}