{
  "url": "https://voxday.net/2013/06/09/there-is-no-law-in-usa/",
  "scraped_at": "2025-12-14T22:31:16.965197",
  "title": "NSA and the absence of law",
  "date_display": "June 9, 2013",
  "date_iso": "2013-06-09T08:22:00+00:00",
  "date_from_url": "2013-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been saying this for a while now, so it’s interesting to see others openly observing it in the mainstream media.  The US government <a href=\"http://www.france24.com/en/20130608-assange-us-rule-law-suffering-calamitous-collapse\">does not respect the Constitution or any law</a>, it is not the Constitutional entity everyone assumes it to be, and the US justice system is one giant game of make-believe:</p><blockquote class=\"tr_bq\"><p> WikiLeaks founder Julian Assange said Friday that the US justice<br> system was suffering from a “calamitous collapse in the rule of law”, as<br> Washington reeled from the sensational exposure of vast spy agency<br> surveillance programmes. Speaking in an interview with AFP at Ecuador’s London embassy, where<br> he has been holed up for almost a year, the founder of the<br> whistleblowing website accused the US government of trying to “launder”<br> its activities with regard to the far-reaching electronic spying effort<br> revealed on Thursday.</br></br></br></br></br></br></br></p></blockquote><p>Assange doesn’t know the half of it, but he knew enough to try to stay out of the clutches of a Big Brother machine that kidnaps people around the world, kills others with drones, and spies on everyone with Internet access.  It is somewhat astonishing, to the average person who grew up amidst the Manichean struggle of the forces of freedom and light versus the evil empire of the Soviet Union, to gradually realize that the evil empire of the USA is more insidious and pernicious, with a greater global reach, than the Soviet version.</p><p>Tyler Durden observes that the administration <a href=\"http://www.zerohedge.com/news/2013-06-08/nsas-boundless-informant-collects-3-billion-intelligence-pieces-us-computer-networks\">has been caught lying</a> in all of its responses to news of the NSA scandal:</p><blockquote class=\"tr_bq\"><p> There’s one reason why the administration, James Clapper and the NSA should just keep their mouths shut as the PRISM-gate fallout escalates: with every incremental attempt to refute some previously unknown facet of the US Big Brother state, a new piece of previously unleaked information from the same intelligence organization now scrambling for damage control, emerges and exposes the brand new narrative as yet another lie, forcing even more lies, more retribution against sources, more journalist persecution and so on.</p><p>The latest piece of news once again comes from the Guardian’s Glenn Greenwald who this time exposes the NSA’s datamining tool “Boundless Informant” which according to leaked documents collected 97 billion pieces of intelligence from computer networks worldwide in March 2013 alone, and “3 billion pieces of intelligence from US computer networks over a 30-day period.”</p><p>This is summarized in the chart below which shows that only the middle east has more active NSA-espionage than the US. Also, Obama may not want to show Xi the activity heatmap for China, or else the whole “China is hacking us” script may promptly fall apart.</p></blockquote><p>As usual, the government is hiding behind the fact that it is hiring contractors to do what it is prohibited by that ever-so-effectual “law” from doing itself.  The government is entirely lawless; to the last two presidential administrations, “law” is simply another weapon in its war on the American people.</p></div>",
  "content_text": "I’ve been saying this for a while now, so it’s interesting to see others openly observing it in the mainstream media.  The US government\ndoes not respect the Constitution or any law\n, it is not the Constitutional entity everyone assumes it to be, and the US justice system is one giant game of make-believe:\nWikiLeaks founder Julian Assange said Friday that the US justice\nsystem was suffering from a “calamitous collapse in the rule of law”, as\nWashington reeled from the sensational exposure of vast spy agency\nsurveillance programmes. Speaking in an interview with AFP at Ecuador’s London embassy, where\nhe has been holed up for almost a year, the founder of the\nwhistleblowing website accused the US government of trying to “launder”\nits activities with regard to the far-reaching electronic spying effort\nrevealed on Thursday.\nAssange doesn’t know the half of it, but he knew enough to try to stay out of the clutches of a Big Brother machine that kidnaps people around the world, kills others with drones, and spies on everyone with Internet access.  It is somewhat astonishing, to the average person who grew up amidst the Manichean struggle of the forces of freedom and light versus the evil empire of the Soviet Union, to gradually realize that the evil empire of the USA is more insidious and pernicious, with a greater global reach, than the Soviet version.\nTyler Durden observes that the administration\nhas been caught lying\nin all of its responses to news of the NSA scandal:\nThere’s one reason why the administration, James Clapper and the NSA should just keep their mouths shut as the PRISM-gate fallout escalates: with every incremental attempt to refute some previously unknown facet of the US Big Brother state, a new piece of previously unleaked information from the same intelligence organization now scrambling for damage control, emerges and exposes the brand new narrative as yet another lie, forcing even more lies, more retribution against sources, more journalist persecution and so on.\nThe latest piece of news once again comes from the Guardian’s Glenn Greenwald who this time exposes the NSA’s datamining tool “Boundless Informant” which according to leaked documents collected 97 billion pieces of intelligence from computer networks worldwide in March 2013 alone, and “3 billion pieces of intelligence from US computer networks over a 30-day period.”\nThis is summarized in the chart below which shows that only the middle east has more active NSA-espionage than the US. Also, Obama may not want to show Xi the activity heatmap for China, or else the whole “China is hacking us” script may promptly fall apart.\nAs usual, the government is hiding behind the fact that it is hiring contractors to do what it is prohibited by that ever-so-effectual “law” from doing itself.  The government is entirely lawless; to the last two presidential administrations, “law” is simply another weapon in its war on the American people.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-09T07:22:00+00:00"
}