{
  "url": "https://voxday.net/2013/06/26/throwing-out-bai/",
  "scraped_at": "2025-12-14T22:33:16.555786",
  "title": "Throwing out the bait",
  "date_display": "June 26, 2013",
  "date_iso": "2013-06-26T08:25:00+00:00",
  "date_from_url": "2013-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright explains why Sam Harris’s latest crusade is misplaced; <a href=\"http://www.scifiwright.com/2013/06/empiricism-mute-on-non-empirical-questions/\">empiricism is useless with regards answering non-empirical questions</a>, thereby rendering the derivation of “ought” from “is’ impossible:</p><blockquote class=\"tr_bq\"><p> Here is my proof.</p><ol><li>Do you agree that the international scientific community has<br> reduced all empirical entities to certain basic constants, namely mass,<br> length, duration, temperature, current, candlepower, moles of substance,<br> such that any empirical subject (such as the acceleration due to<br> gravity of a cannonball or color defined as light-frequency) can be<br> expressed in terms of these measurable quantities or some calculated<br> derivation of these quantities?  (I do note that for subatomic<br> particles, some additional fundamentals are needed, but these are also<br> quantities, and not qualities, and therefore do not effect the<br> argument.)</br></br></br></br></br></br></br></br></br></li><li>A quality is a judgment concerning an imponderable entity, such as<br> true or untrue, valid or invalid, comely or ugly. A quantity is a<br> multitude of magnitudes, or in other words, a quantity can be measured<br> against a standard or counted with numbers or both. Do you agree that no<br> quality can be reduced to quantity by any means whatsoever?For example,<br> do you agree that counting the number of vowels used to express a given<br> sentence written in ink in Esperanto will not necessarily tell you<br> whether the sentence is true or false, fairminded or slanderous,<br> self-evident or self-contradictory, lovely poetry or ungainly prose?<br> That also measuring with utmost care the jots over the small I’s and<br> small J’s even to the extend of counting every ink molecule will not<br> give you sufficient information to make these judgment?</br></br></br></br></br></br></br></br></br></br></br></li><li>If all empirical statements can be reduced to measured fundamental<br> quantities, and no statements about imponderables such as good and bad,<br> valid and invalid, fair or foul can be reduced to measurable fundamental<br> qualities, then they have no overlap whatsoever in topic or probative<br> value, Ergo no imponderable can be proved or disproved by purely<br> empirical statement, no matter how numerous or complex.</br></br></br></br></br></li></ol><p> To head off an obvious objection, the quantities facts about the<br> molecules and atoms in a man’s brain have some sort of unknown relation<br> to his ability to make qualitative judgments. Drunkenness or drugs or a<br> blow to the head can, for example, impede the operations of memory and<br> judgment and other cognitive powers, or drive him mad, or kill a man<br> altogether. There is, however, not a single iota of evidence showing a<br> relation between the imponderable cognitive content and any quantitative<br> facts about brain molecules.</br></br></br></br></br></br></br></p></blockquote><p>WRF3, you are now formally invited to do your thing.  But if you don’t mind an observation, this “Rolf Andreassen” at Mr. Wright’s site is presenting arguments that sound remarkably similar to those you have made here in the past.</p><p>This should be interesting.  “How much does a thought weigh?” has always struck me as being a question akin to “how many angels can dance on the head of a pin?” or “why does purple?”  But perhaps we shall be convinced otherwise.</p></div>",
  "content_text": "John C. Wright explains why Sam Harris’s latest crusade is misplaced;\nempiricism is useless with regards answering non-empirical questions\n, thereby rendering the derivation of “ought” from “is’ impossible:\nHere is my proof.\nDo you agree that the international scientific community has\nreduced all empirical entities to certain basic constants, namely mass,\nlength, duration, temperature, current, candlepower, moles of substance,\nsuch that any empirical subject (such as the acceleration due to\ngravity of a cannonball or color defined as light-frequency) can be\nexpressed in terms of these measurable quantities or some calculated\nderivation of these quantities?  (I do note that for subatomic\nparticles, some additional fundamentals are needed, but these are also\nquantities, and not qualities, and therefore do not effect the\nargument.)\nA quality is a judgment concerning an imponderable entity, such as\ntrue or untrue, valid or invalid, comely or ugly. A quantity is a\nmultitude of magnitudes, or in other words, a quantity can be measured\nagainst a standard or counted with numbers or both. Do you agree that no\nquality can be reduced to quantity by any means whatsoever?For example,\ndo you agree that counting the number of vowels used to express a given\nsentence written in ink in Esperanto will not necessarily tell you\nwhether the sentence is true or false, fairminded or slanderous,\nself-evident or self-contradictory, lovely poetry or ungainly prose?\nThat also measuring with utmost care the jots over the small I’s and\nsmall J’s even to the extend of counting every ink molecule will not\ngive you sufficient information to make these judgment?\nIf all empirical statements can be reduced to measured fundamental\nquantities, and no statements about imponderables such as good and bad,\nvalid and invalid, fair or foul can be reduced to measurable fundamental\nqualities, then they have no overlap whatsoever in topic or probative\nvalue, Ergo no imponderable can be proved or disproved by purely\nempirical statement, no matter how numerous or complex.\nTo head off an obvious objection, the quantities facts about the\nmolecules and atoms in a man’s brain have some sort of unknown relation\nto his ability to make qualitative judgments. Drunkenness or drugs or a\nblow to the head can, for example, impede the operations of memory and\njudgment and other cognitive powers, or drive him mad, or kill a man\naltogether. There is, however, not a single iota of evidence showing a\nrelation between the imponderable cognitive content and any quantitative\nfacts about brain molecules.\nWRF3, you are now formally invited to do your thing.  But if you don’t mind an observation, this “Rolf Andreassen” at Mr. Wright’s site is presenting arguments that sound remarkably similar to those you have made here in the past.\nThis should be interesting.  “How much does a thought weigh?” has always struck me as being a question akin to “how many angels can dance on the head of a pin?” or “why does purple?”  But perhaps we shall be convinced otherwise.",
  "tags": [
    "philosophy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-26T07:25:00+00:00"
}