{
  "url": "https://voxday.net/2013/06/22/thus-am-i-refuted/",
  "scraped_at": "2025-12-14T22:32:53.479506",
  "title": "Thus am I refuted",
  "date_display": "June 22, 2013",
  "date_iso": "2013-06-22T17:30:00+00:00",
  "date_from_url": "2013-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Aliette de Bodard <a href=\"https://twitter.com/aliettedb/status/347798998851137536\">inadvertently makes a powerful case</a> against my assertions of savagery in the SFWA on Twitter:</p><blockquote><p> “When I was 13 or so, I stabbed boy who was bothering me with pointy end<br> of a pair of compasses (planted it in his hand when he reached out)”</br></p><p>“to be fair, I didn’t have much body strength; they barely broke skin. He was mostly surprised that I attacked…”</p><p>“Felt quite happy (still do).”</p></blockquote><p>All righty then.  I stand corrected. She only stabbed him, after all, it’s not as if she dismembered and ate him or anything.  Civilization is a relative concept, is it not? But let’s not let our expectations rise too high, as the woman actually <a href=\"http://aliettedebodard.com/2012/07/12/links-on-worldbuilding-and-patchworks/#comment-121145\">defends “death threats… made to various writers”</a> on the grounds of them being “performance rage”.</p><p><i>“[B]y “performance rage”, I mean that RH doesn’t actually intend to send<br> minions to decapitate all white men, or to carry out the death threats<br> she’s made to various writers. But I’m pretty sure she’s genuinely<br> furious at the cultural appropriation and misogyny that is unfortunately<br> rife in genre; and that posts like the one I pointed out stem from<br> genuine anger rather than a simple desire to rile people up.”</br></br></br></br></br></i></p><p>So, death threats are acceptable so long as one is genuinely furious.  Got it. Remember, these are the very pinkshirts who claim that straight white men are full of hate, rage, and fear.</p></div>",
  "content_text": "Aliette de Bodard\ninadvertently makes a powerful case\nagainst my assertions of savagery in the SFWA on Twitter:\n“When I was 13 or so, I stabbed boy who was bothering me with pointy end\nof a pair of compasses (planted it in his hand when he reached out)”\n“to be fair, I didn’t have much body strength; they barely broke skin. He was mostly surprised that I attacked…”\n“Felt quite happy (still do).”\nAll righty then.  I stand corrected. She only stabbed him, after all, it’s not as if she dismembered and ate him or anything.  Civilization is a relative concept, is it not? But let’s not let our expectations rise too high, as the woman actually\ndefends “death threats… made to various writers”\non the grounds of them being “performance rage”.\n“[B]y “performance rage”, I mean that RH doesn’t actually intend to send\nminions to decapitate all white men, or to carry out the death threats\nshe’s made to various writers. But I’m pretty sure she’s genuinely\nfurious at the cultural appropriation and misogyny that is unfortunately\nrife in genre; and that posts like the one I pointed out stem from\ngenuine anger rather than a simple desire to rile people up.”\nSo, death threats are acceptable so long as one is genuinely furious.  Got it. Remember, these are the very pinkshirts who claim that straight white men are full of hate, rage, and fear.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2013-06-22T16:30:00+00:00"
}