{
  "url": "https://voxday.net/2013/06/12/un-braccio-di-ferro/",
  "scraped_at": "2025-12-14T22:31:44.320926",
  "title": "Un Braccio di Ferro",
  "date_display": "June 12, 2013",
  "date_iso": "2013-06-12T20:30:00+00:00",
  "date_from_url": "2013-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Italy is rapidly losing patience <a href=\"http://www.telegraph.co.uk/finance/comment/ambroseevans_pritchard/10116331/Italian-showdown-with-Germany-over-euro-looms-closer.html\">with the EU</a>:</p><blockquote class=\"tr_bq\"><div class=\"firstPar\"> Something snapped in the Italian psyche last week after the European Central<br> Bank offered nothing to combat the credit crunch asphyxiating small<br> business, and more broadly washed its hands of Euroland’s incipient<br> deflation crisis and catastrophic wastage of its youth.</br></br></br></div><div class=\"secondPar\"> The next day ex-premier Silvio Berlusconi called for a showdown, or “Braccio<br> di Ferro”, with northern powers before it loses it chemical, car and steel<br> industries altogether.</br></br></div><div class=\"thirdPar\"> Mr Berlusconi told <i>Il Foglio</i> that Italy’s government – which his<br> Liberty Party keeps in office – is complicitly serving forces that are<br> destroying Italy. It must instead confront the north, “and particularly<br> Angela Merkel’s Germany”, with a stark choice: either they call a halt to<br> fiscal and monetary contraction, and opt instead for full-blown reflation;<br> or they must expect the victims to snatch back their own destinies.</br></br></br></br></br></div></blockquote><p>And keep in mind, Berlusconi and the Liberty Party are the moderates. Beppo Grillo and Movimento 5 Stelle are even more openly anti-EU.  Italy has to leave the Euro and I’ve always suspected they would be the first to do so.  Evans-Pritchard knows it too:</p><blockquote class=\"tr_bq\"><p> A game theory study by Bank of America found that Italy would benefit most<br> among big EMU states from a euro exit. It has a primary surplus, so it would<br> not face an instant funding crisis. It has fat gold reserves, providing bond<br> collateral that could be used to raise €400bn in a crisis. Italian household<br> wealth is €275,200, compared with €195,200 for Germany. A basket case it is not, and Italy’s industrial barons know it. The country<br> has one great structural problem: it is in the wrong currency with an<br> intra-EMU exchange rate overvalued by 20pc to 25pc.</br></br></br></br></br></br></p></blockquote><p>Forza Lira!</p></div>",
  "content_text": "Italy is rapidly losing patience\nwith the EU\n:\nSomething snapped in the Italian psyche last week after the European Central\nBank offered nothing to combat the credit crunch asphyxiating small\nbusiness, and more broadly washed its hands of Euroland’s incipient\ndeflation crisis and catastrophic wastage of its youth.\nThe next day ex-premier Silvio Berlusconi called for a showdown, or “Braccio\ndi Ferro”, with northern powers before it loses it chemical, car and steel\nindustries altogether.\nMr Berlusconi told\nIl Foglio\nthat Italy’s government – which his\nLiberty Party keeps in office – is complicitly serving forces that are\ndestroying Italy. It must instead confront the north, “and particularly\nAngela Merkel’s Germany”, with a stark choice: either they call a halt to\nfiscal and monetary contraction, and opt instead for full-blown reflation;\nor they must expect the victims to snatch back their own destinies.\nAnd keep in mind, Berlusconi and the Liberty Party are the moderates. Beppo Grillo and Movimento 5 Stelle are even more openly anti-EU.  Italy has to leave the Euro and I’ve always suspected they would be the first to do so.  Evans-Pritchard knows it too:\nA game theory study by Bank of America found that Italy would benefit most\namong big EMU states from a euro exit. It has a primary surplus, so it would\nnot face an instant funding crisis. It has fat gold reserves, providing bond\ncollateral that could be used to raise €400bn in a crisis. Italian household\nwealth is €275,200, compared with €195,200 for Germany. A basket case it is not, and Italy’s industrial barons know it. The country\nhas one great structural problem: it is in the wrong currency with an\nintra-EMU exchange rate overvalued by 20pc to 25pc.\nForza Lira!",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-12T19:30:00+00:00"
}