{
  "url": "https://voxday.net/2013/06/01/women-ruin-everything-sfwa-edition/",
  "scraped_at": "2025-12-14T22:30:31.930513",
  "title": "Women Ruin Everything: SFWA edition",
  "date_display": "June 1, 2013",
  "date_iso": "2013-06-01T08:55:00+00:00",
  "date_from_url": "2013-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A female writer <a href=\"http://ecatherine.com/dear-sfwa/\">quits the SFWA</a> because she believes <i>it isn’t sufficiently feminized</i>:</p><blockquote class=\"tr_bq\"><p> It began with issue #200 of the <i>Bulletin</i>—all right, #199 if we want to get technical. It began with the <a href=\"http://en.wikipedia.org/wiki/Mike_Resnick\">Resnick</a> and <a href=\"http://en.wikipedia.org/wiki/Barry_N._Malzberg\">Malzberg</a><br> Dialogues, a long-time feature of the publication. It began when two<br> men sat down to have a dialogue about editors and writers of the female<br> gender. How fantastic, I thought, because I, being a writer and an<br> editor and female, had a keen interest in such things. I love reading<br> anthologies such as <i>Women of Wonder</i> (and its sequel) and seeing<br> how women impacted and contributed to this forward-looking and -thinking<br> genre I love. I hoped they might include the women who inspired me and<br> introduce me to many I hadn’t yet discovered.</br></br></br></br></br></br></br></br></p><p>That’s not what I found. I found a dialogue that seemed more focused<br> on how these “lady editors” and “lady writers” looked in bathing suits,<br> and that they were “beauty pageant beautiful” or a “knock out.” I am<br> certain no condescension was intended with the use of “lady,” but as the<br> dialogues went on, I felt the word carried a certain tone—perhaps that<br> was a fiction of my own making. As I listened to these two men talk<br> about lady editors and writers they had known, I grew uneasy. Something<br> wasn’t right…..</br></br></br></br></br></br></br></p><p>And now, apparently, we who voiced complaint are having another finger leveled toward us, saying how <i>dare </i>we?<br> How dare we voice a contrary opinion—surely we want to silence all<br> thoughts that are unlike our own! Surely we want to strike these men and<br> their dated notions from all records!</br></br></br></p><p>Because we ask to be respected and have our point of view respected<br> does not mean we wish to obliterate the point of view of another. Because we ask to be treated with the same thought you would give a<br> person of your own gender, a person of a different gender, a person of a<br> different religion, a person of your own religion, a person of your own<br> race, a person of a different race, does not mean we seek to tear down<br> anything you believe, follow, or espouse.</br></br></br></br></br></p></blockquote><p>This woman isn’t content with the ruination of both the organization and most of the science fiction publishing houses, now she wants to put limits on the opinions expressed by the old lions of the field, eliminate the very sort of artwork that helped make the old SF publications popular in the first place, and be held immune from criticism for her fascism.</p><p>She is, plain and simply, lying.  She clearly wants to silence all thoughts that she finds insufficiently respectful.  She does wish to obliterate a masculine point of view that she finds offensive. It is women like her, and their gamma male allies, who have devastated science fiction, who have driven most of its male readers away from books and toward games, and who are responsible for the genre’s declining sales and inability to replace the classics of previous decades.  This is little more than an attempt to silence the remnants of the SFWA’s old guard.</p><p>As we learned yesterday, I am unpublishable by the present standards in the publishing industry.  But I am far from the only one, very far from it.  I am no Heinlein or Herbert, perhaps more akin to a Resnick or Malzberg, but it should be abundantly clear that none of these four men could get break into publication today, that their perspectives are intrinsically offensive, and none of them would be able to successfully navigate the maze of scalzied manboobs and feminist fascists who have infiltrated the genre and now control the editorial gates at the professional magazines and publishing houses.</p><p>Neither should it be any surprise to observe that the genre is dying, just like every other male-dominated endeavor that permits, or is forced, to allow the “equal opportunity” that somehow always ends with women telling men what they are allowed to think, say, and do.  It is the same pattern we have seen play out again and again and again. But I think Ms Tobler is to be congratulated for leaving the SFWA and I think her action shows that she is an admirable role model for many SFWA members.  <br> <i><br/></i><br> <i>Dear Ms Tobler,</i><br> <i><br/></i><br> <i>Congratulations on quitting the SFWA.  I’m sure it was a real shock to learn that the old lions of the field are not inclined to immediately adjust their thinking to your liking upon demand and I’m sorry you had to experience such palpable horror.</i><br> <i><br/></i><br> <i>Now, if you will please take the rest of the feminist fascists who believe romance novels in space, necrobestiality, and rehashed Regency romances are science fiction with you, thus permitting the real SF writers to get on with the business of writing actual science fiction for readers who enjoy it, you will do a great service to both SFWA and the field of science fiction.</i><br> <i><br/></i><br> <i>Best regards,</i><br> <i>Vox</i></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "A female writer\nquits the SFWA\nbecause she believes\nit isn’t sufficiently feminized\n:\nIt began with issue #200 of the\nBulletin\n—all right, #199 if we want to get technical. It began with the\nResnick\nand\nMalzberg\nDialogues, a long-time feature of the publication. It began when two\nmen sat down to have a dialogue about editors and writers of the female\ngender. How fantastic, I thought, because I, being a writer and an\neditor and female, had a keen interest in such things. I love reading\nanthologies such as\nWomen of Wonder\n(and its sequel) and seeing\nhow women impacted and contributed to this forward-looking and -thinking\ngenre I love. I hoped they might include the women who inspired me and\nintroduce me to many I hadn’t yet discovered.\nThat’s not what I found. I found a dialogue that seemed more focused\non how these “lady editors” and “lady writers” looked in bathing suits,\nand that they were “beauty pageant beautiful” or a “knock out.” I am\ncertain no condescension was intended with the use of “lady,” but as the\ndialogues went on, I felt the word carried a certain tone—perhaps that\nwas a fiction of my own making. As I listened to these two men talk\nabout lady editors and writers they had known, I grew uneasy. Something\nwasn’t right…..\nAnd now, apparently, we who voiced complaint are having another finger leveled toward us, saying how\ndare\nwe?\nHow dare we voice a contrary opinion—surely we want to silence all\nthoughts that are unlike our own! Surely we want to strike these men and\ntheir dated notions from all records!\nBecause we ask to be respected and have our point of view respected\ndoes not mean we wish to obliterate the point of view of another. Because we ask to be treated with the same thought you would give a\nperson of your own gender, a person of a different gender, a person of a\ndifferent religion, a person of your own religion, a person of your own\nrace, a person of a different race, does not mean we seek to tear down\nanything you believe, follow, or espouse.\nThis woman isn’t content with the ruination of both the organization and most of the science fiction publishing houses, now she wants to put limits on the opinions expressed by the old lions of the field, eliminate the very sort of artwork that helped make the old SF publications popular in the first place, and be held immune from criticism for her fascism.\nShe is, plain and simply, lying.  She clearly wants to silence all thoughts that she finds insufficiently respectful.  She does wish to obliterate a masculine point of view that she finds offensive. It is women like her, and their gamma male allies, who have devastated science fiction, who have driven most of its male readers away from books and toward games, and who are responsible for the genre’s declining sales and inability to replace the classics of previous decades.  This is little more than an attempt to silence the remnants of the SFWA’s old guard.\nAs we learned yesterday, I am unpublishable by the present standards in the publishing industry.  But I am far from the only one, very far from it.  I am no Heinlein or Herbert, perhaps more akin to a Resnick or Malzberg, but it should be abundantly clear that none of these four men could get break into publication today, that their perspectives are intrinsically offensive, and none of them would be able to successfully navigate the maze of scalzied manboobs and feminist fascists who have infiltrated the genre and now control the editorial gates at the professional magazines and publishing houses.\nNeither should it be any surprise to observe that the genre is dying, just like every other male-dominated endeavor that permits, or is forced, to allow the “equal opportunity” that somehow always ends with women telling men what they are allowed to think, say, and do.  It is the same pattern we have seen play out again and again and again. But I think Ms Tobler is to be congratulated for leaving the SFWA and I think her action shows that she is an admirable role model for many SFWA members.\nDear Ms Tobler,\nCongratulations on quitting the SFWA.  I’m sure it was a real shock to learn that the old lions of the field are not inclined to immediately adjust their thinking to your liking upon demand and I’m sorry you had to experience such palpable horror.\nNow, if you will please take the rest of the feminist fascists who believe romance novels in space, necrobestiality, and rehashed Regency romances are science fiction with you, thus permitting the real SF writers to get on with the business of writing actual science fiction for readers who enjoy it, you will do a great service to both SFWA and the field of science fiction.\nBest regards,\nVox",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-06-01T07:55:00+00:00"
}