{
  "url": "https://voxday.net/2016/11/01/31-million/",
  "scraped_at": "2025-12-18T02:02:24.207415",
  "title": "3.1 million",
  "date_display": "November 1, 2016",
  "date_iso": "2016-11-01T13:56:00+00:00",
  "date_from_url": "2016-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For nearly 10 years, I didn’t think much about the traffic statistics, until in 2012, a few Scalzi fans began trying to taunt me with McRapey’s supposedly massive traffic at <i>Whatever</i>. (Key word: supposedly). So, it now gives me a sense of satisfaction every time a new high-water mark is reached. October 2016 marks the first time I’ve hit<i> three times</i> the all-time peak for the former most popular blog in science fiction, which was recorded in May 2012.</p><p>Of course, it’s around 6x <i>Whatever</i>‘s current traffic, but no one cares about that anymore.</p><p>Anyhow, October set a new traffic records for both VP – 2,615,169 Google pageviews – and VP+AG – 3,112,416. It will be close, but it now looks like the combined blog total will exceed 30 million in 2016, up considerably from last year’s 20,776,969 pageviews.</p><p>A lot of that is the election, of course, but there was no dropoff at all after November 2012, so perhaps the newly come Ilk will become the foundation for the next ramp up to 50 million annually. Who knows?</p><p>There is a deeper point to this post, however, beyond the petty ball-spiking. Past performance can be indicative of future performance, but that is not always the case. For example, I have a pretty good statistical model that predicts traffic growth with a reasonable degree of accuracy. It can be so good that it predicted 1,990,883 pageviews in January 2016. The actual number was 1,982,034. That’s precision to within half of one percent! It also predicted 27,682,865 pageviews for 2016; we’re presently at 24,247,801 with two months to go. Not bad, right?</p><p>That, you see, is why I take dh very seriously when he discusses the election in terms of the historical poll analyses. His perspective is not irrelevant. Far from it. On the other hand, one also has to be aware that these statistical trends, however reliable they tend to be, <i>are not determinative</i>. One also has to pay attention to potential outliers, and recognize the scenarios when they are likely to be in play.</p><p>For example, my impressively precise traffic model predicted 2,019,930 pageviews in October 2016. The actual result, previously mentioned, turned out to be 54 percent higher.</p><p>TL;DR: Thank you for visiting. Feel free to join the discourse. And please to enjoy the incipient <a href=\"https://crypto.fashion/collections/dark-lord-designs/products/trumpsl-de-t-shirt\">Trumpslide</a>.</p></div>",
  "content_text": "For nearly 10 years, I didn’t think much about the traffic statistics, until in 2012, a few Scalzi fans began trying to taunt me with McRapey’s supposedly massive traffic at\nWhatever\n. (Key word: supposedly). So, it now gives me a sense of satisfaction every time a new high-water mark is reached. October 2016 marks the first time I’ve hit\nthree times\nthe all-time peak for the former most popular blog in science fiction, which was recorded in May 2012.\nOf course, it’s around 6x\nWhatever\n‘s current traffic, but no one cares about that anymore.\nAnyhow, October set a new traffic records for both VP – 2,615,169 Google pageviews – and VP+AG – 3,112,416. It will be close, but it now looks like the combined blog total will exceed 30 million in 2016, up considerably from last year’s 20,776,969 pageviews.\nA lot of that is the election, of course, but there was no dropoff at all after November 2012, so perhaps the newly come Ilk will become the foundation for the next ramp up to 50 million annually. Who knows?\nThere is a deeper point to this post, however, beyond the petty ball-spiking. Past performance can be indicative of future performance, but that is not always the case. For example, I have a pretty good statistical model that predicts traffic growth with a reasonable degree of accuracy. It can be so good that it predicted 1,990,883 pageviews in January 2016. The actual number was 1,982,034. That’s precision to within half of one percent! It also predicted 27,682,865 pageviews for 2016; we’re presently at 24,247,801 with two months to go. Not bad, right?\nThat, you see, is why I take dh very seriously when he discusses the election in terms of the historical poll analyses. His perspective is not irrelevant. Far from it. On the other hand, one also has to be aware that these statistical trends, however reliable they tend to be,\nare not determinative\n. One also has to pay attention to potential outliers, and recognize the scenarios when they are likely to be in play.\nFor example, my impressively precise traffic model predicted 2,019,930 pageviews in October 2016. The actual result, previously mentioned, turned out to be 54 percent higher.\nTL;DR: Thank you for visiting. Feel free to join the discourse. And please to enjoy the incipient\nTrumpslide\n.",
  "tags": [
    "McRapey",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-01T13:56:00+00:00"
}