{
  "url": "https://voxday.net/2016/11/08/a-trinity-of-badthink/",
  "scraped_at": "2025-12-18T02:03:56.328189",
  "title": "A trinity of badthink",
  "date_display": "November 8, 2016",
  "date_iso": "2016-11-08T15:30:00+00:00",
  "date_from_url": "2016-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Media Matters is freaking out that Donald Trump Jr. <a href=\"https://archive.fo/EqX4Z#selection-889.0-1003.173\">is cognizant of the Alt-Right</a>, or at least its moderate branch. But perhaps it is actually more concerned about the fact that some of the uglier allegations can be connected to their founder, David Brock.</p><blockquote><p> Donald Trump Jr. promoted an “alt-right” video on his Twitter account that suggests Democratic nominee Hillary Clinton’s campaign is engaged in satanism and her aides are trying to “kidnap your children, make them disappear, sell them into all kinds of things.” The video features “alt-right” bloggers Vox Day, who claims blacks are inferior to whites, and Mike Cernovich, a rape apologist.</p><p>The “spirit cooking scandal” refers to a hacked email posted to WikiLeaks in which lobbyist Tony Podesta asked his brother, Clinton campaign chairman John Podesta, if he wanted to attend a “spirit cooking dinner” hosted by performance artist Marina Abramović. Trump supporters have used the invitation to claim that Podesta and the Clinton campaign are Satan worshippers. The Washington Post debunked the absurd claim, writing that an email “inviting Clinton’s campaign chair to dinner — a dinner he didn’t even attend — is not proof of any of the things that the Trump Internet is claiming about it right now.”</p><p>During the video, Molyneux says the news is “extraordinary,” referring to the “Podesta emails, which is all this spirit cooking stuff, and invitations to what seems like occult magic/satanic rituals/I don’t know what the hell is going on.” Cernovich claimed that the allegations are “worse” than what people are saying and that “John Podesta and his brother are doing this together with who knows how many people are there.”</p><p>The video also suggests Podesta and his allies might be luring children with their alleged “spirit cooking” parties — a variation of the “pants on fire” false claim that the Clintons are running an underground sex ring targeting children.</p><p>Vox Day asked: “Given all of the other weirdness that is surrounding Podesta, and is surrounding these people — because these are the same people that were talking about this whole spirit cooking thing. And so that’s what’s very troubling. I mean, would you ever want your young children going to a party with John Podesta and his spirit cooking?”</p><p>Mike Cernovich later said: “If you’re going to have children, you don’t want to live in a world where these people could potentially kidnap your children, make them disappear, sell them into all kinds of things, or who knows what. And that’s what people are realizing now is the gatekeepers are gone. The media people, they’re not writing about this because they’re right there at these parties — with them.”</p><p>Day also praised Trump Jr., saying that “he looks like he wants to personally waterboard or guillotine every single member of Hillary Clinton’s circle” during the debates.</p><p>Vox Day is an “alt-right” writer with a history of pushing racist and misogynistic rhetoric. He has tweeted that “I support white nationalism.” He also tweeted that “I am an Alt Right nationalist, I’m American Indian.” Day has a long history of racism. He has tweeted that African-Americans have lower IQs than others, are more prone to violence, and are worse than an atomic bomb for a city.</p></blockquote><p>First, I find it amusing that Media Matters think this is going to somehow discredit or disqualify any of us. I stand by every single word and every single tweet quoted. Second, no one has claimed that the Clintons are <i>running </i>an underground sex ring targeting children. We <i>merely </i>suspect that the Clintons are connected to those who run it, and we are inclined to believe that the allegations that one or more Clintons have sexually abused minors are true.</p><p>Third, note that Media Matters was founded by David Brock, <a href=\"https://www.google.ch/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwiU6Y7WnpnQAhVJ5xoKHcPPAxMQFggcMAA&amp;url=https%3A%2F%2Fwww.reddit.com%2Fr%2FThe_Donald%2Fcomments%2F5b1qtf%2Fcomet_ping_pong_pizzagate_summary%2F&amp;usg=AFQjCNGkldpspO76CpFahgk1N4XuMLJUBQ&amp;sig2=nsSD94Cr33DbAhfeQ_ou-w\">who is reportedly connected to James Alefantis</a>, the owner of Comet Ping Pong.</p><p>We can only hope that after the ascension of the God-Emperor to the Cherry Blossom Throne, he will appoint his son Chief Inquisitor and order him to cleanse the filth with purifying fire.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://i.imgur.com/7DMH5yg.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://i.imgur.com/7DMH5yg.jpg\" width=\"311\"/></a></div><p></p></div>",
  "content_text": "Media Matters is freaking out that Donald Trump Jr.\nis cognizant of the Alt-Right\n, or at least its moderate branch. But perhaps it is actually more concerned about the fact that some of the uglier allegations can be connected to their founder, David Brock.\nDonald Trump Jr. promoted an “alt-right” video on his Twitter account that suggests Democratic nominee Hillary Clinton’s campaign is engaged in satanism and her aides are trying to “kidnap your children, make them disappear, sell them into all kinds of things.” The video features “alt-right” bloggers Vox Day, who claims blacks are inferior to whites, and Mike Cernovich, a rape apologist.\nThe “spirit cooking scandal” refers to a hacked email posted to WikiLeaks in which lobbyist Tony Podesta asked his brother, Clinton campaign chairman John Podesta, if he wanted to attend a “spirit cooking dinner” hosted by performance artist Marina Abramović. Trump supporters have used the invitation to claim that Podesta and the Clinton campaign are Satan worshippers. The Washington Post debunked the absurd claim, writing that an email “inviting Clinton’s campaign chair to dinner — a dinner he didn’t even attend — is not proof of any of the things that the Trump Internet is claiming about it right now.”\nDuring the video, Molyneux says the news is “extraordinary,” referring to the “Podesta emails, which is all this spirit cooking stuff, and invitations to what seems like occult magic/satanic rituals/I don’t know what the hell is going on.” Cernovich claimed that the allegations are “worse” than what people are saying and that “John Podesta and his brother are doing this together with who knows how many people are there.”\nThe video also suggests Podesta and his allies might be luring children with their alleged “spirit cooking” parties — a variation of the “pants on fire” false claim that the Clintons are running an underground sex ring targeting children.\nVox Day asked: “Given all of the other weirdness that is surrounding Podesta, and is surrounding these people — because these are the same people that were talking about this whole spirit cooking thing. And so that’s what’s very troubling. I mean, would you ever want your young children going to a party with John Podesta and his spirit cooking?”\nMike Cernovich later said: “If you’re going to have children, you don’t want to live in a world where these people could potentially kidnap your children, make them disappear, sell them into all kinds of things, or who knows what. And that’s what people are realizing now is the gatekeepers are gone. The media people, they’re not writing about this because they’re right there at these parties — with them.”\nDay also praised Trump Jr., saying that “he looks like he wants to personally waterboard or guillotine every single member of Hillary Clinton’s circle” during the debates.\nVox Day is an “alt-right” writer with a history of pushing racist and misogynistic rhetoric. He has tweeted that “I support white nationalism.” He also tweeted that “I am an Alt Right nationalist, I’m American Indian.” Day has a long history of racism. He has tweeted that African-Americans have lower IQs than others, are more prone to violence, and are worse than an atomic bomb for a city.\nFirst, I find it amusing that Media Matters think this is going to somehow discredit or disqualify any of us. I stand by every single word and every single tweet quoted. Second, no one has claimed that the Clintons are\nrunning\nan underground sex ring targeting children. We\nmerely\nsuspect that the Clintons are connected to those who run it, and we are inclined to believe that the allegations that one or more Clintons have sexually abused minors are true.\nThird, note that Media Matters was founded by David Brock,\nwho is reportedly connected to James Alefantis\n, the owner of Comet Ping Pong.\nWe can only hope that after the ascension of the God-Emperor to the Cherry Blossom Throne, he will appoint his son Chief Inquisitor and order him to cleanse the filth with purifying fire.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-08T15:30:00+00:00"
}