{
  "url": "https://voxday.net/2016/11/23/adios-asimovs/",
  "scraped_at": "2025-12-18T02:06:34.171078",
  "title": "Adios, Asimov’s",
  "date_display": "November 23, 2016",
  "date_iso": "2016-11-23T13:00:00+00:00",
  "date_from_url": "2016-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I dropped my subscription 15 years ago. And apparently, <a href=\"https://barbarianbookclub.com/2016/11/16/goodbye-asimovs/\">the magazine has only gotten worse over time</a>. It’s not even a science fiction magazine anymore:</p><blockquote><p> The quality and type of fiction is a magazine is largely dependent on the main editor. If you find a magazine whose editor has tastes that align with your own it’s a guarantee that you will enjoy at least some of the stories included.</p><p>Sadly, Sheila Williams and <i>Asimov’s </i>do not align with my tastes at all. Actually I would like to know who her tastes align with because based on the stories in the last few issues I’m beginning to think she doesn’t actually like Science Fiction or Fantasy.</p><p>I have a digital subscription. Correction, had because I’m way over waiting for an actual SFF story from this magazine. The latest issue was the last I will ever read. Not one of the stories was an actual SFF piece. The only SF was background window dressing or downright stupid. The crowning achievement of the magazine was an idiotic novella about a gay waiter who traveled to Colonial times pretending to be an angel and getting the locals addicted to meth so he can take back Paul Revere’s silver spoons. A premise so stupid and insulting I wanted to toss my Kindle.</p></blockquote><p>On the other hand, maybe we’ve misjudged these SF SJWs. Maybe they’re all just variant on the Chuck Tingle theme. Let’s face it, time-travelling gay waiters selling meth in colonial America is a pretty funny concept.</p><p>And then there is that moment when you realize that a) they’re serious, and, b) they genuinely think it is good. At this rate, Chuck Tingle is going to win a Hugo without requiring any Puppy assistance.</p></div>",
  "content_text": "I dropped my subscription 15 years ago. And apparently,\nthe magazine has only gotten worse over time\n. It’s not even a science fiction magazine anymore:\nThe quality and type of fiction is a magazine is largely dependent on the main editor. If you find a magazine whose editor has tastes that align with your own it’s a guarantee that you will enjoy at least some of the stories included.\nSadly, Sheila Williams and\nAsimov’s\ndo not align with my tastes at all. Actually I would like to know who her tastes align with because based on the stories in the last few issues I’m beginning to think she doesn’t actually like Science Fiction or Fantasy.\nI have a digital subscription. Correction, had because I’m way over waiting for an actual SFF story from this magazine. The latest issue was the last I will ever read. Not one of the stories was an actual SFF piece. The only SF was background window dressing or downright stupid. The crowning achievement of the magazine was an idiotic novella about a gay waiter who traveled to Colonial times pretending to be an angel and getting the locals addicted to meth so he can take back Paul Revere’s silver spoons. A premise so stupid and insulting I wanted to toss my Kindle.\nOn the other hand, maybe we’ve misjudged these SF SJWs. Maybe they’re all just variant on the Chuck Tingle theme. Let’s face it, time-travelling gay waiters selling meth in colonial America is a pretty funny concept.\nAnd then there is that moment when you realize that a) they’re serious, and, b) they genuinely think it is good. At this rate, Chuck Tingle is going to win a Hugo without requiring any Puppy assistance.",
  "tags": [
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-23T13:00:00+00:00"
}