{
  "url": "https://voxday.net/2016/11/24/alt-right-what-it-is/",
  "scraped_at": "2025-12-18T02:06:45.028418",
  "title": "Alt-Right: what it is",
  "date_display": "November 24, 2016",
  "date_iso": "2016-11-24T07:00:00+00:00",
  "date_from_url": "2016-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was helpfully provided with a translation of the 16 Points for the fat middle of the Bell Curve. I trust this will clarify the more complicated and challenging points that were troubling some English speakers.</p><p>1. Alt Right is right-wing. No lefties!<br> 2. Alt Right edge, not lame. Cucks and cons <i>so </i>lame.<br> 3. Alt Right gonna win. Not gonna lose.<br> 4. Europe good, church good, white people good. History good too.<br> 5. Freedom for everybody!<br> 6. Stay home and don’t touch the foreign poop.<br> 7. Equality bad, equality isn’t even.<br> 8. Science good. Made-up shit bad.<br> 9. Everybody votes they boys.<br> 10. Small crew can’t tell big crowd what to do. Not for long, anyhow.<br> 11. MS-13 gonna kill Crips. Bloods gonna kill Latin Kings. Split them up!<br> 12. Alt Right got no fucks to give.<br> 13. Free trade bad. No jobs, no money, no good.<br> 14. White people good.<br> 15. Stay home and leave them Red, Yellow, Brown, and Black people alone.<br> 16. War bad, genocide bad too.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>TL;DR: Everyone should be left by they own damn selves</p><p>I’m informed that a midwit translation is in the works, but unfortunately, with all the caveats, definitions, and pedantic clarifications, it is already 1,600 pages long. Translators are also working on the sperg edition of the translation, which comes with 800 more footnotes and a 200-page appendix of additional definitions.</p></div>",
  "content_text": "I was helpfully provided with a translation of the 16 Points for the fat middle of the Bell Curve. I trust this will clarify the more complicated and challenging points that were troubling some English speakers.\n1. Alt Right is right-wing. No lefties!\n2. Alt Right edge, not lame. Cucks and cons\nso\nlame.\n3. Alt Right gonna win. Not gonna lose.\n4. Europe good, church good, white people good. History good too.\n5. Freedom for everybody!\n6. Stay home and don’t touch the foreign poop.\n7. Equality bad, equality isn’t even.\n8. Science good. Made-up shit bad.\n9. Everybody votes they boys.\n10. Small crew can’t tell big crowd what to do. Not for long, anyhow.\n11. MS-13 gonna kill Crips. Bloods gonna kill Latin Kings. Split them up!\n12. Alt Right got no fucks to give.\n13. Free trade bad. No jobs, no money, no good.\n14. White people good.\n15. Stay home and leave them Red, Yellow, Brown, and Black people alone.\n16. War bad, genocide bad too.\nTL;DR: Everyone should be left by they own damn selves\nI’m informed that a midwit translation is in the works, but unfortunately, with all the caveats, definitions, and pedantic clarifications, it is already 1,600 pages long. Translators are also working on the sperg edition of the translation, which comes with 800 more footnotes and a 200-page appendix of additional definitions.",
  "tags": [
    "#AltRight",
    "MPAI"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-24T07:00:00+00:00"
}