{
  "url": "https://voxday.net/2016/11/23/an-interview-with-mike-cernovic/",
  "scraped_at": "2025-12-18T02:06:41.312215",
  "title": "An interview with Mike Cernovich",
  "date_display": "November 23, 2016",
  "date_iso": "2016-11-23T18:15:00+00:00",
  "date_from_url": "2016-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>EveryJoe <a href=\"http://www.everyjoe.com/2016/11/23/politics/mike-cernovich-interview-maga-mindset/\">interviews the bestselling author</a> of <b><i><a href=\"http://amzn.to/2eaKrnE\">MAGA MINDSET</a></i></b>:</p><blockquote><p> EveryJoe:<i> In your book, MAGA Mindset: Making YOU and America Great Again, you claim that America’s motto might as well be “You can’t say that!” due to oppressive political correctness. How can individuals reclaim their free speech and fight back against outrage culture?</i></p><p>Mike Cernovich: Free speech in America is in a strange place. On the one hand, people are self-censoring due to fear of negative feedback. Americans are speaking out less than ever in history. Online hate mobs have ruined lives.</p><p>On the other side, there has never been more opportunity for free speech. Social media allows us to bypass fake news media gatekeepers, to share our message directly with the people. You can write a blog, start a podcast, create a YouTube channel, and even using social media platforms (although the future of these are less certain) like Twitter and Facebook to spread your message to the entire world.</p><p>People can support free speech by speaking truth to power, perhaps anonymously as a commentator. You can also share links to articles and video you find compelling. Those who aren’t in a position to speak publicly, due to the real risk of backlash, can also support those who share a positive and high impact message by providing resources to truth tellers.</p><p>EJ: <i>You wrote and published MAGA Mindset weeks before Trump won the election. At the time, nearly every poll had Hillary Clinton winning by a comfortable margin, but the book hinges on a Trump victory. Was that kind of bold move an example of the MAGA mindset in action?</i></p><p>MC: Yes! That was a meta-move of mine. How can I expect people to trust my writing if I don’t live it?</p><p>I went all in on my beliefs. Had Trump lost, my own credibility would have been destroyed. In MAGA Mindset, readers learn how to think big and make bold moves. The first lesson was taught in real-time by my choice to release MAGA Mindset before the election.</p><p>Publishing a book explaining why Trump won when the “experts” said he would lose is an example of the MAGA Mindset in action.</p><p>EJ: <i>At EveryJoe, we recently published an article that explained how Gamergate elected Donald Trump. Do you think Gamergate played a role in the election?</i></p><p>MC: Gamergate was the first pushback against the thought police. Before Gamergate, people who supported free speech felt isolated and alone. Gamergate showed that millions of people support free speech.</p><p>Moreover, Gamergate exposed unethical journalism of all types. People began trusting the media less than ever before. While I wouldn’t say Gamergate got Trump elected, it was a powerful force for free speech.</p></blockquote><p>Read <a href=\"http://www.everyjoe.com/2016/11/23/politics/mike-cernovich-interview-maga-mindset/\">the whole thing there</a>.</p></div>",
  "content_text": "EveryJoe\ninterviews the bestselling author\nof\nMAGA MINDSET\n:\nEveryJoe:\nIn your book, MAGA Mindset: Making YOU and America Great Again, you claim that America’s motto might as well be “You can’t say that!” due to oppressive political correctness. How can individuals reclaim their free speech and fight back against outrage culture?\nMike Cernovich: Free speech in America is in a strange place. On the one hand, people are self-censoring due to fear of negative feedback. Americans are speaking out less than ever in history. Online hate mobs have ruined lives.\nOn the other side, there has never been more opportunity for free speech. Social media allows us to bypass fake news media gatekeepers, to share our message directly with the people. You can write a blog, start a podcast, create a YouTube channel, and even using social media platforms (although the future of these are less certain) like Twitter and Facebook to spread your message to the entire world.\nPeople can support free speech by speaking truth to power, perhaps anonymously as a commentator. You can also share links to articles and video you find compelling. Those who aren’t in a position to speak publicly, due to the real risk of backlash, can also support those who share a positive and high impact message by providing resources to truth tellers.\nEJ:\nYou wrote and published MAGA Mindset weeks before Trump won the election. At the time, nearly every poll had Hillary Clinton winning by a comfortable margin, but the book hinges on a Trump victory. Was that kind of bold move an example of the MAGA mindset in action?\nMC: Yes! That was a meta-move of mine. How can I expect people to trust my writing if I don’t live it?\nI went all in on my beliefs. Had Trump lost, my own credibility would have been destroyed. In MAGA Mindset, readers learn how to think big and make bold moves. The first lesson was taught in real-time by my choice to release MAGA Mindset before the election.\nPublishing a book explaining why Trump won when the “experts” said he would lose is an example of the MAGA Mindset in action.\nEJ:\nAt EveryJoe, we recently published an article that explained how Gamergate elected Donald Trump. Do you think Gamergate played a role in the election?\nMC: Gamergate was the first pushback against the thought police. Before Gamergate, people who supported free speech felt isolated and alone. Gamergate showed that millions of people support free speech.\nMoreover, Gamergate exposed unethical journalism of all types. People began trusting the media less than ever before. While I wouldn’t say Gamergate got Trump elected, it was a powerful force for free speech.\nRead\nthe whole thing there\n.",
  "tags": [
    "Castalia House",
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-23T18:15:00+00:00"
}