{
  "url": "https://voxday.net/2016/11/05/avert-your-eyes/",
  "scraped_at": "2025-12-18T02:03:17.358514",
  "title": "Avert your eyes",
  "date_display": "November 5, 2016",
  "date_iso": "2016-11-05T17:00:00+00:00",
  "date_from_url": "2016-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This isn’t a book review, it’s a literary rape scene. Robert Stacy McCain <a href=\"https://medium.com/the-patriarch-tree/lessons-of-a-sex-object-4b57f666dec5#.ieyof5l21\">reviews Jessica Valenti’s SEX OBJECT</a>:</p><blockquote><p> New<br> York City is a terrible place to raise children. This is one obvious<br> lesson the discerning reader might glean from Sex Object, although it’s<br> not the lesson Valenti intends to teach, nor is it a lesson she has<br> learned, given that she and her husband, Andrew Golis, are now raising<br> their daughter in Brooklyn. The belief that New York is the only place<br> in America worth living has become an idée fixe among young writers,<br> even as the Internet has made it possible for anyone to be a writer<br> anywhere. No doubt the neighborhood in Brooklyn where Valenti and Golis<br> live is crowded with would-be writers in their 20s, English majors fresh<br> out of college, crowded into tiny apartments, working day jobs to pay<br> the rent in hope that their spare-time hobby — poetry, fiction,<br> political commentary, whatever — will someday make them famous. The<br> success of 1990s TV shows like Seinfeld, Friends, and Sex and the City<br> served as an advertisement for the idea that all the cool kids live in<br> New York, having zany adventures with their colorful cast of attractive<br> friends. The urban hipster lifestyle — tribes of carefree single buddies<br> hanging out together in their cool apartments — is now as blatantly<br> promoted by TV as was the suburban idyll of Ozzie and Harriet and Leave<br> It to Beaver in the 1950s. For all the media criticism that has emerged<br> from the latest feminist resurgence, no one seems to notice this<br> particular elephant in the room, i.e., the way TV sitcoms sell a<br> particular way of life. Because this urban hipster lifestyle is in fact<br> pursued by feminists themselves — all those ambitious 20-something girls<br> in Brooklyn — they don’t notice it for the same reason fish don’t<br> notice water.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>“Stay away from New York” is not a lesson<br> Jessica Valenti intends to teach in Sex Object, nor does she bother to<br> warn middle-class girls against the error of thinking that an elite<br> private university is the ticket to happiness.</br></br></br></p></blockquote><p>Read the whole thing. It’s funnier than all the collected performances of Amy Schumer combined.</p></div>",
  "content_text": "This isn’t a book review, it’s a literary rape scene. Robert Stacy McCain\nreviews Jessica Valenti’s SEX OBJECT\n:\nNew\nYork City is a terrible place to raise children. This is one obvious\nlesson the discerning reader might glean from Sex Object, although it’s\nnot the lesson Valenti intends to teach, nor is it a lesson she has\nlearned, given that she and her husband, Andrew Golis, are now raising\ntheir daughter in Brooklyn. The belief that New York is the only place\nin America worth living has become an idée fixe among young writers,\neven as the Internet has made it possible for anyone to be a writer\nanywhere. No doubt the neighborhood in Brooklyn where Valenti and Golis\nlive is crowded with would-be writers in their 20s, English majors fresh\nout of college, crowded into tiny apartments, working day jobs to pay\nthe rent in hope that their spare-time hobby — poetry, fiction,\npolitical commentary, whatever — will someday make them famous. The\nsuccess of 1990s TV shows like Seinfeld, Friends, and Sex and the City\nserved as an advertisement for the idea that all the cool kids live in\nNew York, having zany adventures with their colorful cast of attractive\nfriends. The urban hipster lifestyle — tribes of carefree single buddies\nhanging out together in their cool apartments — is now as blatantly\npromoted by TV as was the suburban idyll of Ozzie and Harriet and Leave\nIt to Beaver in the 1950s. For all the media criticism that has emerged\nfrom the latest feminist resurgence, no one seems to notice this\nparticular elephant in the room, i.e., the way TV sitcoms sell a\nparticular way of life. Because this urban hipster lifestyle is in fact\npursued by feminists themselves — all those ambitious 20-something girls\nin Brooklyn — they don’t notice it for the same reason fish don’t\nnotice water.\n“Stay away from New York” is not a lesson\nJessica Valenti intends to teach in Sex Object, nor does she bother to\nwarn middle-class girls against the error of thinking that an elite\nprivate university is the ticket to happiness.\nRead the whole thing. It’s funnier than all the collected performances of Amy Schumer combined.",
  "tags": [
    "Book Review"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-05T17:00:00+00:00"
}