{
  "url": "https://voxday.net/2016/11/17/blog-pos/",
  "scraped_at": "2025-12-18T02:05:37.348118",
  "title": "הימין האלטרנטיבי, מהו",
  "date_display": "November 17, 2016",
  "date_iso": "2016-11-17T17:17:00+00:00",
  "date_from_url": "2016-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 1.<br> הימין האלטרנטיבי הוא ימני במובן האמריקני והארופאי של המושג.  סוציאליסטים<br> אינם ימין אלטרנטיבי.  פרוגרסיביים אינם ימין אלטרנטיבי.  ליבראליים אינם<br> ימין אלטרנטיבי.  קומוניסטים, מרקסיסטים, מרקסיאנים, מרקסיסטים תרבותיים,<br> ונאו-שמרנים אינם ימין אלטרנטיבי.</br></br></br></br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 2.<br> הימין<br> האלטרניבי מהווה אלטרנטיבה לתנועה השמרנית המיינסטרימית שבארה”ב, שלהלכה<br> מתומצתת בעשרת עקרונות השמרנות של ראסל קירק, אך למעשה סטתה עם הזמן לכיוון<br> הפרוגרסיביזם.  הוא גם מהווה אלטרנטיבה<br> לליברטריאניזם.</br></br></br></br></br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 3.<br> הימין<br> האלטרנטיבי אינו גישה הגנתית בעלמא, אלא הוא דוחה על הסף את הרעיון של<br> תבוסה אצילה ועקרונית.  אדרבא, מדובר בפילוסופיה התקפית במלוא המובן,<br> הדוגלת במחשבה קדימה.  הימין האלטרנטיבי מאמין בנצחון<br> באמצעות התמדה, תוך מיזוג דעים עם המדע, המציאות, המסורת התרבותית, ולקחי<br> ההסטוריה.</br></br></br></br></br></br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 4.<br> הימין<br> האלטרנטיבי מאמין כי התרבות המערבית היא הישג פסגה לאנושות, ותומך איפא<br> בשלושת יסודותיה: הנצרות, הלאומים האירופאיים, והמורשת היוונית-רומאית.</br></br></br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 5.<br> הימין<br> האלטרנטיבי הוא לאומני באופן פומבי ומוצהר.  הוא תומך בכל סוגי הלאומנות<br> וכן בזכותם של כל עם ועם להתקיים באשר הוא באופן אחיד ובלתי מחולל מפלישה<br> והגירה של זרים.</br></br></br></br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 6.<br> הימין האלטרנטיבי הוא אנטי-גלובליזציה.  הוא מתנגד לכל קבוצה הפועלת למען אידאלים ומטרות גלובליסטיים.</br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 7.<br> הימין<br> האלטרנטיבי הוא אנטי-שוויונות. הוא דוחה על הסף את רעיון השוויונות מאותה<br> סיבה שהוא כופר באמונה בחדי קרן ושדונים, והיא שהשוויון הבין-אנושי לא היה<br> ולא נברא מעולם בשום צורה ואופן, לא מדעית,<br> לא חוקית, לא גשמית, לא שכלית, לא מינית, ולא רוחנית.</br></br></br></br></br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 8.<br> הימין<br> האלטרנטיבי הוא סיאנטודי.  הוא מניח לעת עתה את נכונותן של מסקנות השוטף<br> של השיטה המדעית (סיאנטודיה), תוך הבנה כי א) מסקנות אלו עשויים להשתנות<br> בעתיד, ב) תופעת המדעיזם חשוף לשחיתות, וכי<br> ג) מה שנקרא הקונצנזוס המדעי כביכול, מבוסס לא על סיאנטודיה, אלא על<br> דמוקרטיה, ולפיכך היא לא מדעית הלכה למעשה.</br></br></br></br></br></br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 9.<br> הימין האלטרנטיבי מאמין כי זהות &gt; תרבות &gt; פוליטיקה.</br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 10.<br> הימין<br> האלטרנטיבי מתנגד לכל שלטון ומשלה של קבוצה אתנית כלשהי בידי קבוצה אחרת,<br> במיוחד בתוך ארצות המולדת של העמים הנשלטים.  הימין האלטרנטיבי מתנגד לכך<br> שקבוצה אתנית זרה בארץ תתפוס עמדה של השפעה<br> יתרה בחברה הילידית באמצעות נפוטיזם, שבטיות, או כל אמצעי אחר.</br></br></br></br></br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 11.<br> הימין האלטרנטיבי מבין כי גיוון (תרבותי) + קרבה (פיזית) = מלחמה.</br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 12.<br> לימין האלטרנטיבי לא אכפת מה אתם חושבים עליו.</br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 13.<br> הימין<br> האלטרנטיבי דוחה את הסחר החופשי הבינלאומי ואת התנועה החופשית של בני אדם<br> הנצרכת לשם הסחר החופשי.  היתרונות של הסחר החופשי הלאומי אינן ראיה<br> ליתרונות הסחר החופשי הבינלאומי.</br></br></br></br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 14.<br> הימין האלטרנטיבי מאמין כי יש להבטיח את קיומו של הגזע הלבן ולקיים עתיד לילדים לבנים.</br></div><div class=\"MsoNormal\" style=\"direction: ltr; unicode-bidi: embed;\"> 15.<br> הימין<br> האלטרנטיבי אינו מאמין בעליונות הכללית של גזע, עם, אומה, או תת-גזע<br> כלשהו.  לכל גזע, עם, אומה, ותת-גזע אנושי נקודות חוזקה וחולשה משלו, ולו<br> הזכות הריבונית לשכון לבטח בקרב תרבותו הילידית,<br> אותה הוא מכיר ומבכר.</br></br></br></br></br></div><p>16.<br> הימין<br> האלטרנטיבי הוא פילוסופיה שמוקירה שלום בין עמי העולם השונים, והוא מתנגד<br> למלחמות שמטרתן להשליט את הערכים של עם אחד על עם אחר, וכמוהן נסיונות לאבד<br> עמים מסוימים באמצעות מלחמה, השמדת עם,<br> הגירה, או התבוללות גנטית.</br></br></br></br></br></p></div>",
  "content_text": "1.\nהימין האלטרנטיבי הוא ימני במובן האמריקני והארופאי של המושג.  סוציאליסטים\nאינם ימין אלטרנטיבי.  פרוגרסיביים אינם ימין אלטרנטיבי.  ליבראליים אינם\nימין אלטרנטיבי.  קומוניסטים, מרקסיסטים, מרקסיאנים, מרקסיסטים תרבותיים,\nונאו-שמרנים אינם ימין אלטרנטיבי.\n2.\nהימין\nהאלטרניבי מהווה אלטרנטיבה לתנועה השמרנית המיינסטרימית שבארה”ב, שלהלכה\nמתומצתת בעשרת עקרונות השמרנות של ראסל קירק, אך למעשה סטתה עם הזמן לכיוון\nהפרוגרסיביזם.  הוא גם מהווה אלטרנטיבה\nלליברטריאניזם.\n3.\nהימין\nהאלטרנטיבי אינו גישה הגנתית בעלמא, אלא הוא דוחה על הסף את הרעיון של\nתבוסה אצילה ועקרונית.  אדרבא, מדובר בפילוסופיה התקפית במלוא המובן,\nהדוגלת במחשבה קדימה.  הימין האלטרנטיבי מאמין בנצחון\nבאמצעות התמדה, תוך מיזוג דעים עם המדע, המציאות, המסורת התרבותית, ולקחי\nההסטוריה.\n4.\nהימין\nהאלטרנטיבי מאמין כי התרבות המערבית היא הישג פסגה לאנושות, ותומך איפא\nבשלושת יסודותיה: הנצרות, הלאומים האירופאיים, והמורשת היוונית-רומאית.\n5.\nהימין\nהאלטרנטיבי הוא לאומני באופן פומבי ומוצהר.  הוא תומך בכל סוגי הלאומנות\nוכן בזכותם של כל עם ועם להתקיים באשר הוא באופן אחיד ובלתי מחולל מפלישה\nוהגירה של זרים.\n6.\nהימין האלטרנטיבי הוא אנטי-גלובליזציה.  הוא מתנגד לכל קבוצה הפועלת למען אידאלים ומטרות גלובליסטיים.\n7.\nהימין\nהאלטרנטיבי הוא אנטי-שוויונות. הוא דוחה על הסף את רעיון השוויונות מאותה\nסיבה שהוא כופר באמונה בחדי קרן ושדונים, והיא שהשוויון הבין-אנושי לא היה\nולא נברא מעולם בשום צורה ואופן, לא מדעית,\nלא חוקית, לא גשמית, לא שכלית, לא מינית, ולא רוחנית.\n8.\nהימין\nהאלטרנטיבי הוא סיאנטודי.  הוא מניח לעת עתה את נכונותן של מסקנות השוטף\nשל השיטה המדעית (סיאנטודיה), תוך הבנה כי א) מסקנות אלו עשויים להשתנות\nבעתיד, ב) תופעת המדעיזם חשוף לשחיתות, וכי\nג) מה שנקרא הקונצנזוס המדעי כביכול, מבוסס לא על סיאנטודיה, אלא על\nדמוקרטיה, ולפיכך היא לא מדעית הלכה למעשה.\n9.\nהימין האלטרנטיבי מאמין כי זהות > תרבות > פוליטיקה.\n10.\nהימין\nהאלטרנטיבי מתנגד לכל שלטון ומשלה של קבוצה אתנית כלשהי בידי קבוצה אחרת,\nבמיוחד בתוך ארצות המולדת של העמים הנשלטים.  הימין האלטרנטיבי מתנגד לכך\nשקבוצה אתנית זרה בארץ תתפוס עמדה של השפעה\nיתרה בחברה הילידית באמצעות נפוטיזם, שבטיות, או כל אמצעי אחר.\n11.\nהימין האלטרנטיבי מבין כי גיוון (תרבותי) + קרבה (פיזית) = מלחמה.\n12.\nלימין האלטרנטיבי לא אכפת מה אתם חושבים עליו.\n13.\nהימין\nהאלטרנטיבי דוחה את הסחר החופשי הבינלאומי ואת התנועה החופשית של בני אדם\nהנצרכת לשם הסחר החופשי.  היתרונות של הסחר החופשי הלאומי אינן ראיה\nליתרונות הסחר החופשי הבינלאומי.\n14.\nהימין האלטרנטיבי מאמין כי יש להבטיח את קיומו של הגזע הלבן ולקיים עתיד לילדים לבנים.\n15.\nהימין\nהאלטרנטיבי אינו מאמין בעליונות הכללית של גזע, עם, אומה, או תת-גזע\nכלשהו.  לכל גזע, עם, אומה, ותת-גזע אנושי נקודות חוזקה וחולשה משלו, ולו\nהזכות הריבונית לשכון לבטח בקרב תרבותו הילידית,\nאותה הוא מכיר ומבכר.\n16.\nהימין\nהאלטרנטיבי הוא פילוסופיה שמוקירה שלום בין עמי העולם השונים, והוא מתנגד\nלמלחמות שמטרתן להשליט את הערכים של עם אחד על עם אחר, וכמוהן נסיונות לאבד\nעמים מסוימים באמצעות מלחמה, השמדת עם,\nהגירה, או התבוללות גנטית.",
  "tags": [
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-17T17:17:00+00:00"
}