{
  "url": "https://voxday.net/2016/11/19/co-je-alt-pravica/",
  "scraped_at": "2025-12-18T02:05:59.473384",
  "title": "Čo je Alt Pravica?",
  "date_display": "November 19, 2016",
  "date_iso": "2016-11-19T21:51:00+00:00",
  "date_from_url": "2016-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> <b style='font-family: \"Times New Roman\", serif; font-size: 13pt;'>V záujme<br> vypracovania základov Alt Pravicovej filozofie, na ktorej môžu<br> stavať aj ostatní.</br></br></b></div><p></p><ol><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica je politickou pravicou v americkom ako aj v európskom<br> zmysle slova. Socialisti nie sú Alt Pravica, Pokrokoví<br> (Progresívci)<br> nie<br> sú Alt Pravica, Liberáli nie sú Alt Pravica. Komunisti, Marxisti,<br> Kultúrni Marxisti a neokonzervatívci nie sú Alt Pravica.</br></br></br></br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica je alternatívou k tradičnému pravicovému hnutiu v<br> Spojených Štátoch, ktoré je definované <a href=\"http://www.kirkcenter.org/index.php/detail/ten-conservative-principles/\">10<br> konzervatívnymi princípami</br></a><br> Russela Kirka, ktoré v skutočnosti zdegenerovalo smerom k<br> progresivizmu. Je tiež<br> alternatívou k libertarianizmu.</br></br></br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica<br> nie je obranným postojom a odmieta koncepciu vznešenej a<br> principiálnej porážky. Je to do budúcnosti hľadiaca filozofia<br> útoku v každom zmysle tohto slova. Alt<br> Pravica<br> verí vo<br> víťazstvo cestou vytrvalosti<br> a harmónie<br> s vedou, realitou, kultúrnou tradíciou a historickou skúsenosťou.</br></br></br></br></br></br></br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica<br> verí, že západná<br> civilizácia je vrcholom ľudského úsilia a podporuje tri<br> základné piliere: kresťanstvo, európske národy a gréko-románske<br> dedičstvo.</br></br></br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica<br> otvorene deklaruje svoju národnú orientáciu. Podporutje všetky<br> národy a ich právo na existenciu, homogénnu a neriedenú<br> cudzineckou inváziou a prisťahovalectvom.</br></br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica<br> je antiglobalistická. Je v opozícíi proti skupinám, ktoré<br> pracujú v záujme globalistických ideálov a cieľov.</br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica je proti rovnostárstvu. Odmieta myšlienku rovnostárstva z<br> rovnakých dôvodov ako odmieta jednorožcov a škriatkov. Ľudské<br> rovnostárstvo neexistuje v žiadnej pozorovateľnej vedeckej,<br> právnej, materiálnej, intelektuálnej, sexuálnej a duchovnej<br> forme.</br></br></br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica je vedecká a a priori akceptuje súčasné závery vedeckej<br> metódy, avšak je si zároveň vedomá, že a) tieto závery<br> podliehajú potenciálnemu budúcemu prehodnoteniu b) veda podlieha<br> korupcii a c) takzvaný vedecký konsenzus nie je založený na<br> vede, ale na demokracii a je tým pádom nevedecký</br></br></br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica verí, že identita ­­&gt; kultúra &gt; politika</br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica je proti podradenosti ktorejkoľvek pôvodnej etnickej<br> skupiny inej skupine, najmä v suverénnej krajine dominovaného<br> ľudu. Alt Pravica je proti získavaniu nadmerného vplyvu<br> nepôvodnej populácie v ktorejkoľvek spoločnosti cestou známostí,<br> kmeňových vzťahov alebo akýmkoľvek iným spôsobom.</br></br></br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica si je vedomá, že diverzita + blízkosť = vojna</br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravici je jedno, čo si o nej myslíte.</br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica odmieta medzinárodný obchod a voľný pohyb pracovníkov s<br> ním súvisiaci. Výhody obchodu v rámci národa nie sú potvrdením<br> výhod medzinárodného obchodu.</br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica verí, že je nevyhnutné zabezpečiť existenciu bielych<br> ľudí a budúcnosť bielych detí.</br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica neverí vo všeobecnú nadradenosť žiadnej rasy, národa,<br> ľudu alebo ľudského poddruhu. Každá rasa, národ, ľud alebo<br> ľudský poddruh má svoje vlastné silné a slabé stránky a má<br> suverénne právo nažívať bez cudzích vplyvov a uchovávať<br> vlastnú kultúru, ktorú uprednostňuje.</br></br></br></br></br></div></li><li><div style=\"line-height: 100%; margin-bottom: 0.19in; margin-top: 0.19in;\"> Alt<br> Pravica je filozofia, ktorá si cení mier medzi národmi sveta a<br> odmieta násliné šírenie hodnôt jedného národa na druhý<br/> národ, ako aj úsilie o extermináciu individuálnych národov<br/> cestou vojny, genocídy, prisťahovalectva alebo genetickej<br/> asimilácie. </br></br></div></li></ol></div>",
  "content_text": "V záujme\nvypracovania základov Alt Pravicovej filozofie, na ktorej môžu\nstavať aj ostatní.\nAlt\nPravica je politickou pravicou v americkom ako aj v európskom\nzmysle slova. Socialisti nie sú Alt Pravica, Pokrokoví\n(Progresívci)\nnie\nsú Alt Pravica, Liberáli nie sú Alt Pravica. Komunisti, Marxisti,\nKultúrni Marxisti a neokonzervatívci nie sú Alt Pravica.\nAlt\nPravica je alternatívou k tradičnému pravicovému hnutiu v\nSpojených Štátoch, ktoré je definované\n10\nkonzervatívnymi princípami\nRussela Kirka, ktoré v skutočnosti zdegenerovalo smerom k\nprogresivizmu. Je tiež\nalternatívou k libertarianizmu.\nAlt\nPravica\nnie je obranným postojom a odmieta koncepciu vznešenej a\nprincipiálnej porážky. Je to do budúcnosti hľadiaca filozofia\nútoku v každom zmysle tohto slova. Alt\nPravica\nverí vo\nvíťazstvo cestou vytrvalosti\na harmónie\ns vedou, realitou, kultúrnou tradíciou a historickou skúsenosťou.\nAlt\nPravica\nverí, že západná\ncivilizácia je vrcholom ľudského úsilia a podporuje tri\nzákladné piliere: kresťanstvo, európske národy a gréko-románske\ndedičstvo.\nAlt\nPravica\notvorene deklaruje svoju národnú orientáciu. Podporutje všetky\nnárody a ich právo na existenciu, homogénnu a neriedenú\ncudzineckou inváziou a prisťahovalectvom.\nAlt\nPravica\nje antiglobalistická. Je v opozícíi proti skupinám, ktoré\npracujú v záujme globalistických ideálov a cieľov.\nAlt\nPravica je proti rovnostárstvu. Odmieta myšlienku rovnostárstva z\nrovnakých dôvodov ako odmieta jednorožcov a škriatkov. Ľudské\nrovnostárstvo neexistuje v žiadnej pozorovateľnej vedeckej,\nprávnej, materiálnej, intelektuálnej, sexuálnej a duchovnej\nforme.\nAlt\nPravica je vedecká a a priori akceptuje súčasné závery vedeckej\nmetódy, avšak je si zároveň vedomá, že a) tieto závery\npodliehajú potenciálnemu budúcemu prehodnoteniu b) veda podlieha\nkorupcii a c) takzvaný vedecký konsenzus nie je založený na\nvede, ale na demokracii a je tým pádom nevedecký\nAlt\nPravica verí, že identita ­­> kultúra > politika\nAlt\nPravica je proti podradenosti ktorejkoľvek pôvodnej etnickej\nskupiny inej skupine, najmä v suverénnej krajine dominovaného\nľudu. Alt Pravica je proti získavaniu nadmerného vplyvu\nnepôvodnej populácie v ktorejkoľvek spoločnosti cestou známostí,\nkmeňových vzťahov alebo akýmkoľvek iným spôsobom.\nAlt\nPravica si je vedomá, že diverzita + blízkosť = vojna\nAlt\nPravici je jedno, čo si o nej myslíte.\nAlt\nPravica odmieta medzinárodný obchod a voľný pohyb pracovníkov s\nním súvisiaci. Výhody obchodu v rámci národa nie sú potvrdením\nvýhod medzinárodného obchodu.\nAlt\nPravica verí, že je nevyhnutné zabezpečiť existenciu bielych\nľudí a budúcnosť bielych detí.\nAlt\nPravica neverí vo všeobecnú nadradenosť žiadnej rasy, národa,\nľudu alebo ľudského poddruhu. Každá rasa, národ, ľud alebo\nľudský poddruh má svoje vlastné silné a slabé stránky a má\nsuverénne právo nažívať bez cudzích vplyvov a uchovávať\nvlastnú kultúru, ktorú uprednostňuje.\nAlt\nPravica je filozofia, ktorá si cení mier medzi národmi sveta a\nodmieta násliné šírenie hodnôt jedného národa na druhý\nnárod, ako aj úsilie o extermináciu individuálnych národov\ncestou vojny, genocídy, prisťahovalectva alebo genetickej\nasimilácie.",
  "tags": [
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-19T21:51:00+00:00"
}