{
  "url": "https://voxday.net/2016/11/22/controlled-opposition-or-media/",
  "scraped_at": "2025-12-18T02:06:22.204086",
  "title": "Controlled opposition or media indiscipline?",
  "date_display": "November 22, 2016",
  "date_iso": "2016-11-22T08:58:00+00:00",
  "date_from_url": "2016-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like others in and around the Alt-Right, I’ve been approached by numerous media organizations since the election. I was also invited to speak at the recent NPI conference. I declined the opportunity, not because I have any problem with Richard Spencer or anything the Alt-White is pursuing, but because going to conferences and talking to lots of people is really not my thing. I don’t even go to three-quarters of the professional conferences that I really should attend, and I’ve been speaking at game industry conferences since 1995.</p><p>But I have to admit, it was somewhat fortuitous that I didn’t go given the manufactured media coverage of a minor incident towards the end, when apparently some idiots in the crowd began throwing Roman salutes on camera, and Richard decided it would be a great idea to throw the media some red meat by shouting “Hail Victory and Hail Trump.” Mike Cernovich put out a widely watched Periscope calling this “utter stupidity” and <a href=\"http://www.dangerandplay.com/2016/11/21/this-is-what-controlled-opposition-looks-like/\">“controlled opposition”</a>, and thereby sparked a bit of outrage among Richard’s fans.</p><p>As a number of people have asked my opinion of this, here it is:</p><ul><li>No, I don’t think Richard is a federal agent or an actual controlled opposition figure. I think Mike would have been more accurate to say “controllable opposition” or “dancing monkey”. But Mike made it very clear exactly what he meant in his Periscope. Don’t get pedantically hung up on a term. If nothing else, Richard’s hair is too fabulous for him to be a federal agent.</li><li>There was nothing actually wrong with what Richard said. But we’re dealing with rhetoric here, not dialectic.</li><li>It wasn’t a big deal. But it was a foolish thing to do. The media is absolutely slavering to be able to have REAL PROOF that the Alt-Right are no-good, very-evil Nazis so that they can use it as a weapon against President-elect Trump, giving them ANYTHING is tactically retarded.</li><li>It’s not about Richard. It’s about Donald Trump. If Richard is genuinely supportive of Trump, then pulling that sort of stunt was the very last thing he should have done. Making yourself the news story at the expense of the individual you are supposedly supporting and celebrating smacks of being self-serving. As Mike said, dress up like a Nazi, speak bad German and wear a swastika armband if you want, just leave Trump out of it.</li><li>Richard has failed to learn the lesson of #GamerGate and the principles of 4GW. He wants to be the media-anointed leader of the Alt-Right because he believes, wrongly, that this will help him achieve his objectives. It won’t. As Mike and I have both noted, the media elevates fringe figures to “leadership” specifically in order to attack the movement through them. That’s why they keep trying to call Milo, and Mike, and even occasionally me “an Alt-Right leader” even though we all specifically deny it. Milo and Mike have always denied being Alt-Right, and yet the media keeps trying to claim they are its leaders. Ask yourself, “why is the media doing that when they know it isn’t true?”</li><li>You don’t play the media, the media plays you. Yes, Trump can play them. Yes, Milo can play them. But I’m not either of those unique talents and neither are you. I learned my lesson the hard way, when a woman from Wired read SJWAL and spent three hours talking about #GamerGate with me just in order to get what she thought was a single kill-quote into her article that was nominally about the Hugo Awards. She was wrong, because she was an American who didn’t realize I was referring to a very real problem that is covered only in the European press, but I learned that they will go very far out of their way in order to get that single soundbite, that single optic, that they can then use as a caricature of you for the next decade in order to discredit and disqualify you. That is why I don’t do TV, I don’t go on radio shows or podcasts that are oppositional, and I require that all interviews with me are written.</li><li>The media is not the way to “get out your message”. That’s the bait they’ve used to lure in every sucker for 50 years. I can’t count the number of times a reporter has said he “just wants to give me the opportunity to tell my side of the story”. It’s a trap. The way to get out your message is to patiently build your own platform, because he whom the media builds up is he whom the media can take down at will.</li><li>I am not opposed to Richard or jealous of Richard, nor do I want the attention he is receiving. I rather like him, I simply don’t think he understands that the media intends for him to become a David Duke figure, a weapon available for deployment against any politician or program that he nominally supports.</li><li>The media always has a narrative it is attempting to sell. Don’t help them sell it!</li></ul><div> If the Alt-Right is going to continue to be successful, those to whom the media pays attention are going to have to develop the same media discipline that #GamerGate and the Trump inner circle have exhibited. Don’t take the bait.</div></div>",
  "content_text": "Like others in and around the Alt-Right, I’ve been approached by numerous media organizations since the election. I was also invited to speak at the recent NPI conference. I declined the opportunity, not because I have any problem with Richard Spencer or anything the Alt-White is pursuing, but because going to conferences and talking to lots of people is really not my thing. I don’t even go to three-quarters of the professional conferences that I really should attend, and I’ve been speaking at game industry conferences since 1995.\nBut I have to admit, it was somewhat fortuitous that I didn’t go given the manufactured media coverage of a minor incident towards the end, when apparently some idiots in the crowd began throwing Roman salutes on camera, and Richard decided it would be a great idea to throw the media some red meat by shouting “Hail Victory and Hail Trump.” Mike Cernovich put out a widely watched Periscope calling this “utter stupidity” and\n“controlled opposition”\n, and thereby sparked a bit of outrage among Richard’s fans.\nAs a number of people have asked my opinion of this, here it is:\nNo, I don’t think Richard is a federal agent or an actual controlled opposition figure. I think Mike would have been more accurate to say “controllable opposition” or “dancing monkey”. But Mike made it very clear exactly what he meant in his Periscope. Don’t get pedantically hung up on a term. If nothing else, Richard’s hair is too fabulous for him to be a federal agent.\nThere was nothing actually wrong with what Richard said. But we’re dealing with rhetoric here, not dialectic.\nIt wasn’t a big deal. But it was a foolish thing to do. The media is absolutely slavering to be able to have REAL PROOF that the Alt-Right are no-good, very-evil Nazis so that they can use it as a weapon against President-elect Trump, giving them ANYTHING is tactically retarded.\nIt’s not about Richard. It’s about Donald Trump. If Richard is genuinely supportive of Trump, then pulling that sort of stunt was the very last thing he should have done. Making yourself the news story at the expense of the individual you are supposedly supporting and celebrating smacks of being self-serving. As Mike said, dress up like a Nazi, speak bad German and wear a swastika armband if you want, just leave Trump out of it.\nRichard has failed to learn the lesson of #GamerGate and the principles of 4GW. He wants to be the media-anointed leader of the Alt-Right because he believes, wrongly, that this will help him achieve his objectives. It won’t. As Mike and I have both noted, the media elevates fringe figures to “leadership” specifically in order to attack the movement through them. That’s why they keep trying to call Milo, and Mike, and even occasionally me “an Alt-Right leader” even though we all specifically deny it. Milo and Mike have always denied being Alt-Right, and yet the media keeps trying to claim they are its leaders. Ask yourself, “why is the media doing that when they know it isn’t true?”\nYou don’t play the media, the media plays you. Yes, Trump can play them. Yes, Milo can play them. But I’m not either of those unique talents and neither are you. I learned my lesson the hard way, when a woman from Wired read SJWAL and spent three hours talking about #GamerGate with me just in order to get what she thought was a single kill-quote into her article that was nominally about the Hugo Awards. She was wrong, because she was an American who didn’t realize I was referring to a very real problem that is covered only in the European press, but I learned that they will go very far out of their way in order to get that single soundbite, that single optic, that they can then use as a caricature of you for the next decade in order to discredit and disqualify you. That is why I don’t do TV, I don’t go on radio shows or podcasts that are oppositional, and I require that all interviews with me are written.\nThe media is not the way to “get out your message”. That’s the bait they’ve used to lure in every sucker for 50 years. I can’t count the number of times a reporter has said he “just wants to give me the opportunity to tell my side of the story”. It’s a trap. The way to get out your message is to patiently build your own platform, because he whom the media builds up is he whom the media can take down at will.\nI am not opposed to Richard or jealous of Richard, nor do I want the attention he is receiving. I rather like him, I simply don’t think he understands that the media intends for him to become a David Duke figure, a weapon available for deployment against any politician or program that he nominally supports.\nThe media always has a narrative it is attempting to sell. Don’t help them sell it!\nIf the Alt-Right is going to continue to be successful, those to whom the media pays attention are going to have to develop the same media discipline that #GamerGate and the Trump inner circle have exhibited. Don’t take the bait.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-22T08:58:00+00:00"
}