{
  "url": "https://voxday.net/2016/11/13/even-his-hindsight-isnt-2020/",
  "scraped_at": "2025-12-18T02:04:47.916446",
  "title": "Even his hindsight isn’t 20/20",
  "date_display": "November 13, 2016",
  "date_iso": "2016-11-13T08:00:00+00:00",
  "date_from_url": "2016-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nate Silver takes great pride <a href=\"https://fivethirtyeight.com/features/why-fivethirtyeight-gave-trump-a-better-chance-than-almost-anyone-else/\">in being less completely wrong than some of the other pollsters</a>, in an article entitled “Why FiveThirtyEight Gave Trump A Better Chance Than Almost Anyone Else (Except the LA TIMES/USC and IBD/TIPP Tracking, Who, Unlike Us, Actually Got It Right). NB: I added the bit in parentheses. At no point does Silver mention any polling organization, or individual, who did correctly predict the election results.</p><blockquote><p> Based on what most of us would have thought possible a year or two ago, the election of Donald Trump was one of the most shocking events in American political history. But it shouldn’t have been that much of a surprise based on the polls — at least if you were reading FiveThirtyEight. Given the historical accuracy of polling and where each candidate’s support was distributed, the polls showed a race that was both fairly close and highly uncertain.</p><p>This isn’t just a case of hindsight bias. It’s tricky to decide what tone to take in an article like this one — after all, we had Hillary Clinton favored. But one of the reasons to build a model — perhaps the most important reason — is to measure uncertainty and to account for risk. If polling were perfect, you wouldn’t need to do this. And we took weeks of abuse from people who thought we overrated Trump’s chances. For most of the presidential campaign, FiveThirtyEight’s forecast gave Trump much better odds than other polling-based models. Our final forecast, issued early Tuesday evening, had Trump with a 29 percent chance of winning the Electoral College.1 By comparison, other models tracked by The New York Times put Trump’s odds at: 15 percent, 8 percent, 2 percent and less than 1 percent. And betting markets put Trump’s chances at just 18 percent at midnight on Tuesday, when Dixville Notch, New Hampshire, cast its votes.</p><p>So why did our model — using basically the same data as everyone else — show such a different result? We’ve covered this question before, but it’s interesting to do so in light of the actual election results. We think the outcome — and particularly the fact that Trump won the Electoral College while losing the popular vote — validates important features of our approach.</p></blockquote><p>Translation:</p><ol><li>I’m a Gamma and I can’t admit that I’m wrong without explaining how being wrong only proves that I was right to do what I did. </li><li>Almost anyone else means anyone not KellyAnne Conway, Scott Adams, Nassim Taleb, Mike Cernovich, Vox Day, LA Times, IBD, or TPP Tracking.</li><li>A 29 percent chance of winning is practically a near certainty. I mean, sure, <i>you </i>might have <i>interpreted </i>that to mean that Hillary was probably going to win, but that just shows how you don’t understand polling as well as I do. The fact of the matter is that we were closer to getting it right than everyone else who didn’t get it right.</li><li>And by “29 percent”, I of course mean 28.6 percent.</li><li>And by “such a different result” what I mean is “exactly the same result as everyone else, except those other guys who actually got it right and whom I will carefully refrain from mentioning.”</li></ol><blockquote class=\"tr_bq\"><p> We strongly disagree with the idea that there was a massive polling error. Instead, there was a modest polling error, well in line with historical polling errors, but even a modest error was enough to provide for plenty of paths to victory for Trump. We think people should have been better prepared for it. There was widespread complacency about Clinton’s chances in a way that wasn’t justified by a careful analysis of the data and the uncertainties surrounding it.</p></blockquote><p>Translation:</p><ol><li>We strongly disagree with the idea that I could have been wrong. The Secret King is never wrong, by definition! You just don’t understand how the <i>appearance </i>of being wrong only shows that I was mostly right, and that just goes to show how much smarter I am than you. Still undefeated!</li><li>Next time, don’t pay any attention to what I say before the election. Just wait until it is over, and then I’ll explain what I meant and how that proves I am right. Always.</li></ol><p>Remember, at one point, Nate Silver and 538 gave Hillary Clinton an 87.3 percent chance of victory as recently as October 19. The good news for Trump, the Alt-Right, and even the Republicans is that these hapless morons are too proud to admit or learn from their mistakes, which means they are going to screw up just as badly, or perhaps even worse, in future elections.</p></div>",
  "content_text": "Nate Silver takes great pride\nin being less completely wrong than some of the other pollsters\n, in an article entitled “Why FiveThirtyEight Gave Trump A Better Chance Than Almost Anyone Else (Except the LA TIMES/USC and IBD/TIPP Tracking, Who, Unlike Us, Actually Got It Right). NB: I added the bit in parentheses. At no point does Silver mention any polling organization, or individual, who did correctly predict the election results.\nBased on what most of us would have thought possible a year or two ago, the election of Donald Trump was one of the most shocking events in American political history. But it shouldn’t have been that much of a surprise based on the polls — at least if you were reading FiveThirtyEight. Given the historical accuracy of polling and where each candidate’s support was distributed, the polls showed a race that was both fairly close and highly uncertain.\nThis isn’t just a case of hindsight bias. It’s tricky to decide what tone to take in an article like this one — after all, we had Hillary Clinton favored. But one of the reasons to build a model — perhaps the most important reason — is to measure uncertainty and to account for risk. If polling were perfect, you wouldn’t need to do this. And we took weeks of abuse from people who thought we overrated Trump’s chances. For most of the presidential campaign, FiveThirtyEight’s forecast gave Trump much better odds than other polling-based models. Our final forecast, issued early Tuesday evening, had Trump with a 29 percent chance of winning the Electoral College.1 By comparison, other models tracked by The New York Times put Trump’s odds at: 15 percent, 8 percent, 2 percent and less than 1 percent. And betting markets put Trump’s chances at just 18 percent at midnight on Tuesday, when Dixville Notch, New Hampshire, cast its votes.\nSo why did our model — using basically the same data as everyone else — show such a different result? We’ve covered this question before, but it’s interesting to do so in light of the actual election results. We think the outcome — and particularly the fact that Trump won the Electoral College while losing the popular vote — validates important features of our approach.\nTranslation:\nI’m a Gamma and I can’t admit that I’m wrong without explaining how being wrong only proves that I was right to do what I did.\nAlmost anyone else means anyone not KellyAnne Conway, Scott Adams, Nassim Taleb, Mike Cernovich, Vox Day, LA Times, IBD, or TPP Tracking.\nA 29 percent chance of winning is practically a near certainty. I mean, sure,\nyou\nmight have\ninterpreted\nthat to mean that Hillary was probably going to win, but that just shows how you don’t understand polling as well as I do. The fact of the matter is that we were closer to getting it right than everyone else who didn’t get it right.\nAnd by “29 percent”, I of course mean 28.6 percent.\nAnd by “such a different result” what I mean is “exactly the same result as everyone else, except those other guys who actually got it right and whom I will carefully refrain from mentioning.”\nWe strongly disagree with the idea that there was a massive polling error. Instead, there was a modest polling error, well in line with historical polling errors, but even a modest error was enough to provide for plenty of paths to victory for Trump. We think people should have been better prepared for it. There was widespread complacency about Clinton’s chances in a way that wasn’t justified by a careful analysis of the data and the uncertainties surrounding it.\nTranslation:\nWe strongly disagree with the idea that I could have been wrong. The Secret King is never wrong, by definition! You just don’t understand how the\nappearance\nof being wrong only shows that I was mostly right, and that just goes to show how much smarter I am than you. Still undefeated!\nNext time, don’t pay any attention to what I say before the election. Just wait until it is over, and then I’ll explain what I meant and how that proves I am right. Always.\nRemember, at one point, Nate Silver and 538 gave Hillary Clinton an 87.3 percent chance of victory as recently as October 19. The good news for Trump, the Alt-Right, and even the Republicans is that these hapless morons are too proud to admit or learn from their mistakes, which means they are going to screw up just as badly, or perhaps even worse, in future elections.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-13T08:00:00+00:00"
}