{
  "url": "https://voxday.net/2016/11/03/evidence-to-put-hillary-away-for-life/",
  "scraped_at": "2025-12-18T02:02:44.225945",
  "title": "Evidence to put Hillary away for life?",
  "date_display": "November 3, 2016",
  "date_iso": "2016-11-03T00:48:00+00:00",
  "date_from_url": "2016-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/WLAe3UeddUI\" width=\"512\"></iframe></div><p> Two key quotes:</p><ul><li><i>“The FBI has evidence to put Hillary Clinton and her crew away for life.”</i></li><li><i>“What’s in the emails is staggering, and as a father it turned my stomach. There is not going to be any Houdini-like escape from what we found. We have copies of everything. We will ship them to WikiLeaks or I will personally hold my own press conference if it comes to that.”</i></li></ul><p>Again, I have no direct information for which I can vouch. However, the rumors continue to be consistent and in line with the Redemption theory I put forth concerning Comey’s decision to reopen the investigation. I simply can’t see things being this heated between the NYPD, the FBI, and the Justice Department if it concerns nothing more than proof that Hillary deleted classified files.</p><p>Notice that it is now being reported that other elected officials are implicated as well, which may explain why this is all being handled like a live hand grenade by everyone from President Obama to the NYPD. One has to assume the Clinton machine is aggressively calling in every favor it has and then some, given the potential stakes involved.</p><p>UPDATE: <a href=\"http://truepundit.com/breaking-bombshell-nypd-blows-whistle-on-new-hillary-emails-money-laundering-sex-crimes-with-children-child-exploitation-pay-to-play-perjury/\">The Truepundit post</a> mentioned in the video.</p><p>Notice that the following sentence is consistent with the <i>Wall Street Journal</i> report about Comey having been informed about the new emails several weeks before, but not doing anything until he actually saw what was in them.</p><p><i>The NYPD Chief said once Comey saw the alarming contents of the emails he was forced to reopen a criminal probe against Clinton.</i><br> <i><br/></i><br> Just thinking out loud here, but I would expect the NYPD or WikiLeaks to release something by Friday at the latest if the FBI doesn’t do something first. If what is on the emails is as bad as is being bruited about, there is no way anyone can, in good conscience, not let the American people know about it before the election.</br></br></p><p>Remember, if the reports are true, they’re going to have to arrest a number of people all at once, some of whom are going to be desperate. Those sorts of operations take an amount of preparation, and it’s not as if Hillary or Huma can lay low or go anywhere they can’t readily find them. One way we’ll know for certain it is real is if any of the individuals implicated in these crimes start self-euthanizing. At this point, they are probably still hoping that they’re untouchable.</p><p>Even if you are, quite reasonably, dubious about the deviant allegations, there is a lot of investigative activity occurring <a href=\"http://www.realclearpolitics.com/video/2016/11/02/fbi_sources_tell_fox_news_indictment_likely_in_clinton_foundation_case.html\">with regards to the Clinton Foundation</a>, as Fox News has reported that no less than FIVE foreign intelligence services accessed the server and pay-for-play indictments are “likely”. This tends to suggest that Hillary Clinton can be held liable for perjury and obstruction of justice as well.</p><p>Don’t forget that Julian Assange has publicly said that the next round of WikiLeaks emails will see Hillary arrested.</p></div>",
  "content_text": "Two key quotes:\n“The FBI has evidence to put Hillary Clinton and her crew away for life.”\n“What’s in the emails is staggering, and as a father it turned my stomach. There is not going to be any Houdini-like escape from what we found. We have copies of everything. We will ship them to WikiLeaks or I will personally hold my own press conference if it comes to that.”\nAgain, I have no direct information for which I can vouch. However, the rumors continue to be consistent and in line with the Redemption theory I put forth concerning Comey’s decision to reopen the investigation. I simply can’t see things being this heated between the NYPD, the FBI, and the Justice Department if it concerns nothing more than proof that Hillary deleted classified files.\nNotice that it is now being reported that other elected officials are implicated as well, which may explain why this is all being handled like a live hand grenade by everyone from President Obama to the NYPD. One has to assume the Clinton machine is aggressively calling in every favor it has and then some, given the potential stakes involved.\nUPDATE:\nThe Truepundit post\nmentioned in the video.\nNotice that the following sentence is consistent with the\nWall Street Journal\nreport about Comey having been informed about the new emails several weeks before, but not doing anything until he actually saw what was in them.\nThe NYPD Chief said once Comey saw the alarming contents of the emails he was forced to reopen a criminal probe against Clinton.\nJust thinking out loud here, but I would expect the NYPD or WikiLeaks to release something by Friday at the latest if the FBI doesn’t do something first. If what is on the emails is as bad as is being bruited about, there is no way anyone can, in good conscience, not let the American people know about it before the election.\nRemember, if the reports are true, they’re going to have to arrest a number of people all at once, some of whom are going to be desperate. Those sorts of operations take an amount of preparation, and it’s not as if Hillary or Huma can lay low or go anywhere they can’t readily find them. One way we’ll know for certain it is real is if any of the individuals implicated in these crimes start self-euthanizing. At this point, they are probably still hoping that they’re untouchable.\nEven if you are, quite reasonably, dubious about the deviant allegations, there is a lot of investigative activity occurring\nwith regards to the Clinton Foundation\n, as Fox News has reported that no less than FIVE foreign intelligence services accessed the server and pay-for-play indictments are “likely”. This tends to suggest that Hillary Clinton can be held liable for perjury and obstruction of justice as well.\nDon’t forget that Julian Assange has publicly said that the next round of WikiLeaks emails will see Hillary arrested.",
  "tags": [
    "conspiracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-03T00:48:00+00:00"
}