{
  "url": "https://voxday.net/2016/11/21/football-in-america/",
  "scraped_at": "2025-12-18T02:06:14.076620",
  "title": "Football in America",
  "date_display": "November 21, 2016",
  "date_iso": "2016-11-21T12:56:00+00:00",
  "date_from_url": "2016-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peter King promotes an interesting, and unintentionally revealing, SI piece called <a href=\"http://www.si.com/nfl/2016/11/16/football-in-america-roger-goodell-college-football\">“Football in America”</a></p><blockquote><p> SI’s “Football in America” issue is a heck of a read. Writers Greg Bishop and Michael McKnight toured the country throughout October to ask hundreds of Americans—from strippers to Jerry Jones to 10-year-old girl players to gamblers to inner-city coaches to Roger Goodell to tailgating fans—how they feel about the state of football. The finished product, edited by Adam Duerson, was entitled Football in America and is a compelling, comprehensive read. I was taken with how many of the interviewees despised Colin Kaepernick’s protest of the anthem and the American flag, and how that’s not going away. I asked Bishop and McKnight about their takeaways from a month deep-diving into the soul of the game.</p><p><b>McKnight:</b> “What I’ll take with me was the sheer quantity of dichotomy and conflict we found. We experienced it at every turn. From a hard-boiled Let-em-play! advocate taking a reflective moment to acknowledge, Yes, this sport does scramble brains to the mother whose teenage son died after a catastrophic brain and spine injury; she adjusted our interview appointment so she could watch the Raiders game. Americans are uncomfortable about the game and about the self-contradictions it inspires in them. This is all highly unscientific, but to me, the ‘Football is going soft’ crowd seemed much easier to be found in states that were won by the Republican presidential candidate, whereas those concerned about the game’s future (and the futures of those who play it) felt more prevalent in so-called blue areas (cities, non-Southern coasts, etc.). I didn’t expect this to be as stark as it was.”</p><p><b>Bishop:</b> “I’d say that 95 percent of the people that I spoke with were conflicted. And many not in ways that I expected. Like the Kansas offensive lineman I spoke with who made the pragmatic decision to retire from concussions. He loved football so much he cried about the decision he had to make … The majority of people I spoke with were angry and disillusioned and wanted change—but they often wanted change back to the way that football was. I sensed they felt the same way about their lives. It was like they feel like the world we live in has gotten impossibly complicated, and that what they want is a simpler, romanticized, idealized time — a time that may not even be real but that they remember fondly. That came across so much more strongly than I anticipated. And yet, if you’re talking favorite moments, it’s hard to beat the Friday night I spent in Allen, Texas, at the $60-million high school stadium. The pageantry, the skill level, the barbecue, the Balding Eagles booster club, the stadium perch for the boosters. A lot of people would watch that scene and think that it’s everything wrong with football. But it didn’t feel that way when you were there. It felt like all the best of football rolled into one place.”</p></blockquote><p>This is yet another demonstration that the white population of the USA is essentially two different nations. The media, which is populated by the smaller Globalist White population, has virtually no familiarity, or understanding, of the Nationalist White population, as evidenced even by these well-meaning attempts to do so. On what planet is the opinion of strippers and 10-year-old girls playing linebacker even remotely relevant to the NFL?</p><p>Football is merely one of the many friction points now fraying at the fabric of society. It’s been remarkable to see how the Globalist Whites have steadfastly denied what is manifestly obvious to everyone about the declining NFL ratings. It’s not that anyone actually cares what Colin Kaepernick or the players imitating him actually think, it is the symbolic nature of their actions that have infuriated millions of Nationalist Whites as well as more than a few pro-American minorities.</p><p>Despite living in Europe and being a player and coach of the game of football proper, which is to say, <i>calcio</i>, the beautiful game, I still love American football, particularly the chess game that is the NFL variety. But there are certainly times, such as when the idiot refs throw a flag on an irrelevant block-in-the-back penalty that negates a great punt return, or a highly questionable roughing-the-passer penalty on 4th-and-19 that gives a defeated team an undeserved second shot at winning a game it has already lost, that I’m tempted to turn off the TV. And the fact that the NFL is coddling anti-American protesters like Kaepernick only makes it that much more easy to do so.</p><p>And yes, NFL-hating spergs, you can do your tedious thing here, as for once, it is not off-topic. It won’t make any difference to anyone, you understand, but you can tell us all about your opinion that means nothing to any of us if you feel the need to do so.</p></div>",
  "content_text": "Peter King promotes an interesting, and unintentionally revealing, SI piece called\n“Football in America”\nSI’s “Football in America” issue is a heck of a read. Writers Greg Bishop and Michael McKnight toured the country throughout October to ask hundreds of Americans—from strippers to Jerry Jones to 10-year-old girl players to gamblers to inner-city coaches to Roger Goodell to tailgating fans—how they feel about the state of football. The finished product, edited by Adam Duerson, was entitled Football in America and is a compelling, comprehensive read. I was taken with how many of the interviewees despised Colin Kaepernick’s protest of the anthem and the American flag, and how that’s not going away. I asked Bishop and McKnight about their takeaways from a month deep-diving into the soul of the game.\nMcKnight:\n“What I’ll take with me was the sheer quantity of dichotomy and conflict we found. We experienced it at every turn. From a hard-boiled Let-em-play! advocate taking a reflective moment to acknowledge, Yes, this sport does scramble brains to the mother whose teenage son died after a catastrophic brain and spine injury; she adjusted our interview appointment so she could watch the Raiders game. Americans are uncomfortable about the game and about the self-contradictions it inspires in them. This is all highly unscientific, but to me, the ‘Football is going soft’ crowd seemed much easier to be found in states that were won by the Republican presidential candidate, whereas those concerned about the game’s future (and the futures of those who play it) felt more prevalent in so-called blue areas (cities, non-Southern coasts, etc.). I didn’t expect this to be as stark as it was.”\nBishop:\n“I’d say that 95 percent of the people that I spoke with were conflicted. And many not in ways that I expected. Like the Kansas offensive lineman I spoke with who made the pragmatic decision to retire from concussions. He loved football so much he cried about the decision he had to make … The majority of people I spoke with were angry and disillusioned and wanted change—but they often wanted change back to the way that football was. I sensed they felt the same way about their lives. It was like they feel like the world we live in has gotten impossibly complicated, and that what they want is a simpler, romanticized, idealized time — a time that may not even be real but that they remember fondly. That came across so much more strongly than I anticipated. And yet, if you’re talking favorite moments, it’s hard to beat the Friday night I spent in Allen, Texas, at the $60-million high school stadium. The pageantry, the skill level, the barbecue, the Balding Eagles booster club, the stadium perch for the boosters. A lot of people would watch that scene and think that it’s everything wrong with football. But it didn’t feel that way when you were there. It felt like all the best of football rolled into one place.”\nThis is yet another demonstration that the white population of the USA is essentially two different nations. The media, which is populated by the smaller Globalist White population, has virtually no familiarity, or understanding, of the Nationalist White population, as evidenced even by these well-meaning attempts to do so. On what planet is the opinion of strippers and 10-year-old girls playing linebacker even remotely relevant to the NFL?\nFootball is merely one of the many friction points now fraying at the fabric of society. It’s been remarkable to see how the Globalist Whites have steadfastly denied what is manifestly obvious to everyone about the declining NFL ratings. It’s not that anyone actually cares what Colin Kaepernick or the players imitating him actually think, it is the symbolic nature of their actions that have infuriated millions of Nationalist Whites as well as more than a few pro-American minorities.\nDespite living in Europe and being a player and coach of the game of football proper, which is to say,\ncalcio\n, the beautiful game, I still love American football, particularly the chess game that is the NFL variety. But there are certainly times, such as when the idiot refs throw a flag on an irrelevant block-in-the-back penalty that negates a great punt return, or a highly questionable roughing-the-passer penalty on 4th-and-19 that gives a defeated team an undeserved second shot at winning a game it has already lost, that I’m tempted to turn off the TV. And the fact that the NFL is coddling anti-American protesters like Kaepernick only makes it that much more easy to do so.\nAnd yes, NFL-hating spergs, you can do your tedious thing here, as for once, it is not off-topic. It won’t make any difference to anyone, you understand, but you can tell us all about your opinion that means nothing to any of us if you feel the need to do so.",
  "tags": [
    "politics",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-21T12:56:00+00:00"
}