{
  "url": "https://voxday.net/2016/11/16/gamerghazi-cant-cope/",
  "scraped_at": "2025-12-18T02:05:22.952803",
  "title": "GamerGhazi can’t cope",
  "date_display": "November 16, 2016",
  "date_iso": "2016-11-16T14:00:00+00:00",
  "date_from_url": "2016-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The ride never ends. Nor does <a href=\"https://www.reddit.com/r/GamerGhazi/comments/5d2ed1/need_support_to_cope_with_the_post_election_world/\">the winning</a>:</p><blockquote><p> I’m sure many of you can relate to this, but since the double whammy of Brexit and Trump, I’m feeling extremely lost and upset and having some trouble coping with the new reality. I’ve been a long time lurker here and since this has always seemed like a supportive community, I thought I’d reach out for some advice.</p><p>I live in the stereotypical liberal bubble in a left-liberal city. I don’t have any friends or family or work colleagues who would have supported Trump, so I have struggled to understand how this has happened, or how ideas that have been our shared values since WWII have been shed in favour of what appears to me to be a resurgence of ethno-nationalistic fascism. That’s not to say I haven’t read widely on the subject, and at least intellectually now I can at least explain what has happened without believing that America and Britain have both gone through a massive swing towards racism, nativism, misogyny and hate, although I still believe that is part of the answer.</p><p>I’m terrified for for the state of the world. I’m afraid that the US will end up like Putin’s Russia, with 85% approval ratings, a watertight internal propaganda system and spiralling human rights abuses. I’m afraid that with America abandoning its (admittedly flawed in practice) ideals of spreading democracy and human rights across the world, that the sum total of human suffering will increase drastically. Already Trump is suspected to drop all talk of human rights from negotiations with China, limit support of NATO allies, as well as South Korea and Japan, and I’m terrified of a return to pre-20th century ‘might makes right’ international relations where the powerful will exploit and abuse the weak.</p><p>After the election I went to one of my favourite thinkers, Jonathon Haidt. <a href=\"https://www.ted.com/talks/jonathan_haidt_can_a_divided_america_heal\">This recent video of him</a> inspired me to try to reach out to Trump supporters via Twitter and try to genuinely understand and empathise with them, and perhaps in turn have them empathise with me. After a couple of days of that I’ve all but given up, having repeatedly bashed my head against the brick wall of Infowars, international Jewish Globalist conspiracy, and a well that is now permanently poisoned against anything from the liberal intellectual tradition.</p><p>Now I’m more lost than ever. I’ve actually become ill from worry and feel like I’m now just compulsively online, trying to understand and explain and maybe find a light at the end of the tunnel. My question to you guys is: what are you doing to cope? Is there a place that people like us can go for mutual support? What’s the best way to stop this awful feeling of powerlessness and loss?</p></blockquote><p>Wouldn’t it be TERRIBLE and THE WORST THING EVER if 85 percent of the American people approved of their leader? These morons don’t even listen to themselves, so why on Earth would they think we will?</p><p>This hapless individual has quite clearly learned nothing from “one of his favorite thinkers”. He still thinks that if only he lectures the Alt-Right on a liberal intellectual tradition that we know better than he does, we’ll come around to what can’t rightly be called his way of thinking. Say, rather, his way of parroting left-liberal dogma.</p><p>We know the liberal intellectual tradition, both the genuine one and its subsequent substitution. We reject them both.</p></div>",
  "content_text": "The ride never ends. Nor does\nthe winning\n:\nI’m sure many of you can relate to this, but since the double whammy of Brexit and Trump, I’m feeling extremely lost and upset and having some trouble coping with the new reality. I’ve been a long time lurker here and since this has always seemed like a supportive community, I thought I’d reach out for some advice.\nI live in the stereotypical liberal bubble in a left-liberal city. I don’t have any friends or family or work colleagues who would have supported Trump, so I have struggled to understand how this has happened, or how ideas that have been our shared values since WWII have been shed in favour of what appears to me to be a resurgence of ethno-nationalistic fascism. That’s not to say I haven’t read widely on the subject, and at least intellectually now I can at least explain what has happened without believing that America and Britain have both gone through a massive swing towards racism, nativism, misogyny and hate, although I still believe that is part of the answer.\nI’m terrified for for the state of the world. I’m afraid that the US will end up like Putin’s Russia, with 85% approval ratings, a watertight internal propaganda system and spiralling human rights abuses. I’m afraid that with America abandoning its (admittedly flawed in practice) ideals of spreading democracy and human rights across the world, that the sum total of human suffering will increase drastically. Already Trump is suspected to drop all talk of human rights from negotiations with China, limit support of NATO allies, as well as South Korea and Japan, and I’m terrified of a return to pre-20th century ‘might makes right’ international relations where the powerful will exploit and abuse the weak.\nAfter the election I went to one of my favourite thinkers, Jonathon Haidt.\nThis recent video of him\ninspired me to try to reach out to Trump supporters via Twitter and try to genuinely understand and empathise with them, and perhaps in turn have them empathise with me. After a couple of days of that I’ve all but given up, having repeatedly bashed my head against the brick wall of Infowars, international Jewish Globalist conspiracy, and a well that is now permanently poisoned against anything from the liberal intellectual tradition.\nNow I’m more lost than ever. I’ve actually become ill from worry and feel like I’m now just compulsively online, trying to understand and explain and maybe find a light at the end of the tunnel. My question to you guys is: what are you doing to cope? Is there a place that people like us can go for mutual support? What’s the best way to stop this awful feeling of powerlessness and loss?\nWouldn’t it be TERRIBLE and THE WORST THING EVER if 85 percent of the American people approved of their leader? These morons don’t even listen to themselves, so why on Earth would they think we will?\nThis hapless individual has quite clearly learned nothing from “one of his favorite thinkers”. He still thinks that if only he lectures the Alt-Right on a liberal intellectual tradition that we know better than he does, we’ll come around to what can’t rightly be called his way of thinking. Say, rather, his way of parroting left-liberal dogma.\nWe know the liberal intellectual tradition, both the genuine one and its subsequent substitution. We reject them both.",
  "tags": [
    "#AltRight",
    "#GamerGate"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-16T14:00:00+00:00"
}