{
  "url": "https://voxday.net/2016/11/23/great-man-vs-cliodynamics/",
  "scraped_at": "2025-12-18T02:06:32.310638",
  "title": "Great Man vs cliodynamics",
  "date_display": "November 23, 2016",
  "date_iso": "2016-11-23T08:50:00+00:00",
  "date_from_url": "2016-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A plethora of opinions are being expressed about the future of the Alt-Right in light of the God-Emperor-Ascendant’s disavowal. The Left has been emboldened; sensing a chink in the armor, the hasbaresque trolls are already out in force, doing what they always do, proclaiming inevitable victory and the imminent arrival of the <strike>worker’s paradise</strike> rainbow unitopia while attempting to demoralize their enemies by making absurd statements that push the current media Narrative.</p><p>But nothing has changed. Richard Spencer didn’t create the Alt-Right, he merely provided a nickname for an alternative right that has been around since William F. Buckley purged the John Birch Society. Hillary Clinton didn’t speak it into existence. Donald Trump won’t speak it out of existence.</p><p>Nothing has changed. Conservatism still hasn’t conserved anything. The wall still has not been built. The melting pot is still a self-serving immigrant myth. The United States is still a white nation founded by and for whites, <a href=\"http://www.slate.com/blogs/lexicon_valley/2016/11/22/is_alt_right_still_all_right.html\">as even Slate admitted yesterday</a>. The Alt-Right will remain a potent and rising force throughout the West because the ebb and flow of historical patterns, patterns that scientists and historians developing Structural Dynamic Theory have traced back as far as ancient China and Rome, are still observably playing out through events today.</p><p>Consider what Yuji Aida wrote <a href=\"http://articles.chicagotribune.com/1991-04-16/news/9102030765_1_ethnic-industrial-blacks-and-hispanics\">in the Chicago Tribune</a>:</p><blockquote class=\"tr_bq\"><p> Americans are proud of their melting-pot heritage. But as blacks, Hispanics and Asians gradually come to outnumber whites, that ideal will fade. Like the Soviet Union today, the United States will have to deal with contentious ethnic groups demanding greater autonomy and even political independence. That could prove to be industrial America`s undoing. Many Americans, however, feign ignorance of the problem, partly because of the official ideology. The United States sees itself as a pluralistic, multi-ethnic society with a single national identity based on the principles of freedom and democracy. In fact, discrimination is rampant, but the illusion of equality is vital to maintain a sense of unity. Nonetheless, it is only a matter of time before U.S. minority groups espouse self-determination in some form. When that happens, the country may become ungovernable.</p></blockquote><p>That was written not long after I returned from Japan, in 1991. The failure of the official ideology, the fictional nature of a “national identity” based on principles and propositions rather than genetics and language, was already obvious 25 years ago. As for the irrelevance of the individual actors, consider <a href=\"http://www.freerepublic.com/focus/f-news/1174657/posts\">an article that I wrote back in 2004</a> about Tolstoy, Prechter, and socionomics:<br/></p><blockquote><p> It is easy to mistake Leo Tolstoy’s massive book, “War and Peace,” for a novel. It is not. Instead, it would better be considered the world’s longest satirical polemic, in the vein of Jonathan Swift’s “A Modest Proposal.” From beginning to end, Tolstoy’s classic work is intended to illustrate the arrogant incompetence of human understanding and the inability of human reason to explain even the simplest of social phenomena.</p><p>With unrelenting precision and distinct overtones of mockery, Tolstoy dissects the notion that men dictate events. In one specific example, he examines, with minute detail, the four specific orders Napoleon gave to his army prior to the battle of Borodino:<br/></p><blockquote><p> <i>These dispositions, which are very obscure and confused if one allows oneself to regard the arrangements without religious awe of his genius, related to Napoleon’s orders to deal with four points – four different orders. Not one of these was, or could be, carried out …<br> </br></i></p><p>And it was not Napoleon who directed the course of the battle, for none of his orders were executed and during the battle he did not know what was going on before him. So the way in which these people killed one another was not decided by Napoleon’s will but occurred independently of him, in accord with the will of hundreds of thousands of people who took part in the common action. It only seemed to Napoleon that it all took place by his will.</p></blockquote><p>In the second epilogue, Tolstoy goes on to brutally abuse both specific and universal historians, demonstrating how their explanations of various historical events is not only inevitably contradictory, but often constructed on base premises that do not withstand a moment’s reflection. Tolstoy further underlines his case by the choice of the two heroes of the novel within the polemic, Pierre and Kutozov, both of whom achieve their respective dream of inner peace and Russian victory only by submitting their will to the great forces moving around them.</p></blockquote><p>This is not, as one skeptic rather amusingly put it, “a reliance upon the inevitable forces of history and the methods of material production”. (That did make me laugh; though.) Marxism is the groundless and unquantifiable application of incorrect economic theory to the future. Cliodynamics is observing what has already happened and is happening today, then drawing rational conclusions about how the various patterns and cycles observed will play out next. At the moment, I’m reading <i>Ultrasociety</i>, by Peter Turchin. It is an excellent book, and although its primary subject matter is largely tangential to these patterns of history, a passage I read yesterday struck me as entirely apt.</p><blockquote class=\"tr_bq\"><p> There is a pattern that we see recurring throughout history, when a successful empire expands its borders so far that it becomes the biggest kid on the block. When survival is no longer at stake, selfish elites and other special interest groups capture the political agenda. The spirit that “we are all in the same boat” disappears and is replaced by a “winner take all” mentality. As the elites enrich themselves, the rest of the population is increasingly impoverished. Rampant inequality of wealth further corrodes cooperation. Beyond a certain point a formerly great empire becomes so dysfunctional that smaller, more cohesive neighbors begin tearing it apart. Eventually the capacity for cooperation declines to such a low level that barbarians can strike at the very heart of the empire without encountering significant resistance. But barbarians at the gate are not the real cause of imperial collapse. They are a consequence of the failure to sustain social cooperation.</p></blockquote><p>There is more, considerably more, than this restatement of what John Glubb and Edward Gibbon and Polybius, and other historians have noted would appear to indicate. But the point is, the eventual significance of these events will be determined by how well they flow with the historical patterns, not the opinion of any one individual, not even the God-Emperor Ascendant himself. The fate of the Alt Right does not depend upon one of its media-christened figureheads, but upon its willingness to align itself with the observable patterns of history as they play out.</p><p>Because, as we know, our enemies are in the apocryphal position of King Canute, desperately attempting to hold back the waves with their false narratives and outdated theories about the way the world works. But everywhere, their narratives are failing. I just received translations of the 16 Points of the Alt-Right into Mandarin and Romanian last night; the Romanian translator added:</p><blockquote class=\"tr_bq\"><p> I recently got in contact with the ideas of alt-right. The logic behind it is clear since I am from Romania and I myself seen what happened to my country, even after it entered the European Union. It lost all its industries, even the strategic ones. Also, we lost much of the workforce to other countries. As alt-right correctly points “free trade” requires completely destroying the country. </p></blockquote><p>Being correct, and providing an operative, accurate predictive model upon which people can rely, will trump monkeys dancing in front of the media every single time.</p></div>",
  "content_text": "A plethora of opinions are being expressed about the future of the Alt-Right in light of the God-Emperor-Ascendant’s disavowal. The Left has been emboldened; sensing a chink in the armor, the hasbaresque trolls are already out in force, doing what they always do, proclaiming inevitable victory and the imminent arrival of the\nworker’s paradise\nrainbow unitopia while attempting to demoralize their enemies by making absurd statements that push the current media Narrative.\nBut nothing has changed. Richard Spencer didn’t create the Alt-Right, he merely provided a nickname for an alternative right that has been around since William F. Buckley purged the John Birch Society. Hillary Clinton didn’t speak it into existence. Donald Trump won’t speak it out of existence.\nNothing has changed. Conservatism still hasn’t conserved anything. The wall still has not been built. The melting pot is still a self-serving immigrant myth. The United States is still a white nation founded by and for whites,\nas even Slate admitted yesterday\n. The Alt-Right will remain a potent and rising force throughout the West because the ebb and flow of historical patterns, patterns that scientists and historians developing Structural Dynamic Theory have traced back as far as ancient China and Rome, are still observably playing out through events today.\nConsider what Yuji Aida wrote\nin the Chicago Tribune\n:\nAmericans are proud of their melting-pot heritage. But as blacks, Hispanics and Asians gradually come to outnumber whites, that ideal will fade. Like the Soviet Union today, the United States will have to deal with contentious ethnic groups demanding greater autonomy and even political independence. That could prove to be industrial America`s undoing. Many Americans, however, feign ignorance of the problem, partly because of the official ideology. The United States sees itself as a pluralistic, multi-ethnic society with a single national identity based on the principles of freedom and democracy. In fact, discrimination is rampant, but the illusion of equality is vital to maintain a sense of unity. Nonetheless, it is only a matter of time before U.S. minority groups espouse self-determination in some form. When that happens, the country may become ungovernable.\nThat was written not long after I returned from Japan, in 1991. The failure of the official ideology, the fictional nature of a “national identity” based on principles and propositions rather than genetics and language, was already obvious 25 years ago. As for the irrelevance of the individual actors, consider\nan article that I wrote back in 2004\nabout Tolstoy, Prechter, and socionomics:\nIt is easy to mistake Leo Tolstoy’s massive book, “War and Peace,” for a novel. It is not. Instead, it would better be considered the world’s longest satirical polemic, in the vein of Jonathan Swift’s “A Modest Proposal.” From beginning to end, Tolstoy’s classic work is intended to illustrate the arrogant incompetence of human understanding and the inability of human reason to explain even the simplest of social phenomena.\nWith unrelenting precision and distinct overtones of mockery, Tolstoy dissects the notion that men dictate events. In one specific example, he examines, with minute detail, the four specific orders Napoleon gave to his army prior to the battle of Borodino:\nThese dispositions, which are very obscure and confused if one allows oneself to regard the arrangements without religious awe of his genius, related to Napoleon’s orders to deal with four points – four different orders. Not one of these was, or could be, carried out …\nAnd it was not Napoleon who directed the course of the battle, for none of his orders were executed and during the battle he did not know what was going on before him. So the way in which these people killed one another was not decided by Napoleon’s will but occurred independently of him, in accord with the will of hundreds of thousands of people who took part in the common action. It only seemed to Napoleon that it all took place by his will.\nIn the second epilogue, Tolstoy goes on to brutally abuse both specific and universal historians, demonstrating how their explanations of various historical events is not only inevitably contradictory, but often constructed on base premises that do not withstand a moment’s reflection. Tolstoy further underlines his case by the choice of the two heroes of the novel within the polemic, Pierre and Kutozov, both of whom achieve their respective dream of inner peace and Russian victory only by submitting their will to the great forces moving around them.\nThis is not, as one skeptic rather amusingly put it, “a reliance upon the inevitable forces of history and the methods of material production”. (That did make me laugh; though.) Marxism is the groundless and unquantifiable application of incorrect economic theory to the future. Cliodynamics is observing what has already happened and is happening today, then drawing rational conclusions about how the various patterns and cycles observed will play out next. At the moment, I’m reading\nUltrasociety\n, by Peter Turchin. It is an excellent book, and although its primary subject matter is largely tangential to these patterns of history, a passage I read yesterday struck me as entirely apt.\nThere is a pattern that we see recurring throughout history, when a successful empire expands its borders so far that it becomes the biggest kid on the block. When survival is no longer at stake, selfish elites and other special interest groups capture the political agenda. The spirit that “we are all in the same boat” disappears and is replaced by a “winner take all” mentality. As the elites enrich themselves, the rest of the population is increasingly impoverished. Rampant inequality of wealth further corrodes cooperation. Beyond a certain point a formerly great empire becomes so dysfunctional that smaller, more cohesive neighbors begin tearing it apart. Eventually the capacity for cooperation declines to such a low level that barbarians can strike at the very heart of the empire without encountering significant resistance. But barbarians at the gate are not the real cause of imperial collapse. They are a consequence of the failure to sustain social cooperation.\nThere is more, considerably more, than this restatement of what John Glubb and Edward Gibbon and Polybius, and other historians have noted would appear to indicate. But the point is, the eventual significance of these events will be determined by how well they flow with the historical patterns, not the opinion of any one individual, not even the God-Emperor Ascendant himself. The fate of the Alt Right does not depend upon one of its media-christened figureheads, but upon its willingness to align itself with the observable patterns of history as they play out.\nBecause, as we know, our enemies are in the apocryphal position of King Canute, desperately attempting to hold back the waves with their false narratives and outdated theories about the way the world works. But everywhere, their narratives are failing. I just received translations of the 16 Points of the Alt-Right into Mandarin and Romanian last night; the Romanian translator added:\nI recently got in contact with the ideas of alt-right. The logic behind it is clear since I am from Romania and I myself seen what happened to my country, even after it entered the European Union. It lost all its industries, even the strategic ones. Also, we lost much of the workforce to other countries. As alt-right correctly points “free trade” requires completely destroying the country.\nBeing correct, and providing an operative, accurate predictive model upon which people can rely, will trump monkeys dancing in front of the media every single time.",
  "tags": [
    "#AltRight",
    "decline and fall",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-23T08:50:00+00:00"
}