{
  "url": "https://voxday.net/2016/11/07/heat-street-vox-vs-louise-on-election/",
  "scraped_at": "2025-12-18T02:03:47.159859",
  "title": "Heat Street: Vox vs Louise on the election",
  "date_display": "November 7, 2016",
  "date_iso": "2016-11-07T22:16:00+00:00",
  "date_from_url": "2016-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And to think some of you wonder why I like doing these little debates with Louise. The headline alone is well worth it. <b>Vox Day: God-Emperor President Donald Trump Is On the Way – <a href=\"https://heatst.com/world/vox-day-god-emperor-president-donald-trump-is-on-the-way-altright-election-debate/\">AltRight Election Debate</a></b></p><blockquote><p> <b>Louise:</b> Right. This is going to be quicker, slightly quicker than normal, but it’s Louise Mensch, Vox Day recording this debate, which Vox suggested that we do after the election, but I think that after the election is the coward’s way out and beneath us both. Because, after the election you can redo your prediction to say in light of everything how right you were. Why didn’t astrologists ever predict anything before it actually happens? First of all, let’s put our reputations on the line by giving our predictions for the overall winner, and by approximately how much. You go first, Vox.</p><p><b>Vox: </b>I am actively and eagerly looking forward to the ascension of the God Emperor, Trump. I think that he is not only going to win, I think he is going to win by a larger percentage than people expect. I think that he’s probably going to win by a margin by a of at least three percentage points nationally, possibly more. In terms of the electoral college, I have absolutely no idea.</p><p><b>Louise: </b>Oh,  that sounds like a chicken-out to me. I got to say, I got to say. Winning the election is when you become the president afterwards.</p><p><b>Vox: </b>No, he will win the electoral college vote, I just don’t know how much. I don’t know what states he’s going to win, because given the unreliability of the polls, given the fact that one poll in North Carolina had Hillary Clinton up by thirteen points, and another one had Trump up by four, it’s impossible to make any sort of reasonable calculation of this, the best efforts of Nate Silver and other poll watchers, notwithstanding.</p></blockquote><p>Admit it, the headline made you laugh. It made me laugh, anyhow. I should clarify one point, however. I don’t believe there would be a civil war as a reaction to Hillary Clinton’s election, or during whatever fragment of a term she would be healthy enough to serve. I believe that her election would, as a result of open immigration and eventual amnesty, lay the foundation for the political dissolution of the USA, and eventually, a Yugoslav-style civil war for territory among rival ethnic groups in the 2030s.</p></div>",
  "content_text": "And to think some of you wonder why I like doing these little debates with Louise. The headline alone is well worth it.\nVox Day: God-Emperor President Donald Trump Is On the Way –\nAltRight Election Debate\nLouise:\nRight. This is going to be quicker, slightly quicker than normal, but it’s Louise Mensch, Vox Day recording this debate, which Vox suggested that we do after the election, but I think that after the election is the coward’s way out and beneath us both. Because, after the election you can redo your prediction to say in light of everything how right you were. Why didn’t astrologists ever predict anything before it actually happens? First of all, let’s put our reputations on the line by giving our predictions for the overall winner, and by approximately how much. You go first, Vox.\nVox:\nI am actively and eagerly looking forward to the ascension of the God Emperor, Trump. I think that he is not only going to win, I think he is going to win by a larger percentage than people expect. I think that he’s probably going to win by a margin by a of at least three percentage points nationally, possibly more. In terms of the electoral college, I have absolutely no idea.\nLouise:\nOh,  that sounds like a chicken-out to me. I got to say, I got to say. Winning the election is when you become the president afterwards.\nVox:\nNo, he will win the electoral college vote, I just don’t know how much. I don’t know what states he’s going to win, because given the unreliability of the polls, given the fact that one poll in North Carolina had Hillary Clinton up by thirteen points, and another one had Trump up by four, it’s impossible to make any sort of reasonable calculation of this, the best efforts of Nate Silver and other poll watchers, notwithstanding.\nAdmit it, the headline made you laugh. It made me laugh, anyhow. I should clarify one point, however. I don’t believe there would be a civil war as a reaction to Hillary Clinton’s election, or during whatever fragment of a term she would be healthy enough to serve. I believe that her election would, as a result of open immigration and eventual amnesty, lay the foundation for the political dissolution of the USA, and eventually, a Yugoslav-style civil war for territory among rival ethnic groups in the 2030s.",
  "tags": [
    "debate",
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-07T22:16:00+00:00"
}