{
  "url": "https://voxday.net/2016/11/06/high-and-hidden-weirdness/",
  "scraped_at": "2025-12-18T02:03:22.864322",
  "title": "High and hidden weirdness",
  "date_display": "November 6, 2016",
  "date_iso": "2016-11-06T10:49:00+00:00",
  "date_from_url": "2016-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From The Donald, /pol/ has unearthed <a href=\"https://www.reddit.com/r/The_Donald/comments/5beuza/not_a_drill_pedo_ring_busted_right_the_fuck_open/\">some suspicious links</a> concerning pizza places with connections to Andrew Kline of the DOJ, David Brock, and John Podesta’s <a href=\"https://wikileaks.org/podesta-emails/emailid/46134\">cooking</a>.</p><blockquote class=\"tr_bq\"><ul><li>FBI symbols <a href=\"https://file.wikileaks.org/file/FBI-pedophile-symbols.pdf\">from WikiLeaks</a></li><li>Besta Pizza using <a href=\"http://imgur.com/AwvFM1d\">“boy lover” symbol</a></li><li>Comet Ping Pong <a href=\"http://imgur.com/RkTZ7lm\">using “child lover” symbol</a> They’re connected to CTR, Podesta, and next door to each other.</li><li>What’s across the street from Comet Ping Pong and Besta Pizza? A third place using Pedophilia Symbolism. Who’s on their website home page above the double heart pedo-symbol? <a href=\"https://i.sli.mg/xaRHyg.png\">Hillary Clinton</a>. </li></ul></blockquote><p>As one channer noted, who opens a pizza place two doors down from a pizza place? Does the picture below look like a normal pizza advertisement to you or is there a high creep factor there? Now note that it’s the main image <a href=\"https://archive.fo/KRMeh\">on the front page</a>. And after dinner, you can head to the back, which features “bathrooms hidden behind secret panels” to play! <a href=\"http://infogalactic.com/info/Comet_Ping_Pong\">According to Infogalactic</a>, “GQ ranked James Alefantis as the 49th most powerful person in Washington partly on the basis of owning Comet Ping Pong and its cultural cachet.”</p><p>How, one wonders, does owning a weird little pizza place serving mediocre pizza <a href=\"https://imgur.com/OFtVr1R\">make you more powerful</a> than most Senators and Congressmen? Do you really believe that <i>a fucking pizza</i>, and one that does not look particularly appetizing at that, is really supposed to be of such intense interest to the creeps below? The red-haired guy should be locked up on the basis of his physiognomy alone.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://archive.fo/BDCXs\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"302\" src=\"https://image.jimcdn.com/app/cms/image/transf/dimension=850x10000:format=jpg/path/s742dd563442b66d6/image/i2c909579f9f5c6e2/version/1416944215/image.jpg\" width=\"400\"/></a></div><p>This isn’t the only hidden weirdness in high places being exposed around the world. In South Korea, which is more strongly Christian than the USA now, there are now <a href=\"https://8ch.net/pol/res/8085851.html\">hundreds of thousands of people in open revolt</a> against  President Park Geun-hye, who has a bizarre personal connection to a Svengali-style adviser who is the daughter of the founder of a cult called the Church of Eternal Life.</p><blockquote><p> 4 days ago Park suddenly made statement: “From today Korea is cabinet government led by a prime minister” and appointed a prime minister Mr. fucking nobody. all this super crazy critical decision without a single discussion or debate literally no one ever discussed with Park about this matter Park literally went full borderline personality disorder, blocking all the communications, still thinking she’s absolute monarch</p><p>politicians went full wtf suddenly Korea is cabinet government by one day “Fuck the constitution, I AM THE COUNTRY” after this approval rating hits 5%</p><p>yes, 5%</p><p>only Megalians defending her now, saying Park’s being attacked solely because she’s woman, and this is all just patriarchal male conspiracy to remove women’s position even her own party preparing impeach</p><p>Park went more desperate, made 2nd 10 minutes apologize statement today: “There was no shamanic ritual happened inside of presidential house and I’m not a member of cult” a country’s president officially explaining about satanic, shamanic human sacrifice ritual inside of presidential house, and she’s not memeber of the Korean Scientology plus 6th grade tier of statement scripts, and confirming she won’t resign on her own</p><p>FYI the day when Sewol ferry sunk was 4 days prior to the 20th anniversary of death of Choi Sun Sil’s father and the president mysteriously went missing for 7 hours on that very day when Sewol sunk smells funky</p><p>suddenly a congressman made another whistle-blowing statement Psy, Gangnam Style, and the whole “Korean Wave” culture shit was involved with Choi’s cronyism cabal, deeply CJ, Samsung, Lotte persucuted for being against the 8 Goddess’s shadow government and their CEOs replaced with strawmen</p><p>The PyeongChang 2018 Olympic is actually Choi’s mass cronyism business party leaks after leaks, whistler-blower after whistler-blower, reveals after reveals, shocking after shocking, the endless exposures politicians talking on TV, former congressman openly saying they were chained and shackled, and now they’re free and able talking about the ‘Voldemort’</p><p>yes, politicians literally saying they were Korea’s Voldemort</p><p>opposition party’s leader saying in front of hundreds cameras, “The 8 Goddess’s secret cabal must be destroyed”</p><p>Josh Earnest made White House statement today; “Obama wants Park to leave, changing the leader won’t affect diplomacy between Korea and US at all” CIA Korea division chief Donald Gregg made statement, “We were wrong about Park, we thought she would lead Korea well, I feel deeply sorry for the fellow Korean citizens”</p><p>even worldwide masonic elite cabals throwing away this incapable hag</p><p>there’s big fucking rumor surfacing, the arrested Choi is actually substitute actor people already checking ear prints, digging the connections and corruptions 24/7</p><p>tfw the incompetent slave gook citizens who knew nothing but obey suddenly turned into anonymous Guccifer 3.0 revolutionary WikiLeaks tier info warriors at least 200 thousands people protested in the streets of Seoul today the absolute mad men brought real guillotins from 12 years old kids to 90 years old war vet grandpas, marching in the streets, chanting “GIVE US RESIGN OR DEATH” you can hear it from in every streets of Seoul</p><p>the court ordered cops to not fuck with protesters opposition party’s congressmen went to the protest scene to courage people up</p><p>HE WAS BEEN ATTACKED BY UNIDENTIFIED ASSASSIN WITH A KNIFE</p><p>the very fucking assassin who ran into congressman with a knife, literally beaten up to near death by the crowds, second pic</p><p>tfw we’re being united against the big, absolute evil, the all-female secret government that fucked us the whole time tfw right and left, progressive and conserative, women and men, kids and oldies, all united and we’re fucking mad as hell</p></blockquote><p>A more conventional summary of what has been called Choi Soon-sil Gate can be read <a href=\"http://www.koreaexpose.com/voices/choi-soon-sil-gate-sad-political-drama/\">at Korean Expose</a>. Stay flinty, everyone. This is no time to go wobbly. If you pray, pray. If you have a platform, however large or small, spread the word. The evil is real, it is material, and it is in high places around the world.</p><p>Stop whining and worrying about whether we know the full and complete truth about every single individual involved or not. I will tell you right now that we don’t, and that very powerful people are doing their utmost to try to ensure we never do. So the fuck what? Unless we dig and shine our little flashlights on it, unless we pay at least a modicum of attention to those who are courageously doing their best to dig away at the mountain of filth to discover what lies beneath it, their evil will never be exposed. Unless we take the risk of being wrong, we will never know anything at all.</p><p>If you’re going to make a lame gamma appeal to “credibility”, you can just go away and never come back as far as I’m concerned. The New York Times is “credible”. ABCNNBCBS is “credible”. The Washington Post is “credible”. And they lie, lie, lie and spin, spin, spin and deceive, deceive, deceive every single day. <i>That is their primary purpose</i>! They do not exist to inform or educate, but to deceive and distract the public, and defang negative public opinion.</p><p>I don’t give a quantum of an airborne rodent’s posterior for “credibility”. I never have. I am interested in one thing: the truth. And when you’re dealing with sociopaths who are quite willing to do anything and everything within their power to obscure it, you have to expect the occasional dead end. But a dead end does not mean that you’ve reached the center of the maze, or that there are no monsters hiding somewhere inside it.</p></div>",
  "content_text": "From The Donald, /pol/ has unearthed\nsome suspicious links\nconcerning pizza places with connections to Andrew Kline of the DOJ, David Brock, and John Podesta’s\ncooking\n.\nFBI symbols\nfrom WikiLeaks\nBesta Pizza using\n“boy lover” symbol\nComet Ping Pong\nusing “child lover” symbol\nThey’re connected to CTR, Podesta, and next door to each other.\nWhat’s across the street from Comet Ping Pong and Besta Pizza? A third place using Pedophilia Symbolism. Who’s on their website home page above the double heart pedo-symbol?\nHillary Clinton\n.\nAs one channer noted, who opens a pizza place two doors down from a pizza place? Does the picture below look like a normal pizza advertisement to you or is there a high creep factor there? Now note that it’s the main image\non the front page\n. And after dinner, you can head to the back, which features “bathrooms hidden behind secret panels” to play!\nAccording to Infogalactic\n, “GQ ranked James Alefantis as the 49th most powerful person in Washington partly on the basis of owning Comet Ping Pong and its cultural cachet.”\nHow, one wonders, does owning a weird little pizza place serving mediocre pizza\nmake you more powerful\nthan most Senators and Congressmen? Do you really believe that\na fucking pizza\n, and one that does not look particularly appetizing at that, is really supposed to be of such intense interest to the creeps below? The red-haired guy should be locked up on the basis of his physiognomy alone.\nThis isn’t the only hidden weirdness in high places being exposed around the world. In South Korea, which is more strongly Christian than the USA now, there are now\nhundreds of thousands of people in open revolt\nagainst  President Park Geun-hye, who has a bizarre personal connection to a Svengali-style adviser who is the daughter of the founder of a cult called the Church of Eternal Life.\n4 days ago Park suddenly made statement: “From today Korea is cabinet government led by a prime minister” and appointed a prime minister Mr. fucking nobody. all this super crazy critical decision without a single discussion or debate literally no one ever discussed with Park about this matter Park literally went full borderline personality disorder, blocking all the communications, still thinking she’s absolute monarch\npoliticians went full wtf suddenly Korea is cabinet government by one day “Fuck the constitution, I AM THE COUNTRY” after this approval rating hits 5%\nyes, 5%\nonly Megalians defending her now, saying Park’s being attacked solely because she’s woman, and this is all just patriarchal male conspiracy to remove women’s position even her own party preparing impeach\nPark went more desperate, made 2nd 10 minutes apologize statement today: “There was no shamanic ritual happened inside of presidential house and I’m not a member of cult” a country’s president officially explaining about satanic, shamanic human sacrifice ritual inside of presidential house, and she’s not memeber of the Korean Scientology plus 6th grade tier of statement scripts, and confirming she won’t resign on her own\nFYI the day when Sewol ferry sunk was 4 days prior to the 20th anniversary of death of Choi Sun Sil’s father and the president mysteriously went missing for 7 hours on that very day when Sewol sunk smells funky\nsuddenly a congressman made another whistle-blowing statement Psy, Gangnam Style, and the whole “Korean Wave” culture shit was involved with Choi’s cronyism cabal, deeply CJ, Samsung, Lotte persucuted for being against the 8 Goddess’s shadow government and their CEOs replaced with strawmen\nThe PyeongChang 2018 Olympic is actually Choi’s mass cronyism business party leaks after leaks, whistler-blower after whistler-blower, reveals after reveals, shocking after shocking, the endless exposures politicians talking on TV, former congressman openly saying they were chained and shackled, and now they’re free and able talking about the ‘Voldemort’\nyes, politicians literally saying they were Korea’s Voldemort\nopposition party’s leader saying in front of hundreds cameras, “The 8 Goddess’s secret cabal must be destroyed”\nJosh Earnest made White House statement today; “Obama wants Park to leave, changing the leader won’t affect diplomacy between Korea and US at all” CIA Korea division chief Donald Gregg made statement, “We were wrong about Park, we thought she would lead Korea well, I feel deeply sorry for the fellow Korean citizens”\neven worldwide masonic elite cabals throwing away this incapable hag\nthere’s big fucking rumor surfacing, the arrested Choi is actually substitute actor people already checking ear prints, digging the connections and corruptions 24/7\ntfw the incompetent slave gook citizens who knew nothing but obey suddenly turned into anonymous Guccifer 3.0 revolutionary WikiLeaks tier info warriors at least 200 thousands people protested in the streets of Seoul today the absolute mad men brought real guillotins from 12 years old kids to 90 years old war vet grandpas, marching in the streets, chanting “GIVE US RESIGN OR DEATH” you can hear it from in every streets of Seoul\nthe court ordered cops to not fuck with protesters opposition party’s congressmen went to the protest scene to courage people up\nHE WAS BEEN ATTACKED BY UNIDENTIFIED ASSASSIN WITH A KNIFE\nthe very fucking assassin who ran into congressman with a knife, literally beaten up to near death by the crowds, second pic\ntfw we’re being united against the big, absolute evil, the all-female secret government that fucked us the whole time tfw right and left, progressive and conserative, women and men, kids and oldies, all united and we’re fucking mad as hell\nA more conventional summary of what has been called Choi Soon-sil Gate can be read\nat Korean Expose\n. Stay flinty, everyone. This is no time to go wobbly. If you pray, pray. If you have a platform, however large or small, spread the word. The evil is real, it is material, and it is in high places around the world.\nStop whining and worrying about whether we know the full and complete truth about every single individual involved or not. I will tell you right now that we don’t, and that very powerful people are doing their utmost to try to ensure we never do. So the fuck what? Unless we dig and shine our little flashlights on it, unless we pay at least a modicum of attention to those who are courageously doing their best to dig away at the mountain of filth to discover what lies beneath it, their evil will never be exposed. Unless we take the risk of being wrong, we will never know anything at all.\nIf you’re going to make a lame gamma appeal to “credibility”, you can just go away and never come back as far as I’m concerned. The New York Times is “credible”. ABCNNBCBS is “credible”. The Washington Post is “credible”. And they lie, lie, lie and spin, spin, spin and deceive, deceive, deceive every single day.\nThat is their primary purpose\n! They do not exist to inform or educate, but to deceive and distract the public, and defang negative public opinion.\nI don’t give a quantum of an airborne rodent’s posterior for “credibility”. I never have. I am interested in one thing: the truth. And when you’re dealing with sociopaths who are quite willing to do anything and everything within their power to obscure it, you have to expect the occasional dead end. But a dead end does not mean that you’ve reached the center of the maze, or that there are no monsters hiding somewhere inside it.",
  "tags": [
    "conspiracy",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-06T10:49:00+00:00"
}