{
  "url": "https://voxday.net/2016/11/12/how-god-emperor-already-saved-world/",
  "scraped_at": "2025-12-18T02:04:42.340109",
  "title": "How the God-Emperor ALREADY saved the world",
  "date_display": "November 12, 2016",
  "date_iso": "2016-11-12T16:00:00+00:00",
  "date_from_url": "2016-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have spoken to several Europeans in the aftermath of the US presidential election, and they’ve all been very curious about what happened, and how it was possible for Donald Trump to win when everything they had heard from their medias indicated that he was a) very, very bad, and, b) certain to lose by a huge margin.</p><p>Of course, they were even more deluded than the US electorate, as the European media took the already misleading US narrative and exaggerated it, just as the US media does the same thing in reverse.</p><p>What is interesting is their reaction to finding out that Hillary Clinton supported NATO membership for both Ukraine and Georgia. It can be best described as “aghast”. Learning about Hillary’s foreign policy on Russia also suffices to convince them that Donald Trump was, in fact, the vastly preferable candidate. One man even said, “well, no wonder he won, given that he was clearly running against a madwoman.”</p><p>Unlike Americans, Europeans take the idea of war with Russia very, very seriously and understand it is something to be absolutely avoided at almost all costs. There are still millions of people who remember the brutal swath that the Red Army cut across Eastern Europe on its way to Berlin. They also understand that a considerable quantity of the natural gas that heats their homes comes from Russia, and that the first consequence of any military action will be for that pipeline to be shut off.</p><p>Very, very few Americans or Europeans understood just how serious the danger that Hillary Clinton posed to the world was. First, <a href=\"http://112.international/politics/how-trump-and-clintons-stance-on-putins-russia-could-transform-future-us-support-for-ukraine-5163.html\">she supported NATO membership for Ukraine</a>:</p><blockquote class=\"tr_bq\"><p> The former U.S Secretary of State is a far more vocal critic of Vladimir Putin than her party rival Bernie Sanders. She has argued that Ukraine deserves more military equipment and training and financial aid (the latter dependent on the government’s ability to carry out the necessary reforms). The U.S. Democrat’s frontrunner for the White House has also urged other E.U. states to be more committed to sanctions and has supported the strengthening of ties between NATO and Ukraine (unlike Bernie Sanders who sees NATO expansion as a provocation against Russia).</p></blockquote><p>Second, <a href=\"https://investmentwatchblog.com/wtf-hillary-clinton-promises-nato-membership-to-georgia-russia-do-this-and-its-ww3/\">she supported NATO membership for Georgia</a>, who had already started and lost a brief war with Russia after being encouraged to join NATO in 2008.</p><blockquote class=\"tr_bq\"><p> U.S. Secretary of State Hillary Clinton said Washington will continue assistance to Georgia in the field of security and defense and supports country’s NATO membership. The Secretary spoke at the opening of the U.S.-Georgia Strategic Partnership Commission plenary session in Batumi, Georgia. Georgia is strategic partner of U.S. as regards the issues of regional and world security. She stressed that increase in combat readiness of Georgia and matching it with NATO standards continues within the framework of agreement reached by both countries’ presidents, Gruziya Online reports.</p></blockquote><p>Third, the woman who would likely have been Secretary of Defense under Hillary <a href=\"https://www.brookings.edu/research/preserving-ukraines-independence-resisting-russian-aggression-what-the-united-states-and-nato-must-do/\">favored direct military intervention in Syria</a> and called for spending $3 billion on <a href=\"https://www.brookings.edu/research/preserving-ukraines-independence-resisting-russian-aggression-what-the-united-states-and-nato-must-do/\">military assistance for Ukraine</a>.</p><blockquote class=\"tr_bq\"><p> The woman expected to run the Pentagon under Hillary Clinton said she would direct U.S. troops to push President Bashar al-Assad’s forces out of southern Syria and would send more American boots to fight the Islamic State in the region. Michele Flournoy, formerly the third-ranking civilian in the Pentagon under President Barack Obama, called for “limited military coercion” to help remove Assad from power in Syria, including a “no bombing” zone over parts of Syria held by U.S.-backed rebels. Flournoy, and several of her colleagues at the Center for New American Security, or CNAS, have been making the case for sending more American troops into combat against ISIS and the Assad regime than the Obama administration has been willing to commit.</p></blockquote><p>Meanwhile, Russia has consistently warned, since 2008 when Ukraine submitted a Membership Action Plan and Georgia indicated its desire to do so, that it would respond to any such actions by invading and conquering both countries. This is just one of the many implicit warnings delivered.</p><blockquote class=\"tr_bq\"><p> Admission of Ukraine and Georgia to NATO will place Europe on the verge of a large-scale crisis, Russia’s Permanent Representative to NATO added. “One can’t imagine the situation when those countries [Ukraine and Georgia] keep cherishing the hope to join NATO and the alliance really plans to admit them, as this would explode the situation and put Europe on the brink of a crisis, whose size and scale can’t be imagined today,” Grushko said.</p></blockquote><p>The warnings are not, as some foolish neocons insist, mere bluff. Russia has <i>already </i>invaded <i>both </i>countries for much smaller provocations than NATO membership. I strongly suspect that the troop movements that were taking place on both sides, which combined consisted of nearly one million troops, indicate that <a href=\"http://www.presstv.ir/DetailFr/2016/09/02/482839/US-Russia-Ukraine-sanctions-Crimea-NATO-KIev\">if Hillary Clinton had been elected President</a>, Putin would have ordered the invasion and occupation of Ukraine before January.</p><blockquote class=\"tr_bq\"><p> I think the idea was for Crimea to become a NATO base as part of this ongoing campaign to surround Russia which has clearly been in the works now for the last 25 years despite the fact that when the Soviet Union fell in 1991 and even before that, the end of the Warsaw Pact, there were assurances that were given to Russia that NATO would not move eastward. Twelve new countries have been added to NATO since that time and Ukraine would have been number 13 and would have been actually I believe the most dangerous from Russian point of view…. I think that it is clear that the United States is pursuing what it views as its interests as it always does, the United States government. In Syria, in the Middle East and in regard to Russia and we, I believe, are very likely to see an even more aggressive policy in Europe against Russia if Hillary Clinton and her entourage come into power with the November 8 election.</p></blockquote><p>For 25 years, the US has been <a href=\"http://www.defenseone.com/threats/2015/02/what-flournoy-and-friends-plan-arm-ukraines-army-fails-take-account/104466/\">knowingly playing a dangerous game</a>, trying to see how far they can push Russia without provoking it to war. As her record in Georgia, Libya and Syria clearly shows, Hillary has no strategic vision, no understanding of war, and would have almost certainly erred on the side of excess provocation.</p><blockquote class=\"tr_bq\"><p> Many congressional members say that Putin has not been deterred, but he has, to some degree, because if he wanted to he could order the full-scale invasion of the entirety of Ukrainian territory. That he has kept Russian direct personnel support for the separatists’ brutal aggression relatively small (1,000 military and intelligence personnel by recent NATO estimates) demonstrates that his decisions are rational (to him) and done with some awareness of the likely consequences.</p></blockquote><p>And that is why Donald Trump has been one of the most effective Presidents in U.S. history, even before he has taken office.</p></div>",
  "content_text": "I have spoken to several Europeans in the aftermath of the US presidential election, and they’ve all been very curious about what happened, and how it was possible for Donald Trump to win when everything they had heard from their medias indicated that he was a) very, very bad, and, b) certain to lose by a huge margin.\nOf course, they were even more deluded than the US electorate, as the European media took the already misleading US narrative and exaggerated it, just as the US media does the same thing in reverse.\nWhat is interesting is their reaction to finding out that Hillary Clinton supported NATO membership for both Ukraine and Georgia. It can be best described as “aghast”. Learning about Hillary’s foreign policy on Russia also suffices to convince them that Donald Trump was, in fact, the vastly preferable candidate. One man even said, “well, no wonder he won, given that he was clearly running against a madwoman.”\nUnlike Americans, Europeans take the idea of war with Russia very, very seriously and understand it is something to be absolutely avoided at almost all costs. There are still millions of people who remember the brutal swath that the Red Army cut across Eastern Europe on its way to Berlin. They also understand that a considerable quantity of the natural gas that heats their homes comes from Russia, and that the first consequence of any military action will be for that pipeline to be shut off.\nVery, very few Americans or Europeans understood just how serious the danger that Hillary Clinton posed to the world was. First,\nshe supported NATO membership for Ukraine\n:\nThe former U.S Secretary of State is a far more vocal critic of Vladimir Putin than her party rival Bernie Sanders. She has argued that Ukraine deserves more military equipment and training and financial aid (the latter dependent on the government’s ability to carry out the necessary reforms). The U.S. Democrat’s frontrunner for the White House has also urged other E.U. states to be more committed to sanctions and has supported the strengthening of ties between NATO and Ukraine (unlike Bernie Sanders who sees NATO expansion as a provocation against Russia).\nSecond,\nshe supported NATO membership for Georgia\n, who had already started and lost a brief war with Russia after being encouraged to join NATO in 2008.\nU.S. Secretary of State Hillary Clinton said Washington will continue assistance to Georgia in the field of security and defense and supports country’s NATO membership. The Secretary spoke at the opening of the U.S.-Georgia Strategic Partnership Commission plenary session in Batumi, Georgia. Georgia is strategic partner of U.S. as regards the issues of regional and world security. She stressed that increase in combat readiness of Georgia and matching it with NATO standards continues within the framework of agreement reached by both countries’ presidents, Gruziya Online reports.\nThird, the woman who would likely have been Secretary of Defense under Hillary\nfavored direct military intervention in Syria\nand called for spending $3 billion on\nmilitary assistance for Ukraine\n.\nThe woman expected to run the Pentagon under Hillary Clinton said she would direct U.S. troops to push President Bashar al-Assad’s forces out of southern Syria and would send more American boots to fight the Islamic State in the region. Michele Flournoy, formerly the third-ranking civilian in the Pentagon under President Barack Obama, called for “limited military coercion” to help remove Assad from power in Syria, including a “no bombing” zone over parts of Syria held by U.S.-backed rebels. Flournoy, and several of her colleagues at the Center for New American Security, or CNAS, have been making the case for sending more American troops into combat against ISIS and the Assad regime than the Obama administration has been willing to commit.\nMeanwhile, Russia has consistently warned, since 2008 when Ukraine submitted a Membership Action Plan and Georgia indicated its desire to do so, that it would respond to any such actions by invading and conquering both countries. This is just one of the many implicit warnings delivered.\nAdmission of Ukraine and Georgia to NATO will place Europe on the verge of a large-scale crisis, Russia’s Permanent Representative to NATO added. “One can’t imagine the situation when those countries [Ukraine and Georgia] keep cherishing the hope to join NATO and the alliance really plans to admit them, as this would explode the situation and put Europe on the brink of a crisis, whose size and scale can’t be imagined today,” Grushko said.\nThe warnings are not, as some foolish neocons insist, mere bluff. Russia has\nalready\ninvaded\nboth\ncountries for much smaller provocations than NATO membership. I strongly suspect that the troop movements that were taking place on both sides, which combined consisted of nearly one million troops, indicate that\nif Hillary Clinton had been elected President\n, Putin would have ordered the invasion and occupation of Ukraine before January.\nI think the idea was for Crimea to become a NATO base as part of this ongoing campaign to surround Russia which has clearly been in the works now for the last 25 years despite the fact that when the Soviet Union fell in 1991 and even before that, the end of the Warsaw Pact, there were assurances that were given to Russia that NATO would not move eastward. Twelve new countries have been added to NATO since that time and Ukraine would have been number 13 and would have been actually I believe the most dangerous from Russian point of view…. I think that it is clear that the United States is pursuing what it views as its interests as it always does, the United States government. In Syria, in the Middle East and in regard to Russia and we, I believe, are very likely to see an even more aggressive policy in Europe against Russia if Hillary Clinton and her entourage come into power with the November 8 election.\nFor 25 years, the US has been\nknowingly playing a dangerous game\n, trying to see how far they can push Russia without provoking it to war. As her record in Georgia, Libya and Syria clearly shows, Hillary has no strategic vision, no understanding of war, and would have almost certainly erred on the side of excess provocation.\nMany congressional members say that Putin has not been deterred, but he has, to some degree, because if he wanted to he could order the full-scale invasion of the entirety of Ukrainian territory. That he has kept Russian direct personnel support for the separatists’ brutal aggression relatively small (1,000 military and intelligence personnel by recent NATO estimates) demonstrates that his decisions are rational (to him) and done with some awareness of the likely consequences.\nAnd that is why Donald Trump has been one of the most effective Presidents in U.S. history, even before he has taken office.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-12T16:00:00+00:00"
}