{
  "url": "https://voxday.net/2016/11/29/illusion-and-observable-reality/",
  "scraped_at": "2025-12-18T02:07:49.301535",
  "title": "Illusion and observable reality",
  "date_display": "November 29, 2016",
  "date_iso": "2016-11-29T16:30:00+00:00",
  "date_from_url": "2016-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CybaC0NXEAAnv_l.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"208\" src=\"https://pbs.twimg.com/media/CybaC0NXEAAnv_l.jpg\" width=\"400\"/></a></div><p> The chart above is a Google Trends comparison between three writers, John Scalzi, Jim C. Hines, and myself. What is interesting about it is the way that it completely demolishes both the SF-SJW narrative as well as the idea that one’s only path to success runs through the gatekeepers.</p><p>Remember, the SF-SJW Narrative is that John Scalzi was hugely popular due to Whatever being the most popular blog in science fiction. Tor Books signed him because of that massive success, and he subsequently became one of the leading authors of science fiction, which led to his massive $2.3 million book contract and his status as the unquestioned #1 author at Tor Books, itself the #1 science fiction publisher. He presently stands astride science fiction like a snarky giant, the one true heir to Robert Heinlein, Philip K. Dick, H. Beam Piper, and Isaac Asimov, all in one.</p><p>That’s the Narrative, anyway. But as you can see, even at the time of my initial encounter with him in March 2005, his trend score was less than twice mine, at 26-17 the month before. And as we now know, he was always lying about his site traffic, exaggerating it by as much as a factor of 5x, although we should have known that by virtue of his lower-than expected Google Trend score.</p><p>Scalzi’s signing by Tor Books subsequently boosted his career, as the general growth, and two peaks in particular, demonstrate. But not even winning the Hugo, two major book tours, or the announcement of the biggest publicly announced book contract in science fiction was enough to help him break out and reach the level of a genuine leading author like Brandon Sanderson, and his <a href=\"https://www.google.com/trends/explore?date=all&amp;q=Whatever%20blog,Vox%20Popoli\">declining site traffic</a> actually has him trending well below where he was back in 2004. Sanderson’s current advantage is 54-12 and <a href=\"https://www.google.com/trends/explore?q=%2Fm%2F05p_v3,%2Fm%2F0675ss\">the 5-year average is 41-15</a>. As I have repeatedly observed, Scalzi is a midlist author masquerading as a leading author courtesy of an amenable authority named PNH.</p><p>He’ll surely get another spike when Tor starts pumping up his next book in earnest next spring, but that effect will fade away as quickly as the previous attempts have. And that is when you have the benefit of the biggest publisher in science fiction pushing you on the world! No wonder he admits to feeling like an imposter, it’s because he is an imposter. He has been from the start.</p><p>Now look at Jim C. Hines, a lesser Tor author who has desperately tried to follow in Scalzi’s footsteps through a combination of award-pimping and very loud virtue-signaling. Despite all McCreepy’s efforts, he has barely been able to move the needle despite 12 years of hard slogging. One has to rather marvel at his stubborn persistence in this regard, because most people would have figured out by now that their strategy was not working.</p><p>The funny thing is that Hines is one of the many SF-SJWs who have constantly tried to push the Narrative that I am irrelevant. But neither Google Analytics nor Google Trends lies. Whether pageviews, book sales, or interest over time is the metric, it is obvious that it is Hines who is the irrelevant party.</p><p>Now, here is where it gets interesting. In case you weren’t certain that the Hugo Awards were irrelevant, and that the gatekeepers are now toothless, here is a comparison of Hugo Award-winner and New York Times columnist N.K. Jemison, Hugo Award-winner Kameron Hurley, and an oft-No Awarded outsider nominally banned from the respectable ranks.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/Cybhu1pW8AAF4J3.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"216\" src=\"https://pbs.twimg.com/media/Cybhu1pW8AAF4J3.jpg\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://pbs.twimg.com/media/Cybhu1pW8AAF4J3.jpg\" decoding=\"async\" height=\"216\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20400%20216%22%3E%3C/svg%3E\" width=\"400\"/></a></div><p> That little spike on the red line, which only got Jemisin to within 6 points of where I was back in March 2005 when I first encountered PNH, TNH, and John Scalzi, is Jemisin’s much-ballyhooed Best Novel win. The effect has already worn off, of course, and Jemisin will likely return to her former obscurity quickly enough, as few of those unfortunate readers who sample her depressing, degenerate, award-winning work are likely to remain within her literary orbit for long.</p><p>But there are three larger lessons here than the fact that I am not above reminding SF-SJWs of their continuing inferiority and irrelevance. The first lesson is that you can NEVER trust an SJW narrative. They ALWAYS lie, and moreover, they will readily lie about things you can independently verify. Never take anything they say at face value. The SJW Narrative is that Jemisin, Hurley, and Hines are Important and Relevant Award-Winning Science Fiction Authors whereas I am a minor, vanity-published figure banished to the periphery, when the reality is that all of them sell fewer books than I do, all of them get considerably less site traffic than I do, and all of them <i>cumulatively </i>generate less than half the global interest I do.</p><p>The second lesson is the importance of building your own media platform and selecting your long-term partners carefully. As long as you are propped up by someone else, be it Tor Books, the New York Times, FoxNews, Universal Press Syndicate, or WorldNetDaily, you are going to be at least somewhat dependent upon them. That’s all right, as all of us need partners and allies, and it simply doesn’t make sense for most authors to try to become media savants and publishers as well as writers. Few of us are Mike Cernovich, Vaughn Heppner, or BV Larson.</p><p>There is nothing wrong with being helped, or working with a publisher, or taking advantage of a boost offered by someone else, unless it comes at a price you are unwilling to pay. But never confuse being helicoptered to the top of the mountain with climbing it on your own. It doesn’t make you a better climber.</p><p>The third lesson is that the gatekeepers are more interested in ideological conformity than in awareness, platform, or popularity. If you want to get signed by a science fiction publisher, you’re better off virtue-signaling on social media than building up a sizeable readership, a big Twitter following, or a popular blog. Of course, you’ll sell fewer books that way, but at least you’ll be able to enjoy the feeling that you’re a big-time author… right up until that fatal moment that you look at the Amazon rankings.</p></div>",
  "content_text": "The chart above is a Google Trends comparison between three writers, John Scalzi, Jim C. Hines, and myself. What is interesting about it is the way that it completely demolishes both the SF-SJW narrative as well as the idea that one’s only path to success runs through the gatekeepers.\nRemember, the SF-SJW Narrative is that John Scalzi was hugely popular due to Whatever being the most popular blog in science fiction. Tor Books signed him because of that massive success, and he subsequently became one of the leading authors of science fiction, which led to his massive $2.3 million book contract and his status as the unquestioned #1 author at Tor Books, itself the #1 science fiction publisher. He presently stands astride science fiction like a snarky giant, the one true heir to Robert Heinlein, Philip K. Dick, H. Beam Piper, and Isaac Asimov, all in one.\nThat’s the Narrative, anyway. But as you can see, even at the time of my initial encounter with him in March 2005, his trend score was less than twice mine, at 26-17 the month before. And as we now know, he was always lying about his site traffic, exaggerating it by as much as a factor of 5x, although we should have known that by virtue of his lower-than expected Google Trend score.\nScalzi’s signing by Tor Books subsequently boosted his career, as the general growth, and two peaks in particular, demonstrate. But not even winning the Hugo, two major book tours, or the announcement of the biggest publicly announced book contract in science fiction was enough to help him break out and reach the level of a genuine leading author like Brandon Sanderson, and his\ndeclining site traffic\nactually has him trending well below where he was back in 2004. Sanderson’s current advantage is 54-12 and\nthe 5-year average is 41-15\n. As I have repeatedly observed, Scalzi is a midlist author masquerading as a leading author courtesy of an amenable authority named PNH.\nHe’ll surely get another spike when Tor starts pumping up his next book in earnest next spring, but that effect will fade away as quickly as the previous attempts have. And that is when you have the benefit of the biggest publisher in science fiction pushing you on the world! No wonder he admits to feeling like an imposter, it’s because he is an imposter. He has been from the start.\nNow look at Jim C. Hines, a lesser Tor author who has desperately tried to follow in Scalzi’s footsteps through a combination of award-pimping and very loud virtue-signaling. Despite all McCreepy’s efforts, he has barely been able to move the needle despite 12 years of hard slogging. One has to rather marvel at his stubborn persistence in this regard, because most people would have figured out by now that their strategy was not working.\nThe funny thing is that Hines is one of the many SF-SJWs who have constantly tried to push the Narrative that I am irrelevant. But neither Google Analytics nor Google Trends lies. Whether pageviews, book sales, or interest over time is the metric, it is obvious that it is Hines who is the irrelevant party.\nNow, here is where it gets interesting. In case you weren’t certain that the Hugo Awards were irrelevant, and that the gatekeepers are now toothless, here is a comparison of Hugo Award-winner and New York Times columnist N.K. Jemison, Hugo Award-winner Kameron Hurley, and an oft-No Awarded outsider nominally banned from the respectable ranks.\nThat little spike on the red line, which only got Jemisin to within 6 points of where I was back in March 2005 when I first encountered PNH, TNH, and John Scalzi, is Jemisin’s much-ballyhooed Best Novel win. The effect has already worn off, of course, and Jemisin will likely return to her former obscurity quickly enough, as few of those unfortunate readers who sample her depressing, degenerate, award-winning work are likely to remain within her literary orbit for long.\nBut there are three larger lessons here than the fact that I am not above reminding SF-SJWs of their continuing inferiority and irrelevance. The first lesson is that you can NEVER trust an SJW narrative. They ALWAYS lie, and moreover, they will readily lie about things you can independently verify. Never take anything they say at face value. The SJW Narrative is that Jemisin, Hurley, and Hines are Important and Relevant Award-Winning Science Fiction Authors whereas I am a minor, vanity-published figure banished to the periphery, when the reality is that all of them sell fewer books than I do, all of them get considerably less site traffic than I do, and all of them\ncumulatively\ngenerate less than half the global interest I do.\nThe second lesson is the importance of building your own media platform and selecting your long-term partners carefully. As long as you are propped up by someone else, be it Tor Books, the New York Times, FoxNews, Universal Press Syndicate, or WorldNetDaily, you are going to be at least somewhat dependent upon them. That’s all right, as all of us need partners and allies, and it simply doesn’t make sense for most authors to try to become media savants and publishers as well as writers. Few of us are Mike Cernovich, Vaughn Heppner, or BV Larson.\nThere is nothing wrong with being helped, or working with a publisher, or taking advantage of a boost offered by someone else, unless it comes at a price you are unwilling to pay. But never confuse being helicoptered to the top of the mountain with climbing it on your own. It doesn’t make you a better climber.\nThe third lesson is that the gatekeepers are more interested in ideological conformity than in awareness, platform, or popularity. If you want to get signed by a science fiction publisher, you’re better off virtue-signaling on social media than building up a sizeable readership, a big Twitter following, or a popular blog. Of course, you’ll sell fewer books that way, but at least you’ll be able to enjoy the feeling that you’re a big-time author… right up until that fatal moment that you look at the Amazon rankings.",
  "tags": [
    "Hugo Award",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-29T16:30:00+00:00"
}