{
  "url": "https://voxday.net/2016/11/07/mailvox-material-evi/",
  "scraped_at": "2025-12-18T02:03:36.817151",
  "title": "Mailvox: material evil",
  "date_display": "November 7, 2016",
  "date_iso": "2016-11-07T09:57:00+00:00",
  "date_from_url": "2016-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An email from a reader who explains that he believes in material evil as a result of his youthful encounter <a href=\"http://www.abc.net.au/news/2015-11-03/royal-commission-into-institutional-child-sexual-abuse-hearing/6907532\">with a pedophile</a>:</p><blockquote><p> People need to know about the extraordinary power that some pedophiles have over other people, and the damage they do. I will omit the strange story of my recovery. I’ve been trying to find more information on that for years. You are more likely to be able to shed light on it than anyone I’ve asked before.</p><p>When I was in high school, the headmaster hired a new school counselor, Kevin John Lynch, not knowing that Lynch was a dangerous and prolific pedophile.</p><p>Few people grasp the true nature of these creatures. Lynch had charisma beyond anything I have encountered before or since. Some were suspicious of him, but for others he seemed to radiate an enchantment field that gripped you viscerally. He had the headmaster wrapped around his little finger, fending off complaints about him for years without ever realising that there may be a reason for them. Lynch was a psychological chameleon; he could become whoever he needed to be in order to gain the advantage over his intended victim.</p><p>People who have never encountered a creature like Lynch cannot comprehend how dangerous and destructive they are. Lynch severely abused at least a thousand boys from the seventies until his downfall in the nineties. I have met some of these people, now grown men. Imagine that something had sucked the life force from someone, leaving behind a husk in place of the complete human being that they once were. Suicide is a common escape for these men. Many live in poverty and their lives are chaotic.</p><p>Lynch could make teenage boys do extraordinary things, not by force, but by telling them what to do. He made two boys, who didn’t know each other, perform a sexual act together in his office. Later they ‘woke up’ to the wrongness of it, found each other and reported the incident. For this the headmaster punished them.</p><p>The greatest problem for the victims was that nobody believed these things were possible. One mother, after her son told her what Lynch did years before, deposited him at a homeless shelter and cut off all contact. I met a man who’s lawyer had rescued him from a mental institution. The man had seen a psychiatrist, who committed him for being psychotic, believing that the things he spoke of don’t happen in the real world.</p><p>Lynch was active for over twenty years. Now the full story has emerged in great detail at a public inquiry.</p><p>Fortunately Lynch did not get very far with me. Still, being groomed by a pedophile authority figure was a disturbing position for a teenager to be in. I had severe psychological trauma after I left that school. And my brother, who also had ‘counseling’ with Lynch, and reported that Lynch never touched him, nevertheless ended up like the other victims — destroyed.</p><p>My recovery began suddenly, overnight, in my mid-thirties, accompanied by a profound personality shift. This remains unexplained, as I found that psychologists and others have either never heard anything like it or just find it weird. The sudden ‘awakening’ began a long healing process. The strangest part was that, every winter for three years, one day I would feel the need to retreat to my room, and there I would experience a grueling phenomenon, during which I felt the expulsion of something intangible from my body. Evil is the best word to describe my feeling about what was expelled.</p><p>I was so drained of energy after each of these events that I was ill for about two weeks after. In the fourth year it was mild, and this year nothing much happened at all. Now I feel normal for the first time since childhood, and seem to be embarking on a normal life, something I never expected to have.</p><p>I am not a Christian. My background is in atheism, science, rational thought and skepticism. After my first experience of this phenomenon, I realized the Christian notion of exorcism was the only similar story I’d heard of. However, I know little about exorcism in Christianity.</p><p>When you said that you believe in material evil, my first thought was of Lynch. He went about his acts of depravity with conscious, wilful intent. It was his day job. If anyone is wondering whether pedophiles could work their way up to powerful positions — yes, some have exactly the talents required. Lynch was small-time, but he was a shrunken, ugly wretch. Someone smarter, better looking and with better connections than him could go very far. I don’t know if Lynch was born evil or if others turned him into the creature that he was. But from what I’ve seen of the Podesta emails and the ‘pizza’ shop, I believe that these are the same kinds of people.</p><p>If you know of anything similar to this story, either from Christianity or elsewhere, please let me know. I have been pondering the meaning of all of this lately, including what you said about Christianity accounting for material evil. My experience suggests that it does exist. I am not an atheist anymore. I don’t know what I believe these days.</p></blockquote><p>I suspect that Lynch was infested with what the Bible describes as “unclean spirits” and that he passed them off to the boys with whom he came in contact, whether he managed to molest them or not. The fact that he used to “hypnotise” them indicates his involvement with the occult; both hypnotism and drugs can serve as opening a spiritual door to the affected mind. I recommend that the reader, regardless of what he believes, behave as if the Bible’s account of Jesus Christ and demons are true, meditate on the Word of God, thank God for his deliverence, and pray daily for continued restoration for himself and the other victims.</p><p>As to why the reader got better despite his lack of belief, perhaps someone was praying for him, perhaps the unclean spirit got bored – they are varying degrees of intelligent, you see – or perhaps it was simply God’s will that he be cleansed of the spiritual filth. But his experience, and the inability of the average person to even begin to believe what he and the other victims were experiencing at the time, demonstrates how Lynch, and how people like the Podestas, are able to get away with their evil practices in full sight of a world that does not believe in evil.</p><p>If you think this all sounds stupid or ridiculous, that’s fine. You’re not the first to feel that way, and if one day you change your mind upon actually encountering the spiritual world, <a href=\"http://www.vanityfair.com/hollywood/2016/10/father-amorth-the-vatican-exorcist\">you won’t be the first to do that either</a>.</p><blockquote><p> I showed the video of Rosa’s exorcism to two of the world’s leading neurosurgeons and researchers in California and to a group of prominent psychiatrists in New York.</p><p>Dr. Neil Martin is chief of neurosurgery at the UCLA Medical Center. He has performed more than 5,000 brain surgeries and is regularly cited as in the top 1 percent of his specialty. On August 3, I showed him the video of Rosa’s exorcism. This is his response: “Absolutely amazing. There’s a major force at work within her somehow. I don’t know the underlying origin of it. She’s not separated from the environment. She’s not in a catatonic state. She’s responding to the priest and is aware of the context. The energy she shows is amazing. The priest on the right is struggling to control her. He’s holding her down, as are the others, and the sweat is dripping off his face at a time when she’s not sweating. This doesn’t seem to be hallucinations. She appears to be engaged in the process but resisting. You can see she has no ability to pull herself back.”</p><p>I asked Dr. Martin if this was some kind of brain disorder. “It doesn’t look like schizophrenia or epilepsy,” he said. “It could be delirium, an agitated disconnection from normal behavior. But the powerful verbalization we’re hearing, that’s not what you get with delirium. With delirium you see the struggling, maybe the yelling, but this guttural voice seems like it’s coming from someplace else. I’ve done thousands of surgeries, on brain tumors, traumatic brain injuries, ruptured brain aneurysms, infections affecting the brain, and I haven’t seen this kind of consequence from any of those disorders. This goes beyond anything I’ve ever experienced—that’s for certain.”</p><p>I also showed the video to Dr. Itzhak Fried, a neurosurgeon and clinical specialist in epilepsy surgery, seizure disorder, and the study of human memory. He is based at both UCLA and the Tel-Aviv Sourasky Medical Center. This was his conclusion: “It looks like something authentic. She is like a caged animal. I don’t think there’s a loss of consciousness or contact, because she’s in contact with the people. She appears to respond to the people who talk to her. It’s a striking change in behavior. I believe everything originates in the brain. So which part of the brain could serve this type of behavior? The limbic system, which has to do with emotional processing of stimuli, and the temporal lobe. I don’t see this as epilepsy. It’s not necessarily a lesion. It’s a physiological state. It seems to be associated with religious things. In the temporal lobe there’s something called hyper-religiosity. You probably won’t have this in somebody who has no religious background. Can I characterize it? Maybe. Can I treat it? No.”</p><p>I asked Dr. Fried if he believed in God, and he took a long pause before answering: “I do believe there is a limit to human understanding. Beyond this limit, I’m willing to recognize an entity called God.”</p><p>The reaction of the neurosurgeons took me by surprise. I had expected they would quickly dismiss Rosa’s symptoms as madness or unintentional fraud or suggest that she might be cured by brain surgery. They did not.</p><p>They wouldn’t come out and say, “Of course this woman is possessed by Satan,” but they seemed baffled as to how to define her ailment, and both agreed it was not something they would attempt to cure with surgery.</p></blockquote><p>Three things I found particularly interesting about the Vanity Fair piece:</p><ul><li>The real scientists take it seriously. The charlatans project their own fraud and refuse to do so. </li><li>Father Amorth observes that Satan still rules this world, as Jesus and Paul both separately observed.</li><li>The demon still fears the late exorcist even after his death. Perhaps praying to the saints for their intercession is nothing more than a legitimate request for assistance, not a paganesque form of idolatry or ancestor worship.</li></ul></div>",
  "content_text": "An email from a reader who explains that he believes in material evil as a result of his youthful encounter\nwith a pedophile\n:\nPeople need to know about the extraordinary power that some pedophiles have over other people, and the damage they do. I will omit the strange story of my recovery. I’ve been trying to find more information on that for years. You are more likely to be able to shed light on it than anyone I’ve asked before.\nWhen I was in high school, the headmaster hired a new school counselor, Kevin John Lynch, not knowing that Lynch was a dangerous and prolific pedophile.\nFew people grasp the true nature of these creatures. Lynch had charisma beyond anything I have encountered before or since. Some were suspicious of him, but for others he seemed to radiate an enchantment field that gripped you viscerally. He had the headmaster wrapped around his little finger, fending off complaints about him for years without ever realising that there may be a reason for them. Lynch was a psychological chameleon; he could become whoever he needed to be in order to gain the advantage over his intended victim.\nPeople who have never encountered a creature like Lynch cannot comprehend how dangerous and destructive they are. Lynch severely abused at least a thousand boys from the seventies until his downfall in the nineties. I have met some of these people, now grown men. Imagine that something had sucked the life force from someone, leaving behind a husk in place of the complete human being that they once were. Suicide is a common escape for these men. Many live in poverty and their lives are chaotic.\nLynch could make teenage boys do extraordinary things, not by force, but by telling them what to do. He made two boys, who didn’t know each other, perform a sexual act together in his office. Later they ‘woke up’ to the wrongness of it, found each other and reported the incident. For this the headmaster punished them.\nThe greatest problem for the victims was that nobody believed these things were possible. One mother, after her son told her what Lynch did years before, deposited him at a homeless shelter and cut off all contact. I met a man who’s lawyer had rescued him from a mental institution. The man had seen a psychiatrist, who committed him for being psychotic, believing that the things he spoke of don’t happen in the real world.\nLynch was active for over twenty years. Now the full story has emerged in great detail at a public inquiry.\nFortunately Lynch did not get very far with me. Still, being groomed by a pedophile authority figure was a disturbing position for a teenager to be in. I had severe psychological trauma after I left that school. And my brother, who also had ‘counseling’ with Lynch, and reported that Lynch never touched him, nevertheless ended up like the other victims — destroyed.\nMy recovery began suddenly, overnight, in my mid-thirties, accompanied by a profound personality shift. This remains unexplained, as I found that psychologists and others have either never heard anything like it or just find it weird. The sudden ‘awakening’ began a long healing process. The strangest part was that, every winter for three years, one day I would feel the need to retreat to my room, and there I would experience a grueling phenomenon, during which I felt the expulsion of something intangible from my body. Evil is the best word to describe my feeling about what was expelled.\nI was so drained of energy after each of these events that I was ill for about two weeks after. In the fourth year it was mild, and this year nothing much happened at all. Now I feel normal for the first time since childhood, and seem to be embarking on a normal life, something I never expected to have.\nI am not a Christian. My background is in atheism, science, rational thought and skepticism. After my first experience of this phenomenon, I realized the Christian notion of exorcism was the only similar story I’d heard of. However, I know little about exorcism in Christianity.\nWhen you said that you believe in material evil, my first thought was of Lynch. He went about his acts of depravity with conscious, wilful intent. It was his day job. If anyone is wondering whether pedophiles could work their way up to powerful positions — yes, some have exactly the talents required. Lynch was small-time, but he was a shrunken, ugly wretch. Someone smarter, better looking and with better connections than him could go very far. I don’t know if Lynch was born evil or if others turned him into the creature that he was. But from what I’ve seen of the Podesta emails and the ‘pizza’ shop, I believe that these are the same kinds of people.\nIf you know of anything similar to this story, either from Christianity or elsewhere, please let me know. I have been pondering the meaning of all of this lately, including what you said about Christianity accounting for material evil. My experience suggests that it does exist. I am not an atheist anymore. I don’t know what I believe these days.\nI suspect that Lynch was infested with what the Bible describes as “unclean spirits” and that he passed them off to the boys with whom he came in contact, whether he managed to molest them or not. The fact that he used to “hypnotise” them indicates his involvement with the occult; both hypnotism and drugs can serve as opening a spiritual door to the affected mind. I recommend that the reader, regardless of what he believes, behave as if the Bible’s account of Jesus Christ and demons are true, meditate on the Word of God, thank God for his deliverence, and pray daily for continued restoration for himself and the other victims.\nAs to why the reader got better despite his lack of belief, perhaps someone was praying for him, perhaps the unclean spirit got bored – they are varying degrees of intelligent, you see – or perhaps it was simply God’s will that he be cleansed of the spiritual filth. But his experience, and the inability of the average person to even begin to believe what he and the other victims were experiencing at the time, demonstrates how Lynch, and how people like the Podestas, are able to get away with their evil practices in full sight of a world that does not believe in evil.\nIf you think this all sounds stupid or ridiculous, that’s fine. You’re not the first to feel that way, and if one day you change your mind upon actually encountering the spiritual world,\nyou won’t be the first to do that either\n.\nI showed the video of Rosa’s exorcism to two of the world’s leading neurosurgeons and researchers in California and to a group of prominent psychiatrists in New York.\nDr. Neil Martin is chief of neurosurgery at the UCLA Medical Center. He has performed more than 5,000 brain surgeries and is regularly cited as in the top 1 percent of his specialty. On August 3, I showed him the video of Rosa’s exorcism. This is his response: “Absolutely amazing. There’s a major force at work within her somehow. I don’t know the underlying origin of it. She’s not separated from the environment. She’s not in a catatonic state. She’s responding to the priest and is aware of the context. The energy she shows is amazing. The priest on the right is struggling to control her. He’s holding her down, as are the others, and the sweat is dripping off his face at a time when she’s not sweating. This doesn’t seem to be hallucinations. She appears to be engaged in the process but resisting. You can see she has no ability to pull herself back.”\nI asked Dr. Martin if this was some kind of brain disorder. “It doesn’t look like schizophrenia or epilepsy,” he said. “It could be delirium, an agitated disconnection from normal behavior. But the powerful verbalization we’re hearing, that’s not what you get with delirium. With delirium you see the struggling, maybe the yelling, but this guttural voice seems like it’s coming from someplace else. I’ve done thousands of surgeries, on brain tumors, traumatic brain injuries, ruptured brain aneurysms, infections affecting the brain, and I haven’t seen this kind of consequence from any of those disorders. This goes beyond anything I’ve ever experienced—that’s for certain.”\nI also showed the video to Dr. Itzhak Fried, a neurosurgeon and clinical specialist in epilepsy surgery, seizure disorder, and the study of human memory. He is based at both UCLA and the Tel-Aviv Sourasky Medical Center. This was his conclusion: “It looks like something authentic. She is like a caged animal. I don’t think there’s a loss of consciousness or contact, because she’s in contact with the people. She appears to respond to the people who talk to her. It’s a striking change in behavior. I believe everything originates in the brain. So which part of the brain could serve this type of behavior? The limbic system, which has to do with emotional processing of stimuli, and the temporal lobe. I don’t see this as epilepsy. It’s not necessarily a lesion. It’s a physiological state. It seems to be associated with religious things. In the temporal lobe there’s something called hyper-religiosity. You probably won’t have this in somebody who has no religious background. Can I characterize it? Maybe. Can I treat it? No.”\nI asked Dr. Fried if he believed in God, and he took a long pause before answering: “I do believe there is a limit to human understanding. Beyond this limit, I’m willing to recognize an entity called God.”\nThe reaction of the neurosurgeons took me by surprise. I had expected they would quickly dismiss Rosa’s symptoms as madness or unintentional fraud or suggest that she might be cured by brain surgery. They did not.\nThey wouldn’t come out and say, “Of course this woman is possessed by Satan,” but they seemed baffled as to how to define her ailment, and both agreed it was not something they would attempt to cure with surgery.\nThree things I found particularly interesting about the Vanity Fair piece:\nThe real scientists take it seriously. The charlatans project their own fraud and refuse to do so.\nFather Amorth observes that Satan still rules this world, as Jesus and Paul both separately observed.\nThe demon still fears the late exorcist even after his death. Perhaps praying to the saints for their intercession is nothing more than a legitimate request for assistance, not a paganesque form of idolatry or ancestor worship.",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-07T09:57:00+00:00"
}