{
  "url": "https://voxday.net/2016/11/01/mailvox-alternative-comey-scrip/",
  "scraped_at": "2025-12-18T02:02:22.651795",
  "title": "Mailvox: an alternative Comey script",
  "date_display": "November 1, 2016",
  "date_iso": "2016-11-01T12:30:00+00:00",
  "date_from_url": "2016-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As opposed to Scott Adams Two Bullets for the Republic story or my own Another Chance at Redemption movie, we are given The Puppet’s Whitewash:</p><blockquote><p> Here’s how the current bogus Comey/Huma/Weiner email scandal scam works:</p><p>Re those Wiener emails that everyone’s foolishly talking about while the sold-out media deliberately ignores the ongoing Julian releases (which are actually much more important), some important facts first, any of which is a dead giveaway of what’s ACTUALLY going on:</p><p>Specifically, director Comey has been attending daily meetings at the white house all along (which would be rather unusual if he’s actually about to dump something damaging which could implicate the white house as well as destroy Hillary and the entire Democratic party) and, of course, Hillary has been demanding that they release those new Weiner emails immediately (which is ridiculous for several incredibly obvious reasons).</p><p>The fact that Comey is continuing to visit the white house daily in the midst of this new supposed “scandal” is the first obvious giveaway, but Hillary demanding that they release those emails is the second less obvious giveaway until you realize several very, VERY important and obvious things:</p><p>Unlike any Julian material, those emails are in the possession of bought-and-sold-Hillary-flunky director Comey.</p><p>Also, legally, if there is a valid investigation under way, he CAN NOT release evidence in an ongoing case.  Hillary realizes this too (which makes her calls to release the emails kind of silly, but it plays really well to an ignorant audience who doesn’t know the law).</p><p>However, Hillary CAN LEGALLY release those emails whenever she wants – they’re her property, after all, and she is under no legal obligation to keep them under wraps.  Indeed, if they’re full of crap, by releasing them NOW, it instantly ends the scandal.</p><p>Of course, that is the last thing they want.  So here’s how it works:</p><p>The reason Hillary is demanding the immediate release of those emails is because she already knows that her slave Comey has gone through them with a fine-toothed comb and very carefully edited out ANYTHING which might actually be illegal while leaving in just enough to make Hillary look merely “careless” again.</p><p>Why?</p><p>Because he (representing the FBI) will release those emails just before election day, and then the Hillary camp will point at them and say, “Look, there’s actually NOTHING criminal here at all and I am now vindicated by no less than the FBI!”</p><p>She’ll then follow up with a knockout punch by proclaiming that it was an unfair Trump witchhunt all along and that Trump knew it all along and yet he still persecuted her unfairly, bringing up the emails continuously in a sleazy and unethical attempt to unfairly bring her down.  Suddenly outraged and now motivated (which they’re currently not), even reluctant Hillary voters suddenly rush the polls, voting her into office while the Trump supporters slink away in embarrassed (and non-voting) silence.</p><p>So, bottom line, it’s a trap and Comey is complicit in it and so are the media (as usual), and not only does it set up a trap but it also distracts the public from the ongoing tsunami of the continuing Julian data dumps (which are FAR more important as they’re not under the control of a loyal Hillary slave like Comey, and therefore the Julian emails are real while the Comey emails are being manipulated and edited in Hillary’s favor as I type this).</p><p>That said, however, it’s actually a pretty good strategy:  all you have to do is have Comey complicit in every step and it becomes a pretty good game of chess complete with inevitable checkmate.  And in the meantime, Hillary and her supporters keep screaming intense outrage and cursing Comey while the inner circle, of course, already knows what’s going on (like I said, Comey going to the white house every day, even now).  But I would like to take this moment to nominate Hillary for an Emmy and Oscar – good acting deserves an award.</p><p>And the final proof:  if Comey has betrayed her and the dems with “his” deliberate and intentional bringing up the emails just before the election, and if they were, in fact, as terrible as Hillary and the dems claim they are, then Obama would despise Comey for destroying the election.  So what did the Prez <a href=\"http://townhall.com/tipsheet/katiepavlich/2016/10/31/white-house-comey-is-a-man-of-integrity-n2239619\">do today?</a></p><p>Remember, this is from the President himself while the rest of the dems run about in mock horror and outrage, with Hillary herself continues to act like she’s really, REALLY furious at Comey while simultaneously demanding that the emails be made public because she knows Comey has already edited them in her favor.  And keeping that in mind, so if the emails are so damaging, WHY would President Obama put in a good word for Comey who just restarted the investigation into those oh-so-damaging emails?  Why would President Obama show support for Comey when he has so clearly destroyed Hillary and the Democratic party?</p><p>But hang on – one more piece:  guess who will be deciding whether or not to take any legal action at all regarding those emails?  Answer:  the most corrupt Justice Department in the history of the United States who also just happen to be totally rock solid Hillary supporters:</p><p>LOL!  Could they be any more OBVIOUS?!   If the voters fall for this HUGE scam, they’re really are as stupid as Hillary says they are in all of her emails and text messages.  And the Republicans have obviously taken the bait, hook line and sinker which, by definition, makes them complete retards for falling for this obvious trap.</p><p>This is how the Comey/Huma/Weiner scam works.  It’s a trick.  It’s a trap.  Case proven, Q.E.D.</p></blockquote><p>Color me dubious. First, some of the basic facts are wrong. Most of the emails are not Hillary’s. She can’t release Huma’s emails, Weiner’s emails, or any other files from the computer, and she probably has no idea what most of them are. Even Huma apparently doesn’t know what is on the laptop, which belongs to her husband, not her.</p><p>Second, this version of the story assumes that Obama wants to protect Hillary Clinton. I very much doubt that. He doesn’t care about her and he doesn’t care about the Democratic Party. Third, this version of the story ignores the most important aspect of the situation, which is the internal pressure at the FBI and the fact that the New York FBI office was in possession of the laptop for some time and presumably has copies of all the emails as well.</p><p>If there was nothing in the original emails, why was there so much anger directed at Comey when he refused to recommend prosecution? And if the new emails were selectively edited and released in support of a whitewash, that would risk blowing the whole defend-Hillary conspiracy wide open and taking down everyone associated with it. Would <i>you </i>want to bet everything on the assumption that no one at either the NYPD or the New York FBI has a complete set of the emails from that laptop? Remember, we’re talking about criminals here, and criminals tend to project their own criminality on others.</p><p>Copying the emails is the very first thing that any corrupt official would do, whether the law permitted it or not, and I would assume that there are multiple copies of the complete set now floating around. I wouldn’t be surprised if both the Trump campaign and WikiLeaks already have their own sets.</p><p>Now, why would Obama put in a good word for Comey? My interpretation of his statement is that it was a signal to the media and the entire Democratic Party that he is hanging Hillary, and by extension the whole Clinton machine, out to dry. I think he’s entirely willing to let the chips fall where they may. He’s not involved, he knows he’s not involved, and I suspect it would give him a good deal of satisfaction to see his former Secretary of State, whose inept foreign policy has ruined his legacy, finally receive her comeuppance. Remember, these people do <i>not </i>like each other.</p><p>We’ll see who is closer to correct soon enough. If the emailer is right, we’ll see a public whitewashing from Comey later this week. If I’m right, this week will see more and more prominent media figures pulling long faces and declaring that Hillary is unsuitable for the presidency as her poll numbers collapse.</p></div>",
  "content_text": "As opposed to Scott Adams Two Bullets for the Republic story or my own Another Chance at Redemption movie, we are given The Puppet’s Whitewash:\nHere’s how the current bogus Comey/Huma/Weiner email scandal scam works:\nRe those Wiener emails that everyone’s foolishly talking about while the sold-out media deliberately ignores the ongoing Julian releases (which are actually much more important), some important facts first, any of which is a dead giveaway of what’s ACTUALLY going on:\nSpecifically, director Comey has been attending daily meetings at the white house all along (which would be rather unusual if he’s actually about to dump something damaging which could implicate the white house as well as destroy Hillary and the entire Democratic party) and, of course, Hillary has been demanding that they release those new Weiner emails immediately (which is ridiculous for several incredibly obvious reasons).\nThe fact that Comey is continuing to visit the white house daily in the midst of this new supposed “scandal” is the first obvious giveaway, but Hillary demanding that they release those emails is the second less obvious giveaway until you realize several very, VERY important and obvious things:\nUnlike any Julian material, those emails are in the possession of bought-and-sold-Hillary-flunky director Comey.\nAlso, legally, if there is a valid investigation under way, he CAN NOT release evidence in an ongoing case.  Hillary realizes this too (which makes her calls to release the emails kind of silly, but it plays really well to an ignorant audience who doesn’t know the law).\nHowever, Hillary CAN LEGALLY release those emails whenever she wants – they’re her property, after all, and she is under no legal obligation to keep them under wraps.  Indeed, if they’re full of crap, by releasing them NOW, it instantly ends the scandal.\nOf course, that is the last thing they want.  So here’s how it works:\nThe reason Hillary is demanding the immediate release of those emails is because she already knows that her slave Comey has gone through them with a fine-toothed comb and very carefully edited out ANYTHING which might actually be illegal while leaving in just enough to make Hillary look merely “careless” again.\nWhy?\nBecause he (representing the FBI) will release those emails just before election day, and then the Hillary camp will point at them and say, “Look, there’s actually NOTHING criminal here at all and I am now vindicated by no less than the FBI!”\nShe’ll then follow up with a knockout punch by proclaiming that it was an unfair Trump witchhunt all along and that Trump knew it all along and yet he still persecuted her unfairly, bringing up the emails continuously in a sleazy and unethical attempt to unfairly bring her down.  Suddenly outraged and now motivated (which they’re currently not), even reluctant Hillary voters suddenly rush the polls, voting her into office while the Trump supporters slink away in embarrassed (and non-voting) silence.\nSo, bottom line, it’s a trap and Comey is complicit in it and so are the media (as usual), and not only does it set up a trap but it also distracts the public from the ongoing tsunami of the continuing Julian data dumps (which are FAR more important as they’re not under the control of a loyal Hillary slave like Comey, and therefore the Julian emails are real while the Comey emails are being manipulated and edited in Hillary’s favor as I type this).\nThat said, however, it’s actually a pretty good strategy:  all you have to do is have Comey complicit in every step and it becomes a pretty good game of chess complete with inevitable checkmate.  And in the meantime, Hillary and her supporters keep screaming intense outrage and cursing Comey while the inner circle, of course, already knows what’s going on (like I said, Comey going to the white house every day, even now).  But I would like to take this moment to nominate Hillary for an Emmy and Oscar – good acting deserves an award.\nAnd the final proof:  if Comey has betrayed her and the dems with “his” deliberate and intentional bringing up the emails just before the election, and if they were, in fact, as terrible as Hillary and the dems claim they are, then Obama would despise Comey for destroying the election.  So what did the Prez\ndo today?\nRemember, this is from the President himself while the rest of the dems run about in mock horror and outrage, with Hillary herself continues to act like she’s really, REALLY furious at Comey while simultaneously demanding that the emails be made public because she knows Comey has already edited them in her favor.  And keeping that in mind, so if the emails are so damaging, WHY would President Obama put in a good word for Comey who just restarted the investigation into those oh-so-damaging emails?  Why would President Obama show support for Comey when he has so clearly destroyed Hillary and the Democratic party?\nBut hang on – one more piece:  guess who will be deciding whether or not to take any legal action at all regarding those emails?  Answer:  the most corrupt Justice Department in the history of the United States who also just happen to be totally rock solid Hillary supporters:\nLOL!  Could they be any more OBVIOUS?!   If the voters fall for this HUGE scam, they’re really are as stupid as Hillary says they are in all of her emails and text messages.  And the Republicans have obviously taken the bait, hook line and sinker which, by definition, makes them complete retards for falling for this obvious trap.\nThis is how the Comey/Huma/Weiner scam works.  It’s a trick.  It’s a trap.  Case proven, Q.E.D.\nColor me dubious. First, some of the basic facts are wrong. Most of the emails are not Hillary’s. She can’t release Huma’s emails, Weiner’s emails, or any other files from the computer, and she probably has no idea what most of them are. Even Huma apparently doesn’t know what is on the laptop, which belongs to her husband, not her.\nSecond, this version of the story assumes that Obama wants to protect Hillary Clinton. I very much doubt that. He doesn’t care about her and he doesn’t care about the Democratic Party. Third, this version of the story ignores the most important aspect of the situation, which is the internal pressure at the FBI and the fact that the New York FBI office was in possession of the laptop for some time and presumably has copies of all the emails as well.\nIf there was nothing in the original emails, why was there so much anger directed at Comey when he refused to recommend prosecution? And if the new emails were selectively edited and released in support of a whitewash, that would risk blowing the whole defend-Hillary conspiracy wide open and taking down everyone associated with it. Would\nyou\nwant to bet everything on the assumption that no one at either the NYPD or the New York FBI has a complete set of the emails from that laptop? Remember, we’re talking about criminals here, and criminals tend to project their own criminality on others.\nCopying the emails is the very first thing that any corrupt official would do, whether the law permitted it or not, and I would assume that there are multiple copies of the complete set now floating around. I wouldn’t be surprised if both the Trump campaign and WikiLeaks already have their own sets.\nNow, why would Obama put in a good word for Comey? My interpretation of his statement is that it was a signal to the media and the entire Democratic Party that he is hanging Hillary, and by extension the whole Clinton machine, out to dry. I think he’s entirely willing to let the chips fall where they may. He’s not involved, he knows he’s not involved, and I suspect it would give him a good deal of satisfaction to see his former Secretary of State, whose inept foreign policy has ruined his legacy, finally receive her comeuppance. Remember, these people do\nnot\nlike each other.\nWe’ll see who is closer to correct soon enough. If the emailer is right, we’ll see a public whitewashing from Comey later this week. If I’m right, this week will see more and more prominent media figures pulling long faces and declaring that Hillary is unsuitable for the presidency as her poll numbers collapse.",
  "tags": [
    "conspiracy",
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-01T12:30:00+00:00"
}