{
  "url": "https://voxday.net/2016/11/04/mailvox-election-and-non-problem-of-evi/",
  "scraped_at": "2025-12-18T02:03:02.639712",
  "title": "Mailvox: the election and the non-problem of evil",
  "date_display": "November 4, 2016",
  "date_iso": "2016-11-04T13:00:00+00:00",
  "date_from_url": "2016-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>11/4 notes a conceptual connection:</p><blockquote><p> Vox, in your AMA you said you became Christian after discovering Evil exists.</p><p>This shit just about has me reading a damn Bible, which even 2 years ago I would have scoffed at.</p><p>No formal definition is necessary. You see the pattern and know.</p><p>I wonder, if all of this comes out, will many other Americans react the same way. Could there be a religious revival under Trump?</p></blockquote><p>It’s not impossible. I’ve stated in the past that one reason I left the USA was due to my momentary glimpse into the social circles of power there. I met Donald Trump in passing back in 1988, as a consequence of a brief relationship with someone who was on the outskirts of those circles. And I had an amount of other exposure to various people in positions of not-insignificant power.</p><p>I didn’t, and I don’t, actually KNOW anything of substance in this regard. But, as the readers here know, my intelligence tends to run towards logic and pattern recognition. And what I sensed more than saw was an intrinsic and fundamental wrongness on the part of <i>everyone </i>involved. It literally made me feel a pressing urge to run, not walk, away from all of it. If you consider that I was not at all bothered being around the gay Chicago industrial scene that surrounded Wax Trax! at the same time, that may put the strength of that impression of wrongness in perspective.</p><p>The reason I have come to believe Christianity is true, that Jesus Christ is the hard and narrow path out of a fallen world, that the model of good and evil described in the Bible is real, is because it, and only it, explains the behavior of various people I have met in the course of my life to my satisfaction.</p><p>And it’s also why I suspect that Donald Trump, the man who once described pedophile procurer Jeffrey Epstein as “a great guy”, may have experienced a similar enlightenment at some point in time. As another commenter, leukosfash, observed:</p><p><i>I think The Golden Don found out about those poor kids years ago and he’s been plotting all this time to avenge their suffering, even if it cost him his last nickle. There is a flinty grimness in his pursuit of the White House that I noticed, even when he’s smiling, but I couldn’t understand it until now. He literally loathes all of those evil fuckers; which also explains his refusal to go along with the yukks at that roast thingy.</i><br> <i><br/></i><br> I’ve noticed that grimness too. And more than that, I’ve noticed it in his family and in his entire circle. Nothing fazes them. Nothing even causes them to blink. And nothing can disguise their obvious loathing and contempt for his opponent and everyone around her. Watch Donald Trump Jr. in particular. He looks like he’s itching to personally waterboard every single member of the Clinton inner circle.</br></br></p></div>",
  "content_text": "11/4 notes a conceptual connection:\nVox, in your AMA you said you became Christian after discovering Evil exists.\nThis shit just about has me reading a damn Bible, which even 2 years ago I would have scoffed at.\nNo formal definition is necessary. You see the pattern and know.\nI wonder, if all of this comes out, will many other Americans react the same way. Could there be a religious revival under Trump?\nIt’s not impossible. I’ve stated in the past that one reason I left the USA was due to my momentary glimpse into the social circles of power there. I met Donald Trump in passing back in 1988, as a consequence of a brief relationship with someone who was on the outskirts of those circles. And I had an amount of other exposure to various people in positions of not-insignificant power.\nI didn’t, and I don’t, actually KNOW anything of substance in this regard. But, as the readers here know, my intelligence tends to run towards logic and pattern recognition. And what I sensed more than saw was an intrinsic and fundamental wrongness on the part of\neveryone\ninvolved. It literally made me feel a pressing urge to run, not walk, away from all of it. If you consider that I was not at all bothered being around the gay Chicago industrial scene that surrounded Wax Trax! at the same time, that may put the strength of that impression of wrongness in perspective.\nThe reason I have come to believe Christianity is true, that Jesus Christ is the hard and narrow path out of a fallen world, that the model of good and evil described in the Bible is real, is because it, and only it, explains the behavior of various people I have met in the course of my life to my satisfaction.\nAnd it’s also why I suspect that Donald Trump, the man who once described pedophile procurer Jeffrey Epstein as “a great guy”, may have experienced a similar enlightenment at some point in time. As another commenter, leukosfash, observed:\nI think The Golden Don found out about those poor kids years ago and he’s been plotting all this time to avenge their suffering, even if it cost him his last nickle. There is a flinty grimness in his pursuit of the White House that I noticed, even when he’s smiling, but I couldn’t understand it until now. He literally loathes all of those evil fuckers; which also explains his refusal to go along with the yukks at that roast thingy.\nI’ve noticed that grimness too. And more than that, I’ve noticed it in his family and in his entire circle. Nothing fazes them. Nothing even causes them to blink. And nothing can disguise their obvious loathing and contempt for his opponent and everyone around her. Watch Donald Trump Jr. in particular. He looks like he’s itching to personally waterboard every single member of the Clinton inner circle.",
  "tags": [
    "Christianity",
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-04T13:00:00+00:00"
}