{
  "url": "https://voxday.net/2016/11/01/meritocracy-in-america/",
  "scraped_at": "2025-12-18T02:02:25.688648",
  "title": "“Meritocracy” in America",
  "date_display": "November 1, 2016",
  "date_iso": "2016-11-01T16:00:00+00:00",
  "date_from_url": "2016-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Frank at <i>The Guardian</i> observes the way the Podesta emails reveal how America’s ruling class <a href=\"https://www.theguardian.com/commentisfree/2016/oct/31/the-podesta-emails-show-who-runs-america-and-how-they-do-it\">really operates</a>:</p><blockquote><p> This genre of Podesta email, in which people try to arrange jobs for themselves or their kids, points us toward the most fundamental thing we know about the people at the top of this class: their loyalty to one another and the way it overrides everything else. Of course Hillary Clinton staffed her state department with investment bankers and then did speaking engagements for investment banks as soon as she was done at the state department. Of course she appears to think that any kind of bank reform should “come from the industry itself”. And of course no elite bankers were ever prosecuted by the Obama administration. Read these emails and you understand, with a start, that the people at the top tier of American life all know each other. They are all engaged in promoting one another’s careers, constantly.</p><p>Everything blurs into everything else in this world. The state department, the banks, Silicon Valley, the nonprofits, the “Global CEO Advisory Firm” that appears to have solicited donations for the Clinton Foundation. Executives here go from foundation to government to thinktank to startup. There are honors. Venture capital. Foundation grants. Endowed chairs. Advanced degrees. For them the door revolves. The friends all succeed. They break every boundary.</p><p>But the One Big Boundary remains. Yes, it’s all supposed to be a meritocracy. But if you aren’t part of this happy, prosperous in-group – if you don’t have John Podesta’s email address – you’re out.</p></blockquote><p>I don’t so much mind the corruption and nepotism. It has always been thus, in every human culture. Francis Fukuyama has even coined a term, <i>repatrimonialization</i>, to describe the process, and in his excellent The Origins of Political Order, argues that one of the chief challenges of a society, and one of the causes of the rise and fall of civilizations, is the never-ending battle between the aristocratic class to increase its wealth and privileges at the expense of the common people, and pass them on to its children, and the state, which attempts to interfere with that process.</p><p>In the USA, the state, and the people, have clearly lost that battle, because the financial aristocrats captured the throne, which has historically allied with the common people against the aristocracies.</p></div>",
  "content_text": "Thomas Frank at\nThe Guardian\nobserves the way the Podesta emails reveal how America’s ruling class\nreally operates\n:\nThis genre of Podesta email, in which people try to arrange jobs for themselves or their kids, points us toward the most fundamental thing we know about the people at the top of this class: their loyalty to one another and the way it overrides everything else. Of course Hillary Clinton staffed her state department with investment bankers and then did speaking engagements for investment banks as soon as she was done at the state department. Of course she appears to think that any kind of bank reform should “come from the industry itself”. And of course no elite bankers were ever prosecuted by the Obama administration. Read these emails and you understand, with a start, that the people at the top tier of American life all know each other. They are all engaged in promoting one another’s careers, constantly.\nEverything blurs into everything else in this world. The state department, the banks, Silicon Valley, the nonprofits, the “Global CEO Advisory Firm” that appears to have solicited donations for the Clinton Foundation. Executives here go from foundation to government to thinktank to startup. There are honors. Venture capital. Foundation grants. Endowed chairs. Advanced degrees. For them the door revolves. The friends all succeed. They break every boundary.\nBut the One Big Boundary remains. Yes, it’s all supposed to be a meritocracy. But if you aren’t part of this happy, prosperous in-group – if you don’t have John Podesta’s email address – you’re out.\nI don’t so much mind the corruption and nepotism. It has always been thus, in every human culture. Francis Fukuyama has even coined a term,\nrepatrimonialization\n, to describe the process, and in his excellent The Origins of Political Order, argues that one of the chief challenges of a society, and one of the causes of the rise and fall of civilizations, is the never-ending battle between the aristocratic class to increase its wealth and privileges at the expense of the common people, and pass them on to its children, and the state, which attempts to interfere with that process.\nIn the USA, the state, and the people, have clearly lost that battle, because the financial aristocrats captured the throne, which has historically allied with the common people against the aristocracies.",
  "tags": [
    "conspiracy",
    "decline and fall",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-01T16:00:00+00:00"
}