{
  "url": "https://voxday.net/2016/11/13/past-and-future-identity-politics/",
  "scraped_at": "2025-12-18T02:04:49.742034",
  "title": "Past and future identity politics",
  "date_display": "November 13, 2016",
  "date_iso": "2016-11-13T13:00:00+00:00",
  "date_from_url": "2016-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SJW Narratives on race and society, as well as the Democrats’ Rainbow Coalition, are ultimately doomed to failure because they are all predicated on a nonexistent People of Color vs Whites scenario that does not, <a href=\"http://www.huffingtonpost.com/entry/lum-family-desegregation_us_581a4320e4b0c43e6c1db6f5?\">and has never</a>, existed:<br/></p><blockquote><p> Decades before Brown v. Board of Education ― the landmark 1954 Supreme Court case that found “separate educational facilities are inherently unequal” ― a Chinese family from rural Mississippi brought its own legal challenge to Southern school segregation before the Supreme Court.</p><p>In 1924, grade school students Martha and Berda Lum were barred from attending their local, all-white school because of their status as people of color. The family sued the school in an unprecedented but little-known lawsuit that made its way to the nation’s highest court.</p><p>A new book, <i>Water Tossing Boulders: How a Family of Chinese Immigrants Led the First Fight to Desegregate Schools in the Jim Crow South</i>, documents the family’s struggle for educational equality.</p><p>Although the Lums sought to fight racism against Asian-Americans and provide their daughters with access to a quality education, their lawsuit was itself rooted in pronounced anti-black racism. The Lum family brought the challenge because they didn’t want society to see their daughters as being in the same category as black students, or force them to attend the same institutions as black children.</p><p>The girls’ mother, Katherine, “knew that such a classification would have instantly disenfranchised her family,” the book says. “For Katherine to send her children to the colored school would be to yield to the trustees, to agree with them that her daughters were not worthy of the privileges afforded to whites.”</p></blockquote><p>However, there is also an important lesson for the more cuckish conservatives here. Neither the various Asian identity groups nor Jews are actually on the side of Whites. They may have more characteristics in common with Whites than other identity groups, but they also have their own identities and their own tribal interests, which contradict White interests every bit as dramatically as other identity groups, and as the Lum case demonstrates, they will <i>never </i>hesitate to cast aside White interests in pursuit of their own.</p><p>Ironically, the Alt-White’s fixation on Jews is not only somewhat misplaced, it actually understates the extent of the challenge facing Whites. The historical fact is that the Jews are not, and were never, unique in being an identity group capable of nepotistically exploiting a high-trust, high-altruism majority for their own benefit, they just happened to be the only group present in Western societies in sufficient numbers to do so. White Americans, and to a lesser extent, several European nations, as well as the Jews themselves, are currently in the process of discovering that various Asian identity groups, particularly the Han Chinese, are not only every bit as accomplished in this regard, but are considerably more numerous, and quite possibly more ruthless.</p><p>Various Asian groups are already driving out Jews from the elite universities originally created by and for whites, and the Chinese are now invading the Jewish power center of Hollywood in force. This is not an accident nor is it the usual corporate train wreck. The next step will be for Asians to begin replacing Jews in the media and in the Democratic Party elite; the Chinese-Hispanic political alliance is likely to be even more formidable than the historic Jewish-Black alliance.</p><p>This is why the Alt-Right is not going to fade away, but will gradually become more influential in the White Party, which is now the proper name for the Republican Party. The Alt-Right’s conceptual models, which are based on identity rather than ideology, not only describe past and current events much more accurately than the mainstream alternatives, but also provide much more accurate predictive models.</p></div>",
  "content_text": "The SJW Narratives on race and society, as well as the Democrats’ Rainbow Coalition, are ultimately doomed to failure because they are all predicated on a nonexistent People of Color vs Whites scenario that does not,\nand has never\n, existed:\nDecades before Brown v. Board of Education ― the landmark 1954 Supreme Court case that found “separate educational facilities are inherently unequal” ― a Chinese family from rural Mississippi brought its own legal challenge to Southern school segregation before the Supreme Court.\nIn 1924, grade school students Martha and Berda Lum were barred from attending their local, all-white school because of their status as people of color. The family sued the school in an unprecedented but little-known lawsuit that made its way to the nation’s highest court.\nA new book,\nWater Tossing Boulders: How a Family of Chinese Immigrants Led the First Fight to Desegregate Schools in the Jim Crow South\n, documents the family’s struggle for educational equality.\nAlthough the Lums sought to fight racism against Asian-Americans and provide their daughters with access to a quality education, their lawsuit was itself rooted in pronounced anti-black racism. The Lum family brought the challenge because they didn’t want society to see their daughters as being in the same category as black students, or force them to attend the same institutions as black children.\nThe girls’ mother, Katherine, “knew that such a classification would have instantly disenfranchised her family,” the book says. “For Katherine to send her children to the colored school would be to yield to the trustees, to agree with them that her daughters were not worthy of the privileges afforded to whites.”\nHowever, there is also an important lesson for the more cuckish conservatives here. Neither the various Asian identity groups nor Jews are actually on the side of Whites. They may have more characteristics in common with Whites than other identity groups, but they also have their own identities and their own tribal interests, which contradict White interests every bit as dramatically as other identity groups, and as the Lum case demonstrates, they will\nnever\nhesitate to cast aside White interests in pursuit of their own.\nIronically, the Alt-White’s fixation on Jews is not only somewhat misplaced, it actually understates the extent of the challenge facing Whites. The historical fact is that the Jews are not, and were never, unique in being an identity group capable of nepotistically exploiting a high-trust, high-altruism majority for their own benefit, they just happened to be the only group present in Western societies in sufficient numbers to do so. White Americans, and to a lesser extent, several European nations, as well as the Jews themselves, are currently in the process of discovering that various Asian identity groups, particularly the Han Chinese, are not only every bit as accomplished in this regard, but are considerably more numerous, and quite possibly more ruthless.\nVarious Asian groups are already driving out Jews from the elite universities originally created by and for whites, and the Chinese are now invading the Jewish power center of Hollywood in force. This is not an accident nor is it the usual corporate train wreck. The next step will be for Asians to begin replacing Jews in the media and in the Democratic Party elite; the Chinese-Hispanic political alliance is likely to be even more formidable than the historic Jewish-Black alliance.\nThis is why the Alt-Right is not going to fade away, but will gradually become more influential in the White Party, which is now the proper name for the Republican Party. The Alt-Right’s conceptual models, which are based on identity rather than ideology, not only describe past and current events much more accurately than the mainstream alternatives, but also provide much more accurate predictive models.",
  "tags": [
    "#AltRight",
    "immigration",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-13T13:00:00+00:00"
}