{
  "url": "https://voxday.net/2016/11/14/republicans-are-now-white-party/",
  "scraped_at": "2025-12-18T02:05:04.568259",
  "title": "“Republicans are now the White Party”",
  "date_display": "November 14, 2016",
  "date_iso": "2016-11-14T23:50:00+00:00",
  "date_from_url": "2016-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to see that the ethno-strategy that both I and Steve Sailer have recognized for quite some time now is being recognized. Steve, of course, recommended<a href=\"http://observer.com/2016/11/americas-emerging-nationalism-crisis/\"> the conscious adoption of it as a political strategy</a>. I, on the other hand, viewed it as an inevitability that some politician, whether Republican or not, was bound to figure out eventually:</p><blockquote><p> Trump adopted the Sailer Strategy—whether he knew it I have no idea—and won handsomely. It would be wrong to impute huge numbers of down-market whites voting for Trump simply to racism, as many on the left predictably are doing. Quite a few Trump voters in swing states like Pennsylvania and Ohio turn out to have voted for Obama—twice. They wanted change, Obama didn’t deliver, so they gave Trump a chance to be the change-agent in Washington they have long sought. The roots of their dissatisfaction are social and economic more than racial, and bien-pensant efforts to portray their legitimate grievances as “hate” reflect the worst of post-modern progressive intolerance.</p><p>All the same, it cannot be denied that ethno-racial concerns played a role here—and that it was the Democrats who opened that can of worms. Since the beginning of the century, liberals have been crowing about the “emerging Democratic majority” being delivered by changing demographics, heavily fueled by immigration (legal or not). President Obama’s reelection four years ago seemed to conclusively prove that the “new” America—morally superior to the old, white-dominated one—had arrived, and the Republicans were on life support, waiting for GOP voters to go the way of the dinosaur. As one of Obama’s media acolytes hailed the 2012 victory:</p><p>President Barack Obama did not just win reelection tonight. His victory signaled the irreversible triumph of a new, 21st-century America: multiracial, multi-ethnic, global in outlook and moving beyond centuries of racial, sexual, marital and religious tradition.</p><p>This was more of the Marxistoid “right side of History” blather that Team Obama has indulged in for the last eight years—and it was utterly wrong. To the surprise of no one who understands human nature, many whites didn’t appreciate being told that they had to die off for “progress” to be achieved. They didn’t like being derided by their betters as “bitter clingers” with their guns and Bibles, and they especially didn’t like being termed “deplorables” unworthy of compassion or consideration. In the last days of Hillary’s doomed campaign, its contempt for a huge chunk of the American population had become so blatant that one of her top celebrity surrogates publicly hailed the “extinction” of straight white men as a step in the right direction.</p><p>Trump is no political genius. He made an appeal to working-class whites, who correctly felt that the Democrats viewed them with undisguised contempt and didn’t want their vote. The “emerging Democratic majority” thesis included the need to get some of those whites, a legacy Democratic voting bloc, to win national elections; under Obama, his party decided they didn’t need them at all, which was a terrible, almost incomprehensible mistake. It shouldn’t be necessary to point out that running against working-class whites—at almost 40 percent of the electorate, the biggest voting bloc in America—is the definition of political insanity.</p><p>Yet progressives somehow managed not to see the nose right on their face. Hence President Trump. What commentators term “identity politics” has now become normative, thanks to the Democrats indulging in it, and Trump is now aping them. It would be more correct to term this what it actually is: nationalism. Ethno-racial nationalism is an enormously potent political force; wise politicians know this and employ it cautiously. Nationalism arouses genuine passion and is a political motivator like no other, which it explains why a majority of white women voted for Trump, to the bitter consternation of outraged feminists.</p><p>Moreover, once nationalism becomes the main political factor, there’s no putting that troublesome genie back in the bottle. Politics become tribal, ethnic conflicts waged at the ballot box rather than on the battlefield. Having done most of my scholarly work on multiethnic societies like the Habsburg Empire and Yugoslavia, I can attest that the fires of nationalism, once stoked, are only put out with great difficulty—and that ethnically diverse societies that play games with nationalism are living dangerously.</p><p>Nationalism transforms politics from ideology to tribe. As Lee Kwan Yew, whose founding and prosperous running of multiethnic Singapore for three decades made him one of the most successful politicians of the 20th century, expressed it concisely, “In multiracial societies, you don’t vote in accordance with your economic interests and social interests, you vote in accordance with race and religion.”</p><p>The Republicans are now the White party, de facto, whether they want to be or not. American politics will never be the same, and 2016 looks like a landmark election in the manner of 1980, 1932, or 1860, each of which transformed the United States. Buckle up, it looks to be a bumpy ride ahead in the emerging era of competing American ethno-nationalisms.</p></blockquote><p>The key phrase there is “whether they want to be or not”. Cuckservatives will cuck. Conservatives will wax passionately about men being created equal. Jews will fret about anti-semitism. Mexicans and Asians and mixed-race people will posture about being called names. Liberals will cry racist, SJWs will cry fascist, and Nazi, and white supremacist, and every other name they can dream up. <i>None of this matters. </i><br> <i><br/></i><br> Why not? Why was it inevitable that Republicans would become the White American Party while Democrats become the Not American Party? Lee Kwan Yew explained it very clearly many years ago. (I am, you may recall, not only a student of economics, but an East Asian Studies major as well.) <i>“In multiracial societies, you don’t vote in accordance with your economic interests and social interests, you vote in accordance with race and religion.”</i></br></br></p><p>Ideology is dead. The USA is no longer the Anglo-American society described by de Tocqueville. It is now a multiracial society, and as unexceptional in this regard as all of its various predecessors in that regard. Therefore, all US citizens will increasingly vote in accordance with race and religion, just like the rest of the world tends to do. Liberals wanted the USA to be more like the rest of the world. Well, congratulations, liberals, but perhaps you probably should have been a little more careful about what you wished for.</p><p>And if you’re thinking that mudsharking and race-mixing is the answer to multiracial conflict, think again. That particular outcome is considerably worse than you might think. You see, one of the things that leads to is the likes of me.</p></div>",
  "content_text": "It’s interesting to see that the ethno-strategy that both I and Steve Sailer have recognized for quite some time now is being recognized. Steve, of course, recommended\nthe conscious adoption of it as a political strategy\n. I, on the other hand, viewed it as an inevitability that some politician, whether Republican or not, was bound to figure out eventually:\nTrump adopted the Sailer Strategy—whether he knew it I have no idea—and won handsomely. It would be wrong to impute huge numbers of down-market whites voting for Trump simply to racism, as many on the left predictably are doing. Quite a few Trump voters in swing states like Pennsylvania and Ohio turn out to have voted for Obama—twice. They wanted change, Obama didn’t deliver, so they gave Trump a chance to be the change-agent in Washington they have long sought. The roots of their dissatisfaction are social and economic more than racial, and bien-pensant efforts to portray their legitimate grievances as “hate” reflect the worst of post-modern progressive intolerance.\nAll the same, it cannot be denied that ethno-racial concerns played a role here—and that it was the Democrats who opened that can of worms. Since the beginning of the century, liberals have been crowing about the “emerging Democratic majority” being delivered by changing demographics, heavily fueled by immigration (legal or not). President Obama’s reelection four years ago seemed to conclusively prove that the “new” America—morally superior to the old, white-dominated one—had arrived, and the Republicans were on life support, waiting for GOP voters to go the way of the dinosaur. As one of Obama’s media acolytes hailed the 2012 victory:\nPresident Barack Obama did not just win reelection tonight. His victory signaled the irreversible triumph of a new, 21st-century America: multiracial, multi-ethnic, global in outlook and moving beyond centuries of racial, sexual, marital and religious tradition.\nThis was more of the Marxistoid “right side of History” blather that Team Obama has indulged in for the last eight years—and it was utterly wrong. To the surprise of no one who understands human nature, many whites didn’t appreciate being told that they had to die off for “progress” to be achieved. They didn’t like being derided by their betters as “bitter clingers” with their guns and Bibles, and they especially didn’t like being termed “deplorables” unworthy of compassion or consideration. In the last days of Hillary’s doomed campaign, its contempt for a huge chunk of the American population had become so blatant that one of her top celebrity surrogates publicly hailed the “extinction” of straight white men as a step in the right direction.\nTrump is no political genius. He made an appeal to working-class whites, who correctly felt that the Democrats viewed them with undisguised contempt and didn’t want their vote. The “emerging Democratic majority” thesis included the need to get some of those whites, a legacy Democratic voting bloc, to win national elections; under Obama, his party decided they didn’t need them at all, which was a terrible, almost incomprehensible mistake. It shouldn’t be necessary to point out that running against working-class whites—at almost 40 percent of the electorate, the biggest voting bloc in America—is the definition of political insanity.\nYet progressives somehow managed not to see the nose right on their face. Hence President Trump. What commentators term “identity politics” has now become normative, thanks to the Democrats indulging in it, and Trump is now aping them. It would be more correct to term this what it actually is: nationalism. Ethno-racial nationalism is an enormously potent political force; wise politicians know this and employ it cautiously. Nationalism arouses genuine passion and is a political motivator like no other, which it explains why a majority of white women voted for Trump, to the bitter consternation of outraged feminists.\nMoreover, once nationalism becomes the main political factor, there’s no putting that troublesome genie back in the bottle. Politics become tribal, ethnic conflicts waged at the ballot box rather than on the battlefield. Having done most of my scholarly work on multiethnic societies like the Habsburg Empire and Yugoslavia, I can attest that the fires of nationalism, once stoked, are only put out with great difficulty—and that ethnically diverse societies that play games with nationalism are living dangerously.\nNationalism transforms politics from ideology to tribe. As Lee Kwan Yew, whose founding and prosperous running of multiethnic Singapore for three decades made him one of the most successful politicians of the 20th century, expressed it concisely, “In multiracial societies, you don’t vote in accordance with your economic interests and social interests, you vote in accordance with race and religion.”\nThe Republicans are now the White party, de facto, whether they want to be or not. American politics will never be the same, and 2016 looks like a landmark election in the manner of 1980, 1932, or 1860, each of which transformed the United States. Buckle up, it looks to be a bumpy ride ahead in the emerging era of competing American ethno-nationalisms.\nThe key phrase there is “whether they want to be or not”. Cuckservatives will cuck. Conservatives will wax passionately about men being created equal. Jews will fret about anti-semitism. Mexicans and Asians and mixed-race people will posture about being called names. Liberals will cry racist, SJWs will cry fascist, and Nazi, and white supremacist, and every other name they can dream up.\nNone of this matters.\nWhy not? Why was it inevitable that Republicans would become the White American Party while Democrats become the Not American Party? Lee Kwan Yew explained it very clearly many years ago. (I am, you may recall, not only a student of economics, but an East Asian Studies major as well.)\n“In multiracial societies, you don’t vote in accordance with your economic interests and social interests, you vote in accordance with race and religion.”\nIdeology is dead. The USA is no longer the Anglo-American society described by de Tocqueville. It is now a multiracial society, and as unexceptional in this regard as all of its various predecessors in that regard. Therefore, all US citizens will increasingly vote in accordance with race and religion, just like the rest of the world tends to do. Liberals wanted the USA to be more like the rest of the world. Well, congratulations, liberals, but perhaps you probably should have been a little more careful about what you wished for.\nAnd if you’re thinking that mudsharking and race-mixing is the answer to multiracial conflict, think again. That particular outcome is considerably worse than you might think. You see, one of the things that leads to is the likes of me.",
  "tags": [
    "decline and fall",
    "politics",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-14T23:50:00+00:00"
}