{
  "url": "https://voxday.net/2016/11/29/so-called-or-self-described/",
  "scraped_at": "2025-12-18T02:07:43.681946",
  "title": "So-called or self-described",
  "date_display": "November 29, 2016",
  "date_iso": "2016-11-29T07:00:00+00:00",
  "date_from_url": "2016-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Early days, my friends. Early days. The AP <a href=\"http://thehill.com/blogs/in-the-know/in-the-know/307709-ap-avoid-using-alt-right-without-defining-the-movements-racist\">gives the mainstream media its marching orders</a>.</p><blockquote><p> AP: Avoid using ‘alt-right’ without context</p><p>The Associated Press Monday released new guidelines for referencing the “alt-right,” which ask that journalists use the term alongside its definition and in context of its association with racist beliefs.</p><p>The new guidelines read: <i>“‘Alt-right’ (quotation marks, hyphen and lower case) may be used in quotes or modified as in the ‘self-described’ or ‘so-called alt-right’ in stories discussing what the movement says about itself. Avoid using the term generically and without definition, however, because it is not well known and the term may exist primarily as a public-relations device to make its supporters’ actual beliefs less clear and more acceptable to a broader audience.”</i></p></blockquote><p>It should be amusing to see them try to define it in the next set of guidelines. What this indicates, however, is that they’ve failed to stamp the Alt-Right as either Nazis or White Supremacists, which was their initial attempt to address it. They want to avoid so much as mentioning the term without providing the necessary context, which means framing it to fit their Narrative.</p><p>As it is written, <a href=\"http://amzn.to/1tpCVKy\">SJWs always lie</a>.</p><p>Meanwhile, the Romanian and Bulgarian translations of the <a href=\"http://www.milobookclub.com/2016/08/24/what-alt-right-is/\">16 Points of the Alt-Right</a> have been delivered and posted. We now have more translations than points; don’t hesitate to copy them and spread them around the Internet. While the Hoax Media is dithering and deceiving themselves and attempting to marginalize us, we’re rapidly expanding across the globe. Those in need of getting up to speed on the Alt-Right may wish to note that one can quickly access all of the Alt-Right-related posts on this blog via <a href=\"http://voxday.blogspot.com/search/label/%23AltRight\">the link on the right sidebar</a> below the various translations.</p></div>",
  "content_text": "Early days, my friends. Early days. The AP\ngives the mainstream media its marching orders\n.\nAP: Avoid using ‘alt-right’ without context\nThe Associated Press Monday released new guidelines for referencing the “alt-right,” which ask that journalists use the term alongside its definition and in context of its association with racist beliefs.\nThe new guidelines read:\n“‘Alt-right’ (quotation marks, hyphen and lower case) may be used in quotes or modified as in the ‘self-described’ or ‘so-called alt-right’ in stories discussing what the movement says about itself. Avoid using the term generically and without definition, however, because it is not well known and the term may exist primarily as a public-relations device to make its supporters’ actual beliefs less clear and more acceptable to a broader audience.”\nIt should be amusing to see them try to define it in the next set of guidelines. What this indicates, however, is that they’ve failed to stamp the Alt-Right as either Nazis or White Supremacists, which was their initial attempt to address it. They want to avoid so much as mentioning the term without providing the necessary context, which means framing it to fit their Narrative.\nAs it is written,\nSJWs always lie\n.\nMeanwhile, the Romanian and Bulgarian translations of the\n16 Points of the Alt-Right\nhave been delivered and posted. We now have more translations than points; don’t hesitate to copy them and spread them around the Internet. While the Hoax Media is dithering and deceiving themselves and attempting to marginalize us, we’re rapidly expanding across the globe. Those in need of getting up to speed on the Alt-Right may wish to note that one can quickly access all of the Alt-Right-related posts on this blog via\nthe link on the right sidebar\nbelow the various translations.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-29T07:00:00+00:00"
}