{
  "url": "https://voxday.net/2016/11/20/still-not-about-you/",
  "scraped_at": "2025-12-18T02:06:04.967218",
  "title": "Still not about you",
  "date_display": "November 20, 2016",
  "date_iso": "2016-11-20T13:00:00+00:00",
  "date_from_url": "2016-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A discussion on Gab:</p><blockquote><p> Vox Day<br> Even we American Indians have our sovereign reservations. Why shouldn’t white Americans have their own sovereign country?</br></p><p>HorrorQueen<br> Where on earth would I go? I’m English, Gypsy, Native American and black… are we going to slice me up?</br></p><p>Vox Day<br> Do you also argue that interest rates should be set according to your personal financial situation? What will happen will happen. It’s not about you.</br></p><p>Sciurus<br> Being multiracial myself, I don’t understand how people have such a hard time getting this. Immigration policies that were instrumental to my existence have been disastrous for America. That’s nothing personal; it’s just a fact.</br></p></blockquote><p>A strong, wealthy, free, and predominantly white America is in the interest of everyone in the world. Everyone in the world, even its enemies, are more likely to benefit from a predominantly white America that does not attempt to play global policeman or to enforce American cultural values around the world than one in which America is adulterated and diversitied and vibrantized into a muddy parody passed off under the same name.</p><p>The fact that there are hundreds of millions of non-white non-Americans who would prefer to live among white Americans than among their own kind does not alter the truth of the preceding statements in the slightest. Even illiterate savages who defecate in the street often prefer to live among civilized people who don’t, particularly if those who don’t are willing to feed, shelter, clothe, and clean up after them.</p><p>But it is not possible for many non-white non-Americans to live among white America without transforming it into non-white not-America. And that is why it is <i>very much</i> in the interest of non-whites and non-Americans to support the return of the USA’s population to the pre-1965 ethnic demographics that were promised to Americans by the advocates of the 1965 Immigration Act. After all, do they really believe all that technology, investment, and foreign aid that is provided by white people is going to continue to flow once white countries are no longer white?</p><p>It is readily apparent that the immigration cargo cultists who subscribe to Magic Dirt Theory have never once thought through the obvious consequences of their policies.</p><p>Also, if your first response to the discussion of a macro-societal level issue is “well, what about me?”, you are not fit to participate in the discussion. If you don’t care about anyone else’s interests, there is absolutely no reason for anyone else to take yours into account.</p></div>",
  "content_text": "A discussion on Gab:\nVox Day\nEven we American Indians have our sovereign reservations. Why shouldn’t white Americans have their own sovereign country?\nHorrorQueen\nWhere on earth would I go? I’m English, Gypsy, Native American and black… are we going to slice me up?\nVox Day\nDo you also argue that interest rates should be set according to your personal financial situation? What will happen will happen. It’s not about you.\nSciurus\nBeing multiracial myself, I don’t understand how people have such a hard time getting this. Immigration policies that were instrumental to my existence have been disastrous for America. That’s nothing personal; it’s just a fact.\nA strong, wealthy, free, and predominantly white America is in the interest of everyone in the world. Everyone in the world, even its enemies, are more likely to benefit from a predominantly white America that does not attempt to play global policeman or to enforce American cultural values around the world than one in which America is adulterated and diversitied and vibrantized into a muddy parody passed off under the same name.\nThe fact that there are hundreds of millions of non-white non-Americans who would prefer to live among white Americans than among their own kind does not alter the truth of the preceding statements in the slightest. Even illiterate savages who defecate in the street often prefer to live among civilized people who don’t, particularly if those who don’t are willing to feed, shelter, clothe, and clean up after them.\nBut it is not possible for many non-white non-Americans to live among white America without transforming it into non-white not-America. And that is why it is\nvery much\nin the interest of non-whites and non-Americans to support the return of the USA’s population to the pre-1965 ethnic demographics that were promised to Americans by the advocates of the 1965 Immigration Act. After all, do they really believe all that technology, investment, and foreign aid that is provided by white people is going to continue to flow once white countries are no longer white?\nIt is readily apparent that the immigration cargo cultists who subscribe to Magic Dirt Theory have never once thought through the obvious consequences of their policies.\nAlso, if your first response to the discussion of a macro-societal level issue is “well, what about me?”, you are not fit to participate in the discussion. If you don’t care about anyone else’s interests, there is absolutely no reason for anyone else to take yours into account.",
  "tags": [
    "#AltRight",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-20T13:00:00+00:00"
}