{
  "url": "https://voxday.net/2016/11/23/the-fortress-of-solitude/",
  "scraped_at": "2025-12-18T02:06:37.594356",
  "title": "The fortress of solitude",
  "date_display": "November 23, 2016",
  "date_iso": "2016-11-23T16:00:00+00:00",
  "date_from_url": "2016-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not such a bad place to be. In fact, <a href=\"https://www.indy100.com/article/study-finds-intelligent-people-need-more-time-alone-to-be-happy-7423191\">it’s rather comfortable</a>, if not energizing.</p><blockquote><p> While it’s widely accepted that socialising makes us happier, this might not be strictly true if you’re highly intelligent. Evolutionary psychologists from Singapore Management University and the London School of Economics and Political Science found exactly this when they studied more than 15,000 young adults.</p><p>They concluded that, while people generally feel happier when they spend time with others, very smart people are an exception to this rule.</p><p>The study said this could be because of evolution.</p><p>Smarter people can more easily adapt to their surroundings in the modern world, so they don’t need close relationships to help them with food and shelter, like our ancestors did. Or, in the modern equivalent, the Wi-Fi password and a spare phone charger.</p><p>Their other theory is that smarter people are more aspirational, and want to spend more time working towards their goals, rather than socialising.</p><p>The study found that more intelligent people actually had lower life satisfaction the more frequently they socialised with friends – spending time with friends actually made them unhappy.</p></blockquote><p>Here is an example of why I prefer solitude. Imagine going through some form of this every single day, in almost every single conversation with almost everyone you encounter outside the home. After I posted a link to the 16 Points of the Alt-Right on Gab, no less than THREE (3) people decided that they had spotted a contradiction and promptly popped up to demand clarifications.</p><blockquote><p> <i>So are we the best of humanity objectively speaking, or merely our best selves when under nationalist administration? If you are speaking in terms of who wields power over who in point 15 rather than objective cultural/racial traits, that needs to be clarified.</i></p><p>It doesn’t need anything of the sort. Stop sperging.</p><p><i>Can you explain why #14 and #15 aren’t a contradiction?</i></p><p>Existence is not supremacy. Did you really need help understanding that? Learn to read what is there, don’t just latch onto one word in the sentence.</p><p><i>Wow, dude. Why so nasty? There are some racial nuances of the #AltRight I’m trying to understand…Much of what I’m hearing in practice sounds contrictory…but I see you have no interest in any questions.</i></p><p>I don’t have any interest in questions from people who can’t distinguish “race” from “civilization” or “supremacy” from “existence”. Seriously, how do I talk to you if you can’t even handle that? Sign language? Charades?</p><p><i>If you’re going to draw up what’s essentially a summative constitutional/base document, get it fucking 100% unambiguous.</i></p><p>I don’t write for relative retards. There are many translations of it. Feel free to translate it for those with normal-range IQs if you like. I’d genuinely be curious to see what that would look like.</p><p><i>Yes you’re quite right. Guess there’s no point communicating. You’re way too busy being pissed off to bother.</i></p></blockquote><p>Do you know why people have to be paid to teach? Because no one wants to put up with idiots struggling with the obvious. I really don’t want to have to repetitively explain to people that 2 is not 37 and purple is not yellow every single time I open my mouth. It’s worse than aggravating, it is <i>exhausting</i>.</p><p>If you want to be more accommodating to the highly intelligent people in your life, there is one thing that you can do that will make you considerably less annoying than the average person: DO NOT CORRECT THEM. If you don’t understand something, or if you think something they have said is wrong,<i> just let it go</i>.</p><p>This is desirable because 75 percent of the time someone “corrects” a highly intelligent person, they are demonstrably and provably wrong. Another 20 percent of the time, the correction is trivial and totally irrelevant to the topic at hand. This percentage rises to 99 percent when the “correction” is based on something pedantic. I’m not saying that highly intelligent people are always right, I’m just saying that the odds are not in your favor.</p></div>",
  "content_text": "It’s not such a bad place to be. In fact,\nit’s rather comfortable\n, if not energizing.\nWhile it’s widely accepted that socialising makes us happier, this might not be strictly true if you’re highly intelligent. Evolutionary psychologists from Singapore Management University and the London School of Economics and Political Science found exactly this when they studied more than 15,000 young adults.\nThey concluded that, while people generally feel happier when they spend time with others, very smart people are an exception to this rule.\nThe study said this could be because of evolution.\nSmarter people can more easily adapt to their surroundings in the modern world, so they don’t need close relationships to help them with food and shelter, like our ancestors did. Or, in the modern equivalent, the Wi-Fi password and a spare phone charger.\nTheir other theory is that smarter people are more aspirational, and want to spend more time working towards their goals, rather than socialising.\nThe study found that more intelligent people actually had lower life satisfaction the more frequently they socialised with friends – spending time with friends actually made them unhappy.\nHere is an example of why I prefer solitude. Imagine going through some form of this every single day, in almost every single conversation with almost everyone you encounter outside the home. After I posted a link to the 16 Points of the Alt-Right on Gab, no less than THREE (3) people decided that they had spotted a contradiction and promptly popped up to demand clarifications.\nSo are we the best of humanity objectively speaking, or merely our best selves when under nationalist administration? If you are speaking in terms of who wields power over who in point 15 rather than objective cultural/racial traits, that needs to be clarified.\nIt doesn’t need anything of the sort. Stop sperging.\nCan you explain why #14 and #15 aren’t a contradiction?\nExistence is not supremacy. Did you really need help understanding that? Learn to read what is there, don’t just latch onto one word in the sentence.\nWow, dude. Why so nasty? There are some racial nuances of the #AltRight I’m trying to understand…Much of what I’m hearing in practice sounds contrictory…but I see you have no interest in any questions.\nI don’t have any interest in questions from people who can’t distinguish “race” from “civilization” or “supremacy” from “existence”. Seriously, how do I talk to you if you can’t even handle that? Sign language? Charades?\nIf you’re going to draw up what’s essentially a summative constitutional/base document, get it fucking 100% unambiguous.\nI don’t write for relative retards. There are many translations of it. Feel free to translate it for those with normal-range IQs if you like. I’d genuinely be curious to see what that would look like.\nYes you’re quite right. Guess there’s no point communicating. You’re way too busy being pissed off to bother.\nDo you know why people have to be paid to teach? Because no one wants to put up with idiots struggling with the obvious. I really don’t want to have to repetitively explain to people that 2 is not 37 and purple is not yellow every single time I open my mouth. It’s worse than aggravating, it is\nexhausting\n.\nIf you want to be more accommodating to the highly intelligent people in your life, there is one thing that you can do that will make you considerably less annoying than the average person: DO NOT CORRECT THEM. If you don’t understand something, or if you think something they have said is wrong,\njust let it go\n.\nThis is desirable because 75 percent of the time someone “corrects” a highly intelligent person, they are demonstrably and provably wrong. Another 20 percent of the time, the correction is trivial and totally irrelevant to the topic at hand. This percentage rises to 99 percent when the “correction” is based on something pedantic. I’m not saying that highly intelligent people are always right, I’m just saying that the odds are not in your favor.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-23T16:00:00+00:00"
}