{
  "url": "https://voxday.net/2016/11/04/this-is-not-clever-stratege/",
  "scraped_at": "2025-12-18T02:03:08.123404",
  "title": "This is NOT a clever strategem",
  "date_display": "November 4, 2016",
  "date_iso": "2016-11-04T19:30:00+00:00",
  "date_from_url": "2016-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, I find the cowering fear of opening themselves up to potential criticism on the part of a number of conservatives and otherwise sensible people to be downright slap-worthy. I’ve been getting a number of emails, and seeing a number of comments like this floating around.</p><blockquote class=\"tr_bq\"><p> Are we being chumped? I’m worried this whole weiner laptop thing is a trap. Supposed to be so telling about the wickedness of clintondom, just you wait til the news hits. But what if nothing really new comes out…..just the same shit the FBI already had. We trumpsters spend the last few days of the campaign holding our breath waiting for the coup de grace rather than fighting in the trenches. FBI eventually tells us no new news, Hillary gets a Monday bump, and we go down. The innuendo seems too good to be true….maybe it is. </p></blockquote><p>This is ridiculous. This is <i>absurd</i>. What “fighting in the trenches” is not taking place <i>anywhere </i>just because everyone is waiting to see if the NYPD or the FBI are going to do anything? I mean, sure, I’m anticipating something to happen in the next 24 hours and putting up the occasional post, but in the meantime, I also finished editing John C. Wright’s latest book and got a number of other things done.</p><p>A trap? A TRAP? Are you serious? Not only does belief, or disbelief, in the various rumors not preclude anyone from doing anything, it should be <i>totally freaking obvious</i> that <i>pretending to be a sexually abusive pedophile occultist</i> is not a winning strategy for any political candidate, let alone a presidential one. I mean, the idiocy of that strategy is already a well-known meme!</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CwbyKEqWIAA_By1.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://pbs.twimg.com/media/CwbyKEqWIAA_By1.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://pbs.twimg.com/media/CwbyKEqWIAA_By1.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Seems likely, doesn’t it? Come on. Lose the cuck mindset. It’s a recipe for failure of every kind. If you’re living in fear that doing or saying something might give someone the opportunity to say that you were wrong, you’re <i>already </i>a chump.</p><div style=\"text-align: left;\"> Now THIS is a campaign strategy. Rather good timing, wouldn’t you say?</div><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/vppk3R6eDuU\" width=\"512\"></iframe></div></div>",
  "content_text": "I have to admit, I find the cowering fear of opening themselves up to potential criticism on the part of a number of conservatives and otherwise sensible people to be downright slap-worthy. I’ve been getting a number of emails, and seeing a number of comments like this floating around.\nAre we being chumped? I’m worried this whole weiner laptop thing is a trap. Supposed to be so telling about the wickedness of clintondom, just you wait til the news hits. But what if nothing really new comes out…..just the same shit the FBI already had. We trumpsters spend the last few days of the campaign holding our breath waiting for the coup de grace rather than fighting in the trenches. FBI eventually tells us no new news, Hillary gets a Monday bump, and we go down. The innuendo seems too good to be true….maybe it is.\nThis is ridiculous. This is\nabsurd\n. What “fighting in the trenches” is not taking place\nanywhere\njust because everyone is waiting to see if the NYPD or the FBI are going to do anything? I mean, sure, I’m anticipating something to happen in the next 24 hours and putting up the occasional post, but in the meantime, I also finished editing John C. Wright’s latest book and got a number of other things done.\nA trap? A TRAP? Are you serious? Not only does belief, or disbelief, in the various rumors not preclude anyone from doing anything, it should be\ntotally freaking obvious\nthat\npretending to be a sexually abusive pedophile occultist\nis not a winning strategy for any political candidate, let alone a presidential one. I mean, the idiocy of that strategy is already a well-known meme!\nSeems likely, doesn’t it? Come on. Lose the cuck mindset. It’s a recipe for failure of every kind. If you’re living in fear that doing or saying something might give someone the opportunity to say that you were wrong, you’re\nalready\na chump.\nNow THIS is a campaign strategy. Rather good timing, wouldn’t you say?",
  "tags": [
    "#AltRight",
    "cuckservative",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-04T19:30:00+00:00"
}