{
  "url": "https://voxday.net/2016/11/04/to-be-or-not-to-be-today/",
  "scraped_at": "2025-12-18T02:02:58.931342",
  "title": "To be or not to be today",
  "date_display": "November 4, 2016",
  "date_iso": "2016-11-04T09:16:00+00:00",
  "date_from_url": "2016-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Looks like we’ll find out soon enough <a href=\"http://truepundit.com/breaking-comey-mandates-all-fbi-agents-report-to-d-c-offices-prep-for-raids-arrests-in-clinton-probes/\">if anything is going to be done</a> before the election about the alleged Podesta Code and the dark rumors that have been swirling around Hillary, Huma, and the Clinton Foundation:</p><blockquote><p> FBI Director James Comey issued a mandate late Thursday instructing all available special agents from the Washington D.C. field office and Hoover Building headquarters to report to work immediately, federal law enforcement sources told True Pundit.</p><p>“We’re preparing for many arrests from the top down,” the FBI source said. “I cannot elaborate beyond that.”</p><p>When pressed to better define what “from the top down” meant in terms of possible suspects, the source refused to elaborate.</p><p>“You’re a smart guy; read between the lines,” the source said.</p></blockquote><p>As to whether Truepundit merits being taken seriously, we do know that General Flynn appears to be taking it at face value:<br> <a href=\"https://twitter.com/GenFlynn/status/794000841518776320\"><br/></a><br> <a href=\"https://twitter.com/GenFlynn/status/794000841518776320\">General Flynn@GenFlynn</a> Nov 2<br> <i>U decide – NYPD Blows Whistle on New Hillary Emails: Money Laundering, Sex Crimes w Children, etc…MUST READ!</i></br></br></br></p><p>That tweet is particularly interesting in light of the fact that Lt. Gen. Michael T. Flynn, US Army (ret.) is one of Donald Trump’s advisors. The seriousness of the situation <i>may </i>be indicated by the fact that Trump has <i>NOT </i>yet tweeted any direct references to it; his usual pattern is to troll people whenever there is an angle to make them look bad. Whatever it is, he is almost certain to know more about it than we do.</p><p>Donald J. Trump ‏@realDonaldTrump  Nov 2 Orlando, FL<br> <i>After decades of lies and scandal, Crooked Hillary’s corruption is closing in. #DrainTheSwamp!</i></br></p><p>Like everyone else, I wonder why the information hasn’t been released to the public, if it is as bad as is presently being bruited about. But then, it does take time to prepare for an operation of the purported size and significance, and I have no doubt whatsoever that there have been various negotiations and discussions taking place behind closed doors concerning what must be done, what can be done, and what is going to happen regardless of what the authorities do.</p><p>Today would appear to be the day things would tend to expect things to go down, but we still haven’t seen WikiLeaks Phase Three and the only thing we know that appears to have happened is the movement of Anthony Weiner to a secure location. If anyone lives near an FBI special agent, perhaps you know if they happen to have worked late last night; other than that, we’re all still in the dark.</p><p>Regardless, let us hope and pray that the truth, whatever it is, comes to light soon.</p><p>It should be noted that, to their credit, some individuals in the media<a href=\"http://www.huffingtonpost.com/casar-vargas/why-i-can-no-longer-suppo_1_b_12698874.html\"> are already beginning to publicly recant their previous support</a> of Hillary Clinton.</p><blockquote><p> It took me a long time to write this. I had to dig deep into my being to come up with these words. I’m recanting my endorsement of Hillary Clinton for the presidency.</p><p>I’m aware of how vindictive Clintonians can be. I’m not speaking about the Clintons themselves, but of those surrounding them. Perhaps the saying is true: dime con quién andas y te diré quién eres. Your staff, your donors, your surrogates, and those you surround yourself with are a reflection of who you truly are, no? If not, why not curb any unacceptable behavior? Silence, indifference, or inaction is as incriminatory-at least to me.</p><p>There has been no repudiation, let alone denunciation, of what was said in those emails-just denial, finger pointing, and doublespeak. To appoint the very same folks who carried out many malicious behaviors to tip the scales for Hillary is just as unpardonable.</p></blockquote><p> UPDATE: It appears the FBI and NYPD will have to act today, if they want to do so before Anonymous and WikiLeaks <a href=\"http://www.milobookclub.com/2016/11/04/remember-remember-5th-of-november/\">celebrates the 5th of November</a> and everyone finds out what really happened.</p></div>",
  "content_text": "Looks like we’ll find out soon enough\nif anything is going to be done\nbefore the election about the alleged Podesta Code and the dark rumors that have been swirling around Hillary, Huma, and the Clinton Foundation:\nFBI Director James Comey issued a mandate late Thursday instructing all available special agents from the Washington D.C. field office and Hoover Building headquarters to report to work immediately, federal law enforcement sources told True Pundit.\n“We’re preparing for many arrests from the top down,” the FBI source said. “I cannot elaborate beyond that.”\nWhen pressed to better define what “from the top down” meant in terms of possible suspects, the source refused to elaborate.\n“You’re a smart guy; read between the lines,” the source said.\nAs to whether Truepundit merits being taken seriously, we do know that General Flynn appears to be taking it at face value:\nGeneral Flynn@GenFlynn\nNov 2\nU decide – NYPD Blows Whistle on New Hillary Emails: Money Laundering, Sex Crimes w Children, etc…MUST READ!\nThat tweet is particularly interesting in light of the fact that Lt. Gen. Michael T. Flynn, US Army (ret.) is one of Donald Trump’s advisors. The seriousness of the situation\nmay\nbe indicated by the fact that Trump has\nNOT\nyet tweeted any direct references to it; his usual pattern is to troll people whenever there is an angle to make them look bad. Whatever it is, he is almost certain to know more about it than we do.\nDonald J. Trump ‏@realDonaldTrump  Nov 2 Orlando, FL\nAfter decades of lies and scandal, Crooked Hillary’s corruption is closing in. #DrainTheSwamp!\nLike everyone else, I wonder why the information hasn’t been released to the public, if it is as bad as is presently being bruited about. But then, it does take time to prepare for an operation of the purported size and significance, and I have no doubt whatsoever that there have been various negotiations and discussions taking place behind closed doors concerning what must be done, what can be done, and what is going to happen regardless of what the authorities do.\nToday would appear to be the day things would tend to expect things to go down, but we still haven’t seen WikiLeaks Phase Three and the only thing we know that appears to have happened is the movement of Anthony Weiner to a secure location. If anyone lives near an FBI special agent, perhaps you know if they happen to have worked late last night; other than that, we’re all still in the dark.\nRegardless, let us hope and pray that the truth, whatever it is, comes to light soon.\nIt should be noted that, to their credit, some individuals in the media\nare already beginning to publicly recant their previous support\nof Hillary Clinton.\nIt took me a long time to write this. I had to dig deep into my being to come up with these words. I’m recanting my endorsement of Hillary Clinton for the presidency.\nI’m aware of how vindictive Clintonians can be. I’m not speaking about the Clintons themselves, but of those surrounding them. Perhaps the saying is true: dime con quién andas y te diré quién eres. Your staff, your donors, your surrogates, and those you surround yourself with are a reflection of who you truly are, no? If not, why not curb any unacceptable behavior? Silence, indifference, or inaction is as incriminatory-at least to me.\nThere has been no repudiation, let alone denunciation, of what was said in those emails-just denial, finger pointing, and doublespeak. To appoint the very same folks who carried out many malicious behaviors to tip the scales for Hillary is just as unpardonable.\nUPDATE: It appears the FBI and NYPD will have to act today, if they want to do so before Anonymous and WikiLeaks\ncelebrates the 5th of November\nand everyone finds out what really happened.",
  "tags": [
    "conspiracy",
    "law",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-04T09:16:00+00:00"
}