{
  "url": "https://voxday.net/2016/11/03/trump-shatters-50-percent-ceiling/",
  "scraped_at": "2025-12-18T02:02:49.483367",
  "title": "Trump shatters 50 percent ceiling",
  "date_display": "November 3, 2016",
  "date_iso": "2016-11-03T13:27:00+00:00",
  "date_from_url": "2016-11-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He also <a href=\"http://www.rasmussenreports.com/public_content/politics/elections/election_2016/white_house_watch_nov3\">leads by three</a> in the daily Rasmussen Reports’ poll:</p><blockquote class=\"tr_bq\"><p> Republican Donald Trump has a three-point lead in Rasmussen Reports’ White House Watch survey. Among voters who are certain how they will vote, Trump now has over 50% support. The latest national telephone and online survey of Likely U.S. Voters shows Trump leading Democratic nominee Hillary Clinton 45% to 42%.</p><p>Eighty-eight percent (88%) of voters say they are now certain how they will vote. Among these voters, Trump has a 10-point lead over Clinton – 53% to 43%.</p></blockquote><p>Hillary’s hope apparently rests with the undecideds and the Justice Department’s ability to silence the FBI and the NYPD. Translation: <i>Trumpslide!</i><br> <br> <i><br/></i><br> Meanwhile, <a href=\"https://twitter.com/hectormorenco\">Hector Morenco</a>, whoever that is, claims on Twitter that Obama is intending to pardon Hillary regardless of whether the FBI acts before or after the election:</br></br></br></p><blockquote><p> Hector Morenco ‏@hectormorenco Nov 1<br> Wow! Sorry more crazy info. Just told that Obama moving forward with presidential pardon regardless of outcome. God help us all! Going dark.</br></p><p>Hector Morenco ‏@hectormorenco Nov 1<br> Last tweet, FBI Trump faction wants to drag it out till Trump is in office. If HRC wins they will charge her after inauguration. Going dark.</br></p><p>Hector Morenco ‏@hectormorenco Nov 1<br> I’ve been told to pencils down on this one. Too dangerous.</br></p><p>Hector Morenco ‏@hectormorenco Nov 1<br> FBI sources, “Pro HRC faction within FBI trying to charge HRC this week so Obama can pardon. Pro Trump faction wants to wait till Nov 9th.”</br></p><p>Hector Morenco ‏@hectormorenco Nov 1<br> Then HRC will use her power to pardon Obama and the heist will be 100% legal.</br></p><p>Hector Morenco ‏@hectormorenco Nov 1<br> FBI won’t charge HRC before election because Obama will use power to pardon her. “If we release Weiner file before Nov. 8th she’ll walk.”</br></p><p>Hector Morenco ‏@hectormorenco Nov 1<br> Other sources in DOJ say Loretta Lynch &amp; Obama scrambling to use the Hatch Act to silence the FBI release of evidence from Weiner file.</br></p></blockquote><p>If Obama has to pardon her before the election, that will prove her criminality and seal the deal for Trump. If Obama is threatening to do so after the election, then there is no downside to acting before the election.</p><p>Doesn’t the FBI have anyone competent in Game Theory, or even basic logic?</p></div>",
  "content_text": "He also\nleads by three\nin the daily Rasmussen Reports’ poll:\nRepublican Donald Trump has a three-point lead in Rasmussen Reports’ White House Watch survey. Among voters who are certain how they will vote, Trump now has over 50% support. The latest national telephone and online survey of Likely U.S. Voters shows Trump leading Democratic nominee Hillary Clinton 45% to 42%.\nEighty-eight percent (88%) of voters say they are now certain how they will vote. Among these voters, Trump has a 10-point lead over Clinton – 53% to 43%.\nHillary’s hope apparently rests with the undecideds and the Justice Department’s ability to silence the FBI and the NYPD. Translation:\nTrumpslide!\nMeanwhile,\nHector Morenco\n, whoever that is, claims on Twitter that Obama is intending to pardon Hillary regardless of whether the FBI acts before or after the election:\nHector Morenco ‏@hectormorenco Nov 1\nWow! Sorry more crazy info. Just told that Obama moving forward with presidential pardon regardless of outcome. God help us all! Going dark.\nHector Morenco ‏@hectormorenco Nov 1\nLast tweet, FBI Trump faction wants to drag it out till Trump is in office. If HRC wins they will charge her after inauguration. Going dark.\nHector Morenco ‏@hectormorenco Nov 1\nI’ve been told to pencils down on this one. Too dangerous.\nHector Morenco ‏@hectormorenco Nov 1\nFBI sources, “Pro HRC faction within FBI trying to charge HRC this week so Obama can pardon. Pro Trump faction wants to wait till Nov 9th.”\nHector Morenco ‏@hectormorenco Nov 1\nThen HRC will use her power to pardon Obama and the heist will be 100% legal.\nHector Morenco ‏@hectormorenco Nov 1\nFBI won’t charge HRC before election because Obama will use power to pardon her. “If we release Weiner file before Nov. 8th she’ll walk.”\nHector Morenco ‏@hectormorenco Nov 1\nOther sources in DOJ say Loretta Lynch & Obama scrambling to use the Hatch Act to silence the FBI release of evidence from Weiner file.\nIf Obama has to pardon her before the election, that will prove her criminality and seal the deal for Trump. If Obama is threatening to do so after the election, then there is no downside to acting before the election.\nDoesn’t the FBI have anyone competent in Game Theory, or even basic logic?",
  "tags": [
    "conspiracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-03T13:27:00+00:00"
}