{
  "url": "https://voxday.net/2016/11/11/two-paths-for-alt-rig/",
  "scraped_at": "2025-12-18T02:04:29.445550",
  "title": "Two paths for the Alt-Right",
  "date_display": "November 11, 2016",
  "date_iso": "2016-11-11T13:00:00+00:00",
  "date_from_url": "2016-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wired predicts <a href=\"https://www.wired.com/2016/11/alt-right-will-fail-even-president-trump/?mbid=social_twitter\">in-fighting and failure for the Alt-Right</a>:</p><blockquote><p> The movement may soon find itself with a messaging problem. “Their whole attraction is they’re fighting to regain power,” says Gerstenfeld. “I don’t think they’ll do a good job spreading that message when they are in power and there’s nothing to fight against.” Gerstenfeld points out that the extremist militia groups that were common during Bill Clinton’s presidency all but disappeared during the George Bush years that followed. With Trump in the White House, it’ll be hard for the alt-right to argue that the American white male is disenfranchised. “People will stop caring,” Gerstenfeld says.</p><p>And though Taylor and David Duke and Breitbart’s Milo Yiannopoulos are exuberant about President Trump now, they might not always feel that way. “There’s a gaping hole between most Americans and the alt-right. He’s going to have to backtrack to govern all of us,” Painter says. “Is that going to inspire a Bundy brothers insurgency against him? I wouldn’t be surprised.” The Trump administration is not the early days of an alt-right America. It’s the beginning of a fringe group’s fall.</p></blockquote><p>This indicates an almost complete failure to even begin to grasp what the Alt-Right is, what it seeks to accomplish, or why it exists in the first place. Do they really believe that the Ascension of the God-Emperor to the Cherry Blossom Throne is going to instantly reverse the current demographic trends across the West? I certainly wish we could believe that, but a single national election is but a single small step in the process.</p><p>Richard Spencer’s article, <a href=\"http://www.radixjournal.com/blog/2016/11/9/we-the-vanguard-now#pq=4mlT8E\">We the Vanguard Now</a>, would appear to be considerably more relevant to life as we observe it on this particular planet at this particular point in time.</p><blockquote><p> The Alt Right is deeply connected to Trumpian populism in intellectual, spiritual, and visceral ways—for, as everyone agrees, Trump’s victory was, at its root, a victory of identity politics. And it was a campaign that ultimately dispensed with “conservatism” as we knew it. Because of this fact, Trump was opposed by most all components of the mainstream Right—from the neocons to establishment operatives to goofballs like Glenn Beck. And these forces opposed him with such vehemence that they simply cannot share in his victory.</p><p>In this way, the Alt Right, far more plausibly than the “conservative movement,” can lay claim to being the new Trumpian vanguard.</p><p>Before Trump, the Alt Right could be criticized for being a “head without a body”; it was engaged in meta-political and scientific discussion, but lacked a real connection with practical politics and the hopes and dreams of average Americans. In turn, Trump’s populism—with its half-baked policy ideas and sketchy vision of the future—could be criticized as a “body without a head.”</p><p>Now we are the whole man. The Alt Right and Trumpian populism are now aligned much in the way the Left is aligned with Democratic politicians like Obama and Hillary. The American Right always lacked a true vanguard. In the form of “conservatives,” it had only a “rearguard” or “muffle” or “hall monitor.” We—and only we—can say the things Trump can’t say . . . can criticize him in the right way . . . and can envision a new world that he can’t quite grasp.</p></blockquote><p>This is why Richard is so important to the Alt-Right. He has a long-term strategic vision, the accuracy of which is capable of balancing any number of tactical missteps. While I don’t share his tactical objectives – I have no interest in think tanks, journals, speaking tours, conferences, or the various institutions of Greater Academia – I support them nevertheless, just as I support the various and divergent tactical objectives of other Alt-Right allies such as Milo, Mike, Stefan, Andrew, Greg, and others.</p><p>What the Left does not understand, indeed, what it may be incapable of understanding, is that most of us in the Alt-Right are not power-hungry or fame whores. (I said most, not all.) Most of us have been driven to the point of action, driven to the point of standing up and speaking out publicly, by a Left that would simply<i> not leave us alone</i> to live in peace and freedom. We are rising up and we are speaking out because we have no other choice, because our only other option is surrender and submission to intellectual slavery.</p><p>And if, in order to be left alone to live as we see fit, we have to band together, put on our armored battlesuits, and march in the name of the God-Emperor to eradicate every remnant of SJW that survives anywhere in the world with all the fanaticism of the Spanish Inquisition unrestrained by Pope, King, or Queen, then <i>that is precisely what we will do</i>. We are the vanguard now. We are the God-Emperor’s shock troops. We are Les Deplorables and WE. DON’T. CARE.</p><p>All they had to do was leave us alone. They wouldn’t do that. So, the Alt-Right will not leave them alone.</p></div>",
  "content_text": "Wired predicts\nin-fighting and failure for the Alt-Right\n:\nThe movement may soon find itself with a messaging problem. “Their whole attraction is they’re fighting to regain power,” says Gerstenfeld. “I don’t think they’ll do a good job spreading that message when they are in power and there’s nothing to fight against.” Gerstenfeld points out that the extremist militia groups that were common during Bill Clinton’s presidency all but disappeared during the George Bush years that followed. With Trump in the White House, it’ll be hard for the alt-right to argue that the American white male is disenfranchised. “People will stop caring,” Gerstenfeld says.\nAnd though Taylor and David Duke and Breitbart’s Milo Yiannopoulos are exuberant about President Trump now, they might not always feel that way. “There’s a gaping hole between most Americans and the alt-right. He’s going to have to backtrack to govern all of us,” Painter says. “Is that going to inspire a Bundy brothers insurgency against him? I wouldn’t be surprised.” The Trump administration is not the early days of an alt-right America. It’s the beginning of a fringe group’s fall.\nThis indicates an almost complete failure to even begin to grasp what the Alt-Right is, what it seeks to accomplish, or why it exists in the first place. Do they really believe that the Ascension of the God-Emperor to the Cherry Blossom Throne is going to instantly reverse the current demographic trends across the West? I certainly wish we could believe that, but a single national election is but a single small step in the process.\nRichard Spencer’s article,\nWe the Vanguard Now\n, would appear to be considerably more relevant to life as we observe it on this particular planet at this particular point in time.\nThe Alt Right is deeply connected to Trumpian populism in intellectual, spiritual, and visceral ways—for, as everyone agrees, Trump’s victory was, at its root, a victory of identity politics. And it was a campaign that ultimately dispensed with “conservatism” as we knew it. Because of this fact, Trump was opposed by most all components of the mainstream Right—from the neocons to establishment operatives to goofballs like Glenn Beck. And these forces opposed him with such vehemence that they simply cannot share in his victory.\nIn this way, the Alt Right, far more plausibly than the “conservative movement,” can lay claim to being the new Trumpian vanguard.\nBefore Trump, the Alt Right could be criticized for being a “head without a body”; it was engaged in meta-political and scientific discussion, but lacked a real connection with practical politics and the hopes and dreams of average Americans. In turn, Trump’s populism—with its half-baked policy ideas and sketchy vision of the future—could be criticized as a “body without a head.”\nNow we are the whole man. The Alt Right and Trumpian populism are now aligned much in the way the Left is aligned with Democratic politicians like Obama and Hillary. The American Right always lacked a true vanguard. In the form of “conservatives,” it had only a “rearguard” or “muffle” or “hall monitor.” We—and only we—can say the things Trump can’t say . . . can criticize him in the right way . . . and can envision a new world that he can’t quite grasp.\nThis is why Richard is so important to the Alt-Right. He has a long-term strategic vision, the accuracy of which is capable of balancing any number of tactical missteps. While I don’t share his tactical objectives – I have no interest in think tanks, journals, speaking tours, conferences, or the various institutions of Greater Academia – I support them nevertheless, just as I support the various and divergent tactical objectives of other Alt-Right allies such as Milo, Mike, Stefan, Andrew, Greg, and others.\nWhat the Left does not understand, indeed, what it may be incapable of understanding, is that most of us in the Alt-Right are not power-hungry or fame whores. (I said most, not all.) Most of us have been driven to the point of action, driven to the point of standing up and speaking out publicly, by a Left that would simply\nnot leave us alone\nto live in peace and freedom. We are rising up and we are speaking out because we have no other choice, because our only other option is surrender and submission to intellectual slavery.\nAnd if, in order to be left alone to live as we see fit, we have to band together, put on our armored battlesuits, and march in the name of the God-Emperor to eradicate every remnant of SJW that survives anywhere in the world with all the fanaticism of the Spanish Inquisition unrestrained by Pope, King, or Queen, then\nthat is precisely what we will do\n. We are the vanguard now. We are the God-Emperor’s shock troops. We are Les Deplorables and WE. DON’T. CARE.\nAll they had to do was leave us alone. They wouldn’t do that. So, the Alt-Right will not leave them alone.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-11T13:00:00+00:00"
}