{
  "url": "https://voxday.net/2016/11/14/wants-to-burn-it-down/",
  "scraped_at": "2025-12-18T02:05:00.882500",
  "title": "WANTS to burn it down?",
  "date_display": "November 14, 2016",
  "date_iso": "2016-11-14T15:30:00+00:00",
  "date_from_url": "2016-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What do they think happened on November 8th? I would say that we are well on the way toward burning American politics as we knew it to the ground, as the ongoing <a href=\"http://www.dailywire.com/news/9441/actual-conservatives-guide-alt-right-8-things-you-michael-knowles#\">conservative freak-out over the Alt-Right’s rise</a>, as most recently signified by Steve Bannon’s assignation as Chief White House Strategist.</p><blockquote><p> The Alt-Right wants to burn American politics to the ground.</p><p>The Alt-Right most immediately opposes conservatism, as Youth for Western Civilization founder Kevin Deanna explained in his Taki’s Magazine and AlternativeRight.com piece titled “The Impossibility of Conservatism.” The Alt-Right contains a who’s-who of right-wing voices that have been “purged” from the conservative movement by William F. Buckley and National Review, like Peter Brimelow and John Derbyshire, and Alt-Right leaders like Vox Day described the movement in an interview as “the heirs to those like the John Birch Society who were read out of the conservative movement.” Steve Bannon, who refashioned the website of conservative icon Andrew Breitbart into “the platform for the Alt-Right,” has encouraged activists to “turn on the hate” and “burn this bitch down.”</p><p>But while conservatism is its most immediate target, the Alt-Right seeks to destroy a far older, more central American idea referenced frequently by Ronald Reagan and dating back beyond Abraham Lincoln’s Gettysburg Address and Alexis de Tocqueville’s Democracy In America to John Winthrop’s “City On A Hill” sermon: America as a proposition nation.</p></blockquote><p>As John Red Eagle and I chronicled in detail in <b><i><a href=\"http://amzn.to/1tkcuFi\">Cuckservative: How “Conservatives” Betrayed America</a></i></b>, conservatism has not only failed, it was <i>always </i>doomed to eventual failure by virtue of its very nature. It was an attitude and a defensive posture, not a coherent ideology or an identity, and it lacked positive objectives, so it never had any hope of resisting the relentless ideological onslaught of the Left.</p><p>And the concept of America as a proposition nation is not only historically false, it is logically and empirically untrue. It’s trivially easy to demonstrate with a number of different logical syllogisms. For example:</p><ol><li>X agrees with, and subscribes to, the proposition that defines America.</li><li>X is not an American citizen.</li><li>Therefore, X’s American citizenship does not rely upon the proposition.</li><li>Y disagrees with, and rejects, the proposition that defines America.</li><li>Y is an American citizen.</li><li>Therefore, Y’s American citizenship does not rely upon the proposition.</li><li>Neither an American’s citizenship, nor a non-citizen’s lack of citizenship depends upon his acceptance, or rejection, of the proposition.</li><li>Therefore America is not a proposition nation.</li></ol><p>Notice that this all-important proposition <i>is never actually defined</i>. The proposition is hinted at, alluded to, and various names are dropped, but the proposition itself remains nebulous. It’s not a coincidence that this lack of definition is precisely the same as the way the Left fails to define what is, and what is not, politically correct, or morally right, because in all three cases, there is a void at the center that allows the non-definer to play the role as subjective judge rather than permit any objective observer to do so on the basis of a specific, identifiable definition.</p><p><i>There is no proposition.</i> There is no such thing as a nation based on a proposition. And there is no such thing as a nation based on a nonexistent proposition. All the concept of “the proposition nation” was intended to do was to destroy the actual, material, cultural, Christian, ethnic American nation on behalf of the second-wave immigrants to the United States, who did not belong to the nation, but wanted to be able to claim that they did.</p><p>On a tangential note, the author of <i><b><a href=\"http://amzn.to/2dUdBpa\">The Nine Laws</a></b></i>, Ivan Throne, did an interview entitled <a href=\"http://darktriadman.com/2016/11/14/future-god-emperor-ivan-throne-troublesome-radio/\">Your Future Under the God-Emperor</a> with Troublesome Radio.</p></div>",
  "content_text": "What do they think happened on November 8th? I would say that we are well on the way toward burning American politics as we knew it to the ground, as the ongoing\nconservative freak-out over the Alt-Right’s rise\n, as most recently signified by Steve Bannon’s assignation as Chief White House Strategist.\nThe Alt-Right wants to burn American politics to the ground.\nThe Alt-Right most immediately opposes conservatism, as Youth for Western Civilization founder Kevin Deanna explained in his Taki’s Magazine and AlternativeRight.com piece titled “The Impossibility of Conservatism.” The Alt-Right contains a who’s-who of right-wing voices that have been “purged” from the conservative movement by William F. Buckley and National Review, like Peter Brimelow and John Derbyshire, and Alt-Right leaders like Vox Day described the movement in an interview as “the heirs to those like the John Birch Society who were read out of the conservative movement.” Steve Bannon, who refashioned the website of conservative icon Andrew Breitbart into “the platform for the Alt-Right,” has encouraged activists to “turn on the hate” and “burn this bitch down.”\nBut while conservatism is its most immediate target, the Alt-Right seeks to destroy a far older, more central American idea referenced frequently by Ronald Reagan and dating back beyond Abraham Lincoln’s Gettysburg Address and Alexis de Tocqueville’s Democracy In America to John Winthrop’s “City On A Hill” sermon: America as a proposition nation.\nAs John Red Eagle and I chronicled in detail in\nCuckservative: How “Conservatives” Betrayed America\n, conservatism has not only failed, it was\nalways\ndoomed to eventual failure by virtue of its very nature. It was an attitude and a defensive posture, not a coherent ideology or an identity, and it lacked positive objectives, so it never had any hope of resisting the relentless ideological onslaught of the Left.\nAnd the concept of America as a proposition nation is not only historically false, it is logically and empirically untrue. It’s trivially easy to demonstrate with a number of different logical syllogisms. For example:\nX agrees with, and subscribes to, the proposition that defines America.\nX is not an American citizen.\nTherefore, X’s American citizenship does not rely upon the proposition.\nY disagrees with, and rejects, the proposition that defines America.\nY is an American citizen.\nTherefore, Y’s American citizenship does not rely upon the proposition.\nNeither an American’s citizenship, nor a non-citizen’s lack of citizenship depends upon his acceptance, or rejection, of the proposition.\nTherefore America is not a proposition nation.\nNotice that this all-important proposition\nis never actually defined\n. The proposition is hinted at, alluded to, and various names are dropped, but the proposition itself remains nebulous. It’s not a coincidence that this lack of definition is precisely the same as the way the Left fails to define what is, and what is not, politically correct, or morally right, because in all three cases, there is a void at the center that allows the non-definer to play the role as subjective judge rather than permit any objective observer to do so on the basis of a specific, identifiable definition.\nThere is no proposition.\nThere is no such thing as a nation based on a proposition. And there is no such thing as a nation based on a nonexistent proposition. All the concept of “the proposition nation” was intended to do was to destroy the actual, material, cultural, Christian, ethnic American nation on behalf of the second-wave immigrants to the United States, who did not belong to the nation, but wanted to be able to claim that they did.\nOn a tangential note, the author of\nThe Nine Laws\n, Ivan Throne, did an interview entitled\nYour Future Under the God-Emperor\nwith Troublesome Radio.",
  "tags": [
    "#AltRight",
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-14T15:30:00+00:00"
}