{
  "url": "https://voxday.net/2016/11/26/western-civilization-is-european/",
  "scraped_at": "2025-12-18T02:07:05.315899",
  "title": "Western civilization is European",
  "date_display": "November 26, 2016",
  "date_iso": "2016-11-26T10:41:00+00:00",
  "date_from_url": "2016-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And European-only, the ahistorical fever dreams of cucks and neocons notwithstanding. Immigration is more than merely dyscivic, <a href=\"http://newobserveronline.com/berlin-invader-crime-halts-dhl-deliveries/\">it is observably dyscivilizational</a>.</p><blockquote><p> Violent attacks on personnel, robberies, and fraud have forced DHL Express to halt all deliveries in the invader-overrun region of Wedding, north-west Berlin, a statement from the company has announced.</p><p>Wedding has a “German-origin” population of only 50 percent, with the rest being made up of Africans, Turks, Arabs, Asians, and Eastern European gypsies.</p><p>According to a statement issued to Rundfunk Berlin-Brandenburg (RBB) by Anke Blenn, the reason for the halt in delivery services is because of the increasing number of “attacks on drivers” and rampant fraud and robberies to which they are being subjected. As a result, parcel recipients will from now on have to collect their items from a DHL office, where the identity of the recipient can then be checked, she added.</p></blockquote><p>Forget home delivery. A minority-European population in a Western country isn’t even going to have flush toilets or functioning dishwashers for very long. If white workers can’t even drop off a package safely, they sure as Hell aren’t going to enter a stranger’s home and stay there for hours.</p><p>The thing that is so ludicrously stupid about the equalitarian position shared by American liberals and conservatives alike is that it assumes because reasonably digestible numbers of European immigrants were semi-successfully assimilated with only one massive civil war followed by 60 years of virtually no immigration, an unlimited number of non-European immigrants can be permitted to enter the country indefinitely.</p><p>This is not merely bad logic. This is insane. There is no way – none – to rationally defend or justify the position, which is why its defenders immediately retreat to abstract ideals and pure rhetoric.</p><p>The invasion of 60 million immigrants in 50 years, the largest invasion in human history, <i>will </i>lead to war in the United States. There is ZERO question of this, as it is only a matter of time. We can’t know when it will happen, we can’t know exactly why it will happen, but given the fact that the USA is <i>already</i> at a stress level that was last seen in 1856, the odds are against the USA even making it to the 2033 date I had predicted for financial collapse and some form of political dissolution. Keep in mind that I neither created nor calculated the Popular Wellbeing Index or the Political Stress Index, I have merely independently observed some of the factors that go into those cliodynamic metrics.</p><p>There will also be continuing conflict in Europe, but given the rapid rise of the nationalist parties, something more akin to Operation Wetback and the Chinese Exclusion Act are more likely.</p><p>So, cry Racism, Constitution, Declaration, and Proposition Nation all you like. Virtue-signal your color-blindness all you like. Adopt one child of every color if you want. None of that frantic appeal to totem magic will save you from what is to come any more than it would have in 1861, in 1914, or 1939. None of that is going to excuse your complicity in the nightmares to come. And regardless of what you think of it, understand that the Alt-Right program is the only one that even has the <i>possibility</i> of averting the coming conflict.</p></div>",
  "content_text": "And European-only, the ahistorical fever dreams of cucks and neocons notwithstanding. Immigration is more than merely dyscivic,\nit is observably dyscivilizational\n.\nViolent attacks on personnel, robberies, and fraud have forced DHL Express to halt all deliveries in the invader-overrun region of Wedding, north-west Berlin, a statement from the company has announced.\nWedding has a “German-origin” population of only 50 percent, with the rest being made up of Africans, Turks, Arabs, Asians, and Eastern European gypsies.\nAccording to a statement issued to Rundfunk Berlin-Brandenburg (RBB) by Anke Blenn, the reason for the halt in delivery services is because of the increasing number of “attacks on drivers” and rampant fraud and robberies to which they are being subjected. As a result, parcel recipients will from now on have to collect their items from a DHL office, where the identity of the recipient can then be checked, she added.\nForget home delivery. A minority-European population in a Western country isn’t even going to have flush toilets or functioning dishwashers for very long. If white workers can’t even drop off a package safely, they sure as Hell aren’t going to enter a stranger’s home and stay there for hours.\nThe thing that is so ludicrously stupid about the equalitarian position shared by American liberals and conservatives alike is that it assumes because reasonably digestible numbers of European immigrants were semi-successfully assimilated with only one massive civil war followed by 60 years of virtually no immigration, an unlimited number of non-European immigrants can be permitted to enter the country indefinitely.\nThis is not merely bad logic. This is insane. There is no way – none – to rationally defend or justify the position, which is why its defenders immediately retreat to abstract ideals and pure rhetoric.\nThe invasion of 60 million immigrants in 50 years, the largest invasion in human history,\nwill\nlead to war in the United States. There is ZERO question of this, as it is only a matter of time. We can’t know when it will happen, we can’t know exactly why it will happen, but given the fact that the USA is\nalready\nat a stress level that was last seen in 1856, the odds are against the USA even making it to the 2033 date I had predicted for financial collapse and some form of political dissolution. Keep in mind that I neither created nor calculated the Popular Wellbeing Index or the Political Stress Index, I have merely independently observed some of the factors that go into those cliodynamic metrics.\nThere will also be continuing conflict in Europe, but given the rapid rise of the nationalist parties, something more akin to Operation Wetback and the Chinese Exclusion Act are more likely.\nSo, cry Racism, Constitution, Declaration, and Proposition Nation all you like. Virtue-signal your color-blindness all you like. Adopt one child of every color if you want. None of that frantic appeal to totem magic will save you from what is to come any more than it would have in 1861, in 1914, or 1939. None of that is going to excuse your complicity in the nightmares to come. And regardless of what you think of it, understand that the Alt-Right program is the only one that even has the\npossibility\nof averting the coming conflict.",
  "tags": [
    "#AltRight",
    "decline and fall",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-26T10:41:00+00:00"
}