{
  "url": "https://voxday.net/2016/11/16/writing-sundries/",
  "scraped_at": "2025-12-18T02:05:28.159899",
  "title": "Writing sundries",
  "date_display": "November 16, 2016",
  "date_iso": "2016-11-16T23:51:00+00:00",
  "date_from_url": "2016-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, here is the bad news, the good news, and a few other things.</p><ol><li>There is no way I’m going to complete A SEA OF SKULLS, get it edited, and get it out before Christmas. It’s just not happening. Even if I downed tools on everyone else’s books, ignored Infogalactic, and only did one blog post a day, it would be cutting it close. And I’m not going to do any of those things.</li><li>However, as someone observed that a) what I already have written is on the order of four times longer than other novels we publish, b) it’s arguably better than ATOB, and c) people have been waiting a long time for it, I was inspired to concoct a plan that I thought might be of interest to Selenoth fans.</li></ol><p>You may recall George Martin won the 1997 Hugo Award for Best Novella for “Blood of the Dragon”, which was actually the Danerys chapters from A GAME OF THRONES. You may also note that Amazon permits the updating of ebook files.</p><p>So, I said to our Production Editor, what if we release a version of A SEA OF SKULLS that is somewhere between 100k and 120k words, sell it for a reduced price of $5.99, then update the file in the spring to the full 295k-word version and let everyone update the file, after which we’ll raise the price to the full $7.99 we intend to charge for the whole book? That will give all the early readers a discount as well as the chance to return to Selenoth before the end of the year, even if the full experience of Book Two will have to wait. He said, “I would go for that.” So, we decided to see what you think of the idea.</p><p>Anyhow, I’m sorry to disappoint you all in this regard, but it is an option. If you think it’s a good idea, let us know in the comments. If you think it’s a stupid idea, please feel free do the same. Regardless, I will promise that the full version a) will be finished and b) no one who buys the initial version will have to pay any more to get the rest of it. I’m not Scalzi and Castalia House is not Tor; I’m not going to divide it into 10 30k parts, sell them all for a dollar, then package them together and resell the whole thing to you again. If you buy the initial version, you’ll get the whole thing. Eventually.</p><p>However, I do have some good news regarding Selenoth. First, we have an audiobook in the works. The English narrator is warming up on the smaller books, but he does intend to tackle both A THRONE OF BONES and A SEA OF SKULLS in 2017. Second, both hardcover and paperback versions of A THRONE OF BONES will be available in time for Christmas. They’ll be monsters, running around 915 pages, case laminate for the hardcover, and slightly taller than the Marcher Lord editions. We’ll also be using Garamond for the font.</p><p>In other news, I’m happy to say that my next non-fiction book will be about the Alt-Right and it will be out before summer. I’m working with a co-writer whom I will not presently identify, but let’s just say it is going to be every bit as hard-hitting and relevant and accurate as <i>SJWAL</i> and <i>Cuckservative</i>.</p><p>And finally, I can promise a new John C. Wright novel before Christmas, possibly even before the end of this month. This is Book Three of <i>Moth &amp; Cobweb</i>.</p><p>You may now proceed with your best Vox RR Day jokes….</p></div>",
  "content_text": "So, here is the bad news, the good news, and a few other things.\nThere is no way I’m going to complete A SEA OF SKULLS, get it edited, and get it out before Christmas. It’s just not happening. Even if I downed tools on everyone else’s books, ignored Infogalactic, and only did one blog post a day, it would be cutting it close. And I’m not going to do any of those things.\nHowever, as someone observed that a) what I already have written is on the order of four times longer than other novels we publish, b) it’s arguably better than ATOB, and c) people have been waiting a long time for it, I was inspired to concoct a plan that I thought might be of interest to Selenoth fans.\nYou may recall George Martin won the 1997 Hugo Award for Best Novella for “Blood of the Dragon”, which was actually the Danerys chapters from A GAME OF THRONES. You may also note that Amazon permits the updating of ebook files.\nSo, I said to our Production Editor, what if we release a version of A SEA OF SKULLS that is somewhere between 100k and 120k words, sell it for a reduced price of $5.99, then update the file in the spring to the full 295k-word version and let everyone update the file, after which we’ll raise the price to the full $7.99 we intend to charge for the whole book? That will give all the early readers a discount as well as the chance to return to Selenoth before the end of the year, even if the full experience of Book Two will have to wait. He said, “I would go for that.” So, we decided to see what you think of the idea.\nAnyhow, I’m sorry to disappoint you all in this regard, but it is an option. If you think it’s a good idea, let us know in the comments. If you think it’s a stupid idea, please feel free do the same. Regardless, I will promise that the full version a) will be finished and b) no one who buys the initial version will have to pay any more to get the rest of it. I’m not Scalzi and Castalia House is not Tor; I’m not going to divide it into 10 30k parts, sell them all for a dollar, then package them together and resell the whole thing to you again. If you buy the initial version, you’ll get the whole thing. Eventually.\nHowever, I do have some good news regarding Selenoth. First, we have an audiobook in the works. The English narrator is warming up on the smaller books, but he does intend to tackle both A THRONE OF BONES and A SEA OF SKULLS in 2017. Second, both hardcover and paperback versions of A THRONE OF BONES will be available in time for Christmas. They’ll be monsters, running around 915 pages, case laminate for the hardcover, and slightly taller than the Marcher Lord editions. We’ll also be using Garamond for the font.\nIn other news, I’m happy to say that my next non-fiction book will be about the Alt-Right and it will be out before summer. I’m working with a co-writer whom I will not presently identify, but let’s just say it is going to be every bit as hard-hitting and relevant and accurate as\nSJWAL\nand\nCuckservative\n.\nAnd finally, I can promise a new John C. Wright novel before Christmas, possibly even before the end of this month. This is Book Three of\nMoth & Cobweb\n.\nYou may now proceed with your best Vox RR Day jokes….",
  "tags": [
    "Castalia House",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-11-16T23:51:00+00:00"
}