{
  "url": "https://voxday.net/2022/02/24/a-tale-of-two-narratives/",
  "scraped_at": "2026-01-08T13:10:28.819517",
  "title": "A Tale of Two Narratives",
  "date_display": "February 24, 2022",
  "date_iso": "2022-02-24T10:24:27+00:00",
  "date_from_url": "2022-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Russia announces <a href=\"https://www.rt.com/russia/550426-ukrainian-air-defense-systems-suppressed/\">a “special military operation”</a> intended to demilitarize and denazify Ukraine:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Russia has taken out Ukraine’s air defenses and airforce with a series of precision attacks, the country’s Defense Ministry has said in a statement, after airports and runways across the country were rocked by explosions.</p><p>Officials also claimed on Thursday morning that Ukrainian border guards are not resisting advancing Russian troops, who have moved in after President Vladimir Putin signed an order to begin a “special operation” in the Donbass. At the same time, officials denied claims made by Kiev’s defense chiefs that Russia had lost at least one military plane over the country during the offensive.</p><p>In an earlier statement, Moscow reported that it was carrying out strikes at elements of Ukraine’s military infrastructure. Russia launched the offensive against Ukraine on Thursday morning on the orders of President Vladimir Putin, who said the goal of the operation was to demilitarize and “de-Nazify” Ukraine.</p><p>The Russian leader claimed military action was necessary to stop Ukrainian attacks on the two breakaway regions of Donetsk and Lugansk, which Moscow recognized as sovereign states on Monday. He claimed Russia could come under attack by Ukrainian radicals, unless their influence in the country is diminished, and accused Western nations of arming Kiev against Russia.</p></blockquote><p>The Western media, on the other hand, reports a “Ukraine in flames” and <a href=\"https://www.dailymail.co.uk/news/article-10545389/BREAKING-NEWS-Explosions-heard-Ukraine-port-city-Mariupol.html\">a “full-scale invasion”</a> by Russia.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>War in Ukraine begins as Putin launches full-scale invasion: Missiles rain down on Kharkiv and tanks roll across border from Belarus as ‘hundreds’ of Ukrainians die, martial law is declared and five Russian jets are shot down.</p><p>Ukraine’s president Volodymyr Zelenskyy has imposed martial law and defiantly urged his people to stay home after warmonger Vladimir Putin launched an invasion of Russia’s neighbour, plunging mainland Europe into its worst military crisis in decades.</p><p>In a video message published on Facebook after the Kremlin began its attacks, Zelenskyy said Moscow had carried out missile strikes on Ukrainian infrastructure and border guards, and that explosions had been heard in many cities, in the north, south and east of the country.</p><p>Later, the President cut diplomatic ties with Russia and pleaded with Western leaders to provide large-scale defence support and to protect Ukraine’s airspace from the ‘aggressor’.</p><p>Major General Valeriy Zaluzhny, Commander-in-Chief of the Armed Forces of Ukraine, said this morning that he had received orders from the Ukrainian President to repel Russia’s invasion by inflicting ‘maximum losses’. The Ukrainian military claim to have killed ‘50 Russian occupiers’ so far today, shooting down six Russian planes in the process.</p></blockquote><p>The mere fact that the Jewish comedian at the head of the neocons’ puppet government is still in a position to impose martial law tends to indicate that the Western media narrative is false. It’s fascinating to see the difference between the way a) Russian missile strikes on Ukraine, b) Israeli missile strikes on Syria, and c) US missile strikes, well, pretty much anywhere, are reported. It’s also informative to note the restrained tone of the Russian statements in comparison with the Baghdad Bob-style statements being issued by the Ukrainians.</p><p>This doesn’t mean that Russia won’t launch a “full-scale invasion”. But a close reading of the reports does not tend to currently support the media’s “official story” and we’ll know who is telling the truth if Kiev isn’t completely occupied by Russian troops by the end of the weekend.</p><p>There is also a third narrative, as Clandestine notes that the location of the reported Russian strikes appears to be suspiciously in harmony with the location of <a href=\"https://threadreaderapp.com/thread/1496745429672857602.html\">the US bioweapon laboratories in Ukraine</a>. But I doubt we’ll hear much about this narrative even if it is the most consistent with what’s actually happening.</p><p>Always keep in mind that the official story as reported by the media is the one thing you can be certain is not true. I’m confident it will shock the media to discover how much support Putin has across the West, especially after two years of unrestrained vaccine dictatorship on the part of the so-called liberal democracies. The media is already openly stating that “this is not just an attack on Ukraine, it is an attack on the Western liberal democracy system and the entire Free World.”</p><p>I, for one, certainly hope so. It’s long past time to end Clownworld and its unrestrained satanry.</p><p>China has already signaled its support for Putin’s protection of the Donbass republics, has blamed the situation on the USA, and is publicly encouraging everyone else <a href=\"https://www.globaltimes.cn/page/202202/1252930.shtml\">to stay out of the conflict</a>, so I very much doubt NATO forces are going to get directly involved regardless of how comprehensive the Russian operations turn out to be.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It should be noted that it is very regrettable that the Ukrainian issue has evolved so far. The US has continued its intensive containment on Russia, which finally forced Russia to try to realize its security demands in such a way. This is the outburst of the dissatisfaction of the party whose security demands have been ignored for a long time since the end of the Cold War… all sides should leave some space for Russia and Ukraine to solve the problems. Confrontation, sanctions, or even a direct battle will not help ease tensions. The flames scattered in eastern Ukraine are reminding all parties of the fact that blindly imposing pressure will only lead to an escalation of conflicts.</p><cite>All sides should give Russia, Ukraine some space to resolve issue, <em>Global Times</em>, 23 February 2022</cite></blockquote><p>But no one knows precisely how this will develop, and don’t believe anyone who claims they do.</p><p><strong>UPDATE: </strong>It appears the Ukrainian military <a href=\"https://www.rt.com/news/550434-romania-intecepts-ukrainian-jet/\">is already running</a> away.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Romania scrambled two F-16 Fighting Falcon jets on Thursday morning to intercept a foreign military aircraft, the country’s defense ministry has said. The intercepted target was identified as a Ukrainian Air Force Sukhoi Su-27 air superiority fighter jet. It was directed to land at a military base near the city of Bacau in eastern Romania, the statement said. The ministry said the pilot of the Ukrainian jet surrendered himself to the Romanian authorities.</p></blockquote><p><strong>UPDATE: </strong>This may mark the end of the European Union before this is all over. Putin now has the option to take the EU’s rhetoric literally. If the EU wants war with Russia, Russia is more than capable of giving it to them, and very, very few of the EU member states are even remotely interested in fighting Russia. And breaking up the EU is absolutely in Russia’s interest.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>We condemn Russia’s unprecedented military aggression against Ukraine. It must withdraw its military and fully respect Ukraine’s territorial integrity. The EU leaders will discuss and swiftly adopt further restrictive measures against Russia. The EU stands with Ukraine.</p><cite>EU President Ursula van der Leyen</cite></blockquote><p><strong>UPDATE:</strong> Don’t expect NATO to do anything except issue strongly-worded statements to the press. As literally everyone except the neocons and their puppet government expected, the European militaries have no intention of fighting the Russian army.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“There will be no military confrontation between NATO and Russia,” – head of the German Bundestag Committee on Defense.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/781f1c3d-b435-4399-ad9a-5b09c65434c3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Russia announces\na “special military operation”\nintended to demilitarize and denazify Ukraine:\nRussia has taken out Ukraine’s air defenses and airforce with a series of precision attacks, the country’s Defense Ministry has said in a statement, after airports and runways across the country were rocked by explosions.\nOfficials also claimed on Thursday morning that Ukrainian border guards are not resisting advancing Russian troops, who have moved in after President Vladimir Putin signed an order to begin a “special operation” in the Donbass. At the same time, officials denied claims made by Kiev’s defense chiefs that Russia had lost at least one military plane over the country during the offensive.\nIn an earlier statement, Moscow reported that it was carrying out strikes at elements of Ukraine’s military infrastructure. Russia launched the offensive against Ukraine on Thursday morning on the orders of President Vladimir Putin, who said the goal of the operation was to demilitarize and “de-Nazify” Ukraine.\nThe Russian leader claimed military action was necessary to stop Ukrainian attacks on the two breakaway regions of Donetsk and Lugansk, which Moscow recognized as sovereign states on Monday. He claimed Russia could come under attack by Ukrainian radicals, unless their influence in the country is diminished, and accused Western nations of arming Kiev against Russia.\nThe Western media, on the other hand, reports a “Ukraine in flames” and\na “full-scale invasion”\nby Russia.\nWar in Ukraine begins as Putin launches full-scale invasion: Missiles rain down on Kharkiv and tanks roll across border from Belarus as ‘hundreds’ of Ukrainians die, martial law is declared and five Russian jets are shot down.\nUkraine’s president Volodymyr Zelenskyy has imposed martial law and defiantly urged his people to stay home after warmonger Vladimir Putin launched an invasion of Russia’s neighbour, plunging mainland Europe into its worst military crisis in decades.\nIn a video message published on Facebook after the Kremlin began its attacks, Zelenskyy said Moscow had carried out missile strikes on Ukrainian infrastructure and border guards, and that explosions had been heard in many cities, in the north, south and east of the country.\nLater, the President cut diplomatic ties with Russia and pleaded with Western leaders to provide large-scale defence support and to protect Ukraine’s airspace from the ‘aggressor’.\nMajor General Valeriy Zaluzhny, Commander-in-Chief of the Armed Forces of Ukraine, said this morning that he had received orders from the Ukrainian President to repel Russia’s invasion by inflicting ‘maximum losses’. The Ukrainian military claim to have killed ‘50 Russian occupiers’ so far today, shooting down six Russian planes in the process.\nThe mere fact that the Jewish comedian at the head of the neocons’ puppet government is still in a position to impose martial law tends to indicate that the Western media narrative is false. It’s fascinating to see the difference between the way a) Russian missile strikes on Ukraine, b) Israeli missile strikes on Syria, and c) US missile strikes, well, pretty much anywhere, are reported. It’s also informative to note the restrained tone of the Russian statements in comparison with the Baghdad Bob-style statements being issued by the Ukrainians.\nThis doesn’t mean that Russia won’t launch a “full-scale invasion”. But a close reading of the reports does not tend to currently support the media’s “official story” and we’ll know who is telling the truth if Kiev isn’t completely occupied by Russian troops by the end of the weekend.\nThere is also a third narrative, as Clandestine notes that the location of the reported Russian strikes appears to be suspiciously in harmony with the location of\nthe US bioweapon laboratories in Ukraine\n. But I doubt we’ll hear much about this narrative even if it is the most consistent with what’s actually happening.\nAlways keep in mind that the official story as reported by the media is the one thing you can be certain is not true. I’m confident it will shock the media to discover how much support Putin has across the West, especially after two years of unrestrained vaccine dictatorship on the part of the so-called liberal democracies. The media is already openly stating that “this is not just an attack on Ukraine, it is an attack on the Western liberal democracy system and the entire Free World.”\nI, for one, certainly hope so. It’s long past time to end Clownworld and its unrestrained satanry.\nChina has already signaled its support for Putin’s protection of the Donbass republics, has blamed the situation on the USA, and is publicly encouraging everyone else\nto stay out of the conflict\n, so I very much doubt NATO forces are going to get directly involved regardless of how comprehensive the Russian operations turn out to be.\nIt should be noted that it is very regrettable that the Ukrainian issue has evolved so far. The US has continued its intensive containment on Russia, which finally forced Russia to try to realize its security demands in such a way. This is the outburst of the dissatisfaction of the party whose security demands have been ignored for a long time since the end of the Cold War… all sides should leave some space for Russia and Ukraine to solve the problems. Confrontation, sanctions, or even a direct battle will not help ease tensions. The flames scattered in eastern Ukraine are reminding all parties of the fact that blindly imposing pressure will only lead to an escalation of conflicts.\nAll sides should give Russia, Ukraine some space to resolve issue,\nGlobal Times\n, 23 February 2022\nBut no one knows precisely how this will develop, and don’t believe anyone who claims they do.\nUPDATE:\nIt appears the Ukrainian military\nis already running\naway.\nRomania scrambled two F-16 Fighting Falcon jets on Thursday morning to intercept a foreign military aircraft, the country’s defense ministry has said. The intercepted target was identified as a Ukrainian Air Force Sukhoi Su-27 air superiority fighter jet. It was directed to land at a military base near the city of Bacau in eastern Romania, the statement said. The ministry said the pilot of the Ukrainian jet surrendered himself to the Romanian authorities.\nUPDATE:\nThis may mark the end of the European Union before this is all over. Putin now has the option to take the EU’s rhetoric literally. If the EU wants war with Russia, Russia is more than capable of giving it to them, and very, very few of the EU member states are even remotely interested in fighting Russia. And breaking up the EU is absolutely in Russia’s interest.\nWe condemn Russia’s unprecedented military aggression against Ukraine. It must withdraw its military and fully respect Ukraine’s territorial integrity. The EU leaders will discuss and swiftly adopt further restrictive measures against Russia. The EU stands with Ukraine.\nEU President Ursula van der Leyen\nUPDATE:\nDon’t expect NATO to do anything except issue strongly-worded statements to the press. As literally everyone except the neocons and their puppet government expected, the European militaries have no intention of fighting the Russian army.\n“There will be no military confrontation between NATO and Russia,” – head of the German Bundestag Committee on Defense.\nDISCUSS ON SG",
  "tags": [
    "neocons",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-24T13:43:13+00:00"
}