{
  "url": "https://voxday.net/2022/02/25/an-answer-to-a-stupid-question/",
  "scraped_at": "2026-01-08T13:10:37.269876",
  "title": "An Answer to a Stupid Question",
  "date_display": "February 25, 2022",
  "date_iso": "2022-02-25T12:36:56+00:00",
  "date_from_url": "2022-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>From a recent Darkstream, a response to a man wondering how to go about approaching a woman in whom he is interested.</em></p><p><strong>How should I approach a desk girl at the gym?</strong></p><p>Directly. Don’t try to be particularly smooth or anything. What I would do is just ask her if she has a boyfriend. That’s the first thing. If she says yes, then she actually has one or she is not interested in you. Either way, no problem. And if she says no, then ask “would you like to go out to dinner on Friday?” It’s really not that hard.</p><p>All the stuff about how girls are different today, it’s so much harder, we can’t do that. You know, the same sort of guys were all saying that 30 years ago too. <em>“It’s so different, it’s so hard.”</em> It’s not hard. And it’s not difficult. Men have been dealing with the same issue since forever, and all it is is fear of rejection. All the ideas about how <em>“oh, this can’t be done, or that can’t be done, or it’s not like that now.”</em> That’s all nonsense.</p><p>Yes, there are some differences in terms of how texting has its own rules and so forth. But it’s still the same thing. And all of the little tactical stuff is like two percent of it. All the cute lines and the various things – I mean, the thing that’s so stupid about it is that if a girl is attracted to you, she’s not going to care what you say! The point is that you indicated interest. So you did your part. That’s the male part. That’s the male role: indicate interest. And then the girl decides (snaps fingers) very, very quickly, whether she’s interested or not.</p><p>All you’re trying to do with all the different tactics and all the different this, that, and the other thing is attempting to convert a “maybe” into a “yes”. But frankly, the more that you work at it, and the more that you think about it and obsess about it, the more likely you are to convert a “yes” into a “no”.</p><p>F says “<em>I tend to overthink really.”</em> No kidding. Every low-status male overthinks. If you tend to overthink, then you are low-status, or average at best. As a former high-status male, I can tell you right now that I spent zero time thinking about that sort of thing. The high-status male has no fear of rejection. He goes, <em>hmm, there are seven pretty girls here. Those are the three that I like best. Of those three, that one looks like a handful. That one looks like she’s probably out of my league. Number three, she’s the one to talk t</em>o. Then he goes up to her and says, “hey what’s up?” That’s literally all it takes to get the ball rolling.</p> <span id=\"more-52478\"></span><p>My brother, one of my brothers in particular, is very good-looking. I mean, good-looking to the point that girls would do that thing “oh, I don’t notice whether guys are good-looking or not.” Yeah, they walk into the gym and ask why I’m standing around not working out, and I say, I’m waiting for my brother, you know who he is, he’s really good-looking. “Oh, I don’t notice guys here, I’m so focused on my workouts.” Yeah, whatever. And then, I’m like, oh, yeah, there he is. <em>“Oh, him!”</em></p><p>Just to be clear, if you haven’t figured this out yet, girls are completely, utterly and totally full of shit when they talk about guys to men. If you’re a man, you cannot believe a single word you ever hear out of a girl’s mouth about guys. I’m sure they speak accurately among themselves. But when they talk to guys, they don’t. I don’t understand why. And I don’t understand what the point is. All I know is that it’s never, ever, relevant.</p><p>So the same brother was annoyed because he said, “you know, it seems like all the really good-looking women that I meet in the clubs, I can’t have a decent relationship with them.” And to put in perspective, one day around that time the Minneapolis newspaper had five full-page ads and two of the five models in the ads were former girlfriends of his. But my brother is not exactly a rocket scientist. And so he said “I don’t like the girls at the club, but they’re prettier. I like the girls at church, but they’re not pretty enough.” So I said, “well, the answer is pretty simple. Find a girl that you like in the clubs who’s willing to go to church with you.” And so he ends up meeting this girl when he’s out somewhere, I think it might have even been Glam Slam. They end up going to church on their first date, and they end up getting married. Perfect. They’re still married.</p><p>So, I’m talking to my sister-in-law after they got married. I asked “how exactly did you guys meet anyhow?” This is my level of interest. I didn’t even know how they met until after they got married. So she says, “well, it’s kind of funny. I’m at the club, and I see this really good-looking guy. And I look at him and he looks at me. And he walks over and says,, hey, do you want to go to church with me tomorrow?” <em>What?</em> “I just want to know if you want to go to church tomorrow.” <em>Um, okay…</em> The idiot took my advice and applied it literally, which was not at all what I intended.</p><p>But regardless, she said yes because he’s really good-looking. So this should give you an understanding of how totally irrelevant that anything you say is. He expressed interest. That’s his job. Express interest. Do your job, and in response, women will let you know if they’re interested or not. There’s no magic trick, you’re not going to hypnotize them into being interested.</p><p>M is right to say “rejection is the default female position.” And they have to be like that. What you guys don’t realize is that women are victimized on a regular basis by guys that have no business whatsoever in approaching them. It’s constant for an attractive woman. And so don’t blame them or think that they’re bitches or whatever just because they shut you down hard. They literally HAVE to do it. It is literally a matter of survival for them. The nice, friendly girl who’s 15-years-old, and is friendly and smiles at people suddenly finds herself getting hit on hard by 45-year-old men in public. All she does is smile. So guess what? They learn to start wearing a bitch face and avoiding eye contact just so they don’t get hassled all the time.</p><p>So don’t hassle women. Don’t be weird and stare at them. Don’t do all that creepy shit that gammas and sometimes deltas do if they see a woman that they find attractive. Go directly towards her and say hello. Find out if she’s available and interested. Back off if she isn’t. That’s it. Don’t wait for the right moment. It doesn’t exist.</p><p>And yes, there are couples that get together because they were friends for so long and all this kind of stuff. But that’s just a bad plan. Huge waste of time.</p><p>Somebody said, “oh, that game stuff is nonsense.” No, the game stuff is not nonsense. It’s not all a facade. It’s real. Women do respond to confidence, but they’re really, really good at seeing through the fake thing. Obviously, the best game is being really good-looking, right? But there are other reasons that guys have tremendous confidence. They’re really good at something. They’re famous, or they’re accustomed to success. I can assure you that my brother’s expectation was that his now-wife was going to say yes to his ridiculous proposition, but it wouldn’t have bothered him in the slightest if she had said no. That’s what the pickup artists call outcome-based independence. And they’re exactly right about that.</p><p>But here’s the thing. Be realistic about yourself. If you’re in the top 20 percent of intelligence, you’re not going to try to debate somebody who’s in the top one percent, right? If you’re average at martial arts, you’re not going to get in the ring with the reigning MMA champion, right? So why would you think that a top-tier woman has any interest in a mediocre guy like you? She won’t. Go find and focus on women who are reasonably at your level. One point up, one point down. If there is something exceptional about you, maybe you can go two points up, two points down in terms of attraction. But be realistic.</p><p>What I’ve seen happen on occasion is the way gammas or other relatively low-status guys will sometimes find themselves in a position where an attractive woman is massively grateful to them. This is the whole rescue-the-princess thing, right? Low-status guys dream about this situation. And sometimes the rescue-the-princess scenario applies. Now guess what happens? Eventually, the princess can’t stand the gamma rescuer and she blows up the marriage.</p><p>It’s always a good idea, and it’s always wise, for people to be, on average, on the same level. That’s why really rich guy, really pretty girl works. They both bring something to the table. Something that does not count is <em>“I like her the best. I like her so much. No one else could possibly like her as much as I do.” </em>That is not bringing something to the table. That’s what creepy guys do. Or creepy lesbians. I mean, it occurred to me when I heard part of the only Melissa Etheridge song I know the other day. And I was like, wow, this is just creepy: <em>“I’m the only one to walk across the fire for you.” </em>You know the minute that she’s in a relationship with somebody she’s going to be tearing them down so that they feel that they’re worthless, and undeserving of love, and they should be grateful that this possessive creepy person is willing to love them anyhow. It’s the relationship equivalent of <em>“I’m your biggest fan.</em>” Great. I have to go now.</p><p>The point is that the best rhetoric is based on truth. What’s the truth? The truth is you’re interested in her and you want to know if she might have any interest in you. Keep it simple. Be straightforward. Be honest. Because ultimately what you want is to start on the path that ends with marriage and children. That’s the only way that you’re going to find happiness over time.</p><p>I can honestly say that I am happy after decades, literal decades, with the same woman, I am happy. I’m happy in the marriage, I’m happy with the children. I’m happy that we chose to talk to each other initially. We didn’t play tons of games.</p><p>And so anyhow, that’s my advice for that stupid question. So, but obviously it wasn’t too terribly stupid because the Internet didn’t collapse this time.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c4fbe613-3244-4229-99d4-882e5dd53110\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "From a recent Darkstream, a response to a man wondering how to go about approaching a woman in whom he is interested.\nHow should I approach a desk girl at the gym?\nDirectly. Don’t try to be particularly smooth or anything. What I would do is just ask her if she has a boyfriend. That’s the first thing. If she says yes, then she actually has one or she is not interested in you. Either way, no problem. And if she says no, then ask “would you like to go out to dinner on Friday?” It’s really not that hard.\nAll the stuff about how girls are different today, it’s so much harder, we can’t do that. You know, the same sort of guys were all saying that 30 years ago too.\n“It’s so different, it’s so hard.”\nIt’s not hard. And it’s not difficult. Men have been dealing with the same issue since forever, and all it is is fear of rejection. All the ideas about how\n“oh, this can’t be done, or that can’t be done, or it’s not like that now.”\nThat’s all nonsense.\nYes, there are some differences in terms of how texting has its own rules and so forth. But it’s still the same thing. And all of the little tactical stuff is like two percent of it. All the cute lines and the various things – I mean, the thing that’s so stupid about it is that if a girl is attracted to you, she’s not going to care what you say! The point is that you indicated interest. So you did your part. That’s the male part. That’s the male role: indicate interest. And then the girl decides (snaps fingers) very, very quickly, whether she’s interested or not.\nAll you’re trying to do with all the different tactics and all the different this, that, and the other thing is attempting to convert a “maybe” into a “yes”. But frankly, the more that you work at it, and the more that you think about it and obsess about it, the more likely you are to convert a “yes” into a “no”.\nF says “\nI tend to overthink really.”\nNo kidding. Every low-status male overthinks. If you tend to overthink, then you are low-status, or average at best. As a former high-status male, I can tell you right now that I spent zero time thinking about that sort of thing. The high-status male has no fear of rejection. He goes,\nhmm, there are seven pretty girls here. Those are the three that I like best. Of those three, that one looks like a handful. That one looks like she’s probably out of my league. Number three, she’s the one to talk t\no. Then he goes up to her and says, “hey what’s up?” That’s literally all it takes to get the ball rolling.\nMy brother, one of my brothers in particular, is very good-looking. I mean, good-looking to the point that girls would do that thing “oh, I don’t notice whether guys are good-looking or not.” Yeah, they walk into the gym and ask why I’m standing around not working out, and I say, I’m waiting for my brother, you know who he is, he’s really good-looking. “Oh, I don’t notice guys here, I’m so focused on my workouts.” Yeah, whatever. And then, I’m like, oh, yeah, there he is.\n“Oh, him!”\nJust to be clear, if you haven’t figured this out yet, girls are completely, utterly and totally full of shit when they talk about guys to men. If you’re a man, you cannot believe a single word you ever hear out of a girl’s mouth about guys. I’m sure they speak accurately among themselves. But when they talk to guys, they don’t. I don’t understand why. And I don’t understand what the point is. All I know is that it’s never, ever, relevant.\nSo the same brother was annoyed because he said, “you know, it seems like all the really good-looking women that I meet in the clubs, I can’t have a decent relationship with them.” And to put in perspective, one day around that time the Minneapolis newspaper had five full-page ads and two of the five models in the ads were former girlfriends of his. But my brother is not exactly a rocket scientist. And so he said “I don’t like the girls at the club, but they’re prettier. I like the girls at church, but they’re not pretty enough.” So I said, “well, the answer is pretty simple. Find a girl that you like in the clubs who’s willing to go to church with you.” And so he ends up meeting this girl when he’s out somewhere, I think it might have even been Glam Slam. They end up going to church on their first date, and they end up getting married. Perfect. They’re still married.\nSo, I’m talking to my sister-in-law after they got married. I asked “how exactly did you guys meet anyhow?” This is my level of interest. I didn’t even know how they met until after they got married. So she says, “well, it’s kind of funny. I’m at the club, and I see this really good-looking guy. And I look at him and he looks at me. And he walks over and says,, hey, do you want to go to church with me tomorrow?”\nWhat?\n“I just want to know if you want to go to church tomorrow.”\nUm, okay…\nThe idiot took my advice and applied it literally, which was not at all what I intended.\nBut regardless, she said yes because he’s really good-looking. So this should give you an understanding of how totally irrelevant that anything you say is. He expressed interest. That’s his job. Express interest. Do your job, and in response, women will let you know if they’re interested or not. There’s no magic trick, you’re not going to hypnotize them into being interested.\nM is right to say “rejection is the default female position.” And they have to be like that. What you guys don’t realize is that women are victimized on a regular basis by guys that have no business whatsoever in approaching them. It’s constant for an attractive woman. And so don’t blame them or think that they’re bitches or whatever just because they shut you down hard. They literally HAVE to do it. It is literally a matter of survival for them. The nice, friendly girl who’s 15-years-old, and is friendly and smiles at people suddenly finds herself getting hit on hard by 45-year-old men in public. All she does is smile. So guess what? They learn to start wearing a bitch face and avoiding eye contact just so they don’t get hassled all the time.\nSo don’t hassle women. Don’t be weird and stare at them. Don’t do all that creepy shit that gammas and sometimes deltas do if they see a woman that they find attractive. Go directly towards her and say hello. Find out if she’s available and interested. Back off if she isn’t. That’s it. Don’t wait for the right moment. It doesn’t exist.\nAnd yes, there are couples that get together because they were friends for so long and all this kind of stuff. But that’s just a bad plan. Huge waste of time.\nSomebody said, “oh, that game stuff is nonsense.” No, the game stuff is not nonsense. It’s not all a facade. It’s real. Women do respond to confidence, but they’re really, really good at seeing through the fake thing. Obviously, the best game is being really good-looking, right? But there are other reasons that guys have tremendous confidence. They’re really good at something. They’re famous, or they’re accustomed to success. I can assure you that my brother’s expectation was that his now-wife was going to say yes to his ridiculous proposition, but it wouldn’t have bothered him in the slightest if she had said no. That’s what the pickup artists call outcome-based independence. And they’re exactly right about that.\nBut here’s the thing. Be realistic about yourself. If you’re in the top 20 percent of intelligence, you’re not going to try to debate somebody who’s in the top one percent, right? If you’re average at martial arts, you’re not going to get in the ring with the reigning MMA champion, right? So why would you think that a top-tier woman has any interest in a mediocre guy like you? She won’t. Go find and focus on women who are reasonably at your level. One point up, one point down. If there is something exceptional about you, maybe you can go two points up, two points down in terms of attraction. But be realistic.\nWhat I’ve seen happen on occasion is the way gammas or other relatively low-status guys will sometimes find themselves in a position where an attractive woman is massively grateful to them. This is the whole rescue-the-princess thing, right? Low-status guys dream about this situation. And sometimes the rescue-the-princess scenario applies. Now guess what happens? Eventually, the princess can’t stand the gamma rescuer and she blows up the marriage.\nIt’s always a good idea, and it’s always wise, for people to be, on average, on the same level. That’s why really rich guy, really pretty girl works. They both bring something to the table. Something that does not count is\n“I like her the best. I like her so much. No one else could possibly like her as much as I do.”\nThat is not bringing something to the table. That’s what creepy guys do. Or creepy lesbians. I mean, it occurred to me when I heard part of the only Melissa Etheridge song I know the other day. And I was like, wow, this is just creepy:\n“I’m the only one to walk across the fire for you.”\nYou know the minute that she’s in a relationship with somebody she’s going to be tearing them down so that they feel that they’re worthless, and undeserving of love, and they should be grateful that this possessive creepy person is willing to love them anyhow. It’s the relationship equivalent of\n“I’m your biggest fan.\n” Great. I have to go now.\nThe point is that the best rhetoric is based on truth. What’s the truth? The truth is you’re interested in her and you want to know if she might have any interest in you. Keep it simple. Be straightforward. Be honest. Because ultimately what you want is to start on the path that ends with marriage and children. That’s the only way that you’re going to find happiness over time.\nI can honestly say that I am happy after decades, literal decades, with the same woman, I am happy. I’m happy in the marriage, I’m happy with the children. I’m happy that we chose to talk to each other initially. We didn’t play tons of games.\nAnd so anyhow, that’s my advice for that stupid question. So, but obviously it wasn’t too terribly stupid because the Internet didn’t collapse this time.\nDISCUSS ON SG",
  "tags": [
    "Alpha Game",
    "Darkstream",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-25T12:56:36+00:00"
}