{
  "url": "https://voxday.net/2022/02/09/biologists-really-dont-get-math/",
  "scraped_at": "2026-01-08T13:08:56.973760",
  "title": "Biologists REALLY Don’t Get Math",
  "date_display": "February 9, 2022",
  "date_iso": "2022-02-09T17:01:00+00:00",
  "date_from_url": "2022-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A follower of JFG tries to defend him. It doesn’t go well.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>He clarifies his position on jfgtonight regarding the model used by vox is based on bacterial cloning and doesn’t address that a population with sexual reproduction where replacement values are above 2.</p></blockquote><p>This is simply embarrassing, though not particularly surprising given the fact that it required no less than three tries for JFG to understand that a 115 IQ for a substantial portion of the Jewish population of Israel necessarily dictated a sub-90 IQ for the rest of the Jewish population, given the reported average Israeli IQ.</p><p>This is the sort of thing that happens when people are incapable of understanding basic math without being walked carefully through all the relevant numbers involved.</p><p>What JFG is claiming in his clarification is that because sexual reproduction CAN result in faster gene fixation than bacterial cloning <em>when measured in terms of generations</em>, it is possible for the fixation rate to be high enough to account for genetic divergence between chimps and humans since the LCHCA, as well as every other observed genetic divergence over time.</p><p>However, this is not true. What JFG and his followers forgot to take into account is that it is not <em>generations </em>that are relevant here, but <em>time</em>. And although bacterial cloning <em>may </em>– or may not – be slower to fixate a gene across a population than sexual reproduction in generational terms, bacteria also have considerably more generations over a given period of time than humans do.</p><p>To use the two specific examples I cited, the bacteria was observed to have 14,016 generations per year. Primates have 0.05 generations per year. And fixation through sexual reproduction is not, and has never been, observed to be more than 280,320 times faster in temporal terms than fixation through bacterial cloning.</p><p>I used the bacterial model in order to demonstrate that the case for natural selection was impossible even when applying the fastest possible fixation rates ever observed. So, my argument absolutely did cover the situation of a population with sexual reproduction where replacement values are above 2, because there is absolutely no case where a sexually reproducing mammal will fixate a gene across its population in less time than a bacterial population.</p><p>So, you will note that JFG not only failed to refute my argument, he observably failed to even understand it or the relevant math required.</p><p><strong>UPDATE: </strong>He really, truly, honestly <a href=\"https://gab.com/JFGariepy/posts/107769143323626680\">doesn’t get it</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>This is a complex question and there will not be a single number. It will be dependent on what is defined as fixation (is a gene similar across 99.99% of humans fixated or not?). It will also depend on what we do with genes that could have been fixated to be different from the common ancestor but then reverted back to their common ancestor form in our evolutionary history. Does that count for 0 or 2 fixation events? The number will also vary depending on how we count similar fixation events that have happened parallelly in the two species. I’m not raising these concerns to avoid answering the question, just pointing to the fact that this number is not unique according to how we approach the problem.</p><p>With all that being said, none of my argument relies on this number being a particular value, so sure, let us accept an average of 2.22 fixed mutations per year on average for the purpose of discussion… now what?</p><p>The problem of @voxday’s thesis is not that we disagree on this number. It is that @voxday’s calculations fail to take into account the higher rate of fixation in sexual species such as humans compared to non-sexual ones such as bacteria. Meiosis is a bitch.</p></blockquote><p>Now what? Darwin is done. Evolution is done. Natural Selection is done and comprehensively dusted. That’s what.</p><p><a href=\"https://social.infogalactic.com/micropost/fbad0001-ede9-498e-9e38-d1cfc658305d\"><em>DISCUSS ON SG</em></a></p></div>",
  "content_text": "A follower of JFG tries to defend him. It doesn’t go well.\nHe clarifies his position on jfgtonight regarding the model used by vox is based on bacterial cloning and doesn’t address that a population with sexual reproduction where replacement values are above 2.\nThis is simply embarrassing, though not particularly surprising given the fact that it required no less than three tries for JFG to understand that a 115 IQ for a substantial portion of the Jewish population of Israel necessarily dictated a sub-90 IQ for the rest of the Jewish population, given the reported average Israeli IQ.\nThis is the sort of thing that happens when people are incapable of understanding basic math without being walked carefully through all the relevant numbers involved.\nWhat JFG is claiming in his clarification is that because sexual reproduction CAN result in faster gene fixation than bacterial cloning\nwhen measured in terms of generations\n, it is possible for the fixation rate to be high enough to account for genetic divergence between chimps and humans since the LCHCA, as well as every other observed genetic divergence over time.\nHowever, this is not true. What JFG and his followers forgot to take into account is that it is not\ngenerations\nthat are relevant here, but\ntime\n. And although bacterial cloning\nmay\n– or may not – be slower to fixate a gene across a population than sexual reproduction in generational terms, bacteria also have considerably more generations over a given period of time than humans do.\nTo use the two specific examples I cited, the bacteria was observed to have 14,016 generations per year. Primates have 0.05 generations per year. And fixation through sexual reproduction is not, and has never been, observed to be more than 280,320 times faster in temporal terms than fixation through bacterial cloning.\nI used the bacterial model in order to demonstrate that the case for natural selection was impossible even when applying the fastest possible fixation rates ever observed. So, my argument absolutely did cover the situation of a population with sexual reproduction where replacement values are above 2, because there is absolutely no case where a sexually reproducing mammal will fixate a gene across its population in less time than a bacterial population.\nSo, you will note that JFG not only failed to refute my argument, he observably failed to even understand it or the relevant math required.\nUPDATE:\nHe really, truly, honestly\ndoesn’t get it\n.\nThis is a complex question and there will not be a single number. It will be dependent on what is defined as fixation (is a gene similar across 99.99% of humans fixated or not?). It will also depend on what we do with genes that could have been fixated to be different from the common ancestor but then reverted back to their common ancestor form in our evolutionary history. Does that count for 0 or 2 fixation events? The number will also vary depending on how we count similar fixation events that have happened parallelly in the two species. I’m not raising these concerns to avoid answering the question, just pointing to the fact that this number is not unique according to how we approach the problem.\nWith all that being said, none of my argument relies on this number being a particular value, so sure, let us accept an average of 2.22 fixed mutations per year on average for the purpose of discussion… now what?\nThe problem of @voxday’s thesis is not that we disagree on this number. It is that @voxday’s calculations fail to take into account the higher rate of fixation in sexual species such as humans compared to non-sexual ones such as bacteria. Meiosis is a bitch.\nNow what? Darwin is done. Evolution is done. Natural Selection is done and comprehensively dusted. That’s what.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-09T17:50:11+00:00"
}