{
  "url": "https://voxday.net/2022/02/06/darwin-was-an-anti-christian-psyop/",
  "scraped_at": "2026-01-08T13:08:37.730299",
  "title": "Darwin was an Anti-Christian Psyop",
  "date_display": "February 6, 2022",
  "date_iso": "2022-02-06T17:13:14+00:00",
  "date_from_url": "2022-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not only is the Darwinian – and the Neo-Darwinian – theory of evolution by natural selection completely impossible due to the number of genetic transformations required in limited amounts of time, but it is becoming increasingly obvious that <a href=\"https://www.dailymail.co.uk/news/article-10481295/New-evidence-proves-Charles-Darwin-stole-Theory-Evolution-rival-naturalist.html\">Charles Darwin was nothing more than a fraud, a plagiarist, and the front man for a previously published theory</a> that was popularized in order to cast doubt on Christianity and the Christian worldview:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Dr Mike Sutton, whose book <em>Science Fraud: Darwin’s Plagiarism Of Patrick Matthew’s Theory</em> is published by Curtis next Saturday, said: ‘This is the biggest science fraud in history.’</p><p>He highlights similarities between key phrases and explanations and cites letters apparently showing Darwin knew Matthew’s work and covered up his debt to his rival.</p><p>In one, Darwin’s wife admitted to Matthew that evolution was his ‘original child’, but her husband had nurtured it ‘like his own’.</p><p>Dr Sutton said: ‘In 1859 Darwin replicated the theory of evolution by natural selection in Patrick Matthew’s 1831 prior publication. ‘Matthew was the first to coin that phrase to explain the theory, which he called the Natural Process of Selection. Darwin realised he had no choice but to use the same words so he called it the Process of Natural Selection. He shuffled the words and hoped nobody would notice.’</p><p>A grain merchant and landowner from Perthshire, Matthew had travelled widely in Europe studying agriculture and forestry.</p><p>While claims that Darwin borrowed from Matthew have been aired before, the book contains new evidence, including that when Matthew confronted him, Darwin claimed no one had heard of Matthew or his theory. In fact, according to Dr Sutton, Matthew’s book had been cited and reviewed by Darwin’s friends, colleagues and even his mentors in 30 leading publications. In his own journals, Darwin admits to having read at least five publications in which Matthew’s work featured.</p><p>Perhaps most damning is a letter from Darwin’s wife, Emma, written on behalf of her husband.</p><p>Dr Sutton said: ‘She wrote claiming Darwin was too ill to write, with a telling line to Matthew. She says, “Darwin is more loyal to your own original child than you were yourself.” If you want an admission, there it is – “Your own original child”.’</p><p>Dr Sutton, a winner of the British Journal of Criminality prize as well as chief editor of the Internet Journal Of Criminology, added: ‘All the top Darwinists admit Matthew got there first, but claim nobody read it. Actually, they did.</p><p>‘We’ve got Darwin’s lies, replications of text and ideas, independent verifiable facts which, I think, come down in favour of deliberate, knowing fraud.’</p></blockquote><p>Although I knew about the other scientist whose work arguably preceded Darwin’s, Alfred Russell Wallace, the idea that the concept of natural selection had been articulated <em>more than 30 years prior</em> to Darwin’s first publication on the subject struck me as incredible. However, after reviewing a copy of Matthew’s book, <em>On Naval Timber and Arboriculture</em>, it’s clear that Charles Darwin was the harbinger of the subsequent scientific fraud that was Albert Einstein.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The consequences are now being developed of our deplorable ignorance of, or inattention to, one of the most evident traits of natural history, that vegetables as well as animals are generally liable to an almost unlimited diversification, regulated by climate, soil, nourishment, and new commixture of already formed varieties. In those with which man is most intimate, and where his agency in throwing them from their natural locality and dispositions has brought out this power of diversification in stronger shades, it has been forced upon his notice, as in man himself, in the dog, horse, cow, sheep, poultry,—in the apple, pear, plum, gooseberry, potato, pea, which sport in infinite varieties, differing considerably in size, colour, taste, firmness of texture, period of growth, almost in every recognisable quality. In all these kinds man is influencial in preventing deterioration, by careful selection of the largest or most valuable as breeders; but in timber trees the opposite course has been pursued….</p><p>The use of the infinite seedling varieties in the families of plants, even in those in a state of nature, differing in luxuriance of growth and local adaptation, seems to be to give one individual (the strongest best circumstance-suited) superiority over others of its kind around, that it may, by overtopping and smothering them, procure room for full extension, and thus affording, at the same time, a continual selection of the strongest, best circumstance-suited, for reproduction. Man’s interference, by preventing this natural process of selection among plants, independent of the wider range of circumstances to which he introduces them, has increased the difference in varieties, particularly in the more domesticated kinds; and even in man himself, the greater uniformity, and more general vigour among savage tribes, is referrible to nearly similar selecting law—the weaker individual sinking under the ill treatment of the stronger, or under the common hardship.</p><cite>Patrick Matthew, <em>On Naval Timber and Arboriculture</em>, 1831</cite></blockquote><p>At this point, it’s observably far more reasonable to say “science is fraud” than to seriously propose it as a potential arbiter of truth.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0406e0fc-ef34-439a-917b-5a6b9dc0eb55\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Not only is the Darwinian – and the Neo-Darwinian – theory of evolution by natural selection completely impossible due to the number of genetic transformations required in limited amounts of time, but it is becoming increasingly obvious that\nCharles Darwin was nothing more than a fraud, a plagiarist, and the front man for a previously published theory\nthat was popularized in order to cast doubt on Christianity and the Christian worldview:\nDr Mike Sutton, whose book\nScience Fraud: Darwin’s Plagiarism Of Patrick Matthew’s Theory\nis published by Curtis next Saturday, said: ‘This is the biggest science fraud in history.’\nHe highlights similarities between key phrases and explanations and cites letters apparently showing Darwin knew Matthew’s work and covered up his debt to his rival.\nIn one, Darwin’s wife admitted to Matthew that evolution was his ‘original child’, but her husband had nurtured it ‘like his own’.\nDr Sutton said: ‘In 1859 Darwin replicated the theory of evolution by natural selection in Patrick Matthew’s 1831 prior publication. ‘Matthew was the first to coin that phrase to explain the theory, which he called the Natural Process of Selection. Darwin realised he had no choice but to use the same words so he called it the Process of Natural Selection. He shuffled the words and hoped nobody would notice.’\nA grain merchant and landowner from Perthshire, Matthew had travelled widely in Europe studying agriculture and forestry.\nWhile claims that Darwin borrowed from Matthew have been aired before, the book contains new evidence, including that when Matthew confronted him, Darwin claimed no one had heard of Matthew or his theory. In fact, according to Dr Sutton, Matthew’s book had been cited and reviewed by Darwin’s friends, colleagues and even his mentors in 30 leading publications. In his own journals, Darwin admits to having read at least five publications in which Matthew’s work featured.\nPerhaps most damning is a letter from Darwin’s wife, Emma, written on behalf of her husband.\nDr Sutton said: ‘She wrote claiming Darwin was too ill to write, with a telling line to Matthew. She says, “Darwin is more loyal to your own original child than you were yourself.” If you want an admission, there it is – “Your own original child”.’\nDr Sutton, a winner of the British Journal of Criminality prize as well as chief editor of the Internet Journal Of Criminology, added: ‘All the top Darwinists admit Matthew got there first, but claim nobody read it. Actually, they did.\n‘We’ve got Darwin’s lies, replications of text and ideas, independent verifiable facts which, I think, come down in favour of deliberate, knowing fraud.’\nAlthough I knew about the other scientist whose work arguably preceded Darwin’s, Alfred Russell Wallace, the idea that the concept of natural selection had been articulated\nmore than 30 years prior\nto Darwin’s first publication on the subject struck me as incredible. However, after reviewing a copy of Matthew’s book,\nOn Naval Timber and Arboriculture\n, it’s clear that Charles Darwin was the harbinger of the subsequent scientific fraud that was Albert Einstein.\nThe consequences are now being developed of our deplorable ignorance of, or inattention to, one of the most evident traits of natural history, that vegetables as well as animals are generally liable to an almost unlimited diversification, regulated by climate, soil, nourishment, and new commixture of already formed varieties. In those with which man is most intimate, and where his agency in throwing them from their natural locality and dispositions has brought out this power of diversification in stronger shades, it has been forced upon his notice, as in man himself, in the dog, horse, cow, sheep, poultry,—in the apple, pear, plum, gooseberry, potato, pea, which sport in infinite varieties, differing considerably in size, colour, taste, firmness of texture, period of growth, almost in every recognisable quality. In all these kinds man is influencial in preventing deterioration, by careful selection of the largest or most valuable as breeders; but in timber trees the opposite course has been pursued….\nThe use of the infinite seedling varieties in the families of plants, even in those in a state of nature, differing in luxuriance of growth and local adaptation, seems to be to give one individual (the strongest best circumstance-suited) superiority over others of its kind around, that it may, by overtopping and smothering them, procure room for full extension, and thus affording, at the same time, a continual selection of the strongest, best circumstance-suited, for reproduction. Man’s interference, by preventing this natural process of selection among plants, independent of the wider range of circumstances to which he introduces them, has increased the difference in varieties, particularly in the more domesticated kinds; and even in man himself, the greater uniformity, and more general vigour among savage tribes, is referrible to nearly similar selecting law—the weaker individual sinking under the ill treatment of the stronger, or under the common hardship.\nPatrick Matthew,\nOn Naval Timber and Arboriculture\n, 1831\nAt this point, it’s observably far more reasonable to say “science is fraud” than to seriously propose it as a potential arbiter of truth.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "history",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-06T18:24:50+00:00"
}