{
  "url": "https://voxday.net/2022/02/28/epic-stupidity-in-switzerland/",
  "scraped_at": "2026-01-08T13:11:04.807028",
  "title": "Epic Stupidity in Switzerland",
  "date_display": "February 28, 2022",
  "date_iso": "2022-02-28T15:24:48+00:00",
  "date_from_url": "2022-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Swiss government just <a href=\"https://www.zerohedge.com/markets/historic-breach-neutrality-switzerland-joins-eu-sanctions-russia\">sacrificed the historic neutrality of Switzerland</a> on the altar of globohomo:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Switzerland’s historic neutrality is no longer: moments ago Reuters reported that the Swiss government had joined the EU in adopting sanctions on Russia, freezing assets of targeted companies and people effective immediately:</p><p>SWISS GOVERNMENT SAYS ADOPTS EU SANCTIONS ON RUSSIA<br/>SWISS GOVERNMENT SAYS FREEZES ASSETS OF TARGETED PEOPLE AND COMPANIES EFFECTIVE IMMEDIATELY<br/>SWISS GOVERNMENT SAYS ADOPTS FINANCIAL SANCTIONS AGAINST PRESIDENT PUTIN AND OTHER RUSSIAN OFFICIALS<br/>Swiss President Ignazio Cassis said that adopting the EU sanctions against Russia was a unique, difficult step that required careful consideration. Previously, on Sunday, he said that Switzerland’s neutrality must be preserved and it stood ready to offer its good offices for diplomacy if talks between Ukrainian and Russian officials on the Belarusian border do not succeed, for example by reaching an armistice.</p></blockquote><p>This is an unbelievably stupid act that will have negative consequences that last decades. The Swiss people will need to respond strongly to this by passing a referendum forbidding the government from further violating their neutrality in the future.</p><p>But it’s not a surprise. The globalists in the Swiss government have been working toward this moment for years, constantly chipping away at the commitment to neutrality through signing up for various NATO, EU, and UN programs that could be defended as not actually taking a side. However, this action, in taking sides at the behest of one belligerent party against another, is a clear and obvious violation of their historic neutrality.</p><p>Having abandoned both banking privacy and neutrality, one wonders what the Swiss government will turn against next. Cheese? Chocolate?</p><p>This is a massive mistake and there can be little doubt that the Swiss will come to regret it. With one idiotic move, the Swiss just removed themselves from any future involvement on the world stage. That being said, the fact that the globalists are rapidly pulling out all the stops, including some that have never before been pulled out, tends to underline their desperation as well as their impotence.</p><p>Information is not power. Influence is not power. Money is not power. Power is power.</p><p><strong>UPDATE: </strong>The UK is attempting to surpass the Swiss stupidity. Their idiotic bellicosity is such that one can’t rule out the Boris Johnson government declaring war on Russia.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Toppling Russia’s President Vladimir Putin is the goal of the new wave of international sanctions introduced in response to Moscow’s offensive in Ukraine, a spokesman for Britain’s Prime Minister Boris Johnson told reporters on Monday. “The measures we are introducing, that large parts of the world are introducing, are to bring down the Putin regime,” the unnamed official said.</p><p>Downing Street later clarified that the spokesperson had “misspoken”.</p></blockquote><p><strong>UPDATE: </strong>The Swiss are already discovering that taking sides <a href=\"https://www.rt.com/news/550922-russia-closes-airspace-swiss-planes/\">means making enemies</a>, even if you try to cover yourself with the ridiculous claim that you haven’t stopped being neutral while striking at one side at the demand of the other.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Moscow has closed its airspace to Swiss planes, mirroring Bern’s decision on Monday to prohibit Russian aircraft from flying over the Alpine country. Russia’s aviation authority released a statement on Tuesday saying that “in keeping with international law and as a retaliatory measure” in the wake of the ban Switzerland had imposed on Russian aircraft, Moscow was “restricting flights by civil aircraft” belonging to or registered in Switzerland.</p></blockquote><p>Not only that, but Switzerland has already lost all of the considerable revenues it would have made from the Nordstream 2 pipeline that will deliver Russian gas to Germany, as the Russian-owned Swiss company just fired all of its 150+ employees, presumably in preparation for being shut down.</p><p><em><a href=\"https://social.infogalactic.com/micropost/cc1fcce2-f43d-4cef-975d-2b11a2f582bd\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Swiss government just\nsacrificed the historic neutrality of Switzerland\non the altar of globohomo:\nSwitzerland’s historic neutrality is no longer: moments ago Reuters reported that the Swiss government had joined the EU in adopting sanctions on Russia, freezing assets of targeted companies and people effective immediately:\nSWISS GOVERNMENT SAYS ADOPTS EU SANCTIONS ON RUSSIA\nSWISS GOVERNMENT SAYS FREEZES ASSETS OF TARGETED PEOPLE AND COMPANIES EFFECTIVE IMMEDIATELY\nSWISS GOVERNMENT SAYS ADOPTS FINANCIAL SANCTIONS AGAINST PRESIDENT PUTIN AND OTHER RUSSIAN OFFICIALS\nSwiss President Ignazio Cassis said that adopting the EU sanctions against Russia was a unique, difficult step that required careful consideration. Previously, on Sunday, he said that Switzerland’s neutrality must be preserved and it stood ready to offer its good offices for diplomacy if talks between Ukrainian and Russian officials on the Belarusian border do not succeed, for example by reaching an armistice.\nThis is an unbelievably stupid act that will have negative consequences that last decades. The Swiss people will need to respond strongly to this by passing a referendum forbidding the government from further violating their neutrality in the future.\nBut it’s not a surprise. The globalists in the Swiss government have been working toward this moment for years, constantly chipping away at the commitment to neutrality through signing up for various NATO, EU, and UN programs that could be defended as not actually taking a side. However, this action, in taking sides at the behest of one belligerent party against another, is a clear and obvious violation of their historic neutrality.\nHaving abandoned both banking privacy and neutrality, one wonders what the Swiss government will turn against next. Cheese? Chocolate?\nThis is a massive mistake and there can be little doubt that the Swiss will come to regret it. With one idiotic move, the Swiss just removed themselves from any future involvement on the world stage. That being said, the fact that the globalists are rapidly pulling out all the stops, including some that have never before been pulled out, tends to underline their desperation as well as their impotence.\nInformation is not power. Influence is not power. Money is not power. Power is power.\nUPDATE:\nThe UK is attempting to surpass the Swiss stupidity. Their idiotic bellicosity is such that one can’t rule out the Boris Johnson government declaring war on Russia.\nToppling Russia’s President Vladimir Putin is the goal of the new wave of international sanctions introduced in response to Moscow’s offensive in Ukraine, a spokesman for Britain’s Prime Minister Boris Johnson told reporters on Monday. “The measures we are introducing, that large parts of the world are introducing, are to bring down the Putin regime,” the unnamed official said.\nDowning Street later clarified that the spokesperson had “misspoken”.\nUPDATE:\nThe Swiss are already discovering that taking sides\nmeans making enemies\n, even if you try to cover yourself with the ridiculous claim that you haven’t stopped being neutral while striking at one side at the demand of the other.\nMoscow has closed its airspace to Swiss planes, mirroring Bern’s decision on Monday to prohibit Russian aircraft from flying over the Alpine country. Russia’s aviation authority released a statement on Tuesday saying that “in keeping with international law and as a retaliatory measure” in the wake of the ban Switzerland had imposed on Russian aircraft, Moscow was “restricting flights by civil aircraft” belonging to or registered in Switzerland.\nNot only that, but Switzerland has already lost all of the considerable revenues it would have made from the Nordstream 2 pipeline that will deliver Russian gas to Germany, as the Russian-owned Swiss company just fired all of its 150+ employees, presumably in preparation for being shut down.\nDISCUSS ON SG",
  "tags": [
    "EU",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-01T10:35:44+00:00"
}