{
  "url": "https://voxday.net/2022/02/04/no-more-soros-games/",
  "scraped_at": "2026-01-08T13:08:28.803117",
  "title": "No More Soros Games",
  "date_display": "February 4, 2022",
  "date_iso": "2022-02-04T10:39:21+00:00",
  "date_from_url": "2022-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vladimir Putin warns the neocons to <a href=\"https://www.voanews.com/a/putin-no-more-color-revolutions/6390636.html\">stop destabilizing nations</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Russian President Vladimir Putin said Monday he will not allow governments allied with Moscow to be toppled in so-called “color revolutions,” a reference to the series of popular uprisings that have shaken former Soviet republics.</p><p>“We will not allow the boat to be rocked,” Putin said.</p><p>During an online meeting with leaders of a Russian-led collective security alliance, Putin blamed last week’s violent unrest in Kazakhstan on “destructive internal and external forces.” He added, “Of course, we understand the events in Kazakhstan are not the first and far from the last attempt to interfere in the internal affairs of our states from the outside.”</p></blockquote><p>It just became a lot more safe to ally with Russia and China than to remain unaligned. Especially since <a href=\"https://www.globaltimes.cn/page/202202/1251396.shtml\">China is fully onboard</a> with the anti-neocon approach.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Chinese President Xi Jinping met with Russian President Vladimir Putin on Friday afternoon, stressing the further deepening of “back-to-back” strategic coordination in upholding international fairness and justice and adhering to the four consensuses in supporting each other’s sovereignty, security and development interests <span style=\"text-decoration: underline;\">to better tackle external interference</span> and regional threats, as they exchanged views on a series of major issues regarding global strategic security and stability.</p></blockquote><p>And, of course, there is nothing more dangerously unstable than to be an ally of the imperial USA.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c1e33987-4f0d-4a96-a811-1ac9b6b108bd\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Vladimir Putin warns the neocons to\nstop destabilizing nations\n:\nRussian President Vladimir Putin said Monday he will not allow governments allied with Moscow to be toppled in so-called “color revolutions,” a reference to the series of popular uprisings that have shaken former Soviet republics.\n“We will not allow the boat to be rocked,” Putin said.\nDuring an online meeting with leaders of a Russian-led collective security alliance, Putin blamed last week’s violent unrest in Kazakhstan on “destructive internal and external forces.” He added, “Of course, we understand the events in Kazakhstan are not the first and far from the last attempt to interfere in the internal affairs of our states from the outside.”\nIt just became a lot more safe to ally with Russia and China than to remain unaligned. Especially since\nChina is fully onboard\nwith the anti-neocon approach.\nChinese President Xi Jinping met with Russian President Vladimir Putin on Friday afternoon, stressing the further deepening of “back-to-back” strategic coordination in upholding international fairness and justice and adhering to the four consensuses in supporting each other’s sovereignty, security and development interests\nto better tackle external interference\nand regional threats, as they exchanged views on a series of major issues regarding global strategic security and stability.\nAnd, of course, there is nothing more dangerously unstable than to be an ally of the imperial USA.\nDISCUSS ON SG",
  "tags": [
    "neocons",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-05T01:22:24+00:00"
}