{
  "url": "https://voxday.net/2022/02/11/reflections-on-organizational-success/",
  "scraped_at": "2026-01-08T13:09:05.773597",
  "title": "Reflections on Organizational Success",
  "date_display": "February 11, 2022",
  "date_iso": "2022-02-11T14:18:47+00:00",
  "date_from_url": "2022-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dominic Cummings shared some practical thoughts on his commenter’s notes on the obstacles that organizational Machiavellians always pose to the core objectives of the organization:</p><ol class=\"wp-block-list\"><li><em>Boris types [self-servers with zero interest in the mission – VD] are everywhere.</em></li><li><em>difference with Groves, Mueller, Bob Taylor et al is that they align talent with a goal and squeeze Boris types out, with extreme prejudice. some of those environments are relatively civilised, some (e.g S Jobs) less so, no doubt.</em></li><li><em>near everybody is calculating about themselves but the situation around them changes calculations – if people think ‘leadership is great and i agree with the goal and i love being here and others are here for the mission’, like at PARC, then selfish calculations shrink (not disappear) to being overwhelmed by what’s important</em></li><li><em>the organisations that really change the world POSITIVELY have other things that dominate – boris d stuff was in no10 in 2020 when i was there, but people knew there was something else. now they know there’s nothing else.</em></li><li><em>think you’re right about a tendency to entropy! as you say… groves, mueller, taylor… all pushed out… and the succession problem…</em></li><li><em>the widespread failure even to see these problems provides opportunity, but… if it were easy everyone would do it…</em></li></ol><p>The succession problem to which he refers is tremendous, and it is one to which I have given considerable thought over the years. The three primary challenges that I have identified concerning it are as follows:</p><ol class=\"wp-block-list\"><li>The loyal lieutenants are <span style=\"text-decoration: underline;\">never</span> candidates to succeed the leader. The skills involved in building and leading an enterprise seldom have anything whatsoever to do with being an effective long-time loyal subordinate. History has demonstrated this again and again and again, and yet very few loyal lieutenants ever grasp that they are literally some of the worst possible successors or that their skill set is entirely inadequate for the task to which they aspire. It is imperative that they understand this: deserve’s got nothing to do with it.</li><li>The leader must not hang on too long. I’ve personally witnessed several organizations go down the tubes because the leader simply couldn’t bear to give up the status of being in control, even though he observably no longer had any interest in being responsible for actively running things.</li><li>Equality among successors is futile, dangerous, and counterproductive, in both management and ownership terms. About the only thing more destructive a man can do than divide the ownership of an organization equally among his heirs is to leave it to his wife or to a charity organization.</li></ol><p><em><a href=\"https://social.infogalactic.com/micropost/e56aa2f5-8dee-492c-9a9a-a9a49bda0775\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Dominic Cummings shared some practical thoughts on his commenter’s notes on the obstacles that organizational Machiavellians always pose to the core objectives of the organization:\nBoris types [self-servers with zero interest in the mission – VD] are everywhere.\ndifference with Groves, Mueller, Bob Taylor et al is that they align talent with a goal and squeeze Boris types out, with extreme prejudice. some of those environments are relatively civilised, some (e.g S Jobs) less so, no doubt.\nnear everybody is calculating about themselves but the situation around them changes calculations – if people think ‘leadership is great and i agree with the goal and i love being here and others are here for the mission’, like at PARC, then selfish calculations shrink (not disappear) to being overwhelmed by what’s important\nthe organisations that really change the world POSITIVELY have other things that dominate – boris d stuff was in no10 in 2020 when i was there, but people knew there was something else. now they know there’s nothing else.\nthink you’re right about a tendency to entropy! as you say… groves, mueller, taylor… all pushed out… and the succession problem…\nthe widespread failure even to see these problems provides opportunity, but… if it were easy everyone would do it…\nThe succession problem to which he refers is tremendous, and it is one to which I have given considerable thought over the years. The three primary challenges that I have identified concerning it are as follows:\nThe loyal lieutenants are\nnever\ncandidates to succeed the leader. The skills involved in building and leading an enterprise seldom have anything whatsoever to do with being an effective long-time loyal subordinate. History has demonstrated this again and again and again, and yet very few loyal lieutenants ever grasp that they are literally some of the worst possible successors or that their skill set is entirely inadequate for the task to which they aspire. It is imperative that they understand this: deserve’s got nothing to do with it.\nThe leader must not hang on too long. I’ve personally witnessed several organizations go down the tubes because the leader simply couldn’t bear to give up the status of being in control, even though he observably no longer had any interest in being responsible for actively running things.\nEquality among successors is futile, dangerous, and counterproductive, in both management and ownership terms. About the only thing more destructive a man can do than divide the ownership of an organization equally among his heirs is to leave it to his wife or to a charity organization.\nDISCUSS ON SG",
  "tags": [
    "corpocracy",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-11T14:25:40+00:00"
}