{
  "url": "https://voxday.net/2022/02/27/that-makes-sense/",
  "scraped_at": "2026-01-08T13:10:55.745331",
  "title": "That Makes Sense",
  "date_display": "February 27, 2022",
  "date_iso": "2022-02-27T22:31:37+00:00",
  "date_from_url": "2022-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Saker explains <a href=\"http://thesaker.is/russian-operation-in-the-ukraine-end-of-day-2/\">why the Russians are surrounding the Ukrainian cities</a>, but neither entering nor bombarding them immediately. Hint: it’s not because the brave Ukrainian grandmothers and beauty queens have been destroying dozens of T-80 tanks with tuna can openers and wine levers.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Speaking of the Chechen war, in the first one the Russian military lost a big part of an entire brigade which had quickly entered the city, moved into the city center only to find itself surrounded and cut off, with terrible communications, quasi-non existing reconnaissance capabilities. That debacle left a very painful memory in the Russian collective memory and if somebody was expecting Russian APCs to reach the Mariupol or Kharkov at full speed with flags and screams of “hurrah!” – they don’t understand what is taking place: the mistake made by Eltin’s generals during that first Chechen war will never be repeated by modern Russian commanders.</p><p>Any defeat is always a terrible tragedy, the only and best thing anybody can do after a defeat is to understand why and how it happened, and never repeat such a mistake again. That is the true reason why today Russians stopped on the outskirts of so many cities.</p><p>The bottom line is this. These are things which the Russians are trying to achieve</p><p>(1) Destroy the Ukie armed forces but kill the absolute minimum number of Ukrainian soldiers. Why? Because these surviving Ukrainian soldiers and officers are the ones who will play the main role in finally cleaning the Ukraine from the Nazi scum.<br/>(2) Get to the outskirts of as many major Ukrainian cities and gradually begin the steps I outlined above. Convince civilians to flee and convince Ukrainian solders to lay down arms<br/>(3) Delay any Russian penetration inside the cities until the moment is “just right”.</p><p>Why? Because Russia has ZERO intention of occupying or, even less so, rebuild or police the Ukraine, that’s why. The LDNR is as far as the Russians will go (with only a few possible exceptions).</p><p>The Kremlin decided that the goal of the operation was to 1) disarm and 2) to denazify the Ukraine. As soon as these goals are reached, the Russian want to get the hell out of the Ukraine and back into the LDNR and let the Ukrainians fight their own anti-Nazi civil war. That means that:</p><p>The Russians now must identify reasonable Ukrainian commanders and/or politicians to negotiate with<br/>That Russia needs to offer the leftover Ukrainian ground forces the same deal which the Ukrainian forces which were tasked with the control of the Chernobyl nuclear planet were given today by the Russian forces: let’s secure this facility together and keep it secure together, with no combats of any kind. The Ukrainians gladly accepted, by the way, and now they are jointly patrolling area.<br/>The Russian might also try something which worked well in Chechnia: tell the local town/city authorities that if they guarantee that not a single bullet will be fire from that town/city not a single Russian bullet will fly back and not a single Russian solider will enter the city, unless accompanied by locals and in order to ascertain the reality of the situation. But if a city is declared “open and peaceful” and then is used to attack Russian forces, it will be simply flattened with artillery. I call that the “Shamanov ultimatum” and, after a few false starts (and subsequently flattened towns) it worked very well.</p><p>“Ze” released a video in which he offered to negotiate directly and unconditionally, even about neutrality and any other topic. The Russian reply was simple and to the point:</p><p>(1) Russia is immediately ready to start negotiations after the Armed Forces of Ukraine lay down their arms.<br/>(2) The Ukraine must be demilitarized and declared neutral.<br/>(3) The Ukraine must be denazified.<br/>(4) Russia will no longer allow the Nazis to rule in Ukraine. Ever.</p><p>After that reply, “Ze” and his aides stopped communicating.</p><p>I personally doubt that he has any control over anything. And the fact that a huge amount of weapons has been distributed to whomever wanted one today in Kiev shows that “Ze”‘s handlers have given him the order to make the biggest possible mess and bloodbath before he is evacuated.</p></blockquote><p>There has been a definite air of charade and shenanigans about the media coverage of the war, to say nothing of a distinct lack of casualties and video footage. It appears the Russian approach combining quantum operational speed with strategic patience is confusing both the would-be defenders as well as the media.</p><p><em><a href=\"https://social.infogalactic.com/micropost/05b5f659-6169-42b4-975f-174c588e2d99\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Saker explains\nwhy the Russians are surrounding the Ukrainian cities\n, but neither entering nor bombarding them immediately. Hint: it’s not because the brave Ukrainian grandmothers and beauty queens have been destroying dozens of T-80 tanks with tuna can openers and wine levers.\nSpeaking of the Chechen war, in the first one the Russian military lost a big part of an entire brigade which had quickly entered the city, moved into the city center only to find itself surrounded and cut off, with terrible communications, quasi-non existing reconnaissance capabilities. That debacle left a very painful memory in the Russian collective memory and if somebody was expecting Russian APCs to reach the Mariupol or Kharkov at full speed with flags and screams of “hurrah!” – they don’t understand what is taking place: the mistake made by Eltin’s generals during that first Chechen war will never be repeated by modern Russian commanders.\nAny defeat is always a terrible tragedy, the only and best thing anybody can do after a defeat is to understand why and how it happened, and never repeat such a mistake again. That is the true reason why today Russians stopped on the outskirts of so many cities.\nThe bottom line is this. These are things which the Russians are trying to achieve\n(1) Destroy the Ukie armed forces but kill the absolute minimum number of Ukrainian soldiers. Why? Because these surviving Ukrainian soldiers and officers are the ones who will play the main role in finally cleaning the Ukraine from the Nazi scum.\n(2) Get to the outskirts of as many major Ukrainian cities and gradually begin the steps I outlined above. Convince civilians to flee and convince Ukrainian solders to lay down arms\n(3) Delay any Russian penetration inside the cities until the moment is “just right”.\nWhy? Because Russia has ZERO intention of occupying or, even less so, rebuild or police the Ukraine, that’s why. The LDNR is as far as the Russians will go (with only a few possible exceptions).\nThe Kremlin decided that the goal of the operation was to 1) disarm and 2) to denazify the Ukraine. As soon as these goals are reached, the Russian want to get the hell out of the Ukraine and back into the LDNR and let the Ukrainians fight their own anti-Nazi civil war. That means that:\nThe Russians now must identify reasonable Ukrainian commanders and/or politicians to negotiate with\nThat Russia needs to offer the leftover Ukrainian ground forces the same deal which the Ukrainian forces which were tasked with the control of the Chernobyl nuclear planet were given today by the Russian forces: let’s secure this facility together and keep it secure together, with no combats of any kind. The Ukrainians gladly accepted, by the way, and now they are jointly patrolling area.\nThe Russian might also try something which worked well in Chechnia: tell the local town/city authorities that if they guarantee that not a single bullet will be fire from that town/city not a single Russian bullet will fly back and not a single Russian solider will enter the city, unless accompanied by locals and in order to ascertain the reality of the situation. But if a city is declared “open and peaceful” and then is used to attack Russian forces, it will be simply flattened with artillery. I call that the “Shamanov ultimatum” and, after a few false starts (and subsequently flattened towns) it worked very well.\n“Ze” released a video in which he offered to negotiate directly and unconditionally, even about neutrality and any other topic. The Russian reply was simple and to the point:\n(1) Russia is immediately ready to start negotiations after the Armed Forces of Ukraine lay down their arms.\n(2) The Ukraine must be demilitarized and declared neutral.\n(3) The Ukraine must be denazified.\n(4) Russia will no longer allow the Nazis to rule in Ukraine. Ever.\nAfter that reply, “Ze” and his aides stopped communicating.\nI personally doubt that he has any control over anything. And the fact that a huge amount of weapons has been distributed to whomever wanted one today in Kiev shows that “Ze”‘s handlers have given him the order to make the biggest possible mess and bloodbath before he is evacuated.\nThere has been a definite air of charade and shenanigans about the media coverage of the war, to say nothing of a distinct lack of casualties and video footage. It appears the Russian approach combining quantum operational speed with strategic patience is confusing both the would-be defenders as well as the media.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-27T22:31:39+00:00"
}