{
  "url": "https://voxday.net/2022/02/21/the-jesters-privilege/",
  "scraped_at": "2026-01-08T13:10:11.159624",
  "title": "The Jester’s Privilege",
  "date_display": "February 21, 2022",
  "date_iso": "2022-02-21T13:15:27+00:00",
  "date_from_url": "2022-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Big Bear has become too self-aware to be permitted to spoil Satan’s punchlines by his little minions. <a href=\"https://unauthorized.tv/video/8c3e54/\">This is a transcript from a recent UATV video</a>; I’ve been experimenting with some of the auto-transcription software with the idea that preserving some of the more interesting information being presented in video form in a more permanent and accessible medium might be worthwhile.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I was thinking about this recently, there’s something called the Jester’s Privilege. Jester’s Privilege is the ability and right of a jester to talk and mock freely without being punished for it, for nothing he says seems to matter.  I think I lost this Jester’s Privilege when what I said started mattering. It’s super interesting to think about: if the Jester can affect the economy and politics with his jokes to people stop giving him a pass. Or is it when the jester realises his power that he loses his invisibility?</p><p>Oh, the jokester has become self aware. Yeah, it might be my self-awareness that made it so I no longer got the Jester’s Privilege. You never lost that privilege. You claimed it more fully when you chose a new king, based on the truth that the king you chose is beyond this world. Good choice. That’s very  profound. You went from Jester to King because the chair was vacated, and slaves despise all the speak-rule-of-law slaves like empty chairs because it because it allows for secret kings. That’s mind blowing.</p><p>Gammas love empty chairs because it allows them to envision that they’re in the chair. That’s why we don’t have actual rulers. The Jester’s Privilege is an interesting concept in the Age of Hilarious. Your downfall is people taking your job seriously. It has been a harbinger of great success today. People look up to you as a leader and a truthsayer. They banned you because you’re too many steps ahead.</p><p>Yeah, I think that when you’re really ahead of the curve, it’s almost like when advanced technology appears to be magic. It’s similar to when you’re early adapter or you’re a trendsetter. People think you’re insane until everyone starts doing it. There were tons of people in 2018 that already knew this shit. But it wasn’t as mainstream to get chickens and gardens and shit. The wise fool teaches this.</p><p>Learning about jesters is really interesting. The art of the jester is to skillfully play on the boundary so the king has no choice but to laugh along with his subjects. Many a jester had his head lopped off for not being skilled enough to recognise the line, that’s true. I think when I took a stand against the child hormone thing is when I lost my privilege, that’s why Norm McDonald’s so great. Norm McDonald’s never done that. We can’t find a clip of Norm McDonald actually getting mad, and I know he gets mad. I know a lot of people who know him personally and Norm battled a temper.</p><p>I’m not judging. I battled that myself. But he never showed it. As a jester, he would always make it a joke. And I think that’s why, up until his death, he always had the Jester’s Privilege. I think that what I did was that I wanted to be a real boy. And so it was my choice at the end of the day. A true jester edges the line further and further erodes the power of the king and empowers the people. A bad jester insults the king and brings tyranny for all who would bring tyranny to himself. When you insult the king, the king will lash out at you but in doing so, it weakens the king if the king kills the jester. The common folk don’t respect the king because he can’t take a joke.</p><p>So maybe it’s not the humor that changes things, but the insecurity of those being mocked. There are no true jesters allowed in court anymore. Their humorous scripts are prewritten, impotent, and grovelling. And if you are spoiling Satan’s punch line, there will be none of that.</p><cite>Owen Benjamin, <em>Unauthorized</em>, 20 February 2020</cite></blockquote><p>The software actually works pretty well, as relatively little post-transcription cleanup and editing was required. And the application of the concept of the historical Jester’s Privilege to the relentless policing of comedy and entertainment today is both informative and thought-provoking. Keep in mind that this is the sort of thing that you’re missing on a daily basis <a href=\"https://unauthorized.tv/account/new/\">if you’re not subscribed to UATV</a>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c77fbf2b-6798-43b0-9617-1ca026f6b185\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Big Bear has become too self-aware to be permitted to spoil Satan’s punchlines by his little minions.\nThis is a transcript from a recent UATV video\n; I’ve been experimenting with some of the auto-transcription software with the idea that preserving some of the more interesting information being presented in video form in a more permanent and accessible medium might be worthwhile.\nI was thinking about this recently, there’s something called the Jester’s Privilege. Jester’s Privilege is the ability and right of a jester to talk and mock freely without being punished for it, for nothing he says seems to matter.  I think I lost this Jester’s Privilege when what I said started mattering. It’s super interesting to think about: if the Jester can affect the economy and politics with his jokes to people stop giving him a pass. Or is it when the jester realises his power that he loses his invisibility?\nOh, the jokester has become self aware. Yeah, it might be my self-awareness that made it so I no longer got the Jester’s Privilege. You never lost that privilege. You claimed it more fully when you chose a new king, based on the truth that the king you chose is beyond this world. Good choice. That’s very  profound. You went from Jester to King because the chair was vacated, and slaves despise all the speak-rule-of-law slaves like empty chairs because it because it allows for secret kings. That’s mind blowing.\nGammas love empty chairs because it allows them to envision that they’re in the chair. That’s why we don’t have actual rulers. The Jester’s Privilege is an interesting concept in the Age of Hilarious. Your downfall is people taking your job seriously. It has been a harbinger of great success today. People look up to you as a leader and a truthsayer. They banned you because you’re too many steps ahead.\nYeah, I think that when you’re really ahead of the curve, it’s almost like when advanced technology appears to be magic. It’s similar to when you’re early adapter or you’re a trendsetter. People think you’re insane until everyone starts doing it. There were tons of people in 2018 that already knew this shit. But it wasn’t as mainstream to get chickens and gardens and shit. The wise fool teaches this.\nLearning about jesters is really interesting. The art of the jester is to skillfully play on the boundary so the king has no choice but to laugh along with his subjects. Many a jester had his head lopped off for not being skilled enough to recognise the line, that’s true. I think when I took a stand against the child hormone thing is when I lost my privilege, that’s why Norm McDonald’s so great. Norm McDonald’s never done that. We can’t find a clip of Norm McDonald actually getting mad, and I know he gets mad. I know a lot of people who know him personally and Norm battled a temper.\nI’m not judging. I battled that myself. But he never showed it. As a jester, he would always make it a joke. And I think that’s why, up until his death, he always had the Jester’s Privilege. I think that what I did was that I wanted to be a real boy. And so it was my choice at the end of the day. A true jester edges the line further and further erodes the power of the king and empowers the people. A bad jester insults the king and brings tyranny for all who would bring tyranny to himself. When you insult the king, the king will lash out at you but in doing so, it weakens the king if the king kills the jester. The common folk don’t respect the king because he can’t take a joke.\nSo maybe it’s not the humor that changes things, but the insecurity of those being mocked. There are no true jesters allowed in court anymore. Their humorous scripts are prewritten, impotent, and grovelling. And if you are spoiling Satan’s punch line, there will be none of that.\nOwen Benjamin,\nUnauthorized\n, 20 February 2020\nThe software actually works pretty well, as relatively little post-transcription cleanup and editing was required. And the application of the concept of the historical Jester’s Privilege to the relentless policing of comedy and entertainment today is both informative and thought-provoking. Keep in mind that this is the sort of thing that you’re missing on a daily basis\nif you’re not subscribed to UATV\n.\nDISCUSS ON SG",
  "tags": [
    "history",
    "SJW",
    "UATV"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-21T15:58:09+00:00"
}