{
  "url": "https://voxday.net/2022/02/28/the-bad-guy-tell/",
  "scraped_at": "2026-01-08T13:10:57.611013",
  "title": "The Bad Guy Tell",
  "date_display": "February 28, 2022",
  "date_iso": "2022-02-28T11:20:10+00:00",
  "date_from_url": "2022-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not hard to discern which party to the Russo-Ukrainian conflict are the bad guys. Here’s a hint: it’s the one that publicly punishes people for nothing more than <a href=\"https://www.rt.com/sport/550813-sergey-karjakin-fide-russia-ukraine/\">daring to hold an opinion about their homeland</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Russian grandmaster Sergey Karjakin is facing disciplinary action from the International Chess Federation (FIDE) after expressing support for his country’s military operation in Ukraine.</p><p>In an open letter to President Vladimir Putin shared on social media on Sunday, the Crimean-born Karjakin said he fully backed the effort to fight “for the demilitarization and denazification of Ukraine.”</p><p>“I appeal to you at this difficult time, when our country, led by you, is fighting for the safety of the peaceful Russian population of Donbass and the Lugansk People’s Republic,” wrote the 32-year-old.</p><p>“It is fighting for the demilitarization and denazification of Ukraine with its ruling regime, which has put the security of all of Europe and our country at risk, for the sake of its political goals and ambitions.</p><p>“I am closely following the ongoing special operation, in the lands where I spent my childhood, where I learned to play chess and where my relatives still live.</p><p>“For eight long years we have been waiting with hope for salvation from countless shelling and loss of human lives, the ongoing genocide by the still acting Kiev regime.</p><p>“I express to you, our commander-in-chief, full support in protecting the interests of Russia, our multinational Russian people, eliminating threats and establishment of peace! I wish you the speedy fulfillment of all the tasks assigned to our valiant army.”</p></blockquote><p>Anyone who actually <a href=\"https://barnesreview.org/the-donbass-rebellion-and-the-political-idea-of-novorossiya/\">looks into the matter</a> will quickly discern that the Russians are not only in the right, they are being very careful to keep the violence and bloodshed to a minimum. Globohomo, on the other hand, is lurching about and lashing about on all sides, from chess federations to soccer games, in its attempt to control the narrative.</p><p>Ask yourself this: do you think China’s response to Taiwan and Singapore joining NATO, installing US missiles, and talking about using nuclear weapons against China would be anywhere nearly as circumspect as Russia’s has been?</p><p>And what do you think the reaction from the media would be if everyone who supported Ukraine started being similarly disciplined?</p><p><em><a href=\"https://social.infogalactic.com/micropost/b6207e01-be90-4b2a-bbf7-9c14745a4fac\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s not hard to discern which party to the Russo-Ukrainian conflict are the bad guys. Here’s a hint: it’s the one that publicly punishes people for nothing more than\ndaring to hold an opinion about their homeland\n.\nRussian grandmaster Sergey Karjakin is facing disciplinary action from the International Chess Federation (FIDE) after expressing support for his country’s military operation in Ukraine.\nIn an open letter to President Vladimir Putin shared on social media on Sunday, the Crimean-born Karjakin said he fully backed the effort to fight “for the demilitarization and denazification of Ukraine.”\n“I appeal to you at this difficult time, when our country, led by you, is fighting for the safety of the peaceful Russian population of Donbass and the Lugansk People’s Republic,” wrote the 32-year-old.\n“It is fighting for the demilitarization and denazification of Ukraine with its ruling regime, which has put the security of all of Europe and our country at risk, for the sake of its political goals and ambitions.\n“I am closely following the ongoing special operation, in the lands where I spent my childhood, where I learned to play chess and where my relatives still live.\n“For eight long years we have been waiting with hope for salvation from countless shelling and loss of human lives, the ongoing genocide by the still acting Kiev regime.\n“I express to you, our commander-in-chief, full support in protecting the interests of Russia, our multinational Russian people, eliminating threats and establishment of peace! I wish you the speedy fulfillment of all the tasks assigned to our valiant army.”\nAnyone who actually\nlooks into the matter\nwill quickly discern that the Russians are not only in the right, they are being very careful to keep the violence and bloodshed to a minimum. Globohomo, on the other hand, is lurching about and lashing about on all sides, from chess federations to soccer games, in its attempt to control the narrative.\nAsk yourself this: do you think China’s response to Taiwan and Singapore joining NATO, installing US missiles, and talking about using nuclear weapons against China would be anywhere nearly as circumspect as Russia’s has been?\nAnd what do you think the reaction from the media would be if everyone who supported Ukraine started being similarly disciplined?\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-28T11:25:51+00:00"
}