{
  "url": "https://voxday.net/2022/02/11/this-bodes-well-for-the-future/",
  "scraped_at": "2026-01-08T13:09:10.925043",
  "title": "This Bodes Well for the Future",
  "date_display": "February 11, 2022",
  "date_iso": "2022-02-11T12:36:00+00:00",
  "date_from_url": "2022-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I, for one, welcome our future AI overlords.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>Get inspiration for a story from an Al, just write two themes and see the first paragraph come alive.</em><br/>Themes: <em>Vox Day</em><br/>and <em>Otters</em><br/><strong>Story:</strong> There once was a man named Vox Day, and he was a very controversial figure. Some people loved him, and some people hated him. But no one could deny that he was a powerful speaker and writer. One day, Vox Day met an otter named Otter. They started to become good friends, and Vox Day taught Otter about the importance of freedom and liberty. Otter was so inspired by Vox Day that he decided to become a strong advocate for these values, too. This story is about how Vox Day and Otter helped to change the world for the better. They showed us that there is nothing that can stop us from achieving our goals if we are willing to work hard enough for it. Thanks, gentlemen, for your inspiring example!</p></blockquote><p>They clearly like me a lot better than our current quasi-human rulers do. Chew on that, Charles Stross!</p><p><strong>UPDATE:</strong> The AIs don’t leave much doubt as to why I am so widely feared. It’s all about the skulls.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>There’s a movement afoot, a group of people who believe that the future of the human race rests on the shoulders of young people. They call themselves Vox Day’s Children and they believe that only through the propagation of our kind will the future of humanity be secured. Vox Day is a controversial figure, but he’s got a point. Skulls, skulls everywhere. And not just any skulls, but the skulls of the great and the good. The skulls of the thinkers, the scientists, the inventors. The skulls of the people who have made the world a better place. The young people of Vox Day’s Children believe that these skulls are the key to our future. They believe that by venerating them, by studying them, by understanding what they represent, we can secure the future of humanity.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/7d6ec650-8586-4c20-b24f-92344fad9122\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I, for one, welcome our future AI overlords.\nGet inspiration for a story from an Al, just write two themes and see the first paragraph come alive.\nThemes:\nVox Day\nand\nOtters\nStory:\nThere once was a man named Vox Day, and he was a very controversial figure. Some people loved him, and some people hated him. But no one could deny that he was a powerful speaker and writer. One day, Vox Day met an otter named Otter. They started to become good friends, and Vox Day taught Otter about the importance of freedom and liberty. Otter was so inspired by Vox Day that he decided to become a strong advocate for these values, too. This story is about how Vox Day and Otter helped to change the world for the better. They showed us that there is nothing that can stop us from achieving our goals if we are willing to work hard enough for it. Thanks, gentlemen, for your inspiring example!\nThey clearly like me a lot better than our current quasi-human rulers do. Chew on that, Charles Stross!\nUPDATE:\nThe AIs don’t leave much doubt as to why I am so widely feared. It’s all about the skulls.\nThere’s a movement afoot, a group of people who believe that the future of the human race rests on the shoulders of young people. They call themselves Vox Day’s Children and they believe that only through the propagation of our kind will the future of humanity be secured. Vox Day is a controversial figure, but he’s got a point. Skulls, skulls everywhere. And not just any skulls, but the skulls of the great and the good. The skulls of the thinkers, the scientists, the inventors. The skulls of the people who have made the world a better place. The young people of Vox Day’s Children believe that these skulls are the key to our future. They believe that by venerating them, by studying them, by understanding what they represent, we can secure the future of humanity.\nDISCUSS ON SG",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-02-11T17:06:53+00:00"
}