{
  "url": "https://voxday.net/2018/01/14/a-tale-of-two-reviews-3/",
  "scraped_at": "2025-12-19T10:39:05.419538",
  "title": "A tale of two reviews",
  "date_display": "January 14, 2018",
  "date_iso": "2018-01-14T17:49:00+00:00",
  "date_from_url": "2018-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SuperComicFunTime really did not like <b><i><a href=\"http://amzn.to/2qBQNo9\">QUANTUM MORTIS A Man Disrupted #1</a></i></b>:<br><a href=\"https://3.bp.blogspot.com/-kuDfZrCYeSE/WN4XUJIrGBI/AAAAAAAACaY/b0lCNs1GrRMK95mgCduGGAR2rGnKIzOaACPcBGAYYCw/s1600/image1.JPG\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"1224\" data-original-width=\"792\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"https://3.bp.blogspot.com/-kuDfZrCYeSE/WN4XUJIrGBI/AAAAAAAACaY/b0lCNs1GrRMK95mgCduGGAR2rGnKIzOaACPcBGAYYCw/s400/image1.JPG\" width=\"258\"/></a><br><i><b>Quantum Mortis: The Actionless Comic</b></i><br><i>This book is not a good book. It is action-less, motionless, and for the most part, people-less. The book is divided into two chapters. The first chapter is mostly some guy named Tower flying around and talking to his computer until he lands the ship and talks to a green space monkey that spouts gibberish into a translating device.</i><br><i><br/></i><i>Then chapter 2 starts and we still don’t have our second character for a few more pages. Tower pops a space Tic Tac and we get a pin-up entrance for Hildreth the civilian space detective.</i><br><i><br/></i><i>Then both characters are seemingly attacked by word bubbles until their magic space technology identifies the body as an exiled royal from another planet. We get a nice splash page giving the history of the exiled royal’s family. Then the book ends.</i><br><i><br/></i><i>It’s not fun. I didn’t learn anything. I don’t care what happens next. It’s bad. The whole 29 pages should be summarized in a page or two while giving us character development. </i><i>Don’t spend money on this like I did.</i></br></br></br></br></br></br></p><p>On the other hand, Harry liked it a lot.</p><p><i><b>Great job craftmanship restored</b></i><br><i>This is a very well done animation of the book .the quantum mortis series is top notch story telling . I read them as fast as I could. The art while having a distinctly retro feel adds to the story without overwhelming it. Knowing what comes next in no way detracts from enjoying the artist’s perspective of the story because he is staying true to the heart of it. The illustrations of hildy and tower actually bring out the romantic understory without taking away from the plot. It is great to see craftsmanship restored to graphic novels. Very few English ones approach the Japanese masters. Letting the art add to the story instead of being pictures without purpose. Well done.</i><br><i><br/></i>To put it in perspective, there is another first issue of a comic where virtually nothing happens, although for 40 pages instead of 28. A guy is in a cage. For decades. Nothing happens except for people actually <i>falling asleep</i> – now there is a fitting metaphor, right? There is no action except for an occult ceremony that doesn’t even involve a dead goat or a naked woman until the guy in the cage escapes off-camera, so we still haven’t seen anything happen until one of the guys who took part in the ceremony falls asleep and has a dream. The end.</br></br></p><p>How absolutely horrible, right? How action-less, motion-less, and literally people-less, as the guy in the cage was not a normal human being. Clearly no one ever bought or read or liked <i>that </i>particular comic, right?  Well, no, because that’s all that happens in the first issue of Neil Gaiman’s <i>Sandman</i>, which happens to be one of the most well-regarded comics series ever written.</p><p>Now, I wonder if there might be anything we can glean from these two extremely divergent reactions to the same comic. Why does SuperComicFunTime hate QM:AMD so much while Harry likes it so much? Perhaps their reviews of other products unrelated to Quantum Mortis might give us a clue. Here are a pair of five-star reviews for other products they liked. Guess which review was written by whom?<br><i><b><br/></b></i><b>Review of <i>Avengers #219: By Divine Right</i></b><br><i>This comic is AWESOME! I got it in a box of comics I opened about three weeks ago. OMG! I was so stoked when I saw Jim Shooter was the writer! </i><i>Janet Van Dyne loses her clothes early on and soon, cosmic hijinks ensue.</i><br><i><b><br/></b></i><b>Review of <i>A Wild Sheep Chase</i> by Haruki Murakami</b><br><i>I immediately recognized the writer’s talent, the </i><i>characterizations and plot integrate seamlessly and while the ending is surprising and </i><i>a little bit disappointing the journey is absolutely worth the time. I can’t remember such </i><i>good prose, and by a non-native English speaker. </i><br><i><br/></i>Different audiences, different tastes. SuperFunComic’s perspective isn’t wrong, it’s just different. I have no doubt that he would be as bored by Murakami as he was by QM-AMD #1. As far as I am concerned, the only relevant question is which market is more interesting to us as a publisher? And since the top-selling comic of 2016 was <i>Big Trouble in Little China/Escape From New York</i> which sold 421,625 units while Murakami’s books sell in the millions, well, I am confident that we are making the right choice.</br></br></br></br></br></p></div>",
  "content_text": "SuperComicFunTime really did not like\nQUANTUM MORTIS A Man Disrupted #1\n:\nQuantum Mortis: The Actionless Comic\nThis book is not a good book. It is action-less, motionless, and for the most part, people-less. The book is divided into two chapters. The first chapter is mostly some guy named Tower flying around and talking to his computer until he lands the ship and talks to a green space monkey that spouts gibberish into a translating device.\nThen chapter 2 starts and we still don’t have our second character for a few more pages. Tower pops a space Tic Tac and we get a pin-up entrance for Hildreth the civilian space detective.\nThen both characters are seemingly attacked by word bubbles until their magic space technology identifies the body as an exiled royal from another planet. We get a nice splash page giving the history of the exiled royal’s family. Then the book ends.\nIt’s not fun. I didn’t learn anything. I don’t care what happens next. It’s bad. The whole 29 pages should be summarized in a page or two while giving us character development.\nDon’t spend money on this like I did.\nOn the other hand, Harry liked it a lot.\nGreat job craftmanship restored\nThis is a very well done animation of the book .the quantum mortis series is top notch story telling . I read them as fast as I could. The art while having a distinctly retro feel adds to the story without overwhelming it. Knowing what comes next in no way detracts from enjoying the artist’s perspective of the story because he is staying true to the heart of it. The illustrations of hildy and tower actually bring out the romantic understory without taking away from the plot. It is great to see craftsmanship restored to graphic novels. Very few English ones approach the Japanese masters. Letting the art add to the story instead of being pictures without purpose. Well done.\nTo put it in perspective, there is another first issue of a comic where virtually nothing happens, although for 40 pages instead of 28. A guy is in a cage. For decades. Nothing happens except for people actually\nfalling asleep\n– now there is a fitting metaphor, right? There is no action except for an occult ceremony that doesn’t even involve a dead goat or a naked woman until the guy in the cage escapes off-camera, so we still haven’t seen anything happen until one of the guys who took part in the ceremony falls asleep and has a dream. The end.\nHow absolutely horrible, right? How action-less, motion-less, and literally people-less, as the guy in the cage was not a normal human being. Clearly no one ever bought or read or liked\nthat\nparticular comic, right?  Well, no, because that’s all that happens in the first issue of Neil Gaiman’s\nSandman\n, which happens to be one of the most well-regarded comics series ever written.\nNow, I wonder if there might be anything we can glean from these two extremely divergent reactions to the same comic. Why does SuperComicFunTime hate QM:AMD so much while Harry likes it so much? Perhaps their reviews of other products unrelated to Quantum Mortis might give us a clue. Here are a pair of five-star reviews for other products they liked. Guess which review was written by whom?\nReview of\nAvengers #219: By Divine Right\nThis comic is AWESOME! I got it in a box of comics I opened about three weeks ago. OMG! I was so stoked when I saw Jim Shooter was the writer!\nJanet Van Dyne loses her clothes early on and soon, cosmic hijinks ensue.\nReview of\nA Wild Sheep Chase\nby Haruki Murakami\nI immediately recognized the writer’s talent, the\ncharacterizations and plot integrate seamlessly and while the ending is surprising and\na little bit disappointing the journey is absolutely worth the time. I can’t remember such\ngood prose, and by a non-native English speaker.\nDifferent audiences, different tastes. SuperFunComic’s perspective isn’t wrong, it’s just different. I have no doubt that he would be as bored by Murakami as he was by QM-AMD #1. As far as I am concerned, the only relevant question is which market is more interesting to us as a publisher? And since the top-selling comic of 2016 was\nBig Trouble in Little China/Escape From New York\nwhich sold 421,625 units while Murakami’s books sell in the millions, well, I am confident that we are making the right choice.",
  "tags": [
    "Arkhaven"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-14T17:49:00+00:00"
}