{
  "url": "https://voxday.net/2018/01/09/a-virtuous-irrelevance/",
  "scraped_at": "2025-12-19T10:38:13.496047",
  "title": "A virtuous irrelevance",
  "date_display": "January 9, 2018",
  "date_iso": "2018-01-09T09:49:00+00:00",
  "date_from_url": "2018-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is what it sounds like, when a moderate moderates:</p><blockquote><p>Ethan Van Sciver@EthanVanSciver<br>TFW Vox Day condemns me and @DiversityAndCmx and as “moderates.”</br></p><p>?</p><p>Ethan Van Sciver@EthanVanSciver<br>Extremists: Our hobby isn’t your cultural battleground.  You’re ruining comics.  Go away.</br></p></blockquote><p>SJWs ruined comics. A single <i>very specific</i> type of extremist ruined comics. There are literally scores of varieties of extremists who had absolutely nothing to do with what has happened in the comics industry over the last three decades. As for me, how can I possibly have contributed to their ruination when I have been a professional comic book writer and publisher for all of <i>one single day</i>? Of course, <a href=\"http://amzn.to/2qBQNo9\">the one comic I have written is an Amazon bestseller</a> and hit the top 10 of all comics and graphic novels yesterday….</p><p>Nevertheless Van Sciver is wrong, because his hobby has become a cultural battleground and it has been one for longer than my own hobby of computer gaming has. And he is bound to fail, as per Sun Tzu, because he knows neither himself nor his enemy.</p><div style=\"text-align: left;\">In less than one year, I expect that I will be a considerably more significant figure in the comics industry than Van Sciver. Not because I’m more talented, because I’m not. Not because I’m smarter, although I am. Simply because I understand the dire situation his heavily converged hobby is presently in and I am doing something about it, as the following review demonstrates.</div><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"><iframe allow=\"encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" gesture=\"media\" height=\"284\" src=\"https://www.youtube.com/embed/0QOR7kqBXFQ\" width=\"512\"></iframe></div><p>UPDATE: Van Sciver allows that maybe, perhaps, Alt★Hero might not <i>necessarily </i>suck because politics. It’s not as if <i>Animal Farm</i> and <i>1984 </i>were artistic failures, after all.</p><blockquote><p>Secular Blasphemy @SecBlasphemy<br>Why can’t a right-wing comic also be a good comic? And Alt-Hero raised nearly a quarter mill, making it very clear what political direction it had. ‘It’s going to be right-wing!’ is a shock to absolutely no one involved.</br></p><p>Ethan Van Sciver‏@EthanVanSciver<br>Yes, I know. Look, I’m buying it. I’ll read it. If it’s good I’ll say so.  It’ll be interesting to see if this publishing venture survives this market past the money raised to start it up.</br></p></blockquote><p>Fair enough. All I ask of the doubters and skeptics is to look at what we’re doing and judge it by the same standards they judge everything else. Look, we know, we absolutely know, that the SJWs are going to trash it to the greatest extent they believe they can do so without looking absurdly stupid. The best we can hope for from them is silence, which you will note is exactly how they greeted the literally unprecedented success of the crowdfunding campaign. And how they greeted the very successful launch of <b><i><a href=\"http://amzn.to/2qBQNo9\">QUANTUM MORTIS A Man Disrupted #1: By the Book</a></i></b>.</p><p>If you don’t like the art, that’s fine. If you genuinely think the story is boring or the characters are vanilla, so be it. If you think the politics overwhelm the story, hey, your mileage may vary. If you dislike me, get in line behind Google, Tor Books, Worldcon, and the SFWA. But, for your own sake, be <i>honest </i>about what it is that you don’t like, even if the only thing you don’t like is the fact that I’m the creator.</p><p>And as anyone who has read my fiction – as opposed to my non-fiction – knows, I’m not at all afraid to present different and opposing viewpoints in a realistic and sympathetic manner. I don’t do so to curry favor with the other side, but because I think it makes for more interesting and more compelling storytelling.</p><p>UPDATE: Actually, looking at his art, he’s pretty damn good. I wonder if he might like to work with Chuck Dixon? We can certainly provide him with better writing than DC is presently inflicting on him.</p><p>UPDATE: Ethan, I’m not pretending not to be mad at you. I’m not mad at all. I’ve even got a <i>considerable </i>quantity of work for you at a healthy page rate if you want it. And I’m not talking about Alt★Hero either.</p></div>",
  "content_text": "This is what it sounds like, when a moderate moderates:\nEthan Van Sciver@EthanVanSciver\nTFW Vox Day condemns me and @DiversityAndCmx and as “moderates.”\n?\nEthan Van Sciver@EthanVanSciver\nExtremists: Our hobby isn’t your cultural battleground.  You’re ruining comics.  Go away.\nSJWs ruined comics. A single\nvery specific\ntype of extremist ruined comics. There are literally scores of varieties of extremists who had absolutely nothing to do with what has happened in the comics industry over the last three decades. As for me, how can I possibly have contributed to their ruination when I have been a professional comic book writer and publisher for all of\none single day\n? Of course,\nthe one comic I have written is an Amazon bestseller\nand hit the top 10 of all comics and graphic novels yesterday….\nNevertheless Van Sciver is wrong, because his hobby has become a cultural battleground and it has been one for longer than my own hobby of computer gaming has. And he is bound to fail, as per Sun Tzu, because he knows neither himself nor his enemy.\nIn less than one year, I expect that I will be a considerably more significant figure in the comics industry than Van Sciver. Not because I’m more talented, because I’m not. Not because I’m smarter, although I am. Simply because I understand the dire situation his heavily converged hobby is presently in and I am doing something about it, as the following review demonstrates.\nUPDATE: Van Sciver allows that maybe, perhaps, Alt★Hero might not\nnecessarily\nsuck because politics. It’s not as if\nAnimal Farm\nand\n1984\nwere artistic failures, after all.\nSecular Blasphemy @SecBlasphemy\nWhy can’t a right-wing comic also be a good comic? And Alt-Hero raised nearly a quarter mill, making it very clear what political direction it had. ‘It’s going to be right-wing!’ is a shock to absolutely no one involved.\nEthan Van Sciver‏@EthanVanSciver\nYes, I know. Look, I’m buying it. I’ll read it. If it’s good I’ll say so.  It’ll be interesting to see if this publishing venture survives this market past the money raised to start it up.\nFair enough. All I ask of the doubters and skeptics is to look at what we’re doing and judge it by the same standards they judge everything else. Look, we know, we absolutely know, that the SJWs are going to trash it to the greatest extent they believe they can do so without looking absurdly stupid. The best we can hope for from them is silence, which you will note is exactly how they greeted the literally unprecedented success of the crowdfunding campaign. And how they greeted the very successful launch of\nQUANTUM MORTIS A Man Disrupted #1: By the Book\n.\nIf you don’t like the art, that’s fine. If you genuinely think the story is boring or the characters are vanilla, so be it. If you think the politics overwhelm the story, hey, your mileage may vary. If you dislike me, get in line behind Google, Tor Books, Worldcon, and the SFWA. But, for your own sake, be\nhonest\nabout what it is that you don’t like, even if the only thing you don’t like is the fact that I’m the creator.\nAnd as anyone who has read my fiction – as opposed to my non-fiction – knows, I’m not at all afraid to present different and opposing viewpoints in a realistic and sympathetic manner. I don’t do so to curry favor with the other side, but because I think it makes for more interesting and more compelling storytelling.\nUPDATE: Actually, looking at his art, he’s pretty damn good. I wonder if he might like to work with Chuck Dixon? We can certainly provide him with better writing than DC is presently inflicting on him.\nUPDATE: Ethan, I’m not pretending not to be mad at you. I’m not mad at all. I’ve even got a\nconsiderable\nquantity of work for you at a healthy page rate if you want it. And I’m not talking about Alt★Hero either.",
  "tags": [
    "cuckservative",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-09T09:49:00+00:00"
}