{
  "url": "https://voxday.net/2018/01/29/america-losing-interest-in-sjw-entertainment/",
  "scraped_at": "2025-12-19T10:41:04.714855",
  "title": "America losing interest in SJW “entertainment”",
  "date_display": "January 29, 2018",
  "date_iso": "2018-01-29T16:07:00+00:00",
  "date_from_url": "2018-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently pedos, minstrels, and whores are of less interest than they used to be:</p><blockquote><p>The CBS telecast is down a steep 21 percent from 2017 in early numbers, potentially spelling an all-time low. Sunday’s Bruno Mars-loving Grammy Awards took a steep ratings spill by the first-available metrics. The show, which ran a bloated three-and-a-half hours, was off an unfortunate 21 percent from 2017 in early numbers. Overnight returns from Nielsen Media give it a 12.7 rating among households — marking its biggest drop since the 2013, the year after the show swelled following the death of Whitney Houston.</p></blockquote><p>I know it’s common for the old to bitch about the music of the young. But the thing is, there are plenty of young people putting out <i>really good</i> music today. They’re just not doing it through the converged corporate pop channel anymore.</p><p>Three-quarters of my car music is old. The other quarter is downloaded from Youtube. But <a href=\"https://www.youtube.com/watch?v=MH9FyLsfDzw\">this sort of thing</a> will never be on the Grammies, because it isn’t SKWAK-Q featuring Jay-Z lip-syncing to synchronized pelvic thrusts by an unattractive woman with oversized buttocks and an expression that says “something smells really bad in here.”</p><p>Frankly, I’m astonished that anyone watches them anymore.</p></div>",
  "content_text": "Apparently pedos, minstrels, and whores are of less interest than they used to be:\nThe CBS telecast is down a steep 21 percent from 2017 in early numbers, potentially spelling an all-time low. Sunday’s Bruno Mars-loving Grammy Awards took a steep ratings spill by the first-available metrics. The show, which ran a bloated three-and-a-half hours, was off an unfortunate 21 percent from 2017 in early numbers. Overnight returns from Nielsen Media give it a 12.7 rating among households — marking its biggest drop since the 2013, the year after the show swelled following the death of Whitney Houston.\nI know it’s common for the old to bitch about the music of the young. But the thing is, there are plenty of young people putting out\nreally good\nmusic today. They’re just not doing it through the converged corporate pop channel anymore.\nThree-quarters of my car music is old. The other quarter is downloaded from Youtube. But\nthis sort of thing\nwill never be on the Grammies, because it isn’t SKWAK-Q featuring Jay-Z lip-syncing to synchronized pelvic thrusts by an unattractive woman with oversized buttocks and an expression that says “something smells really bad in here.”\nFrankly, I’m astonished that anyone watches them anymore.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-29T16:07:00+00:00"
}