{
  "url": "https://voxday.net/2018/01/31/america-is-not-the-world/",
  "scraped_at": "2025-12-19T10:41:23.258818",
  "title": "America is not the world",
  "date_display": "January 31, 2018",
  "date_iso": "2018-01-31T13:53:14+00:00",
  "date_from_url": "2018-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pat Buchanan tries to explain to civic globalists that <a href=\"http://takimag.com/article/trump_in_immigration_debate_race_matters_patrick_buchanan\">nationalism isn’t color-blind</a> and race does, in fact, matter:</p><blockquote><p>Today, issues of immigration and race are tearing countries and continents apart. There are anti-immigrant parties in every nation in Europe. Turkey is being bribed to keep Syrian refugees out of Europe.</p><p>Boatloads of Africans from Libya are being turned back in the Med. After building a wall to keep them out, Bibi Netanyahu has told “illegal aliens” from Africa: Get out of Israel by March, or go to jail.</p><p>Angela Merkel’s Party may have suffered irreparable damage when she let a million Mideast refugees in. The larger concentrations of Arabs, Africans and Turks in Britain, France and Germany are not assimilating. Central European nations are sealing borders.</p><p>Europe fears a future in which the continent, with its shrinking numbers of native-born, is swamped by peoples from the Third World.</p><p>Yet the future alarmed Europeans are resisting is a future U.S. elites have embraced. Among the reasons, endless mass migration here means the demographic death of the GOP.</p><p>In U.S. presidential elections, persons of color whose roots are in Asia, Africa and Latin America vote 4-1 Democratic, and against the candidates favored by American’s vanishing white majority. Not for the first time, liberal ideology comports precisely with liberal interests.</p><p>Mass immigration means an America in 2050 with no core majority, made up of minorities of every race, color, religion and culture on earth, a continent-wide replica of the wonderful diversity we see today in the U.N. General Assembly.</p></blockquote><p>It’s interesting to see rock-solid conservatives finally getting on board with the Alt-Right conceptually, even though they will probably continue to resist openly identifying with it. Which is fine. The important aspect of a political philosophy is the adoption of the ideas, not the label, the identity, or the brand. I very much doubt that Aristotle lost any sleep at all over what those who adopted his ideas elected to call themselves.</p><p>Whenever you see people talking about “the brand” or purity-signaling, you can be confident that they are either shills of some sort, they are attention-seekers, or they harbor ambitions of leadership. There isn’t necessarily anything wrong with any of these things – I would have to be the last to criticize anyone else for trying to sell books – but from the philosophical perspective, they are all <i>irrelevant</i>. Sure, it must be annoying when you hear others spouting your ideas, or in some cases, your literal words, without crediting or acknowledging the source of them. But at the end of the day, it’s really the propagation of the ideas throughout the population that matters.</p><p>There is no such thing as “civic nationalism”. It is a self-contradictory concept that confuses the state with the nation and “civic globalism” is the more precise term. There is also no such thing as “ethno-nationalism”. The term is redundant.</p></div>",
  "content_text": "Pat Buchanan tries to explain to civic globalists that\nnationalism isn’t color-blind\nand race does, in fact, matter:\nToday, issues of immigration and race are tearing countries and continents apart. There are anti-immigrant parties in every nation in Europe. Turkey is being bribed to keep Syrian refugees out of Europe.\nBoatloads of Africans from Libya are being turned back in the Med. After building a wall to keep them out, Bibi Netanyahu has told “illegal aliens” from Africa: Get out of Israel by March, or go to jail.\nAngela Merkel’s Party may have suffered irreparable damage when she let a million Mideast refugees in. The larger concentrations of Arabs, Africans and Turks in Britain, France and Germany are not assimilating. Central European nations are sealing borders.\nEurope fears a future in which the continent, with its shrinking numbers of native-born, is swamped by peoples from the Third World.\nYet the future alarmed Europeans are resisting is a future U.S. elites have embraced. Among the reasons, endless mass migration here means the demographic death of the GOP.\nIn U.S. presidential elections, persons of color whose roots are in Asia, Africa and Latin America vote 4-1 Democratic, and against the candidates favored by American’s vanishing white majority. Not for the first time, liberal ideology comports precisely with liberal interests.\nMass immigration means an America in 2050 with no core majority, made up of minorities of every race, color, religion and culture on earth, a continent-wide replica of the wonderful diversity we see today in the U.N. General Assembly.\nIt’s interesting to see rock-solid conservatives finally getting on board with the Alt-Right conceptually, even though they will probably continue to resist openly identifying with it. Which is fine. The important aspect of a political philosophy is the adoption of the ideas, not the label, the identity, or the brand. I very much doubt that Aristotle lost any sleep at all over what those who adopted his ideas elected to call themselves.\nWhenever you see people talking about “the brand” or purity-signaling, you can be confident that they are either shills of some sort, they are attention-seekers, or they harbor ambitions of leadership. There isn’t necessarily anything wrong with any of these things – I would have to be the last to criticize anyone else for trying to sell books – but from the philosophical perspective, they are all\nirrelevant\n. Sure, it must be annoying when you hear others spouting your ideas, or in some cases, your literal words, without crediting or acknowledging the source of them. But at the end of the day, it’s really the propagation of the ideas throughout the population that matters.\nThere is no such thing as “civic nationalism”. It is a self-contradictory concept that confuses the state with the nation and “civic globalism” is the more precise term. There is also no such thing as “ethno-nationalism”. The term is redundant.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-31T13:53:14+00:00"
}