{
  "url": "https://voxday.net/2018/01/21/championship-sunday/",
  "scraped_at": "2025-12-19T10:40:01.822053",
  "title": "Championship Sunday",
  "date_display": "January 21, 2018",
  "date_iso": "2018-01-21T17:13:00+00:00",
  "date_from_url": "2018-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sacksonville vs Tom Brady’s Hand. Nick Foles, Backup QB vs The Team of Destiny. Discuss amongst yourselves. Also, SKOL!</p><p>Haven’t seen a defense hit like the Jags since the 2000 Ravens. Of course, the rules have changed since then, which could be a problem.</p><p>UPDATE: 24-7 at the half. About all I can say is that if you can’t stop the Foles-to-Ertz connection, you have no business trying to stop Brady-to-Gronkowski. So far, this game has all the flavor of a Denny Green playoff classic, where the coaching staff simply gets outprepared and outcoached by the opponent’s coaches. It would be nice to see some <i>serious </i>adjustments demonstrating otherwise.</p><p>UPDATE: 38-7. Game isn’t over, but it’s over. Outplayed, outcoached, there is simply nothing to complain about. I have the feeling that the defensive backs were told not to worry about double moves because Foles wouldn’t be throwing deep. Coach Zim is going to have to up his game if he is going to succeed at this point in the season; my earlier impression of a Denny Green playoff classic would appear to have been correct. I am very impressed with the Philadelphia coaches, as they clearly had their team very well-prepared for this game.</p><p>About the only silver linings to be found are that a) it will be cheaper to keep Case next year and b) the NFL ratings for the conference championships are promise to be abysmal.</p></div>",
  "content_text": "Sacksonville vs Tom Brady’s Hand. Nick Foles, Backup QB vs The Team of Destiny. Discuss amongst yourselves. Also, SKOL!\nHaven’t seen a defense hit like the Jags since the 2000 Ravens. Of course, the rules have changed since then, which could be a problem.\nUPDATE: 24-7 at the half. About all I can say is that if you can’t stop the Foles-to-Ertz connection, you have no business trying to stop Brady-to-Gronkowski. So far, this game has all the flavor of a Denny Green playoff classic, where the coaching staff simply gets outprepared and outcoached by the opponent’s coaches. It would be nice to see some\nserious\nadjustments demonstrating otherwise.\nUPDATE: 38-7. Game isn’t over, but it’s over. Outplayed, outcoached, there is simply nothing to complain about. I have the feeling that the defensive backs were told not to worry about double moves because Foles wouldn’t be throwing deep. Coach Zim is going to have to up his game if he is going to succeed at this point in the season; my earlier impression of a Denny Green playoff classic would appear to have been correct. I am very impressed with the Philadelphia coaches, as they clearly had their team very well-prepared for this game.\nAbout the only silver linings to be found are that a) it will be cheaper to keep Case next year and b) the NFL ratings for the conference championships are promise to be abysmal.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-21T17:13:00+00:00"
}