{
  "url": "https://voxday.net/2018/01/04/conservative-hispanic-writer-banned/",
  "scraped_at": "2025-12-19T10:37:36.200577",
  "title": "Conservative Hispanic writer banned",
  "date_display": "January 4, 2018",
  "date_iso": "2018-01-04T13:00:00+00:00",
  "date_from_url": "2018-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PJ Media covers <a href=\"https://pjmedia.com/trending/sjws-bar-conservative-hispanic-writer-worldcon-claiming-racist-bully/amp/?__twitter_impression=true\">Worldcon’s unconscionable banning</a> of conservative Hispanic writer Jon Del Arroz on obviously specious grounds.</p><blockquote><p>Jon Del Arroz won’t be going to the Worldcon science fiction convention, even though he is the leading Hispanic voice in science fiction and he bought a ticket. The multi-award nominated military science fiction author was banned publicly from the upcoming festivities in San Jose, California, without ceremony or explanation by Worldcon’s Incident Response Team. “At this time we are converting your membership to Worldcon76 to a supporting membership as you will not be permitted to attend the convention. On your personal blog you have made it clear that you are both expecting and planning on engendering a hostile environment which we do not allow. If you are found on the premises of the convention center or any of the official convention hotels you will be removed,” the organizers wrote….</p><p>Del Arroz believes that the banning is politically motivated since he is not only a science fiction author but a strong conservative voice at The Federalist and Dangerous (Milo Yiannopoulos’s new venture) who routinely speaks out about the blacklisting of conservative voices in science fiction.</p><p>“With Worldcon’s statements about ‘intent’ to violate their rules, and failure to specify rules, this is a clear targeting over my politics because I’m a vocal Christian and Hispanic Trump supporter,” says Del Arroz. “The left claims I should be banned for controversial political opinions, but the only opinion I espouse on a regular basis is that artists should not be blackballed for their politics. That shouldn’t be a controversial topic. It is imperative that artists be free from fear of retaliation of their industry in order that they might create great works of art. This is the ultimate free speech issue.”</p><p>Del Arroz is contracted as a writer for Castalia House’s spectacular answer to SJW Marvel, <i>Alt*Hero</i>, which will issue a major challenge to social justice messaging in comics. PJ Media reached out to Castalia’s lead editor, Vox Day, for his take on the blacklisting. “The decision of the SJWs at the 2018 Worldcon to ban a well-known Hispanic conservative from attending the event is not surprising,” said Day. “It is, however, not a little ironic, as they have historically had no problem permitting child molesters and convicted sex criminals to attend Worldcons over the years, including Walter Breen, Arthur C. Clarke, David Asimov, Marion Zimmer Bradley, and Edward E. Kramer.</p><p> The Walter Breen incident with Worldcon was especially horrifying as told by his daughter Moira Greyland Peat in her latest tell-all, <i>The Last Closet</i>, which describes her life growing up in a pagan LGBTQWTF family and spills the darkest secrets of a science fiction community that turned a blind eye to child sex abuse.</p></blockquote><p>Considering the known and suspected sex criminals who are <i>still </i>permitted to openly attend Worldcon, it’s almost astonishing that the organizers would dare to call attention to their attendance policies in this regard. Almost, but not quite. What I find more astonishing is the idea that Jon Del Arroz, or any sane, functional human being, wants to spend any time at all in the depraved Star Wars cantina of science fiction fandom.</p><p>The picture below demonstrates why the wise parent will never permit any child or teenager to attend Worldcon 76 or any other science fiction convention. It was taken at a science fiction convention and two of the children pictured confirm that they were abused by the man in the photograph. The third committed suicide. For a considerably more detailed case against science fiction fandom, read <b><i><a href=\"http://amzn.to/2C8tpQl\">The Last Closet: The Dark Side of Avalon</a>.</i></b></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://pbs.twimg.com/media/DSsh7a6WkAIC6Gp.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"633\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DSsh7a6WkAIC6Gp.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"633\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DSsh7a6WkAIC6Gp.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20633%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "PJ Media covers\nWorldcon’s unconscionable banning\nof conservative Hispanic writer Jon Del Arroz on obviously specious grounds.\nJon Del Arroz won’t be going to the Worldcon science fiction convention, even though he is the leading Hispanic voice in science fiction and he bought a ticket. The multi-award nominated military science fiction author was banned publicly from the upcoming festivities in San Jose, California, without ceremony or explanation by Worldcon’s Incident Response Team. “At this time we are converting your membership to Worldcon76 to a supporting membership as you will not be permitted to attend the convention. On your personal blog you have made it clear that you are both expecting and planning on engendering a hostile environment which we do not allow. If you are found on the premises of the convention center or any of the official convention hotels you will be removed,” the organizers wrote….\nDel Arroz believes that the banning is politically motivated since he is not only a science fiction author but a strong conservative voice at The Federalist and Dangerous (Milo Yiannopoulos’s new venture) who routinely speaks out about the blacklisting of conservative voices in science fiction.\n“With Worldcon’s statements about ‘intent’ to violate their rules, and failure to specify rules, this is a clear targeting over my politics because I’m a vocal Christian and Hispanic Trump supporter,” says Del Arroz. “The left claims I should be banned for controversial political opinions, but the only opinion I espouse on a regular basis is that artists should not be blackballed for their politics. That shouldn’t be a controversial topic. It is imperative that artists be free from fear of retaliation of their industry in order that they might create great works of art. This is the ultimate free speech issue.”\nDel Arroz is contracted as a writer for Castalia House’s spectacular answer to SJW Marvel,\nAlt*Hero\n, which will issue a major challenge to social justice messaging in comics. PJ Media reached out to Castalia’s lead editor, Vox Day, for his take on the blacklisting. “The decision of the SJWs at the 2018 Worldcon to ban a well-known Hispanic conservative from attending the event is not surprising,” said Day. “It is, however, not a little ironic, as they have historically had no problem permitting child molesters and convicted sex criminals to attend Worldcons over the years, including Walter Breen, Arthur C. Clarke, David Asimov, Marion Zimmer Bradley, and Edward E. Kramer.\nThe Walter Breen incident with Worldcon was especially horrifying as told by his daughter Moira Greyland Peat in her latest tell-all,\nThe Last Closet\n, which describes her life growing up in a pagan LGBTQWTF family and spills the darkest secrets of a science fiction community that turned a blind eye to child sex abuse.\nConsidering the known and suspected sex criminals who are\nstill\npermitted to openly attend Worldcon, it’s almost astonishing that the organizers would dare to call attention to their attendance policies in this regard. Almost, but not quite. What I find more astonishing is the idea that Jon Del Arroz, or any sane, functional human being, wants to spend any time at all in the depraved Star Wars cantina of science fiction fandom.\nThe picture below demonstrates why the wise parent will never permit any child or teenager to attend Worldcon 76 or any other science fiction convention. It was taken at a science fiction convention and two of the children pictured confirm that they were abused by the man in the photograph. The third committed suicide. For a considerably more detailed case against science fiction fandom, read\nThe Last Closet: The Dark Side of Avalon\n.",
  "tags": [
    "HugoAward",
    "PinkSF"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-04T13:00:00+00:00"
}