{
  "url": "https://voxday.net/2018/01/07/defense-doesnt-win/",
  "scraped_at": "2025-12-19T10:37:59.954770",
  "title": "Defense doesn’t win",
  "date_display": "January 7, 2018",
  "date_iso": "2018-01-07T13:11:00+00:00",
  "date_from_url": "2018-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not when it comes <a href=\"http://www.dailymail.co.uk/news/article-5241565/Michael-Wolff-claims-book-Trump-end-presidency.html\">to the media</a>. The God-Emperor needs to remember this and go back on the attack:</p><blockquote><p>President Trump defended his mental health again at a press conference on Saturday, saying his Ivy League education, television fame and 2016 election win are proof he is more than competent to run the country.</p><p>Responding to claims in Michael Wolff’s new book Fire and Fury that White House insiders worry he is suffering mental decline, the president fired back and said he was never interviewed for it – hours after declaring himself a ‘very stable genius’ on Twitter.</p><p>‘It’s a disgrace that he can do something like this,’ said Trump said of Wolff, who he called a ‘fraud’ as he attacked the libel laws in the United States at a Camp David press conference attended by GOP leaders.</p><p>‘Libel laws are very weak in this country. If they were stronger, hopefully, you would not have something like that happen,’ said Trump who had defended his intelligence just moments before. </p><p>‘Only because I went to the best colleges, I was an excellent student, came out and made billions and billions of dollars and became one of the top business people, went to television and was a tremendous success, as I am sure you all know and ran for president first time and won.’</p><p>‘And then this guy who doesn’t know me, doesn’t know me at all. Who said he interviewed me for three hours in the White House, it didn’t exist, it’s in his imagination.’</p><p>‘He was never in the Oval Office,’ said the president who blamed ‘Sloppy’ Steve Bannon for bringing him into the White House.</p><p>Trump then dubbed the biography ‘a work of fiction’.</p><p>Earlier on Saturday, Wolff, who is a contributor to the Hollywood Reporter, gave that publication a follow up interview on Saturday in which he said he knew Trump was apoplectic with rage over the book.</p><p>‘I hear that the president is very angry, or, let me be precise: I hear that he is truly bouncing off the walls,’ said Wolff to the magazine.</p><p>The journalist’s book – ‘Fire and Fury’ has already shot to the top of the New York Times bestseller’s list and portrays Trump as an imbecile who never believed he would win the 2016 election. The book also severely questions the president’s ability to carry out his job and casts aspersions on his mental acuity amid suggestions from White House sources he might be losing his mind.</p></blockquote><p>This is a classic gamma attack on an alpha. The gamma doesn’t have any actual power, so he lies about the alpha, thereby angering the alpha, and provoking him into a response that the gamma then smugly claims to be a victory. And you know this guy Wolff is a total gamma by the way he asserts that no one in the Trump White House reads books <i>because they hadn’t heard of him</i>. I read, edit, and write books and I’d never heard of him either. That’s a <i>phenomenal </i>example of gamma posturing combined with self-serving gamma logic.</p><p>The problem that Trump has here is that it doesn’t matter how intelligent and mentally stable you actually are, or how accomplished you are, you’re never going to look either smart or mentally stable by stating the obvious. It always comes off as a angry, bewildered, overmatched unfrozen caveman claiming “me am too smart!”</p><p>It’s considerably more effective to call out the gamma directly, openly mock him, and engage in direct conflict with him by utilizing objective measures. Trump should have a) compared his SAT scores with the journalist’s own scores while b) having the Secret Service dig up Wolff’s history of mental health issues and calling them into question. The chances are very high that Wolff, who is a known fabricator, has been on some sort of medication for depression for years and is doing little more than projecting his own mental instability onto the God-Emperor.</p><p>Gammas always, always, always rely upon nebulous insinuation and provocation, and they always, always, always retreat from any form of conflict that can be objectively measured by outsiders. For example, this is why the site traffic comparison is so damaging to Scalzi; there is simply no amount of dancing, twisting, redefining, or obfuscation that can permit him to credibly claim victory somehow which his gamma nature psychologically requires.</p><p>This also demonstrates why a knowledge of socio-sexuality is crucial in understanding how to appropriately respond to attacks. Wolff is <i>absolutely delighted</i> with being angrily denounced in general terms. That, to the gamma, is exactly what victory over an alpha looks like.</p><p>We know Trump isn’t a sigma because he didn’t simply smile and publicly ignore the book while having both Wolff and his publisher audited by the IRS and investigated by the DEA.</p></div>",
  "content_text": "Not when it comes\nto the media\n. The God-Emperor needs to remember this and go back on the attack:\nPresident Trump defended his mental health again at a press conference on Saturday, saying his Ivy League education, television fame and 2016 election win are proof he is more than competent to run the country.\nResponding to claims in Michael Wolff’s new book Fire and Fury that White House insiders worry he is suffering mental decline, the president fired back and said he was never interviewed for it – hours after declaring himself a ‘very stable genius’ on Twitter.\n‘It’s a disgrace that he can do something like this,’ said Trump said of Wolff, who he called a ‘fraud’ as he attacked the libel laws in the United States at a Camp David press conference attended by GOP leaders.\n‘Libel laws are very weak in this country. If they were stronger, hopefully, you would not have something like that happen,’ said Trump who had defended his intelligence just moments before.\n‘Only because I went to the best colleges, I was an excellent student, came out and made billions and billions of dollars and became one of the top business people, went to television and was a tremendous success, as I am sure you all know and ran for president first time and won.’\n‘And then this guy who doesn’t know me, doesn’t know me at all. Who said he interviewed me for three hours in the White House, it didn’t exist, it’s in his imagination.’\n‘He was never in the Oval Office,’ said the president who blamed ‘Sloppy’ Steve Bannon for bringing him into the White House.\nTrump then dubbed the biography ‘a work of fiction’.\nEarlier on Saturday, Wolff, who is a contributor to the Hollywood Reporter, gave that publication a follow up interview on Saturday in which he said he knew Trump was apoplectic with rage over the book.\n‘I hear that the president is very angry, or, let me be precise: I hear that he is truly bouncing off the walls,’ said Wolff to the magazine.\nThe journalist’s book – ‘Fire and Fury’ has already shot to the top of the New York Times bestseller’s list and portrays Trump as an imbecile who never believed he would win the 2016 election. The book also severely questions the president’s ability to carry out his job and casts aspersions on his mental acuity amid suggestions from White House sources he might be losing his mind.\nThis is a classic gamma attack on an alpha. The gamma doesn’t have any actual power, so he lies about the alpha, thereby angering the alpha, and provoking him into a response that the gamma then smugly claims to be a victory. And you know this guy Wolff is a total gamma by the way he asserts that no one in the Trump White House reads books\nbecause they hadn’t heard of him\n. I read, edit, and write books and I’d never heard of him either. That’s a\nphenomenal\nexample of gamma posturing combined with self-serving gamma logic.\nThe problem that Trump has here is that it doesn’t matter how intelligent and mentally stable you actually are, or how accomplished you are, you’re never going to look either smart or mentally stable by stating the obvious. It always comes off as a angry, bewildered, overmatched unfrozen caveman claiming “me am too smart!”\nIt’s considerably more effective to call out the gamma directly, openly mock him, and engage in direct conflict with him by utilizing objective measures. Trump should have a) compared his SAT scores with the journalist’s own scores while b) having the Secret Service dig up Wolff’s history of mental health issues and calling them into question. The chances are very high that Wolff, who is a known fabricator, has been on some sort of medication for depression for years and is doing little more than projecting his own mental instability onto the God-Emperor.\nGammas always, always, always rely upon nebulous insinuation and provocation, and they always, always, always retreat from any form of conflict that can be objectively measured by outsiders. For example, this is why the site traffic comparison is so damaging to Scalzi; there is simply no amount of dancing, twisting, redefining, or obfuscation that can permit him to credibly claim victory somehow which his gamma nature psychologically requires.\nThis also demonstrates why a knowledge of socio-sexuality is crucial in understanding how to appropriately respond to attacks. Wolff is\nabsolutely delighted\nwith being angrily denounced in general terms. That, to the gamma, is exactly what victory over an alpha looks like.\nWe know Trump isn’t a sigma because he didn’t simply smile and publicly ignore the book while having both Wolff and his publisher audited by the IRS and investigated by the DEA.",
  "tags": [
    "AlphaGame",
    "books",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-07T13:11:00+00:00"
}