{
  "url": "https://voxday.net/2018/01/17/disabled-veteran-fired-by-sjws/",
  "scraped_at": "2025-12-19T10:39:30.624337",
  "title": "Disabled veteran fired by SJWs",
  "date_display": "January 17, 2018",
  "date_iso": "2018-01-17T23:31:00+00:00",
  "date_from_url": "2018-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SJWs don’t care who you are if you <a href=\"https://pjmedia.com/trending/disabled-veteran-loses-job-wrongthink-male-male-sexual-assault/\">violate their narrative</a>.</p><blockquote><p>Will Caligan, a Desert Shield and Desert Storm veteran suffering Gulf War Syndrome, is out of a job. What caused him to lose it is one more weight on the scale that is tipping America toward total insanity. Caligan is a talented comics artist who contracted with Short Fuse Media Group to produce comic books. If you have followed any of my investigations into #Comicsgate you would know that the comics industry has been completely taken over by rabid alt-left types who spent their days devising ways to destroy beloved characters by “diversifying” them into an approved SJW mold. Caligan, a conservative Christian, had little chance of survival in that environment. One hint of wrongthink could spell curtains for any artist, writer or producer in today’s comics climate. In Caligan’s case, he made the catastrophic mistake of voicing his opinion about a pop culture story about a straight man rebuffing a kiss from a transwoman….</p><p>Caligan contacted Sean Mack, his boss at Short Fuse Media Group, who seemed to take the whole thing in stride at first, writing in a communication, “If it’s not this, it would be for something else. Don’t stress over it. I’m good and we’re dealing with it head on. I have your back!” He quickly changed his tune with no explanation — presumably after being threatened by rabid SJWs and facing too much pressure by the lynch mob — and cut ties with Caligan. “I’m going to have to put some distance between us until you can change the perception people have of you,” wrote Mack.</p></blockquote><p>I’ve been asked to see if there is anything we can do as a comics publisher to help the guy out, and I’m looking into the situation. I’ll do a Periscope in half an hour if I manage to pull a few things together.</p><p>UPDATE: All right, I talked to <a href=\"https://www.artstation.com/alphadog\">Will </a>and a few others and here is what we’re going to do. On Monday, we’re going to launch a special one-week Freestartr. Freestartr has reduced their usual fee to support the campaign and all of the funds are going to be used to hire Will, a colorist, and a cover artist to do as many comics as their normal rates allow, and to cover the cost of printing them. The comics will be based on the books(s) of one of the Castalia authors, to be chosen by the backers from a list that will be made public on Monday. So far, Nick Cole, Peter Grant, Lawdog, Rolf Nelson, Kai Wai Cheah, and John C. Wright have all made books available at no charge; if you’re a Castalia author who is interested in supporting this project, email me and let me know that you’re in and with which books. The scripts will be adapted from the books for free by Chuck Dixon and me.</p><p>Arkhaven will publish the comics in print and digital editions which will be provided to the backers as per the campaign rewards and 50 percent of any subsequent sales will be split between Will, the contributors, and the backer-selected author(s). Arkhaven will take care of all the setup and layout costs.</p><p>More details to come this weekend. I don’t know Will, but I agreed to pitch in because he is a Christian and a veteran and I think it is is important to demonstrate to the SJWs and those they have successfully intimidated know that their victims are not going to be forgotten or left behind.</p><p>UPDATE: Moira Greyland also graciously offered her support for this project. GAH! (shudders uncontrollably for 15 seconds) While I appreciate her gesture, we will not even consider doing a graphic novel adaptation of <i>The Last Closet</i>, for reasons that anyone who has read it will understand.</p></div>",
  "content_text": "SJWs don’t care who you are if you\nviolate their narrative\n.\nWill Caligan, a Desert Shield and Desert Storm veteran suffering Gulf War Syndrome, is out of a job. What caused him to lose it is one more weight on the scale that is tipping America toward total insanity. Caligan is a talented comics artist who contracted with Short Fuse Media Group to produce comic books. If you have followed any of my investigations into #Comicsgate you would know that the comics industry has been completely taken over by rabid alt-left types who spent their days devising ways to destroy beloved characters by “diversifying” them into an approved SJW mold. Caligan, a conservative Christian, had little chance of survival in that environment. One hint of wrongthink could spell curtains for any artist, writer or producer in today’s comics climate. In Caligan’s case, he made the catastrophic mistake of voicing his opinion about a pop culture story about a straight man rebuffing a kiss from a transwoman….\nCaligan contacted Sean Mack, his boss at Short Fuse Media Group, who seemed to take the whole thing in stride at first, writing in a communication, “If it’s not this, it would be for something else. Don’t stress over it. I’m good and we’re dealing with it head on. I have your back!” He quickly changed his tune with no explanation — presumably after being threatened by rabid SJWs and facing too much pressure by the lynch mob — and cut ties with Caligan. “I’m going to have to put some distance between us until you can change the perception people have of you,” wrote Mack.\nI’ve been asked to see if there is anything we can do as a comics publisher to help the guy out, and I’m looking into the situation. I’ll do a Periscope in half an hour if I manage to pull a few things together.\nUPDATE: All right, I talked to\nWill\nand a few others and here is what we’re going to do. On Monday, we’re going to launch a special one-week Freestartr. Freestartr has reduced their usual fee to support the campaign and all of the funds are going to be used to hire Will, a colorist, and a cover artist to do as many comics as their normal rates allow, and to cover the cost of printing them. The comics will be based on the books(s) of one of the Castalia authors, to be chosen by the backers from a list that will be made public on Monday. So far, Nick Cole, Peter Grant, Lawdog, Rolf Nelson, Kai Wai Cheah, and John C. Wright have all made books available at no charge; if you’re a Castalia author who is interested in supporting this project, email me and let me know that you’re in and with which books. The scripts will be adapted from the books for free by Chuck Dixon and me.\nArkhaven will publish the comics in print and digital editions which will be provided to the backers as per the campaign rewards and 50 percent of any subsequent sales will be split between Will, the contributors, and the backer-selected author(s). Arkhaven will take care of all the setup and layout costs.\nMore details to come this weekend. I don’t know Will, but I agreed to pitch in because he is a Christian and a veteran and I think it is is important to demonstrate to the SJWs and those they have successfully intimidated know that their victims are not going to be forgotten or left behind.\nUPDATE: Moira Greyland also graciously offered her support for this project. GAH! (shudders uncontrollably for 15 seconds) While I appreciate her gesture, we will not even consider doing a graphic novel adaptation of\nThe Last Closet\n, for reasons that anyone who has read it will understand.",
  "tags": [
    "Arkhaven",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-17T23:31:00+00:00"
}