{
  "url": "https://voxday.net/2018/01/12/evs-vs-vd/",
  "scraped_at": "2025-12-19T10:38:38.995552",
  "title": "EVS vs VD",
  "date_display": "January 12, 2018",
  "date_iso": "2018-01-12T00:48:00+00:00",
  "date_from_url": "2018-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"tr_bq\">It is officially on.</div><blockquote><p><a href=\"https://twitter.com/EthanVanSciver/status/951582858950447104\">Ethan Van Sciver‏@EthanVanSciver</a><br>Next guest interview is with Alt Hero creator and my new arch enemy Vox Day.  Monday at 7 PM.  Trailer is coming.</br></p></blockquote><p>In order to allow us to focus on EVS’s questions on Monday, let me get a few of those posed by his Twitter followers out of the way.</p><p><i>Ask him why he’s so obsessed with Jews in the negative sense and why he believes non-white people are inherently chaos bringers and can’t be a part of western civilization.</i></p><p>I’m not obsessed with Jews in any sense. Being pro-Christian, pro-American and pro-Western civilization, I am opposed to everyone who seeks to fundamentally alter either the American nation or Western civilization, no matter who they are or what their reasons might be. Non-Westerners are not, by definition, part of Western civilization, they have their own civilizations, customs, and traditions which they quite naturally prefer, and to quote a VP reader quoting Horace, <i>they change their sky, not their souls, who cross the sea.</i></p><p>In other words, they don’t bring chaos, they merely bring civilizational changes which often result in chaos. Exactly as European whites did to American Indian civilization. But the fact that the invasion and subsequent changes may be well-merited from a karmic perspective doesn’t actually make it desirable for anyone who values America and the West.</p><p><i>Ask him if he still believes N.K. Jemisin is a half savage, and those of her ethnic heritage shouldn’t write sci-fi.</i></p><p>Yes, I still believe NK Jemisin is “an educated, but ignorant half-savage, with little more understanding of what it took to build a new literature by ‘a bunch of beardy old middle-class middle-American guys’ than an illiterate Igbotu tribesman has of how to build a jet engine.” Those of her ethnic heritage are certainly welcome to write science fiction if they please, but Jemisin observably shouldn’t. Her two successive Hugo Awards for Best Novel are a more embarrassing indictment of the degraded state of so-called science fiction than the nominations of “Alien Stripper Boned From Behind By The T-Rex” and “Space Raptor Butt Invasion” <i>combined.</i></p></div>",
  "content_text": "It is officially on.\nEthan Van Sciver‏@EthanVanSciver\nNext guest interview is with Alt Hero creator and my new arch enemy Vox Day.  Monday at 7 PM.  Trailer is coming.\nIn order to allow us to focus on EVS’s questions on Monday, let me get a few of those posed by his Twitter followers out of the way.\nAsk him why he’s so obsessed with Jews in the negative sense and why he believes non-white people are inherently chaos bringers and can’t be a part of western civilization.\nI’m not obsessed with Jews in any sense. Being pro-Christian, pro-American and pro-Western civilization, I am opposed to everyone who seeks to fundamentally alter either the American nation or Western civilization, no matter who they are or what their reasons might be. Non-Westerners are not, by definition, part of Western civilization, they have their own civilizations, customs, and traditions which they quite naturally prefer, and to quote a VP reader quoting Horace,\nthey change their sky, not their souls, who cross the sea.\nIn other words, they don’t bring chaos, they merely bring civilizational changes which often result in chaos. Exactly as European whites did to American Indian civilization. But the fact that the invasion and subsequent changes may be well-merited from a karmic perspective doesn’t actually make it desirable for anyone who values America and the West.\nAsk him if he still believes N.K. Jemisin is a half savage, and those of her ethnic heritage shouldn’t write sci-fi.\nYes, I still believe NK Jemisin is “an educated, but ignorant half-savage, with little more understanding of what it took to build a new literature by ‘a bunch of beardy old middle-class middle-American guys’ than an illiterate Igbotu tribesman has of how to build a jet engine.” Those of her ethnic heritage are certainly welcome to write science fiction if they please, but Jemisin observably shouldn’t. Her two successive Hugo Awards for Best Novel are a more embarrassing indictment of the degraded state of so-called science fiction than the nominations of “Alien Stripper Boned From Behind By The T-Rex” and “Space Raptor Butt Invasion”\ncombined.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-12T00:48:00+00:00"
}