{
  "url": "https://voxday.net/2018/01/29/forget-moderation-stand-up-and-fight/",
  "scraped_at": "2025-12-19T10:41:07.681230",
  "title": "Forget moderation, stand up and fight!",
  "date_display": "January 29, 2018",
  "date_iso": "2018-01-29T23:09:00+00:00",
  "date_from_url": "2018-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not going to pretend that this new SJW-swarming is unexpected… or that it isn’t mildly amusing, especially in light of <a href=\"http://voxday.blogspot.com/2018/01/a-virtuous-irrelevance.html\">how soon after our initial exchange</a> it happened. But that doesn’t make it right, or anything that we will ignore. The thing is, you can either learn from someone else’s example or through your own experience. Ethan van Sciver, the talented DC artist whom you may recall lecturing me about the importance of being nice and civil and respectful to SJWs, is presently learning the lessons of Social Justice the hard way. Moderation won’t save you. Civility won’t save you. Nothing will save you except standing up to them and fighting them openly, because they are all offense, no defense.</p><p>Because they don’t need your permission to attack you, and if they can’t find an excuse to do so, they will manufacture one.</p><blockquote><p>Asher Elbein @asher_elbein<br>I’ve been watching the Ethan Van Sciver harassment of @darrylayo over the weekend, and hearing stuff about him for a lot longer. I’d like to write about it for The Atlantic, so I’m putting out a call: if you’ve been harassed by him or his trolls, DMs and email are open.</br></p><p>Brendan H. Wright@BrendanWasright<br>Comics is worse for having Ethan Van Sciver in it. The fact that one of the major publishers’ major artists faces no consequences for sustained racist attacks on a fellow artist says about all one needs to know about DC. He has no place among decent people.</br></p><p>Tim Doyle@NakatomiTim<br>Ethan Van Sciver is tweeting artistic collaboration with deeply transphobic, woman hating, Milo-loving, darling of the Alt-Right-Jordan Peterson…In case you needed more evidence EVS is a disgusting trash fire of a human.</br></p><p>Kieran Shiach@KingImpulse<br>If you’ve been harassed by Ethan Van Sciver, Richard C. Meyer or their army of trolls and would like to talk about it, you can get in touch with either myself or @asher_elbein, in confidence, to tell your story.</br></p><p>davidbathsheba‏@hermanos<br>Ethan Van Sciver is what happens when an industry prizes professionalism over checking bad actors on sight.</br></p><p>darrylayo@darrylayo<br>All Ethan Van Sciver does is fuck with people, pick on people, attack people, direct others to attack people and occasionally draw I dunno, green lantern or some shit</br></p><p>Matt Santori@FotoCub<br>Yes. @DCComics needs to decide if putting Ethan Van Sciver on books is worth losing sales and promotion from sites that will refuse to review/advertise ANYTHING his name is on, as mine informed them directly.</br></p><p>Mark O. Stack@MarkOStack<br>I haven’t said anything because I didn’t know what I could add to the situation, but I really just added towards a culture of silence that lets bad people get away with things. Ethan Van Sciver is a bigot and a bully leading harassment campaigns. @DCComics should cut ties.</br></p><p>Layman@themightylayman<br>Is it my feed, or my imagination, or is the comics community growing weary of Ethan Van Sciver’s asshole antics and his fuckhead cadre of alt-right bullies?</br></p></blockquote><p>This is a textbook swarming complete with the open appeals to the presumably amenable authorities at SJW-converged DC Comics. We’ll see if they’re successful or not; it doesn’t look like they are making much headway with either the media or the masses, but then, the obvious goal here is merely provide cover for their fellow SJWs at DC to pull the trigger. There is only one way to answer these people, and that is to fight back at every opportunity, show neither hesitation nor remorse, and defeat them resoundingly. Which is exactly what we have done and what we will continue to do. Speaking of SJW-swarms, thanks VERY much to all the 802 backers and counting, as we have just hit the fifth and final goal for <a href=\"https://freestartr.com/project/will-caligans-comic/\">Will Caligan’s Comic</a>!</p><p>UPDATE: The campaign has ended. All goals achieved. A clean green sweep. Now THAT is what winning looks like! The first stage, anyway. The next win will be when the first Arkhaven comic illustrated by Will Caligan hits the market. And it will be glorious. Thanks very much to all 822 of you who made this happen!</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://freestartr.com/project/will-caligans-comic/\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"363\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DUvRRpYWAAA5m0i.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"363\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DUvRRpYWAAA5m0i.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20363%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "I’m not going to pretend that this new SJW-swarming is unexpected… or that it isn’t mildly amusing, especially in light of\nhow soon after our initial exchange\nit happened. But that doesn’t make it right, or anything that we will ignore. The thing is, you can either learn from someone else’s example or through your own experience. Ethan van Sciver, the talented DC artist whom you may recall lecturing me about the importance of being nice and civil and respectful to SJWs, is presently learning the lessons of Social Justice the hard way. Moderation won’t save you. Civility won’t save you. Nothing will save you except standing up to them and fighting them openly, because they are all offense, no defense.\nBecause they don’t need your permission to attack you, and if they can’t find an excuse to do so, they will manufacture one.\nAsher Elbein @asher_elbein\nI’ve been watching the Ethan Van Sciver harassment of @darrylayo over the weekend, and hearing stuff about him for a lot longer. I’d like to write about it for The Atlantic, so I’m putting out a call: if you’ve been harassed by him or his trolls, DMs and email are open.\nBrendan H. Wright@BrendanWasright\nComics is worse for having Ethan Van Sciver in it. The fact that one of the major publishers’ major artists faces no consequences for sustained racist attacks on a fellow artist says about all one needs to know about DC. He has no place among decent people.\nTim Doyle@NakatomiTim\nEthan Van Sciver is tweeting artistic collaboration with deeply transphobic, woman hating, Milo-loving, darling of the Alt-Right-Jordan Peterson…In case you needed more evidence EVS is a disgusting trash fire of a human.\nKieran Shiach@KingImpulse\nIf you’ve been harassed by Ethan Van Sciver, Richard C. Meyer or their army of trolls and would like to talk about it, you can get in touch with either myself or @asher_elbein, in confidence, to tell your story.\ndavidbathsheba‏@hermanos\nEthan Van Sciver is what happens when an industry prizes professionalism over checking bad actors on sight.\ndarrylayo@darrylayo\nAll Ethan Van Sciver does is fuck with people, pick on people, attack people, direct others to attack people and occasionally draw I dunno, green lantern or some shit\nMatt Santori@FotoCub\nYes. @DCComics needs to decide if putting Ethan Van Sciver on books is worth losing sales and promotion from sites that will refuse to review/advertise ANYTHING his name is on, as mine informed them directly.\nMark O. Stack@MarkOStack\nI haven’t said anything because I didn’t know what I could add to the situation, but I really just added towards a culture of silence that lets bad people get away with things. Ethan Van Sciver is a bigot and a bully leading harassment campaigns. @DCComics should cut ties.\nLayman@themightylayman\nIs it my feed, or my imagination, or is the comics community growing weary of Ethan Van Sciver’s asshole antics and his fuckhead cadre of alt-right bullies?\nThis is a textbook swarming complete with the open appeals to the presumably amenable authorities at SJW-converged DC Comics. We’ll see if they’re successful or not; it doesn’t look like they are making much headway with either the media or the masses, but then, the obvious goal here is merely provide cover for their fellow SJWs at DC to pull the trigger. There is only one way to answer these people, and that is to fight back at every opportunity, show neither hesitation nor remorse, and defeat them resoundingly. Which is exactly what we have done and what we will continue to do. Speaking of SJW-swarms, thanks VERY much to all the 802 backers and counting, as we have just hit the fifth and final goal for\nWill Caligan’s Comic\n!\nUPDATE: The campaign has ended. All goals achieved. A clean green sweep. Now THAT is what winning looks like! The first stage, anyway. The next win will be when the first Arkhaven comic illustrated by Will Caligan hits the market. And it will be glorious. Thanks very much to all 822 of you who made this happen!",
  "tags": [
    "Arkhaven",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-29T23:09:00+00:00"
}