{
  "url": "https://voxday.net/2018/01/27/googlegate-begins/",
  "scraped_at": "2025-12-19T10:40:49.747427",
  "title": "GoogleGate begins",
  "date_display": "January 27, 2018",
  "date_iso": "2018-01-27T17:19:00+00:00",
  "date_from_url": "2018-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Deny, Attack, and Reverse Victim and Offender. This is the tactic that Google’s SJWs are relying upon as they try to enlist the mainstream media on their behalf, as demonstrated by this article, <i><a href=\"https://www.wired.com/story/the-dirty-war-over-diversity-inside-google/\">The Dirty War Over Diversity Inside Google</a></i>, published in <i>Wired</i>. But it won’t work for them any better than it did for the game journos attacking GamerGate, because their narrative is a false one and the increased scrutiny will only further reveal as much.</p><blockquote><p>In interviews with WIRED, 15 current Google employees accuse coworkers of inciting outsiders to harass rank-and-file employees who are minority advocates, including queer and transgender employees. Since August, screenshots from Google’s internal discussion forums, including personal information, have been displayed on sites including Breitbart and Vox Popoli, a blog run by alt-right author Theodore Beale, who goes by the name Vox Day. Other screenshots were included in a 161-page lawsuit that Damore filed in January, alleging that Google discriminates against whites, males, and conservatives.</p><p>What followed, the employees say, was a wave of harassment. On forums like 4chan, members linked advocates’ names with their social-media accounts. At least three employees had their phone numbers, addresses, and deadnames (a transgender person’s name prior to transitioning) exposed. Google site reliability engineer Liz Fong-Jones, a trans woman, says she was the target of harassment, including violent threats and degrading slurs based on gender identity, race, and sexual orientation. More than a dozen pages of personal information about another employee were posted to Kiwi Farms, which New York has called “the web’s biggest community of stalkers.”</p><p>Meanwhile, inside Google, the diversity advocates say some employees have “weaponized human resources” by goading them into inflammatory statements, which are then captured and reported to HR for violating Google’s mores around civility or for offending white men.</p><p>Engineer Colin McMillen says the tactics have unnerved diversity advocates and chilled internal discussion. “Now it’s like basically anything you say about yourself may end up getting leaked to score political points in a lawsuit,” he says. “I have to be very careful about choosing my words because of the low-grade threat of doxing. But let’s face it, I’m not visibly queer or trans or non-white and a lot of these people are keying off their own white supremacy.”</p></blockquote><p>I am shocked – <i>absolutely shocked</i> – that they deadnamed me <i>in this very article!</i> I am literally shaking. Speaking of this infamous anti-SJW guide, it’s interesting to see that the Google-SJWs are playing their hand almost exactly as it is described in <b><i><a href=\"http://amzn.to/1sBYA10\">SJWs Always Lie</a></i></b>. Emphasis added.</p><blockquote><p><b>STAGE THREE: Isolate and Swarm</b></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://amzn.to/1sBYA10\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"900\" data-original-width=\"562\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://1.bp.blogspot.com/-IiKxgfF8Y1k/VdDjQRi9GGI/AAAAAAAABa4/kUp-_8CQF3MVVgFJT6gAyVU8HGawYSneACPcBGAYYCw/s320/SJW_900.jpg\" width=\"199\"/></a></div><p>Immediately following on the heels of the Stage Two pointing and shrieking is the third stage. This stage involves two parts, the first of which focuses on the isolation and marginalization of the target, while the second involves overwhelming the target with social pressure brought on by other SJWs and any moderate parties who can be persuaded, or bullied, into joining the witch hunt.</p><p>The primary objective of both the isolating and the swarming is to demoralize the target by separating him from anyone who is likely to give him emotional support, and to elicit an apology for his actions. Typically the SJW will have a number of close allies who will immediately leap to the attack on command, and then turn around and cite those allies as evidence that the outrage is widespread and significant in an attempt to turn the “reaction” to the target’s offense into a story that will garner media attention. <b>This is particularly effective if the SJW and his allies have connections in various media organizations, which allows them to rapidly transform a minor event into something that is perceived by the public as a major one. The purpose of the media campaign is two-fold: to stamp the Narrative with an “objective” perspective that echoes the SJW’s accusations and to let other potential allies know about the hate campaign in the hopes that they will add their weight to the hogpile.</b></p><p>All of the language used to describe the target will be chosen to marginalize him and render him as unsympathetic a figure as possible. These days, it is almost de rigeur to refer to any SJW target as racist, sexist, and homophobic in addition to any specific qualities that may be relevant to the matter at hand; some adventurous SJWs are already adding “transphobic” to the standard list. In fact, this set of accusations is so common now that if you merely type “racist se” into Google, Google will offer to autocomplete the phrase as “racist, sexist, homophobic”.</p></blockquote><p>Notice how well this describes the Google-SJW campaign against me, as the Wired article was timed to appear on the same day as <a href=\"https://archive.fo/2tBrv\">this article published in USA Today</a>. Of course, what they don’t realize is that the Supreme Dark Lord of the Evil Legion of Evil <i>cannot be isolated</i>. Other SJWs and other media outlets have tried, and failed, before. And if there is any swarming to be done, the Vile Faceless Minions will do it before they devour the hapless enemy alive. We’ve not only been here before, <i>we’ve been here before and won</i> on more than one occasion.</p><blockquote><p>Several Google employees told USA TODAY that Damore’s firing marked an escalation in the harassment campaign, with the small group of instigators stepping up efforts to target diversity advocates inside the company. Among the tactics: camouflaging harassment as free speech and goading diversity advocates with seemingly innocuous questions into making inflammatory statements that were then reported to human resources as violations of Google’s rules.</p><p>By far the most chilling behavior is the public harassment incited by coworkers, says Fong-Jones.</p><p>According to Wired, at least three Google employees had their phone numbers and addresses posted publicly. Far-right provocateur Milo Yiannopoulos shared an image of the Twitter profiles of eight advocates at Google, many of them transgender employees, with his 2.5 million Facebook followers.</p><p>Fong-Jones had her name and face plastered on a website run by far-right blogger Theodore Beale, also known as Vox Day. Beale published excerpts of a conversation between Fong-Jones and a colleague, where Fong-Jones argued that Damore should not have been allowed to publish his memo on an internal Google channel.</p><p>“Google’s SJWs (social-justice warriors) are starting to get nervous as evidence of their internal thought-policing begins to leak out into the public,” Beale wrote.</p><p>Fong-Jones was targeted by violent threats and transphobic slurs. Commented one person on Vox Popoli, which promotes white nationalism and identifies itself as part of the “alt-right:” “They should pitch all those sexual freaks off of rooftops.”</p><p>The attacks have had a chilling effect.</p><p>“In recent months there has been a pattern of taking diversity advocates and doxing them by putting them on blast to the ‘alt-right’ communities,” Yusuf said. “Now they have to be careful. ‘How much of myself do I want to put out there?’ Which is ironic because one of the big mantras of the company is being able to ‘bring your whole self to work.’”</p></blockquote><p>Except Jessica Guynn, who is an SJW whose articles betray an obsession with diversity, didn’t do her homework and inadvertently stepped in it. USA Today had better issue a correction, because Vox Popoli does not promote white nationalism. Quite the contrary, as it happens. I have sent the following email requesting a retraction and correction to the author, Jessica Guynn, who can be reached at jguynn@usatoday.com, and to the corrections editor at accuracy@usatoday.com.</p><blockquote><p>Dear Ms Guynn,</p><p>I am requesting a correction of your article entitled “Google employees say the company’s not doing enough to protect them from harassment, threats.”</p><p>Your claim that <b>“Vox Popoli, which promotes white nationalism”</b> is false, libelous, and Fake News. Even a cursory search of the blog would have shown you that I a) am an American Indian, b) am not a white nationalist, and, c) do not promote white nationalism on Vox Popoli. To the contrary, I assert that white nationalism is an incoherent and ridiculous American concept that is as hopeless as the pan-Arabism and pan-Africanism of the 1960s.</p><p>Please correct the article at your earliest opportunity.</p><p>Thank you,</p><p>Vox Day </p></blockquote><p>And when you’re commenting, notice that it is again the comments that are being used as the locus for the  SJW attacks on me. They’ve been doing this since 2013; the SFWA did precisely the same thing in its 130-page report. So, be disciplined and be aware that SJWs will quote-mine <i>you </i>in order to attempt to discredit and disqualify <i>me</i>. If you must bravely posture and preen as a hard-talking fellow, this is not the right place to do it. Yes, I am aware there will be SJWs false-flagging in this regard. That’s nothing new. They’ve been trying to do so for years.</p><p>But this is all good news. We all know what this sort of flak indicates. And why they’re so fearful.</p><blockquote class=\"tr_bq\"><p>As the internal debate raged in the wake of Damore’s memo, McMillen says that he knows of at least 10 coworkers who were called into HR for making political statements related to the document, with consequences ranging from verbal warnings to a reduced performance-review score. McMillen was told by HR not to do anything hiring or promotion related for a year. Altman got a verbal warning for writing on an internal board that certain employees should be fired. “I meant only bigoted white men should be fired. They interpreted it as applying to all white men,” Altman says. </p></blockquote><p>That wasn’t the funniest aspect of the Wired article, though. That would be this, which appeared at the end of an article attempting to paint me as a villain for publishing information provided to me by whistleblowers.</p><blockquote class=\"tr_bq\"><p>Want to share information with WIRED securely? Get in touch with us through SecureDrop. </p></blockquote></div>",
  "content_text": "Deny, Attack, and Reverse Victim and Offender. This is the tactic that Google’s SJWs are relying upon as they try to enlist the mainstream media on their behalf, as demonstrated by this article,\nThe Dirty War Over Diversity Inside Google\n, published in\nWired\n. But it won’t work for them any better than it did for the game journos attacking GamerGate, because their narrative is a false one and the increased scrutiny will only further reveal as much.\nIn interviews with WIRED, 15 current Google employees accuse coworkers of inciting outsiders to harass rank-and-file employees who are minority advocates, including queer and transgender employees. Since August, screenshots from Google’s internal discussion forums, including personal information, have been displayed on sites including Breitbart and Vox Popoli, a blog run by alt-right author Theodore Beale, who goes by the name Vox Day. Other screenshots were included in a 161-page lawsuit that Damore filed in January, alleging that Google discriminates against whites, males, and conservatives.\nWhat followed, the employees say, was a wave of harassment. On forums like 4chan, members linked advocates’ names with their social-media accounts. At least three employees had their phone numbers, addresses, and deadnames (a transgender person’s name prior to transitioning) exposed. Google site reliability engineer Liz Fong-Jones, a trans woman, says she was the target of harassment, including violent threats and degrading slurs based on gender identity, race, and sexual orientation. More than a dozen pages of personal information about another employee were posted to Kiwi Farms, which New York has called “the web’s biggest community of stalkers.”\nMeanwhile, inside Google, the diversity advocates say some employees have “weaponized human resources” by goading them into inflammatory statements, which are then captured and reported to HR for violating Google’s mores around civility or for offending white men.\nEngineer Colin McMillen says the tactics have unnerved diversity advocates and chilled internal discussion. “Now it’s like basically anything you say about yourself may end up getting leaked to score political points in a lawsuit,” he says. “I have to be very careful about choosing my words because of the low-grade threat of doxing. But let’s face it, I’m not visibly queer or trans or non-white and a lot of these people are keying off their own white supremacy.”\nI am shocked –\nabsolutely shocked\n– that they deadnamed me\nin this very article!\nI am literally shaking. Speaking of this infamous anti-SJW guide, it’s interesting to see that the Google-SJWs are playing their hand almost exactly as it is described in\nSJWs Always Lie\n. Emphasis added.\nSTAGE THREE: Isolate and Swarm\nImmediately following on the heels of the Stage Two pointing and shrieking is the third stage. This stage involves two parts, the first of which focuses on the isolation and marginalization of the target, while the second involves overwhelming the target with social pressure brought on by other SJWs and any moderate parties who can be persuaded, or bullied, into joining the witch hunt.\nThe primary objective of both the isolating and the swarming is to demoralize the target by separating him from anyone who is likely to give him emotional support, and to elicit an apology for his actions. Typically the SJW will have a number of close allies who will immediately leap to the attack on command, and then turn around and cite those allies as evidence that the outrage is widespread and significant in an attempt to turn the “reaction” to the target’s offense into a story that will garner media attention.\nThis is particularly effective if the SJW and his allies have connections in various media organizations, which allows them to rapidly transform a minor event into something that is perceived by the public as a major one. The purpose of the media campaign is two-fold: to stamp the Narrative with an “objective” perspective that echoes the SJW’s accusations and to let other potential allies know about the hate campaign in the hopes that they will add their weight to the hogpile.\nAll of the language used to describe the target will be chosen to marginalize him and render him as unsympathetic a figure as possible. These days, it is almost de rigeur to refer to any SJW target as racist, sexist, and homophobic in addition to any specific qualities that may be relevant to the matter at hand; some adventurous SJWs are already adding “transphobic” to the standard list. In fact, this set of accusations is so common now that if you merely type “racist se” into Google, Google will offer to autocomplete the phrase as “racist, sexist, homophobic”.\nNotice how well this describes the Google-SJW campaign against me, as the Wired article was timed to appear on the same day as\nthis article published in USA Today\n. Of course, what they don’t realize is that the Supreme Dark Lord of the Evil Legion of Evil\ncannot be isolated\n. Other SJWs and other media outlets have tried, and failed, before. And if there is any swarming to be done, the Vile Faceless Minions will do it before they devour the hapless enemy alive. We’ve not only been here before,\nwe’ve been here before and won\non more than one occasion.\nSeveral Google employees told USA TODAY that Damore’s firing marked an escalation in the harassment campaign, with the small group of instigators stepping up efforts to target diversity advocates inside the company. Among the tactics: camouflaging harassment as free speech and goading diversity advocates with seemingly innocuous questions into making inflammatory statements that were then reported to human resources as violations of Google’s rules.\nBy far the most chilling behavior is the public harassment incited by coworkers, says Fong-Jones.\nAccording to Wired, at least three Google employees had their phone numbers and addresses posted publicly. Far-right provocateur Milo Yiannopoulos shared an image of the Twitter profiles of eight advocates at Google, many of them transgender employees, with his 2.5 million Facebook followers.\nFong-Jones had her name and face plastered on a website run by far-right blogger Theodore Beale, also known as Vox Day. Beale published excerpts of a conversation between Fong-Jones and a colleague, where Fong-Jones argued that Damore should not have been allowed to publish his memo on an internal Google channel.\n“Google’s SJWs (social-justice warriors) are starting to get nervous as evidence of their internal thought-policing begins to leak out into the public,” Beale wrote.\nFong-Jones was targeted by violent threats and transphobic slurs. Commented one person on Vox Popoli, which promotes white nationalism and identifies itself as part of the “alt-right:” “They should pitch all those sexual freaks off of rooftops.”\nThe attacks have had a chilling effect.\n“In recent months there has been a pattern of taking diversity advocates and doxing them by putting them on blast to the ‘alt-right’ communities,” Yusuf said. “Now they have to be careful. ‘How much of myself do I want to put out there?’ Which is ironic because one of the big mantras of the company is being able to ‘bring your whole self to work.’”\nExcept Jessica Guynn, who is an SJW whose articles betray an obsession with diversity, didn’t do her homework and inadvertently stepped in it. USA Today had better issue a correction, because Vox Popoli does not promote white nationalism. Quite the contrary, as it happens. I have sent the following email requesting a retraction and correction to the author, Jessica Guynn, who can be reached at jguynn@usatoday.com, and to the corrections editor at accuracy@usatoday.com.\nDear Ms Guynn,\nI am requesting a correction of your article entitled “Google employees say the company’s not doing enough to protect them from harassment, threats.”\nYour claim that\n“Vox Popoli, which promotes white nationalism”\nis false, libelous, and Fake News. Even a cursory search of the blog would have shown you that I a) am an American Indian, b) am not a white nationalist, and, c) do not promote white nationalism on Vox Popoli. To the contrary, I assert that white nationalism is an incoherent and ridiculous American concept that is as hopeless as the pan-Arabism and pan-Africanism of the 1960s.\nPlease correct the article at your earliest opportunity.\nThank you,\nVox Day\nAnd when you’re commenting, notice that it is again the comments that are being used as the locus for the  SJW attacks on me. They’ve been doing this since 2013; the SFWA did precisely the same thing in its 130-page report. So, be disciplined and be aware that SJWs will quote-mine\nyou\nin order to attempt to discredit and disqualify\nme\n. If you must bravely posture and preen as a hard-talking fellow, this is not the right place to do it. Yes, I am aware there will be SJWs false-flagging in this regard. That’s nothing new. They’ve been trying to do so for years.\nBut this is all good news. We all know what this sort of flak indicates. And why they’re so fearful.\nAs the internal debate raged in the wake of Damore’s memo, McMillen says that he knows of at least 10 coworkers who were called into HR for making political statements related to the document, with consequences ranging from verbal warnings to a reduced performance-review score. McMillen was told by HR not to do anything hiring or promotion related for a year. Altman got a verbal warning for writing on an internal board that certain employees should be fired. “I meant only bigoted white men should be fired. They interpreted it as applying to all white men,” Altman says.\nThat wasn’t the funniest aspect of the Wired article, though. That would be this, which appeared at the end of an article attempting to paint me as a villain for publishing information provided to me by whistleblowers.\nWant to share information with WIRED securely? Get in touch with us through SecureDrop.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-27T17:19:00+00:00"
}