{
  "url": "https://voxday.net/2018/01/20/how-to-be-in-charge/",
  "scraped_at": "2025-12-19T10:39:51.495141",
  "title": "How to be in charge",
  "date_display": "January 20, 2018",
  "date_iso": "2018-01-20T13:00:00+00:00",
  "date_from_url": "2018-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Without actually being in charge. Google’s <a href=\"https://www.theverge.com/2018/1/19/16911482/james-damore-google-ceo-sundar-pichai-women-in-tech-memo-firing\">Sundar Pichai demonstrates</a> what it means for a CEO to serve at the will and pleasure of the SJWs nominally under his authority:</p><blockquote><p>Google CEO Sundar Pichai responded today to the firing of employee James Damore over his controversial memo on workplace diversity, stating that while he does not regret the decision, he regrets that people misunderstood it as a politically motivated event. Speaking in a live conversation with journalist and Recode co-founder Kara Swisher, MSNBC host Ari Melber, and YouTube CEO Susan Wojcicki in San Francisco, Pichai said that the decision to fire Damore was about ensuring women at Google felt like the company was committed to creating a welcoming environment.</p><p>“I regret that people misunderstand that we may have made this for a political belief one way or another,” Pichai said. “It’s important for the women at Google, and all the people at Google, that we want to make an inclusive environment.” When pressed by Swisher on the issue of regret, Pichai stated more definitively, “I don’t regret it.” Wojcicki, who has spoken publicly about how Damore’s memo affected her personally, followed up with, “I think it was the right decision.”</p></blockquote><p>It’s not political, it’s just about women’s feelings. Apparently this walking, talking corporate debacle has never heard of either a) feminism or b) the feminist mantra “the personal is the political”.</p><p><a href=\"https://memestatic.fjcdn.com/pictures/Logistically+feminist_208d2f_6464363.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"528\" data-original-width=\"800\" decoding=\"async\" fetchpriority=\"high\" height=\"211\" src=\"https://memestatic.fjcdn.com/pictures/Logistically+feminist_208d2f_6464363.jpg\" width=\"320\"/></a>I had an interesting conversation with Nitasha Tiku, a senior writer at <i>Wired</i>, last night. She’s working on a story about how the poor, powerless executives and managers at Google feel frightened, intimidated, and harassed because James Damore, Charles Johnson, and others have exposed how they harass, intimidate, and blacklist their coworkers, how they hate everyone who voted for Donald Trump, and how they can get away with openly threatening their colleagues with violence and unemployment without suffering any consequences for their behavior.</p><p>Poor, poor Googlers. Why can’t they harass their victims with impunity in secret?</p><p>As I pointed out to Ms Tiku, I and a number of other outsiders have known about what has been taking place behind the scenes at Google for years. I even wrote about it after the election, <a href=\"http://voxday.blogspot.com/2016/12/the-war-for-google.html\">nine months before</a> the Damore memo was leaked to the public by SJWs.</p><p><i>Internal pressure is pushing for the expansion of hate speech to include everything and everyone that fails to submit to the SJW narrative, for more intense action against so-called “fake news”, and even broader definitions of “fake news”. So far, they are only cracking down on genuinely fake news, but there is some belief that this is the proverbial dipping the toe in the water, to see what they can do without provoking a backlash.</i><br><i><br/></i><i>The victory of the God-Emperor Ascendant was a massive blow to the SJWs inside Google, and like most SJWs, they have completely lost the plot post-election. They were openly calling other Googlers racists, sexists, and homophobes just for voting for Trump. Those are firing offenses at Google. Google has insane civility requirements imposed on anyone talking to a member of a protected group, but apparently calling for all Republicans to be fired is perfectly acceptable.</i></br></p><p>Everyone ignored this. Then James Damore and I provided incontrovertible proof that Googlers were, in fact, behaving every bit as badly as I had said they were. So now, having been accused, exposed, and caught red-handed, they’re trying to spin <i>documented proof of their own misbehavior</i> as some sort of harassment, and they are attempting to enlist the media as their ad hoc defense attorneys in order to change the subject.</p></div>",
  "content_text": "Without actually being in charge. Google’s\nSundar Pichai demonstrates\nwhat it means for a CEO to serve at the will and pleasure of the SJWs nominally under his authority:\nGoogle CEO Sundar Pichai responded today to the firing of employee James Damore over his controversial memo on workplace diversity, stating that while he does not regret the decision, he regrets that people misunderstood it as a politically motivated event. Speaking in a live conversation with journalist and Recode co-founder Kara Swisher, MSNBC host Ari Melber, and YouTube CEO Susan Wojcicki in San Francisco, Pichai said that the decision to fire Damore was about ensuring women at Google felt like the company was committed to creating a welcoming environment.\n“I regret that people misunderstand that we may have made this for a political belief one way or another,” Pichai said. “It’s important for the women at Google, and all the people at Google, that we want to make an inclusive environment.” When pressed by Swisher on the issue of regret, Pichai stated more definitively, “I don’t regret it.” Wojcicki, who has spoken publicly about how Damore’s memo affected her personally, followed up with, “I think it was the right decision.”\nIt’s not political, it’s just about women’s feelings. Apparently this walking, talking corporate debacle has never heard of either a) feminism or b) the feminist mantra “the personal is the political”.\nI had an interesting conversation with Nitasha Tiku, a senior writer at\nWired\n, last night. She’s working on a story about how the poor, powerless executives and managers at Google feel frightened, intimidated, and harassed because James Damore, Charles Johnson, and others have exposed how they harass, intimidate, and blacklist their coworkers, how they hate everyone who voted for Donald Trump, and how they can get away with openly threatening their colleagues with violence and unemployment without suffering any consequences for their behavior.\nPoor, poor Googlers. Why can’t they harass their victims with impunity in secret?\nAs I pointed out to Ms Tiku, I and a number of other outsiders have known about what has been taking place behind the scenes at Google for years. I even wrote about it after the election,\nnine months before\nthe Damore memo was leaked to the public by SJWs.\nInternal pressure is pushing for the expansion of hate speech to include everything and everyone that fails to submit to the SJW narrative, for more intense action against so-called “fake news”, and even broader definitions of “fake news”. So far, they are only cracking down on genuinely fake news, but there is some belief that this is the proverbial dipping the toe in the water, to see what they can do without provoking a backlash.\nThe victory of the God-Emperor Ascendant was a massive blow to the SJWs inside Google, and like most SJWs, they have completely lost the plot post-election. They were openly calling other Googlers racists, sexists, and homophobes just for voting for Trump. Those are firing offenses at Google. Google has insane civility requirements imposed on anyone talking to a member of a protected group, but apparently calling for all Republicans to be fired is perfectly acceptable.\nEveryone ignored this. Then James Damore and I provided incontrovertible proof that Googlers were, in fact, behaving every bit as badly as I had said they were. So now, having been accused, exposed, and caught red-handed, they’re trying to spin\ndocumented proof of their own misbehavior\nas some sort of harassment, and they are attempting to enlist the media as their ad hoc defense attorneys in order to change the subject.",
  "tags": [
    "media",
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-20T13:00:00+00:00"
}