{
  "url": "https://voxday.net/2018/01/13/jack-and-the-bullshit-artist/",
  "scraped_at": "2025-12-19T10:38:54.802741",
  "title": "Jack and the bullshit artist",
  "date_display": "January 13, 2018",
  "date_iso": "2018-01-13T16:00:00+00:00",
  "date_from_url": "2018-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite having been threatened by an unlikely beating at the hands of his corpse and being more than a little dubious about his war stories, I find that I rather like the aspects of Jack Kirby that are revealed by <a href=\"http://www.tcj.com/jack-kirby-interview/\">this extensive interview</a>. I particularly liked the way he took on <i>Jimmy Olsen</i>, the worst-performing comic in the DC catalog, rather than the <i>Superman </i>comic that was offered to him, simply because he knew that doing so would be a better way of proving himself.</p><p>And frankly, it strikes me as more than a little fitting that Stan Lee will exit this Earth under a cloud of disgrace, given the fact that he appears to have pulled off one of the great con jobs of the 20th century:</p><blockquote><p>GROTH: At the risk of sounding partisan, let me ask you this: every time I read something by Stan or see Stan speak publicly, I’m struck by how obvious a bullshit artist he is. Was he always that way?</p><p>ROZ KIRBY: Yeah.</p><p>KIRBY: Yes. Yes, I knew Stan when he was a young boy.</p><p>ROZ KIRBY: He was Mr. Personality. That’s what he was.</p><p>KIRBY: If you ever get to talk with Joe Simon, Simon will tell you exactly what the hell Stan Lee was. He was just a little wise guy, and he came from a family that was upper-middle class, and he could do whatever he liked. He could say whatever he liked. I’ll be frank with you. We considered him a pain in the ass. He grew up to be exactly what we considered him.</p></blockquote><p>Let’s face it, America can’t say that Jack Kirby didn’t warn them.</p><p>“Stan Lee was a pest.” <a href=\"https://www.cbr.com/stan-lee-sexual-misconduct-accusation-c2e2/\">You don’t say</a>.</p></div>",
  "content_text": "Despite having been threatened by an unlikely beating at the hands of his corpse and being more than a little dubious about his war stories, I find that I rather like the aspects of Jack Kirby that are revealed by\nthis extensive interview\n. I particularly liked the way he took on\nJimmy Olsen\n, the worst-performing comic in the DC catalog, rather than the\nSuperman\ncomic that was offered to him, simply because he knew that doing so would be a better way of proving himself.\nAnd frankly, it strikes me as more than a little fitting that Stan Lee will exit this Earth under a cloud of disgrace, given the fact that he appears to have pulled off one of the great con jobs of the 20th century:\nGROTH: At the risk of sounding partisan, let me ask you this: every time I read something by Stan or see Stan speak publicly, I’m struck by how obvious a bullshit artist he is. Was he always that way?\nROZ KIRBY: Yeah.\nKIRBY: Yes. Yes, I knew Stan when he was a young boy.\nROZ KIRBY: He was Mr. Personality. That’s what he was.\nKIRBY: If you ever get to talk with Joe Simon, Simon will tell you exactly what the hell Stan Lee was. He was just a little wise guy, and he came from a family that was upper-middle class, and he could do whatever he liked. He could say whatever he liked. I’ll be frank with you. We considered him a pain in the ass. He grew up to be exactly what we considered him.\nLet’s face it, America can’t say that Jack Kirby didn’t warn them.\n“Stan Lee was a pest.”\nYou don’t say\n.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-13T16:00:00+00:00"
}