{
  "url": "https://voxday.net/2018/01/28/mailvox-lessons-in-gamma-extended-edition/",
  "scraped_at": "2025-12-19T10:40:57.124580",
  "title": "Mailvox: Lessons in Gamma, extended edition",
  "date_display": "January 28, 2018",
  "date_iso": "2018-01-28T16:00:00+00:00",
  "date_from_url": "2018-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Back in October 2016, a website designer named <a href=\"https://archive.fo/CcOPM\">Allen Ayler</a> deigned to offer his assistance to Infogalactic. I turned him down because I did not like the way he approached me. After he angrily demanded on Gab that I make our email discussions a matter for public discussion, <a href=\"http://voxday.blogspot.com/2016/10/a-lesson-in-gamma.html\">I did so</a>. This was how it ended, or so I thought.</p><blockquote><p>Guys, I admitted already that my initial “dignify me wit a response” was too pushy, however it wasn’t an insult like his response was when he proceeded to throw at me by insinuating I am a “diva big dog.” I took offense to that, and proceeded to unload and make myself look ridiculous. I apologize for my unprofessionalism. I was not necessarily approaching this like I typically do, since in my mind I wasn’t “applying” for a job. Regardless, I should have kept my demeanor and offense in check.</p><p>That being said, I will retain that I have zero interest in working with anyone who says,  “If you can’t deal with the fact that the big dogs on this project are insanely busy, you won’t fit in. There simply isn’t space for divas and egos on the team” to people trying to help. It’s a completely asinine and hypocritical response, and was uncalled for. I am honest enough to admit my fault, yet all I hear is unaccountability and yet more insults from Vox. I can tell you, if you didn’t insinuate I was a diva ego we would be square and I would never have popped off. I would have apologized for my pushy request for a response after getting ignored and dicked around for two weeks.</p><p>But let me dissect this a bit, you say an alpha just doesn’t respond to gammas, and gammas just use baseless insults and never stop messaging looking for revenge, right? How does that differ from you posting my info so you can have your biased minions seek me out and attack me? Basically you are taking the weight of the gamma work off your shoulders and having every here do it for you. Gammas use baseless insults, but nearly everyone who simply disagrees with you, you call a gamma, yet that is not a baseless insult in and of itself?</p><p>Everyone clearly sides with Vox here, yet I didn’t open up the dialogue with insults. I may have been a tad pushy after getting ignored for two weeks, but at least it was not an insult.</p><p>Another thing, in the professional field, when someone responds to you by saying, “If you can’t deal with the fact I am busy then…” Basically what it says is, “I am important than you.” And when you have people offering to give their time and services way for free, it’s pretty offensive.</p><p>So yea, you dicked me around and ignored me for two weeks, my request for a response was not an insult (but yes it was pushy), but your reply actually was insulting, and oozed of self-importance, as I have outlined. Now all my responses after your reply was totally unprofessional. I make no lies or excuses about that. And yes I do regret the way I asked for a response, but not because I want to join the team, but because we are playing on the same #MAGA team, and we really need to stick together at a time like this instead of create divide. Now, if there is any empathy and rationality in you, Vox, then you will accept my apology and hopefully at least acknowledge that your response to my pushy request for a reply was also a bit too harsh. That is all I ask for.</p><p>Also, since you proved me wrong about your website traffic, I will humbly remove my false review claim that you are being dishonest about it. I really do try to be a man of integrity, it’s too bad we got off like this. I hope this gesture can help show that.</p></blockquote><p>To which I replied on Oct 26, 2016: <i>No worries. It’s over and done with as far as I’m concerned. </i>I also publicly <a href=\"https://alphagameplan.blogspot.com/2016/10/apology-accepted.html\">accepted his apology</a> at Alpha Game.</p><p>But of course, nothing is ever over when a Gamma is involved. Hadley <a href=\"https://alphagameplan.blogspot.com/2016/10/apology-accepted.html?showComment=1477259186931#c2282486368395642952\">wins his bet</a>. Today, 15 freaking months later, I received this pair of emails in quick succession, both completely out of the blue.</p><blockquote><p>ugh… hey deluded big dog, your site looks horrid. LMFAO. And your wife is a slut cunt bitch, btw.<br>Cheers,<br><a href=\"https://www.facebook.com/allen.ayler\">Allen Ayler</a></br></br></p><p>How mentally and emotionally stunted to you have to be to make it part of your life’s missions to paint yourself as an “alpha”? LOL still hilarious to this day.<br>Cheers again,<br>your #1 gamma, fucking dork child.</br></br></p></blockquote><p>How very professional. The underlying reason here is that Gammas <i>never</i> forget a crime against them, and by crime, they mean <i>anything </i>that causes them to feel humiliation. And once humiliated, they never stop looking to seek revenge for it and take the shot that will restore the balance of the universe. Needless to say, I feel entirely justified about my decision to keep this gentleman well the hell away from Infogalactic and every other project in which I have any involvement whatsoever. This is why an understanding of human socio-sexuality is so important. You simply cannot permit Gammas in <i>any </i>position of importance and it is vital for every project leader to avoid relying upon them for any critical matter.</p><p>The problem is that while Gammas are often very knowledgeable and detail-oriented subject matter experts, they are socially fragile, emotionally volatile, and can seldom bear to take any criticism or endure any reaction to their advice or assistance other than enthusiastic acceptance. To make matters worse, they are often ambitious and pursue responsibility, only to shirk it once they have it and try to avoid making decisions or actually doing anything due to their crippling fear of failure. Think about John Scalzi and his successful decade-long pursuit of a big book contract, which was promptly followed by his inability to deliver books on the contract’s schedule. That is a textbook example of Gamma success gone awry; if events proceed according to form, Scalzi will probably blow up the publishing arrangement in some way long before delivering the final book.</p><p>Gamma is not an insult per se. It is a clearly defined, demonstrably observable male behavioral pattern. The relevant fact of the matter here is that this pattern of behavior is familiar and predictable, because that is simply how gammas tend to react in certain specific situations. And the reason that gammas get called out so often for it here is because non-gammas don’t behave this way and therefore don’t require being addressed in a similar manner.</p><p>Every gamma would do well to recall four things:</p><ul><li>You don’t get any say in how other people treat you. You can only control how you respond to it. People will judge YOU by that response, not the people to whom you are responding.</li><li>When angry or upset, keep your mouth shut until you cool down.</li><li>When you screw up, stop digging. Just stop.</li><li>Everyone knows you aren’t laughing no matter how vehemently you insist you are.</li></ul><div>And if you ever wondered why I neither like nor tolerate Gammas, this should suffice to explain why. They simply cause more trouble than anyone can possibly be worth.</div></div>",
  "content_text": "Back in October 2016, a website designer named\nAllen Ayler\ndeigned to offer his assistance to Infogalactic. I turned him down because I did not like the way he approached me. After he angrily demanded on Gab that I make our email discussions a matter for public discussion,\nI did so\n. This was how it ended, or so I thought.\nGuys, I admitted already that my initial “dignify me wit a response” was too pushy, however it wasn’t an insult like his response was when he proceeded to throw at me by insinuating I am a “diva big dog.” I took offense to that, and proceeded to unload and make myself look ridiculous. I apologize for my unprofessionalism. I was not necessarily approaching this like I typically do, since in my mind I wasn’t “applying” for a job. Regardless, I should have kept my demeanor and offense in check.\nThat being said, I will retain that I have zero interest in working with anyone who says,  “If you can’t deal with the fact that the big dogs on this project are insanely busy, you won’t fit in. There simply isn’t space for divas and egos on the team” to people trying to help. It’s a completely asinine and hypocritical response, and was uncalled for. I am honest enough to admit my fault, yet all I hear is unaccountability and yet more insults from Vox. I can tell you, if you didn’t insinuate I was a diva ego we would be square and I would never have popped off. I would have apologized for my pushy request for a response after getting ignored and dicked around for two weeks.\nBut let me dissect this a bit, you say an alpha just doesn’t respond to gammas, and gammas just use baseless insults and never stop messaging looking for revenge, right? How does that differ from you posting my info so you can have your biased minions seek me out and attack me? Basically you are taking the weight of the gamma work off your shoulders and having every here do it for you. Gammas use baseless insults, but nearly everyone who simply disagrees with you, you call a gamma, yet that is not a baseless insult in and of itself?\nEveryone clearly sides with Vox here, yet I didn’t open up the dialogue with insults. I may have been a tad pushy after getting ignored for two weeks, but at least it was not an insult.\nAnother thing, in the professional field, when someone responds to you by saying, “If you can’t deal with the fact I am busy then…” Basically what it says is, “I am important than you.” And when you have people offering to give their time and services way for free, it’s pretty offensive.\nSo yea, you dicked me around and ignored me for two weeks, my request for a response was not an insult (but yes it was pushy), but your reply actually was insulting, and oozed of self-importance, as I have outlined. Now all my responses after your reply was totally unprofessional. I make no lies or excuses about that. And yes I do regret the way I asked for a response, but not because I want to join the team, but because we are playing on the same #MAGA team, and we really need to stick together at a time like this instead of create divide. Now, if there is any empathy and rationality in you, Vox, then you will accept my apology and hopefully at least acknowledge that your response to my pushy request for a reply was also a bit too harsh. That is all I ask for.\nAlso, since you proved me wrong about your website traffic, I will humbly remove my false review claim that you are being dishonest about it. I really do try to be a man of integrity, it’s too bad we got off like this. I hope this gesture can help show that.\nTo which I replied on Oct 26, 2016:\nNo worries. It’s over and done with as far as I’m concerned.\nI also publicly\naccepted his apology\nat Alpha Game.\nBut of course, nothing is ever over when a Gamma is involved. Hadley\nwins his bet\n. Today, 15 freaking months later, I received this pair of emails in quick succession, both completely out of the blue.\nugh… hey deluded big dog, your site looks horrid. LMFAO. And your wife is a slut cunt bitch, btw.\nCheers,\nAllen Ayler\nHow mentally and emotionally stunted to you have to be to make it part of your life’s missions to paint yourself as an “alpha”? LOL still hilarious to this day.\nCheers again,\nyour #1 gamma, fucking dork child.\nHow very professional. The underlying reason here is that Gammas\nnever\nforget a crime against them, and by crime, they mean\nanything\nthat causes them to feel humiliation. And once humiliated, they never stop looking to seek revenge for it and take the shot that will restore the balance of the universe. Needless to say, I feel entirely justified about my decision to keep this gentleman well the hell away from Infogalactic and every other project in which I have any involvement whatsoever. This is why an understanding of human socio-sexuality is so important. You simply cannot permit Gammas in\nany\nposition of importance and it is vital for every project leader to avoid relying upon them for any critical matter.\nThe problem is that while Gammas are often very knowledgeable and detail-oriented subject matter experts, they are socially fragile, emotionally volatile, and can seldom bear to take any criticism or endure any reaction to their advice or assistance other than enthusiastic acceptance. To make matters worse, they are often ambitious and pursue responsibility, only to shirk it once they have it and try to avoid making decisions or actually doing anything due to their crippling fear of failure. Think about John Scalzi and his successful decade-long pursuit of a big book contract, which was promptly followed by his inability to deliver books on the contract’s schedule. That is a textbook example of Gamma success gone awry; if events proceed according to form, Scalzi will probably blow up the publishing arrangement in some way long before delivering the final book.\nGamma is not an insult per se. It is a clearly defined, demonstrably observable male behavioral pattern. The relevant fact of the matter here is that this pattern of behavior is familiar and predictable, because that is simply how gammas tend to react in certain specific situations. And the reason that gammas get called out so often for it here is because non-gammas don’t behave this way and therefore don’t require being addressed in a similar manner.\nEvery gamma would do well to recall four things:\nYou don’t get any say in how other people treat you. You can only control how you respond to it. People will judge YOU by that response, not the people to whom you are responding.\nWhen angry or upset, keep your mouth shut until you cool down.\nWhen you screw up, stop digging. Just stop.\nEveryone knows you aren’t laughing no matter how vehemently you insist you are.\nAnd if you ever wondered why I neither like nor tolerate Gammas, this should suffice to explain why. They simply cause more trouble than anyone can possibly be worth.",
  "tags": [
    "AlphaGame",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-28T16:00:00+00:00"
}