{
  "url": "https://voxday.net/2018/01/27/mailvox-they-dont-forget/",
  "scraped_at": "2025-12-19T10:40:46.793434",
  "title": "Mailvox: they don’t forget",
  "date_display": "January 27, 2018",
  "date_iso": "2018-01-27T12:11:00+00:00",
  "date_from_url": "2018-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A military wife would like the backers of the <a href=\"https://freestartr.com/project/will-caligans-comic/\">Will Caligan’s Comic</a> campaign to know that your efforts have been noticed and are deeply appreciated by the military community:</p><blockquote><p>My husband recently retired from 20 years mixed service Airborne and National Guard. His uncle is a Desert Storm vet.  My dad was in Vietnam.  Our collective family military histories go to the Revolution.</p><p>What you are doing for Caligan means the world to us.  You are not just offering brother Christians and vets support.  You are offering spouses and families support and encouragement.</p><p>I’ve been sharing the campaign on Facebook with my vet and spouse friends.  I’m not sure who has contributed, if anyone.  But we don’t forget these things.</p></blockquote><p>The campaign has reached <strike>573</strike> 609 backers and <strike>$40k</strike> $42.3k. It will end on Tuesday (Alt-Hero backers will remember that 1 day left means the NEXT day is the final day.) Please continue to spread the word.</p><p>In case you need any reminder of what we’re up against in the long term, this should prove to be <a href=\"https://www.instagram.com/p/BebVvU9nldw/\">a useful reminder</a>. Nice hat, right? Note that the editor of that particular series is the new Marvel editor-in-chief. Which suggests that as bad as it has been, the convergence at Marvel is only going to get worse now that they are shutting down some of their most converged comics due to poor sales.</p><p>A sensible individual might conclude that means that the executives there have learned that convergence doesn’t sell. But those who understand that SJWs always double down will know it means that they’re simply going to transfer the convergence to the better-selling series.</p></div>",
  "content_text": "A military wife would like the backers of the\nWill Caligan’s Comic\ncampaign to know that your efforts have been noticed and are deeply appreciated by the military community:\nMy husband recently retired from 20 years mixed service Airborne and National Guard. His uncle is a Desert Storm vet.  My dad was in Vietnam.  Our collective family military histories go to the Revolution.\nWhat you are doing for Caligan means the world to us.  You are not just offering brother Christians and vets support.  You are offering spouses and families support and encouragement.\nI’ve been sharing the campaign on Facebook with my vet and spouse friends.  I’m not sure who has contributed, if anyone.  But we don’t forget these things.\nThe campaign has reached\n573\n609 backers and\n$40k\n$42.3k. It will end on Tuesday (Alt-Hero backers will remember that 1 day left means the NEXT day is the final day.) Please continue to spread the word.\nIn case you need any reminder of what we’re up against in the long term, this should prove to be\na useful reminder\n. Nice hat, right? Note that the editor of that particular series is the new Marvel editor-in-chief. Which suggests that as bad as it has been, the convergence at Marvel is only going to get worse now that they are shutting down some of their most converged comics due to poor sales.\nA sensible individual might conclude that means that the executives there have learned that convergence doesn’t sell. But those who understand that SJWs always double down will know it means that they’re simply going to transfer the convergence to the better-selling series.",
  "tags": [
    "Arkhaven",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-27T12:11:00+00:00"
}