{
  "url": "https://voxday.net/2018/01/08/never-trust-a-moderate/",
  "scraped_at": "2025-12-19T10:38:05.843248",
  "title": "Never trust a moderate",
  "date_display": "January 8, 2018",
  "date_iso": "2018-01-08T10:10:00+00:00",
  "date_from_url": "2018-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They aren’t on your side and the Arab logic of “the enemy of my enemy is my friend” does not apply to them, because they are not truly the enemy of the Left. They are the Left’s lapdogs and they absolutely love to signal their virtue by attacking anyone seen by others as being “on their side.”</p><p>I wish I could say it was surprising. Ever since I created Alt★Hero, people were telling me that I should get in touch with the Diversity &amp; Comics guy, that he was “really good on SJWs” and so forth. I was dubious but I followed him on Twitter and sent him an email about the Freestartr campaign, and it soon became evident that he was as useless as Mitch McConnell. Sure enough, he eventually revealed his true moderate colors.</p><blockquote><p>Ethan Van Scriver<br>Some Alt Right individuals are condemning me for helping to create so many “diverse” characters while also seeming to be against SJW comics. Well, dudes, quiet down. I believe in creating representative characters. They simply need to be good. Mine are. So Pbbbbblt!</br></p><p>Seth Englehardt<br>I remember arguing against one of those. Dude thought that the Alt-Hero Kickstarter was precisely what I wanted from comics. No, we don’t want political propaganda from ANY side.</br></p><p>Ethan Van Scriver<br>Alt Hero is a mess. Dude raised so much money from people wanting less Far Left Wing politics in comics and he wants to spend it to create Far Right Wing comics? How about just good comics?? Why does everything have to be aggressively agitating?</br></p><p>Diversity &amp; Comics<br>ALT*HERO is RE*TARDED</br></p></blockquote><p>They’re such quality critics, they don’t even need to wait for anything to be released in order to criticize it. And to think people wonder why I simply ignore everything these type of people advise. (Before you say something patently absurd, please understand that people often email things to me. I’ve never even heard of the other two guys.)</p><p>As for the “representative characters” argument, that’s one of the proto-SJW arguments. It’s so old that I remember it being used by early SJWs to justify statistically improbable appearances by minorities in college yearbooks back in the 1990s. The best example of this was when the University of Wisconsin-Madison actually photoshopped a black student into a photograph used in their application materials back in 2000; they wanted an image that would be “representative.”</p><p>But speaking of comics, we will have not one, not two, but THREE related announcements later today. Which is to say, if you are a Castalia House Book Club member, <i>check your email</i>… but don’t discuss it here.</p></div>",
  "content_text": "They aren’t on your side and the Arab logic of “the enemy of my enemy is my friend” does not apply to them, because they are not truly the enemy of the Left. They are the Left’s lapdogs and they absolutely love to signal their virtue by attacking anyone seen by others as being “on their side.”\nI wish I could say it was surprising. Ever since I created Alt★Hero, people were telling me that I should get in touch with the Diversity & Comics guy, that he was “really good on SJWs” and so forth. I was dubious but I followed him on Twitter and sent him an email about the Freestartr campaign, and it soon became evident that he was as useless as Mitch McConnell. Sure enough, he eventually revealed his true moderate colors.\nEthan Van Scriver\nSome Alt Right individuals are condemning me for helping to create so many “diverse” characters while also seeming to be against SJW comics. Well, dudes, quiet down. I believe in creating representative characters. They simply need to be good. Mine are. So Pbbbbblt!\nSeth Englehardt\nI remember arguing against one of those. Dude thought that the Alt-Hero Kickstarter was precisely what I wanted from comics. No, we don’t want political propaganda from ANY side.\nEthan Van Scriver\nAlt Hero is a mess. Dude raised so much money from people wanting less Far Left Wing politics in comics and he wants to spend it to create Far Right Wing comics? How about just good comics?? Why does everything have to be aggressively agitating?\nDiversity & Comics\nALT*HERO is RE*TARDED\nThey’re such quality critics, they don’t even need to wait for anything to be released in order to criticize it. And to think people wonder why I simply ignore everything these type of people advise. (Before you say something patently absurd, please understand that people often email things to me. I’ve never even heard of the other two guys.)\nAs for the “representative characters” argument, that’s one of the proto-SJW arguments. It’s so old that I remember it being used by early SJWs to justify statistically improbable appearances by minorities in college yearbooks back in the 1990s. The best example of this was when the University of Wisconsin-Madison actually photoshopped a black student into a photograph used in their application materials back in 2000; they wanted an image that would be “representative.”\nBut speaking of comics, we will have not one, not two, but THREE related announcements later today. Which is to say, if you are a Castalia House Book Club member,\ncheck your email\n… but don’t discuss it here.",
  "tags": [
    "Alt-Hero",
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-08T10:10:00+00:00"
}