{
  "url": "https://voxday.net/2018/01/06/not-looking-for-any-suspects/",
  "scraped_at": "2025-12-19T10:37:54.074421",
  "title": "Not looking for any suspects",
  "date_display": "January 6, 2018",
  "date_iso": "2018-01-06T13:00:00+00:00",
  "date_from_url": "2018-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m always suspicious when a man supposedly turns on his family for no reason and commits murder-suicide in the absence of a separation or incipient divorce. It is more likely that some very bad people were covering their tracks for one reason or another. These days, when that man is a movie studio driver and his wife runs a pre-school day care, <a href=\"http://www.dailymail.co.uk/news/article-5240287/California-family-dead-apparent-murder-suicide.html\">any such deaths should be treated as even more suspicious</a> and thoroughly investigated.</p><blockquote><p>Authorities believe a man shot and killed his wife and two children before turning the gun on himself in their Southern California home, where their bodies were found Friday. Los Angeles County sheriff’s deputies went to the house in Santa Clarita early Friday after getting a call from someone concerned about the family, Lt. Rodney Moore said.</p><p>The husband and wife, their college-age daughter and pre-teen son were found shot to death in what appears to be a murder-suicide carried out by the man, Moore said.</p><p>Neighbors identified the victims as Michael Birnkrant, 51, his wife, Amy, 47 and their two children – Drew, 20, and Sean, 11.</p></blockquote><p>Is that what the authorities <i>really </i>believe? It’s a bit ironic that Hollywood is always portraying southern police departments as being corrupt and unreliable when there are probably no police departments anywhere in the country more corrupt or inclined to look the other way when crimes are being committed than those located in southern California. Including the NYPD and the DCPD.</p><p>After all, if the authorities looked into the studio Birnkant drove for, and which executives, producers, and directors, they just might uncover more than they want to know.</p></div>",
  "content_text": "I’m always suspicious when a man supposedly turns on his family for no reason and commits murder-suicide in the absence of a separation or incipient divorce. It is more likely that some very bad people were covering their tracks for one reason or another. These days, when that man is a movie studio driver and his wife runs a pre-school day care,\nany such deaths should be treated as even more suspicious\nand thoroughly investigated.\nAuthorities believe a man shot and killed his wife and two children before turning the gun on himself in their Southern California home, where their bodies were found Friday. Los Angeles County sheriff’s deputies went to the house in Santa Clarita early Friday after getting a call from someone concerned about the family, Lt. Rodney Moore said.\nThe husband and wife, their college-age daughter and pre-teen son were found shot to death in what appears to be a murder-suicide carried out by the man, Moore said.\nNeighbors identified the victims as Michael Birnkrant, 51, his wife, Amy, 47 and their two children – Drew, 20, and Sean, 11.\nIs that what the authorities\nreally\nbelieve? It’s a bit ironic that Hollywood is always portraying southern police departments as being corrupt and unreliable when there are probably no police departments anywhere in the country more corrupt or inclined to look the other way when crimes are being committed than those located in southern California. Including the NYPD and the DCPD.\nAfter all, if the authorities looked into the studio Birnkant drove for, and which executives, producers, and directors, they just might uncover more than they want to know.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-06T13:00:00+00:00"
}