{
  "url": "https://voxday.net/2018/01/25/once-more-this-time-with-color/",
  "scraped_at": "2025-12-19T10:40:36.374825",
  "title": "Once more, this time with color",
  "date_display": "January 25, 2018",
  "date_iso": "2018-01-25T21:17:00+00:00",
  "date_from_url": "2018-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://freestartr.com/project/will-caligans-comic/\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"363\" data-original-width=\"512\" decoding=\"async\" src=\"https://pbs.twimg.com/media/DUalxc-XUAATSqO.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"363\" data-original-width=\"512\" data-src=\"https://pbs.twimg.com/media/DUalxc-XUAATSqO.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20363%22%3E%3C/svg%3E\"/></a></div><p>Thanks again to all the backers of <a href=\"https://freestartr.com/project/will-caligans-comic/\">Will Caligan’s Comic</a>! The campaign just passed the 35k mark, which means that both graphic novels will be colored. A really good colorist has come forward to work on this, which means they are going to look exceptional.</p><p>Now, here is the interesting question. Since <i>Swan Knight’s Son</i> appeared to be the favorite of the backers thus far, I sent a copy to Chuck Dixon to see if it would require five or six issues to adapt properly, thinking that this might leave two issues free for a novella or a pair of one-offs. Such as, perhaps, <i>One Bright Star</i> or <i>The Wardog’s Coin</i>. Chuck’s opinion was that the book would actually work best as four issues, which means that if the backers wish, <i>all three books of the trilogy</i> could be done in the space of the two graphic novels. Presumably <i>Swan Knight’s Son</i> and <i>Swan Knight’s Sword</i>, with <i>Feast of the Elfs</i> being divided between them.</p><p>Now, I know devoting both graphic novels to John C. Wright’s excellent fantasy series would probably disappoint those who would prefer to see <i>The Stars Came Back</i> or <i>Rocky Mountain Retribution</i>, but then, the campaign isn’t over yet, so it’s entirely possible that we’ll have 18 issues or more to contemplate; after all, we still have four days to go and Stretch Goal 4 is less than $15k away.</p><p>In any event, nothing has been decided and I will leave these various possibilities to be discussed among those of you who have generously backed this campaign. I said the backers would make the decision and that is precisely how we will do it.</p><p>UPDATE: Stretch Goal 5 has been added. $57,500 means that Book #3 will be colored as well. If it requires less than six issues to convert a novel to graphic format, the extra issues will be based on shorter works and included in the Book (graphic novel).</p></div>",
  "content_text": "Thanks again to all the backers of\nWill Caligan’s Comic\n! The campaign just passed the 35k mark, which means that both graphic novels will be colored. A really good colorist has come forward to work on this, which means they are going to look exceptional.\nNow, here is the interesting question. Since\nSwan Knight’s Son\nappeared to be the favorite of the backers thus far, I sent a copy to Chuck Dixon to see if it would require five or six issues to adapt properly, thinking that this might leave two issues free for a novella or a pair of one-offs. Such as, perhaps,\nOne Bright Star\nor\nThe Wardog’s Coin\n. Chuck’s opinion was that the book would actually work best as four issues, which means that if the backers wish,\nall three books of the trilogy\ncould be done in the space of the two graphic novels. Presumably\nSwan Knight’s Son\nand\nSwan Knight’s Sword\n, with\nFeast of the Elfs\nbeing divided between them.\nNow, I know devoting both graphic novels to John C. Wright’s excellent fantasy series would probably disappoint those who would prefer to see\nThe Stars Came Back\nor\nRocky Mountain Retribution\n, but then, the campaign isn’t over yet, so it’s entirely possible that we’ll have 18 issues or more to contemplate; after all, we still have four days to go and Stretch Goal 4 is less than $15k away.\nIn any event, nothing has been decided and I will leave these various possibilities to be discussed among those of you who have generously backed this campaign. I said the backers would make the decision and that is precisely how we will do it.\nUPDATE: Stretch Goal 5 has been added. $57,500 means that Book #3 will be colored as well. If it requires less than six issues to convert a novel to graphic format, the extra issues will be based on shorter works and included in the Book (graphic novel).",
  "tags": [
    "Arkhaven"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-25T21:17:00+00:00"
}