{
  "url": "https://voxday.net/2018/01/21/release-the-memo/",
  "scraped_at": "2025-12-19T10:39:58.876740",
  "title": "Release the memo!",
  "date_display": "January 21, 2018",
  "date_iso": "2018-01-21T12:46:00+00:00",
  "date_from_url": "2018-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>More sound and fury signifying nothing? Or is the government shutdown, combined with what appears to be <a href=\"https://www.zerohedge.com/news/2018-01-18/explosive-shocking-and-alarming-fisa-memo-set-rock-dc-end-mueller-investigation\">the imminent release of the FISA court abuse memo</a>, the first thunderclap of the much-anticipated Storm?</p><blockquote><p>All hell is breaking loose in Washington D.C. after a four-page memo detailing extensive FISA court abuse was made available to the entire House of Representatives Thursday. The contents of the memo are so explosive, says Journalist Sara Carter, that it could lead to the removal of senior officials in the FBI and the Department of Justice and the end of Robert Mueller’s special counsel investigation.</p><p>These sources say the report is “explosive,” stating they would not be surprised if it leads to the end of Robert Mueller’s Special Counsel investigation into President Trump and his associates.</p><p>A source close to the matter tells Fox News that “the memo details the Intelligence Committee’s oversight work for the FBI and Justice, including the controversy over unmasking and FISA surveillance.” An educated guess by anyone who’s been paying attention for the last year leads to the obvious conclusion that the report reveals extensive abuse of power and highly illegal collusion between the Obama administration, the FBI, the DOJ and the Clinton Campaign against Donald Trump and his team during and after the 2016 presidential election.</p><p>Lawmakers who have seen the memo are calling for its immediate release, while the phrases “explosive,” “shocking,” “troubling,” and “alarming” have all been used in all sincerity. One congressman even likened the report’s details to KGB activity in Russia.</p></blockquote><p>Now we know why the Democrats have been so stupidly intransigent in shutting down the government over a few illegal aliens. They’re just trying to shift the media narrative away from the expected fallout from the release of the memo.</p><p>It’s important to keep in mind that all of these things – all of them – are interconnected. It’s sometimes hard to remember that since the media covers every story as if it appeared <i>ex nihilo</i> even when the same people are involved from one story to the next, but there is absolutely no chance that the Democrats just happened to dig in their heels over nothing at this particular point in time.</p><p>After all, no one expected the Swamp not to resist its draining. And right now, the illegal collusion between the Obama administration, the Clinton campaign, the FBI, and the DOJ is its weakest and most vulnerable point.</p></div>",
  "content_text": "More sound and fury signifying nothing? Or is the government shutdown, combined with what appears to be\nthe imminent release of the FISA court abuse memo\n, the first thunderclap of the much-anticipated Storm?\nAll hell is breaking loose in Washington D.C. after a four-page memo detailing extensive FISA court abuse was made available to the entire House of Representatives Thursday. The contents of the memo are so explosive, says Journalist Sara Carter, that it could lead to the removal of senior officials in the FBI and the Department of Justice and the end of Robert Mueller’s special counsel investigation.\nThese sources say the report is “explosive,” stating they would not be surprised if it leads to the end of Robert Mueller’s Special Counsel investigation into President Trump and his associates.\nA source close to the matter tells Fox News that “the memo details the Intelligence Committee’s oversight work for the FBI and Justice, including the controversy over unmasking and FISA surveillance.” An educated guess by anyone who’s been paying attention for the last year leads to the obvious conclusion that the report reveals extensive abuse of power and highly illegal collusion between the Obama administration, the FBI, the DOJ and the Clinton Campaign against Donald Trump and his team during and after the 2016 presidential election.\nLawmakers who have seen the memo are calling for its immediate release, while the phrases “explosive,” “shocking,” “troubling,” and “alarming” have all been used in all sincerity. One congressman even likened the report’s details to KGB activity in Russia.\nNow we know why the Democrats have been so stupidly intransigent in shutting down the government over a few illegal aliens. They’re just trying to shift the media narrative away from the expected fallout from the release of the memo.\nIt’s important to keep in mind that all of these things – all of them – are interconnected. It’s sometimes hard to remember that since the media covers every story as if it appeared\nex nihilo\neven when the same people are involved from one story to the next, but there is absolutely no chance that the Democrats just happened to dig in their heels over nothing at this particular point in time.\nAfter all, no one expected the Swamp not to resist its draining. And right now, the illegal collusion between the Obama administration, the Clinton campaign, the FBI, and the DOJ is its weakest and most vulnerable point.",
  "tags": [
    "conspiracy",
    "law",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-21T12:46:00+00:00"
}