{
  "url": "https://voxday.net/2018/01/21/sfwa-rejects-jon-del-arroz/",
  "scraped_at": "2025-12-19T10:40:00.349949",
  "title": "SFWA rejects Jon Del Arroz",
  "date_display": "January 21, 2018",
  "date_iso": "2018-01-21T14:21:00+00:00",
  "date_from_url": "2018-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So much for SFWA’s increasingly ludicrous claim to represent the interests of professional science fiction writers. It’s now an objectively racist organization of people who mostly don’t write science fiction that doesn’t accept American Indians or Hispanics who professionally publish science fiction.</p><blockquote><p><b>Statement from the SFWA Membership Credentials Committee</b><br>Recently, a science fiction writer made a very public announcement of his application to join SFWA. SFWA Bylaws section VI.1.c.i gives discretion to the membership credentials committee “regardless of qualifications.” Based on the behavior of and online statements by this writer over the preceding year or so, which the credentials committee believes is inconsistent with the obligations that SFWA members have to one another, the committee has determined that it has good and sufficient cause to deny this membership.</br></p><p>We did not take this step lightly, and we are sensitive to suggestions that this action is due to the writer’s political opinions: it is not. SFWA does not, and will not, impose a political test or political standard for membership. We strive to be welcoming to all SFF writers of good will, whatever their personal beliefs or opinions. However, the membership credentials committee, comprised by the sitting Board of Directors, believes that admitting this writer would not be in keeping with our obligations to our membership.</p></blockquote><p>SFWA is a heavily converged organization. As per the Impossibility of Social Justice Convergence, they are increasingly unable to perform their core function, which originally concerned representing the interests of professional science fiction writers.</p><p>Instead, they defend sex criminals, celebrate pedophiles and child molesters, accept members with literally ZERO science fiction publications, are largely comprised of amateurs who publish the occasional short story in short-lived amateur publications, and reject genuine science fiction professionals because of “obligational inconsistency.” It is no wonder that the vast majority of bestselling science fiction authors don’t bother to join the organization, since it has nothing positive to offer them.</p><p>SFWA is functionally dead. It serves literally no professional purpose anymore. As the lead editor at a mid-sized science fiction publisher, I can attest that it has absolutely no influence with science fiction publishers, distributors, and retailers whatsoever.</p><p>The most amusing aspect of this is that SFWA isn’t even trying to hide that it is no longer a professional writers’ organization anymore. The small print they cited from the new bylaws means that they can literally accept <i>anyone the committee likes</i> as a member, whether the applicant has ever written anything or not, whether the applicant is even human or not. Thanks to the short-sighted fools who gave in to Ann McCaffrey’s threat to quit if they did not let fantasy writers join, SFWA is now an organization for racist cat ladies and their cats, not science fiction writers.</p><p>Important lesson: whenever someone threatens to quit unless you do x, the <i>only </i>correct response is to say: “We are not doing x. We accept your resignation. Goodbye.”</p><p>Now, as always, the SFWA statement hides its true justifications behind a nebulous fog. What are the actual justifications that supposedly provide “good and sufficient cause”?</p><blockquote><p>Dear Mr. Del Arroz,</p><p>SFWA Bylaws section VI.1.c.i gives discretion to the membership credentials committee “regardless of qualifications.” Based on online statements and your behavior from the past year, the membership credentials committee believes it has good and sufficient cause to deny your membership in order to keep SFWA virtual and physical spaces harassment-free and has done so.</p><p>Examples of behavior from the past year:</p><ul><li>Threatening to film people without their consent at private SFWA functions.</li><li>Soliciting people on social media, including Facebook, Gab, and Twitter, in order to “troll” and harass other professional authors, including SFWA members and board officers.</li><li>Accusing SFWA of “doxxing” your children, supporting pedophiles, racism, among other attacks.</li></ul><p>Sincerely,</p><p>The Membership Credentials Committee</p><p>SFWA, Inc.</p></blockquote><p>Of course, if they were to hold the existing membership to the standard they are claiming, they’d have to expel half the leadership, past and present.</p></div>",
  "content_text": "So much for SFWA’s increasingly ludicrous claim to represent the interests of professional science fiction writers. It’s now an objectively racist organization of people who mostly don’t write science fiction that doesn’t accept American Indians or Hispanics who professionally publish science fiction.\nStatement from the SFWA Membership Credentials Committee\nRecently, a science fiction writer made a very public announcement of his application to join SFWA. SFWA Bylaws section VI.1.c.i gives discretion to the membership credentials committee “regardless of qualifications.” Based on the behavior of and online statements by this writer over the preceding year or so, which the credentials committee believes is inconsistent with the obligations that SFWA members have to one another, the committee has determined that it has good and sufficient cause to deny this membership.\nWe did not take this step lightly, and we are sensitive to suggestions that this action is due to the writer’s political opinions: it is not. SFWA does not, and will not, impose a political test or political standard for membership. We strive to be welcoming to all SFF writers of good will, whatever their personal beliefs or opinions. However, the membership credentials committee, comprised by the sitting Board of Directors, believes that admitting this writer would not be in keeping with our obligations to our membership.\nSFWA is a heavily converged organization. As per the Impossibility of Social Justice Convergence, they are increasingly unable to perform their core function, which originally concerned representing the interests of professional science fiction writers.\nInstead, they defend sex criminals, celebrate pedophiles and child molesters, accept members with literally ZERO science fiction publications, are largely comprised of amateurs who publish the occasional short story in short-lived amateur publications, and reject genuine science fiction professionals because of “obligational inconsistency.” It is no wonder that the vast majority of bestselling science fiction authors don’t bother to join the organization, since it has nothing positive to offer them.\nSFWA is functionally dead. It serves literally no professional purpose anymore. As the lead editor at a mid-sized science fiction publisher, I can attest that it has absolutely no influence with science fiction publishers, distributors, and retailers whatsoever.\nThe most amusing aspect of this is that SFWA isn’t even trying to hide that it is no longer a professional writers’ organization anymore. The small print they cited from the new bylaws means that they can literally accept\nanyone the committee likes\nas a member, whether the applicant has ever written anything or not, whether the applicant is even human or not. Thanks to the short-sighted fools who gave in to Ann McCaffrey’s threat to quit if they did not let fantasy writers join, SFWA is now an organization for racist cat ladies and their cats, not science fiction writers.\nImportant lesson: whenever someone threatens to quit unless you do x, the\nonly\ncorrect response is to say: “We are not doing x. We accept your resignation. Goodbye.”\nNow, as always, the SFWA statement hides its true justifications behind a nebulous fog. What are the actual justifications that supposedly provide “good and sufficient cause”?\nDear Mr. Del Arroz,\nSFWA Bylaws section VI.1.c.i gives discretion to the membership credentials committee “regardless of qualifications.” Based on online statements and your behavior from the past year, the membership credentials committee believes it has good and sufficient cause to deny your membership in order to keep SFWA virtual and physical spaces harassment-free and has done so.\nExamples of behavior from the past year:\nThreatening to film people without their consent at private SFWA functions.\nSoliciting people on social media, including Facebook, Gab, and Twitter, in order to “troll” and harass other professional authors, including SFWA members and board officers.\nAccusing SFWA of “doxxing” your children, supporting pedophiles, racism, among other attacks.\nSincerely,\nThe Membership Credentials Committee\nSFWA, Inc.\nOf course, if they were to hold the existing membership to the standard they are claiming, they’d have to expel half the leadership, past and present.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-21T14:21:00+00:00"
}