{
  "url": "https://voxday.net/2018/01/22/the-fall-of-the-academy/",
  "scraped_at": "2025-12-19T10:40:04.759609",
  "title": "The fall of the academy",
  "date_display": "January 22, 2018",
  "date_iso": "2018-01-22T02:48:00+00:00",
  "date_from_url": "2018-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>How very embarrassing! The bitter little gamma that I <a href=\"http://voxday.blogspot.com/2016/07/wounded-gamma-loses-again.html\">repeatedly corrected</a> back in 2016 concerning his inability to correctly grasp Aristotelian rhetoric turns out to be <a href=\"https://madgeniusclub.com/2018/01/21/camestros-felapton-is-toby-meadows-spouse-of-foz-meadows/\">a philosophy professor</a>. That certainly explains why “he seems to have a basic knowledge of the technical aspects without understanding their basic purpose or how they can be utilized.”</p><blockquote><p>Long-time Mad Genius Club readers are familiar with Camestros — often dubbed Cameltoe, by those who’ve dickered with the man in the comments sections of various libertarian and conservative SF/F author blogs — mainly for his outsized ego, and a penchant for assuming he is several orders of magnitude more intelligent than not only the host(s) of the blogs he trolls, but also the comment participants to boot.</p><p>Put simply, Felapton is the proverbial pouting basement genius — because the universe is not sufficiently moved by his Brobdingnagian intellect.</p><p>Small wonder, then, that Camestros Felapton is actually Toby Meadows, a philosophy-slash-humanities PhD presently employed at the University of Queensland, Australia. Also, Toby Meadows is the spouse of Australian SF/F gadfly and left-wing political activist Foz Meadows.</p></blockquote><p>Foz Meadows is the woman who falsely accused me of being a National Socialist at Black Gate and then at Amazing Stories. Quite the pair of midwits, they are.</p><p>Oh dear. In addition to violating Facebook’s name policy, Camestros appears to have violated his university’s <a href=\"https://ppl.app.uq.edu.au/content/1.50.01-code-conduct\">code of conduct</a>. “Staff must not engage in conduct that amounts to or may be perceived as harassment.” He has certainly engaged in conduct that amounts to harassment with regards to me. Just look up his many, many references to “Vox Day” on either his blog or File 770. There are hundreds.</p><p>Camestros <a href=\"https://camestrosfelapton.wordpress.com/2018/01/22/meanwhile-former-sad-pups-keep-digging-the-hole-deeper/\">claims he is not Toby Meadows</a>. Unfortunately, he lies far too often to simply take his word for it. Fortunately, there is an easy way to determine whether he is or not, which is to let the university investigate the truth of the matter.</p></div>",
  "content_text": "How very embarrassing! The bitter little gamma that I\nrepeatedly corrected\nback in 2016 concerning his inability to correctly grasp Aristotelian rhetoric turns out to be\na philosophy professor\n. That certainly explains why “he seems to have a basic knowledge of the technical aspects without understanding their basic purpose or how they can be utilized.”\nLong-time Mad Genius Club readers are familiar with Camestros — often dubbed Cameltoe, by those who’ve dickered with the man in the comments sections of various libertarian and conservative SF/F author blogs — mainly for his outsized ego, and a penchant for assuming he is several orders of magnitude more intelligent than not only the host(s) of the blogs he trolls, but also the comment participants to boot.\nPut simply, Felapton is the proverbial pouting basement genius — because the universe is not sufficiently moved by his Brobdingnagian intellect.\nSmall wonder, then, that Camestros Felapton is actually Toby Meadows, a philosophy-slash-humanities PhD presently employed at the University of Queensland, Australia. Also, Toby Meadows is the spouse of Australian SF/F gadfly and left-wing political activist Foz Meadows.\nFoz Meadows is the woman who falsely accused me of being a National Socialist at Black Gate and then at Amazing Stories. Quite the pair of midwits, they are.\nOh dear. In addition to violating Facebook’s name policy, Camestros appears to have violated his university’s\ncode of conduct\n. “Staff must not engage in conduct that amounts to or may be perceived as harassment.” He has certainly engaged in conduct that amounts to harassment with regards to me. Just look up his many, many references to “Vox Day” on either his blog or File 770. There are hundreds.\nCamestros\nclaims he is not Toby Meadows\n. Unfortunately, he lies far too often to simply take his word for it. Fortunately, there is an easy way to determine whether he is or not, which is to let the university investigate the truth of the matter.",
  "tags": [
    "anklebiters",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-22T02:48:00+00:00"
}