{
  "url": "https://voxday.net/2018/01/02/the-jar-ran-out/",
  "scraped_at": "2025-12-19T10:37:24.006531",
  "title": "The jar ran out",
  "date_display": "January 2, 2018",
  "date_iso": "2018-01-02T18:00:00+00:00",
  "date_from_url": "2018-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He tries so hard to be relevant. To be significant. To <i>matter</i>. But not all the agent- and publisher-pumping in the world can disguise the fact that the grand decade-long attempt to transform a blogger turned midlist writer of color-by-number Heinlein pastiche into a leading author has failed.</p><blockquote><p>John Scalzi@scalzi<br>Actual thing I just said as I was cleaning my office: “Damn it, *now* where am I going to put this special citation from the Ohio House of Representatives?!?”</br></p><p>(it was under a pile of books before)</p><p>Artie Fufkin, Polymer Records@FrmerJoe<br>Actual thing I thought while reading this tweet: “Scalzi needs everyone to know that he got citations from the Ohio House of Representatives and Senate? How pathetic is that?”</br></p><p>John Scalzi@scalzi<br>(pats head)</br></p><p>That’s because you’re an asshole, child.</p><p>Artie Fufkin, Polymer Records@FrmerJoe<br>Wow! Killer comeback! I can see why your cutting wit is feared throughout the land.</br></p></blockquote><p>This naturally raises the question, how would a dumpy little guy like Scalzi pat anyone on the head in the first place? He’s 5’4″ and nearly 200 pounds; he’s little more than a gelatinous blob of SJW, snark, and insecurity. Anyhow, I preferred this response.</p><p>Spacebunny Day @Spacebunnyday<br><i>Actual thing I said when I was cleaning out my attic: “Damn it, *now* where am I going to put my fifth place ribbon from my jr. high track and field day?!”</i></br></p><p>The most amusing thing about this exchange is that it’s the consequence of Scalzi’s attempt to address the very uncomfortable fact that VP is now <a href=\"http://voxday.blogspot.com/2018/01/traffic-report-2017.html\">nearly ten times more popular</a> than Whatever by his own chosen metric of importance. IT’S LIKE THE BOUNDLESS HELL OF ELEMENTARY SCHOOL ALL OVER AGAIN! IT WASN’T SUPPOSED TO BE THIS WAY! NETFLIX! PARAMOUNT! MOBILE GAMES! SPECIAL FREAKING <i>CITATION</i>!</p><p>Well, Scalzi certainly is <i>special</i>, to put it mildly. Whatever happened to that jar of ZFG? It must have run out.</p></div>",
  "content_text": "He tries so hard to be relevant. To be significant. To\nmatter\n. But not all the agent- and publisher-pumping in the world can disguise the fact that the grand decade-long attempt to transform a blogger turned midlist writer of color-by-number Heinlein pastiche into a leading author has failed.\nJohn Scalzi@scalzi\nActual thing I just said as I was cleaning my office: “Damn it, *now* where am I going to put this special citation from the Ohio House of Representatives?!?”\n(it was under a pile of books before)\nArtie Fufkin, Polymer Records@FrmerJoe\nActual thing I thought while reading this tweet: “Scalzi needs everyone to know that he got citations from the Ohio House of Representatives and Senate? How pathetic is that?”\nJohn Scalzi@scalzi\n(pats head)\nThat’s because you’re an asshole, child.\nArtie Fufkin, Polymer Records@FrmerJoe\nWow! Killer comeback! I can see why your cutting wit is feared throughout the land.\nThis naturally raises the question, how would a dumpy little guy like Scalzi pat anyone on the head in the first place? He’s 5’4″ and nearly 200 pounds; he’s little more than a gelatinous blob of SJW, snark, and insecurity. Anyhow, I preferred this response.\nSpacebunny Day @Spacebunnyday\nActual thing I said when I was cleaning out my attic: “Damn it, *now* where am I going to put my fifth place ribbon from my jr. high track and field day?!”\nThe most amusing thing about this exchange is that it’s the consequence of Scalzi’s attempt to address the very uncomfortable fact that VP is now\nnearly ten times more popular\nthan Whatever by his own chosen metric of importance. IT’S LIKE THE BOUNDLESS HELL OF ELEMENTARY SCHOOL ALL OVER AGAIN! IT WASN’T SUPPOSED TO BE THIS WAY! NETFLIX! PARAMOUNT! MOBILE GAMES! SPECIAL FREAKING\nCITATION\n!\nWell, Scalzi certainly is\nspecial\n, to put it mildly. Whatever happened to that jar of ZFG? It must have run out.",
  "tags": [
    "McRapey",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-02T18:00:00+00:00"
}