{
  "url": "https://voxday.net/2018/01/10/the-capn-is-absolutely-right/",
  "scraped_at": "2025-12-19T10:38:24.025977",
  "title": "The Capn is absolutely right",
  "date_display": "January 10, 2018",
  "date_iso": "2018-01-10T13:00:00+00:00",
  "date_from_url": "2018-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: left;\">I definitely care more about SJWs <a href=\"https://www.youtube.com/watch?v=OpS_fhcAsnQ\">than comic books</a>.</div><div style=\"text-align: left;\"><div style=\"text-align: center;\"></div></div><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/OpS_fhcAsnQ\" width=\"512\"></iframe></div><p>However, what Capn Cummings fails to realize is that I also believe in winning by being objectively superior to the competition, regardless of what they happen to be, and by thinking beyond the conventional assumptions. That’s why my band recorded four Billboard Top 40 Club Chart hits. That’s why my game development house went 6x platinum with our fourth game. That’s why Castalia House already publishes some of the best science fiction and fantasy in the genre, and why Arkhaven’s debut digital comic book was the #1 New Release on Kindle.</p><p>I don’t care about comic books. But I care deeply about Arkhaven becoming the very best publisher of the best-written, most popular comic books and graphic novels in the comics industry. I expect excellence from everyone involved in the project, including myself. Sure, we fall short. Sure, we have no clue what we’re doing yet. It took me 12 tries to get Kindle Comic Creator to simply kick out a working .mobi file without crashing first. I still don’t really understand what flatting is or why it is necessary.</p><p>So what? I don’t need to know. I certainly don’t need to care. I just need to stay out of the way of the experts with whom I’m surrounding myself, and to whom I’m handing over the responsibility to do it right. I’m not afraid to bring on better writers than me, to hire the very best artists and colorists we can find, and more importantly, to listen to the <i>substantive </i>criticism and seek to continuously improve.</p><p>If you compare the first print editions that Castalia published to the most recent ones, the differences are striking. Even though all the same people are involved, we have improved with almost every single book of the 60 we’ve produced so far. It’s an iterative process. And that means the comics we are now producing are almost certainly the very worst we will ever produce.</p><p>Let me give you an example. I watched a video review of <a href=\"http://amzn.to/2qBQNo9\"><i><b>QUANTUM MORTIS A Man Disrupted #1: By the Book</b></i></a> yesterday. The reviewer made a good point about how we had no text-indicators of sound effects; in other words, no BIFF BANG BOOM! So, I talked to the artist right after I finished watching the video and now issue #2 will have them. On the other hand, the reviewer also made a point about the lack of action in the first issue, which made me laugh for reasons that anyone who has read the novel will understand. That’s a “problem” that doesn’t need to be addressed and will take care of itself as the story continues.</p><p>But as for those who wring their hands over politics, well, I couldn’t care less what they think. They obviously haven’t even bothered to look at anything we’ve done in the comic space so far, let alone read any of my novels. Yes, there will be politics in some of our comics, but because we are not SJWs, we are not afraid to present opposing perspectives fairly and use the conflict to generate interesting plots and storylines and characters. Can anyone honestly say that <a href=\"https://crypto.fashion/collections/arkhaven-comics/products/official-alt-hero-capitan-europa-tee\">Captain Europa</a> is an unfair representation of a certain perspective that I most certainly do not share?</p><div style=\"text-align: left;\">It’s more disappointing than anything to see criticism this uninformed and insubstantial, not because it hurts anyone’s feelings, but because it is literally useless. However, it is a good sign, because it is an indicator that interest in what we are doing is beginning to grow. Of course, the insecure professionals will do their usual <a href=\"https://youtu.be/DuvwiwgyD_M\">OMG LOL THIS IS SO TERRIBLE THING</a> while we proceed to demonstrate the total irrelevance of their esoteric expertise.</div><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/DuvwiwgyD_M\" width=\"512\"></iframe></div><p>This review is precisely why I pay no attention to the professionals in the comics industry. Their sales are plummeting. Their channels are dying. Their industry is hopelessly converged. Their stories are lightweight, superficial, and boring, and they can’t successfully develop any interesting new characters. They are clearly doing <i>something </i>wrong, and yet, their first reaction to a first effort that is not only doing something different, but is literally the #1 New Release on Amazon is to smugly denounce it as awful. The SF professionals reacted exactly the same way when they smugly denounced the awfulness of my “vanity publishing house” three years ago. It’s going to be amusing to watch Ethan’s videos on the subject one year from now… or rather, to observe when he abruptly falls silent just like File 770 and the SF-SJWs have.</p><p>I’m not at all upset by Ethan’s honest, fair, and very negative review of QMAMD #1. Quite to the contrary, I am <i>extremely </i>pleased by it. Here is why: it confirms is that what we are doing is taking a <i>fundamentally </i>different approach to comic book storytelling than the standard presently being utilized by the industry as a whole. That suggests that we will either fail completely or we will succeed well beyond anyone’s expectations. And the initial response to QMAMD #1 is a very early sign of the latter.</p><p>So, stick to drawing, Ethan, and leave the storytelling to the real writers instead of the cheap wannabes in your industry. I can tell that you know <i>nothing </i>about how to tell an absorbing story that will hold a reader’s interest over time. The fact that you genuinely think nothing happened in Issue #1 and can’t understand the significance of the history page simply demonstrates the extreme superficiality of your perspective. I note that you are confusing the utilization of action to grab the short-lived attention of the attention-deficit-disordered reader with genuine storytelling. The two are not synonymous; only the inferior storyteller needs to rely on cheap pyrotechnics to hold his reader’s attention. In my opinion, that stupid “show don’t tell” philosophy is part of why comics are dying.</p><p>I was particularly amused by the idea expressed by some of his commenters that Quantum Mortis is some sort of Bladerunner ripoff. It’s not. It can’t be. I’ve never seen any of the Bladerunner movies and the books have literally nothing in common with the PKD novel on which the movies were based. FFS, anyone who knows anything about me knows that Quantum Mortis is <i>Traveller</i>.</p><p>UPDATE: I thought this comment was particularly amusing: <i>“Part of the problem is that he seems to have approached it like a print writer doing the prologue for a book rather than a superhero comic book writer doing a first issue.”</i></p><p>What planet do you have to be orbiting to conclude that the graphic novelization of a military science fiction mystery should be more like a superhero comic book? I am genuinely curious to discover on what lunatic grounds these critics are going to attack our first Wodehouse issue.</p></div>",
  "content_text": "I definitely care more about SJWs\nthan comic books\n.\nHowever, what Capn Cummings fails to realize is that I also believe in winning by being objectively superior to the competition, regardless of what they happen to be, and by thinking beyond the conventional assumptions. That’s why my band recorded four Billboard Top 40 Club Chart hits. That’s why my game development house went 6x platinum with our fourth game. That’s why Castalia House already publishes some of the best science fiction and fantasy in the genre, and why Arkhaven’s debut digital comic book was the #1 New Release on Kindle.\nI don’t care about comic books. But I care deeply about Arkhaven becoming the very best publisher of the best-written, most popular comic books and graphic novels in the comics industry. I expect excellence from everyone involved in the project, including myself. Sure, we fall short. Sure, we have no clue what we’re doing yet. It took me 12 tries to get Kindle Comic Creator to simply kick out a working .mobi file without crashing first. I still don’t really understand what flatting is or why it is necessary.\nSo what? I don’t need to know. I certainly don’t need to care. I just need to stay out of the way of the experts with whom I’m surrounding myself, and to whom I’m handing over the responsibility to do it right. I’m not afraid to bring on better writers than me, to hire the very best artists and colorists we can find, and more importantly, to listen to the\nsubstantive\ncriticism and seek to continuously improve.\nIf you compare the first print editions that Castalia published to the most recent ones, the differences are striking. Even though all the same people are involved, we have improved with almost every single book of the 60 we’ve produced so far. It’s an iterative process. And that means the comics we are now producing are almost certainly the very worst we will ever produce.\nLet me give you an example. I watched a video review of\nQUANTUM MORTIS A Man Disrupted #1: By the Book\nyesterday. The reviewer made a good point about how we had no text-indicators of sound effects; in other words, no BIFF BANG BOOM! So, I talked to the artist right after I finished watching the video and now issue #2 will have them. On the other hand, the reviewer also made a point about the lack of action in the first issue, which made me laugh for reasons that anyone who has read the novel will understand. That’s a “problem” that doesn’t need to be addressed and will take care of itself as the story continues.\nBut as for those who wring their hands over politics, well, I couldn’t care less what they think. They obviously haven’t even bothered to look at anything we’ve done in the comic space so far, let alone read any of my novels. Yes, there will be politics in some of our comics, but because we are not SJWs, we are not afraid to present opposing perspectives fairly and use the conflict to generate interesting plots and storylines and characters. Can anyone honestly say that\nCaptain Europa\nis an unfair representation of a certain perspective that I most certainly do not share?\nIt’s more disappointing than anything to see criticism this uninformed and insubstantial, not because it hurts anyone’s feelings, but because it is literally useless. However, it is a good sign, because it is an indicator that interest in what we are doing is beginning to grow. Of course, the insecure professionals will do their usual\nOMG LOL THIS IS SO TERRIBLE THING\nwhile we proceed to demonstrate the total irrelevance of their esoteric expertise.\nThis review is precisely why I pay no attention to the professionals in the comics industry. Their sales are plummeting. Their channels are dying. Their industry is hopelessly converged. Their stories are lightweight, superficial, and boring, and they can’t successfully develop any interesting new characters. They are clearly doing\nsomething\nwrong, and yet, their first reaction to a first effort that is not only doing something different, but is literally the #1 New Release on Amazon is to smugly denounce it as awful. The SF professionals reacted exactly the same way when they smugly denounced the awfulness of my “vanity publishing house” three years ago. It’s going to be amusing to watch Ethan’s videos on the subject one year from now… or rather, to observe when he abruptly falls silent just like File 770 and the SF-SJWs have.\nI’m not at all upset by Ethan’s honest, fair, and very negative review of QMAMD #1. Quite to the contrary, I am\nextremely\npleased by it. Here is why: it confirms is that what we are doing is taking a\nfundamentally\ndifferent approach to comic book storytelling than the standard presently being utilized by the industry as a whole. That suggests that we will either fail completely or we will succeed well beyond anyone’s expectations. And the initial response to QMAMD #1 is a very early sign of the latter.\nSo, stick to drawing, Ethan, and leave the storytelling to the real writers instead of the cheap wannabes in your industry. I can tell that you know\nnothing\nabout how to tell an absorbing story that will hold a reader’s interest over time. The fact that you genuinely think nothing happened in Issue #1 and can’t understand the significance of the history page simply demonstrates the extreme superficiality of your perspective. I note that you are confusing the utilization of action to grab the short-lived attention of the attention-deficit-disordered reader with genuine storytelling. The two are not synonymous; only the inferior storyteller needs to rely on cheap pyrotechnics to hold his reader’s attention. In my opinion, that stupid “show don’t tell” philosophy is part of why comics are dying.\nI was particularly amused by the idea expressed by some of his commenters that Quantum Mortis is some sort of Bladerunner ripoff. It’s not. It can’t be. I’ve never seen any of the Bladerunner movies and the books have literally nothing in common with the PKD novel on which the movies were based. FFS, anyone who knows anything about me knows that Quantum Mortis is\nTraveller\n.\nUPDATE: I thought this comment was particularly amusing:\n“Part of the problem is that he seems to have approached it like a print writer doing the prologue for a book rather than a superhero comic book writer doing a first issue.”\nWhat planet do you have to be orbiting to conclude that the graphic novelization of a military science fiction mystery should be more like a superhero comic book? I am genuinely curious to discover on what lunatic grounds these critics are going to attack our first Wodehouse issue.",
  "tags": [
    "Alt-Hero",
    "Arkhaven"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-10T13:00:00+00:00"
}