{
  "url": "https://voxday.net/2018/01/01/what-part-of-shut-up-does-he-not-understand/",
  "scraped_at": "2025-12-19T10:37:17.741347",
  "title": "What part of “shut up” does he not understand?",
  "date_display": "January 1, 2018",
  "date_iso": "2018-01-01T18:00:00+00:00",
  "date_from_url": "2018-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://file770.com/wp-content/uploads/Lego-type-STrek-figures-dtqyee71fl7rfwzgurt8.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"272\" data-original-width=\"800\" decoding=\"async\" fetchpriority=\"high\" height=\"135\" src=\"http://file770.com/wp-content/uploads/Lego-type-STrek-figures-dtqyee71fl7rfwzgurt8.jpg\" width=\"400\"/></a></div><p>In what can perhaps be best described as a metappropriate response, Wil Wheaton <a href=\"http://wilwheaton.net/2017/12/because-so-many-of-you-asked/\">cries about being portrayed as a crybaby</a>.</p><blockquote><p>I love that this set exists. I love that enough people want to do TNG LEGO to create a market demand for these figures. I can’t speak for the rest of the cast, but things like this, based on us, are always awesome. Earlier this year, a guy gave me a little minifig that he made of Wesley, and even though it’s unofficial, it is a delightful thing to own. He’s in his little red spacesuit, and he looks like he’s got a course you can plot. I love it.</p><p>In this particular custom set, though, Wesley is depicted as a crying child, and that’s not just disappointing to me, it’s kind of insulting and demeaning to everyone who loved that character when they were kids. The creator of this set is saying that Wesley Crusher is a crybaby, and he doesn’t deserve to stand shoulder to minifig shoulder with the rest of the crew. People who loved Wesley, who were inspired by him to pursue careers in science and engineering, who were thrilled when they were kids to see another kid driving a spaceship? Well, the character they loved was a crybaby so just suck it up I guess.</p><p>“Oh, Wil Wheaton, you sweet summer child,” you are saying right now. “You think people actually loved Wesley Crusher. You’re adorable.”</p><p>So this is, as you can imagine, something I’ve spent a lot of time dealing with for thirty years. It’s been talked about to death (on this very blog, more than once), but I’ll sum up as briefly as I can: I reject the idea that nobody liked or cared about the character…. it’s “Shut up, Wesley,” made into what would otherwise be an awesome minifig, in a collection of truly amazing and beautiful minifigs.</p><p>It’s a huge disappointment to me, because I’d love to have a Wesley in his little rainbow acting-ensign uniform, but I believe that it’s insulting to all the kids who are now adults who loved the character and were inspired by him to go into science and engineering, or who had a character on TV they could relate to, because they were too smart for their own good, a little awkward and weird, and out of place everywhere they went (oh hey I just described myself. I never claimed to be objective here).</p></blockquote><p>Now THAT is funny! You can put the Gamma on camera, but you just can’t reason, talk, or beat the Gamma out of him. Seriously, Wil, just <i>shut up </i>already. The general public would like you a lot better if you’d simply take your well-merited beatings with a graceful smile.</p><p>Anyhow, there are probably more pedophiles who were inspired by Wesley than scientists and engineers. No one – NO ONE – loves Star Trek <a href=\"http://www.neogaf.com/forum/showthread.php?t=425231\">more than pedophiles</a>. I wasn’t even a little bit surprised to see pictures of Moira Greyland and her brother in Star Trek uniforms as children.<br><i><br/></i><i>“We always say there are two types of pedophiles: Star Trek and Star Wars,” says Det. Ian Lamond, the unit’s second-in-command. “But it’s mostly Star Trek.”</i></br></p></div>",
  "content_text": "In what can perhaps be best described as a metappropriate response, Wil Wheaton\ncries about being portrayed as a crybaby\n.\nI love that this set exists. I love that enough people want to do TNG LEGO to create a market demand for these figures. I can’t speak for the rest of the cast, but things like this, based on us, are always awesome. Earlier this year, a guy gave me a little minifig that he made of Wesley, and even though it’s unofficial, it is a delightful thing to own. He’s in his little red spacesuit, and he looks like he’s got a course you can plot. I love it.\nIn this particular custom set, though, Wesley is depicted as a crying child, and that’s not just disappointing to me, it’s kind of insulting and demeaning to everyone who loved that character when they were kids. The creator of this set is saying that Wesley Crusher is a crybaby, and he doesn’t deserve to stand shoulder to minifig shoulder with the rest of the crew. People who loved Wesley, who were inspired by him to pursue careers in science and engineering, who were thrilled when they were kids to see another kid driving a spaceship? Well, the character they loved was a crybaby so just suck it up I guess.\n“Oh, Wil Wheaton, you sweet summer child,” you are saying right now. “You think people actually loved Wesley Crusher. You’re adorable.”\nSo this is, as you can imagine, something I’ve spent a lot of time dealing with for thirty years. It’s been talked about to death (on this very blog, more than once), but I’ll sum up as briefly as I can: I reject the idea that nobody liked or cared about the character…. it’s “Shut up, Wesley,” made into what would otherwise be an awesome minifig, in a collection of truly amazing and beautiful minifigs.\nIt’s a huge disappointment to me, because I’d love to have a Wesley in his little rainbow acting-ensign uniform, but I believe that it’s insulting to all the kids who are now adults who loved the character and were inspired by him to go into science and engineering, or who had a character on TV they could relate to, because they were too smart for their own good, a little awkward and weird, and out of place everywhere they went (oh hey I just described myself. I never claimed to be objective here).\nNow THAT is funny! You can put the Gamma on camera, but you just can’t reason, talk, or beat the Gamma out of him. Seriously, Wil, just\nshut up\nalready. The general public would like you a lot better if you’d simply take your well-merited beatings with a graceful smile.\nAnyhow, there are probably more pedophiles who were inspired by Wesley than scientists and engineers. No one – NO ONE – loves Star Trek\nmore than pedophiles\n. I wasn’t even a little bit surprised to see pictures of Moira Greyland and her brother in Star Trek uniforms as children.\n“We always say there are two types of pedophiles: Star Trek and Star Wars,” says Det. Ian Lamond, the unit’s second-in-command. “But it’s mostly Star Trek.”",
  "tags": [
    "PinkSF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-01T18:00:00+00:00"
}