{
  "url": "https://voxday.net/2018/01/03/wikipedia-buries-cnn-scandal/",
  "scraped_at": "2025-12-19T10:37:28.570334",
  "title": "Wikipedia buries CNN scandal",
  "date_display": "January 3, 2018",
  "date_iso": "2018-01-03T14:19:00+00:00",
  "date_from_url": "2018-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This sort of thing is exactly why I put Infogalactic at the top of the priority list. Because we need a way of accurately preserving <a href=\"https://extranewsfeed.com/cnn-blackmail-controversy-buried-on-wikipedia-with-help-of-partisan-editors-95c70394a310\">the history that SJWs are always trying to revise and rewrite</a>:</p><blockquote><p><b>CNN Blackmail Controversy Buried on Wikipedia with Help of Partisan Editors</b></p><p>Following CNN’s blackmail controversy, left-wing Wikipedia editors had the Wikipedia article on the incident removed and its contents buried at the bottom of a page on CNN controversies. Editors then proceeded to gut this article of roughly a third of its content about controversies at the network in the latest example of liberal bias at the online encyclopedia.</p><p>Roughly an hour after the article on CNN’s recent blackmail scandal was originally created, editor NorthBySouthBaranof started a discussion on having the article made into a redirect to a CNN controversies article with a small section about the incident. Baranof was previously one of the anti-GamerGate editors banned from edits about the ethics in games journalism controversy due to his aggressive agenda-driven editing.</p><p>Over the course of the discussion, 23 regular editors on the site expressed support for the move. Although a majority of editors supporting the move in the discussion have some history of editing in favor of progressive positions, most notable are a group of five (MrX, Volunteer Marek, Objective3000, Sagecandor, and ValarianB) who also participated in a discussion on deleting the article about President Trump sharing classified information on ISIS terrorist activities with Russia.</p></blockquote><p>Standard operating procedure at the SJW-converged site. Rather like the BEA, which has retroactively eliminated the 2001 recession from the official GDP figures, SJW history reflects nothing more than their version of what it suits them <i>now </i>to claim happened <i>then</i>.</p></div>",
  "content_text": "This sort of thing is exactly why I put Infogalactic at the top of the priority list. Because we need a way of accurately preserving\nthe history that SJWs are always trying to revise and rewrite\n:\nCNN Blackmail Controversy Buried on Wikipedia with Help of Partisan Editors\nFollowing CNN’s blackmail controversy, left-wing Wikipedia editors had the Wikipedia article on the incident removed and its contents buried at the bottom of a page on CNN controversies. Editors then proceeded to gut this article of roughly a third of its content about controversies at the network in the latest example of liberal bias at the online encyclopedia.\nRoughly an hour after the article on CNN’s recent blackmail scandal was originally created, editor NorthBySouthBaranof started a discussion on having the article made into a redirect to a CNN controversies article with a small section about the incident. Baranof was previously one of the anti-GamerGate editors banned from edits about the ethics in games journalism controversy due to his aggressive agenda-driven editing.\nOver the course of the discussion, 23 regular editors on the site expressed support for the move. Although a majority of editors supporting the move in the discussion have some history of editing in favor of progressive positions, most notable are a group of five (MrX, Volunteer Marek, Objective3000, Sagecandor, and ValarianB) who also participated in a discussion on deleting the article about President Trump sharing classified information on ISIS terrorist activities with Russia.\nStandard operating procedure at the SJW-converged site. Rather like the BEA, which has retroactively eliminated the 2001 recession from the official GDP figures, SJW history reflects nothing more than their version of what it suits them\nnow\nto claim happened\nthen\n.",
  "tags": [
    "history",
    "Infogalactic"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-03T14:19:00+00:00"
}