{
  "url": "https://voxday.net/2018/01/22/will-caligans-comic/",
  "scraped_at": "2025-12-19T10:40:07.707156",
  "title": "Will Caligan’s Comic",
  "date_display": "January 22, 2018",
  "date_iso": "2018-01-22T13:49:00+00:00",
  "date_from_url": "2018-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://freestartr.com/project/will-caligans-comic/\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"450\" data-original-width=\"800\" decoding=\"async\" fetchpriority=\"high\" height=\"225\" src=\"https://freestartr.com/wp-content/uploads/2018/01/Caligans_comic.png\" width=\"400\"/></a></div><p>This is an announcement for a special <a href=\"https://freestartr.com/project/will-caligans-comic/\">one-week campaign</a> designed to provide work for Will Caligan, a military veteran, a Christian, and a comic artist who was swarmed by SJWs and lost his publishing arrangement due to his willingness to stand up for his beliefs about right and wrong. All of the funds raised will go to paying for the production of one or more comics illustrated by Will that will be published by Arkhaven. The graphic novel – or novels – will be based on novels chosen by the backers that have been contributed by various authors, and comics legend Chuck Dixon will be providing the adapted scripts for free. A Gold-rate team of colorists, Arklight Studios, will provide the colors for the cover at a steep discount.</p><p>50 percent of the revenues from any subsequent sale of the comics and graphic novels will go to Will and to the direct contributors to producing the comic. (The author whose work is selected, the colorists, etc.) This does <u>not</u> include me or the Arkhaven team. For more details about the campaign and to view the backing options, please <a href=\"https://freestartr.com/project/will-caligans-comic/\">visit Freestartr</a>. And please spread the word, especially <a href=\"https://twitter.com/ArkhavenComix/status/955457380631875585\">on Twitter</a>.</p><p>Thanks to everyone who put this campaign together on very short notice.</p><ul><li>Jon Del Arroz</li><li>Freestartr</li><li>Arklight Studios</li><li>Chuck Dixon</li><li>Nick Cole</li><li>John C. Wright</li><li>Peter Grant</li><li>Lawdog</li><li>Rolf Nelson</li><li>Kai Wai Cheah</li><li>Rawle Nyanzi</li><li>Team Arkhaven</li></ul><p>And as a bonus, if you visit <a href=\"https://freestartr.com/project/will-caligans-comic/\">the campaign page</a>, you can see one of the new Alt★Hero covers illustrated by Cliff Cosmic and colored by Arklight Studios.</p><p>Peter Grant <a href=\"https://bayourenaissanceman.blogspot.com/2018/01/heres-cause-very-worthy-of-our-support.html\">shares his thoughts</a>.</p><p>The press release from Short Fuse Media Group concerning the matter.</p><blockquote><p>Short Fuse Media Group, LLC. was founded on the principles of uniting all PEOPLE and embracing diversity.</p><p>In order to maintain those principles, the decision has been made from our senior staff to sever ties with Will Caligan and Alpha Dog Studios, effective immediately as a result of comments that were made by Will that were deemed to be offensive by members of the indie comic book community as well as the LGBT Community.</p><p>Short Fuse Media Group, LLC. would like to formally apologize to the members of the indie comic book community, the LGBT Community and especially the current (and prior) members/talent of our roster who are also a part of the LGBT community for the length of time that it took to fully understand the scope of what had taken place and act on this accordingly as again, we support and respect all PEOPLE from ALL walks of life.</p></blockquote><p>Sure they do. Sure they do.</p></div>",
  "content_text": "This is an announcement for a special\none-week campaign\ndesigned to provide work for Will Caligan, a military veteran, a Christian, and a comic artist who was swarmed by SJWs and lost his publishing arrangement due to his willingness to stand up for his beliefs about right and wrong. All of the funds raised will go to paying for the production of one or more comics illustrated by Will that will be published by Arkhaven. The graphic novel – or novels – will be based on novels chosen by the backers that have been contributed by various authors, and comics legend Chuck Dixon will be providing the adapted scripts for free. A Gold-rate team of colorists, Arklight Studios, will provide the colors for the cover at a steep discount.\n50 percent of the revenues from any subsequent sale of the comics and graphic novels will go to Will and to the direct contributors to producing the comic. (The author whose work is selected, the colorists, etc.) This does\nnot\ninclude me or the Arkhaven team. For more details about the campaign and to view the backing options, please\nvisit Freestartr\n. And please spread the word, especially\non Twitter\n.\nThanks to everyone who put this campaign together on very short notice.\nJon Del Arroz\nFreestartr\nArklight Studios\nChuck Dixon\nNick Cole\nJohn C. Wright\nPeter Grant\nLawdog\nRolf Nelson\nKai Wai Cheah\nRawle Nyanzi\nTeam Arkhaven\nAnd as a bonus, if you visit\nthe campaign page\n, you can see one of the new Alt★Hero covers illustrated by Cliff Cosmic and colored by Arklight Studios.\nPeter Grant\nshares his thoughts\n.\nThe press release from Short Fuse Media Group concerning the matter.\nShort Fuse Media Group, LLC. was founded on the principles of uniting all PEOPLE and embracing diversity.\nIn order to maintain those principles, the decision has been made from our senior staff to sever ties with Will Caligan and Alpha Dog Studios, effective immediately as a result of comments that were made by Will that were deemed to be offensive by members of the indie comic book community as well as the LGBT Community.\nShort Fuse Media Group, LLC. would like to formally apologize to the members of the indie comic book community, the LGBT Community and especially the current (and prior) members/talent of our roster who are also a part of the LGBT community for the length of time that it took to fully understand the scope of what had taken place and act on this accordingly as again, we support and respect all PEOPLE from ALL walks of life.\nSure they do. Sure they do.",
  "tags": [
    "Arkhaven"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-01-22T13:49:00+00:00"
}