{
  "url": "https://voxday.net/2007/08/09/creating-women-haters/",
  "scraped_at": "2026-01-08T21:50:58.456300",
  "title": "Creating women-haters",
  "date_display": "August 9, 2007",
  "date_iso": "2007-08-09T19:32:00+00:00",
  "date_from_url": "2007-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Feminists are so incredibly myopic that they have no idea what role they play in <a href=\"http://www.riehlworldview.com/carnivorous_conservative/2007/08/do-some-radical.html\">creating the very men who hate them most</a>.  I was subjected to 16 years of feminist indoctrination; not only did it not take, but my extreme antipathy for feminists and contempt for equalitarianism is a direct result of that.  The old patriarchs might have wished to keep women at home raising families, the new patriarchs who will rise out of the ashes of post-feminism will keep them in chains.  They won’t even trust them to raise their children.</p><p>And with good cause, given mothers like this lunatic.  It will be astonishing if her extreme feminist parenting doesn’t produce a serial killer:</p><blockquote><p>I’ve had him read Dworkin, my site, and other places (namely OAG’s site) and I still can’t unseat this problem. He can recite feminist literature all day long, he can understand the tenets, the ideas behind it, how it links together but he will not allow this knowledge to stand in the way of his porn use….</p><p>I know that there will likely come a day where my son coerces a young woman into sex (rape) and there isn’t a damned thing I can do about it. I look into the eyes of my son and they still sparkle like they did when he was a baby, but he’s not a baby anymore, he’s growing into a man and that man will have trained himself to degrade women before he leaves my home.</p></blockquote><p>Actually, Mommy Dearest, you’re the one who taught him that women were contemptible.  And as one commenter noted, it would be no surprise at all if he went Norman Bates on you, especially considering your sharing with the world how “the way he treats his girlfriend, his sister, his grandmother, and myself make me hate myself for not pouring him down the sink at Planned Parenthood or grabbing a rusty coathanger and doing the job myself even if it killed me.”</p><p>You’d swear it has to be some sort of parody, except this woman’s blog did exist and was almost as insane the one time I read it last year.</p><p>UPDATE: Nonya1 says that it is a parody, but we can’t confirm it because <em>“She had to make her blog private because she was being assaulted and verbally harassed and sent hate mail by people like yourselves, who hate feminists.”</em></p><p>I can totally understand that.  After all, I had to make this blog private due to all the assaults and midnight ninja attacks, to say nothing of the hate mail sent to me by angry feminists threatening not to have sex with me.</p><p>Oh, wait a minute, I didn’t, because I’m not a frightened little woman who can’t take criticism.</p></div>",
  "content_text": "Feminists are so incredibly myopic that they have no idea what role they play in\ncreating the very men who hate them most\n.  I was subjected to 16 years of feminist indoctrination; not only did it not take, but my extreme antipathy for feminists and contempt for equalitarianism is a direct result of that.  The old patriarchs might have wished to keep women at home raising families, the new patriarchs who will rise out of the ashes of post-feminism will keep them in chains.  They won’t even trust them to raise their children.\nAnd with good cause, given mothers like this lunatic.  It will be astonishing if her extreme feminist parenting doesn’t produce a serial killer:\nI’ve had him read Dworkin, my site, and other places (namely OAG’s site) and I still can’t unseat this problem. He can recite feminist literature all day long, he can understand the tenets, the ideas behind it, how it links together but he will not allow this knowledge to stand in the way of his porn use….\nI know that there will likely come a day where my son coerces a young woman into sex (rape) and there isn’t a damned thing I can do about it. I look into the eyes of my son and they still sparkle like they did when he was a baby, but he’s not a baby anymore, he’s growing into a man and that man will have trained himself to degrade women before he leaves my home.\nActually, Mommy Dearest, you’re the one who taught him that women were contemptible.  And as one commenter noted, it would be no surprise at all if he went Norman Bates on you, especially considering your sharing with the world how “the way he treats his girlfriend, his sister, his grandmother, and myself make me hate myself for not pouring him down the sink at Planned Parenthood or grabbing a rusty coathanger and doing the job myself even if it killed me.”\nYou’d swear it has to be some sort of parody, except this woman’s blog did exist and was almost as insane the one time I read it last year.\nUPDATE: Nonya1 says that it is a parody, but we can’t confirm it because\n“She had to make her blog private because she was being assaulted and verbally harassed and sent hate mail by people like yourselves, who hate feminists.”\nI can totally understand that.  After all, I had to make this blog private due to all the assaults and midnight ninja attacks, to say nothing of the hate mail sent to me by angry feminists threatening not to have sex with me.\nOh, wait a minute, I didn’t, because I’m not a frightened little woman who can’t take criticism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-09T18:32:00+00:00"
}