{
  "url": "https://voxday.net/2007/08/21/defending-dr-pz-myers/",
  "scraped_at": "2026-01-08T21:52:01.994829",
  "title": "Defending Dr. PZ Myers",
  "date_display": "August 21, 2007",
  "date_iso": "2007-08-21T08:51:00+00:00",
  "date_from_url": "2007-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ appears to be in a spot of legal bother, but I find it almost impossible to imagine that he is in any actual peril as <a href=\"http://www.boingboing.net/2007/08/20/writer_sued_for_a_ne.html\">this appears to be little more than a nuisance lawsuit</a>. But Dr. Myers is likely going to get an interesting lesson in libel, which he actually might have managed to commit even though it’s almost impossible to do so today:</p><blockquote><p>PZ Myers, Ph.D., Division of Science &amp; Math, University of Minnesota, Morris, says: I’m in an interesting situation. I wrote a very negative review of two versions of a book [Lifecode: The Theory of Biological Self Organization] by Stuart Pivar <a href=\"http://scienceblogs.com/pharyngula/2007/07/lifecode_from_egg_to_embryo_by.php\">here </a>and <a href=\"http://scienceblogs.com/pharyngula/2007/07/lifecode.php\">here</a>. He claims to have a revolutionary idea for how evolution works, but his ideas have no connection to reality, and these lovely elaborate drawings he made look nothing at all like actual embryos. The bottom line is that I said his work was more about the evolution of balloon animals than biology.</p><p>His response is to sue Seed Media and Paul Z. Myers for “Assault, Libel, and Slander.”</p></blockquote><p>As readers have seen nearly every time PZ links to a post here, PZ is inclined to stretch the truth.  He’s doing so again here.  The root of his legal peril lies in the fact that he didn’t say <em>Lifecode</em> was “more about the evolution of balloon animals”, but rather <em><b>“The doodles in this book bear absolutely no relationship to anything that goes on in real organisms, but after staring at them for a while, I realized what this book is actually about. This book is a description of the development and evolution of balloon animals.”</b></em></p><p>Libel requires not only that the statement is an incorrect and malicious statement of fact and not opinion, but also that the individual making the libelous statement knew it to be incorrect.  Due to the phrasing of PZ’s statement and because PZ is a professor of biology and his blog purports to be a serious science blog, the plaintiff has merely to demonstrate that PZ knows the difference between real animals and balloon animal and knows that the book he reviewed was not about balloon animals, in order to prove libel.</p><p>PZ’s malice is easy enough to establish; there are dozens if not hundreds of examples on his site, and explaining motivation is unlikely to prove a challenge given his much publicized hatred for creationists and others who challenge TENS dogma.</p><p>However, even if PZ did libel Stuart Pivar, and based on the two posts I suspect a good lawyer like TPAM could probably prove it, the only relevant issue will be Pivar’s inability to prove financial damages.  Unless Pivar had a book contract get cancelled due to PZ’s review or can demonstrate some other concrete monetary losses, the judge will probably throw this out of court.  The fact that Pivar also charged Myers with assault tends to indicate this is simply a crackpot taking a meaningless legal potshot at someone who has angered him.</p><p>However, if this lawsuit proves to be more than a temporary nuisance, I should like to let Dr. Myers know that I would be more than happy to submit an affadavit in his defense.  Although Pharyngula purports to be a scientific blog, due to the context of PZ’s habitual rhetorical excess, it is abundantly clear that his statements about Pivar’s book should not have been taken literally or assumed to have been any more based in fact than his customary bloviations and misrepresentations.</p><p>UPDATE – Having read the complaint, courtesy of Salt, I don’t think PZ has anything to worry about except the inevitable legal costs.  Mr. Pivar is completely basing his suit on Dr. Myers’s use of the term “crackpot”, which has been found slanderous in very different circumstances that really don’t appear to apply here.  As I said, a competent lawyer could probably make a solid case for libel, (except for that little problem about there being no damages whatsoever), but based on the complaint it’s pretty clear that there isn’t any such animal involved here.</p></div>",
  "content_text": "PZ appears to be in a spot of legal bother, but I find it almost impossible to imagine that he is in any actual peril as\nthis appears to be little more than a nuisance lawsuit\n. But Dr. Myers is likely going to get an interesting lesson in libel, which he actually might have managed to commit even though it’s almost impossible to do so today:\nPZ Myers, Ph.D., Division of Science & Math, University of Minnesota, Morris, says: I’m in an interesting situation. I wrote a very negative review of two versions of a book [Lifecode: The Theory of Biological Self Organization] by Stuart Pivar\nhere\nand\nhere\n. He claims to have a revolutionary idea for how evolution works, but his ideas have no connection to reality, and these lovely elaborate drawings he made look nothing at all like actual embryos. The bottom line is that I said his work was more about the evolution of balloon animals than biology.\nHis response is to sue Seed Media and Paul Z. Myers for “Assault, Libel, and Slander.”\nAs readers have seen nearly every time PZ links to a post here, PZ is inclined to stretch the truth.  He’s doing so again here.  The root of his legal peril lies in the fact that he didn’t say\nLifecode\nwas “more about the evolution of balloon animals”, but rather\n“The doodles in this book bear absolutely no relationship to anything that goes on in real organisms, but after staring at them for a while, I realized what this book is actually about. This book is a description of the development and evolution of balloon animals.”\nLibel requires not only that the statement is an incorrect and malicious statement of fact and not opinion, but also that the individual making the libelous statement knew it to be incorrect.  Due to the phrasing of PZ’s statement and because PZ is a professor of biology and his blog purports to be a serious science blog, the plaintiff has merely to demonstrate that PZ knows the difference between real animals and balloon animal and knows that the book he reviewed was not about balloon animals, in order to prove libel.\nPZ’s malice is easy enough to establish; there are dozens if not hundreds of examples on his site, and explaining motivation is unlikely to prove a challenge given his much publicized hatred for creationists and others who challenge TENS dogma.\nHowever, even if PZ did libel Stuart Pivar, and based on the two posts I suspect a good lawyer like TPAM could probably prove it, the only relevant issue will be Pivar’s inability to prove financial damages.  Unless Pivar had a book contract get cancelled due to PZ’s review or can demonstrate some other concrete monetary losses, the judge will probably throw this out of court.  The fact that Pivar also charged Myers with assault tends to indicate this is simply a crackpot taking a meaningless legal potshot at someone who has angered him.\nHowever, if this lawsuit proves to be more than a temporary nuisance, I should like to let Dr. Myers know that I would be more than happy to submit an affadavit in his defense.  Although Pharyngula purports to be a scientific blog, due to the context of PZ’s habitual rhetorical excess, it is abundantly clear that his statements about Pivar’s book should not have been taken literally or assumed to have been any more based in fact than his customary bloviations and misrepresentations.\nUPDATE – Having read the complaint, courtesy of Salt, I don’t think PZ has anything to worry about except the inevitable legal costs.  Mr. Pivar is completely basing his suit on Dr. Myers’s use of the term “crackpot”, which has been found slanderous in very different circumstances that really don’t appear to apply here.  As I said, a competent lawyer could probably make a solid case for libel, (except for that little problem about there being no damages whatsoever), but based on the complaint it’s pretty clear that there isn’t any such animal involved here.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-21T07:51:00+00:00"
}