{
  "url": "https://voxday.net/2007/08/26/definitions-2/",
  "scraped_at": "2026-01-08T21:52:25.510175",
  "title": "Definitions",
  "date_display": "August 26, 2007",
  "date_iso": "2007-08-26T13:10:00+00:00",
  "date_from_url": "2007-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I suppose it’s a fair objection, I’m just surprised it’s necessary:</p><blockquote><p>I guess we all need a definition of “leading light”, don’t we.</p></blockquote><p>Leading Light: “an important or influential person”.</p><p>Therefore, Sam Harris and Richard Dawkins are clearly leading lights of atheism.  Warren Buffett, although an atheist, is not; he is not cited once in any New Atheist book.  Albert Einstein is not, as he was an agnostic.</p><p>As for Daniel Dennett, no, I don’t think he’s an idiot at all.  I not only favorably commented on <em>Darwin’s Dangerous Idea</em>, but I even dropped him from the Unholy Trinity, as some have noticed on the book cover.  (There is still a chapter devoted to him, of course.)  As those who have read all of the New Atheist tomes know, <em>Breaking the Spell</em> is very, very different in both tone and substance than Dawkins’s, Hitchens’s and Harris’s books, which are about as similar as they can be given Harris’s intellectual handicaps and Hitchens’s educational and occupational shortcomings.</p></div>",
  "content_text": "I suppose it’s a fair objection, I’m just surprised it’s necessary:\nI guess we all need a definition of “leading light”, don’t we.\nLeading Light: “an important or influential person”.\nTherefore, Sam Harris and Richard Dawkins are clearly leading lights of atheism.  Warren Buffett, although an atheist, is not; he is not cited once in any New Atheist book.  Albert Einstein is not, as he was an agnostic.\nAs for Daniel Dennett, no, I don’t think he’s an idiot at all.  I not only favorably commented on\nDarwin’s Dangerous Idea\n, but I even dropped him from the Unholy Trinity, as some have noticed on the book cover.  (There is still a chapter devoted to him, of course.)  As those who have read all of the New Atheist tomes know,\nBreaking the Spell\nis very, very different in both tone and substance than Dawkins’s, Hitchens’s and Harris’s books, which are about as similar as they can be given Harris’s intellectual handicaps and Hitchens’s educational and occupational shortcomings.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-26T12:10:00+00:00"
}