{
  "url": "https://voxday.net/2007/08/13/dont-trust-women/",
  "scraped_at": "2026-01-08T21:51:16.119905",
  "title": "Don’t trust the women",
  "date_display": "August 13, 2007",
  "date_iso": "2007-08-13T08:28:00+00:00",
  "date_from_url": "2007-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When the numbers <a href=\"http://www.nytimes.com/2007/08/12/weekinreview/12kolata.html?_r=1&amp;oref=slogin\">don’t add up</a>:</p><blockquote><p>One survey, recently reported by the federal government, concluded that men had a median of seven female sex partners. Women had a median of four male sex partners. Another study, by British researchers, stated that men had 12.7 heterosexual partners in their lifetimes and women had 6.5.</p><p>But there is just one problem, mathematicians say. It is logically impossible for heterosexual men to have more partners on average than heterosexual women. Those survey results cannot be correct.</p></blockquote><p>First, I’m skeptical about the accuracy of these numbers anyhow.  All self-reporting is somewhat inaccurate, people can’t even be relied upon to correctly identify their own religion, or in many cases, political party.  If you’ve just voted the straight party ticket for the fourth straight election, <em>you’re not an independent</em> even if you aren’t a literal, card-carrying, registered party member.  And it doesn’t take a rocket scientist to notice that the two studies don’t add up either.</p><p>Second, I have never once known a woman to tell the truth about the number of men she’s been involved with, except for the occasional religious woman for whom the answer is zero.  Never.  In my experience, men are far less inclined to exaggerate than women are inclined to minimize.  Tara Parker-Tomlinson even has an amusing system for justifying this undercounting, for example, a woman cannot possibly be expected to count unconventionally attractive men whose picture would be embarrassing to her self-regard.  If I recall correctly, this female tendency to minimize has already been demonstrated in another study, wherein the woman’s count increased when she thought she would be lie-detected, whereas the male count did not change.</p><p>And then there’s the famous Clintonian problem of defining “is”.    Perhaps the studies accounted for this, but given how poorly most sociological studies are worded, I very much doubt it.</p></div>",
  "content_text": "When the numbers\ndon’t add up\n:\nOne survey, recently reported by the federal government, concluded that men had a median of seven female sex partners. Women had a median of four male sex partners. Another study, by British researchers, stated that men had 12.7 heterosexual partners in their lifetimes and women had 6.5.\nBut there is just one problem, mathematicians say. It is logically impossible for heterosexual men to have more partners on average than heterosexual women. Those survey results cannot be correct.\nFirst, I’m skeptical about the accuracy of these numbers anyhow.  All self-reporting is somewhat inaccurate, people can’t even be relied upon to correctly identify their own religion, or in many cases, political party.  If you’ve just voted the straight party ticket for the fourth straight election,\nyou’re not an independent\neven if you aren’t a literal, card-carrying, registered party member.  And it doesn’t take a rocket scientist to notice that the two studies don’t add up either.\nSecond, I have never once known a woman to tell the truth about the number of men she’s been involved with, except for the occasional religious woman for whom the answer is zero.  Never.  In my experience, men are far less inclined to exaggerate than women are inclined to minimize.  Tara Parker-Tomlinson even has an amusing system for justifying this undercounting, for example, a woman cannot possibly be expected to count unconventionally attractive men whose picture would be embarrassing to her self-regard.  If I recall correctly, this female tendency to minimize has already been demonstrated in another study, wherein the woman’s count increased when she thought she would be lie-detected, whereas the male count did not change.\nAnd then there’s the famous Clintonian problem of defining “is”.    Perhaps the studies accounted for this, but given how poorly most sociological studies are worded, I very much doubt it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-13T07:28:00+00:00"
}