{
  "url": "https://voxday.net/2007/08/22/electing-new-people/",
  "scraped_at": "2026-01-08T21:52:05.367254",
  "title": "Electing a new people",
  "date_display": "August 22, 2007",
  "date_iso": "2007-08-22T15:52:00+00:00",
  "date_from_url": "2007-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Equalitarians, humanists and those who “see no color” believe that it is government and geography that make a nation, rather than, well, nations.  The great experiment formerly known as Great Britain may be the first to let us know if this is true or not, as <a href=\"http://news.bbc.co.uk/2/hi/uk_news/6958220.stm?Why=The_Teeth\">more than a tenth of the nation has abandoned Albion</a> for foreign lands less foreign than Londonistan:</p><blockquote><p>More people left the UK last year than in any year since current records began in 1991, statistics show.  Figures from the Office for National Statistics (ONS) indicate that some 385,000 people left the UK for the long term in the year to mid-2006.  Long-term migration into the UK, meanwhile, was 574,000….</p><p>Those figures – published in April – suggest that, over that two year period, 71,000 British citizens started new lives in Australia compared with 58,000 in Spain and 42,000 in France.</p><p>Over the course of 40 years, some 67,500 more Britons have left the UK every year than have returned – a population loss that has been balanced out by increasing immigration.</p></blockquote><p>It is interesting to note that so many Englishmen prefer to live in Spain and France rather than in an overtaxed country full of Muslims and run by Scotsmen.  The worst thing is that this evacuation will only increase as their replacements gain political power and speed up the pace of the transformation of Britain into something much more similar to the places from which they came.</p><p>Enoch Powell was right.</p></div>",
  "content_text": "Equalitarians, humanists and those who “see no color” believe that it is government and geography that make a nation, rather than, well, nations.  The great experiment formerly known as Great Britain may be the first to let us know if this is true or not, as\nmore than a tenth of the nation has abandoned Albion\nfor foreign lands less foreign than Londonistan:\nMore people left the UK last year than in any year since current records began in 1991, statistics show.  Figures from the Office for National Statistics (ONS) indicate that some 385,000 people left the UK for the long term in the year to mid-2006.  Long-term migration into the UK, meanwhile, was 574,000….\nThose figures – published in April – suggest that, over that two year period, 71,000 British citizens started new lives in Australia compared with 58,000 in Spain and 42,000 in France.\nOver the course of 40 years, some 67,500 more Britons have left the UK every year than have returned – a population loss that has been balanced out by increasing immigration.\nIt is interesting to note that so many Englishmen prefer to live in Spain and France rather than in an overtaxed country full of Muslims and run by Scotsmen.  The worst thing is that this evacuation will only increase as their replacements gain political power and speed up the pace of the transformation of Britain into something much more similar to the places from which they came.\nEnoch Powell was right.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-22T14:52:00+00:00"
}