{
  "url": "https://voxday.net/2007/08/27/how-much-more-do-you-need/",
  "scraped_at": "2026-01-08T21:52:34.905267",
  "title": "How much more do you need?",
  "date_display": "August 27, 2007",
  "date_iso": "2007-08-27T17:09:00+00:00",
  "date_from_url": "2007-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unsurprisingly, evolutionists are reacting strongly to <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=57321\">my column today</a>.  They swear up and down that there is no connection whatsoever between evolution and Communism, despite the fact that every single major Communist not only subscribed to Darwinist evolution but considered Darwin to be second only to Hegel as a pre-Marxist socialist figure.</p><p>But in case my opinion, buttressed by that of Karl Marx, Friedrich Engels, Vladimir Lenin, Leon Trotsky, Josef Stalin and Mao Zedong is not enough to convince you, there’s plenty of more evidence to support my contention.  This is but one petty example that came up when I was checking into what Dr. Wilkins informed us was a myth.</p><blockquote><p>Present at Marx’s funeral was Edward Aveling, the one man who had met both Marx and Darwin.  Aveling would, later, live with Marx’s daughter Eleanor, help translate <em>Capital</em> into English, and write expositions of Marxism and Darwinism.  In 1897 Aveling would publish an article, “Charles Darwin and Karl Marx,” in which,<br>perhaps taking his cue from Engels, he would state that there was “absolutely no contradiction whatever” between Marxism and Darwinism, and “that socialism is indeed the logical outcome of evolution, and that its strongest scientific support is derived from the teachings of Darwin.”</br></p><p><em>The Contacts Between Karl Marx and Charles Darwin</em><br>Ralph Colp Jr.<br>Journal of the History of Ideas, Vol. 35, No. 2. (Apr. – Jun., 1974), pp. 329-338.</br></br></p></blockquote><p>As Dr. Wilkins informed us earlier today, Edward Aveling is also the apparent source of the mistaken idea that Karl Marx wrote to Charles Darwin asking him if he would accept the dedication of <em>Capital</em> to him.</p></div>",
  "content_text": "Unsurprisingly, evolutionists are reacting strongly to\nmy column today\n.  They swear up and down that there is no connection whatsoever between evolution and Communism, despite the fact that every single major Communist not only subscribed to Darwinist evolution but considered Darwin to be second only to Hegel as a pre-Marxist socialist figure.\nBut in case my opinion, buttressed by that of Karl Marx, Friedrich Engels, Vladimir Lenin, Leon Trotsky, Josef Stalin and Mao Zedong is not enough to convince you, there’s plenty of more evidence to support my contention.  This is but one petty example that came up when I was checking into what Dr. Wilkins informed us was a myth.\nPresent at Marx’s funeral was Edward Aveling, the one man who had met both Marx and Darwin.  Aveling would, later, live with Marx’s daughter Eleanor, help translate\nCapital\ninto English, and write expositions of Marxism and Darwinism.  In 1897 Aveling would publish an article, “Charles Darwin and Karl Marx,” in which,\nperhaps taking his cue from Engels, he would state that there was “absolutely no contradiction whatever” between Marxism and Darwinism, and “that socialism is indeed the logical outcome of evolution, and that its strongest scientific support is derived from the teachings of Darwin.”\nThe Contacts Between Karl Marx and Charles Darwin\nRalph Colp Jr.\nJournal of the History of Ideas, Vol. 35, No. 2. (Apr. – Jun., 1974), pp. 329-338.\nAs Dr. Wilkins informed us earlier today, Edward Aveling is also the apparent source of the mistaken idea that Karl Marx wrote to Charles Darwin asking him if he would accept the dedication of\nCapital\nto him.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-27T16:09:00+00:00"
}