{
  "url": "https://voxday.net/2007/08/17/it-has-begun-iii/",
  "scraped_at": "2026-01-08T21:51:40.407403",
  "title": "It has begun III",
  "date_display": "August 17, 2007",
  "date_iso": "2007-08-17T10:08:00+00:00",
  "date_from_url": "2007-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to say, I’m increasingly underwhelmed by <a href=\"http://monkeytrials.blogspot.com/2007/08/vox-de-bait-4.html\">the case for evolution being made thus far</a>.  In fact, I would say that I have never been less convinced of the verity of evolutionary theory than I am now, especially in light of the difficulty most of the true believers have demonstrated in understanding the nature of my questions.</p><p>I found myself wondering if Scott might be a bit distracted with the coming school year in light of his response to question (5):</p><blockquote><p><em>Is it correct to say that “we just don’t see clear evidence of speciation in the fossil record”? This appears to contradict what I have been taught about evolution since elementary school.</em></p><p>I can’t really answer that, Vox, unless I know the context of the quote. We can certainly infer speciation in the fossil record, and there really are transitional forms.</p></blockquote><p>Inferring is not “clear evidence”, of course, more importantly, I was quoting Scott himself from a comment made on this blog made 8.16.07 – 12:35 am.  But it seems the answer is, no, evolutionists do not have clear evidence of speciation in the fossil record.</p><p>Scott punted on (3) regarding “margin of error”, which I respect as an honest response, although the question is a legitimate one.  If you’ll excuse a digression, let me explain its significance with an analogy.  One of the reasons I reject Keynesian macroeconomic theory is that its demonstrable margin of error is too great for it to utilized for the purposes to which it is put.  As I showed <a href=\"http://voxday.net/archive/2002/080502.html\">in this 2002 column</a>, the margin of error exceeds the amount of the information upon which vital decisions are being made.  (Note- I was wrong in 2002, the SPX only got down to 800; it made it to 1555 before its recent tanking.)  From what I’ve seen of evolutionary projections, its margin of errors are even greater than those seen in macroeconomics.  Since this level of inaccuracy causes me to dismiss macroeconomics as a science, it leads me to similarly dismiss evolution.  Obviously, if it can be shown that the macroevolutionary margin of error is smaller than that of macroeconomics, I’d be happy to reconsider.  In any case, we’re probably fortunate that macroevolutionists have far less policy influence than macroeconomists.</p><p>As for (2) Talk Origins, consensus seems to be that it’s reliable enough, so given my straightforward use of the data presented there, I’m still wondering how I am supposed to have misused or misrepresented it.  Scott did not understand the significance of (1), as it does not involve whether evolution is an origins science or an operational science, but rather if it was capable of doing more than what financial analysts call backtesting.  The answer, based on what Scott and others have said, is not really.  Evolutionists don’t seem to understand that most of what they call successful “predictions” of past events are not empirically testable predictions, they are merely the confirmation of inferences.  This gap-filling is good, but it’s still backtesting.  Moreover, evolution’s track record is absolutely terrible in this regard, with far more misses than hits.  There’s a good discussion of the underlying issue <a href=\"https://www.blogger.com/comment.g?blogID=4953644170899103489&amp;postID=6614914985187843999\">in Scott’s comments here</a>.  I actually tend to like the evolutionist’s comparison of evolution to meteorology; although he meant it as a defense, of course, I have little regard for the current state of either.  It reminds me of the Talk Origins defense, which is that if evolution isn’t a science, well, then archeology isn’t either.  Okay, fine, they’re both not sciences… are we all agreed?  Can we throw in psychology while we’re at it?</p><p>Scott answered the detailed aspects of (4) but neglected to provide  an answer to the most important part, namely, what is a “mendel”?  What is the average rate of genetic speciation?  If it happens, then it happens at various rates, of which there must be an average.  Moreover, this average must be in line with the fossil record and the various geological datings, not merely “allow for it” as Talk Origins presently describes the variance in morphological rates.  Too fast is as inaccurate as too slow.  Now, “we don’t know yet” is an acceptable answer, but then, the correct thing to do is shut up, go away and figure it out before expecting anyone to accept it on faith.  For Darwin’s sake, it’s been 250 years and we’re still having problems getting people to understand that lowering price increases demand – see the health care debate for details – and evolutionists expect us to accept on faith something that they themselves can’t answer, let alone quantify?</p><p>Regarding (6), Scott again has a reasonable reply although I’m not quite sure what the reminder that populations evolve is supposed to accomplish.  Even if populations evolve, the DNA mutations which demonstrate this evolution can only be found in individuals.</p><blockquote><p>Individuals don’t evolve, populations do, and attempting to predict when and how one population achieves sufficient genomic reorganization that it can no longer produce fertile hybrids with other populations—that’s a tall order.  So Pintopolis is incorrect if he assumes that someone is cataloging all these new species that Vox thinks we would be seeing appear regularly if evolution is true.</p><p>On the other hand, Vox, I don’t know how you arrived at that figure but my intuition it’s almost certainly too low. There are probably more than that number of speciation events every month. But we are unlikely to detect them, for the following reasons:</p><p>a) most of these new species are short-lived</p><p>b) most of these new species are bacteria or other organisms whose numbers are vast, but whose lives are largely unmonitored by the likes of us</p><p>c) speciation doesn’t mean a dramatic, obvious phenoyptic change in most cases—it’s merely a state of genetic incompatibility with other populations. Two organisms could look astonishingly similar, and yet be members of different species—-thus we are unlikely to be able to do anything more than infer the approximate moment when such a population crossed the evolutionary Rubicon</p></blockquote><p>I agree with Scott on the predicted number being low; it was based on conservative assumptions.  And the task is certainly a tall order, but one based on a perfectly reasonable expectation.  We can’t expect to find every new species as it appears due to the problems that Scott mentions, but if one is popping up nearly every other day, we should have no problem finding one or two and demonstrating that they are a new species that did not previously exist, assuming that this is, in fact, happening.</p><p>It’s also interesting that despite defining his case on genetic evolution, Scott is quick to retreat to the very fossil record that the modern synthesis to which he subscribes has [largely, somewhat, completely?] disavowed.  This is the very aspect of the strange nebulousness of the discipline that caused me to become skeptical of it in the first place.</p><p>Scott hasn’t even begun to pose his positive case for evolution, but on the basis of his answers so far, I am convinced that when it comes to the current theory of evolution, scientists are writing checks that they simply are not capable of cashing.  While I don’t deny that it’s a tall order to expect the same sort of precision and results out of evolution that we get out of chemistry, physics, and yes, even economics – and no, my dear evolutionist, supply-side economics is absolutely NOT Austrian – that’s neither my responsibility nor my concern.</p><p>But I hope this continues to be an interesting discussion and I commend Scott, Pintopolis and other defenders of the discipline commenting here for the civil manner with which they have comported themselves.</p></div>",
  "content_text": "I have to say, I’m increasingly underwhelmed by\nthe case for evolution being made thus far\n.  In fact, I would say that I have never been less convinced of the verity of evolutionary theory than I am now, especially in light of the difficulty most of the true believers have demonstrated in understanding the nature of my questions.\nI found myself wondering if Scott might be a bit distracted with the coming school year in light of his response to question (5):\nIs it correct to say that “we just don’t see clear evidence of speciation in the fossil record”? This appears to contradict what I have been taught about evolution since elementary school.\nI can’t really answer that, Vox, unless I know the context of the quote. We can certainly infer speciation in the fossil record, and there really are transitional forms.\nInferring is not “clear evidence”, of course, more importantly, I was quoting Scott himself from a comment made on this blog made 8.16.07 – 12:35 am.  But it seems the answer is, no, evolutionists do not have clear evidence of speciation in the fossil record.\nScott punted on (3) regarding “margin of error”, which I respect as an honest response, although the question is a legitimate one.  If you’ll excuse a digression, let me explain its significance with an analogy.  One of the reasons I reject Keynesian macroeconomic theory is that its demonstrable margin of error is too great for it to utilized for the purposes to which it is put.  As I showed\nin this 2002 column\n, the margin of error exceeds the amount of the information upon which vital decisions are being made.  (Note- I was wrong in 2002, the SPX only got down to 800; it made it to 1555 before its recent tanking.)  From what I’ve seen of evolutionary projections, its margin of errors are even greater than those seen in macroeconomics.  Since this level of inaccuracy causes me to dismiss macroeconomics as a science, it leads me to similarly dismiss evolution.  Obviously, if it can be shown that the macroevolutionary margin of error is smaller than that of macroeconomics, I’d be happy to reconsider.  In any case, we’re probably fortunate that macroevolutionists have far less policy influence than macroeconomists.\nAs for (2) Talk Origins, consensus seems to be that it’s reliable enough, so given my straightforward use of the data presented there, I’m still wondering how I am supposed to have misused or misrepresented it.  Scott did not understand the significance of (1), as it does not involve whether evolution is an origins science or an operational science, but rather if it was capable of doing more than what financial analysts call backtesting.  The answer, based on what Scott and others have said, is not really.  Evolutionists don’t seem to understand that most of what they call successful “predictions” of past events are not empirically testable predictions, they are merely the confirmation of inferences.  This gap-filling is good, but it’s still backtesting.  Moreover, evolution’s track record is absolutely terrible in this regard, with far more misses than hits.  There’s a good discussion of the underlying issue\nin Scott’s comments here\n.  I actually tend to like the evolutionist’s comparison of evolution to meteorology; although he meant it as a defense, of course, I have little regard for the current state of either.  It reminds me of the Talk Origins defense, which is that if evolution isn’t a science, well, then archeology isn’t either.  Okay, fine, they’re both not sciences… are we all agreed?  Can we throw in psychology while we’re at it?\nScott answered the detailed aspects of (4) but neglected to provide  an answer to the most important part, namely, what is a “mendel”?  What is the average rate of genetic speciation?  If it happens, then it happens at various rates, of which there must be an average.  Moreover, this average must be in line with the fossil record and the various geological datings, not merely “allow for it” as Talk Origins presently describes the variance in morphological rates.  Too fast is as inaccurate as too slow.  Now, “we don’t know yet” is an acceptable answer, but then, the correct thing to do is shut up, go away and figure it out before expecting anyone to accept it on faith.  For Darwin’s sake, it’s been 250 years and we’re still having problems getting people to understand that lowering price increases demand – see the health care debate for details – and evolutionists expect us to accept on faith something that they themselves can’t answer, let alone quantify?\nRegarding (6), Scott again has a reasonable reply although I’m not quite sure what the reminder that populations evolve is supposed to accomplish.  Even if populations evolve, the DNA mutations which demonstrate this evolution can only be found in individuals.\nIndividuals don’t evolve, populations do, and attempting to predict when and how one population achieves sufficient genomic reorganization that it can no longer produce fertile hybrids with other populations—that’s a tall order.  So Pintopolis is incorrect if he assumes that someone is cataloging all these new species that Vox thinks we would be seeing appear regularly if evolution is true.\nOn the other hand, Vox, I don’t know how you arrived at that figure but my intuition it’s almost certainly too low. There are probably more than that number of speciation events every month. But we are unlikely to detect them, for the following reasons:\na) most of these new species are short-lived\nb) most of these new species are bacteria or other organisms whose numbers are vast, but whose lives are largely unmonitored by the likes of us\nc) speciation doesn’t mean a dramatic, obvious phenoyptic change in most cases—it’s merely a state of genetic incompatibility with other populations. Two organisms could look astonishingly similar, and yet be members of different species—-thus we are unlikely to be able to do anything more than infer the approximate moment when such a population crossed the evolutionary Rubicon\nI agree with Scott on the predicted number being low; it was based on conservative assumptions.  And the task is certainly a tall order, but one based on a perfectly reasonable expectation.  We can’t expect to find every new species as it appears due to the problems that Scott mentions, but if one is popping up nearly every other day, we should have no problem finding one or two and demonstrating that they are a new species that did not previously exist, assuming that this is, in fact, happening.\nIt’s also interesting that despite defining his case on genetic evolution, Scott is quick to retreat to the very fossil record that the modern synthesis to which he subscribes has [largely, somewhat, completely?] disavowed.  This is the very aspect of the strange nebulousness of the discipline that caused me to become skeptical of it in the first place.\nScott hasn’t even begun to pose his positive case for evolution, but on the basis of his answers so far, I am convinced that when it comes to the current theory of evolution, scientists are writing checks that they simply are not capable of cashing.  While I don’t deny that it’s a tall order to expect the same sort of precision and results out of evolution that we get out of chemistry, physics, and yes, even economics – and no, my dear evolutionist, supply-side economics is absolutely NOT Austrian – that’s neither my responsibility nor my concern.\nBut I hope this continues to be an interesting discussion and I commend Scott, Pintopolis and other defenders of the discipline commenting here for the civil manner with which they have comported themselves.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-17T09:08:00+00:00"
}