{
  "url": "https://voxday.net/2007/08/27/it-has-begun-v/",
  "scraped_at": "2026-01-08T21:52:36.755112",
  "title": "It has begun V",
  "date_display": "August 27, 2007",
  "date_iso": "2007-08-27T18:12:00+00:00",
  "date_from_url": "2007-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In his <a href=\"http://monkeytrials.blogspot.com/2007/08/vox-de-bate-8-putting-tens-to-test.html\">two-part response</a>, Scott wisely and characteristically refrains from crowing over my “failure to provide another model, much less evidence for that model”, because a) this is a debate about a particular model, b) the absence of an alternative model is not indicative of the accuracy or even relevance of any model, and, c) he’s fundamentally nicer than I am.  Some people may argue with (b) based on what they call “abductive reasoning” but that is a logical fallacy as it amounts to nothing more than a pragmatic stopgap.  Although, as a sheerly pragmatic measure, I fully support the use of such “reasoning” when there’s nothing else to go on.</p><p>And although he appears to have backed away from some earlier concessions, Scott does appear to have begun to understand at least one aspect of my evolutionary skepticism when he writes:</p><blockquote><p>There is always the possibility that forces or agents other than natural selection could’ve been involved in individual cases, and so if we are going to start inferring that the large-scale changes we see in the fossil record are the sum of countless individual acts of selection which are themselves impossible to verify, we can sympathize with Vox’s skepticism.</p></blockquote><p>I don’t object to the use of inference.  Where else are you going to start?  I’m usually happy to begin looking into things with nothing more than a vague suspicion.  There is nothing in the least bit objectionable to taking a theory that has some obvious flaws, shaking the bugs out and making use of it to attack some age-old mysteries.  But the key word there is “begin”.</p><blockquote><p>Ideally, what we would want is a method of independently confirming that the morphological changes we see in the fossil record are actually the result of changes in the genetic makeup of the population, and clear evidence that these changes support an inference of common descent between different species. Happily, with the emerging science of genomics, we can do just that with many large-scale events.</p></blockquote><p>I’m not so sure that the last statement is true, but more on that later.  My problem with this is that Scott is still focused on staring at the past, and I am not at all convinced that he has fully understood the scientific imperative of providing a replicable test for a future-focused prediction rather than digging up historical support for a particular thesis.  Supporting an inference is nice, but it’s not replicable and in the end, it’s merely more backtesting.  Based on backtested predictions, one could make a much stronger case for the Biblical model than for TENS at this point, the former accurately “predicted” the discovery of the nonexistent Assyrians and the Hittites after all.</p><blockquote><p>In the previous post, I claimed that I was going to present a clear example of an independent test of morphological change being the result of evolution, and the sort of change that clearly supports an inference of common descent between two different species. The example I’ve chosen, the alleged descent with modification of modern chimpanzees and humans from a common ancestor, is just such an example.</p></blockquote><p>Scott’s example is the work done by Dr. Ken Miller, who posits the rather bizarre notion that evolution is not only busy creating new species by natural selection, but also making testable predictions.  This prediction – for which he shows no evidence of having been made prior to the test – is that “the common ancestor had 48 chromosomes (24 pairs) and humans carry a fused chromosome; or ancestor had 23 pairs and apes carry a split chromosome.”</p><p>Miller writes that the complete DNA sequence of the chimpanzee answers the question “where did we come from” because “Our second chromosome was produced by the head to head fusion of ape chromosomes 12 and 13, and the new primate and human data show the exact point at which those two chromosomes were pasted together.”</p><p>Now, this information certainly appears to support the inference, insofar as I understand genomics, which is not very far at all.  But the first of the two important points that Miller and Scott appear to be glossing over is that this doesn’t prove a common ancestor, it merely indicates that the theory of a common ancestor is not disproved by the evidence.  There is still no evidence that this “common ancestor” ever existed, it’s the genomic version of the “God of the gaps” argument.</p><p>The second point, of course, is that this is yet another example of the backtesting I have repeatedly protested.  Unless and until geneticists can turn a chimpanzee into a human by pasting together chromosomes 12 and 13, there is not only room for skepticism, but an amount of skepticism is required given the problems cropping up with far more established theories like General Relativity.</p><p>I’m not going to address Scott’s <a href=\"http://monkeytrials.blogspot.com/2007/08/vox-dei-bate-7.html\">previous post</a> about the differences in time scale accounting for the greater <a href=\"http://www.nhm.ac.uk/about-us/news/2007/august/news_12280.html\">margins of error</a> seen in evolutionary science versus other scientific disciplines because it simply isn’t true.  I’d be delighted to delve into demonstrating this at a later date, as it is much more familiar territory for me, but I think it’s an unnecessary digression because his subsequent response renders it largely irrelevant.</p><blockquote><p>I’m not sure this is a meaningful question for me, for two reasons: first, because I don’t have a commitment one way or the other against any future model; second, because it’s the wrong way to conceptualize the matter, that things will either be TENS-based or not. Here’s what I would say: evolution and natural selection are both facts, and in particular cases a relationship between these two facts has been demonstrated, while in general cases it is inferred on the basis of multiple lines of evidence. Any future alternative to the present model will have to account for all the facts currently in our possession, and among those facts are evolution, and natural selection.</p></blockquote><p>I think Scott is being a little too conservative here.  When there is a fundamental problem with a theory, even a fairly small problem with a functional theory upon which good science has been based for decades, it seems to me that historically, a radically different replacement theory is nearly as likely as one that is merely a minor tweak.  Those whose historical interests incline more to science than mine can surely provide examples either in support or in contradiction, but that’s my impression.</p><p>Despite our varying degrees of trust in TENS, I think we are nevertheless beginning to find some common ground.  I’m particularly interested to discover where Scott is going with the following statement; no doubt many of you are too:</p><blockquote><p>I think this observation has some bearing on some issues that Vox has raised in the past few posts as to how some ‘evolutionists’ have enlisted Darwin to ‘attack religious faith’, ridicule politicians who fail to say they ‘believe in evolution’, or attempt to suppress skepticism about TENS as unscientific.</p></blockquote><p>It wouldn’t be fair to refrain from answering one of Scott’s direct questions, though.  As an economist, I can safely predict that the commodity price of one ounce of gold one thousand years from now will be the equivalent of one respectable man’s suit or future equivalent.  Unfortunately, I can’t predict the particular currency because USD in its present form will be defunct within 36 years.</p></div>",
  "content_text": "In his\ntwo-part response\n, Scott wisely and characteristically refrains from crowing over my “failure to provide another model, much less evidence for that model”, because a) this is a debate about a particular model, b) the absence of an alternative model is not indicative of the accuracy or even relevance of any model, and, c) he’s fundamentally nicer than I am.  Some people may argue with (b) based on what they call “abductive reasoning” but that is a logical fallacy as it amounts to nothing more than a pragmatic stopgap.  Although, as a sheerly pragmatic measure, I fully support the use of such “reasoning” when there’s nothing else to go on.\nAnd although he appears to have backed away from some earlier concessions, Scott does appear to have begun to understand at least one aspect of my evolutionary skepticism when he writes:\nThere is always the possibility that forces or agents other than natural selection could’ve been involved in individual cases, and so if we are going to start inferring that the large-scale changes we see in the fossil record are the sum of countless individual acts of selection which are themselves impossible to verify, we can sympathize with Vox’s skepticism.\nI don’t object to the use of inference.  Where else are you going to start?  I’m usually happy to begin looking into things with nothing more than a vague suspicion.  There is nothing in the least bit objectionable to taking a theory that has some obvious flaws, shaking the bugs out and making use of it to attack some age-old mysteries.  But the key word there is “begin”.\nIdeally, what we would want is a method of independently confirming that the morphological changes we see in the fossil record are actually the result of changes in the genetic makeup of the population, and clear evidence that these changes support an inference of common descent between different species. Happily, with the emerging science of genomics, we can do just that with many large-scale events.\nI’m not so sure that the last statement is true, but more on that later.  My problem with this is that Scott is still focused on staring at the past, and I am not at all convinced that he has fully understood the scientific imperative of providing a replicable test for a future-focused prediction rather than digging up historical support for a particular thesis.  Supporting an inference is nice, but it’s not replicable and in the end, it’s merely more backtesting.  Based on backtested predictions, one could make a much stronger case for the Biblical model than for TENS at this point, the former accurately “predicted” the discovery of the nonexistent Assyrians and the Hittites after all.\nIn the previous post, I claimed that I was going to present a clear example of an independent test of morphological change being the result of evolution, and the sort of change that clearly supports an inference of common descent between two different species. The example I’ve chosen, the alleged descent with modification of modern chimpanzees and humans from a common ancestor, is just such an example.\nScott’s example is the work done by Dr. Ken Miller, who posits the rather bizarre notion that evolution is not only busy creating new species by natural selection, but also making testable predictions.  This prediction – for which he shows no evidence of having been made prior to the test – is that “the common ancestor had 48 chromosomes (24 pairs) and humans carry a fused chromosome; or ancestor had 23 pairs and apes carry a split chromosome.”\nMiller writes that the complete DNA sequence of the chimpanzee answers the question “where did we come from” because “Our second chromosome was produced by the head to head fusion of ape chromosomes 12 and 13, and the new primate and human data show the exact point at which those two chromosomes were pasted together.”\nNow, this information certainly appears to support the inference, insofar as I understand genomics, which is not very far at all.  But the first of the two important points that Miller and Scott appear to be glossing over is that this doesn’t prove a common ancestor, it merely indicates that the theory of a common ancestor is not disproved by the evidence.  There is still no evidence that this “common ancestor” ever existed, it’s the genomic version of the “God of the gaps” argument.\nThe second point, of course, is that this is yet another example of the backtesting I have repeatedly protested.  Unless and until geneticists can turn a chimpanzee into a human by pasting together chromosomes 12 and 13, there is not only room for skepticism, but an amount of skepticism is required given the problems cropping up with far more established theories like General Relativity.\nI’m not going to address Scott’s\nprevious post\nabout the differences in time scale accounting for the greater\nmargins of error\nseen in evolutionary science versus other scientific disciplines because it simply isn’t true.  I’d be delighted to delve into demonstrating this at a later date, as it is much more familiar territory for me, but I think it’s an unnecessary digression because his subsequent response renders it largely irrelevant.\nI’m not sure this is a meaningful question for me, for two reasons: first, because I don’t have a commitment one way or the other against any future model; second, because it’s the wrong way to conceptualize the matter, that things will either be TENS-based or not. Here’s what I would say: evolution and natural selection are both facts, and in particular cases a relationship between these two facts has been demonstrated, while in general cases it is inferred on the basis of multiple lines of evidence. Any future alternative to the present model will have to account for all the facts currently in our possession, and among those facts are evolution, and natural selection.\nI think Scott is being a little too conservative here.  When there is a fundamental problem with a theory, even a fairly small problem with a functional theory upon which good science has been based for decades, it seems to me that historically, a radically different replacement theory is nearly as likely as one that is merely a minor tweak.  Those whose historical interests incline more to science than mine can surely provide examples either in support or in contradiction, but that’s my impression.\nDespite our varying degrees of trust in TENS, I think we are nevertheless beginning to find some common ground.  I’m particularly interested to discover where Scott is going with the following statement; no doubt many of you are too:\nI think this observation has some bearing on some issues that Vox has raised in the past few posts as to how some ‘evolutionists’ have enlisted Darwin to ‘attack religious faith’, ridicule politicians who fail to say they ‘believe in evolution’, or attempt to suppress skepticism about TENS as unscientific.\nIt wouldn’t be fair to refrain from answering one of Scott’s direct questions, though.  As an economist, I can safely predict that the commodity price of one ounce of gold one thousand years from now will be the equivalent of one respectable man’s suit or future equivalent.  Unfortunately, I can’t predict the particular currency because USD in its present form will be defunct within 36 years.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-27T17:12:00+00:00"
}