{
  "url": "https://voxday.net/2007/08/30/it-has-begun-vi/",
  "scraped_at": "2026-01-08T21:52:49.581388",
  "title": "It has begun VI",
  "date_display": "August 30, 2007",
  "date_iso": "2007-08-30T11:27:00+00:00",
  "date_from_url": "2007-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Prior to responding to my previous post, Scott makes a significant and entirely relevant digression in <a href=\"http://monkeytrials.blogspot.com/2007/08/vox-dei-bate-9.html\">his 9th debate post</a>.  I’ll confirm and clarify a few of his points here:</p><blockquote><p>I don’t believe that any of the above concerns are scientific questions, regardless of where we might stand. They are cultural concerns, and often politicized. The concerns as raised could be true, they could be false, but they would have no bearing on the question of whether or not TENS is the best model we have now, or likely to be the best model we have in the future.</p><p>Secondly, Vox has been very open about his lack of formal education in biology, particularly evolutionary biology, and much of his acknowledged sources are popularizations.  (For all I know, two of the Dawkins books that Vox refers to could be The Selfish Gene (1976) or The Extended Phenotype (1982), which are deep, far-reaching books that, while accessible to laymen, can not really be said to be popularizations.)</p></blockquote><p>I completely agree with the former statement.  One of the books is indeed <em>The Selfish Gene</em>.  However, it’s worth pointing out that I have the precisely the sort of formal school education in science, biology and evolutionary biology that evolutionary biologists such as Dr. PZ Myers and Dr. Richard Dawkins claim is so necessary in the public schools.  My ignorance of evolution, TENs and Darwin is certainly deep in comparison with Scott’s professional knowledge, but is probably far exceeded by that of many of my science-fetishist critics.</p><blockquote><p>This feeds my impression that Vox’s skepticism with respect to evolution is not so much with the discipline of evolutionary biology as practiced, but with the baggage that comes with books that are as much works of advocacy as they are expositions of science, especially those by Dawkins. In fact, I think that his beef is largely with Dawkins, especially Dawkins the popularizer of ‘evolution-as-another-nail-in-religion’s-coffin’, who first makes a distinctive appearance in The Blind Watchmaker (1986).</p></blockquote><p>Absolutely.  However, my distaste for evolutionary theory was not based on a reaction to Dawkins, or even atheism in general, in fact, my first encounter with serious Darwinist philosophy was in my formal education as an economist under some socialist professors.  This is why my hard-core opposition to Darwinist materialism has never been rooted in my Christian faith, but rather in my economics background.  I was a staunch anti-Darwinist before I was a Christian and long before I’d ever heard of Richard Dawkins due to my education in socialist economics.</p><blockquote><p>In fact, based on my experiences as a teacher, I believe that the misconceptions attached to the theory in the popular culture are at least as much of a barrier to its acceptance as any prior theological commitments on the part of its audience.</p></blockquote><p>I agree, and I think it does a real disservice to science for Darwinists to always assume that intellectual opposition to TENS and Darwinism is rooted in religion.  This is a very parochial Anglo view; in continental Europe there appears to be a greater tendency to at least pay nominal attention to what the opposition is saying.  However, I would say that it is not “misconceptions attached to the theory” that are a significant barrier to its acceptance as “misapplications of the theory”.</p><blockquote><p>Besides, it’s not really the science that bothers him. Vox understands that scientific claims are always tentative, always subject to review/modification/rejection in the light of new findings. He clearly is not losing sleep at night because the silly biologists who can’t predict things the way they do in his field of economics don’t have a better model. No, what gets Vox exercised is the uses to which the ‘evolutionists’ he knows about put that model. And that usage is clearly atheism.</p></blockquote><p>Atheism is only one of them.  Socialism is another, eugenics is a third.  I’m sure I could come up with more.  Although it is pretty annoying when one criticizes a hopelessly unscientific tale of historic fiction for its complete lack of science, only to be told that you just don’t understand science.</p><blockquote><p>Evolutionary biology might not ‘disprove’ God, but it cripples one of the better arguments that historically has been made for God’s existence in the past, that of teleology. It provided the conceptual framework and the data to justify Hume’s famous skepticism: no one who understands the history of this debate can be considered credible who does not acknowledge the devastating effect that Darwin’s thought has on teleology.</p></blockquote><p>Yes, and this is where half of the strong Darwinist link with Marxism is forged.  Marxism is dependent upon a materialist point of view, and Darwinism offers a platform for that.</p><blockquote><p>I could care less about that myself because, as should now be clear, whenever Dawkins steps out of his evolutionary theorizing to argue toward God’s non-existence, he is no longer doing science.</p></blockquote><p>YES!  EXACTLY!  This is why I refer to him in TIA as “Darwin’s Judas”.  Dawkins is arguably doing more harm to Darwin and the public acceptance of evolution than anyone since Friedrich Engels.</p><blockquote><p>It’s that word ‘believe’ that I object to. Properly speaking, I don’t ‘believe’ in evolution, either: that implies an affirmation of faith, but I don’t need faith to accept that evolution is a fact, or that natural selection is a fact, or that in individual cases natural selection has been observed to lead to evolution, etc…. The question that was put to the GOP hopefuls many weeks back was crude to the point of being misleading, but (sigh) politics is often not about making logical arguments that use language properly, right? It’s a shame that not one of them had the sophistication to point out the absurdity of the question, and in the process affirm that evolution is good science.</p></blockquote><p>I don’t think Scott fully grasps that this is the way evolutionary skeptics are addressed and attacked 95 percent of the time.  It’s unusual to speak with a scientist who makes measured claims, far more often one is in contact with either science fetishists or extremists like Dawkins and Myers.  I don’t “believe” in evolution and I probably never will.</p><blockquote><p>I think that what partially motivates Vox’s skepticism is his distaste for Dawkins and his disciples, what informs his actual argument is his understanding of theories. His ‘back-testing’ argument is an attempt to argue that, see, evolution can’t do some of the things I think a truly scientific theory ought to do, so, while it can do some things, I feel justified in being skeptical about those things that can’t be tested until I can see more confirmed predictions to a higher level of accuracy.</p></blockquote><p>Pretty much, although I’d like to point out that I am no defender of those superior macroeconomic models, I have attacked them longer and more viciously than I’ve ever attacked evolution.  The main difference is that economists, even econometricians, will readily admit that their models are piss-poor and badly need improvement before they can be seriously relied upon – the politicians, Larry Kudlow and the Federal Reserve notwithstanding.  I have never heard an evolutionist admit the same.</p><blockquote><p>I suspect that Vox and I are in substantive agreement that TENS is the only game in town, and that he is not actually urging anyone to reject TENS outright. Rather, he is skeptical about the applications of TENS to those things which are difficult or impossible to test, and deeply resents those who would employ such applications as personal weapons in the cultural wars. I sympathize, but I’m not here to defend such practicies, I’m here to defend TENS.</p></blockquote><p>Yes, pretty much.  I am still skeptical<br> about TENS for the reasons  that we will continue to discuss, as I think I can convince Scott that the backtesting issue is a genuine problem, but TENS is the only serious game in town at the moment and I am in no way opposed to its continued refinement and application in the field of biology.  The point that people seem to always miss is that I never have been.</br></p></div>",
  "content_text": "Prior to responding to my previous post, Scott makes a significant and entirely relevant digression in\nhis 9th debate post\n.  I’ll confirm and clarify a few of his points here:\nI don’t believe that any of the above concerns are scientific questions, regardless of where we might stand. They are cultural concerns, and often politicized. The concerns as raised could be true, they could be false, but they would have no bearing on the question of whether or not TENS is the best model we have now, or likely to be the best model we have in the future.\nSecondly, Vox has been very open about his lack of formal education in biology, particularly evolutionary biology, and much of his acknowledged sources are popularizations.  (For all I know, two of the Dawkins books that Vox refers to could be The Selfish Gene (1976) or The Extended Phenotype (1982), which are deep, far-reaching books that, while accessible to laymen, can not really be said to be popularizations.)\nI completely agree with the former statement.  One of the books is indeed\nThe Selfish Gene\n.  However, it’s worth pointing out that I have the precisely the sort of formal school education in science, biology and evolutionary biology that evolutionary biologists such as Dr. PZ Myers and Dr. Richard Dawkins claim is so necessary in the public schools.  My ignorance of evolution, TENs and Darwin is certainly deep in comparison with Scott’s professional knowledge, but is probably far exceeded by that of many of my science-fetishist critics.\nThis feeds my impression that Vox’s skepticism with respect to evolution is not so much with the discipline of evolutionary biology as practiced, but with the baggage that comes with books that are as much works of advocacy as they are expositions of science, especially those by Dawkins. In fact, I think that his beef is largely with Dawkins, especially Dawkins the popularizer of ‘evolution-as-another-nail-in-religion’s-coffin’, who first makes a distinctive appearance in The Blind Watchmaker (1986).\nAbsolutely.  However, my distaste for evolutionary theory was not based on a reaction to Dawkins, or even atheism in general, in fact, my first encounter with serious Darwinist philosophy was in my formal education as an economist under some socialist professors.  This is why my hard-core opposition to Darwinist materialism has never been rooted in my Christian faith, but rather in my economics background.  I was a staunch anti-Darwinist before I was a Christian and long before I’d ever heard of Richard Dawkins due to my education in socialist economics.\nIn fact, based on my experiences as a teacher, I believe that the misconceptions attached to the theory in the popular culture are at least as much of a barrier to its acceptance as any prior theological commitments on the part of its audience.\nI agree, and I think it does a real disservice to science for Darwinists to always assume that intellectual opposition to TENS and Darwinism is rooted in religion.  This is a very parochial Anglo view; in continental Europe there appears to be a greater tendency to at least pay nominal attention to what the opposition is saying.  However, I would say that it is not “misconceptions attached to the theory” that are a significant barrier to its acceptance as “misapplications of the theory”.\nBesides, it’s not really the science that bothers him. Vox understands that scientific claims are always tentative, always subject to review/modification/rejection in the light of new findings. He clearly is not losing sleep at night because the silly biologists who can’t predict things the way they do in his field of economics don’t have a better model. No, what gets Vox exercised is the uses to which the ‘evolutionists’ he knows about put that model. And that usage is clearly atheism.\nAtheism is only one of them.  Socialism is another, eugenics is a third.  I’m sure I could come up with more.  Although it is pretty annoying when one criticizes a hopelessly unscientific tale of historic fiction for its complete lack of science, only to be told that you just don’t understand science.\nEvolutionary biology might not ‘disprove’ God, but it cripples one of the better arguments that historically has been made for God’s existence in the past, that of teleology. It provided the conceptual framework and the data to justify Hume’s famous skepticism: no one who understands the history of this debate can be considered credible who does not acknowledge the devastating effect that Darwin’s thought has on teleology.\nYes, and this is where half of the strong Darwinist link with Marxism is forged.  Marxism is dependent upon a materialist point of view, and Darwinism offers a platform for that.\nI could care less about that myself because, as should now be clear, whenever Dawkins steps out of his evolutionary theorizing to argue toward God’s non-existence, he is no longer doing science.\nYES!  EXACTLY!  This is why I refer to him in TIA as “Darwin’s Judas”.  Dawkins is arguably doing more harm to Darwin and the public acceptance of evolution than anyone since Friedrich Engels.\nIt’s that word ‘believe’ that I object to. Properly speaking, I don’t ‘believe’ in evolution, either: that implies an affirmation of faith, but I don’t need faith to accept that evolution is a fact, or that natural selection is a fact, or that in individual cases natural selection has been observed to lead to evolution, etc…. The question that was put to the GOP hopefuls many weeks back was crude to the point of being misleading, but (sigh) politics is often not about making logical arguments that use language properly, right? It’s a shame that not one of them had the sophistication to point out the absurdity of the question, and in the process affirm that evolution is good science.\nI don’t think Scott fully grasps that this is the way evolutionary skeptics are addressed and attacked 95 percent of the time.  It’s unusual to speak with a scientist who makes measured claims, far more often one is in contact with either science fetishists or extremists like Dawkins and Myers.  I don’t “believe” in evolution and I probably never will.\nI think that what partially motivates Vox’s skepticism is his distaste for Dawkins and his disciples, what informs his actual argument is his understanding of theories. His ‘back-testing’ argument is an attempt to argue that, see, evolution can’t do some of the things I think a truly scientific theory ought to do, so, while it can do some things, I feel justified in being skeptical about those things that can’t be tested until I can see more confirmed predictions to a higher level of accuracy.\nPretty much, although I’d like to point out that I am no defender of those superior macroeconomic models, I have attacked them longer and more viciously than I’ve ever attacked evolution.  The main difference is that economists, even econometricians, will readily admit that their models are piss-poor and badly need improvement before they can be seriously relied upon – the politicians, Larry Kudlow and the Federal Reserve notwithstanding.  I have never heard an evolutionist admit the same.\nI suspect that Vox and I are in substantive agreement that TENS is the only game in town, and that he is not actually urging anyone to reject TENS outright. Rather, he is skeptical about the applications of TENS to those things which are difficult or impossible to test, and deeply resents those who would employ such applications as personal weapons in the cultural wars. I sympathize, but I’m not here to defend such practicies, I’m here to defend TENS.\nYes, pretty much.  I am still skeptical\nabout TENS for the reasons  that we will continue to discuss, as I think I can convince Scott that the backtesting issue is a genuine problem, but TENS is the only serious game in town at the moment and I am in no way opposed to its continued refinement and application in the field of biology.  The point that people seem to always miss is that I never have been.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-30T10:27:00+00:00"
}