{
  "url": "https://voxday.net/2007/08/03/more-money-more-cats/",
  "scraped_at": "2026-01-08T21:50:16.187272",
  "title": "More money, more cats",
  "date_display": "August 3, 2007",
  "date_iso": "2007-08-03T08:23:00+00:00",
  "date_from_url": "2007-08-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I believe I may have mentioned a few of the obvious results of the <a href=\"http://www.nytimes.com/2007/08/03/nyregion/03women.html?_r=1&amp;hp&amp;oref=slogin\">doubling of the female percentage</a> of the workforce in the past.  I wonder how many people who rejected my citation of the BLS data will believe it now that the New York Times has seen fit to mention it:</p><blockquote><p>Though Dr. Beveridge’s analysis showed women making strides, it also showed that men were in some ways moving backward. <b>Among all men — including those with college degrees — real wages, adjusted for inflation, have declined since 1970.</b> And among full-time workers with advanced degrees, wages for men increased only marginally even as they soared for women. Nationally, men’s wages in general declined while women’s remained the same.</p><p>Several experts also said that rising income for women might affect marriage rates if women expect their mates to have at least equivalent salaries and education.</p><p>“When New York college women say there are few eligible men around, they’re right if they mean they’ll only settle for someone with an education akin to their own,” Professor Hacker said.</p></blockquote><p>Fortunately, the nation is not New York.  I do find it interesting, though, that of all the women I knew who went to live in New York after college or graduate school, only one of them is married even though none of them are still in New York.</p><p>As for wages, the peak was 1972.  That was because the number of 55+ men leaving the workforce was finally surpassed by the number of women entering it.  We have fundamentally altered the composition of our workforce in order to permit women to delay having children for a decade or more and for older men to play golf.  Whether you think this has been a bad deal for women depends on your perspective.  It’s been a good thing for women who want to remain single, make Powerpoint slideshows and live with their cats.  It’s been a bad thing for women who want to get married, have children and stay home raise them, because their husbands make less money and find it more difficult to support a family on a single salary.</p><p>I leave it to you to decide which perspective is more in line with a stable social structure.</p></div>",
  "content_text": "I believe I may have mentioned a few of the obvious results of the\ndoubling of the female percentage\nof the workforce in the past.  I wonder how many people who rejected my citation of the BLS data will believe it now that the New York Times has seen fit to mention it:\nThough Dr. Beveridge’s analysis showed women making strides, it also showed that men were in some ways moving backward.\nAmong all men — including those with college degrees — real wages, adjusted for inflation, have declined since 1970.\nAnd among full-time workers with advanced degrees, wages for men increased only marginally even as they soared for women. Nationally, men’s wages in general declined while women’s remained the same.\nSeveral experts also said that rising income for women might affect marriage rates if women expect their mates to have at least equivalent salaries and education.\n“When New York college women say there are few eligible men around, they’re right if they mean they’ll only settle for someone with an education akin to their own,” Professor Hacker said.\nFortunately, the nation is not New York.  I do find it interesting, though, that of all the women I knew who went to live in New York after college or graduate school, only one of them is married even though none of them are still in New York.\nAs for wages, the peak was 1972.  That was because the number of 55+ men leaving the workforce was finally surpassed by the number of women entering it.  We have fundamentally altered the composition of our workforce in order to permit women to delay having children for a decade or more and for older men to play golf.  Whether you think this has been a bad deal for women depends on your perspective.  It’s been a good thing for women who want to remain single, make Powerpoint slideshows and live with their cats.  It’s been a bad thing for women who want to get married, have children and stay home raise them, because their husbands make less money and find it more difficult to support a family on a single salary.\nI leave it to you to decide which perspective is more in line with a stable social structure.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-03T07:23:00+00:00"
}