{
  "url": "https://voxday.net/2007/08/14/multi-threaded-brains/",
  "scraped_at": "2026-01-08T21:51:23.141138",
  "title": "Multi-threaded brains",
  "date_display": "August 14, 2007",
  "date_iso": "2007-08-14T08:45:00+00:00",
  "date_from_url": "2007-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Kupelian’s article on psychotropic drugs has <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=57143\">an interesting section on “hallucinations”</a>:</p><blockquote><p>a quarter century ago, the chief psychologist at a major California mental hospital conducted an extraordinary study of the inner voices patients heard. Wilson Van Dusen worked among the mentally ill for 17 years at the Mendocino State Hospital – originally Mendocino State Asylum for the Insane – established in 1889.</p><p>In his treatise, titled “<a href=\"http://www.searchwithin.org/download/presence_spirits.pdf\">The Presence of Spirits in Madness</a>,” Van Dusen provided a window into the inner experience of his patients’ “hallucinations.” Note that these were not criminally insane people who had perpetrated violent acts, but rather were simply “mentally ill” individuals who had been committed to the institution. So their condition was not as serious or dangerous as that of the criminal perpetrators referenced earlier.</p><p>“Out of my professional role as a clinical psychologist in a state mental hospital and my own personal interest, I set out to describe as faithfully as possible mental patients’ experiences of hallucinations,” he wrote:</p><p>The average layman’s picture of the mentally ill as raving lunatics is far from reality. Most of these people have become entangled in inner processes and simply fail to manage their lives well.</p><p>After dealing with hundreds of such patients, I discovered about four years ago that it was possible to speak to their hallucinations. To do so I looked for patients who could distinguish between their own thoughts and the things they heard and saw in the world of hallucinations. The patient was told that I simply wanted to get as accurate a description of their experiences as possible. I held out no hope for recovery or special reward. It soon became apparent that many were embarrassed by what they saw and heard and hence they concealed it from others.</p><p>Also they knew their experiences were not shared by others, and some were even concerned that their reputations would suffer if they revealed the obscene nature of their voices. It took some care to make the patients comfortable enough to reveal their experience honestly. A further complication was that the voices were sometimes frightened of me and themselves needed reassurance. I struck up a relationship with both the patient and the persons he saw and heard. I would question these other persons directly, and instructed the patient to give a word-for-word account of what the voices answered or what was seen. In this way I could hold long dialogues with a patient’s hallucinations and record both my questions and their answers.</p><p>One consistent finding was that patients felt they had contact with another world or order of beings. Most thought these other persons were living persons. All objected to the term hallucination. Each coined his own term such as The Other Order, the Eavesdroppers, etc.</p><p>For most individuals the hallucinations came on suddenly. One woman was working in a garden when an unseen man addressed her. Another man described sudden loud noises and voices he heard while riding in a bus. Most were frightened, and adjusted with difficulty to this new experience. All patients describe voices as having the quality of a real voice, sometimes louder, sometimes softer, than normal voices. The experience they describe is quite unlike thoughts or fantasies. When things are seen they appear fully real. … Most patients soon realize that they are having experiences that others do not share, and for this reason learn to keep quiet about them. Many suffer insults, threats and attacks for years from voices with no one around them aware of it. Women have reported hearing such vile things they felt it would reflect on them should they even be mentioned.</p><p>… Lower order voices are as though one is dealing with drunken bums at a bar who like to tease and torment just for the fun of it. They will suggest lewd acts and then scold the patient for considering them. They find a weak point of conscience and work on it interminably. For instance, one man heard voices teasing him for three years over a ten-cent debt he had already paid. They call the patient every conceivable name, suggest every lewd act, steal memories or ideas right out of consciousness, threaten death, and work on the patient’s credibility in every way. For instance they will brag that they will produce some disaster on the morrow and then claim honor for one in the daily paper. They suggest foolish acts (such as: Raise your right hand in the air and stay that way) and tease if he does it and threaten him if he doesn’t. The lower order can work for a long time to possess some part of the patient’s body. Several worked on the ear and the patient seemed to grow deafer. One voice worked two years to capture a patient’s eye which visibly went out of alignment. Many patients have heard loud and clear voices plotting their death for weeks on end, an apparently nerve-wracking experience. One patient saw a noose around his neck which tied to “I don’t know what” while voices plotted his death by hanging. They threaten pain and can cause felt pain as a way of enforcing their power. The most devastating experience of all is to be shouted at constantly by dozens of voices. When this occurred the patient had to be sedated.</p><p>All of the lower order are irreligious or anti-religious. Some actively interfered with the patients’ religious practices. Most considered them to be ordinary living people, though once they appeared as conventional devils and referred to themselves as demons. In a few instances they referred to themselves as from hell. Occasionally they would speak through the patient so that the patient’s voice and speech would be directly those of the voices. Sometimes they acted through the patient.</p></blockquote><p>The interesting thing is that the current state of science insists that these things cannot exist, even though by the current state of science, there is no material evidence for the primary consciousness to which these other “voices” are attributed.  The Biblical explanation of demons is not the only one, of course, it is theoretically possible that everyone has multiple “programs” in their brain but most people only run a single thread while those who hear voices are capable of multi-threaded operations.</p><p>Anyhow, if I was studying consciousness, this is one of the areas where I’d be focused.  Science, I am increasingly beginning to suspect, is somewhat like weightlifting.  It tends to focus where the results are easiest and the gains come most quickly instead of where it is least competent.  This is natural, but it does tend to lead to the mistaken impression that scientage is more developed across a broad spectrum than it actually is.</p></div>",
  "content_text": "David Kupelian’s article on psychotropic drugs has\nan interesting section on “hallucinations”\n:\na quarter century ago, the chief psychologist at a major California mental hospital conducted an extraordinary study of the inner voices patients heard. Wilson Van Dusen worked among the mentally ill for 17 years at the Mendocino State Hospital – originally Mendocino State Asylum for the Insane – established in 1889.\nIn his treatise, titled “\nThe Presence of Spirits in Madness\n,” Van Dusen provided a window into the inner experience of his patients’ “hallucinations.” Note that these were not criminally insane people who had perpetrated violent acts, but rather were simply “mentally ill” individuals who had been committed to the institution. So their condition was not as serious or dangerous as that of the criminal perpetrators referenced earlier.\n“Out of my professional role as a clinical psychologist in a state mental hospital and my own personal interest, I set out to describe as faithfully as possible mental patients’ experiences of hallucinations,” he wrote:\nThe average layman’s picture of the mentally ill as raving lunatics is far from reality. Most of these people have become entangled in inner processes and simply fail to manage their lives well.\nAfter dealing with hundreds of such patients, I discovered about four years ago that it was possible to speak to their hallucinations. To do so I looked for patients who could distinguish between their own thoughts and the things they heard and saw in the world of hallucinations. The patient was told that I simply wanted to get as accurate a description of their experiences as possible. I held out no hope for recovery or special reward. It soon became apparent that many were embarrassed by what they saw and heard and hence they concealed it from others.\nAlso they knew their experiences were not shared by others, and some were even concerned that their reputations would suffer if they revealed the obscene nature of their voices. It took some care to make the patients comfortable enough to reveal their experience honestly. A further complication was that the voices were sometimes frightened of me and themselves needed reassurance. I struck up a relationship with both the patient and the persons he saw and heard. I would question these other persons directly, and instructed the patient to give a word-for-word account of what the voices answered or what was seen. In this way I could hold long dialogues with a patient’s hallucinations and record both my questions and their answers.\nOne consistent finding was that patients felt they had contact with another world or order of beings. Most thought these other persons were living persons. All objected to the term hallucination. Each coined his own term such as The Other Order, the Eavesdroppers, etc.\nFor most individuals the hallucinations came on suddenly. One woman was working in a garden when an unseen man addressed her. Another man described sudden loud noises and voices he heard while riding in a bus. Most were frightened, and adjusted with difficulty to this new experience. All patients describe voices as having the quality of a real voice, sometimes louder, sometimes softer, than normal voices. The experience they describe is quite unlike thoughts or fantasies. When things are seen they appear fully real. … Most patients soon realize that they are having experiences that others do not share, and for this reason learn to keep quiet about them. Many suffer insults, threats and attacks for years from voices with no one around them aware of it. Women have reported hearing such vile things they felt it would reflect on them should they even be mentioned.\n… Lower order voices are as though one is dealing with drunken bums at a bar who like to tease and torment just for the fun of it. They will suggest lewd acts and then scold the patient for considering them. They find a weak point of conscience and work on it interminably. For instance, one man heard voices teasing him for three years over a ten-cent debt he had already paid. They call the patient every conceivable name, suggest every lewd act, steal memories or ideas right out of consciousness, threaten death, and work on the patient’s credibility in every way. For instance they will brag that they will produce some disaster on the morrow and then claim honor for one in the daily paper. They suggest foolish acts (such as: Raise your right hand in the air and stay that way) and tease if he does it and threaten him if he doesn’t. The lower order can work for a long time to possess some part of the patient’s body. Several worked on the ear and the patient seemed to grow deafer. One voice worked two years to capture a patient’s eye which visibly went out of alignment. Many patients have heard loud and clear voices plotting their death for weeks on end, an apparently nerve-wracking experience. One patient saw a noose around his neck which tied to “I don’t know what” while voices plotted his death by hanging. They threaten pain and can cause felt pain as a way of enforcing their power. The most devastating experience of all is to be shouted at constantly by dozens of voices. When this occurred the patient had to be sedated.\nAll of the lower order are irreligious or anti-religious. Some actively interfered with the patients’ religious practices. Most considered them to be ordinary living people, though once they appeared as conventional devils and referred to themselves as demons. In a few instances they referred to themselves as from hell. Occasionally they would speak through the patient so that the patient’s voice and speech would be directly those of the voices. Sometimes they acted through the patient.\nThe interesting thing is that the current state of science insists that these things cannot exist, even though by the current state of science, there is no material evidence for the primary consciousness to which these other “voices” are attributed.  The Biblical explanation of demons is not the only one, of course, it is theoretically possible that everyone has multiple “programs” in their brain but most people only run a single thread while those who hear voices are capable of multi-threaded operations.\nAnyhow, if I was studying consciousness, this is one of the areas where I’d be focused.  Science, I am increasingly beginning to suspect, is somewhat like weightlifting.  It tends to focus where the results are easiest and the gains come most quickly instead of where it is least competent.  This is natural, but it does tend to lead to the mistaken impression that scientage is more developed across a broad spectrum than it actually is.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-14T07:45:00+00:00"
}