{
  "url": "https://voxday.net/2007/08/24/myopic-dr-myers/",
  "scraped_at": "2026-01-08T21:52:11.372804",
  "title": "The myopic Dr. Myers",
  "date_display": "August 24, 2007",
  "date_iso": "2007-08-24T09:37:00+00:00",
  "date_from_url": "2007-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ asks <a href=\"http://scienceblogs.com/pharyngula/2007/08/another_example_of_amoral_reli.php#comments\">an incredibly stupid question</a>:</p><blockquote><p>Out of curiosity, I’d just like to know … how many recent instances are there of atheists using death threats, threats against family members, and various other kinds of intimidation to discourage Christians from openly professing their beliefs?</p></blockquote><p>Let’s see, there’s the tens of thousands of Christians being held in Korean death camps like <a href=\"http://en.wikipedia.org/wiki/Camp_22\">Camp 22</a>, there’s the pastors being jailed and beaten in Cuba, the Christians being killed, jailed and imprisoned in the laogai of China, Laos and Vietnam.  Forget “openly professing their beliefs”, four of these atheist-run states are actively engaged in murderous oppression of Christians for the mere “possession” of their beliefs.</p><p>Here is <a href=\"http://www.prisoneralert.com/\">a list of a few of the Christians</a> currently being “discouraged” by atheists.  This is the list of countries where Christians are currently confirmed to be persecuted:</p><p>Afghanistan, Cyprus, Maldives, Sri Lanka, Algeria, Egypt, Mauritania, Sudan, Azerbaijan, Equatorial Guinea, Morocco, Syria, Bangladesh, Ethiopia, Myanmar (Burma), Tajikistan, Bhutan, India, Nepal, Tibet (China), Brunei, Indonesia, Nigeria, Tunisia, Chechnya, Iran, North Korea, Turkey, Chiapas, Iraq, Oman, Turkmenistan, China, Kuwait, Pakistan, United Arab Emirates, Colombia, Laos, Qatar, Uzbekistan, Comoro Islands, Libya, Saudi Arabia, Vietnam, Cuba, Malaysia, Somalia, Yemen.</p><p>Obviously, there are more examples of Muslim states persecuting Christians today, on the other hand, a higher percentage atheist-run government are currently doing so.  Now, where are atheists being murdered and jailed for their atheism?</p><p>UPDATE – After viewing the video, I would say there’s little chance of these “threats” being genuine anyhow.  All that was missing was the Clintonian lip bite.</p></div>",
  "content_text": "PZ asks\nan incredibly stupid question\n:\nOut of curiosity, I’d just like to know … how many recent instances are there of atheists using death threats, threats against family members, and various other kinds of intimidation to discourage Christians from openly professing their beliefs?\nLet’s see, there’s the tens of thousands of Christians being held in Korean death camps like\nCamp 22\n, there’s the pastors being jailed and beaten in Cuba, the Christians being killed, jailed and imprisoned in the laogai of China, Laos and Vietnam.  Forget “openly professing their beliefs”, four of these atheist-run states are actively engaged in murderous oppression of Christians for the mere “possession” of their beliefs.\nHere is\na list of a few of the Christians\ncurrently being “discouraged” by atheists.  This is the list of countries where Christians are currently confirmed to be persecuted:\nAfghanistan, Cyprus, Maldives, Sri Lanka, Algeria, Egypt, Mauritania, Sudan, Azerbaijan, Equatorial Guinea, Morocco, Syria, Bangladesh, Ethiopia, Myanmar (Burma), Tajikistan, Bhutan, India, Nepal, Tibet (China), Brunei, Indonesia, Nigeria, Tunisia, Chechnya, Iran, North Korea, Turkey, Chiapas, Iraq, Oman, Turkmenistan, China, Kuwait, Pakistan, United Arab Emirates, Colombia, Laos, Qatar, Uzbekistan, Comoro Islands, Libya, Saudi Arabia, Vietnam, Cuba, Malaysia, Somalia, Yemen.\nObviously, there are more examples of Muslim states persecuting Christians today, on the other hand, a higher percentage atheist-run government are currently doing so.  Now, where are atheists being murdered and jailed for their atheism?\nUPDATE – After viewing the video, I would say there’s little chance of these “threats” being genuine anyhow.  All that was missing was the Clintonian lip bite.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-24T08:37:00+00:00"
}