{
  "url": "https://voxday.net/2007/08/10/not-brightest-bunc/",
  "scraped_at": "2026-01-08T21:51:02.170288",
  "title": "Not the brightest bunch",
  "date_display": "August 10, 2007",
  "date_iso": "2007-08-10T09:49:00+00:00",
  "date_from_url": "2007-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Science fetishists <a href=\"http://proteus454.livejournal.com/1034395.html\">don’t understand the difference</a> between evidence, explanation and fact:</p><blockquote><p>This guy complains that scientists change their “story” according to what the facts are.  He thinks this is a BAD thing. That clinging to a disproven hypothesis is some kind of virtue.</p></blockquote><p>First, I did not say “the facts”, I said “the evidence”.  Facts are only one kind of evidence.  And with regards to the matter under discussion, the dynamic explanation nature of the relationship between <em>Homo sapiens</em> and <em>Homo erectus</em> and <em>Homo habilus</em>, there is plenty of evidence but very little in the way of verifiable facts to be considered, the entire discussion is largely based upon conjecture piled on top of guesswork.  It is a story, not a study, it is a pensive little fiction written in lieu of observation and experiment.</p><p>The reason I scoff at the dynamic nature of this so-called “science” is not because I do not understand the way in which genuine science operates, but because in the case of this pseudo-scientific storytelling, whenever one plot line begins to appear less probable for whatever reason, it is quickly replaced by a new one which is immediately proclaimed as an unassailable scientific consensus which those not of the priesthood should unquestioningly accept.</p><p>Until, of course, the inevitable revision.</p><p>Surprisingly, Dr. PZ Myers demonstrates that <a href=\"http://scienceblogs.com/pharyngula/2007/08/another_turkey_pops_his_head_u.php#comments\">he can’t read any better</a> than the teenager quoted above:</p><blockquote><p>There’s a problem in principle with his objection: yes, that’s what scientists are supposed to do. They’re supposed to follow the evidence where it leads, not cling to a story in spite of the evidence….  Day also complains that there are different versions of the theory of evolution, and cites this story as an example. He’s screwed up pretty thoroughly: while there are different mechanisms that play a role in evolution, this is an example of a historical detail, not something broadly related to theoretical concerns, and it does not call into question any mechanisms. In particular, scientists arguing about the precise relationships of species within a specific mammalian lineage does not mean there’s room for god-went-poof explanations.</p></blockquote><p>Or, you know, they could refrain from cooking up cockamamie stories and trying to sell them to the public until they have a decent amount of supporting evidence that is likely to hold up for 10 minutes.  But of course, that would cut into their chance to see their names in print and collect a bigger slice of science welfare.</p><p>PZ fails to note that I’m not citing this story as an example of the weakness of any of the various evolutionary theories – does he think I consider it to be Darwinian, neo-Darwinian or Punctuated Equilibrium? – and that I am perfectly aware that the scientific predilection for colorful story-telling is not, in and of itself, proof that all evolutionists operate in the same manner as the fabulists operating at the edges of evolutionary biology.  Finally, as I stated from the start, my evolutionary skepticism is as entirely secular as my similar dubiousness about scientific socialism, feminism and the Iraqi occupation.</p><p>God doesn’t need my help defending Him from dynamic historical fiction.</p></div>",
  "content_text": "Science fetishists\ndon’t understand the difference\nbetween evidence, explanation and fact:\nThis guy complains that scientists change their “story” according to what the facts are.  He thinks this is a BAD thing. That clinging to a disproven hypothesis is some kind of virtue.\nFirst, I did not say “the facts”, I said “the evidence”.  Facts are only one kind of evidence.  And with regards to the matter under discussion, the dynamic explanation nature of the relationship between\nHomo sapiens\nand\nHomo erectus\nand\nHomo habilus\n, there is plenty of evidence but very little in the way of verifiable facts to be considered, the entire discussion is largely based upon conjecture piled on top of guesswork.  It is a story, not a study, it is a pensive little fiction written in lieu of observation and experiment.\nThe reason I scoff at the dynamic nature of this so-called “science” is not because I do not understand the way in which genuine science operates, but because in the case of this pseudo-scientific storytelling, whenever one plot line begins to appear less probable for whatever reason, it is quickly replaced by a new one which is immediately proclaimed as an unassailable scientific consensus which those not of the priesthood should unquestioningly accept.\nUntil, of course, the inevitable revision.\nSurprisingly, Dr. PZ Myers demonstrates that\nhe can’t read any better\nthan the teenager quoted above:\nThere’s a problem in principle with his objection: yes, that’s what scientists are supposed to do. They’re supposed to follow the evidence where it leads, not cling to a story in spite of the evidence….  Day also complains that there are different versions of the theory of evolution, and cites this story as an example. He’s screwed up pretty thoroughly: while there are different mechanisms that play a role in evolution, this is an example of a historical detail, not something broadly related to theoretical concerns, and it does not call into question any mechanisms. In particular, scientists arguing about the precise relationships of species within a specific mammalian lineage does not mean there’s room for god-went-poof explanations.\nOr, you know, they could refrain from cooking up cockamamie stories and trying to sell them to the public until they have a decent amount of supporting evidence that is likely to hold up for 10 minutes.  But of course, that would cut into their chance to see their names in print and collect a bigger slice of science welfare.\nPZ fails to note that I’m not citing this story as an example of the weakness of any of the various evolutionary theories – does he think I consider it to be Darwinian, neo-Darwinian or Punctuated Equilibrium? – and that I am perfectly aware that the scientific predilection for colorful story-telling is not, in and of itself, proof that all evolutionists operate in the same manner as the fabulists operating at the edges of evolutionary biology.  Finally, as I stated from the start, my evolutionary skepticism is as entirely secular as my similar dubiousness about scientific socialism, feminism and the Iraqi occupation.\nGod doesn’t need my help defending Him from dynamic historical fiction.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-10T08:49:00+00:00"
}