{
  "url": "https://voxday.net/2007/08/07/pick-up-artis/",
  "scraped_at": "2026-01-08T21:50:33.404941",
  "title": "The pick-up artist",
  "date_display": "August 7, 2007",
  "date_iso": "2007-08-07T08:47:00+00:00",
  "date_from_url": "2007-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve never paid any attention to the cottage industry of learning how to pick up women, mostly due to my stunning good looks and familial wealth.  While I’m not as handsome as any of my brothers, all of whom are former models and never had to do much more than smile at a women in order for her to find them perfectly fascinating, the towering arrogance which invisibly radiates from me like fallout from Chernobyl tended to make up for that unfortunate deficiency.</p><p>Even so, <a href=\"http://www.salon.com/mwt/feature/2007/08/06/mystery_qa/\">this interview</a> with the professor of pick-up artistry, Mystery, is interesting for two reasons.  First, he identifies the fundamental challence for men: “A woman wants to align with a man of high value. How can a man systematically convey his value to a woman if she won’t even let him?”  This is the central issue, because you can’t win the game if you’re not even allowed to step on the field.</p><p>Second, he shares a vital truth that every man, single or married, needs to understand, not merely intellectually, but at the deepest emotional level: “What a woman says she wants and what she responds to are two different things.”  This statement alone proves that Mystery, despite his strange appeareance, knows exactly what he’s doing.</p><p>As Spacebunny wisely informed me early on in our relationship, you can’t “make” a woman happy.  Like men, women either “are” happy or “are not” happy on their own; it’s basically a lifestyle choice which doesn’t necessarily have very much to do with either the circumstances or your actions.  There are happy women living as impoverished single mothers in mobile homes and there are profoundly unhappy women married to devoted Fortune 500 CEOs living in multi-million dollar mansions.  The only thing a man can really do is to be open to communication, do his best to fulfill his responsibilities and live the way that makes him happy.  If you’re religious, then pray for her from time to time.</p><p>As for single women, don’t pay attention to a word they say about what they want.  The vast majority are totally incapable of telling you the truth about this because they don’t know themselves what it is.  This should be obvious because if they did, they wouldn’t keep making the same, stupid choices that cause them to complain all the time.  I mean, look at the sort of ridiculous advice they <a href=\"http://pandagon.blogsome.com/2007/08/06/applying-skepticism-to-pick-up-artistry/#comments\">offer as a substitute at Pandagon</a>: “act like a vaguely normal and well-behaved version of yourself. Keep up with basic grooming.”</p><p>Right, that’s all a woman wants, someone who is clean, vaguely normal and well-behaved, that’s why drug-addicted musicians with dirty hair do so poorly with women.  And once that doesn’t work, which it won’t, then what?  Being long out of the game, I don’t have a lot of advice for those who want to meet people, but I can vaguely recall a few things:</p><p>(1) Never buy a drink for a woman.  It puts you in the position of being a supplicant and an inferior.  Far better to let them ask if you want to buy them a drink and respond with something like “No, but you can buy one for me if you like.  I’ll get the next round.”    If she’s at all interested, she will, if she won’t, she was just looking to use you anyhow.  And if she’s obnoxious, about it, you have just potentially saved yourself time, money and grief.</p><p>(2) Don’t waste your time trying to convince women to be interested in you.  You’re not a performing monkey.  If you’ve introduced yourself and made eye contact, and she shows signs of being more interested in turning back to her friends than having a conversation with you, don’t hesitate to let her.  Smile, murmur a social pleasantry and move on.  There are plenty of girls on the girl tree.</p><p>(3) Don’t info-dump, let her ask the questions about you if she’s curious.  With rare exceptions, people love talking about themselves so the more you encourage her to ramble on about herself, the more she’ll be interested in you.  Plus, you get the benefit of finding out how crazy she is from the start.</p><p>(4) If you want to meet pretty girls, don’t go out with your male friends, go with your hottest female friend.  You’ll meet more pretty women just sitting at the bar with a really beautiful example of the species for two hours than you will in a month of running around obsequiously buying drinks for every woman you find attractive.</p><p>(5) Stop worrying.  There are more than three billion women on the planet and while there may not be a princess for every frog, there is a frog for every one.  If you’re a 5 on the human attraction scale, well, that’s the breaks.  Either find yourself a 5 or work at making yourself into a 6.  Even so, you can get whatever kind of woman you want, but like everything, it’s a matter of being willing to put in the necessary effort.  Even Brad Pitt and George Clooney had to work their handsome posteriors off for a number of years before they became the rich and famous icons of female desire that they are today.</p></div>",
  "content_text": "I’ve never paid any attention to the cottage industry of learning how to pick up women, mostly due to my stunning good looks and familial wealth.  While I’m not as handsome as any of my brothers, all of whom are former models and never had to do much more than smile at a women in order for her to find them perfectly fascinating, the towering arrogance which invisibly radiates from me like fallout from Chernobyl tended to make up for that unfortunate deficiency.\nEven so,\nthis interview\nwith the professor of pick-up artistry, Mystery, is interesting for two reasons.  First, he identifies the fundamental challence for men: “A woman wants to align with a man of high value. How can a man systematically convey his value to a woman if she won’t even let him?”  This is the central issue, because you can’t win the game if you’re not even allowed to step on the field.\nSecond, he shares a vital truth that every man, single or married, needs to understand, not merely intellectually, but at the deepest emotional level: “What a woman says she wants and what she responds to are two different things.”  This statement alone proves that Mystery, despite his strange appeareance, knows exactly what he’s doing.\nAs Spacebunny wisely informed me early on in our relationship, you can’t “make” a woman happy.  Like men, women either “are” happy or “are not” happy on their own; it’s basically a lifestyle choice which doesn’t necessarily have very much to do with either the circumstances or your actions.  There are happy women living as impoverished single mothers in mobile homes and there are profoundly unhappy women married to devoted Fortune 500 CEOs living in multi-million dollar mansions.  The only thing a man can really do is to be open to communication, do his best to fulfill his responsibilities and live the way that makes him happy.  If you’re religious, then pray for her from time to time.\nAs for single women, don’t pay attention to a word they say about what they want.  The vast majority are totally incapable of telling you the truth about this because they don’t know themselves what it is.  This should be obvious because if they did, they wouldn’t keep making the same, stupid choices that cause them to complain all the time.  I mean, look at the sort of ridiculous advice they\noffer as a substitute at Pandagon\n: “act like a vaguely normal and well-behaved version of yourself. Keep up with basic grooming.”\nRight, that’s all a woman wants, someone who is clean, vaguely normal and well-behaved, that’s why drug-addicted musicians with dirty hair do so poorly with women.  And once that doesn’t work, which it won’t, then what?  Being long out of the game, I don’t have a lot of advice for those who want to meet people, but I can vaguely recall a few things:\n(1) Never buy a drink for a woman.  It puts you in the position of being a supplicant and an inferior.  Far better to let them ask if you want to buy them a drink and respond with something like “No, but you can buy one for me if you like.  I’ll get the next round.”    If she’s at all interested, she will, if she won’t, she was just looking to use you anyhow.  And if she’s obnoxious, about it, you have just potentially saved yourself time, money and grief.\n(2) Don’t waste your time trying to convince women to be interested in you.  You’re not a performing monkey.  If you’ve introduced yourself and made eye contact, and she shows signs of being more interested in turning back to her friends than having a conversation with you, don’t hesitate to let her.  Smile, murmur a social pleasantry and move on.  There are plenty of girls on the girl tree.\n(3) Don’t info-dump, let her ask the questions about you if she’s curious.  With rare exceptions, people love talking about themselves so the more you encourage her to ramble on about herself, the more she’ll be interested in you.  Plus, you get the benefit of finding out how crazy she is from the start.\n(4) If you want to meet pretty girls, don’t go out with your male friends, go with your hottest female friend.  You’ll meet more pretty women just sitting at the bar with a really beautiful example of the species for two hours than you will in a month of running around obsequiously buying drinks for every woman you find attractive.\n(5) Stop worrying.  There are more than three billion women on the planet and while there may not be a princess for every frog, there is a frog for every one.  If you’re a 5 on the human attraction scale, well, that’s the breaks.  Either find yourself a 5 or work at making yourself into a 6.  Even so, you can get whatever kind of woman you want, but like everything, it’s a matter of being willing to put in the necessary effort.  Even Brad Pitt and George Clooney had to work their handsome posteriors off for a number of years before they became the rich and famous icons of female desire that they are today.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-07T07:47:00+00:00"
}