{
  "url": "https://voxday.net/2007/08/24/precisely-pintopolis/",
  "scraped_at": "2026-01-08T21:52:09.911404",
  "title": "Precisely, Pintopolis",
  "date_display": "August 24, 2007",
  "date_iso": "2007-08-24T08:26:00+00:00",
  "date_from_url": "2007-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After a long discussion on the rational bases for authority and morality, Pintopolis finally comes very close to grokking the fullness:</p><blockquote><p>You are not describing morals here. You are describing obedience. It’s not the same.</p></blockquote><p>Close, so very close.  From the Christian perspective, obedience and morality are EXACTLY the same.  It is not the Golden Rule or the Beatitudes or even the Ten Commandments, but obedience to the Will of God that is the heart and root and soul of Christian morality.  I go into more detail on this in TIA, but a partial explication of the significance of this definition can be found in the <a href=\"http://www.milobookclub.com/2007/02/14/non-dilemma-of-euthyphro/\">first </a>and <a href=\"http://www.milobookclub.com/2007/02/15/euthyphro-ii/\">second </a>posts dealing with the non-dilemma of Euthyphro.</p><p>The individual basis of most hypothetical atheist moral systems is the fundamental challenge of atheodicy, which is why Daniel Dennett spends so much time attempting to formulate an approach to begin solving the atheist problem of evil in both <em>Darwin’s Dangerous Idea</em> and <em>Breaking the Spell</em>.  He is, by his own admission, unable to conceive of any such universal system himself; the best he can do is theorize the possibility of “moral democracy”.  Given the profoundly immoral results of past political democracies, however, this is a hopeless nonstarter of a concept and Dennett even seems to realize that in light of his lackluster description of the idea.</p><p>The atheologist Onfray is rightly contemptuous of the milktoast atheism of Dennett, Dawkins and Harris.  He is the true son of Nietzsche, and as such, the only semi-rational atheist in the lot.  He sneers at the “christian atheism” of Pintopolis, wherein the atheist attempts to cling to what are manifestly Christian morals for no rational reason.  It is astounding how poorly educated so many atheists are in history; in much the same way that only historical illiterates such as Dawkins and Harris could argue that religion causes war and is an integral aspect of war-making, it requires a considerable amount of historical ignorance to argue that past human societies shared the Christian moral view of deceit, theft and murder, let alone the concept of individual rights or any form of equality.</p><p>If your morality is not defined by obedience to God, then your morality will ultimately be defined by men with the ambition and the ability to impose their will upon you.  This is why all totalitarians hate the religious in general and Christians in particular; because they are the one group who can never be fully integrated into the totalitarian’s new morality.</p></div>",
  "content_text": "After a long discussion on the rational bases for authority and morality, Pintopolis finally comes very close to grokking the fullness:\nYou are not describing morals here. You are describing obedience. It’s not the same.\nClose, so very close.  From the Christian perspective, obedience and morality are EXACTLY the same.  It is not the Golden Rule or the Beatitudes or even the Ten Commandments, but obedience to the Will of God that is the heart and root and soul of Christian morality.  I go into more detail on this in TIA, but a partial explication of the significance of this definition can be found in the\nfirst\nand\nsecond\nposts dealing with the non-dilemma of Euthyphro.\nThe individual basis of most hypothetical atheist moral systems is the fundamental challenge of atheodicy, which is why Daniel Dennett spends so much time attempting to formulate an approach to begin solving the atheist problem of evil in both\nDarwin’s Dangerous Idea\nand\nBreaking the Spell\n.  He is, by his own admission, unable to conceive of any such universal system himself; the best he can do is theorize the possibility of “moral democracy”.  Given the profoundly immoral results of past political democracies, however, this is a hopeless nonstarter of a concept and Dennett even seems to realize that in light of his lackluster description of the idea.\nThe atheologist Onfray is rightly contemptuous of the milktoast atheism of Dennett, Dawkins and Harris.  He is the true son of Nietzsche, and as such, the only semi-rational atheist in the lot.  He sneers at the “christian atheism” of Pintopolis, wherein the atheist attempts to cling to what are manifestly Christian morals for no rational reason.  It is astounding how poorly educated so many atheists are in history; in much the same way that only historical illiterates such as Dawkins and Harris could argue that religion causes war and is an integral aspect of war-making, it requires a considerable amount of historical ignorance to argue that past human societies shared the Christian moral view of deceit, theft and murder, let alone the concept of individual rights or any form of equality.\nIf your morality is not defined by obedience to God, then your morality will ultimately be defined by men with the ambition and the ability to impose their will upon you.  This is why all totalitarians hate the religious in general and Christians in particular; because they are the one group who can never be fully integrated into the totalitarian’s new morality.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-24T07:26:00+00:00"
}