{
  "url": "https://voxday.net/2007/08/26/savaged-by-angry-lambs/",
  "scraped_at": "2026-01-08T21:52:27.006763",
  "title": "Savaged by angry lambs",
  "date_display": "August 26, 2007",
  "date_iso": "2007-08-26T14:06:00+00:00",
  "date_from_url": "2007-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sometimes I suspect PZ is secretly attempting to make my case about the fundamentally careless and unscientific nature of evolutionary biology for me.  In the process of <a href=\"http://scienceblogs.com/pharyngula/2007/08/not_d_james_kennedy_again.php#comments\">trying to deny the obvious connection between the National Socialist eugenics program and his hero Darwin</a>, Dr. PZ Myers links to John Wilkins, who he says “eviscerated” the premises of a program called <em>Darwin’s Deadly Legacy</em>.</p><p>There’s just one little problem. <a href=\"http://scienceblogs.com/evolvingthoughts/fastsearch?query=Darwin+and+the+Holocaust&amp;category=&amp;order=date&amp;lastn=25&amp;offset=50&amp;blogs=53\">Wilkins declares</a> that there’s FOUR ways which one could reasonably draw a connection between Darwin and Hitler and then proceeds to address precisely THREE of them over the course of three posts.</p><p>Wilkins promises to get around to the last one – not that his argument relating to the eugenics thesis was the least bit convincing or even particularly relevant – but instead concludes by announcing that the research he needed in order to address his “cotraveller thesis” disappeared somehow.  So, he doesn’t even try to address what he declares requires addressing.</p><p>Some evisceration.</p></div>",
  "content_text": "Sometimes I suspect PZ is secretly attempting to make my case about the fundamentally careless and unscientific nature of evolutionary biology for me.  In the process of\ntrying to deny the obvious connection between the National Socialist eugenics program and his hero Darwin\n, Dr. PZ Myers links to John Wilkins, who he says “eviscerated” the premises of a program called\nDarwin’s Deadly Legacy\n.\nThere’s just one little problem.\nWilkins declares\nthat there’s FOUR ways which one could reasonably draw a connection between Darwin and Hitler and then proceeds to address precisely THREE of them over the course of three posts.\nWilkins promises to get around to the last one – not that his argument relating to the eugenics thesis was the least bit convincing or even particularly relevant – but instead concludes by announcing that the research he needed in order to address his “cotraveller thesis” disappeared somehow.  So, he doesn’t even try to address what he declares requires addressing.\nSome evisceration.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-26T13:06:00+00:00"
}