{
  "url": "https://voxday.net/2007/08/25/scrub-scrub-lady-macatheis/",
  "scraped_at": "2026-01-08T21:52:23.901581",
  "title": "Scrub, scrub, Lady MacAtheist",
  "date_display": "August 25, 2007",
  "date_iso": "2007-08-25T19:03:00+00:00",
  "date_from_url": "2007-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The defensiveness of atheists about the most obvious, easily verifiable historical facts is really quite striking.  Consider Ed Darrell’s <a href=\"http://timpanogos.wordpress.com/2007/08/25/for-cronolink/\">absurdly ignorant statement here</a>:</p><blockquote><p>Then please show us where Lenin ever said anything about Darwin. It’s more likely Lenin was simply following the example of the Spanish Inquisition, having learned from Christian history the value of slaughtering one’s political opponents (see “St. Bartholomew’s Day Massacre,” or note how Calvin dealt with his friend Servetus). “Scientific atheism” may have been what they called it. It has no relation to evolution theory, little relation to science of any sort, and not much relation to atheism, either.</p></blockquote><p>First of all, they called it “scientific socialism”, not “scientific atheism”.  It has a direct relation to the theory of evolution, it is outdated science and it is 100 percent pure atheism, more pure than the timid “christian atheism” of the New Atheists.  But Ed wanted quotes, so we will give him quotes.</p><p>“Darwin’s book is very important and serves me as a basis in natural science for the class struggle in history.”<br>– Karl Marx</br></p><p>“Nature is the test of dialectics, and it must be said for modern natural science that it has furnished extremely rich and daily increasing materials for this test, and has thus proved that in the last analysis nature’s process is dialectical and not metaphysical, that it does not move in an eternally uniform and constantly repeated circle, but passes through a real history. Here prime mention should be made of Darwin, who dealt a severe blow to the metaphysical conception of nature by proving that the organic world of today, plants and animals, and consequently man too, is all a product of a process of development that has been in progress for millions of years.” <br>– Friedrich Engels, <em>Socialism Utopian and Scientific</em> p. 23 (quoted in full by Stalin in <em>Dialectical and Historical Materialism</em> as well as in the official Bolshevik <em>History of the Communist Party of the Soviet Union</em> published in 1939.)</br></p><p>“Darwin put an end to the belief that the animal and vegetable species bear no relation to one another, except by chance, and that they were created by God, and hence immutable.” <br>– Vladimir Ilyich Lenin</br></p><p>“Darwinism, which explained the evolution of species through quantitative transformations passing into qualitative, was the highest triumph of the dialectic in the whole field of organic matter….  Marx, who in distinction from Darwin was a conscious dialectician, discovered a basis for the scientific classification of human societies in the development of their productive forces and the structure of the relations of ownership which constitute the anatomy of society.”<br>– Leon Trotsky, The ABC of Materialist Dialectics</br></p><p>“The Party cannot be neutral towards religion, and it conducts anti-religious propaganda against all religious prejudices because it stands for science, whereas religious prejudices run counter to science, because all religion is the antithesis of science. Cases such as occur in America, where Darwinists were prosecuted recently, cannot occur here because the Party pursues a policy of defending science in every way.”<br>– Josef Stalin, J.V. Stalin Complete Works Volume 10, p. 138</br></p><p>“Chinese socialism is founded upon Darwin and the theory of evolution.”<br>– Mao</br></p><p>“The metaphysical or vulgar evolutionist world outlook sees things as isolated, static and one-sided. It regards all things in the universe, their forms and their species, as eternally isolated from one another and immutable. Such change as there is can only be an increase or decrease in quantity or a change of place. Moreover, the cause of such an increase or decrease or change of place is not inside things but outside them, that is, the motive force is external….  As opposed to the metaphysical world outlook, the world outlook of materialist dialectics holds that in order to understand the development of a thing we should study it internally and in its relations with other things; in other words, the development of things should be seen as their internal and necessary self-movement, while each thing in its movement is interrelated with and interacts on the things around it.”<br>–  Mao, On Contradiction</br></p><p>It’s hard to get much more explicit than that.  And it’s pretty clear that Ed doesn’t know anything about the Spanish Inquisition, for if Lenin and Stalin had learned from its example, the Soviet body count from 1917 to 1953 would have been 324 instead of 25 million or more.  Not only was Lenin a virulent, vehement atheist, but his destruction of the Russian churches and mass murder of its priests was explicitly committed in the name of atheism as proof of the nonexistence of God.  It was <em>The God Delusion</em> in action.</p><p>Ed also makes the same ignorant mistake that PZ Myers made a few weeks ago:</p><blockquote><p>The fascist overeager nuts made the same errors. The belt buckles of the SS said “God with us,” not “No God.”  You keep trying to ignore the facts.</p></blockquote><p>They most certainly did not.  They said “Mein Ehre Heisst Treu”.  “Gott mit uns” was not a Nazi slogan, but the slogan of the Wehrmacht, which dated back to 1871.  It’s worth noting that the Nazis did not elect to continue the German military tradition of declaring “God with us”, but preferred to select a new one instead.</p><p>I suggest that Ed has no idea whatsoever of what the facts are.</p><p>UPDATE: I note that Stalin sounds almost exactly like PZ complaining about Creationists when he writes in the explanatory footnote referring to the quote above: <em>“In 1925 (July 10 to 21), a trial took place in the state of Tennessee, U.S.A., which attracted world-wide attention. A college teacher, named John Scopes was tried for teaching Darwin’s theory of evolution. The American reactionary obscurantists found him guilty of violating the laws of the state and fined him.”</em></p></div>",
  "content_text": "The defensiveness of atheists about the most obvious, easily verifiable historical facts is really quite striking.  Consider Ed Darrell’s\nabsurdly ignorant statement here\n:\nThen please show us where Lenin ever said anything about Darwin. It’s more likely Lenin was simply following the example of the Spanish Inquisition, having learned from Christian history the value of slaughtering one’s political opponents (see “St. Bartholomew’s Day Massacre,” or note how Calvin dealt with his friend Servetus). “Scientific atheism” may have been what they called it. It has no relation to evolution theory, little relation to science of any sort, and not much relation to atheism, either.\nFirst of all, they called it “scientific socialism”, not “scientific atheism”.  It has a direct relation to the theory of evolution, it is outdated science and it is 100 percent pure atheism, more pure than the timid “christian atheism” of the New Atheists.  But Ed wanted quotes, so we will give him quotes.\n“Darwin’s book is very important and serves me as a basis in natural science for the class struggle in history.”\n– Karl Marx\n“Nature is the test of dialectics, and it must be said for modern natural science that it has furnished extremely rich and daily increasing materials for this test, and has thus proved that in the last analysis nature’s process is dialectical and not metaphysical, that it does not move in an eternally uniform and constantly repeated circle, but passes through a real history. Here prime mention should be made of Darwin, who dealt a severe blow to the metaphysical conception of nature by proving that the organic world of today, plants and animals, and consequently man too, is all a product of a process of development that has been in progress for millions of years.”\n– Friedrich Engels,\nSocialism Utopian and Scientific\np. 23 (quoted in full by Stalin in\nDialectical and Historical Materialism\nas well as in the official Bolshevik\nHistory of the Communist Party of the Soviet Union\npublished in 1939.)\n“Darwin put an end to the belief that the animal and vegetable species bear no relation to one another, except by chance, and that they were created by God, and hence immutable.”\n– Vladimir Ilyich Lenin\n“Darwinism, which explained the evolution of species through quantitative transformations passing into qualitative, was the highest triumph of the dialectic in the whole field of organic matter….  Marx, who in distinction from Darwin was a conscious dialectician, discovered a basis for the scientific classification of human societies in the development of their productive forces and the structure of the relations of ownership which constitute the anatomy of society.”\n– Leon Trotsky, The ABC of Materialist Dialectics\n“The Party cannot be neutral towards religion, and it conducts anti-religious propaganda against all religious prejudices because it stands for science, whereas religious prejudices run counter to science, because all religion is the antithesis of science. Cases such as occur in America, where Darwinists were prosecuted recently, cannot occur here because the Party pursues a policy of defending science in every way.”\n– Josef Stalin, J.V. Stalin Complete Works Volume 10, p. 138\n“Chinese socialism is founded upon Darwin and the theory of evolution.”\n– Mao\n“The metaphysical or vulgar evolutionist world outlook sees things as isolated, static and one-sided. It regards all things in the universe, their forms and their species, as eternally isolated from one another and immutable. Such change as there is can only be an increase or decrease in quantity or a change of place. Moreover, the cause of such an increase or decrease or change of place is not inside things but outside them, that is, the motive force is external….  As opposed to the metaphysical world outlook, the world outlook of materialist dialectics holds that in order to understand the development of a thing we should study it internally and in its relations with other things; in other words, the development of things should be seen as their internal and necessary self-movement, while each thing in its movement is interrelated with and interacts on the things around it.”\n–  Mao, On Contradiction\nIt’s hard to get much more explicit than that.  And it’s pretty clear that Ed doesn’t know anything about the Spanish Inquisition, for if Lenin and Stalin had learned from its example, the Soviet body count from 1917 to 1953 would have been 324 instead of 25 million or more.  Not only was Lenin a virulent, vehement atheist, but his destruction of the Russian churches and mass murder of its priests was explicitly committed in the name of atheism as proof of the nonexistence of God.  It was\nThe God Delusion\nin action.\nEd also makes the same ignorant mistake that PZ Myers made a few weeks ago:\nThe fascist overeager nuts made the same errors. The belt buckles of the SS said “God with us,” not “No God.”  You keep trying to ignore the facts.\nThey most certainly did not.  They said “Mein Ehre Heisst Treu”.  “Gott mit uns” was not a Nazi slogan, but the slogan of the Wehrmacht, which dated back to 1871.  It’s worth noting that the Nazis did not elect to continue the German military tradition of declaring “God with us”, but preferred to select a new one instead.\nI suggest that Ed has no idea whatsoever of what the facts are.\nUPDATE: I note that Stalin sounds almost exactly like PZ complaining about Creationists when he writes in the explanatory footnote referring to the quote above:\n“In 1925 (July 10 to 21), a trial took place in the state of Tennessee, U.S.A., which attracted world-wide attention. A college teacher, named John Scopes was tried for teaching Darwin’s theory of evolution. The American reactionary obscurantists found him guilty of violating the laws of the state and fined him.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-25T18:03:00+00:00"
}