{
  "url": "https://voxday.net/2007/08/02/socially-autistic-atheis/",
  "scraped_at": "2026-01-08T21:50:10.716899",
  "title": "The socially autistic atheist",
  "date_display": "August 2, 2007",
  "date_iso": "2007-08-02T09:31:00+00:00",
  "date_from_url": "2007-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not just a figment of my imagination, it seems atheists truly are socially autistic by their own report.  Asperger’s Syndrome is a disorder described as “autistic psychopathy” by its discoverer, Dr. Hans Asperger.  Those with the disorder tend to be intelligent, socially awkward and difficult to converse with.  They are also likely to be male.</p><p>Based on Wired Magazine’s observation that atheists tend to be quarrelsome, socially challenged men, to say nothing of the unpleasant personalities of leading public atheists such as Richard Dawkins, Christopher Hitchens and Michel Onfray, one could reasonably hypothesize that there is likely to be a strong correlation between Asperger’s and atheism.  It’s by no means a scientific test, but it is interesting to note the coincidence that 59 of the virulent atheists over at Dr. PZ Myers place <a href=\"http://scienceblogs.com/pharyngula/2007/08/im_mostly_normal.php#comments\">report an average score</a> on the <a href=\"http://www.piepalace.ca/blog/asperger-test-aq-test/\">Asperger’s Quotient test</a> of 27.8.  And this does not include the two individuals who actually have Asperger’s but did not report any test results.</p><p>The test notes that “Scores over 32 are generally taken to indicate Asperger’s Syndrome or high-functioning autism”.  The average male score is 18, the average female score is 15.  By way of comparison, I scored 14.</p><p>I was amused by one of the questions, which states: “Other people frequently tell me that what I’ve said is impolite, even though I think it is polite.”  This one topic accounts for about 15 percent of the collective New Atheist texts, and involves various forms of complaining about how they can’t understand how anyone could possibly take any offense at being called stupid, ignorant, deluded and poisonous, and attempting to justify their reasons for their unprovoked insulting of 4.5 billion people in this manner.</p><p>Here’s an object lesson that perhaps might be capable of penetrating the skulls of even the most autistically psychopathic.  (1)  Do you dislike being described as a socially autistic asshole?  (2)  Would you like it any more if that description was scientifically proven to describe you accurately?  (3) Would you consider it polite and/or socially acceptable for me to insist on always describing you to others as an autistic psychopath were this proven to be an accurate description of you?</p><p>Obviously, more comprehensive and scientific tests would be advised before any definite conclusion can be reached, but these initial observations do appear to indicate a possibility that atheism could be nothing more than a minor mental disorder.</p><p>UPDATE: I encourage you to <a href=\"http://www.piepalace.ca/blog/asperger-test-aq-test/\">take the test</a> – as honestly as possible – and then post your results here in the comments along with your identification as theist, atheist or agnostic.</p></div>",
  "content_text": "It’s not just a figment of my imagination, it seems atheists truly are socially autistic by their own report.  Asperger’s Syndrome is a disorder described as “autistic psychopathy” by its discoverer, Dr. Hans Asperger.  Those with the disorder tend to be intelligent, socially awkward and difficult to converse with.  They are also likely to be male.\nBased on Wired Magazine’s observation that atheists tend to be quarrelsome, socially challenged men, to say nothing of the unpleasant personalities of leading public atheists such as Richard Dawkins, Christopher Hitchens and Michel Onfray, one could reasonably hypothesize that there is likely to be a strong correlation between Asperger’s and atheism.  It’s by no means a scientific test, but it is interesting to note the coincidence that 59 of the virulent atheists over at Dr. PZ Myers place\nreport an average score\non the\nAsperger’s Quotient test\nof 27.8.  And this does not include the two individuals who actually have Asperger’s but did not report any test results.\nThe test notes that “Scores over 32 are generally taken to indicate Asperger’s Syndrome or high-functioning autism”.  The average male score is 18, the average female score is 15.  By way of comparison, I scored 14.\nI was amused by one of the questions, which states: “Other people frequently tell me that what I’ve said is impolite, even though I think it is polite.”  This one topic accounts for about 15 percent of the collective New Atheist texts, and involves various forms of complaining about how they can’t understand how anyone could possibly take any offense at being called stupid, ignorant, deluded and poisonous, and attempting to justify their reasons for their unprovoked insulting of 4.5 billion people in this manner.\nHere’s an object lesson that perhaps might be capable of penetrating the skulls of even the most autistically psychopathic.  (1)  Do you dislike being described as a socially autistic asshole?  (2)  Would you like it any more if that description was scientifically proven to describe you accurately?  (3) Would you consider it polite and/or socially acceptable for me to insist on always describing you to others as an autistic psychopath were this proven to be an accurate description of you?\nObviously, more comprehensive and scientific tests would be advised before any definite conclusion can be reached, but these initial observations do appear to indicate a possibility that atheism could be nothing more than a minor mental disorder.\nUPDATE: I encourage you to\ntake the test\n– as honestly as possible – and then post your results here in the comments along with your identification as theist, atheist or agnostic.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-02T08:31:00+00:00"
}