{
  "url": "https://voxday.net/2007/08/24/sweet-darwin-hes-stupid/",
  "scraped_at": "2026-01-08T21:52:13.184629",
  "title": "Sweet Darwin, he’s stupid",
  "date_display": "August 24, 2007",
  "date_iso": "2007-08-24T09:56:00+00:00",
  "date_from_url": "2007-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Harris <a href=\"http://www.nature.com/nature/journal/v448/n7156/full/448864a.html\">making his customary hash</a> of a case against religion:</p><blockquote><p>At a time when Muslim doctors and engineers stand accused of attempting atrocities in the expectation of supernatural reward, when the Catholic Church still preaches the sinfulness of condom use in villages devastated by AIDS, when the president of the United States repeatedly vetoes the most promising medical research for religious reasons, much depends on the scientific community presenting a united front against the forces of unreason.</p></blockquote><p>What depends, Sam?  For the love of the Galapagos Islands, for once in your pathetic career, put some actual substance behind your incompetent logic and half-assed rhetoric!  WHAT DEPENDS?  I mean, Nature itself has reported that one of the places where science is currently growing fastest in terms of funding and employment is IRAN.  Religion does not seriously inhibit science in any way, let alone imperil it.  The argument is demonstrably false on its face.</p><p>It’s been published – in Nature, no less – that your stem cell argument is outdated.  It’s now bad science.  How is the fact that Muslim doctors and engineers happen to be politically active terrorists any jeopardy to science in any way, shape or form?  And which is more likely to spread AIDS, your advocacy of free sex with condoms or the Catholic Church’s position of chastity until marriage?  Is it merely a coincidence that AIDS didn’t emerge until after the invention of the condom and the sexual revolution?</p><p>Sam Harris is not a scientist and he isn’t a fan of the scientific method, he’s a fraudulent philosophy major who is attempting to hijack science in service to his anti-theistic jihad.  It is my fondest wish for TIA that it will finish off this intellectually dishonest charlatan once and for all.</p><p>If science unites against religion, then science will be destroyed and deservedly so.  It is science, not religion, which poses a distinct and multi-faceted threat to mankind’s continued survival, moreover, it is a historical fact that while science can be shut down for centuries, not even the most violent totalitarian government is capable of eliminating religion over a period of decades.</p><p>PS – On the evolution debate front, <a href=\"http://www.monkeytrials.blogspot.com/\">my interlocutor Scott</a> has expressed the wish that I hold off until he completes his next response.  Since I’ve been under the weather lately I’m quite happy to comply, although I do look forward to hearing his further thoughts on the matter.  His partial response <a href=\"http://monkeytrials.blogspot.com/2007/08/vox-dei-bate-7.html\">can be read here</a>.</p><p>PPS – It’s amusing to note that <a href=\"http://news.yahoo.com/s/ap/20070824/ap_on_re_us/youth_poll_spirituality\">religious youth are more moral</a> by Sam Harris’s own metric of morality: <em>“Eighty percent of those who call religion or spirituality the most important thing in their lives say they’re happy, while 60 percent of those who say faith isn’t important to them consider themselves happy.”</em></p><p>Evangelical atheists sure have a tough sell.  On the one hand, you’ll be less happy, live a shorter life, and need therapy before you kill yourself.  On the other, you’ll be less popular at a party than a homosexual Haitian pedophile with tuberculosis and three STDs.  So wear that scarlet letter with pride!</p></div>",
  "content_text": "Sam Harris\nmaking his customary hash\nof a case against religion:\nAt a time when Muslim doctors and engineers stand accused of attempting atrocities in the expectation of supernatural reward, when the Catholic Church still preaches the sinfulness of condom use in villages devastated by AIDS, when the president of the United States repeatedly vetoes the most promising medical research for religious reasons, much depends on the scientific community presenting a united front against the forces of unreason.\nWhat depends, Sam?  For the love of the Galapagos Islands, for once in your pathetic career, put some actual substance behind your incompetent logic and half-assed rhetoric!  WHAT DEPENDS?  I mean, Nature itself has reported that one of the places where science is currently growing fastest in terms of funding and employment is IRAN.  Religion does not seriously inhibit science in any way, let alone imperil it.  The argument is demonstrably false on its face.\nIt’s been published – in Nature, no less – that your stem cell argument is outdated.  It’s now bad science.  How is the fact that Muslim doctors and engineers happen to be politically active terrorists any jeopardy to science in any way, shape or form?  And which is more likely to spread AIDS, your advocacy of free sex with condoms or the Catholic Church’s position of chastity until marriage?  Is it merely a coincidence that AIDS didn’t emerge until after the invention of the condom and the sexual revolution?\nSam Harris is not a scientist and he isn’t a fan of the scientific method, he’s a fraudulent philosophy major who is attempting to hijack science in service to his anti-theistic jihad.  It is my fondest wish for TIA that it will finish off this intellectually dishonest charlatan once and for all.\nIf science unites against religion, then science will be destroyed and deservedly so.  It is science, not religion, which poses a distinct and multi-faceted threat to mankind’s continued survival, moreover, it is a historical fact that while science can be shut down for centuries, not even the most violent totalitarian government is capable of eliminating religion over a period of decades.\nPS – On the evolution debate front,\nmy interlocutor Scott\nhas expressed the wish that I hold off until he completes his next response.  Since I’ve been under the weather lately I’m quite happy to comply, although I do look forward to hearing his further thoughts on the matter.  His partial response\ncan be read here\n.\nPPS – It’s amusing to note that\nreligious youth are more moral\nby Sam Harris’s own metric of morality:\n“Eighty percent of those who call religion or spirituality the most important thing in their lives say they’re happy, while 60 percent of those who say faith isn’t important to them consider themselves happy.”\nEvangelical atheists sure have a tough sell.  On the one hand, you’ll be less happy, live a shorter life, and need therapy before you kill yourself.  On the other, you’ll be less popular at a party than a homosexual Haitian pedophile with tuberculosis and three STDs.  So wear that scarlet letter with pride!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-08-24T08:56:00+00:00"
}