{
  "url": "https://voxday.net/2007/08/10/that-was-easy-ca/",
  "scraped_at": "2026-01-08T21:51:03.983078",
  "title": "A Dog Named Flea",
  "date_display": "August 10, 2007",
  "date_iso": "2007-08-10T18:26:00+00:00",
  "date_from_url": "2007-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Dawkins sees a cloud, smaller than a fist, <a href=\"http://richarddawkins.net/article,1473,The-Flea-Circus-Invites-a-Newcomer,RichardDawkinsnet\">on the horizon</a>:</p><blockquote><p> <b> The Flea Circus Invites a Newcomer!</b><br> The cover of The Irrational Atheist claims to dissect the “Unholy Trinity,” but I think we have to give this one to Sam due to the cover design!</br></p></blockquote><p> <b>A Dog Named Flea</b></p><p><em>Assuredly he lacks the spine<br> To ascertain the big canine.<br> Should we encounter in debate<br> He’ll meet a most odorous fate,<br> For in taking him down a peg<br> I have merely to lift my leg<br> And R. Dawkins will slink away,<br> Wet, and wearing Eau de Day.</br></br></br></br></br></br></br></em></p><p> From <b>The Irrational Atheist</b>:</p><p>“Dawkins is the worst offender, his prickly reaction to criticism is not to address it, not to discuss it, but to disdainfully dismiss it, unread.  When Douglas Wilson published his response to <em>Letter to a Christian Nation</em>, Dawkins lost no time in labeling him “Sam’s Flea”.  According to Dawkins, arguably the most visible representative of science today, any published criticism of him and his fellow militants can only be driven by the desire for book sales.(14)</p><p>Feynman wept.</p><p>——————–<br> <em>(14) “Fleas” and “parasites” are Dawkins’s favored means of referring to his critics.  On 4 March, 2007 at richarddawkins.net, Dawkins posted an entry entitled “Was there ever dog that praised his fleas?” in reference to the “three new parasitic books released in response to The God Delusion.”</em>“</br></p></div>",
  "content_text": "Richard Dawkins sees a cloud, smaller than a fist,\non the horizon\n:\nThe Flea Circus Invites a Newcomer!\nThe cover of The Irrational Atheist claims to dissect the “Unholy Trinity,” but I think we have to give this one to Sam due to the cover design!\nA Dog Named Flea\nAssuredly he lacks the spine\nTo ascertain the big canine.\nShould we encounter in debate\nHe’ll meet a most odorous fate,\nFor in taking him down a peg\nI have merely to lift my leg\nAnd R. Dawkins will slink away,\nWet, and wearing Eau de Day.\nFrom\nThe Irrational Atheist\n:\n“Dawkins is the worst offender, his prickly reaction to criticism is not to address it, not to discuss it, but to disdainfully dismiss it, unread.  When Douglas Wilson published his response to\nLetter to a Christian Nation\n, Dawkins lost no time in labeling him “Sam’s Flea”.  According to Dawkins, arguably the most visible representative of science today, any published criticism of him and his fellow militants can only be driven by the desire for book sales.(14)\nFeynman wept.\n——————–\n(14) “Fleas” and “parasites” are Dawkins’s favored means of referring to his critics.  On 4 March, 2007 at richarddawkins.net, Dawkins posted an entry entitled “Was there ever dog that praised his fleas?” in reference to the “three new parasitic books released in response to The God Delusion.”\n“",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2007-08-10T17:26:00+00:00"
}