{
  "url": "https://voxday.net/2004/09/12/book-review-going-posta/",
  "scraped_at": "2025-12-19T20:45:10.555640",
  "title": "Book Review: Going Postal",
  "date_display": "September 12, 2004",
  "date_iso": "2004-09-12T07:53:00+00:00",
  "date_from_url": "2004-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Going Postal<br> <br>Terry Pratchett<br> <br>Rating: 8.5 of 10</br></br></br></br></b></p><p>Terry Pratchett may be the most underrated writer of our time.  Humor, as any writer knows, is extremely difficult to write, and yet of all the writing genres it may be the least respected.  Add to that the fact that Pratchett is considered a writer of fantasy humor, which places him in a disrespected ghetto’s ghetto.  To write fantasy and be taken seriously, one must write in a language that is not English and betray no familiarity with Tolkein; this will earn one the more weighty title of fabulist, as Borges and Calvino are known.</p><p>And yet Pratchett is a serious writer, a very serious writer.  For underneath his light-hearted, pun-filled stories – inevitably described, unfortunately, as “romps” by evil-minded critics – are insightful thought-provoking essays on the crime, government, technology and the nature of man.  Incredibly, he is able to engage the reader in these essays without sacrificing the story or overly stretching the magical, medievalesque environment in which the Discworld novels are set.</p><p>His feat in writing yet another excellent Discworld novel is particularly impressive since this is approximately the 30th in the series.  As is very unlike the case of most writers with extended series, Pratchett’s books have tended to get better as the series has progressed.  This may be, in part, because the books stand very well alone, as does <em>Going Postal</em></p><p><b>Story:</b> 4 of 5. <em>Going Postal</em> is, on one level, a tale of redemption that comes to an unwilling con man, who begins the novel with being hanged and finds things going swiftly downhill from there.  On another level, however, it is an angry and contemptuous dismissal of another sort of con man, the sort who brought us the dot com boom-and-bust and a righteous screed against the pirates of finance, who rape and pillage entrepeneurs, workers and customers alike with what Pratchett clearly considers to be a different kind of black magic.  You might not think, based on this description, that the story could possibly work; you would also be completely wrong.</p><p><b>Style:</b> 3.5 of 5.  The author’s inability to resist a pun can occasionally grow a bit old, until he comes up with one that is so wickedly clever that it requires reading twice to get and three times to fully appreciate.  He also has an ability to give his characters their own, individual voices and can accurately lampoon other writers’ styles when he wishes to insert the blade more deeply; I particularly like Lord Vetinari’s dry, literal and often lethal wit.</p><p><b>Characters:</b> 5 of 5.  Terry Pratchett is one of the better creators of characters writing in fantasy today.  In a few short paragraphs, he can create a unique character who stands out completely from the vast cast who already inhabit the crowded and filthy environs of Ankh-Morpork.  In <em>Going Postal</em>, the polar antagonists are two very differnet con men, the unfortunate Moist von Lipvig and his adversary, Reacher Gilt.  His names, as one can see, sometimes lamentably appear to have been borrowed from the Isaac Asimov School of Ridiculous names; they are the only way in which his character sketches fall short.</p><p><b>Creativity:</b> 4.5 of 5.  It’s quite clever how Pratchett works in an Internet stand-in that incorporates the revolution in communications, venture finance and even hackers without violating the spirit of his technologically backward world.  His use of secret societies for humorous effect is also creative, albeit in more obvious Discworldian fashion.  Despite the fact that one knows anything can happen on a flat world resting upon the backs of four elephants standing on the shell of one enormous turtle, one finds it nearily impossible to predict what Pratchett will come up with next.</p><p><b>Text Sample</b>:<br/></p><blockquote><p> <br>“Yes,” said the golem.  “The Messages Must Be Delivered.  That Is Written On My <em>Chem</em>.”</br></p><p>“That’s the scroll in their heads that gives a golem his instructions,” said Miss Dearheart.  “In Anghammarad’s case, it’s a clay tablet.  They didn’t have paper in those days.”</p><p>“You really used to deliver messages for kings?” said Groat.</p><p>“Many Kings,” said Anghammarad.  Many Empires.  Many Gods.  Many Gods.  All Gone.  All Things Go,” the golem’s voice got deeper, as if he was quoting from memory.  “Neither Deluge Nor Ice Storm Nor The Black Silence Of The Netherhells Shall Stay These Messengers About Their Sacred Business.  Do Not Ask Us About Saber-Toothed Tigers, Tar Pits, Big Green Things With Teeth, Or The Goddess Czol.”</p><p>“You had big green things with teeth back then?” said Tropes.</p><p>“Bigger.  Greener.  More Teeth,” rumbled Anghammarad.</p><p>“And the Goddess Czol?” said Moist.</p><p>“Do Not Ask.”</p><p>There was a thoughtful silence.  Moist knew how to break it.  “And <em>you</em> will decide if <em>he</em> is a postman?” he said softly….</p><p>By general agreement, Anghammarad was given the unique rank of Extremely Senior Postman.<br/></p></blockquote><p>UPDATE – Apparently a momentary spike in my superintelligence has caused more warps in the space-time continuum, as I am informed that <em>Going Postal</em> isn’t out until September 28th.  So, there’s probably not much point in rushing out to Barnes &amp; Noble tomorrow, although if this review happened to stimulate your interest in reading Pratchett, there are another 29 books to keep you occupied in the meantime for the next two weeks.<br/></p></div>",
  "content_text": "Going Postal\nTerry Pratchett\nRating: 8.5 of 10\nTerry Pratchett may be the most underrated writer of our time.  Humor, as any writer knows, is extremely difficult to write, and yet of all the writing genres it may be the least respected.  Add to that the fact that Pratchett is considered a writer of fantasy humor, which places him in a disrespected ghetto’s ghetto.  To write fantasy and be taken seriously, one must write in a language that is not English and betray no familiarity with Tolkein; this will earn one the more weighty title of fabulist, as Borges and Calvino are known.\nAnd yet Pratchett is a serious writer, a very serious writer.  For underneath his light-hearted, pun-filled stories – inevitably described, unfortunately, as “romps” by evil-minded critics – are insightful thought-provoking essays on the crime, government, technology and the nature of man.  Incredibly, he is able to engage the reader in these essays without sacrificing the story or overly stretching the magical, medievalesque environment in which the Discworld novels are set.\nHis feat in writing yet another excellent Discworld novel is particularly impressive since this is approximately the 30th in the series.  As is very unlike the case of most writers with extended series, Pratchett’s books have tended to get better as the series has progressed.  This may be, in part, because the books stand very well alone, as does\nGoing Postal\nStory:\n4 of 5.\nGoing Postal\nis, on one level, a tale of redemption that comes to an unwilling con man, who begins the novel with being hanged and finds things going swiftly downhill from there.  On another level, however, it is an angry and contemptuous dismissal of another sort of con man, the sort who brought us the dot com boom-and-bust and a righteous screed against the pirates of finance, who rape and pillage entrepeneurs, workers and customers alike with what Pratchett clearly considers to be a different kind of black magic.  You might not think, based on this description, that the story could possibly work; you would also be completely wrong.\nStyle:\n3.5 of 5.  The author’s inability to resist a pun can occasionally grow a bit old, until he comes up with one that is so wickedly clever that it requires reading twice to get and three times to fully appreciate.  He also has an ability to give his characters their own, individual voices and can accurately lampoon other writers’ styles when he wishes to insert the blade more deeply; I particularly like Lord Vetinari’s dry, literal and often lethal wit.\nCharacters:\n5 of 5.  Terry Pratchett is one of the better creators of characters writing in fantasy today.  In a few short paragraphs, he can create a unique character who stands out completely from the vast cast who already inhabit the crowded and filthy environs of Ankh-Morpork.  In\nGoing Postal\n, the polar antagonists are two very differnet con men, the unfortunate Moist von Lipvig and his adversary, Reacher Gilt.  His names, as one can see, sometimes lamentably appear to have been borrowed from the Isaac Asimov School of Ridiculous names; they are the only way in which his character sketches fall short.\nCreativity:\n4.5 of 5.  It’s quite clever how Pratchett works in an Internet stand-in that incorporates the revolution in communications, venture finance and even hackers without violating the spirit of his technologically backward world.  His use of secret societies for humorous effect is also creative, albeit in more obvious Discworldian fashion.  Despite the fact that one knows anything can happen on a flat world resting upon the backs of four elephants standing on the shell of one enormous turtle, one finds it nearily impossible to predict what Pratchett will come up with next.\nText Sample\n:\n“Yes,” said the golem.  “The Messages Must Be Delivered.  That Is Written On My\nChem\n.”\n“That’s the scroll in their heads that gives a golem his instructions,” said Miss Dearheart.  “In Anghammarad’s case, it’s a clay tablet.  They didn’t have paper in those days.”\n“You really used to deliver messages for kings?” said Groat.\n“Many Kings,” said Anghammarad.  Many Empires.  Many Gods.  Many Gods.  All Gone.  All Things Go,” the golem’s voice got deeper, as if he was quoting from memory.  “Neither Deluge Nor Ice Storm Nor The Black Silence Of The Netherhells Shall Stay These Messengers About Their Sacred Business.  Do Not Ask Us About Saber-Toothed Tigers, Tar Pits, Big Green Things With Teeth, Or The Goddess Czol.”\n“You had big green things with teeth back then?” said Tropes.\n“Bigger.  Greener.  More Teeth,” rumbled Anghammarad.\n“And the Goddess Czol?” said Moist.\n“Do Not Ask.”\nThere was a thoughtful silence.  Moist knew how to break it.  “And\nyou\nwill decide if\nhe\nis a postman?” he said softly….\nBy general agreement, Anghammarad was given the unique rank of Extremely Senior Postman.\nUPDATE – Apparently a momentary spike in my superintelligence has caused more warps in the space-time continuum, as I am informed that\nGoing Postal\nisn’t out until September 28th.  So, there’s probably not much point in rushing out to Barnes & Noble tomorrow, although if this review happened to stimulate your interest in reading Pratchett, there are another 29 books to keep you occupied in the meantime for the next two weeks.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-12T06:53:00+00:00"
}