{
  "url": "https://voxday.net/2004/09/03/bring-it-on-2/",
  "scraped_at": "2025-12-19T20:43:42.994374",
  "title": "BRING – IT – ON",
  "date_display": "September 3, 2004",
  "date_iso": "2004-09-03T08:58:00+00:00",
  "date_from_url": "2004-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Eric Muller <a href=\"http://volokh.com/archives/archive_2004_09_00.shtml#1094168564\">guest-blogs</a> at the Volokh Conspiracy:<br/></p><blockquote><p> <br>VOX DAY ON MILITARY NECESSITY:</br></p><p>According to Vox Day, any military historian worth his or her salt could tell you that the top military brass back in early 1942 knew that a full-blown Japanese assault on the U.S. mainland was inconceivable–and that their reliance on that rationale for evicting Japanese Americans from the West Coast was therefore bogus.</p><p>I’m no military historian, so I can’t really venture an opinion on whether or not Day is right about the forces and logistics that would have been necessary for a mainland assault. Perhaps others more expert than I might wish to respond.<br/></p></blockquote><p>I await with interest any arguments for the practicality of a credible large-scale amphibious invasion requiring a traverse of 5,500 miles.  Please spell out the requisite logistics as well as the number of troops needed to put the continued survival of the United States at stake, and how many ships would be required to transport and supply them.</p><p>UPDATE: I should add that as Admiral Yamamoto utilized <a href=\"http://www.microworks.net/pacific/orders_of_battle/midway_japan.htm\">almost the entire IJN</a> in the failed attempt on Midway, we can determine with reasonable precision how many Japanese troops could have invaded the West Coast.  I draw your attention to the transports, 3 of which landed troops on the Aleutian Islands, the other 12 being reserved for Midway.</p><p>Vice-Admiral Hosogawa’s Northern Area invasion fleet landed about 3,000 troops on Attu and 5,183 on Kiska.  As Admiral Yamamoto had four times the transports in the main fleet, the maximum number of troops that could possibly have landed on the US West Coast – and remember, the pro-internment case relies heavily on the fact that Midway took place AFTER the internments had begun – was 41,000.  That might sound like a lot, until one notes that the Allies landed over 100,000 troops in the failed Anzio invasion, (which does not include 14,000 troops that were brought in as reinforcements).  Those 114,000 troops, despite continuous supplies brought in daily, supplies that a hypothetical Japanese invasion one-third the size would not have had, never managed to break out of the small beachhead in which they were trapped for four months.</p><p>And Anzio is miniscule compared to Overlord, which landed 156,000 troops <em>on the first day alone</em> plus another 850,000 men, 148,000 vehicles, and 570,000 tons of supplies in the next three weeks.</p><p>The survival of the United States was never at stake.  Malkin has no case whatsoever.  If she has any intellectual honesty, she will admit that she was mistaken and disavow her despicable conclusion that the internments were justified on the basis of national security.<br/></p></div>",
  "content_text": "Eric Muller\nguest-blogs\nat the Volokh Conspiracy:\nVOX DAY ON MILITARY NECESSITY:\nAccording to Vox Day, any military historian worth his or her salt could tell you that the top military brass back in early 1942 knew that a full-blown Japanese assault on the U.S. mainland was inconceivable–and that their reliance on that rationale for evicting Japanese Americans from the West Coast was therefore bogus.\nI’m no military historian, so I can’t really venture an opinion on whether or not Day is right about the forces and logistics that would have been necessary for a mainland assault. Perhaps others more expert than I might wish to respond.\nI await with interest any arguments for the practicality of a credible large-scale amphibious invasion requiring a traverse of 5,500 miles.  Please spell out the requisite logistics as well as the number of troops needed to put the continued survival of the United States at stake, and how many ships would be required to transport and supply them.\nUPDATE: I should add that as Admiral Yamamoto utilized\nalmost the entire IJN\nin the failed attempt on Midway, we can determine with reasonable precision how many Japanese troops could have invaded the West Coast.  I draw your attention to the transports, 3 of which landed troops on the Aleutian Islands, the other 12 being reserved for Midway.\nVice-Admiral Hosogawa’s Northern Area invasion fleet landed about 3,000 troops on Attu and 5,183 on Kiska.  As Admiral Yamamoto had four times the transports in the main fleet, the maximum number of troops that could possibly have landed on the US West Coast – and remember, the pro-internment case relies heavily on the fact that Midway took place AFTER the internments had begun – was 41,000.  That might sound like a lot, until one notes that the Allies landed over 100,000 troops in the failed Anzio invasion, (which does not include 14,000 troops that were brought in as reinforcements).  Those 114,000 troops, despite continuous supplies brought in daily, supplies that a hypothetical Japanese invasion one-third the size would not have had, never managed to break out of the small beachhead in which they were trapped for four months.\nAnd Anzio is miniscule compared to Overlord, which landed 156,000 troops\non the first day alone\nplus another 850,000 men, 148,000 vehicles, and 570,000 tons of supplies in the next three weeks.\nThe survival of the United States was never at stake.  Malkin has no case whatsoever.  If she has any intellectual honesty, she will admit that she was mistaken and disavow her despicable conclusion that the internments were justified on the basis of national security.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-03T07:58:00+00:00"
}