{
  "url": "https://voxday.net/2004/09/20/case-of-massive-overki/",
  "scraped_at": "2025-12-19T20:46:33.610696",
  "title": "A case of massive overkill",
  "date_display": "September 20, 2004",
  "date_iso": "2004-09-20T22:08:00+00:00",
  "date_from_url": "2004-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m afraid that after spending five minutes actually looking at the case that Malkin makes for herself, as opposed the case I assumed she’d be making, I have to say that there is about a zero percent chance she’ll show up to debate.  I spoke too soon when I said there’s no shame in making a mistake.  Sometimes, it depends on the order of magnitude.</p><p>Let me put it this way.  If it takes me more than 30 seconds to demonstrate that a) Malkin made absolutely no attempt whatsoever to examine the question of military necessity for herself, and, b) that she is demonstrably less qualified to make any statement with regards to military necessity than she is to be the offensive coordinator for the Minnesota Vikings, and, c) cause the moderators to burst out laughing in the process, I’ll be hugely shocked.  I called Big Chilly; there was a moment of silence and the first words out of his mouth were: Are you kidding me?</p><p>It’s a good thing I enjoyed the research so much, because I didn’t even need to do most of it to discredit her.  She discredits herself with her own words, not just badly, but to the point that even her biggest fans are going to be cringing with embarrassment.  Some of you probably think I’m talking smack, others are already hearing the blades go <em>snicker-snack</em>.  Tune in to the Northern Alliance on Saturday and you’ll understand very quickly why I am supremely and completely confident of my case.<br/></p></div>",
  "content_text": "I’m afraid that after spending five minutes actually looking at the case that Malkin makes for herself, as opposed the case I assumed she’d be making, I have to say that there is about a zero percent chance she’ll show up to debate.  I spoke too soon when I said there’s no shame in making a mistake.  Sometimes, it depends on the order of magnitude.\nLet me put it this way.  If it takes me more than 30 seconds to demonstrate that a) Malkin made absolutely no attempt whatsoever to examine the question of military necessity for herself, and, b) that she is demonstrably less qualified to make any statement with regards to military necessity than she is to be the offensive coordinator for the Minnesota Vikings, and, c) cause the moderators to burst out laughing in the process, I’ll be hugely shocked.  I called Big Chilly; there was a moment of silence and the first words out of his mouth were: Are you kidding me?\nIt’s a good thing I enjoyed the research so much, because I didn’t even need to do most of it to discredit her.  She discredits herself with her own words, not just badly, but to the point that even her biggest fans are going to be cringing with embarrassment.  Some of you probably think I’m talking smack, others are already hearing the blades go\nsnicker-snack\n.  Tune in to the Northern Alliance on Saturday and you’ll understand very quickly why I am supremely and completely confident of my case.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-20T21:08:00+00:00"
}