{
  "url": "https://voxday.net/2004/09/01/credit-where-credit-is-due/",
  "scraped_at": "2025-12-19T20:43:26.409501",
  "title": "Credit where credit is due",
  "date_display": "September 1, 2004",
  "date_iso": "2004-09-01T12:13:00+00:00",
  "date_from_url": "2004-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not a huge fan of the Irish Water Poodle, Sean Hannity, but he can be amusingly quick-witted at times.  I quite enjoyed <a href=\"http://www.powerlineblog.com/archives/007668.php\">this little encounter</a> posted by Powerline:<br/></p><blockquote><p> <br>A few minutes ago, Terry McAuliffe appeared on Sean’s show. They went at it pretty hard, arguing about Vietnam and the war on terror. McAuliffe was stumped when Hannity asked him whether Kerry was lying when he said he spent Christmas in Cambodia.</br></p><p>I posted a little footage of McAuliffe’s appearance, and of the impromptu press conference he gave immediately after, right in front of us, where he talked about the protests against the RNC. McAuliffe strikes me as an amiable rogue, much like his pal Bill Clinton. As Hannity was going into a commercial break, McAuliffe got in one last cheap shot: “How’s your Halliburton stock doing?” To which Sean replied, “Not bad. How’s Global Crossing doing?”<br/></p></blockquote><p>Good stuff.  As for Mr. Limbaugh, I note that despite his supposedly vociferious opposition to campaign finance reform and the incipient Republican crackdown on free speech, <a href=\"http://www.rushlimbaugh.com/home/daily/site_083104/content/eib_interview.guest.html\">he did not find the time</a> to ask the President about that, although he was able to talk about what an “honor and a thrill” it was to speak with him, and how wonderful it was to hear the President’s “ebullience”.</p><p>Supine enough for you?  Sound like Santa to me.  I’m not saying that Rush should have nailed him to the wall, but he could certainly worked in a casual: “Mr. President, I’ve always regarded you as a staunch defender of American freedom.  Who in the name of the nethermost nether region advised you to advocate banning what is not only free speech, but free speech by your supporters, and when will you publicly hang, draw and quarter them?”<br/></p></div>",
  "content_text": "I’m not a huge fan of the Irish Water Poodle, Sean Hannity, but he can be amusingly quick-witted at times.  I quite enjoyed\nthis little encounter\nposted by Powerline:\nA few minutes ago, Terry McAuliffe appeared on Sean’s show. They went at it pretty hard, arguing about Vietnam and the war on terror. McAuliffe was stumped when Hannity asked him whether Kerry was lying when he said he spent Christmas in Cambodia.\nI posted a little footage of McAuliffe’s appearance, and of the impromptu press conference he gave immediately after, right in front of us, where he talked about the protests against the RNC. McAuliffe strikes me as an amiable rogue, much like his pal Bill Clinton. As Hannity was going into a commercial break, McAuliffe got in one last cheap shot: “How’s your Halliburton stock doing?” To which Sean replied, “Not bad. How’s Global Crossing doing?”\nGood stuff.  As for Mr. Limbaugh, I note that despite his supposedly vociferious opposition to campaign finance reform and the incipient Republican crackdown on free speech,\nhe did not find the time\nto ask the President about that, although he was able to talk about what an “honor and a thrill” it was to speak with him, and how wonderful it was to hear the President’s “ebullience”.\nSupine enough for you?  Sound like Santa to me.  I’m not saying that Rush should have nailed him to the wall, but he could certainly worked in a casual: “Mr. President, I’ve always regarded you as a staunch defender of American freedom.  Who in the name of the nethermost nether region advised you to advocate banning what is not only free speech, but free speech by your supporters, and when will you publicly hang, draw and quarter them?”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-01T11:13:00+00:00"
}