{
  "url": "https://voxday.net/2004/09/06/crying-would-work-better/",
  "scraped_at": "2025-12-19T20:44:16.787293",
  "title": "Crying would work better",
  "date_display": "September 6, 2004",
  "date_iso": "2004-09-06T13:12:00+00:00",
  "date_from_url": "2004-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unfortunately, Ms Malkin is proving to be a masochist, so we’ll have to go ahead with the spankings.  The spankings, the spankings!  Va bene.  She writes:<br/></p><blockquote><p> <br>Mr. Vox has got his facts wrong. There is no question that in early 1942 our military leaders believed the risk of a Japanese attack on the West Coast was substantial. Henry Stimson, President Roosevelt’s Secretary of War, stated in his autobiography that hit-and-run raids on the West Coast were “not only possible, but probable in the first months of the war, and it was quite impossible to be sure that the raiders would not receive important help from individuals of Japanese origin.” That is enough to knock down Mr. Vox’s argument, but if you are still not convinced, click below.<br/></br></p></blockquote><p>No, it isn’t enough to knock it down.  It isn’t even close.  She is either slow or disingenuous, and I’m beginning to suspect the former.  First, notice how she’s already retreated from her earlier justifications of “invasion” and the potential “crippling” of the war effort.  Now it’s spot raids.  Remember, this debate is not over whether the Japanese could fire a torpedo at someone’s yacht at the San Francisco Bay Club, but over whether the Executive Order overriding the Constitution and depriving 112,000 people of their rights was justified by military necessity.</p><p>She’s also relying on the post-facto CYA opinion of a civilian appointee – <em>how many troops do we need in Iraq, Mr. Rumsfeld?  No need for armor, Mr. Cohen?</em> – and blowing off that of a former member of the Joint Chiefs of Staff who arguably knows more about amphibious invasions past and present than any man alive.  Could the Japanese annoy us?  Sure.  Was the nation’s survival at stake?  Never.  Keep in mind that even at Pearl Harbor, the Japanese sunk only 6 out of 88 ships.<br/></p><blockquote><p> <br>As I noted in my book and in an earlier blog entry, the concern among our military leaders about a Japanese attack on the West Coast was palpable even after Executive Order 9066 was signed in February 1942: After the daring Halsey-Doolittle raid in Tokyo in April, “[e]ight Japanese carriers had returned from their operations around southeastern Asia and the Japanese could release at least three of the eight for a retaliatory attack on the west coast without jeopardizing successes already achieved,” Army historian Stetson Conn recounted. Secretary of War Stimson “called in General Marshall and had a few earnest words with him about the danger of a Jap attack on the West Cst.” Stimson confessed that he was “very much impressed with the danger that the Japanese, having terribly lost face by this recent attack on them … , will make a counterattack on us with carriers.” General DeWitt’s superiors warned him to be on guard against a carrier attack at any time after May 10 and was informed that two more antiaircraft regiments were being sent to bolster the Los Angeles and San Francisco defenses.<br/></br></p></blockquote><p>Three whole carriers – that means depending on the carriers, they had between 91 and 255 planes, many of which were fighters, at their disposal.  Not exactly the Battle of Britain.  Malkin knows so little about military history that she doesn’t even realize that the Halsey-Doolittle raid was solely for psychological effect.  It did zero damage to the Japanese war effort, and any retaliatory raid would have been for the same reasons and achieved the same miniscule effect.  Two whole AA regiments?  I wonder if Malkin knows that’s next to nothing.  Somehow, I doubt it.<br/></p><blockquote><p> <br>Preceding the pivotal Battle of Midway, which the U.S. was alerted to thanks to another extraordinary communications intelligence operation that partially cracked JN-25, the Japanese navy’s operational code, the West Coast again prepared for the worst. Gen. Marshall informed General DeWitt that a Japanese attack with a chemical weapon might be expected; in mid-May, 350,000 gas masks (the entire available supply), protective clothing, and decontamination supplies were hastily shipped to the west coast. MID concurred with the Navy that a strong Japanese attack on American territory was in the offing before the end of the month, but it forecast that the “first priority” target of the attack would be “hit and run raids on West Coast cities of the continental United States supported by heavy naval forces.” Army intelligence held that such action was entirely within Japanese capabilities, considering the weakness of American naval power, and urged the concentration on the Pacific coast of all available continental air power to meet the threat.<br/></br></p></blockquote><p>If “hit and run raids” were “the worst” and the “first priority”, then why does Malkin mention invasions and crippled war efforts?  Again, she demonstrates her ignorance of military matters is nearly complete.  The whole point of these efforts was about not letting the public become any more alarmed than they already were, which Malkin apparently is too blind to see.<br/></p><blockquote><p> <br>The perception among our military leaders of risks to the West Coast in early 1942 is so well documented that I am surprised one of my critics would choose this line of attack. Did Mr. Vox even bother to read my book before slamming it? There was no analogous concern, by the way, about a major German or Italian attack on the East Coast. Neither Germany nor Italy had any aircraft carriers, whereas Japan’s surface fleet was the best in the world. I will agree with Mr. Vox about one thing. The risk of a full-blown invasion of the U.S. mainland was low. This was known at the time. As I made clear in my book, the principal concern was spot raids on the West Coast (such as the one that occurred at Pearl Harbor), not a major invasion.<br/></br></p></blockquote><p>I’ll bet she was surprised, considering that she does not appear to have given the matter a moment’s thought, preferring to rely instead on bureaucratic self-justifications.  The best surface fleet in the world?  Better than the Royal Navy, which was not only more than twice as large but had more of <a href=\"http://www.fleetairarmarchive.net/Ships/Aircraftcarrierindex.html\">the aircraft carriers</a> with which Ms Malkin is so obsessed.  Low risk?  Try nonexistent.  While there was an awareness of the minor risk of petty raids among the military leaders, there were absolutely no concerns with regards to invasion or serious, much less “crippling”, damages to the war effort.</p><p>Furthermore, not only is she sidestepping the production issues that I’ve raised, she’s admitting that the ENTIRE PREMISE OF HER BOOK IS ABSURD!  Does she truly believe that spot raids which could not possibly have slowed the war effort justify locking up over a hundred thousand people?  If that’s true, then I suppose 9/11 and the threat of suitcase nukes justifies the preemptive execution of Arab-Americans.  And 327 ships sunk off the East Coast are to be ignored, since carrier-launched aircraft weren’t used, but 6 sunk on the West Coast are cause for throwing out the Constitution?  Not just pathetic, but bizarre stuff.</p><p>Since Ms Malkin clearly likes to try to play referee as well and declare herself the winner, she might benefit from hearing a more neutral opinion at malkin@comcast.net.<br/></p></div>",
  "content_text": "Unfortunately, Ms Malkin is proving to be a masochist, so we’ll have to go ahead with the spankings.  The spankings, the spankings!  Va bene.  She writes:\nMr. Vox has got his facts wrong. There is no question that in early 1942 our military leaders believed the risk of a Japanese attack on the West Coast was substantial. Henry Stimson, President Roosevelt’s Secretary of War, stated in his autobiography that hit-and-run raids on the West Coast were “not only possible, but probable in the first months of the war, and it was quite impossible to be sure that the raiders would not receive important help from individuals of Japanese origin.” That is enough to knock down Mr. Vox’s argument, but if you are still not convinced, click below.\nNo, it isn’t enough to knock it down.  It isn’t even close.  She is either slow or disingenuous, and I’m beginning to suspect the former.  First, notice how she’s already retreated from her earlier justifications of “invasion” and the potential “crippling” of the war effort.  Now it’s spot raids.  Remember, this debate is not over whether the Japanese could fire a torpedo at someone’s yacht at the San Francisco Bay Club, but over whether the Executive Order overriding the Constitution and depriving 112,000 people of their rights was justified by military necessity.\nShe’s also relying on the post-facto CYA opinion of a civilian appointee –\nhow many troops do we need in Iraq, Mr. Rumsfeld?  No need for armor, Mr. Cohen?\n– and blowing off that of a former member of the Joint Chiefs of Staff who arguably knows more about amphibious invasions past and present than any man alive.  Could the Japanese annoy us?  Sure.  Was the nation’s survival at stake?  Never.  Keep in mind that even at Pearl Harbor, the Japanese sunk only 6 out of 88 ships.\nAs I noted in my book and in an earlier blog entry, the concern among our military leaders about a Japanese attack on the West Coast was palpable even after Executive Order 9066 was signed in February 1942: After the daring Halsey-Doolittle raid in Tokyo in April, “[e]ight Japanese carriers had returned from their operations around southeastern Asia and the Japanese could release at least three of the eight for a retaliatory attack on the west coast without jeopardizing successes already achieved,” Army historian Stetson Conn recounted. Secretary of War Stimson “called in General Marshall and had a few earnest words with him about the danger of a Jap attack on the West Cst.” Stimson confessed that he was “very much impressed with the danger that the Japanese, having terribly lost face by this recent attack on them … , will make a counterattack on us with carriers.” General DeWitt’s superiors warned him to be on guard against a carrier attack at any time after May 10 and was informed that two more antiaircraft regiments were being sent to bolster the Los Angeles and San Francisco defenses.\nThree whole carriers – that means depending on the carriers, they had between 91 and 255 planes, many of which were fighters, at their disposal.  Not exactly the Battle of Britain.  Malkin knows so little about military history that she doesn’t even realize that the Halsey-Doolittle raid was solely for psychological effect.  It did zero damage to the Japanese war effort, and any retaliatory raid would have been for the same reasons and achieved the same miniscule effect.  Two whole AA regiments?  I wonder if Malkin knows that’s next to nothing.  Somehow, I doubt it.\nPreceding the pivotal Battle of Midway, which the U.S. was alerted to thanks to another extraordinary communications intelligence operation that partially cracked JN-25, the Japanese navy’s operational code, the West Coast again prepared for the worst. Gen. Marshall informed General DeWitt that a Japanese attack with a chemical weapon might be expected; in mid-May, 350,000 gas masks (the entire available supply), protective clothing, and decontamination supplies were hastily shipped to the west coast. MID concurred with the Navy that a strong Japanese attack on American territory was in the offing before the end of the month, but it forecast that the “first priority” target of the attack would be “hit and run raids on West Coast cities of the continental United States supported by heavy naval forces.” Army intelligence held that such action was entirely within Japanese capabilities, considering the weakness of American naval power, and urged the concentration on the Pacific coast of all available continental air power to meet the threat.\nIf “hit and run raids” were “the worst” and the “first priority”, then why does Malkin mention invasions and crippled war efforts?  Again, she demonstrates her ignorance of military matters is nearly complete.  The whole point of these efforts was about not letting the public become any more alarmed than they already were, which Malkin apparently is too blind to see.\nThe perception among our military leaders of risks to the West Coast in early 1942 is so well documented that I am surprised one of my critics would choose this line of attack. Did Mr. Vox even bother to read my book before slamming it? There was no analogous concern, by the way, about a major German or Italian attack on the East Coast. Neither Germany nor Italy had any aircraft carriers, whereas Japan’s surface fleet was the best in the world. I will agree with Mr. Vox about one thing. The risk of a full-blown invasion of the U.S. mainland was low. This was known at the time. As I made clear in my book, the principal concern was spot raids on the West Coast (such as the one that occurred at Pearl Harbor), not a major invasion.\nI’ll bet she was surprised, considering that she does not appear to have given the matter a moment’s thought, preferring to rely instead on bureaucratic self-justifications.  The best surface fleet in the world?  Better than the Royal Navy, which was not only more than twice as large but had more of\nthe aircraft carriers\nwith which Ms Malkin is so obsessed.  Low risk?  Try nonexistent.  While there was an awareness of the minor risk of petty raids among the military leaders, there were absolutely no concerns with regards to invasion or serious, much less “crippling”, damages to the war effort.\nFurthermore, not only is she sidestepping the production issues that I’ve raised, she’s admitting that the ENTIRE PREMISE OF HER BOOK IS ABSURD!  Does she truly believe that spot raids which could not possibly have slowed the war effort justify locking up over a hundred thousand people?  If that’s true, then I suppose 9/11 and the threat of suitcase nukes justifies the preemptive execution of Arab-Americans.  And 327 ships sunk off the East Coast are to be ignored, since carrier-launched aircraft weren’t used, but 6 sunk on the West Coast are cause for throwing out the Constitution?  Not just pathetic, but bizarre stuff.\nSince Ms Malkin clearly likes to try to play referee as well and declare herself the winner, she might benefit from hearing a more neutral opinion at malkin@comcast.net.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-06T12:12:00+00:00"
}