{
  "url": "https://voxday.net/2004/09/20/eminent-shadows/",
  "scraped_at": "2025-12-19T20:46:24.407856",
  "title": "Eminent shadows",
  "date_display": "September 20, 2004",
  "date_iso": "2004-09-20T09:58:00+00:00",
  "date_from_url": "2004-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>George Will warns of more rights being lost:<br/></p><blockquote><p> <br>Soon — perhaps on the first Monday in October — the [Supreme] court will announce whether it will hear an appeal against a 4-3 ruling last March by Connecticut’s Supreme Court. That ruling effectively repeals a crucial portion of the Bill of Rights. If you think the term “despotism” exaggerates what this repeal permits, consider the life-shattering power wielded by the government of New London, Conn.</br></p><p>That city, like many cities, needs more revenues. To enhance the Pfizer pharmaceutical company’s $270 million research facility, it empowered a private entity, the New London Development Corporation, <a href=\"http://www.townhall.com/columnists/georgewill/gw20040919.shtml\">to exercise the power of eminent domain</a> to condemn most of the Fort Trumbull neighborhood along the Thames River. The aim is to make space for upscale condominiums, a luxury hotel and private offices that would yield the city more tax revenues than can be extracted from the neighborhood’s middle-class homeowners.<br/></p></blockquote><p>If the Supreme Court refuses to hear this case, it will be a truly ominous testimony to the extent to which creeping left-wing fascism is moving from the shadows and out into the open.  I wonder which “conservative Republicans” will hail a decision favorable to the New London government as a wise and correct move, despite its total destruction of what remains of our Constitutionally-protected property rights.</p><p>I think it’s past time to call for a Constitutional amendment banning eminent domain.  You’d think there’d be plenty of politicians who would support absolute invidual property rights, and you’d also almost certainly be wrong.<br/></p></div>",
  "content_text": "George Will warns of more rights being lost:\nSoon — perhaps on the first Monday in October — the [Supreme] court will announce whether it will hear an appeal against a 4-3 ruling last March by Connecticut’s Supreme Court. That ruling effectively repeals a crucial portion of the Bill of Rights. If you think the term “despotism” exaggerates what this repeal permits, consider the life-shattering power wielded by the government of New London, Conn.\nThat city, like many cities, needs more revenues. To enhance the Pfizer pharmaceutical company’s $270 million research facility, it empowered a private entity, the New London Development Corporation,\nto exercise the power of eminent domain\nto condemn most of the Fort Trumbull neighborhood along the Thames River. The aim is to make space for upscale condominiums, a luxury hotel and private offices that would yield the city more tax revenues than can be extracted from the neighborhood’s middle-class homeowners.\nIf the Supreme Court refuses to hear this case, it will be a truly ominous testimony to the extent to which creeping left-wing fascism is moving from the shadows and out into the open.  I wonder which “conservative Republicans” will hail a decision favorable to the New London government as a wise and correct move, despite its total destruction of what remains of our Constitutionally-protected property rights.\nI think it’s past time to call for a Constitutional amendment banning eminent domain.  You’d think there’d be plenty of politicians who would support absolute invidual property rights, and you’d also almost certainly be wrong.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-20T08:58:00+00:00"
}