{
  "url": "https://voxday.net/2004/09/23/floating-proposals/",
  "scraped_at": "2025-12-19T20:46:55.753048",
  "title": "Floating proposals",
  "date_display": "September 23, 2004",
  "date_iso": "2004-09-23T07:05:00+00:00",
  "date_from_url": "2004-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s an interesting dichotomy on how the right’s own biases can come into play.  Because, let’s face it, we have our own biases, just as the left does and it’s foolish to make the same mistake they do by trying to deny it.  When Robert Novak wrote about how the Bush administration is planning to withdraw from Iraq immediately after winning re-election earlier this week, it was dismissed by many right-wing commentators who are fans of the war as the mere floating of a proposal.  In light of that, consider <a href=\"http://www.isthatlegal.org/archives/2004_09_19_isthatlegal_archive.html#109588790758659695\">Eric Muller’s recent point</a> about John Leo’s support of “In Defense of Internment”:<br/></p><blockquote><p> <br>John Leo read Michelle Malkin’s book “In Defense of Internment” and concluded that it’s time to open debate on internment “past and present.”</br></p><p>Malkin has expressed frustration when I (and others) have read her book as endorsing the internment of Arabs and Muslims. How could we make such a mistake, she has wondered, when she says in her book (in one sentence) that she’s “not advocating rounding up all Arabs of Muslims and tossing them into camps?”</p><p>So you’d think that when Leo uses her book to call for a debate on “present” internments, Malkin would say it’s a misunderstanding of her views.</p><p>Nope. She calls it a favorable review.<br/></p></blockquote><p>Regardless of whether you agree with the notion of interning Muslims without regard for civil liberties or not, the conclusion you cannot escape is that Malkin’s logic in defense of the historical internments REQUIRES support for modern internments, because America is at more verifiable danger from Koreans, Iraqis, Iranians, Saudis, Yemenis, Syrians, Afghanis and Chechens than we ever were from ethnic Japanese.</p><p>If it is deemed not only possible, but even likely, for Robert Novak to float policy proposals, is it so improbable that Michelle Malkin is being used to do the same?  Perhaps Prof. Muller, the anti-internment left-winger liberal japonicus and I are the only ones who hear this ominous drumbeat beginning, but the extent to which Malkin, Leo and others are willing to lie and warp history in defense of this newly declared debate on “present” internments should seriously trouble any of you who claim to believe in the supremacy of the individual over the collective.<br/></p></div>",
  "content_text": "Here’s an interesting dichotomy on how the right’s own biases can come into play.  Because, let’s face it, we have our own biases, just as the left does and it’s foolish to make the same mistake they do by trying to deny it.  When Robert Novak wrote about how the Bush administration is planning to withdraw from Iraq immediately after winning re-election earlier this week, it was dismissed by many right-wing commentators who are fans of the war as the mere floating of a proposal.  In light of that, consider\nEric Muller’s recent point\nabout John Leo’s support of “In Defense of Internment”:\nJohn Leo read Michelle Malkin’s book “In Defense of Internment” and concluded that it’s time to open debate on internment “past and present.”\nMalkin has expressed frustration when I (and others) have read her book as endorsing the internment of Arabs and Muslims. How could we make such a mistake, she has wondered, when she says in her book (in one sentence) that she’s “not advocating rounding up all Arabs of Muslims and tossing them into camps?”\nSo you’d think that when Leo uses her book to call for a debate on “present” internments, Malkin would say it’s a misunderstanding of her views.\nNope. She calls it a favorable review.\nRegardless of whether you agree with the notion of interning Muslims without regard for civil liberties or not, the conclusion you cannot escape is that Malkin’s logic in defense of the historical internments REQUIRES support for modern internments, because America is at more verifiable danger from Koreans, Iraqis, Iranians, Saudis, Yemenis, Syrians, Afghanis and Chechens than we ever were from ethnic Japanese.\nIf it is deemed not only possible, but even likely, for Robert Novak to float policy proposals, is it so improbable that Michelle Malkin is being used to do the same?  Perhaps Prof. Muller, the anti-internment left-winger liberal japonicus and I are the only ones who hear this ominous drumbeat beginning, but the extent to which Malkin, Leo and others are willing to lie and warp history in defense of this newly declared debate on “present” internments should seriously trouble any of you who claim to believe in the supremacy of the individual over the collective.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-23T06:05:00+00:00"
}