{
  "url": "https://voxday.net/2004/09/17/gloating-is-good/",
  "scraped_at": "2025-12-19T20:46:09.641196",
  "title": "Gloating is good",
  "date_display": "September 17, 2004",
  "date_iso": "2004-09-17T19:05:00+00:00",
  "date_from_url": "2004-09-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As those few whose interest in the NFL is entirely too active may recall, the Grim Reaper is a label that Chokechain stuck me with.  This is due to my tendency to draft one or two of the better backups to some of the league’s more fragile running backs, such as Stephen Jackson (Marshall Faulk), and DeShaun Foster (Stephen Davis).  Imagine my chagrin when I saw the following headline, considering that I’d dropped Foster just prior to the start of the season:</p><p><b>Panthers may lose Davis for up to five weeks</b></p><p>But then I remembered that my foe for the upcoming week had picked up Foster <em>and dropped him again!</em> Ha!  I quickly zoomed over to our league site and welcomed Foster back to the squad – I’d also had him and Davis last year – and will take great pleasure in unleashing him against a weak KC run defense on the wretched Wallabies this Sunday.<br/></p></div>",
  "content_text": "As those few whose interest in the NFL is entirely too active may recall, the Grim Reaper is a label that Chokechain stuck me with.  This is due to my tendency to draft one or two of the better backups to some of the league’s more fragile running backs, such as Stephen Jackson (Marshall Faulk), and DeShaun Foster (Stephen Davis).  Imagine my chagrin when I saw the following headline, considering that I’d dropped Foster just prior to the start of the season:\nPanthers may lose Davis for up to five weeks\nBut then I remembered that my foe for the upcoming week had picked up Foster\nand dropped him again!\nHa!  I quickly zoomed over to our league site and welcomed Foster back to the squad – I’d also had him and Davis last year – and will take great pleasure in unleashing him against a weak KC run defense on the wretched Wallabies this Sunday.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-17T18:05:00+00:00"
}