{
  "url": "https://voxday.net/2004/09/03/glue-and-dog-food/",
  "scraped_at": "2025-12-19T20:43:46.667284",
  "title": "Glue and dog food",
  "date_display": "September 3, 2004",
  "date_iso": "2004-09-03T14:07:00+00:00",
  "date_from_url": "2004-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Greg Robinson <a href=\"http://volokh.com/archives/archive_2004_09_00.shtml#1094217469\">kicks the dead horse in the head</a>:<br/></p><blockquote><p> <br>It’s from June 25, 1942, and reflects a conversation that King had with Roosevelt in Washington during a meeting of the Pacific War Council….  According to King, Roosevelt “said he thought the Japanese were foolish in thinking we would be much affected by these attacks they were making on the Pacific Coast. That it was not likely to alarm the people unduly but rather to strengthen their feeling of resistance. <b>It was clear that he, himself, did not contemplate much in the way of an attack on our Pacific Coast</b> but felt that the possession of the bases at Kiska [in the Aleutian chain] and elsewhere were to help to meet the situation that might develop between Japan and Russia.”<br/></br></p></blockquote><p>Some of you seem to wonder why I’m so bloody-minded about the internment case.  First, it’s related to an area of childhood interest, so I knew that the notion was off-base from the start.  Also, I despise the advocacy of big government, like PJ O’Rourke I see it as treason to the human race.  But to see this sort of evil governance celebrated and justified by one who is supposed to be a leading new conservative voice is particularly disgusting.</p><p>There’s also the sheer disbelief that anyone could take this nonsense seriously for more than five seconds.  I don’t begrudge anyone a successful book, as I know how difficult the process is, but this sort of thing is worse than the Lizard Queen’s fiction.  When I first heard about the Malkin book on Powerline, I had to read the post twice before I actually registered what position she was taking.  It’s almost as ridiculous as Eric Alterman’s thesis that the media is right-wing because it is corporate-owned.  The two of them are the bookend charlatans of the next-generation commentariat.<br/></p></div>",
  "content_text": "Greg Robinson\nkicks the dead horse in the head\n:\nIt’s from June 25, 1942, and reflects a conversation that King had with Roosevelt in Washington during a meeting of the Pacific War Council….  According to King, Roosevelt “said he thought the Japanese were foolish in thinking we would be much affected by these attacks they were making on the Pacific Coast. That it was not likely to alarm the people unduly but rather to strengthen their feeling of resistance.\nIt was clear that he, himself, did not contemplate much in the way of an attack on our Pacific Coast\nbut felt that the possession of the bases at Kiska [in the Aleutian chain] and elsewhere were to help to meet the situation that might develop between Japan and Russia.”\nSome of you seem to wonder why I’m so bloody-minded about the internment case.  First, it’s related to an area of childhood interest, so I knew that the notion was off-base from the start.  Also, I despise the advocacy of big government, like PJ O’Rourke I see it as treason to the human race.  But to see this sort of evil governance celebrated and justified by one who is supposed to be a leading new conservative voice is particularly disgusting.\nThere’s also the sheer disbelief that anyone could take this nonsense seriously for more than five seconds.  I don’t begrudge anyone a successful book, as I know how difficult the process is, but this sort of thing is worse than the Lizard Queen’s fiction.  When I first heard about the Malkin book on Powerline, I had to read the post twice before I actually registered what position she was taking.  It’s almost as ridiculous as Eric Alterman’s thesis that the media is right-wing because it is corporate-owned.  The two of them are the bookend charlatans of the next-generation commentariat.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-03T13:07:00+00:00"
}