{
  "url": "https://voxday.net/2004/09/08/howard-stern-was-rig/",
  "scraped_at": "2025-12-19T20:44:35.277359",
  "title": "Howard Stern was right",
  "date_display": "September 8, 2004",
  "date_iso": "2004-09-08T19:54:00+00:00",
  "date_from_url": "2004-09-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>A few weeks ago, HSLDA reports, a German homeschool family escaped to Central America under threat of a judge who wanted to take custody of the couple’s school-aged child. A social worker helped the family escape by warning them of the judge’s intent and delaying the paperwork needed for the seizure.</br></p><p>In another instance, a family escaped with their child to Austria. According to HSLDA, even though the family no longer lived in Germany, a judge gave custody of the child to the state and let the family know if it ever returned to Germany, the child would be taken.</p><p>Another German homeschool family lost a recent court case when the judge ruled that the parents had no rights to have input into the manner and method of education in government schools. In this case, hard-core pornography reportedly was being used to teach the children in their German-language course. The judge also ruled that fundamentalist Christians who do not want their children to attend the government schools are not protected by the nation’s constitution.<br/></p></blockquote><p>Some years ago, a few Germans started messing with a black member of the US bobsled team.  It was a big mistake, as the bobsledders kicked a little German <em>Hinterteil</em> because, well, you know, USA USA and all that.  Anyhow, Stern was going off on the Teutonics and unveiled his Churchillian theory that the USA should go in and kick <em>Hinterteil</em> every twenty years just on principle.  I thought that was wise at the time, now that we’ve seen how they used the French to talk the entire continent into volunteering for the Fourth Reich, he looks like a prophet.<br/></p></div>",
  "content_text": "A few weeks ago, HSLDA reports, a German homeschool family escaped to Central America under threat of a judge who wanted to take custody of the couple’s school-aged child. A social worker helped the family escape by warning them of the judge’s intent and delaying the paperwork needed for the seizure.\nIn another instance, a family escaped with their child to Austria. According to HSLDA, even though the family no longer lived in Germany, a judge gave custody of the child to the state and let the family know if it ever returned to Germany, the child would be taken.\nAnother German homeschool family lost a recent court case when the judge ruled that the parents had no rights to have input into the manner and method of education in government schools. In this case, hard-core pornography reportedly was being used to teach the children in their German-language course. The judge also ruled that fundamentalist Christians who do not want their children to attend the government schools are not protected by the nation’s constitution.\nSome years ago, a few Germans started messing with a black member of the US bobsled team.  It was a big mistake, as the bobsledders kicked a little German\nHinterteil\nbecause, well, you know, USA USA and all that.  Anyhow, Stern was going off on the Teutonics and unveiled his Churchillian theory that the USA should go in and kick\nHinterteil\nevery twenty years just on principle.  I thought that was wise at the time, now that we’ve seen how they used the French to talk the entire continent into volunteering for the Fourth Reich, he looks like a prophet.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-08T18:54:00+00:00"
}