{
  "url": "https://voxday.net/2004/09/15/i-told-you-they-knew/",
  "scraped_at": "2025-12-19T20:45:49.502874",
  "title": "I told you they knew",
  "date_display": "September 15, 2004",
  "date_iso": "2004-09-15T18:11:00+00:00",
  "date_from_url": "2004-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s becoming ever more clear, ridiculously so, that Malkin didn’t spend 30 seconds looking into the military necessity of internment.  Furthermore, it’s also clear that FDR and his strategists spent a tremendous amount of time <a href=\"http://www.au.af.mil/au/awc/awcgate/readings/awpd-1-jfacc/awpdproc.htm\">examining the very issues</a> that many are falsely claiming to have been matters of hindsight.<br/></p><blockquote><p> <br>In August 1941, four men, all former instructors at the Air Corps Tactical School (ACTS) at Maxwell Field, Alabama, reported to the Air War Plans Division (AWPD) in Washington, D.C., to lay the foundation for a comprehensive, strategic air war plan. Lt Col Hal George called upon Maj Laurence Kuter, Maj Ken Walker, and Maj Haywood S. Hansell Jr. to answer a request from President Franklin D. Roosevelt for a “production plan to defeat our enemies”–one that would outline specific air requirements for industrial mobilization should the United States become embroiled in a war. After nine days, the team delivered a briefing to Gen Henry Arnold and Gen George C. Marshall that specified production requirements for 13,083 bombers; 8,775 fighters; 2,043 observation and photographic aircraft; 2,560 transports; and 37,051 trainers–an astounding total of 63,512 aircraft. Although these numbers were impressive, the planners exceeded Roosevelt’s tasking by recommending a strategy for prosecuting the war against the Axis powers. That strategy assumed that airpower could achieve strategic and political objectives in a fundamentally new way.<br/></br></p></blockquote><p>As for the question of whether the strategists were paying attention to the enemy’s production capacities:<br/></p><blockquote><p> <br>The German combat estimate of 1 September 1939 did not present exact figures on the production capacity of aircraft industries in Germany, but estimates based on the previous year’s output established that Germany could produce between 9,000 and 10,000 military and commercial airplanes in 1939.<br/></br></p></blockquote><p>I don’t have figures for 1939, but these planners obviously knew what they were doing.  Germany produced 10,200 warplanes in 1940.  Not bad at all.  The goals of AWPD-1 were clear – Japan was not a serious threat, so a defensive war could be fought in the Pacific until Germany was crushed, at which point the Japanese would be dealt with.  The plan remained largely unchanged even after Pearl Harbor.<br/></p><blockquote><p> <br>Following the guidelines established in ABC-1, we broke down the strategic problem into the following divisions:</br></p><p>First: To conduct air operations in defense of the Western Hemisphere.</p><p>Second: To prosecute as soon as possible, after the commencement of war, an “unremitting and sustained air offensive against Germany.”</p><p>Third: To support a strategic defense in the Pacific Theater.</p><p>Fourth: To provide air support for the invasion of the European Continent if that should be necessary, and to continue to conduct strategic air operations thereafter against the foundations of German military power and the German state until its collapse.</p><p>Fifth: After victory over Germany, to concentrate maximum air power for a strategic air offensive against the home islands of Japan….</p><p><em>The Impact of Pearl Harbor</em></p><p>At first the loss of the capital ships at Pearl Harbor seemed to strengthen rather than weaken the relative merits of AWPD-1. While AWPD-1 did remain basic, however, the disaster at Pearl Harbor provoked a new and hard look at overall U.S. strategic thinking. The war was now truly “global.” The Russians had temporarily stopped the Germans outside Moscow with their December counter-offensive, but the outlook in that theater was still so bleak that Russia’s demise was still expected by the following spring. The situation, in short, was desperate the world over. Britain still faced the possibility of an invasion by Germany after the fall of Russia, and with the U. S. fleet out of action, a period of rapid and vast Japanese expansion was inevitable in the Far East. <b>Thus, while “defeat of Germany first” still seemed the logical approach, there was much public opposition to it.</b> Moreover, it was no comfort that even with the war in Europe won, the Pacific presented vast logistical problems, and territory, now lost with ease, would have to be regained by long and bloody fighting.</p><p>These considerations led the Air War Plans Division to take a hard look at its own plan and consider what revisions, if any, might be desirable. The same planning team (although Colonel Orvil Anderson had since replaced Larry Kuter) went to work and, on 15 December, only eight days after Pearl Harbor, came up with a new “Air Estimate of the Situation and Recommendation for the Conduct of the War.”</p><p>The new estimate proposed a general increase in combat units and aircraft, and a marked increased in air transports. The increase in bomber strength reflected the loss of sea power in the Pacific and our apprehension that the bombers consigned to the strategic air war in Europe might be reassigned–or diluted in number–to meet emergency demands from the Pacific. The increase in transports reflected the loss of control of sea lanes and the growing dependency upon air transportation.</p><p>Meanwhile, almost immediately after Pearl Harbor, Winston Churchill asked to meet with the President along with their respective military advisors to determine a united grand strategy. The first meeting of the heads of government and the Combined Chiefs of Staff took place in Washington. Called the Arcadia Conference, it lasted from 22 December 1941 through 14 January 1942.</p><p>At this conference, the growth and ultimate size of the armed forces were considered. Naturally the air strategy and requirements were discussed. The Combined Chiefs did not favor such an overriding priority for the Army Air Forces as that proposed in the most recent estimate. The Combined Staff did, however, accept AWPD-1, with some modifications, as a guide for the development of the air forces of the U.S. Army.<br/></p></blockquote><p>And how did FDR handle the public opposition to what the strategists considered to be the logical way to handle the war?  Quite simply, he pandered to public fears by interning and relocating the ethnic Japanese.  But there was no genuine military necessity for it, none whatsoever, according to the actual war plans written by FDR’s top military strategists.  As Malkin is probably too shameless to cave even before this evidence, I’ll see if I can dig up the post-Pearl document mentioned to complete the <em>canisescasation</em> of her deceased pony.<br/></p></div>",
  "content_text": "It’s becoming ever more clear, ridiculously so, that Malkin didn’t spend 30 seconds looking into the military necessity of internment.  Furthermore, it’s also clear that FDR and his strategists spent a tremendous amount of time\nexamining the very issues\nthat many are falsely claiming to have been matters of hindsight.\nIn August 1941, four men, all former instructors at the Air Corps Tactical School (ACTS) at Maxwell Field, Alabama, reported to the Air War Plans Division (AWPD) in Washington, D.C., to lay the foundation for a comprehensive, strategic air war plan. Lt Col Hal George called upon Maj Laurence Kuter, Maj Ken Walker, and Maj Haywood S. Hansell Jr. to answer a request from President Franklin D. Roosevelt for a “production plan to defeat our enemies”–one that would outline specific air requirements for industrial mobilization should the United States become embroiled in a war. After nine days, the team delivered a briefing to Gen Henry Arnold and Gen George C. Marshall that specified production requirements for 13,083 bombers; 8,775 fighters; 2,043 observation and photographic aircraft; 2,560 transports; and 37,051 trainers–an astounding total of 63,512 aircraft. Although these numbers were impressive, the planners exceeded Roosevelt’s tasking by recommending a strategy for prosecuting the war against the Axis powers. That strategy assumed that airpower could achieve strategic and political objectives in a fundamentally new way.\nAs for the question of whether the strategists were paying attention to the enemy’s production capacities:\nThe German combat estimate of 1 September 1939 did not present exact figures on the production capacity of aircraft industries in Germany, but estimates based on the previous year’s output established that Germany could produce between 9,000 and 10,000 military and commercial airplanes in 1939.\nI don’t have figures for 1939, but these planners obviously knew what they were doing.  Germany produced 10,200 warplanes in 1940.  Not bad at all.  The goals of AWPD-1 were clear – Japan was not a serious threat, so a defensive war could be fought in the Pacific until Germany was crushed, at which point the Japanese would be dealt with.  The plan remained largely unchanged even after Pearl Harbor.\nFollowing the guidelines established in ABC-1, we broke down the strategic problem into the following divisions:\nFirst: To conduct air operations in defense of the Western Hemisphere.\nSecond: To prosecute as soon as possible, after the commencement of war, an “unremitting and sustained air offensive against Germany.”\nThird: To support a strategic defense in the Pacific Theater.\nFourth: To provide air support for the invasion of the European Continent if that should be necessary, and to continue to conduct strategic air operations thereafter against the foundations of German military power and the German state until its collapse.\nFifth: After victory over Germany, to concentrate maximum air power for a strategic air offensive against the home islands of Japan….\nThe Impact of Pearl Harbor\nAt first the loss of the capital ships at Pearl Harbor seemed to strengthen rather than weaken the relative merits of AWPD-1. While AWPD-1 did remain basic, however, the disaster at Pearl Harbor provoked a new and hard look at overall U.S. strategic thinking. The war was now truly “global.” The Russians had temporarily stopped the Germans outside Moscow with their December counter-offensive, but the outlook in that theater was still so bleak that Russia’s demise was still expected by the following spring. The situation, in short, was desperate the world over. Britain still faced the possibility of an invasion by Germany after the fall of Russia, and with the U. S. fleet out of action, a period of rapid and vast Japanese expansion was inevitable in the Far East.\nThus, while “defeat of Germany first” still seemed the logical approach, there was much public opposition to it.\nMoreover, it was no comfort that even with the war in Europe won, the Pacific presented vast logistical problems, and territory, now lost with ease, would have to be regained by long and bloody fighting.\nThese considerations led the Air War Plans Division to take a hard look at its own plan and consider what revisions, if any, might be desirable. The same planning team (although Colonel Orvil Anderson had since replaced Larry Kuter) went to work and, on 15 December, only eight days after Pearl Harbor, came up with a new “Air Estimate of the Situation and Recommendation for the Conduct of the War.”\nThe new estimate proposed a general increase in combat units and aircraft, and a marked increased in air transports. The increase in bomber strength reflected the loss of sea power in the Pacific and our apprehension that the bombers consigned to the strategic air war in Europe might be reassigned–or diluted in number–to meet emergency demands from the Pacific. The increase in transports reflected the loss of control of sea lanes and the growing dependency upon air transportation.\nMeanwhile, almost immediately after Pearl Harbor, Winston Churchill asked to meet with the President along with their respective military advisors to determine a united grand strategy. The first meeting of the heads of government and the Combined Chiefs of Staff took place in Washington. Called the Arcadia Conference, it lasted from 22 December 1941 through 14 January 1942.\nAt this conference, the growth and ultimate size of the armed forces were considered. Naturally the air strategy and requirements were discussed. The Combined Chiefs did not favor such an overriding priority for the Army Air Forces as that proposed in the most recent estimate. The Combined Staff did, however, accept AWPD-1, with some modifications, as a guide for the development of the air forces of the U.S. Army.\nAnd how did FDR handle the public opposition to what the strategists considered to be the logical way to handle the war?  Quite simply, he pandered to public fears by interning and relocating the ethnic Japanese.  But there was no genuine military necessity for it, none whatsoever, according to the actual war plans written by FDR’s top military strategists.  As Malkin is probably too shameless to cave even before this evidence, I’ll see if I can dig up the post-Pearl document mentioned to complete the\ncanisescasation\nof her deceased pony.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-15T17:11:00+00:00"
}