{
  "url": "https://voxday.net/2004/09/16/interrogation-of-admiral-toyoda/",
  "scraped_at": "2025-12-19T20:45:55.031502",
  "title": "Interrogation of Admiral Toyoda",
  "date_display": "September 16, 2004",
  "date_iso": "2004-09-16T07:58:00+00:00",
  "date_from_url": "2004-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br><a href=\"http://www.ibiblio.org/hyperwar/AAF/USSBS/IJO/IJO-75.html\">INTERROGATION NAV NO. 75 </a><br> <br>USSBS NO. 378<br> <br>JAPANESE WAR PLANS AND PEACE MOVES<br> <br>TOKYO\t13-14 November 1945</br></br></br></br></br></br></br></p><p>Personnel interrogated and background of each:</p><p>Interrogation of: Admiral TOYODA , Soemu; September 1941, CinC KURE NavSta; November 1942 appointed Supreme Military Counsellor, residing in TOKYO. May 1943 became CinC YOKOSUKA NavSta. May 1944 became CinC Combined Fleet succeeding Admiral KOGA when latter was killed. May 1945 appointed Chief of Naval General Staff; later post superseded by position of Chief, Naval Combined Forces, September 1945 which he held until dissolution of that organization 15 October 1945.</p><p>Interrogated by: Rear Admiral R.A. OFSTIE, USN; Maj. Gen. O.A. ANDERSON, USA; Lt. Comdr. W. WILDS, USNR. Allied Personnel Present: Mr. P.H. NITZE, Vice Chairman, USSBS; Captain T.J. HEDDING, USN; Lt. Comdr. J.A. FIELD, Jr., USNR.</p><p>SUMMARY<br> <br>Admiral TOYODA discusses the influence of the Japanese Army in politics and the implications of this influence in the history of Japanese expansion, the strategy and economics of the basic Japanese plan for war against the UNITED STATES, the question of implication of the armed forces, and the consideration of the surrender question at Imperial Conferences in the summer of 1945.</br></br></p><p>Q. (Admiral Ofstie) Throughout the war were your positions such that you were fully informed on the progress of the war, on the plans and policies under discussion in the Supreme Council, Imperial Headquarters, by the General Staffs, etc.?</p><p>A. In the Japanese Navy, the commandants of the various fleets and the various Naval Stations, while they received instructions from Central Headquarters regarding operations, are not consulted on matters of fundamental policy; and, therefore, from the beginning of the war I was not consulted on those matters by the TOKYO headquarters.</p><p>Q. I assume, however, that you were thoroughly familiar with the Japanese War Plan, their National War policy for the Greater East ASIA War; is that correct?</p><p>A. I may be wrong as to the exact date, but I believe it was on 5 November 1941 that the Commander-in-Chiefs of the various Naval Stations and minor Naval Stations were brought together in TOKYO and were given an explanation regarding our plans for operations in the event of war against the UNITED STATES. No opportunity was given us, however, to make any comments on those plans or to suggest modifications.</p><p>Q. Admiral, would you say that in the preparation of the basic war plans there appeared to be full understanding and agreement on the part of the Army as well as the Navy?</p><p>A. No. I regret to say that such was not the situation. Because the Army had great political power, if the Navy were to endeavor to get all that it desired, it would encounter certain difficulties. Such was the situation not only during the war but prior to the beginning of the war.</p><p>Q. To go slightly further–as an example, when the basic war plan was changed and it was decided to somewhat expand the immediate objective by going into the ALEUTIANS, SOLOMONS, MIDWAY, was that change agreed to or given consideration by the Army and a satisfactory accord reached?</p><p>A. Having been in KURE at the time, I was not in a position to have knowledge as to the Navy’s basic policy or the question of cooperation with the Army upon such points.</p><p>Q. But still, when a major change, such as the decision to go into the ALEUTIANS, to go into the SOLOMONS and to PORT MORESBY, to land on MIDWAY, was made, surely such a matter would have been rather widely discussed between the services, wouldn’t it?</p><p>A. Of course, I think that discussion between the services on points of such importance took place as a matter of course, but as I was not in TOKYO at the time, but in KURE, I do not know how those discussions took place or were carried out. of course I had definite personal opinions of my own regarding these questions when they were made known to me, but no chance was given to me to forward such opinions to Central Headquarters.</p><p>Q. In following the progress of the war as you saw it, what would you say, in just a few words if it can so be done, were the chief causes for the inability of JAPAN to carry out her war aims?</p><p>A. On the material side, the fact that our country was woefully weak, lacking resources. On the spiritual side, I should say that the biggest hindrance was the fact that people were not told what this war was actually for, and for that reason they were not able to really put themselves into the war effort.</p><p>Q. From the standpoint of the UNITED STATES, what was the principal force you might say that resulted in Japan’s inability to carry out her war aims?</p><p>A. On the American side I should say that it was the fact that you had adequate raw materials, bountiful resources, and tremendous production capacity, and the fact that production plans were carried out very much according to schedule. I recall that when I left TOKYO to take over command of the Combined Fleet I made one request of the Navy Minister, and that was the fact that he should promise that all the ships, all the planes, and other supplies which were promised to the Combined Fleet under the Naval Plan should be carried out to the letter; that if he felt that it was impossible to go through with the number designated in the plan, to change the plan. For instance, if he thought it was going to be difficult to let the Combined Fleet have ten planes, don’t put ten planes down but reduce that to five, but be sure to come through with the five planes. But as it turned out, the Navy Minister was not able to carry out that promise, not because of lack of will to do so but because production simply did not keep up with the plan.</p><p>Q. Then to go a little further along the same line, lack of production has many causes. What would you ascribe the principle reason for the lack of that production?</p><p>A. It is difficult to point to any one thing as the reason for failure in production because there are many and each, I think operates to affect the others in more or less of a vicious circle, but if I have to name one, I would point out lack of raw materials and natural resources. It was, of course, impossible to supply our production plants with raw materials from JAPAN proper, CHINA and MANCHURIA. That was evident from the first, and it was for that reason that our Army and Navy extended their insufficient force over such a broad area, along battle lines all out of proportion to our strength in men, in order to obtain raw materials from the south, but as it turned out, that was simply taking in too much territory with the strength that we had in that area.</p><p>Q. What was the principal reason why you couldn’t get those raw materials to your country from the south?</p><p>A. The main reason, I think was that we did not have a sufficient number of ships to begin with, and such as we had, we suffered heavy damage owing to your submarines and air action.</p><p>Q. As major items in the position that you came to, what would you say were the primary causes? Was it the loss of shipping, was it the severe damage to the fleet strength, was it loss of air power, was it blockade by air and submarines, or was it bombing of the homeland?</p><p>A. Beginning this year, [1945] I think the biggest cause of fall in production, especially in aircraft and air material, was the effect of your bombing on the domestic plants–factories–in JAPAN proper; but as regards the effects on our war strength on the whole, I think the greatest effect was felt after all by the lack of ships and consequent inability to bring material from the south. Along that line also there were periods in the war when there was not a lack of material in JAPAN, but they could not be moved from one place to another owing to lack of transportation facilities. In other words, various causes affected one another to bring down the general fall in production level.</p><p>Q. (Lt. Comdr. Wilds) You referred early in the conversation to the threat which you considered our Navy represented from the east early in the war, after JAPAN had filled in her perimeter. How would you evaluate that threat as between carriers, or surface fleet, or amphibious operations?</p><p>A. Early in the war I think the submarines were the part of the UNITED STATES Navy which I considered the greatest threat.</p><p>Q. Will you, then, elaborate as to the relative threat in your opinion that the carrier force and the surface fleet and our potential amphibious capabilities represented?</p><p>A. In positive offensive operations, I agree that aircraft carriers are indispensable, and in landing operations, even land-based air force is not sufficient without the cooperation of the surface Task Force units; so in that sense, I evaluate surface Task Forces very highly, especially where the landing is to be made beyond the range of land-based air units. So we felt that if we could deal a serious blow to your surface Task Force, that would widen the gap between your landing attempts and also shorten the distance between the stepping stones by which you made the advance toward JAPAN.</p><p>Q. In considering JAPAN’s inability to stabilize and hold the perimeter which had been almost achieved in the first six months of the war, what factors would you say were accountable? That is, was it a lack of bases of sufficient size to build up necessary strength or was it inability to supply the bases? Was it a logistics problem, in other words?</p><p>A. I think there was a mistake at the top from the very beginning as to the nature of modern warfare. It a little closer study had been made of the Second World War as it started in EUROPE, especially in the fighting going on between ENGLAND and GERMANY around the MEDITERRANEAN, the fighting that meant so much consumption of material, and if we had laid our plans from the beginning with some sounder ideas as to the nature of modern war in mind, it might have been different. We had at the beginning only 6,000,000 tons of ship bottom, and once the war started, the plan adopted was to build a million tons annually. That was a puny figure as compared to the amount actually needed, and the same applied as to the other consumption materials, armaments, etc.; entirely too small a scale.</p><p>Q. Would you say then that the plan executed by JAPAN was in excess of her capability?</p><p>A. As already stated, even the plans that were laid could not be carried out; but the plans to begin with, I think were not accordance with the need of the war.</p><p>Q. I want to get from you the naval estimate of their capabilities prior to the opening of the war; that is, the Japanese Navy’s capabilities in terms of American capabilities.</p><p>A. As a result of the WASHINGTON-LONDON Naval Disarmament Treaties, Japanese Naval strength had been restricted to around 60% of UNITED STATES strength. After those treaties were abdicted it was, of course, no longer incumbent upon us to maintain that ratio, so we devoted our efforts to the building up of the Navy, quantitatively and qualitatively so that in no case would our relative strength fall below 60% of yours. I do not remember by figures what the relative strength of our Navy was categorically. When we faced the necessity of taking on both the UNITED STATES and ENGLAND in this war, the question of our relative strength with the UNITED STATES became relatively a small question. Never in the history of our Navy were plans ever drafted which envisaged a war with GREAT BRITAIN and the UNITED STATES as allied enemies. Consequently it may safely be said that this was not a war in which the Japanese Navy laid down plans which had even a fair chance of success.</p><p>Q. Captain OHMAE has outlined from either records or from personal knowledge a basic plan for this war which went about as follows:</p><p>To obtain certain areas in the south and to establish a perimeter to protect these resource areas, the perimeter being roughly from the KURILES, the MARSHALLS, the BISMARCK ARCHIPELAGO and south of SUMATRA, MALAY, BURMA. Do you feel that the naval resources were sufficient to carry out this broad plan?</p><p>A. I believe that this was one of numerous plans which was too big to be carried out by the resources at our command. Even with the forces which we had to start with, the carrying out of this plan would have been difficult, much more so later when you consider that naval force after all, is consumption goods. As war progresses we suffer losses, and sufficient measures had not been taken, could not be taken in view of shortage of material and manpower, to continually replenish those losses. I felt at the outset that we had over-extended our line when we took in the ALEUTIANS and MIDWAY. I always felt that the line should be made compact and to concentrate the forces that we did have in a relatively narrow area. Because of the necessity of obtaining resources from the south, it was of course inevitable that our lines should be extended as far as JAVA and SUMATRA but not beyond that, down south. It would have been wiser had we kept ourselves to Central PACIFIC, not going further east than TRUK. That is not to say that I would have favored giving up the MARSHALLS to being with, but I would have put in there only sufficient force so as to have delayed your offensive from that region a sufficiently long time to enable us to strengthen the inner line.</p><p>Q. We had heard opinions expressed by some of the senior Japanese naval officers that, prior to the war, they felt that the Japanese navy could only operate successfully for perhaps a year or perhaps a year and a half. Would you affirm or deny that opinion?</p><p>A. I believe that such was the feeling among high officers, although I know of no changes or expressions of opinion to that effect; each man kept it to himself. I have heard, not directly but through a third person, that Admiral YAMAMOTO expressed as his opinion that “we can carry through for one year some way, but after that I don’t know.”</p><p>Q. Do you think similarly now?</p><p>A. Yes, I more or less shared the view that while we might do well enough in the early part of the war for a year or so, after that it would become extremely difficult.</p><p>It so happened that for two years prior to the beginning of the war I was Chief of the Naval Technical Department at Kenzai Hombu and there was in a position of responsibility regarding the Navy’s equipment and ships, and I noticed that there was not always unanimity of opinion regarding the types to be constructed, regarding specifications of ships, difficulty in material. The principal cause of our difficulty in material was our shortage in steel. Our annual supply was about 6,000,000 tons which, as compared with anywhere from 80,000,000 to 100,000,000 tons annually for your country, was an almost negligible quantity, and the difference in our fuel supply wsa even greater. Our fuel supply was almost out of the question as compared with yours, we being able to produce only around 10% of our annual needs.</p><p>Going back to shipbuilding, the difference in opinion regarding categories and specifications arose from the fact that under the WASHINGTON and LONDON treaties we were subject to quantitative limitations. Emphasis had been laid upon quantity so that during the time that I was head of the Naval Technical Department although we were then no longer under treaty restrictions as to tonnage, the same idea of improving quality remained in the minds of our shipbuilding experts, and we used to receive orders from different sections of the Navy for ships of higher efficiency. I felt at the time that now that we were no longer held down by a quantitative ceiling, we should redirect our attention from quality back to quantity and to increase the number of ships, because we could see from experiences of the Second European War, which had already started, that one could not expect to keep ships safely for any length of time. In other words, ships were consumption goods and would have to be replaced rapidly to maintain a standard of strength.</p></blockquote><p>No plans to invade the West Coast, no plans to raid the West Coast, and even the plans laid could not be carried out due to production shortages.  Submarines and their threat to Japanese material imports were a greater threat than aircraft carriers, because the production delta is the key, precisely as I have stated all along.  Admiral Toyoda also demonstrates a knowledge of America’s great production and even <em>schedules</em>.  It’s particularly interesting to note that while that famous military expert, Michelle Malkin, says that Japan was uniquely dangerous because of its 9 carriers, the Chief of Japan’s Naval Combined Forces states that submarines – of which Germany had 1,170 – are actually more dangerous to a war effort due to their far greater effect on shipping and therefore both production (imported materials) and transportation (finished armaments).</p><p>Most significant is that <em>two years before the war began</em>, Admiral Toyoda knew that Japan did not produce enough steel (6 percent of US production) or fuel in comparison to what he knew the USA was producing.  It would take a truly low-functioning mind to fail to note the connection between this production delta and the resultant production delta in armaments.</p><p>Interestingly enough, two of Malkin’s supposedly all-conquering carriers were stripped of planes and used to transport materials in the south because trying to make up for the production gap was judged to be more important than the ability to launch a few feeble planes in a useless attack.<br/></p></div>",
  "content_text": "INTERROGATION NAV NO. 75\nUSSBS NO. 378\nJAPANESE WAR PLANS AND PEACE MOVES\nTOKYO\t13-14 November 1945\nPersonnel interrogated and background of each:\nInterrogation of: Admiral TOYODA , Soemu; September 1941, CinC KURE NavSta; November 1942 appointed Supreme Military Counsellor, residing in TOKYO. May 1943 became CinC YOKOSUKA NavSta. May 1944 became CinC Combined Fleet succeeding Admiral KOGA when latter was killed. May 1945 appointed Chief of Naval General Staff; later post superseded by position of Chief, Naval Combined Forces, September 1945 which he held until dissolution of that organization 15 October 1945.\nInterrogated by: Rear Admiral R.A. OFSTIE, USN; Maj. Gen. O.A. ANDERSON, USA; Lt. Comdr. W. WILDS, USNR. Allied Personnel Present: Mr. P.H. NITZE, Vice Chairman, USSBS; Captain T.J. HEDDING, USN; Lt. Comdr. J.A. FIELD, Jr., USNR.\nSUMMARY\nAdmiral TOYODA discusses the influence of the Japanese Army in politics and the implications of this influence in the history of Japanese expansion, the strategy and economics of the basic Japanese plan for war against the UNITED STATES, the question of implication of the armed forces, and the consideration of the surrender question at Imperial Conferences in the summer of 1945.\nQ. (Admiral Ofstie) Throughout the war were your positions such that you were fully informed on the progress of the war, on the plans and policies under discussion in the Supreme Council, Imperial Headquarters, by the General Staffs, etc.?\nA. In the Japanese Navy, the commandants of the various fleets and the various Naval Stations, while they received instructions from Central Headquarters regarding operations, are not consulted on matters of fundamental policy; and, therefore, from the beginning of the war I was not consulted on those matters by the TOKYO headquarters.\nQ. I assume, however, that you were thoroughly familiar with the Japanese War Plan, their National War policy for the Greater East ASIA War; is that correct?\nA. I may be wrong as to the exact date, but I believe it was on 5 November 1941 that the Commander-in-Chiefs of the various Naval Stations and minor Naval Stations were brought together in TOKYO and were given an explanation regarding our plans for operations in the event of war against the UNITED STATES. No opportunity was given us, however, to make any comments on those plans or to suggest modifications.\nQ. Admiral, would you say that in the preparation of the basic war plans there appeared to be full understanding and agreement on the part of the Army as well as the Navy?\nA. No. I regret to say that such was not the situation. Because the Army had great political power, if the Navy were to endeavor to get all that it desired, it would encounter certain difficulties. Such was the situation not only during the war but prior to the beginning of the war.\nQ. To go slightly further–as an example, when the basic war plan was changed and it was decided to somewhat expand the immediate objective by going into the ALEUTIANS, SOLOMONS, MIDWAY, was that change agreed to or given consideration by the Army and a satisfactory accord reached?\nA. Having been in KURE at the time, I was not in a position to have knowledge as to the Navy’s basic policy or the question of cooperation with the Army upon such points.\nQ. But still, when a major change, such as the decision to go into the ALEUTIANS, to go into the SOLOMONS and to PORT MORESBY, to land on MIDWAY, was made, surely such a matter would have been rather widely discussed between the services, wouldn’t it?\nA. Of course, I think that discussion between the services on points of such importance took place as a matter of course, but as I was not in TOKYO at the time, but in KURE, I do not know how those discussions took place or were carried out. of course I had definite personal opinions of my own regarding these questions when they were made known to me, but no chance was given to me to forward such opinions to Central Headquarters.\nQ. In following the progress of the war as you saw it, what would you say, in just a few words if it can so be done, were the chief causes for the inability of JAPAN to carry out her war aims?\nA. On the material side, the fact that our country was woefully weak, lacking resources. On the spiritual side, I should say that the biggest hindrance was the fact that people were not told what this war was actually for, and for that reason they were not able to really put themselves into the war effort.\nQ. From the standpoint of the UNITED STATES, what was the principal force you might say that resulted in Japan’s inability to carry out her war aims?\nA. On the American side I should say that it was the fact that you had adequate raw materials, bountiful resources, and tremendous production capacity, and the fact that production plans were carried out very much according to schedule. I recall that when I left TOKYO to take over command of the Combined Fleet I made one request of the Navy Minister, and that was the fact that he should promise that all the ships, all the planes, and other supplies which were promised to the Combined Fleet under the Naval Plan should be carried out to the letter; that if he felt that it was impossible to go through with the number designated in the plan, to change the plan. For instance, if he thought it was going to be difficult to let the Combined Fleet have ten planes, don’t put ten planes down but reduce that to five, but be sure to come through with the five planes. But as it turned out, the Navy Minister was not able to carry out that promise, not because of lack of will to do so but because production simply did not keep up with the plan.\nQ. Then to go a little further along the same line, lack of production has many causes. What would you ascribe the principle reason for the lack of that production?\nA. It is difficult to point to any one thing as the reason for failure in production because there are many and each, I think operates to affect the others in more or less of a vicious circle, but if I have to name one, I would point out lack of raw materials and natural resources. It was, of course, impossible to supply our production plants with raw materials from JAPAN proper, CHINA and MANCHURIA. That was evident from the first, and it was for that reason that our Army and Navy extended their insufficient force over such a broad area, along battle lines all out of proportion to our strength in men, in order to obtain raw materials from the south, but as it turned out, that was simply taking in too much territory with the strength that we had in that area.\nQ. What was the principal reason why you couldn’t get those raw materials to your country from the south?\nA. The main reason, I think was that we did not have a sufficient number of ships to begin with, and such as we had, we suffered heavy damage owing to your submarines and air action.\nQ. As major items in the position that you came to, what would you say were the primary causes? Was it the loss of shipping, was it the severe damage to the fleet strength, was it loss of air power, was it blockade by air and submarines, or was it bombing of the homeland?\nA. Beginning this year, [1945] I think the biggest cause of fall in production, especially in aircraft and air material, was the effect of your bombing on the domestic plants–factories–in JAPAN proper; but as regards the effects on our war strength on the whole, I think the greatest effect was felt after all by the lack of ships and consequent inability to bring material from the south. Along that line also there were periods in the war when there was not a lack of material in JAPAN, but they could not be moved from one place to another owing to lack of transportation facilities. In other words, various causes affected one another to bring down the general fall in production level.\nQ. (Lt. Comdr. Wilds) You referred early in the conversation to the threat which you considered our Navy represented from the east early in the war, after JAPAN had filled in her perimeter. How would you evaluate that threat as between carriers, or surface fleet, or amphibious operations?\nA. Early in the war I think the submarines were the part of the UNITED STATES Navy which I considered the greatest threat.\nQ. Will you, then, elaborate as to the relative threat in your opinion that the carrier force and the surface fleet and our potential amphibious capabilities represented?\nA. In positive offensive operations, I agree that aircraft carriers are indispensable, and in landing operations, even land-based air force is not sufficient without the cooperation of the surface Task Force units; so in that sense, I evaluate surface Task Forces very highly, especially where the landing is to be made beyond the range of land-based air units. So we felt that if we could deal a serious blow to your surface Task Force, that would widen the gap between your landing attempts and also shorten the distance between the stepping stones by which you made the advance toward JAPAN.\nQ. In considering JAPAN’s inability to stabilize and hold the perimeter which had been almost achieved in the first six months of the war, what factors would you say were accountable? That is, was it a lack of bases of sufficient size to build up necessary strength or was it inability to supply the bases? Was it a logistics problem, in other words?\nA. I think there was a mistake at the top from the very beginning as to the nature of modern warfare. It a little closer study had been made of the Second World War as it started in EUROPE, especially in the fighting going on between ENGLAND and GERMANY around the MEDITERRANEAN, the fighting that meant so much consumption of material, and if we had laid our plans from the beginning with some sounder ideas as to the nature of modern war in mind, it might have been different. We had at the beginning only 6,000,000 tons of ship bottom, and once the war started, the plan adopted was to build a million tons annually. That was a puny figure as compared to the amount actually needed, and the same applied as to the other consumption materials, armaments, etc.; entirely too small a scale.\nQ. Would you say then that the plan executed by JAPAN was in excess of her capability?\nA. As already stated, even the plans that were laid could not be carried out; but the plans to begin with, I think were not accordance with the need of the war.\nQ. I want to get from you the naval estimate of their capabilities prior to the opening of the war; that is, the Japanese Navy’s capabilities in terms of American capabilities.\nA. As a result of the WASHINGTON-LONDON Naval Disarmament Treaties, Japanese Naval strength had been restricted to around 60% of UNITED STATES strength. After those treaties were abdicted it was, of course, no longer incumbent upon us to maintain that ratio, so we devoted our efforts to the building up of the Navy, quantitatively and qualitatively so that in no case would our relative strength fall below 60% of yours. I do not remember by figures what the relative strength of our Navy was categorically. When we faced the necessity of taking on both the UNITED STATES and ENGLAND in this war, the question of our relative strength with the UNITED STATES became relatively a small question. Never in the history of our Navy were plans ever drafted which envisaged a war with GREAT BRITAIN and the UNITED STATES as allied enemies. Consequently it may safely be said that this was not a war in which the Japanese Navy laid down plans which had even a fair chance of success.\nQ. Captain OHMAE has outlined from either records or from personal knowledge a basic plan for this war which went about as follows:\nTo obtain certain areas in the south and to establish a perimeter to protect these resource areas, the perimeter being roughly from the KURILES, the MARSHALLS, the BISMARCK ARCHIPELAGO and south of SUMATRA, MALAY, BURMA. Do you feel that the naval resources were sufficient to carry out this broad plan?\nA. I believe that this was one of numerous plans which was too big to be carried out by the resources at our command. Even with the forces which we had to start with, the carrying out of this plan would have been difficult, much more so later when you consider that naval force after all, is consumption goods. As war progresses we suffer losses, and sufficient measures had not been taken, could not be taken in view of shortage of material and manpower, to continually replenish those losses. I felt at the outset that we had over-extended our line when we took in the ALEUTIANS and MIDWAY. I always felt that the line should be made compact and to concentrate the forces that we did have in a relatively narrow area. Because of the necessity of obtaining resources from the south, it was of course inevitable that our lines should be extended as far as JAVA and SUMATRA but not beyond that, down south. It would have been wiser had we kept ourselves to Central PACIFIC, not going further east than TRUK. That is not to say that I would have favored giving up the MARSHALLS to being with, but I would have put in there only sufficient force so as to have delayed your offensive from that region a sufficiently long time to enable us to strengthen the inner line.\nQ. We had heard opinions expressed by some of the senior Japanese naval officers that, prior to the war, they felt that the Japanese navy could only operate successfully for perhaps a year or perhaps a year and a half. Would you affirm or deny that opinion?\nA. I believe that such was the feeling among high officers, although I know of no changes or expressions of opinion to that effect; each man kept it to himself. I have heard, not directly but through a third person, that Admiral YAMAMOTO expressed as his opinion that “we can carry through for one year some way, but after that I don’t know.”\nQ. Do you think similarly now?\nA. Yes, I more or less shared the view that while we might do well enough in the early part of the war for a year or so, after that it would become extremely difficult.\nIt so happened that for two years prior to the beginning of the war I was Chief of the Naval Technical Department at Kenzai Hombu and there was in a position of responsibility regarding the Navy’s equipment and ships, and I noticed that there was not always unanimity of opinion regarding the types to be constructed, regarding specifications of ships, difficulty in material. The principal cause of our difficulty in material was our shortage in steel. Our annual supply was about 6,000,000 tons which, as compared with anywhere from 80,000,000 to 100,000,000 tons annually for your country, was an almost negligible quantity, and the difference in our fuel supply wsa even greater. Our fuel supply was almost out of the question as compared with yours, we being able to produce only around 10% of our annual needs.\nGoing back to shipbuilding, the difference in opinion regarding categories and specifications arose from the fact that under the WASHINGTON and LONDON treaties we were subject to quantitative limitations. Emphasis had been laid upon quantity so that during the time that I was head of the Naval Technical Department although we were then no longer under treaty restrictions as to tonnage, the same idea of improving quality remained in the minds of our shipbuilding experts, and we used to receive orders from different sections of the Navy for ships of higher efficiency. I felt at the time that now that we were no longer held down by a quantitative ceiling, we should redirect our attention from quality back to quantity and to increase the number of ships, because we could see from experiences of the Second European War, which had already started, that one could not expect to keep ships safely for any length of time. In other words, ships were consumption goods and would have to be replaced rapidly to maintain a standard of strength.\nNo plans to invade the West Coast, no plans to raid the West Coast, and even the plans laid could not be carried out due to production shortages.  Submarines and their threat to Japanese material imports were a greater threat than aircraft carriers, because the production delta is the key, precisely as I have stated all along.  Admiral Toyoda also demonstrates a knowledge of America’s great production and even\nschedules\n.  It’s particularly interesting to note that while that famous military expert, Michelle Malkin, says that Japan was uniquely dangerous because of its 9 carriers, the Chief of Japan’s Naval Combined Forces states that submarines – of which Germany had 1,170 – are actually more dangerous to a war effort due to their far greater effect on shipping and therefore both production (imported materials) and transportation (finished armaments).\nMost significant is that\ntwo years before the war began\n, Admiral Toyoda knew that Japan did not produce enough steel (6 percent of US production) or fuel in comparison to what he knew the USA was producing.  It would take a truly low-functioning mind to fail to note the connection between this production delta and the resultant production delta in armaments.\nInterestingly enough, two of Malkin’s supposedly all-conquering carriers were stripped of planes and used to transport materials in the south because trying to make up for the production gap was judged to be more important than the ability to launch a few feeble planes in a useless attack.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-16T06:58:00+00:00"
}