{
  "url": "https://voxday.net/2004/09/27/mailvox-dumb-enough-to-defend-malkin/",
  "scraped_at": "2025-12-19T20:47:36.112083",
  "title": "Mailvox: dumb enough to defend Malkin",
  "date_display": "September 27, 2004",
  "date_iso": "2004-09-27T11:41:00+00:00",
  "date_from_url": "2004-09-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>KC sets himself up:<br/></p><blockquote><p> <br>Boy it reeeeeeeeeeally gets to you Ms.Malkin won’t respond to your nonsense.  Are all your columns going to be devoted to this?  Perhaps she has dismissed you because of your thumbnail bio which includes the words “Christian Libertarian.”  Oooh good now we all know you’re not one of those blockheaded Christians, you’re one of the “open-minded” kind,coooool.  And we know you’re smart, cause as you constantly remind everyone, your in Mensa which I guess gives you the abilty to time-travel and know the loyalties of all the Japanese that were rounded up and to also read minds.  Very impressive indeed!</br></p><p>And if you’re using atheist Al Franken as a reference you’re really lost.  The Bible says “A fool says in his heart there is no God.”<br/></p></blockquote><p>But KC, didn’t you read my column today?  Don’t you recall that Malkin claimed on WBAL radio that she had already responded to what you call my “nonsense”?  So, how could it possibly bother me, unless she lied when she said that?  The answer, as you obviously know, is that she lied and she has not responded to the many, many issues I have raised with regards to her factual inaccuracies and erroneous assertions.  But her mendacious response doesn’t bother me at all, as in the course of the last month she has been forced to reveal to every impartial observer that she did no research on the very foundation of her thesis, that she does not have even a History Channel-level grasp on the events of WWII and that she prefers to lie rather than admit that she was wrong.</p><p>I’d only hoped to destroy some of the false assertions in her book, to see her destroy her own character was far outside the scope of anything I’d expected or desired.</p><p>As for Alice, well, the broken clock analogy would not seem out of place here.  It’s clear there is at least one lying liar who claims to be on the political right.  It is true that I am a Mensan, be further astounded that I even know how to use an apostrophe, a punctuation device with which <em>your</em> obviously unacquainted.</p><p>Finally, when did Jesus Christ teach us to lie in order to maintain our TV viability and sell books? <em>Blessed are the media whores, for they shall see their names on the New York Times Bestsellers List….</em> Another verse from the Book of Vulpes, I suppose.</p><p>JN adds:<br/></p><blockquote><p> <br>Michelle is a real class person.  Why are you nitpicking? Have you gone mad?  Al Franken is less than a shadow of a human being.  You must decide where you stand, with righteousness, or with evil.  How dare you even suggest Al Franken was right? You are losing your credibility, wake up!  Try living in the present, there is nothing to gain by questioning our motives for interning the Japanese in the forties!<br/></br></p></blockquote><p>What little I know of Michelle Malkin does not suggest that she is a class person, unless class is demonstrated by intellectual charlatanship, cowardice and dishonesty.  Al Franken is certainly a clown, but he was correct about both Sean Hannity’s math skills and Bill O’Reilly’s literary ability.  If I am losing credibility with some conservatives because I am committed to the truth, however uncomfortable, I think that is more of a statement on the lack of integrity of those particular conservatives than anything else.</p><p>I had a feeling that that reference to Franken might sting a bit.<br/></p></div>",
  "content_text": "KC sets himself up:\nBoy it reeeeeeeeeeally gets to you Ms.Malkin won’t respond to your nonsense.  Are all your columns going to be devoted to this?  Perhaps she has dismissed you because of your thumbnail bio which includes the words “Christian Libertarian.”  Oooh good now we all know you’re not one of those blockheaded Christians, you’re one of the “open-minded” kind,coooool.  And we know you’re smart, cause as you constantly remind everyone, your in Mensa which I guess gives you the abilty to time-travel and know the loyalties of all the Japanese that were rounded up and to also read minds.  Very impressive indeed!\nAnd if you’re using atheist Al Franken as a reference you’re really lost.  The Bible says “A fool says in his heart there is no God.”\nBut KC, didn’t you read my column today?  Don’t you recall that Malkin claimed on WBAL radio that she had already responded to what you call my “nonsense”?  So, how could it possibly bother me, unless she lied when she said that?  The answer, as you obviously know, is that she lied and she has not responded to the many, many issues I have raised with regards to her factual inaccuracies and erroneous assertions.  But her mendacious response doesn’t bother me at all, as in the course of the last month she has been forced to reveal to every impartial observer that she did no research on the very foundation of her thesis, that she does not have even a History Channel-level grasp on the events of WWII and that she prefers to lie rather than admit that she was wrong.\nI’d only hoped to destroy some of the false assertions in her book, to see her destroy her own character was far outside the scope of anything I’d expected or desired.\nAs for Alice, well, the broken clock analogy would not seem out of place here.  It’s clear there is at least one lying liar who claims to be on the political right.  It is true that I am a Mensan, be further astounded that I even know how to use an apostrophe, a punctuation device with which\nyour\nobviously unacquainted.\nFinally, when did Jesus Christ teach us to lie in order to maintain our TV viability and sell books?\nBlessed are the media whores, for they shall see their names on the New York Times Bestsellers List….\nAnother verse from the Book of Vulpes, I suppose.\nJN adds:\nMichelle is a real class person.  Why are you nitpicking? Have you gone mad?  Al Franken is less than a shadow of a human being.  You must decide where you stand, with righteousness, or with evil.  How dare you even suggest Al Franken was right? You are losing your credibility, wake up!  Try living in the present, there is nothing to gain by questioning our motives for interning the Japanese in the forties!\nWhat little I know of Michelle Malkin does not suggest that she is a class person, unless class is demonstrated by intellectual charlatanship, cowardice and dishonesty.  Al Franken is certainly a clown, but he was correct about both Sean Hannity’s math skills and Bill O’Reilly’s literary ability.  If I am losing credibility with some conservatives because I am committed to the truth, however uncomfortable, I think that is more of a statement on the lack of integrity of those particular conservatives than anything else.\nI had a feeling that that reference to Franken might sting a bit.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-27T10:41:00+00:00"
}