{
  "url": "https://voxday.net/2004/09/21/mailvox-save-transcript-for-this-guy/",
  "scraped_at": "2025-12-19T20:46:35.452291",
  "title": "Mailvox: save a transcript for this guy",
  "date_display": "September 21, 2004",
  "date_iso": "2004-09-21T06:44:00+00:00",
  "date_from_url": "2004-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>George, who no doubt has a poster of Malkin over his bed, froths at the mouth:<br/></p><blockquote><p> <br>Your attempts to paint Ms Malkin into a corner of your own choosing is despicable and indefensible.  Your setting of a date for a proposed “debate” is despicable and indefensible.  Your presumption in selecting a date for such a confrontation is nothing short of brazen-faced arrogance.<br/></br></p></blockquote><p>Setting a date!  Offering to reschedule!  The ignominy!<br/></p><blockquote><p> <br>The columns in which you have attacked Ms Malkin have made it startlingly clear to any “intellectually honest individual”, to use your own phrase, that you truly have no desire to debate Ms Malkin but in fact have an hysterical wish to publically humiliate and embarrass one of the finest conservative writers in the United States currently reaching a very wide and varied readership.<br/></br></p></blockquote><p>No, I’d love to debate her <em>in order</em> to publically expose her astonishingly ignorant case.  Unfortunately for her, I can now do it regardless of whether she’s there or not.  And if the finest conservative writers are defending the elevation of central state authority over the Constitution and standing up for FDR, America is doomed.  Perhaps Malkin’s next book will be entitled <em>Lenin: The Misunderstood Freedom Fighter</em>, written without so much as a glance at any of Vladimir Ilyich’s copious writings or the history of the October Revolution.</p><p>You may note that my tone has grown more openly contemptuous in the last day; that’s because I’ve learned how little Malkin actually knows about the military context in which she attempts to place her research on Magic.  The term “less than zero” springs to mind.  I’d originally thought she’d made a serious, but understandable mistake, however, the extent of her ignorance is so great and so easily demonstrable, the two people I’ve told about my latest discovery were both wondering what on Earth she was thinking when she decided to write the book.  It almost embarrassed ME and I’m certainly no fan of hers.</p><p>To quote Hacker, a reader of Malkin’s book who has emailed me a few times to poke and probe for weaknesses in my case: “Well, you’ve convinced me about the lack of military necessity to do the evacuation.  I also did some additional research on my own and can find nothing to refute what you’ve said.”<br/></p></div>",
  "content_text": "George, who no doubt has a poster of Malkin over his bed, froths at the mouth:\nYour attempts to paint Ms Malkin into a corner of your own choosing is despicable and indefensible.  Your setting of a date for a proposed “debate” is despicable and indefensible.  Your presumption in selecting a date for such a confrontation is nothing short of brazen-faced arrogance.\nSetting a date!  Offering to reschedule!  The ignominy!\nThe columns in which you have attacked Ms Malkin have made it startlingly clear to any “intellectually honest individual”, to use your own phrase, that you truly have no desire to debate Ms Malkin but in fact have an hysterical wish to publically humiliate and embarrass one of the finest conservative writers in the United States currently reaching a very wide and varied readership.\nNo, I’d love to debate her\nin order\nto publically expose her astonishingly ignorant case.  Unfortunately for her, I can now do it regardless of whether she’s there or not.  And if the finest conservative writers are defending the elevation of central state authority over the Constitution and standing up for FDR, America is doomed.  Perhaps Malkin’s next book will be entitled\nLenin: The Misunderstood Freedom Fighter\n, written without so much as a glance at any of Vladimir Ilyich’s copious writings or the history of the October Revolution.\nYou may note that my tone has grown more openly contemptuous in the last day; that’s because I’ve learned how little Malkin actually knows about the military context in which she attempts to place her research on Magic.  The term “less than zero” springs to mind.  I’d originally thought she’d made a serious, but understandable mistake, however, the extent of her ignorance is so great and so easily demonstrable, the two people I’ve told about my latest discovery were both wondering what on Earth she was thinking when she decided to write the book.  It almost embarrassed ME and I’m certainly no fan of hers.\nTo quote Hacker, a reader of Malkin’s book who has emailed me a few times to poke and probe for weaknesses in my case: “Well, you’ve convinced me about the lack of military necessity to do the evacuation.  I also did some additional research on my own and can find nothing to refute what you’ve said.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-21T05:44:00+00:00"
}