{
  "url": "https://voxday.net/2004/09/16/no-plan-to-go-beyond-midway/",
  "scraped_at": "2025-12-19T20:45:56.876647",
  "title": "No plan to go beyond Midway",
  "date_display": "September 16, 2004",
  "date_iso": "2004-09-16T08:43:00+00:00",
  "date_from_url": "2004-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br><a href=\"http://www.ibiblio.org/hyperwar/AAF/USSBS/IJO/IJO-115.html\">INTERROGATION NAV NO. 115 </a><br> <br>USSBS NO. 503<br> <br>TOKYO\t9-12 December 1945</br></br></br></br></br></p><p>Interrogation of: Vice Admiral FUKUDOME, Shigeru, IJN; Chief of Staff, Combined Fleet from 1940 to April 1941; Chief First Section, Naval General Staff, TOKYO, April 1941 to May 1943; Chief of Staff, Combined Fleet from May 1943 to March 1944; Commander, Second Air Fleet, July 1944 to 15 January 1945; Commander, 10th Area Fleet, 15 January 1945 to present date.</p><p>Interrogator: Rear Admiral R.A. Ofstie, USN.  Allied Officers Present: Colonel R.H. Terrill, USAAF.</p><p>Q. Admiral, you mentioned earlier the ALEUTIAN Operation at KISKA; what was the decision with respect to the ALEUTIANS, and the reason for it?<br> <br>A. There appears to have been considerable difference of opinion between the Army and Navy as regards future policy for the ALEUTIANS, the Navy favoring fighting to the last man while the Army felt that this would be a waste of manpower if there was no prospect of ultimate success of the Northern Operations. The final decision as rendered by the Imperial General Headquarters was that it would serve no useful purpose to fight on, and, hence, it was decided to withdraw. When Admiral KOGA came to TOKYO, it was his hope that with KISKA and the rest of the ALEUTIANS as a base he might get a chance for a decisive engagement with your naval forces somewhere in the northern waters; but by the time he reached TOKYO the situation had already gone too far for him to undertake execution of any such plan.</br></br></p><p>Q. What had been the object of the Northern Operation? Was it to obtain a base for the purpose just mentioned?<br> <br>A. My memory on this point is somewhat hazy, but I believe that our object in occupying the area of natural resources in the south was not a strategic one. The purpose was to get the materials necessary for existence and our war effort. But the Navy felt that in order to hold this very expansive area it would be necessary to get far outlying lookout points, and while we might not be able to hold on to such outlying points, we must at least get them once, even if we were to lose them to the enemy again later. It was in pursuance of that policy that we occupied or tried to occupy such distant bases as the ALEUTIANS, RABAUL, and MIDWAY.</br></br></p><p>Q. Was this particular objective–that is, the Western ALEUTIANS–included in the plan over the objections of the Army? That is, was it primarily sponsored by the Navy?<br> <br>A. No, it was not against Army opposition that the ALEUTIAN bases were included in this plan. The idea originated with YAMAMOTO who, when laying down a plan of Naval operations, felt that the holding of such outlying bases was essential to an overall success of the Navy’s plans. When that idea was transferred to Imperial General Headquarters, the Army took the view that if the Navy fleet that such a policy is essential then wee give it support. They fell in readily with the Navy’s proposal, the difference of opinion arose only when the time came for the withdrawal from KISKA. The reason for the Navy favoring defense to the last man was that since they had gone there in the first place with the expectation of having at some future time to lose it, why not fight it out to the last man? Against that, there was considerable Army objection.</br></br></p><p>Q. In the original concept at the beginning of the war, were the various forces given definite final objectives or merely limited objectives, with a view to subsequent orders depending on the progress of the campaign?<br> <br>A. The original order given to Admiral YAMAMOTO by the Imperial General Headquarters contained two main parts: one, destruction of the enemy fleet; two, coordination with the Army in capturing, and gaining control of the southern areas. With regard to the first pint, as in the case of the RUSSO-JAPANESE War when Admiral TOGO was ordered to destroy the RUSSIAN Fleet without any detailed instructions as to how or where that was to be done, steps and methods to be employed for the destruction of the enemy fleet were left to Admiral YAMAMOTO’s discretion. He was to draw up the plan of operation by estimating the enemy strength in the light of the strength which he had available himself. As regards the second point, the Army, of course, was to carry out the work of occupation. The purpose of that was less strategic than economic and political, the object being principally to gain control of the raw materials in the south. The duty of the Navy in that connection was to support the Army effort both with its fleet and its land-based air force. lest there be misunderstanding on the point, I wish to say that though Admiral YAMAMOTO was assigned this specific duty of planning and executing the destruction of the enemy fleet according to his own discretion, he could not activate any plan without the approval of the Imperial General Headquarters. I cannot recall that any line was fixed to designate the limits of ocean surface to be secured; I do recall, however, that lands to be occupied were definitely fixed.</br></br></p><p>Q. Initially, what was the farthest fixed position to which the advance in the north was limited?<br> <br>A. In the north, the ALEUTIANS, including ATTU and KISKA, but I believe that DUTCH HARBOR was left to fleet discretion. In the south RABAUL was designated from the beginning; and the SOLOMONS and MIDWAY were added later.</br></br></p><p>Q. This would then be called the first established line–ATTU and KISKA (possibly DUTCH HARBOR), WAKE, RABAUL and so on west? We might accept that as a first line?<br> <br>A. Yes, include the GILBERTS in that line. That was the first line for occupation but this did not restrict naval activity.</br></br></p><p>Q. Then the move into the Western ALEUTIANS in June 1942 was actually in completion of this initial plan, even though delayed somewhat?<br> <br>A. I wish to make a correction, the question of including KISKA and ATTU in the original program was only considered, but it was not adopted at that time. It was added at the same time MIDWAY was brought into this line.</br></br></p><p>Q. When was the decision reached to expand the perimeter to include MIDWAY, and what were the reasons therefor?<br> <br>A. The taking of MIDWAY was a part of the fleet desire. From the outset, the fleet wanted to take MIDWAY even if subsequent developments caused its loss. I believe the idea originated with Admiral YAMAMOTO that the fleet wished to take it even if subsequent developments should necessitate giving it up again. The Imperial General STaff, however, was opposed to the idea at first because the disadvantages of holding MIDWAY, especially in the way of supply, would outweigh the advantages. It had always been a policy of the Japanese Navy to hold the fleet in waters relatively close to home to meet the enemy there in surface interception operations, the object being to engage the enemy in areas most advantageous for us. But as the operations in the first stage of the war were so successful as to even exceed expectations and as the fleet again submitted its plan for taking MIDWAY with details of the plan, especially with regard to the reasons for the necessity of taking it and the chances of success of the operation, the Imperial Staff at this time gave its support. The Army also fell in line and offered to send troops for occupation. As this was an addition to the original plan of operations it was issued as a new Imperial General Headquarters order. By way of summary, it might be stated the purpose of this operation for taking MIDWAY was to utilize it as a base for future advances, and at the same time to prevent its being used by the enemy as a base. The Chief of the Naval General Staff, Admiral NAGANO, had full confidence in Admiral YAMAMOTO’s judgment, and was always willing to trust his judgment in respect to fleet operations. he appeared to have the feeling that if Admiral YAMAMOTO said that a certain plan promised success he would be willing to let Admiral YAMAMOTO proceed with its execution. While there was discussion of this plan between the fleet and authorities in the General STaff, what really led to Admiral NAGANO giving his final consent to the carrying out of this plan was the fact he always had full confidence in the CinC of the Fleet.</br></br></p><p>Q. About what date was the additional order issued?<br> <br>A. I don’t remember the exact date but believe it was just prior to commencement of the operation. Since the fleet had studied this operation very closely, they were in a position to put the plan into operation immediately once it was issued.</br></br></p><p>Q. You made a suggestion of further forward advances. Did the Naval General Staff act on its own initiative or did it receive from Admiral YAMAMOTO plans to go on beyond MIDWAY? If so, what was the nature of those plans?<br> <br>A. It would probably be more accurate to say that one of the purposes for taking MIDWAY was to use it as a base for subsequent operations rather than for further advance. <b>No doubt the fleet had been studying the possibility for further advances even to HAWAII, but doesn’t appear to have been able to draw up a plan that would promise success, and the Imperial General Staff had been opposed from the beginning to extending the line too far. I am certain that there was no definite adoption of a plan, at that time, to go beyond MIDWAY.</b> From some time prior to this, the Naval General Staff had been considering the question of operations toward HAWAII as a problem reserved for a subsequent time, a time when our fleet should have destroyed the American Fleet. However, the General Staff had not transmitted this idea to the fleet yet.</br></br></p><p>Q. What were the effects of the Battle of MIDWAY, 406 June 1942, and what new plans, if any, were evolved directly as a result of that action?<br> <br>A. The result of the MIDWAY engagement was a most serious blow to our Navy. Admiral YAMAMOTO’s basic policy had been to engage the enemy in a decisive fleet engagement. He was at the same time an advocate of using air power, including the use of land-based air forces. In undertaking the capture of MIDWAY, he, no doubt, planned to use MIDWAY as a base for just such a fleet engagement; but as a result of this serious set-back at MIDWAY, he was probably forced to give up the hope of holding such a fleet engagement a great distance from home. The effect of the MIDWAY Battle was to greatly restrict the area in which such a fleet engagement could be carried out….</br></br></p><p>Q. You have several times mentioned phases of the war. How do you divide the war into phases?<br> <br>A. This division into phases was an arbitrary one adopted merely for sake of convenience. However, such a division had always been contemplated and was always in the minds of the Navy General Staff from earlier years. The first phase operation was the occupation of the raw materials area to the south. The second phase was after the change from offensive in taking this area to the defensive of the occupied area. In addition, the fleet attempted a third phase which covered the period between the two already mentioned; namely, the period of stabilization of the occupied area immediately after occupation and prior to the beginning of the defensive operations. So the actual order became: first phase–occupation, second phase–stabilization, third phase–defensive. Admiral YAMAMOTO commanded the fleet through the first phase and the early part of the second phase, Admiral KOGA was in command through the latter part of the second phase and the early part of the third phase, and Admiral TOYODA followed through the last part of the third phase.<br/></br></br></p></blockquote><p>As I said before, Malkin is incorrect in saying there was a “low” chance of an invasion of the West Coast.  There was NO chance of an invasion of the West Coast, as even an invasion of Hawaii was untenable for the many reasons I have mentioned.  One thing these Japanese admirals – like the former Commandant to whom I spoke – understand that Malkin does not, is that carrier-launched airplanes were no substitute for land-based aircraft during WWII, hence Yamamoto’s desire to use Midway as a base for a fleet engagement, and the IJN General Staff’s awareness that further attempts to raid or invade Hawaii and the West Coast would be both costly and foolish.<br/></p></div>",
  "content_text": "INTERROGATION NAV NO. 115\nUSSBS NO. 503\nTOKYO\t9-12 December 1945\nInterrogation of: Vice Admiral FUKUDOME, Shigeru, IJN; Chief of Staff, Combined Fleet from 1940 to April 1941; Chief First Section, Naval General Staff, TOKYO, April 1941 to May 1943; Chief of Staff, Combined Fleet from May 1943 to March 1944; Commander, Second Air Fleet, July 1944 to 15 January 1945; Commander, 10th Area Fleet, 15 January 1945 to present date.\nInterrogator: Rear Admiral R.A. Ofstie, USN.  Allied Officers Present: Colonel R.H. Terrill, USAAF.\nQ. Admiral, you mentioned earlier the ALEUTIAN Operation at KISKA; what was the decision with respect to the ALEUTIANS, and the reason for it?\nA. There appears to have been considerable difference of opinion between the Army and Navy as regards future policy for the ALEUTIANS, the Navy favoring fighting to the last man while the Army felt that this would be a waste of manpower if there was no prospect of ultimate success of the Northern Operations. The final decision as rendered by the Imperial General Headquarters was that it would serve no useful purpose to fight on, and, hence, it was decided to withdraw. When Admiral KOGA came to TOKYO, it was his hope that with KISKA and the rest of the ALEUTIANS as a base he might get a chance for a decisive engagement with your naval forces somewhere in the northern waters; but by the time he reached TOKYO the situation had already gone too far for him to undertake execution of any such plan.\nQ. What had been the object of the Northern Operation? Was it to obtain a base for the purpose just mentioned?\nA. My memory on this point is somewhat hazy, but I believe that our object in occupying the area of natural resources in the south was not a strategic one. The purpose was to get the materials necessary for existence and our war effort. But the Navy felt that in order to hold this very expansive area it would be necessary to get far outlying lookout points, and while we might not be able to hold on to such outlying points, we must at least get them once, even if we were to lose them to the enemy again later. It was in pursuance of that policy that we occupied or tried to occupy such distant bases as the ALEUTIANS, RABAUL, and MIDWAY.\nQ. Was this particular objective–that is, the Western ALEUTIANS–included in the plan over the objections of the Army? That is, was it primarily sponsored by the Navy?\nA. No, it was not against Army opposition that the ALEUTIAN bases were included in this plan. The idea originated with YAMAMOTO who, when laying down a plan of Naval operations, felt that the holding of such outlying bases was essential to an overall success of the Navy’s plans. When that idea was transferred to Imperial General Headquarters, the Army took the view that if the Navy fleet that such a policy is essential then wee give it support. They fell in readily with the Navy’s proposal, the difference of opinion arose only when the time came for the withdrawal from KISKA. The reason for the Navy favoring defense to the last man was that since they had gone there in the first place with the expectation of having at some future time to lose it, why not fight it out to the last man? Against that, there was considerable Army objection.\nQ. In the original concept at the beginning of the war, were the various forces given definite final objectives or merely limited objectives, with a view to subsequent orders depending on the progress of the campaign?\nA. The original order given to Admiral YAMAMOTO by the Imperial General Headquarters contained two main parts: one, destruction of the enemy fleet; two, coordination with the Army in capturing, and gaining control of the southern areas. With regard to the first pint, as in the case of the RUSSO-JAPANESE War when Admiral TOGO was ordered to destroy the RUSSIAN Fleet without any detailed instructions as to how or where that was to be done, steps and methods to be employed for the destruction of the enemy fleet were left to Admiral YAMAMOTO’s discretion. He was to draw up the plan of operation by estimating the enemy strength in the light of the strength which he had available himself. As regards the second point, the Army, of course, was to carry out the work of occupation. The purpose of that was less strategic than economic and political, the object being principally to gain control of the raw materials in the south. The duty of the Navy in that connection was to support the Army effort both with its fleet and its land-based air force. lest there be misunderstanding on the point, I wish to say that though Admiral YAMAMOTO was assigned this specific duty of planning and executing the destruction of the enemy fleet according to his own discretion, he could not activate any plan without the approval of the Imperial General Headquarters. I cannot recall that any line was fixed to designate the limits of ocean surface to be secured; I do recall, however, that lands to be occupied were definitely fixed.\nQ. Initially, what was the farthest fixed position to which the advance in the north was limited?\nA. In the north, the ALEUTIANS, including ATTU and KISKA, but I believe that DUTCH HARBOR was left to fleet discretion. In the south RABAUL was designated from the beginning; and the SOLOMONS and MIDWAY were added later.\nQ. This would then be called the first established line–ATTU and KISKA (possibly DUTCH HARBOR), WAKE, RABAUL and so on west? We might accept that as a first line?\nA. Yes, include the GILBERTS in that line. That was the first line for occupation but this did not restrict naval activity.\nQ. Then the move into the Western ALEUTIANS in June 1942 was actually in completion of this initial plan, even though delayed somewhat?\nA. I wish to make a correction, the question of including KISKA and ATTU in the original program was only considered, but it was not adopted at that time. It was added at the same time MIDWAY was brought into this line.\nQ. When was the decision reached to expand the perimeter to include MIDWAY, and what were the reasons therefor?\nA. The taking of MIDWAY was a part of the fleet desire. From the outset, the fleet wanted to take MIDWAY even if subsequent developments caused its loss. I believe the idea originated with Admiral YAMAMOTO that the fleet wished to take it even if subsequent developments should necessitate giving it up again. The Imperial General STaff, however, was opposed to the idea at first because the disadvantages of holding MIDWAY, especially in the way of supply, would outweigh the advantages. It had always been a policy of the Japanese Navy to hold the fleet in waters relatively close to home to meet the enemy there in surface interception operations, the object being to engage the enemy in areas most advantageous for us. But as the operations in the first stage of the war were so successful as to even exceed expectations and as the fleet again submitted its plan for taking MIDWAY with details of the plan, especially with regard to the reasons for the necessity of taking it and the chances of success of the operation, the Imperial Staff at this time gave its support. The Army also fell in line and offered to send troops for occupation. As this was an addition to the original plan of operations it was issued as a new Imperial General Headquarters order. By way of summary, it might be stated the purpose of this operation for taking MIDWAY was to utilize it as a base for future advances, and at the same time to prevent its being used by the enemy as a base. The Chief of the Naval General Staff, Admiral NAGANO, had full confidence in Admiral YAMAMOTO’s judgment, and was always willing to trust his judgment in respect to fleet operations. he appeared to have the feeling that if Admiral YAMAMOTO said that a certain plan promised success he would be willing to let Admiral YAMAMOTO proceed with its execution. While there was discussion of this plan between the fleet and authorities in the General STaff, what really led to Admiral NAGANO giving his final consent to the carrying out of this plan was the fact he always had full confidence in the CinC of the Fleet.\nQ. About what date was the additional order issued?\nA. I don’t remember the exact date but believe it was just prior to commencement of the operation. Since the fleet had studied this operation very closely, they were in a position to put the plan into operation immediately once it was issued.\nQ. You made a suggestion of further forward advances. Did the Naval General Staff act on its own initiative or did it receive from Admiral YAMAMOTO plans to go on beyond MIDWAY? If so, what was the nature of those plans?\nA. It would probably be more accurate to say that one of the purposes for taking MIDWAY was to use it as a base for subsequent operations rather than for further advance.\nNo doubt the fleet had been studying the possibility for further advances even to HAWAII, but doesn’t appear to have been able to draw up a plan that would promise success, and the Imperial General Staff had been opposed from the beginning to extending the line too far. I am certain that there was no definite adoption of a plan, at that time, to go beyond MIDWAY.\nFrom some time prior to this, the Naval General Staff had been considering the question of operations toward HAWAII as a problem reserved for a subsequent time, a time when our fleet should have destroyed the American Fleet. However, the General Staff had not transmitted this idea to the fleet yet.\nQ. What were the effects of the Battle of MIDWAY, 406 June 1942, and what new plans, if any, were evolved directly as a result of that action?\nA. The result of the MIDWAY engagement was a most serious blow to our Navy. Admiral YAMAMOTO’s basic policy had been to engage the enemy in a decisive fleet engagement. He was at the same time an advocate of using air power, including the use of land-based air forces. In undertaking the capture of MIDWAY, he, no doubt, planned to use MIDWAY as a base for just such a fleet engagement; but as a result of this serious set-back at MIDWAY, he was probably forced to give up the hope of holding such a fleet engagement a great distance from home. The effect of the MIDWAY Battle was to greatly restrict the area in which such a fleet engagement could be carried out….\nQ. You have several times mentioned phases of the war. How do you divide the war into phases?\nA. This division into phases was an arbitrary one adopted merely for sake of convenience. However, such a division had always been contemplated and was always in the minds of the Navy General Staff from earlier years. The first phase operation was the occupation of the raw materials area to the south. The second phase was after the change from offensive in taking this area to the defensive of the occupied area. In addition, the fleet attempted a third phase which covered the period between the two already mentioned; namely, the period of stabilization of the occupied area immediately after occupation and prior to the beginning of the defensive operations. So the actual order became: first phase–occupation, second phase–stabilization, third phase–defensive. Admiral YAMAMOTO commanded the fleet through the first phase and the early part of the second phase, Admiral KOGA was in command through the latter part of the second phase and the early part of the third phase, and Admiral TOYODA followed through the last part of the third phase.\nAs I said before, Malkin is incorrect in saying there was a “low” chance of an invasion of the West Coast.  There was NO chance of an invasion of the West Coast, as even an invasion of Hawaii was untenable for the many reasons I have mentioned.  One thing these Japanese admirals – like the former Commandant to whom I spoke – understand that Malkin does not, is that carrier-launched airplanes were no substitute for land-based aircraft during WWII, hence Yamamoto’s desire to use Midway as a base for a fleet engagement, and the IJN General Staff’s awareness that further attempts to raid or invade Hawaii and the West Coast would be both costly and foolish.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-16T07:43:00+00:00"
}