{
  "url": "https://voxday.net/2004/09/15/so-much-for-hindsight-theory/",
  "scraped_at": "2025-12-19T20:45:51.319018",
  "title": "So much for the hindsight theory",
  "date_display": "September 15, 2004",
  "date_iso": "2004-09-15T20:51:00+00:00",
  "date_from_url": "2004-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>On 3 January [1942] President Roosevelt sent Mr. Stimson a list of munitions, with a directive that he achieve the schedules contained therein and consult with the Secretary of the Navy as to allocation between the using services. No relative priorities were suggested. Aircraft goals were as follows:</br></p><p>Aircraft Types\t1942\t1943<br> <br>Long-range, heavy, and medium bombers\t11,300\t30,000<br> <br>Light, dive, and scout bombers\t11,000\t17,000<br> <br>Pursuits\t16,000\t38,000<br> <br>Observation and transports\t  6,700\t  15,000<br> <br> Total combat:\t45,000\t100,000<br> <br>Trainers\t 15,000\t 31,000<br> <br> GRAND TOTALS:\t60,000\t131,000</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>For 1942, this meant increasing existing schedules from about 46,000 to 60,000. The figures for 1943 differed slightly from those sent to Congress by the President on 6 January, which called for 25,000 rather than 31,000 trainers.51 In either case they seemed prodigious, especially in view of equally impressive requirements for ground and naval warfare. With any reasonably calculated rate of wastage, the annual production schedules of 60,000 and 131,000 aircraft should easily meet the requirements agreed on at London–about 60,000 combat and 37,000 raining planes for the AAF and 21,000 for the U.S. Navy, plus the British deficit of 13,553.</p><p><em> AAF Historical Study, Logistical Plans and Problems, 1941-42, with Special Reference to Buildup of the Eighth Air Force.</em><br/></p></blockquote><p>Yes, clearly FDR had no idea about the significance of US production superiority.  Furthermore, that post Pearl Harbor revision of AWPD is characterized as follows:<br/></p><blockquote><p> <br>“Within the Air Staff there was an immediate, though momentary, reaction in favor of deploying all available air strength for defense of the Western Hemisphere and, if practicable, of Hawaii and the Philippines.  Within a week, however, AAF planners returned to a more familiar theme with a new long-term design for offensive war. This plan, called AWPD/4 (15 December 1941) was hardly more than a restatement of the salient features of AWPD/1, with requirements somewhat inflated under the stimulus of war. It called for an air force of some 3,000,000 men and 90,000 planes….</br></p><p>The British chiefs of staff early presented their views in a memorandum which, with slight revisions by the Americans, was approved on 31 December [1941]. The strategy thus accepted was, “in spite of recent events,” essentially a reaffirmation of the principles of ABC-1. Again Germany was declared the chief enemy, the Atlantic and Europe the areas in which the principal efforts should be applied. The nature of the contemplated efforts was unchanged: defense of production areas in North American and the United Kingdom to insure realization of the Victory Program of munitions; maintenance of designated lines of communication, both sea lanes and air routes; forging and tightening a ring around Germany; weakening the Reich by indirect methods and by a concentrated bomber attack; and preparation for the eventual invasion of Germany. Meanwhile, <b>in the Pacific only such positions should be defended as would “safeguard vital interests and deny Japan access to needed raw materials.</b>”<br/></p></blockquote><p></p></div>",
  "content_text": "On 3 January [1942] President Roosevelt sent Mr. Stimson a list of munitions, with a directive that he achieve the schedules contained therein and consult with the Secretary of the Navy as to allocation between the using services. No relative priorities were suggested. Aircraft goals were as follows:\nAircraft Types\t1942\t1943\nLong-range, heavy, and medium bombers\t11,300\t30,000\nLight, dive, and scout bombers\t11,000\t17,000\nPursuits\t16,000\t38,000\nObservation and transports\t  6,700\t  15,000\nTotal combat:\t45,000\t100,000\nTrainers\t 15,000\t 31,000\nGRAND TOTALS:\t60,000\t131,000\nFor 1942, this meant increasing existing schedules from about 46,000 to 60,000. The figures for 1943 differed slightly from those sent to Congress by the President on 6 January, which called for 25,000 rather than 31,000 trainers.51 In either case they seemed prodigious, especially in view of equally impressive requirements for ground and naval warfare. With any reasonably calculated rate of wastage, the annual production schedules of 60,000 and 131,000 aircraft should easily meet the requirements agreed on at London–about 60,000 combat and 37,000 raining planes for the AAF and 21,000 for the U.S. Navy, plus the British deficit of 13,553.\nAAF Historical Study, Logistical Plans and Problems, 1941-42, with Special Reference to Buildup of the Eighth Air Force.\nYes, clearly FDR had no idea about the significance of US production superiority.  Furthermore, that post Pearl Harbor revision of AWPD is characterized as follows:\n“Within the Air Staff there was an immediate, though momentary, reaction in favor of deploying all available air strength for defense of the Western Hemisphere and, if practicable, of Hawaii and the Philippines.  Within a week, however, AAF planners returned to a more familiar theme with a new long-term design for offensive war. This plan, called AWPD/4 (15 December 1941) was hardly more than a restatement of the salient features of AWPD/1, with requirements somewhat inflated under the stimulus of war. It called for an air force of some 3,000,000 men and 90,000 planes….\nThe British chiefs of staff early presented their views in a memorandum which, with slight revisions by the Americans, was approved on 31 December [1941]. The strategy thus accepted was, “in spite of recent events,” essentially a reaffirmation of the principles of ABC-1. Again Germany was declared the chief enemy, the Atlantic and Europe the areas in which the principal efforts should be applied. The nature of the contemplated efforts was unchanged: defense of production areas in North American and the United Kingdom to insure realization of the Victory Program of munitions; maintenance of designated lines of communication, both sea lanes and air routes; forging and tightening a ring around Germany; weakening the Reich by indirect methods and by a concentrated bomber attack; and preparation for the eventual invasion of Germany. Meanwhile,\nin the Pacific only such positions should be defended as would “safeguard vital interests and deny Japan access to needed raw materials.\n”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-15T19:51:00+00:00"
}