{
  "url": "https://voxday.net/2004/09/22/so-not-surprised/",
  "scraped_at": "2025-12-19T20:46:53.928819",
  "title": "So not surprised",
  "date_display": "September 22, 2004",
  "date_iso": "2004-09-22T15:41:00+00:00",
  "date_from_url": "2004-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Zekedood sends an email informing us that, as expected, Michelle Malkin can’t defend herself.  Furthermore, I recommend having a look at her direct quote shown in bold below.  Tell me if you think she’s telling the truth.<br/></p><blockquote><p> <br>Yesterday Michelle Malkin was a guest on the Ron Smith show on WBAL in Baltimore.  Ron Smith is something of a small-l libertarian.  He came out very early (in 2002) on the anti-Iraq war side, citing the non-threat Saddam Hussein posed to the US, WMD or not.  So when he teased Mrs. Malkin’s appearance by saying that he was going to ask about your challenge to debate her, I was certain that it was going to lead to something good.</br></p><p>However, he pretty much gave “me-so-Michelle” a free pass.  He started the interview by referring to the opposition her book had received from various parties, particularly “Vox Day, the WorldNetDaily columnist”, and asked if she was going to take you up on your challenge to debate the issue on radio.  Her answer: <b>“I won’t be doing that.  I have already addressed those<br> <br>questions on my blog.”</br></br></b> “Me-so” was then given a free pass to restate the case laid out in her book (without challenge) before the interview changed direction to discuss the Rathergate fiasco.</p><p>I decided to double check “Me-so”‘s contention that she had addressed your questions on her blog.  Shock and awe!  No mention of you or your questions.  Not a peep.  There was, in the August archive of the blog, a small section where she “took on” other bloggers who had questioned her premise.  But there was no mention of you, your questions, or your contention that she whiffed badly on her research.  More shock and awe!</p><p>I’m not sure with whom I’m more disgusted — “Me-so” for dissembling, or Ron Smith for being such a patsy.<br/></p></blockquote><p>I’m not surprised in the least.  She can’t afford to have it known how little she knows about the military situation, so she’s hoping everyone will quietly ignore this until it passes over.  The blogosphere can give her a free pass if it wants, but they had better realize that in doing so, they are imitating the mainstream media over which they are currently affecting such superiority.  But why they’d want to sacrifice their own integrity to cover for someone who’s now proven herself to be a charlatan, a coward and a liar is beyond me.</p><p>In any event, I’ll be precisely delineating the many differences between her alternate history fantasy and the history of our space-time continuum on the Northern Alliance show this Saturday.<br/></p></div>",
  "content_text": "Zekedood sends an email informing us that, as expected, Michelle Malkin can’t defend herself.  Furthermore, I recommend having a look at her direct quote shown in bold below.  Tell me if you think she’s telling the truth.\nYesterday Michelle Malkin was a guest on the Ron Smith show on WBAL in Baltimore.  Ron Smith is something of a small-l libertarian.  He came out very early (in 2002) on the anti-Iraq war side, citing the non-threat Saddam Hussein posed to the US, WMD or not.  So when he teased Mrs. Malkin’s appearance by saying that he was going to ask about your challenge to debate her, I was certain that it was going to lead to something good.\nHowever, he pretty much gave “me-so-Michelle” a free pass.  He started the interview by referring to the opposition her book had received from various parties, particularly “Vox Day, the WorldNetDaily columnist”, and asked if she was going to take you up on your challenge to debate the issue on radio.  Her answer:\n“I won’t be doing that.  I have already addressed those\nquestions on my blog.”\n“Me-so” was then given a free pass to restate the case laid out in her book (without challenge) before the interview changed direction to discuss the Rathergate fiasco.\nI decided to double check “Me-so”‘s contention that she had addressed your questions on her blog.  Shock and awe!  No mention of you or your questions.  Not a peep.  There was, in the August archive of the blog, a small section where she “took on” other bloggers who had questioned her premise.  But there was no mention of you, your questions, or your contention that she whiffed badly on her research.  More shock and awe!\nI’m not sure with whom I’m more disgusted — “Me-so” for dissembling, or Ron Smith for being such a patsy.\nI’m not surprised in the least.  She can’t afford to have it known how little she knows about the military situation, so she’s hoping everyone will quietly ignore this until it passes over.  The blogosphere can give her a free pass if it wants, but they had better realize that in doing so, they are imitating the mainstream media over which they are currently affecting such superiority.  But why they’d want to sacrifice their own integrity to cover for someone who’s now proven herself to be a charlatan, a coward and a liar is beyond me.\nIn any event, I’ll be precisely delineating the many differences between her alternate history fantasy and the history of our space-time continuum on the Northern Alliance show this Saturday.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-22T14:41:00+00:00"
}