{
  "url": "https://voxday.net/2004/09/10/ultimate-challenge/",
  "scraped_at": "2025-12-19T20:44:52.108485",
  "title": "The ultimate challenge",
  "date_display": "September 10, 2004",
  "date_iso": "2004-09-10T08:38:00+00:00",
  "date_from_url": "2004-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Umberto Eco is one of my favorite novelists, despite being notoriously difficult to read.  He’s also considered very difficult by native Italian speakers, as in addition to his unusually long, complex sentences, he makes frequent use of a verb form that is not used in modern Italian speech.  For my birthday, Space Bunny was kind enough to call me on my possibly overoptimistic confidence in my linguistic abilities and obtain a copy of his latest novel, <em>La Misteriosa Fiamma della Regina Loana</em>, which I began tackling last week.</p><p>It’s rough sledding, as you might expect, but I’m rather pleased with the progress that I’m making so far.  I decided not to use a dictionary while I’m reading as I’d be looking up every sixth word otherwise, but to attempt to grok the fullness via context instead.  I’m a natural speed reader, so I tend to do a degree of word-skipping anyhow; what’s been a surprising discovery for me is that reading slowly is actually more pleasurable.</p><p>Big Chilly discovered this many years ago – he was also a natural speed reader – and actually trained himself to read slowly, in order to better savor the Piers Anthony novels he was devouring at the time.  (Relax, Sarah, I’m talking about the Xanth and Adept series.)  I don’t think I could bring myself to do that, as I find the utility of reading quickly to outweigh any lost pleasure, but I very much doubt I’ll ever have the facility in Italian.  Nor would I want to take the risk, as Big Chilly would like to be able to speed read again, but for some reason, he can’t do it now.</p><p>Anyhow, I’m only nine pages in, so it’s entirely possible that I’ll give up in despair at some point, but it’s nice to be forced to stretch the little gray cells in the meantime.  My goal is to finish it before the English translation is published and the temptation to cheat becomes overwhelming.<br/></p></div>",
  "content_text": "Umberto Eco is one of my favorite novelists, despite being notoriously difficult to read.  He’s also considered very difficult by native Italian speakers, as in addition to his unusually long, complex sentences, he makes frequent use of a verb form that is not used in modern Italian speech.  For my birthday, Space Bunny was kind enough to call me on my possibly overoptimistic confidence in my linguistic abilities and obtain a copy of his latest novel,\nLa Misteriosa Fiamma della Regina Loana\n, which I began tackling last week.\nIt’s rough sledding, as you might expect, but I’m rather pleased with the progress that I’m making so far.  I decided not to use a dictionary while I’m reading as I’d be looking up every sixth word otherwise, but to attempt to grok the fullness via context instead.  I’m a natural speed reader, so I tend to do a degree of word-skipping anyhow; what’s been a surprising discovery for me is that reading slowly is actually more pleasurable.\nBig Chilly discovered this many years ago – he was also a natural speed reader – and actually trained himself to read slowly, in order to better savor the Piers Anthony novels he was devouring at the time.  (Relax, Sarah, I’m talking about the Xanth and Adept series.)  I don’t think I could bring myself to do that, as I find the utility of reading quickly to outweigh any lost pleasure, but I very much doubt I’ll ever have the facility in Italian.  Nor would I want to take the risk, as Big Chilly would like to be able to speed read again, but for some reason, he can’t do it now.\nAnyhow, I’m only nine pages in, so it’s entirely possible that I’ll give up in despair at some point, but it’s nice to be forced to stretch the little gray cells in the meantime.  My goal is to finish it before the English translation is published and the temptation to cheat becomes overwhelming.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-10T07:38:00+00:00"
}