{
  "url": "https://voxday.net/2004/09/11/voting-third-party-vs-not-voting/",
  "scraped_at": "2025-12-19T20:45:06.896317",
  "title": "Voting third-party vs not voting",
  "date_display": "September 11, 2004",
  "date_iso": "2004-09-11T14:02:00+00:00",
  "date_from_url": "2004-09-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m actually quite sympathetic to <a href=\"http://bloggerblaster.blogspot.com/2004_09_01_bloggerblaster_archive.html#109430949105619974\">the Gargler’s anti-voting philosophy</a>.  It is a withdrawal of your consent from the system and a refusal to participate in your own destruction.  I also largely agree with him that it is, at the very least, extremely unusual for a government to voluntarily give up power; even in the case of the British Empire, at least a nominal amount of force was usually required to convince the Imperialists to go home.</p><p>The primary reason that I support third-party voting is that it accomplishes much the same negative function, but does so more visibly.  I don’t expect the Libertarians or the Constitutionals to win, but their growing support makes the sickness of the system more obvious to all, whereas lower voting percentages are simply dismissed as stupid and uninterested youth or something equally irrelevant.  It is harder for the casual observer to ignore a 5 percent increase in third party support than a 5 percent decline in the overall vote – which most people would never notice anyhow.</p><p>The very fact that both Democrats and Republicans get more disturbed by someone supporting a third party candidate than someone announcing that they’ll stay home is testament to this.  But does it greatly matter either way?  No.  Far better to stay home and withhold one’s consent than to support either of the bi-factional ruling party’s candidates.<br/></p></div>",
  "content_text": "I’m actually quite sympathetic to\nthe Gargler’s anti-voting philosophy\n.  It is a withdrawal of your consent from the system and a refusal to participate in your own destruction.  I also largely agree with him that it is, at the very least, extremely unusual for a government to voluntarily give up power; even in the case of the British Empire, at least a nominal amount of force was usually required to convince the Imperialists to go home.\nThe primary reason that I support third-party voting is that it accomplishes much the same negative function, but does so more visibly.  I don’t expect the Libertarians or the Constitutionals to win, but their growing support makes the sickness of the system more obvious to all, whereas lower voting percentages are simply dismissed as stupid and uninterested youth or something equally irrelevant.  It is harder for the casual observer to ignore a 5 percent increase in third party support than a 5 percent decline in the overall vote – which most people would never notice anyhow.\nThe very fact that both Democrats and Republicans get more disturbed by someone supporting a third party candidate than someone announcing that they’ll stay home is testament to this.  But does it greatly matter either way?  No.  Far better to stay home and withhold one’s consent than to support either of the bi-factional ruling party’s candidates.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-09-11T13:02:00+00:00"
}