{
  "url": "https://voxday.net/2004/02/11/adios-psycho/",
  "scraped_at": "2025-12-13T15:48:31.295132",
  "title": "Adios psycho",
  "date_display": "February 11, 2004",
  "date_iso": "2004-02-11T08:16:00+00:00",
  "date_from_url": "2004-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From My Way News: <em>Wesley Clark, the novice politician with four-star military credentials, <a href=\"http://apnews.myway.com/article/20040211/D80KREBO4.html\">abandoned his presidential bid</a> Tuesday after two third-place finishes in the South. The retired Army general will return to Little Rock, Ark., on Wednesday to announce his departure from the race, said campaign spokesman Matt Bennett. Clark will pledge to work closely with the Democratic Party to support the presidential nominee and other candidates across the country.  “He made this decision after discussing it with his family and his staff,” Bennett said. “It was a very difficult decision to make obviously. He did it after the final results were in for Tennessee and the decision is final.”  He is the fifth Democrat to drop out of the race.</em></p><p>General Clark was the only candidate who seriously made me nervous.  Everyone else would have governed the nation in basically the same Republicrat manner that we’ve known since Reagan ‘s second term – you’re kidding yourself if you think there will be a great deal of difference between how John Francois or George Delano will govern – but I had no difficulty imagining Clark declaring martial law at the first opportunity and turning the country over to the United Nations.</p><p>The amazing campaign has gone down in flames.  Thank goodness.</p></div>",
  "content_text": "From My Way News:\nWesley Clark, the novice politician with four-star military credentials,\nabandoned his presidential bid\nTuesday after two third-place finishes in the South. The retired Army general will return to Little Rock, Ark., on Wednesday to announce his departure from the race, said campaign spokesman Matt Bennett. Clark will pledge to work closely with the Democratic Party to support the presidential nominee and other candidates across the country.  “He made this decision after discussing it with his family and his staff,” Bennett said. “It was a very difficult decision to make obviously. He did it after the final results were in for Tennessee and the decision is final.”  He is the fifth Democrat to drop out of the race.\nGeneral Clark was the only candidate who seriously made me nervous.  Everyone else would have governed the nation in basically the same Republicrat manner that we’ve known since Reagan ‘s second term – you’re kidding yourself if you think there will be a great deal of difference between how John Francois or George Delano will govern – but I had no difficulty imagining Clark declaring martial law at the first opportunity and turning the country over to the United Nations.\nThe amazing campaign has gone down in flames.  Thank goodness.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-11T08:16:00+00:00"
}