{
  "url": "https://voxday.net/2004/02/26/and-its-off/",
  "scraped_at": "2025-12-13T15:51:23.322051",
  "title": "And it’s off",
  "date_display": "February 26, 2004",
  "date_iso": "2004-02-26T16:08:00+00:00",
  "date_from_url": "2004-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just fired next week’s column off to the editors.  I suspect it will provoke a bit of a discussion, although possibly one a little less vehement than last week’s.  Once again, I’m taking a position that is <em>a priori</em> somewhat contrary to what one might expect based on a cursory reflection, but this time I think I’ve made a case that is more methodical and logically airtight than last week’s admittedly more rhetorical argument.</p><p>It’s definitely a bit more work, though.  Jonah Goldberg of NRO is so correct when he complains that the Internet is vastly overrated as a research tool.  You can always learn something about the subject in which you’re interested, but the moment that you decide you need a particular piece of data, it begins to assume the prospect of a needle in a haystack, moreover, a needle which quite possibly may not be there.   We have a long, long way to go before the Internet fully realizes its promise of becoming an easily accessible instant brain-data multiplier.</p><p>In any case, I like having a bit of variety, not only in subject matter, but also in how it’s presented.  I hope most of you feel the same way too.</p></div>",
  "content_text": "Just fired next week’s column off to the editors.  I suspect it will provoke a bit of a discussion, although possibly one a little less vehement than last week’s.  Once again, I’m taking a position that is\na priori\nsomewhat contrary to what one might expect based on a cursory reflection, but this time I think I’ve made a case that is more methodical and logically airtight than last week’s admittedly more rhetorical argument.\nIt’s definitely a bit more work, though.  Jonah Goldberg of NRO is so correct when he complains that the Internet is vastly overrated as a research tool.  You can always learn something about the subject in which you’re interested, but the moment that you decide you need a particular piece of data, it begins to assume the prospect of a needle in a haystack, moreover, a needle which quite possibly may not be there.   We have a long, long way to go before the Internet fully realizes its promise of becoming an easily accessible instant brain-data multiplier.\nIn any case, I like having a bit of variety, not only in subject matter, but also in how it’s presented.  I hope most of you feel the same way too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-26T16:08:00+00:00"
}