{
  "url": "https://voxday.net/2004/02/05/anonymous-blogging/",
  "scraped_at": "2025-12-13T15:47:23.612809",
  "title": "Anonymous blogging",
  "date_display": "February 5, 2004",
  "date_iso": "2004-02-05T23:36:00+00:00",
  "date_from_url": "2004-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I seriously fail to see what the deal is here.  [There’s been a bit of a discussion floating around the Sphere thanks to J. Goldberg and the PuppyAbuser]  You know everything you need to know about a blog from the ideas they express.  I daresay that those of you who visit here regularly or have read my column for two years know who I am a lot better than half the people who primarily encounter me socially on a regular basis and with whom I only engage in meaningless small talk.</p><p>It makes no difference that we know Jonah Goldberg=Jonah Goldberg but we don’t know if BloggerX=Mark Smith or Jane Weatherbee.  Who cares?  Ideas must be capable of standing on their own right and I hate the notion that X = true if A is black, but false if A is white.  Substitute your personal identifying adjective of choice, but you get the point.</p><p>I’m not anonymous anyhow, as anyone with 30 seconds and an Internet link or a decent grasp of classical languages can figure out my private joke between me.  But this is the persona that I have chosen for myself in this field, just as Desert Cat and Physics Geek have carved out their own little niches and I think that’s cool.  Heck, I was just talking with the White Buffalo about the right name for someone who has personally threatened me if their blogstar name is insufficiently flattering.   (By the way, El Zinko Pinko, I have to tell you that he has been absolutely dying to make a Teletubbies reference and he is very sad that he doesn’t know you well enough to rip you.  Oh, that I were so fortunate.)</p><p>Which reminds me.  There is no better set of monikers than on the radio shows when Todd Steussie was playing in Minnesota.  There was “Holding On Number 73 On The Offense Guy” and “False Start on Number 73 On The Offense Guy”.  Space Bunny was hoping Carolina would lose just so I’d stop saying that every time they showed Steussie on TV. <em>“Hey, false start on Number-” “Would you PLEASE shut up with that?” “But, see, the irony is that it actually was a false-”  “I DON’T CARE!”</em></p><p>What was the point?  Did I have one?  Oh, right.  Anonymous blogging is moral, virtuous, good and healthy.   And let’s face it, it’s fun.</p></div>",
  "content_text": "I seriously fail to see what the deal is here.  [There’s been a bit of a discussion floating around the Sphere thanks to J. Goldberg and the PuppyAbuser]  You know everything you need to know about a blog from the ideas they express.  I daresay that those of you who visit here regularly or have read my column for two years know who I am a lot better than half the people who primarily encounter me socially on a regular basis and with whom I only engage in meaningless small talk.\nIt makes no difference that we know Jonah Goldberg=Jonah Goldberg but we don’t know if BloggerX=Mark Smith or Jane Weatherbee.  Who cares?  Ideas must be capable of standing on their own right and I hate the notion that X = true if A is black, but false if A is white.  Substitute your personal identifying adjective of choice, but you get the point.\nI’m not anonymous anyhow, as anyone with 30 seconds and an Internet link or a decent grasp of classical languages can figure out my private joke between me.  But this is the persona that I have chosen for myself in this field, just as Desert Cat and Physics Geek have carved out their own little niches and I think that’s cool.  Heck, I was just talking with the White Buffalo about the right name for someone who has personally threatened me if their blogstar name is insufficiently flattering.   (By the way, El Zinko Pinko, I have to tell you that he has been absolutely dying to make a Teletubbies reference and he is very sad that he doesn’t know you well enough to rip you.  Oh, that I were so fortunate.)\nWhich reminds me.  There is no better set of monikers than on the radio shows when Todd Steussie was playing in Minnesota.  There was “Holding On Number 73 On The Offense Guy” and “False Start on Number 73 On The Offense Guy”.  Space Bunny was hoping Carolina would lose just so I’d stop saying that every time they showed Steussie on TV.\n“Hey, false start on Number-” “Would you PLEASE shut up with that?” “But, see, the irony is that it actually was a false-”  “I DON’T CARE!”\nWhat was the point?  Did I have one?  Oh, right.  Anonymous blogging is moral, virtuous, good and healthy.   And let’s face it, it’s fun.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-05T23:36:00+00:00"
}