{
  "url": "https://voxday.net/2004/02/15/at-least-shell-have-time-to-polish-her/",
  "scraped_at": "2025-12-13T15:49:21.175769",
  "title": "At least she’ll have time to polish her medal",
  "date_display": "February 15, 2004",
  "date_iso": "2004-02-15T22:51:00+00:00",
  "date_from_url": "2004-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I didn’t agree with Joseph Farah when he wanted to give <a href=\"http://www.upi.com/view.cfm?StoryID=20030214-063734-3653r\">this woman</a> a medal.  First, because his column pandered to the mistaken notion that male philandering is a primary cause of divorce in this country.  Second, because it’s just a really, really bad idea to encourage people to kill for money, which is exactly what was going on here.  The primary reason people kill instead of getting a divorce is because they can’t bear the idea of lowering their living standard, which is frequently the case for men and usually the case for women after a divorce.</p><p>Giving a murderess a medal won’t solve anything.  If you want to stop divorce, make it difficult or impossible to obtain.  Better yet, get the state out of the whole marriage business altogether.</p><p><em>HOUSTON, Feb. 14 (UPI) — A Houston jury Friday sentenced Clara Harris to 20 years in prison for murdering her husband with her car after catching him with another woman.  The 45-year-old dentist and mother of two appeared to collapse in the grasp of her attorneys when the verdict was announced after six hours of deliberation. The same jury of nine women and three men Thursday convicted Harris of murder….  Harris will have to serve half of the 20-year sentence because the jury ruled Thursday that the Mercedes-Benz she used to run down her husband, David, last July outside a hotel was a “deadly weapon.” She was also fined $10,000.  Harris was charged with murder after police said she drove her Mercedes-Benz over her husband three times outside the Nassau Bay Hilton Inn in suburban Friendswood. Minutes before, she had just confronted her husband and his mistress in the hotel’s lobby.</em></p><p>Ironically, the sentencing came on the 11th anniversary of the Harrises’ marriage.  Earlier Friday, defense attorney George Parnham appealed to the jury to have mercy on his client and give her probation because of her twin sons. He said she was “a good mother, a good wife,” and she didn’t deserve prison time.</p><p>I don’t think that you can claim to be a good wife or a good mother after running over a man THREE FREAKING TIMES with your step-daughter in the car.</p></div>",
  "content_text": "I didn’t agree with Joseph Farah when he wanted to give\nthis woman\na medal.  First, because his column pandered to the mistaken notion that male philandering is a primary cause of divorce in this country.  Second, because it’s just a really, really bad idea to encourage people to kill for money, which is exactly what was going on here.  The primary reason people kill instead of getting a divorce is because they can’t bear the idea of lowering their living standard, which is frequently the case for men and usually the case for women after a divorce.\nGiving a murderess a medal won’t solve anything.  If you want to stop divorce, make it difficult or impossible to obtain.  Better yet, get the state out of the whole marriage business altogether.\nHOUSTON, Feb. 14 (UPI) — A Houston jury Friday sentenced Clara Harris to 20 years in prison for murdering her husband with her car after catching him with another woman.  The 45-year-old dentist and mother of two appeared to collapse in the grasp of her attorneys when the verdict was announced after six hours of deliberation. The same jury of nine women and three men Thursday convicted Harris of murder….  Harris will have to serve half of the 20-year sentence because the jury ruled Thursday that the Mercedes-Benz she used to run down her husband, David, last July outside a hotel was a “deadly weapon.” She was also fined $10,000.  Harris was charged with murder after police said she drove her Mercedes-Benz over her husband three times outside the Nassau Bay Hilton Inn in suburban Friendswood. Minutes before, she had just confronted her husband and his mistress in the hotel’s lobby.\nIronically, the sentencing came on the 11th anniversary of the Harrises’ marriage.  Earlier Friday, defense attorney George Parnham appealed to the jury to have mercy on his client and give her probation because of her twin sons. He said she was “a good mother, a good wife,” and she didn’t deserve prison time.\nI don’t think that you can claim to be a good wife or a good mother after running over a man THREE FREAKING TIMES with your step-daughter in the car.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-15T22:51:00+00:00"
}