{
  "url": "https://voxday.net/2004/02/29/attack-at-all-costs/",
  "scraped_at": "2025-12-13T15:51:52.793066",
  "title": "Attack at all costs",
  "date_display": "February 29, 2004",
  "date_iso": "2004-02-29T16:05:00+00:00",
  "date_from_url": "2004-02-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Corliss <a href=\"http://www.time.com/time/columnist/printout/0,8816,596038,00.html\">writes in TIME</a>: <em>Rooney had a question of his own for Gibson: “How many million dollars does it look as if you’re going to make off the crucifixion of Christ?”  As Bart Simpson would say, that’s funny for so many reasons. Only a few weeks ago, movie insiders were confidently predicting that Gibson, whose “Passion” was rejected by every major studio, would lose his hairshirt over this movie—the $30 million of his own money it took to produce, plus another bundle for prints and advertising. Now that the film has registered the highest opening-day midweek gross of any non-sequel in North American box office history, Gibson’s supposed to be a panderer, pimping Christ’s suffering to audiences who didn’t realize they needed to see their personal Redeemer get scourged for the longer part of two hours.</em></p><p>Not only is this an interesting article defending Mel Gibson and The Passion of the Christ from an unlikely source, but it also has a great line: “a liberal is someone who will defend to the death your right to agree with him.”</p></div>",
  "content_text": "Richard Corliss\nwrites in TIME\n:\nRooney had a question of his own for Gibson: “How many million dollars does it look as if you’re going to make off the crucifixion of Christ?”  As Bart Simpson would say, that’s funny for so many reasons. Only a few weeks ago, movie insiders were confidently predicting that Gibson, whose “Passion” was rejected by every major studio, would lose his hairshirt over this movie—the $30 million of his own money it took to produce, plus another bundle for prints and advertising. Now that the film has registered the highest opening-day midweek gross of any non-sequel in North American box office history, Gibson’s supposed to be a panderer, pimping Christ’s suffering to audiences who didn’t realize they needed to see their personal Redeemer get scourged for the longer part of two hours.\nNot only is this an interesting article defending Mel Gibson and The Passion of the Christ from an unlikely source, but it also has a great line: “a liberal is someone who will defend to the death your right to agree with him.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-29T16:05:00+00:00"
}