{
  "url": "https://voxday.net/2004/02/25/bane-and-rat-spleen-miss-points/",
  "scraped_at": "2025-12-13T15:51:11.565123",
  "title": "Bane and Rat Spleen miss the point(s)",
  "date_display": "February 25, 2004",
  "date_iso": "2004-02-25T17:51:00+00:00",
  "date_from_url": "2004-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bane <a href=\"http://banedad.blogspot.com/2004_02_22_banedad_archive.html#107752736805357493\">goes off</a>: <em>What unadulterated twaddle. This is a classic example of talking to hear your brains rattle. Maybe Vox was working under a deadline.  Folks, there is no peace…peace is merely the intervals between wars. Until Jesus comes, we will be a planet in turmoil, just waiting for the next fire to flare up. This makes Vox’s statement all the more painful, he being a self-professed Christian.</em></p><p>And those countries he mentions that we should ‘bring our troops home’ from? How many of our troops gave their lives so we could take that real estate in the first place? What future peril will fill the vacuum left by our departure, that a new generation of Americans will have to go and fight and die for again?</p><p>Bane, take a deep breath, re-read the column and get a grip.  It’s called rhetoric.  The very point of saying that our soldiers cannot win the peace is because there is no peace to be won.  Come on, I shouldn’t have to spell that out for you.  And how many of those troops gave their lives so we could occupy the 144 countries we currently occupy?  When did we invade Spain and Iceland?  We have never even fought in one-third of those countries in which our troops are stationed, and not one or two, but now three of our rationale for occupying Germany have now expired.  Finally, bringing the troops back to the United States does not imply demobilizing them; it would cost us less to have them here on duty in the United States than serving overseas.</p><p><a href=\"http://ratspleen.blogspot.com/2004_02_01_ratspleen_archive.html#107753888727375855\">Rat Spleen</a>, on the other hand, mistakes historically cognizant strategic consideration coupled with first-hand information with ideologically based fear:<em>Bamf! There goes another Libertarian down the ignorant coward’s path regarding Iraq. Not even a week ago I made mention of this and referred to them then as: “Heartless, and brainless in the same breath”  I’ll thank Vox for his poignant example and leave him to his own devices as he hitches his skirt between his knees and flees faster than a 12 year old in a hookah bar.</em></p><p>I wonder what he makes of the many active duty and retired soldiers who agree with what I’m saying, some of whom are in Iraq right now.  Even Col. Hackworth is starting to come around on the realities of the situation.  I suspect Rat Spleen [correction, though not Bane, who is an Army vet with Marine sons] has a Hollywood notion of war and a romantic concept of what is possible through military action.   He likely has very little idea of what our troops have been actually doing over since the war ended.</p><p>Paul, who is stationed in Iraq, says: <em>I have to add that Vox’s point #4 seems accurate to me based on what I’ve seen briefed. </em>.  An Alliance officer separately told me that his non-humanitarian missions have revolved solely around watching the foreign jihadists and keeping an eye on them  – “we know who they are and where they are” – but they have not been allowed to proactively pursue them once, not even after a big bombing with many fatalities in their immediate area.</p><p>Combat troops are designed to break and destroy enemy units.  Forcing them to serve as peacemakers and nation builders destroys their combat ability.  This is neither new nor controversial.  Indeed, it’s the reason the Nazis had two different SS – because they did not wish to ruin their best soldiers by turning them into guards and butchers – and why even the most elite guard units from the Roman Praetorians to the Iraqi Republicans have consistently proven that they can’t fight worth a damn.  If our combat divisions are not going to be heading into Iran, Syria or Saudi Arabia soon, they must be brought home to preserve their fighting ability, even if the ill-conceived occupation is to continue.</p></div>",
  "content_text": "Bane\ngoes off\n:\nWhat unadulterated twaddle. This is a classic example of talking to hear your brains rattle. Maybe Vox was working under a deadline.  Folks, there is no peace…peace is merely the intervals between wars. Until Jesus comes, we will be a planet in turmoil, just waiting for the next fire to flare up. This makes Vox’s statement all the more painful, he being a self-professed Christian.\nAnd those countries he mentions that we should ‘bring our troops home’ from? How many of our troops gave their lives so we could take that real estate in the first place? What future peril will fill the vacuum left by our departure, that a new generation of Americans will have to go and fight and die for again?\nBane, take a deep breath, re-read the column and get a grip.  It’s called rhetoric.  The very point of saying that our soldiers cannot win the peace is because there is no peace to be won.  Come on, I shouldn’t have to spell that out for you.  And how many of those troops gave their lives so we could occupy the 144 countries we currently occupy?  When did we invade Spain and Iceland?  We have never even fought in one-third of those countries in which our troops are stationed, and not one or two, but now three of our rationale for occupying Germany have now expired.  Finally, bringing the troops back to the United States does not imply demobilizing them; it would cost us less to have them here on duty in the United States than serving overseas.\nRat Spleen\n, on the other hand, mistakes historically cognizant strategic consideration coupled with first-hand information with ideologically based fear:\nBamf! There goes another Libertarian down the ignorant coward’s path regarding Iraq. Not even a week ago I made mention of this and referred to them then as: “Heartless, and brainless in the same breath”  I’ll thank Vox for his poignant example and leave him to his own devices as he hitches his skirt between his knees and flees faster than a 12 year old in a hookah bar.\nI wonder what he makes of the many active duty and retired soldiers who agree with what I’m saying, some of whom are in Iraq right now.  Even Col. Hackworth is starting to come around on the realities of the situation.  I suspect Rat Spleen [correction, though not Bane, who is an Army vet with Marine sons] has a Hollywood notion of war and a romantic concept of what is possible through military action.   He likely has very little idea of what our troops have been actually doing over since the war ended.\nPaul, who is stationed in Iraq, says:\nI have to add that Vox’s point #4 seems accurate to me based on what I’ve seen briefed.\n.  An Alliance officer separately told me that his non-humanitarian missions have revolved solely around watching the foreign jihadists and keeping an eye on them  – “we know who they are and where they are” – but they have not been allowed to proactively pursue them once, not even after a big bombing with many fatalities in their immediate area.\nCombat troops are designed to break and destroy enemy units.  Forcing them to serve as peacemakers and nation builders destroys their combat ability.  This is neither new nor controversial.  Indeed, it’s the reason the Nazis had two different SS – because they did not wish to ruin their best soldiers by turning them into guards and butchers – and why even the most elite guard units from the Roman Praetorians to the Iraqi Republicans have consistently proven that they can’t fight worth a damn.  If our combat divisions are not going to be heading into Iran, Syria or Saudi Arabia soon, they must be brought home to preserve their fighting ability, even if the ill-conceived occupation is to continue.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-25T17:51:00+00:00"
}