{
  "url": "https://voxday.net/2004/02/03/banning-abortion-in-south-dakota/",
  "scraped_at": "2025-12-13T15:46:53.734720",
  "title": "Banning abortion in South Dakota",
  "date_display": "February 3, 2004",
  "date_iso": "2004-02-03T08:38:00+00:00",
  "date_from_url": "2004-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Evangelical Outpost rightly takes to task those of us who found the time to mention Miss Jackson, but not the fact that the South Dakota legislature and governor are taking on the US Supreme Court by <a href=\"http://www.evangelicaloutpost.com/archives/000346.html\">banning and criminalizing abortion</a>.  This is definitely something that needs to be supported; judicial tyranny must be faced down and I’d very much like to see a state dare the Federal Government to do something about what both sides know was an illegitimate power grab by the Court and its Federal allies.</p><p><em>Section 1. The Legislature finds that the State of South Dakota has a compelling and paramount interest in the preservation and protection of all human life within and subject to its jurisdiction and that the preservation and protection of human life applies to all human life, born or unborn.</em></p><p>Section 2. The Legislature finds that since neither constitutional law nor Supreme Court decision has resolved the question of the beginning of life, it is within the proper sphere of state legislative enactment to determine the question in light of the best scientific and medical evidence. The Legislature therefore finds that unborn human life begins when the ovum is fertilized by male sperm.</p><p>You said you wanted a cause, conservatives.  You said you wanted something to support.  There you go.  Let the legislators of South Dakota know that you support them in this.</p></div>",
  "content_text": "The Evangelical Outpost rightly takes to task those of us who found the time to mention Miss Jackson, but not the fact that the South Dakota legislature and governor are taking on the US Supreme Court by\nbanning and criminalizing abortion\n.  This is definitely something that needs to be supported; judicial tyranny must be faced down and I’d very much like to see a state dare the Federal Government to do something about what both sides know was an illegitimate power grab by the Court and its Federal allies.\nSection 1. The Legislature finds that the State of South Dakota has a compelling and paramount interest in the preservation and protection of all human life within and subject to its jurisdiction and that the preservation and protection of human life applies to all human life, born or unborn.\nSection 2. The Legislature finds that since neither constitutional law nor Supreme Court decision has resolved the question of the beginning of life, it is within the proper sphere of state legislative enactment to determine the question in light of the best scientific and medical evidence. The Legislature therefore finds that unborn human life begins when the ovum is fertilized by male sperm.\nYou said you wanted a cause, conservatives.  You said you wanted something to support.  There you go.  Let the legislators of South Dakota know that you support them in this.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-03T08:38:00+00:00"
}