{
  "url": "https://voxday.net/2004/02/09/bark-little-doggy/",
  "scraped_at": "2025-12-13T15:48:06.569564",
  "title": "Bark little doggy",
  "date_display": "February 9, 2004",
  "date_iso": "2004-02-09T17:22:00+00:00",
  "date_from_url": "2004-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rich Brookhiser writes on NRO: <em>We are in a war, GWB understands it, and very little else matters. Of the preceding points, perhaps only the last matters. We want the United States and the civilization it is defending to prevail, and at this moment that means we want George W. Bush to win re-election. We also know that even victory will involve great and destabilizing losses. Nobody promised us a perfect life. That’s why we’re conservatives. </em></p><p>Ask yourself if this logic would work for you if you substituted FDR, LBJ or Woodrow Wilson for George Delano.  Supporting a President who is waging a war and wanting the United States to win doesn’t make you conservative.  Neither does understanding that no one promised perfection.  The sad thing is, there are probably plenty of people who not only think that this means something, but is convincing.</p></div>",
  "content_text": "Rich Brookhiser writes on NRO:\nWe are in a war, GWB understands it, and very little else matters. Of the preceding points, perhaps only the last matters. We want the United States and the civilization it is defending to prevail, and at this moment that means we want George W. Bush to win re-election. We also know that even victory will involve great and destabilizing losses. Nobody promised us a perfect life. That’s why we’re conservatives.\nAsk yourself if this logic would work for you if you substituted FDR, LBJ or Woodrow Wilson for George Delano.  Supporting a President who is waging a war and wanting the United States to win doesn’t make you conservative.  Neither does understanding that no one promised perfection.  The sad thing is, there are probably plenty of people who not only think that this means something, but is convincing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-09T17:22:00+00:00"
}