{
  "url": "https://voxday.net/2004/02/28/clearly-i-was-imagining-things/",
  "scraped_at": "2025-12-13T15:51:37.353535",
  "title": "Clearly I was imagining things",
  "date_display": "February 28, 2004",
  "date_iso": "2004-02-28T03:37:00+00:00",
  "date_from_url": "2004-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From WND: <em>When Saudi Arabia announced a new policy to allow tourists, it brought attention to the official Supreme Commission for Tourism’s website, which explicitly stated Jews were barred from applying for visas.  But since WorldNetDaily published a story early this morning about the site’s contents, the reference to Jews has been eliminated, and the Saudi Embassy in Washington insists the Islamic kingdom does not bar anyone on the basis of religion or ethnicity.</em></p><p>Nail al-Jubier, chief information officer for the embassy, told WorldNetDaily he was “stunned” when he saw the Saudi tourism Web page listing “Jewish People” among those not permitted to enter the country. </p><p>Strange how Mr. al-Jubier seems to have experienced <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=37337\">the same hallucination</a> I did.  Since the Internet is a static medium, something that is not there at one moment in time could not possibly have been there previously.</p><p>Now, it’s true that Saudi Arabia is technically at war with Israel, as is most of the Arab world.  So, Saudi Arabia is quite justified in forbidding Israelis from entering or trading with the kingdom.  Of course, by the same token, they don’t have much grounds for complaint should Israel decide to glaze the desert sands either.  I don’t hate the Saudis, but I will confess to be mystified by a government that simultaneously lacks both nuclear weapons as well as the wisdom to find a way to make peace with an enemy that has them.</p></div>",
  "content_text": "From WND:\nWhen Saudi Arabia announced a new policy to allow tourists, it brought attention to the official Supreme Commission for Tourism’s website, which explicitly stated Jews were barred from applying for visas.  But since WorldNetDaily published a story early this morning about the site’s contents, the reference to Jews has been eliminated, and the Saudi Embassy in Washington insists the Islamic kingdom does not bar anyone on the basis of religion or ethnicity.\nNail al-Jubier, chief information officer for the embassy, told WorldNetDaily he was “stunned” when he saw the Saudi tourism Web page listing “Jewish People” among those not permitted to enter the country.\nStrange how Mr. al-Jubier seems to have experienced\nthe same hallucination\nI did.  Since the Internet is a static medium, something that is not there at one moment in time could not possibly have been there previously.\nNow, it’s true that Saudi Arabia is technically at war with Israel, as is most of the Arab world.  So, Saudi Arabia is quite justified in forbidding Israelis from entering or trading with the kingdom.  Of course, by the same token, they don’t have much grounds for complaint should Israel decide to glaze the desert sands either.  I don’t hate the Saudis, but I will confess to be mystified by a government that simultaneously lacks both nuclear weapons as well as the wisdom to find a way to make peace with an enemy that has them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-28T03:37:00+00:00"
}