{
  "url": "https://voxday.net/2004/02/11/deanbomb/",
  "scraped_at": "2025-12-13T15:48:40.558162",
  "title": "Dean.bomb",
  "date_display": "February 11, 2004",
  "date_iso": "2004-02-11T18:31:00+00:00",
  "date_from_url": "2004-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Original Cyberpunk waxes, as is his wont, sardonic: <em>It seems as if Dean really *did* run the first Internet political campaign. After months of intense media buzz, much hoopla and excitement, and uncounted gigabytes of self-congratulatory press releases, it turns out that there was only one rather unappealing product and no significant consumer base that wanted to buy it.  In the end, all we’re left with is the smoky residue that comes from burning several million dollars of investor capital and a limp and soggy sockpuppet. Dean.com is now Dean.gone.</em></p><p>I don’t sell my own books here and I don’t discuss them.  I will, however, INSIST that you buy a copy of <em>Headcrash</em> and read it this year.  If you like Dilbert, Douglas Adams or Grant Naylor, you will laugh out loud at least four times while reading it.</p><p>The OC sent me a review copy back when my game column was running in the St. Paul Pioneer Press.  I didn’t know him and didn’t want to bother reading it, but since he was local I knew he’d keep calling me until I did.  I finally dove into it during a 4th of July weekend at the lake cabin, read it straight through and was kicked out of the living room by Big Chilly and the Perfect Aryan Male in the process.  “Take your damn mirthful snorting elsewhere!”</p><p>Strangely, Time Warner elected not to go with the quote I provided for the cover afterwards.  “Too f——- funny.  Too f——- brilliant.”</p></div>",
  "content_text": "The Original Cyberpunk waxes, as is his wont, sardonic:\nIt seems as if Dean really *did* run the first Internet political campaign. After months of intense media buzz, much hoopla and excitement, and uncounted gigabytes of self-congratulatory press releases, it turns out that there was only one rather unappealing product and no significant consumer base that wanted to buy it.  In the end, all we’re left with is the smoky residue that comes from burning several million dollars of investor capital and a limp and soggy sockpuppet. Dean.com is now Dean.gone.\nI don’t sell my own books here and I don’t discuss them.  I will, however, INSIST that you buy a copy of\nHeadcrash\nand read it this year.  If you like Dilbert, Douglas Adams or Grant Naylor, you will laugh out loud at least four times while reading it.\nThe OC sent me a review copy back when my game column was running in the St. Paul Pioneer Press.  I didn’t know him and didn’t want to bother reading it, but since he was local I knew he’d keep calling me until I did.  I finally dove into it during a 4th of July weekend at the lake cabin, read it straight through and was kicked out of the living room by Big Chilly and the Perfect Aryan Male in the process.  “Take your damn mirthful snorting elsewhere!”\nStrangely, Time Warner elected not to go with the quote I provided for the cover afterwards.  “Too f——- funny.  Too f——- brilliant.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-11T18:31:00+00:00"
}