{
  "url": "https://voxday.net/2004/02/13/denia/",
  "scraped_at": "2025-12-13T15:49:02.263777",
  "title": "Denial",
  "date_display": "February 13, 2004",
  "date_iso": "2004-02-13T14:43:00+00:00",
  "date_from_url": "2004-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From NRO’s Corner: <em>More and more I am reading such letters that begin with something like “I am a life-long Republican” or “I voted for Bush in the last election” that then go on to list the litany of sins perpetrated by the current administration.  Letters such as these may well influence the non-blogosphere since their carry the cachet of the daily snoozepaper. I’ve noticed that these letters don’t have the same amount of vitriol that a liberal/leftist writer would use, but they have got me thinking.  I don’t agree with everything going on the Bush administration, but I sure wouldn’t write a letter complaining about it to the local news.</em></p><p>This is an interesting development.  Let’s break it down.</p><p>1) Conservatives voted for Bush, believing he was a conservative.<br> <br>2) Bush has governed in a profoundly and overtly non-conservative manner.<br> <br>3) Conservatives are not happy, as reported by numerous conservative commentators.<br> <br>4) Public complaints have been printed in numerous newspapers by self-styled conservative former Bush supporters.</br></br></br></br></br></br></p><p>Therefore, such letters to the editor are obviously fakes produced by liberal Bush-haters.  Yeah, I don’t so much follow that logic.</p><p>Now, the argument is based on Moby suggesting <em>“it’s possible to seed doubt among Bush’s far-right supporters on the Web. “You target his natural constituencies,” says the Grammy-nominated techno-wizard. “For example, you can go on all the pro-life chat rooms and say you’re an outraged right-wing voter and that you know that George Bush drove an ex-girlfriend to an abortion clinic and paid for her to get an abortion. “Then you go to an anti-immigration Web site chat room and ask, ‘What’s all this about George Bush proposing amnesty for illegal aliens?'”</em></p><p>The problem, of course, is that you don’t have to make anything up to come up with a laundry list of thing that Bush has done that infuriates, even enrages, conservatives.  It should be easy enough to tell the fakes.  If they’re outraged that Bush cut taxes for the rich, it’s a fake.  If they’re angry that he instituted a vast new Federal entitlement, it’s genuine.   It seems rather stupid to complain about an enemy hitting you with the baseball bat you just handed them.</p></div>",
  "content_text": "From NRO’s Corner:\nMore and more I am reading such letters that begin with something like “I am a life-long Republican” or “I voted for Bush in the last election” that then go on to list the litany of sins perpetrated by the current administration.  Letters such as these may well influence the non-blogosphere since their carry the cachet of the daily snoozepaper. I’ve noticed that these letters don’t have the same amount of vitriol that a liberal/leftist writer would use, but they have got me thinking.  I don’t agree with everything going on the Bush administration, but I sure wouldn’t write a letter complaining about it to the local news.\nThis is an interesting development.  Let’s break it down.\n1) Conservatives voted for Bush, believing he was a conservative.\n2) Bush has governed in a profoundly and overtly non-conservative manner.\n3) Conservatives are not happy, as reported by numerous conservative commentators.\n4) Public complaints have been printed in numerous newspapers by self-styled conservative former Bush supporters.\nTherefore, such letters to the editor are obviously fakes produced by liberal Bush-haters.  Yeah, I don’t so much follow that logic.\nNow, the argument is based on Moby suggesting\n“it’s possible to seed doubt among Bush’s far-right supporters on the Web. “You target his natural constituencies,” says the Grammy-nominated techno-wizard. “For example, you can go on all the pro-life chat rooms and say you’re an outraged right-wing voter and that you know that George Bush drove an ex-girlfriend to an abortion clinic and paid for her to get an abortion. “Then you go to an anti-immigration Web site chat room and ask, ‘What’s all this about George Bush proposing amnesty for illegal aliens?'”\nThe problem, of course, is that you don’t have to make anything up to come up with a laundry list of thing that Bush has done that infuriates, even enrages, conservatives.  It should be easy enough to tell the fakes.  If they’re outraged that Bush cut taxes for the rich, it’s a fake.  If they’re angry that he instituted a vast new Federal entitlement, it’s genuine.   It seems rather stupid to complain about an enemy hitting you with the baseball bat you just handed them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-13T14:43:00+00:00"
}