{
  "url": "https://voxday.net/2004/02/20/dont-cry-for-me-consuela/",
  "scraped_at": "2025-12-13T15:50:13.932450",
  "title": "Don’t cry for me, Consuela",
  "date_display": "February 20, 2004",
  "date_iso": "2004-02-20T09:25:00+00:00",
  "date_from_url": "2004-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Evangelical Outpost points to an interesting article in The Atlantic, entitled <a href=\"http://www.theatlantic.com/issues/2004/03/flanagan.htm\">How Serfdom Saved the Women’s Movement</a>.  It was interesting to me primarily as a voyeuristic experience in wading through the morass of what passes for feminist thinking, which, like the entire history of American liberalism, could be entitled Getting Bit in the Butt by the Law of Unintended Consquences.</p><p>Pity the poor upper-middle class working mommy, who is outraged that she can’t Have It All.  She can’t figure this out, apparently, until she hits 30 and has already spawned, while even the most benighted boy is capable of figuring out that he is not going to be an NFL quarterback and an NBA point guard by the time he is 12, and those few who might actually have the talent to do both – New York Knicks fans, please note I said might – are generally quite willing to choose between the two without railing against the cosmic unfairness of it all.</p><p>The irony is that these overeducated self-indulged women actually want three things, because it’s quite possible for a high-powered career woman to marry, have children, and then park them at home with Daddy all day.  There’s plenty of men who’d be delighted to sign off on such a deal.  Stay home, play with the kids, do a little laundry while watching ESPN – it’s all good!  The problem is that this idyllic arrangement totally precludes her marrying the even higher-powered Alpha male that sets her greedy little heart atwitter.</p><p>Freud once asked the famous question, what does woman want.  The correct answer in this case clearly is: woman has no clue.  Read the article, it’s astounding.  If she stays home, she wants a career.  If she has a career, she wants to stay home.  In either case, and with every permutation in between, she’s unhappy.  This is grass-is-greener syndrome on steroids.</p><p>The notion of playing the hand that’s been dealt has obviously never entered these pathetic little minds; even the notion of having to play the cards that they’ve personally selected is, somehow, offensive and “oppressive”.  I’d say that I was unsympathetic to their plight, except that the word is inadequate.  What a contemptible lot!  The only people I feel sorry for are their children and nannies.  I’d feel sorry for their husbands too, except based on this article, those men are clearly smart enough to spend every waking hour at the office or anywhere else that will afford them escape from these obnoxious creatures.</p><p>The irony is that it is these very careers which have forced their less fortunate sisters – whose plight some of the authors have attempted to coopt in a vain search for sympathy by proxy – to enter the workforce as well.  As I have previously demonstrated, the influx of women into the workforce had two consequences.  1) allowed men over the age of 65 to retire en masse.  2) lowered the average real wage rate.  Combined with increased taxation, a working class man can no longer support a family on one salary, thereby depriving working class women of any ability to choose between work and home.  No wonder working class women hate the Sisterhood.  They may not understand the fullness of who has put them in this difficult situation, but they have an intuitive grasp of the truth.</p><p>I once wrote that “being romantically involved with an intelligent, educated, upper-middle-class American woman steeped in 20 years of feminist indoctrination is about as desirable as being flayed alive and rolled in salt.”  I doubt I have the words to express the torment that must result from marrying one of these creatures, and I am ever so delighted to know that I will never need them.</p></div>",
  "content_text": "The Evangelical Outpost points to an interesting article in The Atlantic, entitled\nHow Serfdom Saved the Women’s Movement\n.  It was interesting to me primarily as a voyeuristic experience in wading through the morass of what passes for feminist thinking, which, like the entire history of American liberalism, could be entitled Getting Bit in the Butt by the Law of Unintended Consquences.\nPity the poor upper-middle class working mommy, who is outraged that she can’t Have It All.  She can’t figure this out, apparently, until she hits 30 and has already spawned, while even the most benighted boy is capable of figuring out that he is not going to be an NFL quarterback and an NBA point guard by the time he is 12, and those few who might actually have the talent to do both – New York Knicks fans, please note I said might – are generally quite willing to choose between the two without railing against the cosmic unfairness of it all.\nThe irony is that these overeducated self-indulged women actually want three things, because it’s quite possible for a high-powered career woman to marry, have children, and then park them at home with Daddy all day.  There’s plenty of men who’d be delighted to sign off on such a deal.  Stay home, play with the kids, do a little laundry while watching ESPN – it’s all good!  The problem is that this idyllic arrangement totally precludes her marrying the even higher-powered Alpha male that sets her greedy little heart atwitter.\nFreud once asked the famous question, what does woman want.  The correct answer in this case clearly is: woman has no clue.  Read the article, it’s astounding.  If she stays home, she wants a career.  If she has a career, she wants to stay home.  In either case, and with every permutation in between, she’s unhappy.  This is grass-is-greener syndrome on steroids.\nThe notion of playing the hand that’s been dealt has obviously never entered these pathetic little minds; even the notion of having to play the cards that they’ve personally selected is, somehow, offensive and “oppressive”.  I’d say that I was unsympathetic to their plight, except that the word is inadequate.  What a contemptible lot!  The only people I feel sorry for are their children and nannies.  I’d feel sorry for their husbands too, except based on this article, those men are clearly smart enough to spend every waking hour at the office or anywhere else that will afford them escape from these obnoxious creatures.\nThe irony is that it is these very careers which have forced their less fortunate sisters – whose plight some of the authors have attempted to coopt in a vain search for sympathy by proxy – to enter the workforce as well.  As I have previously demonstrated, the influx of women into the workforce had two consequences.  1) allowed men over the age of 65 to retire en masse.  2) lowered the average real wage rate.  Combined with increased taxation, a working class man can no longer support a family on one salary, thereby depriving working class women of any ability to choose between work and home.  No wonder working class women hate the Sisterhood.  They may not understand the fullness of who has put them in this difficult situation, but they have an intuitive grasp of the truth.\nI once wrote that “being romantically involved with an intelligent, educated, upper-middle-class American woman steeped in 20 years of feminist indoctrination is about as desirable as being flayed alive and rolled in salt.”  I doubt I have the words to express the torment that must result from marrying one of these creatures, and I am ever so delighted to know that I will never need them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-20T09:25:00+00:00"
}