{
  "url": "https://voxday.net/2004/02/09/down-with-derb-2/",
  "scraped_at": "2025-12-13T15:48:03.215301",
  "title": "Down with Derb",
  "date_display": "February 9, 2004",
  "date_iso": "2004-02-09T11:25:00+00:00",
  "date_from_url": "2004-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Derbyshire writes: <em>Yes, I got a lot of e-mail about my postings too, some of it angry. Who the heck do I think I am, criticizing Bush’s performance? Etc., etc. Well, I’m a citizen, and this is not North Korea. I want GWB to win the general election in November. I wish him well. I think a Kerry presidency would be a horrible disaster….  As for the lese majeste accusation: Shove it. This is a republic. </em></p><p>Word em up, D.  The reasons are several, most of them Federal.  I totally agree, except for the bit about wanting George Delano to win.  Unless, of course, “want” and “believe will be marginally less disastrous” are rather more synonymous than I was led to believe.</p><p>Joe Farah puts it even better:</p><p><em>Now there are those who would blame me because John Kerry will become the next president.  Don’t blame me. Blame Bush.  I am not supporting Kerry. Kerry is a creep.  But I cannot and will not support the lesser of two evils. My faith teaches me that light and dark don’t mix. My faith teaches me I’m not to have anything to do with evil. I’m not supposed to compromise with it. </em></p><p>And that, my friends, is THE WORD.</p></div>",
  "content_text": "John Derbyshire writes:\nYes, I got a lot of e-mail about my postings too, some of it angry. Who the heck do I think I am, criticizing Bush’s performance? Etc., etc. Well, I’m a citizen, and this is not North Korea. I want GWB to win the general election in November. I wish him well. I think a Kerry presidency would be a horrible disaster….  As for the lese majeste accusation: Shove it. This is a republic.\nWord em up, D.  The reasons are several, most of them Federal.  I totally agree, except for the bit about wanting George Delano to win.  Unless, of course, “want” and “believe will be marginally less disastrous” are rather more synonymous than I was led to believe.\nJoe Farah puts it even better:\nNow there are those who would blame me because John Kerry will become the next president.  Don’t blame me. Blame Bush.  I am not supporting Kerry. Kerry is a creep.  But I cannot and will not support the lesser of two evils. My faith teaches me that light and dark don’t mix. My faith teaches me I’m not to have anything to do with evil. I’m not supposed to compromise with it.\nAnd that, my friends, is THE WORD.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-09T11:25:00+00:00"
}