{
  "url": "https://voxday.net/2004/02/01/elastic-rat-guts/",
  "scraped_at": "2025-12-13T15:46:28.274131",
  "title": "Elastic Rat guts",
  "date_display": "February 1, 2004",
  "date_iso": "2004-02-01T17:21:00+00:00",
  "date_from_url": "2004-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This guy is <a href=\"http://www.elasticrat.com/weblog.php\">seriously dedicated to transparency</a>.  It’s pretty brave to post your weekly caloric intake, exercise calories – presumably treadmill or the like – and weekly weight loss/gain on his blog, and all in graphic format.  That’s graphic as in graphs, not explicit nude photos, by the way, in case you were wondering.  I don’t, however, <a href=\"http://nhlbisupport.com/bmi/bmicalc.htm\">buy into BMI</a>.  Mine is 25.2, and I’m pretty sure no one would call me overweight.  Meanwhile, Space Bunny’s is officially underweight, and she is in perfect fitness model shape.  But in any event, good luck to him.</p><p>My only advice would be to throw some weightlifting in there, or if that’s just not an option to jack up the exercise calories.  I usually hit around 385-425 kcal in a single session on the tread, which I do once a week in the offseason.  Don’t be afraid to punch in the harder programs, as it’s amazing how much harder and faster you can run if you’re following a variable program instead of simply trundling along on a flat manual setting.</p><p>Of course, a perverse need to beat the machine helps tremendously.  It’s strange, but I’ll run twice as fast on a six-degree incline if a program is making me do it than I will on a flat gradient if I select the settings myself.  Perhaps there’s a video game theory of exercise waiting to be developed.</p></div>",
  "content_text": "This guy is\nseriously dedicated to transparency\n.  It’s pretty brave to post your weekly caloric intake, exercise calories – presumably treadmill or the like – and weekly weight loss/gain on his blog, and all in graphic format.  That’s graphic as in graphs, not explicit nude photos, by the way, in case you were wondering.  I don’t, however,\nbuy into BMI\n.  Mine is 25.2, and I’m pretty sure no one would call me overweight.  Meanwhile, Space Bunny’s is officially underweight, and she is in perfect fitness model shape.  But in any event, good luck to him.\nMy only advice would be to throw some weightlifting in there, or if that’s just not an option to jack up the exercise calories.  I usually hit around 385-425 kcal in a single session on the tread, which I do once a week in the offseason.  Don’t be afraid to punch in the harder programs, as it’s amazing how much harder and faster you can run if you’re following a variable program instead of simply trundling along on a flat manual setting.\nOf course, a perverse need to beat the machine helps tremendously.  It’s strange, but I’ll run twice as fast on a six-degree incline if a program is making me do it than I will on a flat gradient if I select the settings myself.  Perhaps there’s a video game theory of exercise waiting to be developed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-01T17:21:00+00:00"
}