{
  "url": "https://voxday.net/2004/02/24/et-tu-felicus/",
  "scraped_at": "2025-12-13T15:50:56.771734",
  "title": "Et tu, Felicus?",
  "date_display": "February 24, 2004",
  "date_iso": "2004-02-24T19:53:00+00:00",
  "date_from_url": "2004-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The arid feline writes: <em>I’ve decided it is time to change parties. Yes, that’s right! And <a href=\"http://desertcat.blogspot.com/2004_02_01_desertcat_archive.html#107757353589421471\">Vox Day can proudly claim credit for my epiphany</a>. Vox has been advocating principles over practical reality for some time now. He has even taken to referring to the president as George Delano (as in Franklin Delano Roosevelt) over his moderate and statist postions on some issues.</em></p><p>Tha Kat is down with tha Voxsta again!  Sounds good so far… whoops, spoke a little too soon.</p><p><em>Never mind the fact that I don’t live in a country with proportional representation. Never mind that in this democratic republic, third, fourth or fifth parties stand zip, zero, nada chance of holding any office above that of “dog catcher” (I LIKE that office, by the way). I don’t care, because principles are all that matters. In fact I intend to tailor my platform so narrowly that I am the only one that it will appeal to. Yessiree! I intend to stand on PRINCIPLE above all else. I shall proudly bear the title of “Principled Loser”.</em></p><p>Well, if you believe that winning is the only thing, that the end justifies the means and that holding power is the ultimate goal, it’s hard to argue with that logic.  I’m just curious how this distinguishes one from Lombardi, Lenin, Mao, Bismarck and countless others who have preached the same message.</p><p><em>How great is that?! Since there is zero chance of my party ever holding office, I can mount my lofty perch and pontificate on the moral shortcomings of all those who duke it out in the trenches in the real world of politics. I can look down my nose and “TSK!” disapprovingly as cold calculations are made for the benefit of political advantage. Never will I be held accountable for the failures of my party’s administration, because my party will never find itself in that position. I’m immune in my lofty Ivory Tower from all accountability.</em></p><p>Looking past the occasional shortcoming and honest difference of opinion are one thing.  But to attempt to justify support for a man whose Republicanism is almost entirely devoid of republicanism, who egregiously forswears his oath of office in almost every speech he gives and who governs in a manner nearly indistinguishable from Lyndon Baines Johnson, is a curious form of pragmatism indeed.</p><p>Almost every significant social change unrelated to economics and technologyy has begun with the actions of a single principled loser.  I’d rather be called a loser than sacrifice my principles – I’ve seen far more men regret the latter than I’ve ever seen regret their failure to do so.  However, please also note that I have no objection being used as a scratching post upon which the Cat sharpens his claws.  If one’s beliefs cannot withstand the testing of one’s friends, they are not worth holding.</p><p>As for the notion that nothing can change in a two-party system, well, tell it to the Whigs.</p></div>",
  "content_text": "The arid feline writes:\nI’ve decided it is time to change parties. Yes, that’s right! And\nVox Day can proudly claim credit for my epiphany\n. Vox has been advocating principles over practical reality for some time now. He has even taken to referring to the president as George Delano (as in Franklin Delano Roosevelt) over his moderate and statist postions on some issues.\nTha Kat is down with tha Voxsta again!  Sounds good so far… whoops, spoke a little too soon.\nNever mind the fact that I don’t live in a country with proportional representation. Never mind that in this democratic republic, third, fourth or fifth parties stand zip, zero, nada chance of holding any office above that of “dog catcher” (I LIKE that office, by the way). I don’t care, because principles are all that matters. In fact I intend to tailor my platform so narrowly that I am the only one that it will appeal to. Yessiree! I intend to stand on PRINCIPLE above all else. I shall proudly bear the title of “Principled Loser”.\nWell, if you believe that winning is the only thing, that the end justifies the means and that holding power is the ultimate goal, it’s hard to argue with that logic.  I’m just curious how this distinguishes one from Lombardi, Lenin, Mao, Bismarck and countless others who have preached the same message.\nHow great is that?! Since there is zero chance of my party ever holding office, I can mount my lofty perch and pontificate on the moral shortcomings of all those who duke it out in the trenches in the real world of politics. I can look down my nose and “TSK!” disapprovingly as cold calculations are made for the benefit of political advantage. Never will I be held accountable for the failures of my party’s administration, because my party will never find itself in that position. I’m immune in my lofty Ivory Tower from all accountability.\nLooking past the occasional shortcoming and honest difference of opinion are one thing.  But to attempt to justify support for a man whose Republicanism is almost entirely devoid of republicanism, who egregiously forswears his oath of office in almost every speech he gives and who governs in a manner nearly indistinguishable from Lyndon Baines Johnson, is a curious form of pragmatism indeed.\nAlmost every significant social change unrelated to economics and technologyy has begun with the actions of a single principled loser.  I’d rather be called a loser than sacrifice my principles – I’ve seen far more men regret the latter than I’ve ever seen regret their failure to do so.  However, please also note that I have no objection being used as a scratching post upon which the Cat sharpens his claws.  If one’s beliefs cannot withstand the testing of one’s friends, they are not worth holding.\nAs for the notion that nothing can change in a two-party system, well, tell it to the Whigs.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-24T19:53:00+00:00"
}