{
  "url": "https://voxday.net/2004/02/14/face-that-launched-dinghy/",
  "scraped_at": "2025-12-13T15:49:14.047003",
  "title": "The face that launched a dinghy",
  "date_display": "February 14, 2004",
  "date_iso": "2004-02-14T20:20:00+00:00",
  "date_from_url": "2004-02-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What is it with politicians and <a href=\"http://www.thesun.co.uk/article/0,,2-2004071781,00.html\">plain women</a>?  Monica, okay, we know that Bill was bedazzled by her enormous breasts.  But considering that these are some of the most powerful men in the world, I find it hard to believe that they’re constantly getting in trouble over women that no self-respecting lead singer for an eighth-tier barely-out-of-the-garage band without a record deal would be dating.</p><p>Of course, the women of the Ivy League will never be confused with the women of the SEC.  So, maybe they just don’t know any better.  Before Bill Clinton, I would have looked at this picture and said there’s no way.  Now, who knows?</p><p>I don’t tend to buy it, though.  Wesley Clark probably made the whole thing up because he was bitter about America’s failure to reward him for living in a trailer with the highest office in the land.</p></div>",
  "content_text": "What is it with politicians and\nplain women\n?  Monica, okay, we know that Bill was bedazzled by her enormous breasts.  But considering that these are some of the most powerful men in the world, I find it hard to believe that they’re constantly getting in trouble over women that no self-respecting lead singer for an eighth-tier barely-out-of-the-garage band without a record deal would be dating.\nOf course, the women of the Ivy League will never be confused with the women of the SEC.  So, maybe they just don’t know any better.  Before Bill Clinton, I would have looked at this picture and said there’s no way.  Now, who knows?\nI don’t tend to buy it, though.  Wesley Clark probably made the whole thing up because he was bitter about America’s failure to reward him for living in a trailer with the highest office in the land.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-14T20:20:00+00:00"
}