{
  "url": "https://voxday.net/2004/02/05/fun-with-wmd/",
  "scraped_at": "2025-12-13T15:47:25.084731",
  "title": "Fun with WMD",
  "date_display": "February 5, 2004",
  "date_iso": "2004-02-05T23:40:00+00:00",
  "date_from_url": "2004-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Original Cyberpunk writes: <em>We *know* that Saddam Hussein had chemical weapons. He used them against the Kurds and the Iranians, ergo, he had them.  To argue otherwise is idiocy.  We *know* that chemical weapons can stay hidden and dangerous for quite a long time.  For example, just last summer, construction workers in China acccidentally dug into a chemical weapons dump hidden by the retreating Japanese army in 1944 or ’45, resulting in fatalities and much hard feelings between the two countries.  Ergo, this issue won’t go away.  We *know* that American voters have short attention spans:  two months, tops. Further, we *know* that there’s no point in announcing political news before Labor Day or on Halloween weekend. So, the question:  WHEN *EXACTLY* will Donald Rumsfeld announce the discovery of vast stores of Iraqi chemical, radiological, and/or biological weapons? I pick Saturday, October 16, 2004:</em></p><p>Here’s the deal.  If you want in, check the Comments and go to <a href=\"http://www.spedro.com/nf_contest.html\">The Toxic Pool</a> and see what dates are taken.  Nothing’s up there until tonight.  Then pick your date, add it to the Comments so everyone can see AND mail it to me so OC can add it to the table.  Whoever is closest gets first prize, which is a signed copy of at least four of our books, the next three closest get a signed copy of Rebel Moon.  Only one date per person, current or former employees of either the Iraqi or Syrian regimes are not permitted to enter.  If there’s no announcement, then, well, it didn’t cost anything to play now, did it.</p><p>I got Monday, October 18th.</p><p>UPDATE: <a href=\"http://www.spedro.com/nf_contest.html\">The Toxic Pool</a> is up!  Check it out before picking your dates.</p></div>",
  "content_text": "The Original Cyberpunk writes:\nWe *know* that Saddam Hussein had chemical weapons. He used them against the Kurds and the Iranians, ergo, he had them.  To argue otherwise is idiocy.  We *know* that chemical weapons can stay hidden and dangerous for quite a long time.  For example, just last summer, construction workers in China acccidentally dug into a chemical weapons dump hidden by the retreating Japanese army in 1944 or ’45, resulting in fatalities and much hard feelings between the two countries.  Ergo, this issue won’t go away.  We *know* that American voters have short attention spans:  two months, tops. Further, we *know* that there’s no point in announcing political news before Labor Day or on Halloween weekend. So, the question:  WHEN *EXACTLY* will Donald Rumsfeld announce the discovery of vast stores of Iraqi chemical, radiological, and/or biological weapons? I pick Saturday, October 16, 2004:\nHere’s the deal.  If you want in, check the Comments and go to\nThe Toxic Pool\nand see what dates are taken.  Nothing’s up there until tonight.  Then pick your date, add it to the Comments so everyone can see AND mail it to me so OC can add it to the table.  Whoever is closest gets first prize, which is a signed copy of at least four of our books, the next three closest get a signed copy of Rebel Moon.  Only one date per person, current or former employees of either the Iraqi or Syrian regimes are not permitted to enter.  If there’s no announcement, then, well, it didn’t cost anything to play now, did it.\nI got Monday, October 18th.\nUPDATE:\nThe Toxic Pool\nis up!  Check it out before picking your dates.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-05T23:40:00+00:00"
}