{
  "url": "https://voxday.net/2004/02/20/giving-liberals-their-due/",
  "scraped_at": "2025-12-13T15:50:17.236957",
  "title": "Giving liberals their due",
  "date_display": "February 20, 2004",
  "date_iso": "2004-02-20T10:18:00+00:00",
  "date_from_url": "2004-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For all my disdain for what passes for liberal thought – even the name is a misnomer – I will freely grant liberals that conservatives, too, have their logical inconsistencies.  Which, in part, is why I parted intellectual company with them and the Republican Party some time ago, despite all my instinctive sympathies for both.</p><p>Fred Reed puts my base objection to both American ideologies very well: <em>Peer behind the shabby curtain of pretended principle, and you see that the government is not an impartial entity serving the public, but a means of imposing on the majority the will of any who can get their hands on the miraculous levers of the courts.</em></p><p>Indeed, he anticipates the arguments that Bush defenders have made here on this blog, those who justify their support for a President who has betrayed their principles because of the possibility of his future Supreme Court nominations.  But I have little sympathy for any ideology that attempts to use government in furtherance of its causes, no matter how noble such causes might be.  Jesus disdained such methods, and we would do well to imitate him in this, as in all things.</p><p>Even in the rare instances that a true philosopher-king takes the throne, a Marcus Aurelius is always followed by Commodus.  The power to build is the power to destroy, and the only long-term solution is to prevent such power from being amassed in the first place.</p></div>",
  "content_text": "For all my disdain for what passes for liberal thought – even the name is a misnomer – I will freely grant liberals that conservatives, too, have their logical inconsistencies.  Which, in part, is why I parted intellectual company with them and the Republican Party some time ago, despite all my instinctive sympathies for both.\nFred Reed puts my base objection to both American ideologies very well:\nPeer behind the shabby curtain of pretended principle, and you see that the government is not an impartial entity serving the public, but a means of imposing on the majority the will of any who can get their hands on the miraculous levers of the courts.\nIndeed, he anticipates the arguments that Bush defenders have made here on this blog, those who justify their support for a President who has betrayed their principles because of the possibility of his future Supreme Court nominations.  But I have little sympathy for any ideology that attempts to use government in furtherance of its causes, no matter how noble such causes might be.  Jesus disdained such methods, and we would do well to imitate him in this, as in all things.\nEven in the rare instances that a true philosopher-king takes the throne, a Marcus Aurelius is always followed by Commodus.  The power to build is the power to destroy, and the only long-term solution is to prevent such power from being amassed in the first place.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-20T10:18:00+00:00"
}