{
  "url": "https://voxday.net/2004/02/25/go-read-mogambo/",
  "scraped_at": "2025-12-13T15:51:02.291217",
  "title": "Go read Mogambo",
  "date_display": "February 25, 2004",
  "date_iso": "2004-02-25T12:36:00+00:00",
  "date_from_url": "2004-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There’s a link on the left.  Click on it.  Read and learn: <em>Theodore Butler, the silver analyst for Investment Rarities, reports that he may have detected the abandonment of the outrageous volume of short positions in the manipulation of the silver market, which he thinks may mean that the game is drawing to a close. He is livid that the total short position in silver is three times bigger than the known bullion inventories. It does seem really, really weird: it seems that the insane amount of shorts, three times world inventories, would be an irresistible target for short a squeeze play!</em></p><p>He notes that the COMEX “struggled to deliver a stinking 5 million ounces of real silver that the Central Fund of Canada bought some 7 weeks ago.” Hew hints that maybe this abandonment of adding more short positions, and liquidating some short positions, may have something to do with the Gold Anti-Trust Action group vowing to pursue the rigged silver market as a way of exposing the rigged gold market, and a lot of pressure being brought on Eliot Spitzer to look into this rigged silver market. The upshot is that, if it plays out as Mr. Butler envisions, silver is set to explode to the upside. </p><p>Gee, and here I thought that rocketing up 43 percent in less than two months counted as exploding to the upside already.  Yes, Virginia, there is inflation, no matter what the jokers doing their voodoo on the CPI tell you.  My health insurance went up.  Gasoline prices are up.  Gold and silver are up.  The CPI is more fictional than anything Tolkien ever wrote.</p></div>",
  "content_text": "There’s a link on the left.  Click on it.  Read and learn:\nTheodore Butler, the silver analyst for Investment Rarities, reports that he may have detected the abandonment of the outrageous volume of short positions in the manipulation of the silver market, which he thinks may mean that the game is drawing to a close. He is livid that the total short position in silver is three times bigger than the known bullion inventories. It does seem really, really weird: it seems that the insane amount of shorts, three times world inventories, would be an irresistible target for short a squeeze play!\nHe notes that the COMEX “struggled to deliver a stinking 5 million ounces of real silver that the Central Fund of Canada bought some 7 weeks ago.” Hew hints that maybe this abandonment of adding more short positions, and liquidating some short positions, may have something to do with the Gold Anti-Trust Action group vowing to pursue the rigged silver market as a way of exposing the rigged gold market, and a lot of pressure being brought on Eliot Spitzer to look into this rigged silver market. The upshot is that, if it plays out as Mr. Butler envisions, silver is set to explode to the upside.\nGee, and here I thought that rocketing up 43 percent in less than two months counted as exploding to the upside already.  Yes, Virginia, there is inflation, no matter what the jokers doing their voodoo on the CPI tell you.  My health insurance went up.  Gasoline prices are up.  Gold and silver are up.  The CPI is more fictional than anything Tolkien ever wrote.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-25T12:36:00+00:00"
}