{
  "url": "https://voxday.net/2004/02/27/good-onya-mr-gibson/",
  "scraped_at": "2025-12-13T15:51:24.787532",
  "title": "Good onya, Mr. Gibson",
  "date_display": "February 27, 2004",
  "date_iso": "2004-02-27T00:17:00+00:00",
  "date_from_url": "2004-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>‘Passion’ Nails $26,556,573 on First Day.  Audiences are rushing to see The Passion of the Christ at a record pace. The media frenzy and the religious fervor have contributed to the third biggest Wednesday bow ever</em></p><p>I rather doubt that independently producing a massively successful film without any help from the industry is going to harm Mel Gibson’s career in the least, regardless of what the <a href=\"http://www.nytimes.com/2004/02/26/movies/26GIBS.html?ei=5062&amp;en=ab23785e81e0ea8e&amp;ex=1078376400&amp;partner=GOOGLE&amp;pagewanted=print&amp;position=\">New York Times might wish</a>.</p><p>And it’s interesting to note the comments of various Hollywood gentlemen, presumably of Jewish extraction: <em>Jeffrey Katzenberg and David Geffen, the principals of DreamWorks, have privately expressed anger over the film, said an executive close to the two men.  The chairmen of two other major studios said they would avoid working with Mr. Gibson because of “The Passion of the Christ” and the star’s remarks surrounding its release.  Neither of the chairmen would speak for attribution, but as one explained: “It doesn’t matter what I say. It’ll matter what I do. I will do something. I won’t hire him. I won’t support anything he’s part of. Personally that’s all I can do.”</em></p><p>I hope we learn who this particular chairman is.  Once we find out,  I think it will be interesting to see his reaction once Christians demonstrate that they’d prefer to demonstrate solidarity with Mr. Gibson than with this self-righteous, small-minded and officious prig.  Sometimes it’s not hard to figure out why Jews often appear have so many enemies and so few friends.  I have a feeling this man will be eating his words soon enough.</p><p>But as Rod Dreher of the Dallas Morning News points out, its rather strange that while it’s not okay to blacklist people working under the direct orders of Josef Stalin for the destruction of the United States, it’s perfectly okay to blacklist a Christian who takes his faith so seriously that he spends $25 million to give everyone the chance to witness an interpretation ofJesus Christ’s sacrifice.</p></div>",
  "content_text": "‘Passion’ Nails $26,556,573 on First Day.  Audiences are rushing to see The Passion of the Christ at a record pace. The media frenzy and the religious fervor have contributed to the third biggest Wednesday bow ever\nI rather doubt that independently producing a massively successful film without any help from the industry is going to harm Mel Gibson’s career in the least, regardless of what the\nNew York Times might wish\n.\nAnd it’s interesting to note the comments of various Hollywood gentlemen, presumably of Jewish extraction:\nJeffrey Katzenberg and David Geffen, the principals of DreamWorks, have privately expressed anger over the film, said an executive close to the two men.  The chairmen of two other major studios said they would avoid working with Mr. Gibson because of “The Passion of the Christ” and the star’s remarks surrounding its release.  Neither of the chairmen would speak for attribution, but as one explained: “It doesn’t matter what I say. It’ll matter what I do. I will do something. I won’t hire him. I won’t support anything he’s part of. Personally that’s all I can do.”\nI hope we learn who this particular chairman is.  Once we find out,  I think it will be interesting to see his reaction once Christians demonstrate that they’d prefer to demonstrate solidarity with Mr. Gibson than with this self-righteous, small-minded and officious prig.  Sometimes it’s not hard to figure out why Jews often appear have so many enemies and so few friends.  I have a feeling this man will be eating his words soon enough.\nBut as Rod Dreher of the Dallas Morning News points out, its rather strange that while it’s not okay to blacklist people working under the direct orders of Josef Stalin for the destruction of the United States, it’s perfectly okay to blacklist a Christian who takes his faith so seriously that he spends $25 million to give everyone the chance to witness an interpretation ofJesus Christ’s sacrifice.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-27T00:17:00+00:00"
}