{
  "url": "https://voxday.net/2004/02/18/hey-mikey-he-likes-i/",
  "scraped_at": "2025-12-13T15:49:49.566168",
  "title": "Hey Mikey, he likes it!",
  "date_display": "February 18, 2004",
  "date_iso": "2004-02-18T14:58:00+00:00",
  "date_from_url": "2004-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ian McLeod writes about Headcrash: <em>Just finished the book yesterday. My initial reaction (after a long blackout from side-splitting laughter): “Good God, the Original Cyberpunk is a genius!” I immediately ordered copies for my closest friends… After the end of the week, I’ll get the review written and posted.</em></p><p>I told you it was good stuff.  From the mouths of immortals….  And the Original Cyberpunk has been experimenting with ebook formats:</p><p><em>Later last night I had a great deal of fun playing around with the Palm Reader footnote and sidebar functionality.  The infonuggets in Headcrash *very* readily convert to footnotes and pop up just the way I’d always imagined they would.  I now believe that, ten years ago and utterly without knowing, I *created* that book to be a Palm file.</em></p><p>If anyone else said that, you’d take it with a grain of salt.  But coming from a Dick-winner like the Original Cyberpunk, it’s entirely credible.</p></div>",
  "content_text": "Ian McLeod writes about Headcrash:\nJust finished the book yesterday. My initial reaction (after a long blackout from side-splitting laughter): “Good God, the Original Cyberpunk is a genius!” I immediately ordered copies for my closest friends… After the end of the week, I’ll get the review written and posted.\nI told you it was good stuff.  From the mouths of immortals….  And the Original Cyberpunk has been experimenting with ebook formats:\nLater last night I had a great deal of fun playing around with the Palm Reader footnote and sidebar functionality.  The infonuggets in Headcrash *very* readily convert to footnotes and pop up just the way I’d always imagined they would.  I now believe that, ten years ago and utterly without knowing, I *created* that book to be a Palm file.\nIf anyone else said that, you’d take it with a grain of salt.  But coming from a Dick-winner like the Original Cyberpunk, it’s entirely credible.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-18T14:58:00+00:00"
}