{
  "url": "https://voxday.net/2004/02/18/i-dont-think-shes-pretty-at-a/",
  "scraped_at": "2025-12-13T15:49:47.691860",
  "title": "I don’t think she’s pretty at all!",
  "date_display": "February 18, 2004",
  "date_iso": "2004-02-18T11:35:00+00:00",
  "date_from_url": "2004-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Women judge the attractiveness other women more harshly when at their most fertile, <a href=\"http://www.newscientist.com/news/news.jsp?id=ns99994691\">suggests a new study</a>. The phenomenon could be a strategy to devalue potential rivals, says the psychologist behind the work – being bitchy about others could help a woman win the attention of a desirable man.</p><p>I can’t speak for anyone else here, but I absolutely hate it when women say nasty things about their imaginary rivals.  I don’t feel threatened by the fact that George Clooney or Brad Pitt are handsome – I fully expect that if we were pursuing the same girl, I would lose out.  So be it.  To paraphrase what someone here once commented, there is no one so hated as a pretty girl with a great body wearing a tight dress in a room full of plain Janes.  She’s just as likely to be nice and intelligent as the most mutant-looking wallflower there, but she’ll almost always be dismissed as a walking bag of character flaws before she’s even opened her mouth.</p><p>And yet, it’s we men who are then condemned for being superficial.  The reality is that everyone is more or less superficial, and superficiality is really the only place to start.  The Internet is the only place where a meeting of the minds can possibly precede the superficialities, and yet I don’t see Internet dating being held up as a great advancement for mankind.  Usually, it’s dismissed as the last resort of losers, from what little I’ve read about it.</p><p>The truth is that women are the dominant sex.  Our opinions not only don’t drive day-to-day life, they barely factor in.  Women don’t dress to please men, with the notable (and much-appreciated) exception of the Pam Andersons of the world, they dress to avoid the criticism of each other.  Let’s face it, if it were up to me, every woman’s wardrobe would consist of nothing but slinky black dresses, slinky red dresses, hot pants, bustiers and Dallas Cowboys Cheerleader outfits.</p><p>Hey, if we ever do get that one-world government, I think I just discovered my campaign platform for World President.</p></div>",
  "content_text": "Women judge the attractiveness other women more harshly when at their most fertile,\nsuggests a new study\n. The phenomenon could be a strategy to devalue potential rivals, says the psychologist behind the work – being bitchy about others could help a woman win the attention of a desirable man.\nI can’t speak for anyone else here, but I absolutely hate it when women say nasty things about their imaginary rivals.  I don’t feel threatened by the fact that George Clooney or Brad Pitt are handsome – I fully expect that if we were pursuing the same girl, I would lose out.  So be it.  To paraphrase what someone here once commented, there is no one so hated as a pretty girl with a great body wearing a tight dress in a room full of plain Janes.  She’s just as likely to be nice and intelligent as the most mutant-looking wallflower there, but she’ll almost always be dismissed as a walking bag of character flaws before she’s even opened her mouth.\nAnd yet, it’s we men who are then condemned for being superficial.  The reality is that everyone is more or less superficial, and superficiality is really the only place to start.  The Internet is the only place where a meeting of the minds can possibly precede the superficialities, and yet I don’t see Internet dating being held up as a great advancement for mankind.  Usually, it’s dismissed as the last resort of losers, from what little I’ve read about it.\nThe truth is that women are the dominant sex.  Our opinions not only don’t drive day-to-day life, they barely factor in.  Women don’t dress to please men, with the notable (and much-appreciated) exception of the Pam Andersons of the world, they dress to avoid the criticism of each other.  Let’s face it, if it were up to me, every woman’s wardrobe would consist of nothing but slinky black dresses, slinky red dresses, hot pants, bustiers and Dallas Cowboys Cheerleader outfits.\nHey, if we ever do get that one-world government, I think I just discovered my campaign platform for World President.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-18T11:35:00+00:00"
}