{
  "url": "https://voxday.net/2004/02/19/i-kind-of-like-mels-dad/",
  "scraped_at": "2025-12-13T15:50:06.517855",
  "title": "I kind of like Mel’s Dad",
  "date_display": "February 19, 2004",
  "date_iso": "2004-02-19T17:50:00+00:00",
  "date_from_url": "2004-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>A week before Mel Gibson’s movie about Jesus Christ hits theaters, his father <a href=\"http://www.nydailynews.com/news/wn_report/story/165923p-145217c.html\">has gone on an explosive rant</a> against Jews – claiming they fabricated the Holocaust and are conspiring to take over the world. “They’re after one world religion and one world government,” Hutton Gibson, 85, said in a radio interview that will air Monday night.  “That’s why they’ve attacked the Catholic Church so strongly, to ultimately take control over it by their doctrine.”</em></p><p>In the bizarre interview, Gibson also said Federal Reserve Chairman Alan Greenspan should be lynched and called for the government to be overthrown.</p><p>I don’t agree with him on the Jews, although I’m just as opposed as he is to everyone who is after global government, be they Jew or Gentile.  But Mr. Gibson is certainly sound on Greenspan.  Mogambo has already predicted on numerous occasions that future generations will dig up Greenspan’s body and hang it due to the massive hardship his abominable stewardship of the Fed will put them through.</p><p>I do find it intriguing that a New York paper should get so upset over Mel Gibson’s dad denying the Holocaust, considering that the New York Times still won’t return the Pulitzer its correspondent won for denying the Soviet forced famines that killed more people than Hitler ever did.  The elder Gibson is obviously no military historian, though.  The German economy was never on a serious war footing, which was one reason why they had plenty of resources to devote to the <em>Endlosung</em>.  Also, from what I’ve read, the bodies were usually disposed of by burial in mass graves with layers of quicklime spread between them; they usually weren’t burned.</p></div>",
  "content_text": "A week before Mel Gibson’s movie about Jesus Christ hits theaters, his father\nhas gone on an explosive rant\nagainst Jews – claiming they fabricated the Holocaust and are conspiring to take over the world. “They’re after one world religion and one world government,” Hutton Gibson, 85, said in a radio interview that will air Monday night.  “That’s why they’ve attacked the Catholic Church so strongly, to ultimately take control over it by their doctrine.”\nIn the bizarre interview, Gibson also said Federal Reserve Chairman Alan Greenspan should be lynched and called for the government to be overthrown.\nI don’t agree with him on the Jews, although I’m just as opposed as he is to everyone who is after global government, be they Jew or Gentile.  But Mr. Gibson is certainly sound on Greenspan.  Mogambo has already predicted on numerous occasions that future generations will dig up Greenspan’s body and hang it due to the massive hardship his abominable stewardship of the Fed will put them through.\nI do find it intriguing that a New York paper should get so upset over Mel Gibson’s dad denying the Holocaust, considering that the New York Times still won’t return the Pulitzer its correspondent won for denying the Soviet forced famines that killed more people than Hitler ever did.  The elder Gibson is obviously no military historian, though.  The German economy was never on a serious war footing, which was one reason why they had plenty of resources to devote to the\nEndlosung\n.  Also, from what I’ve read, the bodies were usually disposed of by burial in mass graves with layers of quicklime spread between them; they usually weren’t burned.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-19T17:50:00+00:00"
}