{
  "url": "https://voxday.net/2004/02/07/id-marry-you-if-my-phylum-were-homo/",
  "scraped_at": "2025-12-13T15:47:46.020274",
  "title": "I’d marry you if my phylum were Homo Harpyopsis",
  "date_display": "February 7, 2004",
  "date_iso": "2004-02-07T11:40:00+00:00",
  "date_from_url": "2004-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Desert Cat write in response to Paul Craig Roberts: <em>Good Lord! I ought to try writing like that, just for the invigoration.  There’s nothing quite so invigorating as the discovery of angry hordes clamoring for your hasty demise…</em></p><p>Yeah, I’m anticipating a spot of that on Monday.  It may actually make the response to <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=30830\">Spiting Their Pretty Faces</a> look downright reasonable, although perhaps not since there’s almost nothing you can say to upset a woman more than telling her that she’s unmarriageable.  I think my favorite response to a ranting 30-something single woman who is up in arms about how breathtakingly desirable she is and how any rich, good-looking Ivy League grad would be hitting the lottery to have her is: “Don’t worry, I’m sure you’ll make some man very unhappy someday.”  In any event, here’s a list of the predictable responses:</p><p>1) Assertions that women don’t respect men and have every reason for not doing so.  So there.</p><p>2) Assertions that I’m just bitter and hate women because I can’t a) get laid; b) a date.  And in truth, Space Bunny does tend to frown on the latter, although she was trying to set me up with one of her friends* recently.  Is that a bad sign?</p><p>3) Assertions that I’m a) sexist; b) stupid; c) poorly educated; d) all of the above.</p><p>4) Improperly punctuated hysteria that is hard to read, much less make any sense of.</p><p>I think I’ll post examples of all four this week.  Yes, hatemailers of America, that’s how boringly predictable you are.  And while it may superficially appear as if I’m indifferent to what you have to say, it’s only that I’m crying on the inside.</p><p><em>*Oh, relax.  I’m just teaching her friend how to shoot at the range.</em></p></div>",
  "content_text": "Desert Cat write in response to Paul Craig Roberts:\nGood Lord! I ought to try writing like that, just for the invigoration.  There’s nothing quite so invigorating as the discovery of angry hordes clamoring for your hasty demise…\nYeah, I’m anticipating a spot of that on Monday.  It may actually make the response to\nSpiting Their Pretty Faces\nlook downright reasonable, although perhaps not since there’s almost nothing you can say to upset a woman more than telling her that she’s unmarriageable.  I think my favorite response to a ranting 30-something single woman who is up in arms about how breathtakingly desirable she is and how any rich, good-looking Ivy League grad would be hitting the lottery to have her is: “Don’t worry, I’m sure you’ll make some man very unhappy someday.”  In any event, here’s a list of the predictable responses:\n1) Assertions that women don’t respect men and have every reason for not doing so.  So there.\n2) Assertions that I’m just bitter and hate women because I can’t a) get laid; b) a date.  And in truth, Space Bunny does tend to frown on the latter, although she was trying to set me up with one of her friends* recently.  Is that a bad sign?\n3) Assertions that I’m a) sexist; b) stupid; c) poorly educated; d) all of the above.\n4) Improperly punctuated hysteria that is hard to read, much less make any sense of.\nI think I’ll post examples of all four this week.  Yes, hatemailers of America, that’s how boringly predictable you are.  And while it may superficially appear as if I’m indifferent to what you have to say, it’s only that I’m crying on the inside.\n*Oh, relax.  I’m just teaching her friend how to shoot at the range.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-07T11:40:00+00:00"
}