{
  "url": "https://voxday.net/2004/02/25/if-youre-not-part-of-solution-youre/",
  "scraped_at": "2025-12-13T15:51:14.856543",
  "title": "If you’re not part of the solution, you’re part of the problem",
  "date_display": "February 25, 2004",
  "date_iso": "2004-02-25T17:59:00+00:00",
  "date_from_url": "2004-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Chronicles Magazine: <em>Of necessity, much cultural commentary by conservatives and traditionalists has focused on what is wrong, as the popular culture over the last few decades has continued to expand the frontiers of degeneracy. In order to win the Culture War, however, we have to do more than point out the manifest defects in current movies, music, and fiction. We also must support artists committed to producing art that builds on our Western heritage rather than trashing it. Gibson is attempting to do just that.</em></p><p>That was a much nicer way of stating what I was saying a few days ago.  If you’re concerned about the culture, stop whining about Dan Brown, Janet Jackson and American Pie 3.  Go and buy a Christian fantasy novel, a Christian music CD and see <em>The Passion of the Christ</em> instead.  It will have a much bigger impact.  Christians have tremendous market power, but it is useless if they continue to wield it in support of Britney, Justin and MTV’s <em>stella del giorno</em>.</p><p><em>This post brought to you by <a href=\"http://polemics.us/\">Polemics</a> and <a href=\"http://www.evangelicaloutpost.com\">Evangelical Outpost</a>.</em></p></div>",
  "content_text": "From Chronicles Magazine:\nOf necessity, much cultural commentary by conservatives and traditionalists has focused on what is wrong, as the popular culture over the last few decades has continued to expand the frontiers of degeneracy. In order to win the Culture War, however, we have to do more than point out the manifest defects in current movies, music, and fiction. We also must support artists committed to producing art that builds on our Western heritage rather than trashing it. Gibson is attempting to do just that.\nThat was a much nicer way of stating what I was saying a few days ago.  If you’re concerned about the culture, stop whining about Dan Brown, Janet Jackson and American Pie 3.  Go and buy a Christian fantasy novel, a Christian music CD and see\nThe Passion of the Christ\ninstead.  It will have a much bigger impact.  Christians have tremendous market power, but it is useless if they continue to wield it in support of Britney, Justin and MTV’s\nstella del giorno\n.\nThis post brought to you by\nPolemics\nand\nEvangelical Outpost\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-25T17:59:00+00:00"
}