{
  "url": "https://voxday.net/2004/02/25/invaluable-von-mises/",
  "scraped_at": "2025-12-13T15:51:10.097585",
  "title": "The invaluable von Mises",
  "date_display": "February 25, 2004",
  "date_iso": "2004-02-25T17:09:00+00:00",
  "date_from_url": "2004-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From <a href=\"http://www.mises.org/fullstory.asp?control=1457\">Omnipotent Government: The Rise of Total State and Total War</a>: <em>Until the middle of the nineteenth century no one ventured to dispute the fact that the logical structure of mind is unchangeable and common to all human beings. All human interrelations are based on this assumption of a uniform logical structure. We can speak to each other only because we can appeal to something com­mon to all of us, namely, the logical structure of reason. Some men can think deeper and more refined thoughts than others. There are men who unfortunately cannot grasp a process of inference in long chains of deductive reasoning. But as far as a man is able to think and to follow a process of discursive thought, he always clings to the same ultimate principles of reasoning that are applied by all other men. There are people who cannot count further than three; but their counting, as far as it goes, does not differ from that of Gauss or Laplace. No historian or traveler has ever brought us any knowl­edge of people for whom a and non-a were identical, or who could not grasp the difference between affirmation and negation. Daily, it is true, people violate logical principles in reasoning. But who­ever examines their inferences competently can uncover their errors</em></p><p>.Because everyone takes these facts to be unquestionable, men enter into discussions; they speak to each other; they write letters and books; they try to prove or to disprove. Social and intellectual coöperation between men would be impossible if this were not so. Our minds cannot even consistently imagine a world peopled by men of different logical structures or a logical structure different from our own.</p><p>Yet, in the course of the nineteenth century this undeniable fact has been contested. Marx and the Marxians, foremost among them the “proletarian philosopher” Dietzgen, taught that thought is determined by the thinker’s class position. What thinking produces is not truth but “ideologies.” This word means, in the context of Marxian philosophy, a disguise of the selfish interest of the social class to which the thinking individual is attached. It is therefore useless to discuss anything with people of another social class. Ideologies do not need to be refuted by discursive reasoning; they must be unmasked by denouncing the class position, the social background, of their authors. Thus Marxians do not discuss the merits of physical theories; they merely uncover the “bourgeois” origin of the physicists.</p><p>The Marxians have resorted to polylogism because they could not refute by logical methods the theories developed by “bour­geois” economics, or the inferences drawn from these theories demonstrating the impracticability of socialism. As they could not rationally demonstrate the soundness of their own ideas or the un­soundness of their adversaries’ ideas, they have denounced the accepted logical methods. The success of this Marxian stratagem was unprecedented. It has rendered proof against any reasonable criticism all the absurdities of Marxian would-be economics and would-be sociology. Only by the logical tricks of polylogism could etatism gain a hold on the modern mind. Polylogism is so inherently nonsensical that it cannot be carried consistently to its ultimate log</p><p>The entire text is <a href=\"http://www.mises.org/etexts/mises/og.asp\">online in HTML and PDF</a> formats.  Download, read and grok the brilliant fullness.</p></div>",
  "content_text": "From\nOmnipotent Government: The Rise of Total State and Total War\n:\nUntil the middle of the nineteenth century no one ventured to dispute the fact that the logical structure of mind is unchangeable and common to all human beings. All human interrelations are based on this assumption of a uniform logical structure. We can speak to each other only because we can appeal to something com­mon to all of us, namely, the logical structure of reason. Some men can think deeper and more refined thoughts than others. There are men who unfortunately cannot grasp a process of inference in long chains of deductive reasoning. But as far as a man is able to think and to follow a process of discursive thought, he always clings to the same ultimate principles of reasoning that are applied by all other men. There are people who cannot count further than three; but their counting, as far as it goes, does not differ from that of Gauss or Laplace. No historian or traveler has ever brought us any knowl­edge of people for whom a and non-a were identical, or who could not grasp the difference between affirmation and negation. Daily, it is true, people violate logical principles in reasoning. But who­ever examines their inferences competently can uncover their errors\n.Because everyone takes these facts to be unquestionable, men enter into discussions; they speak to each other; they write letters and books; they try to prove or to disprove. Social and intellectual coöperation between men would be impossible if this were not so. Our minds cannot even consistently imagine a world peopled by men of different logical structures or a logical structure different from our own.\nYet, in the course of the nineteenth century this undeniable fact has been contested. Marx and the Marxians, foremost among them the “proletarian philosopher” Dietzgen, taught that thought is determined by the thinker’s class position. What thinking produces is not truth but “ideologies.” This word means, in the context of Marxian philosophy, a disguise of the selfish interest of the social class to which the thinking individual is attached. It is therefore useless to discuss anything with people of another social class. Ideologies do not need to be refuted by discursive reasoning; they must be unmasked by denouncing the class position, the social background, of their authors. Thus Marxians do not discuss the merits of physical theories; they merely uncover the “bourgeois” origin of the physicists.\nThe Marxians have resorted to polylogism because they could not refute by logical methods the theories developed by “bour­geois” economics, or the inferences drawn from these theories demonstrating the impracticability of socialism. As they could not rationally demonstrate the soundness of their own ideas or the un­soundness of their adversaries’ ideas, they have denounced the accepted logical methods. The success of this Marxian stratagem was unprecedented. It has rendered proof against any reasonable criticism all the absurdities of Marxian would-be economics and would-be sociology. Only by the logical tricks of polylogism could etatism gain a hold on the modern mind. Polylogism is so inherently nonsensical that it cannot be carried consistently to its ultimate log\nThe entire text is\nonline in HTML and PDF\nformats.  Download, read and grok the brilliant fullness.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-25T17:09:00+00:00"
}