{
  "url": "https://voxday.net/2004/02/28/is-she-one-that-looks-like-opra/",
  "scraped_at": "2025-12-13T15:51:35.526393",
  "title": "Is she the one that looks like Oprah?",
  "date_display": "February 28, 2004",
  "date_iso": "2004-02-28T03:27:00+00:00",
  "date_from_url": "2004-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John McCaslin reports: <em>All white men look alike, Rep. Corrine Brown, Florida Democrat, said Wednesday at a meeting where she called President Bush’s policy toward Haiti “racist.”  Mrs. Brown’s outburst came during a closed-door meeting on Capitol Hill between administration officials and members of Congress, the Associated Press reports.</em></p><p>She became angry and began yelling at Assistant Secretary of State Roger Noriega, the State Department’s top official for Latin America. The black congresswoman slammed as “racist” Mr. Bush’s approach to the crisis in Haiti — where rebels are on the verge of ousting socialist President Jean-Bertrand Aristide, who was installed in 1993 by the Clinton administration.  She then denounced the Bush administration for sending “a bunch of white men” as representatives to the meeting — to the shock of Mr. Noriega, a man of Mexican ancestry.  “As a Mexican-American, I deeply resent being called a racist and branded a white man,” Mr. Noriega responded, sources told AP.</p><p>To which Mrs. Brown replied: “You all look alike to me.” </p><p>I’m not sure which amuses me more, the fact that she actually said it, or the fact that the media and the general public has such a low opinion of Mrs. Brown and her ilk that she’ll get away with saying it.  Then again, it’s entirely possible that she’s right – I have no idea what the president’s Haiti policy is, much less whether it is racist or not.  In fact, I don’t even know what a reasonable Haiti policy would be.</p></div>",
  "content_text": "John McCaslin reports:\nAll white men look alike, Rep. Corrine Brown, Florida Democrat, said Wednesday at a meeting where she called President Bush’s policy toward Haiti “racist.”  Mrs. Brown’s outburst came during a closed-door meeting on Capitol Hill between administration officials and members of Congress, the Associated Press reports.\nShe became angry and began yelling at Assistant Secretary of State Roger Noriega, the State Department’s top official for Latin America. The black congresswoman slammed as “racist” Mr. Bush’s approach to the crisis in Haiti — where rebels are on the verge of ousting socialist President Jean-Bertrand Aristide, who was installed in 1993 by the Clinton administration.  She then denounced the Bush administration for sending “a bunch of white men” as representatives to the meeting — to the shock of Mr. Noriega, a man of Mexican ancestry.  “As a Mexican-American, I deeply resent being called a racist and branded a white man,” Mr. Noriega responded, sources told AP.\nTo which Mrs. Brown replied: “You all look alike to me.”\nI’m not sure which amuses me more, the fact that she actually said it, or the fact that the media and the general public has such a low opinion of Mrs. Brown and her ilk that she’ll get away with saying it.  Then again, it’s entirely possible that she’s right – I have no idea what the president’s Haiti policy is, much less whether it is racist or not.  In fact, I don’t even know what a reasonable Haiti policy would be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-28T03:27:00+00:00"
}