{
  "url": "https://voxday.net/2004/02/29/it-is-still-good-to-hate-frenc/",
  "scraped_at": "2025-12-13T15:51:54.262232",
  "title": "It is still good to hate the French",
  "date_display": "February 29, 2004",
  "date_iso": "2004-02-29T16:14:00+00:00",
  "date_from_url": "2004-02-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>French cinema chains are <a href=\"http://www.suntimes.com/output/news/cst-nws-passion29.html\">refusing to distribute</a> or screen Mel Gibson’s controversial film “The Passion of the Christ” because of fears it will spark a new outbreak of anti-Semitism.  France is the only European country where there is still no distribution deal for the film.</em></p><p> Fears of a new outbreak, right.  I can just imagine the discussion:</p><p>Jean-Claude: “Mon ami, vee cannot show zis film.  The Jews, they are zee villains.  The New York Times, it said zee movie is anti-semitic!”</p><p>Pierre: “Who is zis Mel Gibson?  It is the right of zee French people to hate zee Jews in zee proper French way!  No American will tell us why vee should hate zee Jews and zeir shitty little country!</p><p>It’s worth remembering that while the Italians did their best to obstruct the occupying Germans and prevent them from rounding up Jews during World War II – so that more than 80 percent of Italy’s Jews survived – unoccupied Vichy France rounded up 70,000 Jews starting in July, 1942 and sent them to the concentration camps on their own initiative.  France was not the worst collaborator with the <em>Endlosung</em>, but their record is such that I strongly suspect French opposition to showing <strong>The Passion of the Christ</strong> stems more from the French people’s anti-clerical and anti-Christian tendencies than any tender concerns for Jewish sensibilities.</p><p><em>I don’t actually hate the French – it’s an expression.  My college roommate before moving in with WB and BC was French and my girlfriend at the time was a Parisian.  I do, however, hate Rousseauism and the Revolution!</em></p></div>",
  "content_text": "French cinema chains are\nrefusing to distribute\nor screen Mel Gibson’s controversial film “The Passion of the Christ” because of fears it will spark a new outbreak of anti-Semitism.  France is the only European country where there is still no distribution deal for the film.\nFears of a new outbreak, right.  I can just imagine the discussion:\nJean-Claude: “Mon ami, vee cannot show zis film.  The Jews, they are zee villains.  The New York Times, it said zee movie is anti-semitic!”\nPierre: “Who is zis Mel Gibson?  It is the right of zee French people to hate zee Jews in zee proper French way!  No American will tell us why vee should hate zee Jews and zeir shitty little country!\nIt’s worth remembering that while the Italians did their best to obstruct the occupying Germans and prevent them from rounding up Jews during World War II – so that more than 80 percent of Italy’s Jews survived – unoccupied Vichy France rounded up 70,000 Jews starting in July, 1942 and sent them to the concentration camps on their own initiative.  France was not the worst collaborator with the\nEndlosung\n, but their record is such that I strongly suspect French opposition to showing\nThe Passion of the Christ\nstems more from the French people’s anti-clerical and anti-Christian tendencies than any tender concerns for Jewish sensibilities.\nI don’t actually hate the French – it’s an expression.  My college roommate before moving in with WB and BC was French and my girlfriend at the time was a Parisian.  I do, however, hate Rousseauism and the Revolution!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-29T16:14:00+00:00"
}