{
  "url": "https://voxday.net/2004/02/19/its-all-fiction-anyhow/",
  "scraped_at": "2025-12-13T15:50:10.213547",
  "title": "It’s all fiction anyhow",
  "date_display": "February 19, 2004",
  "date_iso": "2004-02-19T19:43:00+00:00",
  "date_from_url": "2004-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Washington Post reports: <em>The White House on Thursday struggled anew to contain the fallout over an overly optimistic forecast that 2.6 million jobs will be created this year and some Republicans expressed concern about the damage being done to President Bush.  The chairman of Bush’s re-election campaign, Marc Racicot, continued a general Bush administration retreat by saying the forecast of 2.6 million jobs was only a “stated goal.”  “It was a theoretical discussion by an economist,” he told NBC’s “Today” show.  White House spokesman Scott McClellan called it “a snapshot in time by economic forecasters.”</em></p><p>Since 112,000 jobs were created in January, to meet the goal would require adding an average of about 335,000 new jobs each month over the course of the year — well above the 166,000 jobs a month predicted by a recent survey of forecasters by the Blue Chip Economic Indicators newsletter.  In fact, the White House had implied that 3.8 million jobs would be created this year by projecting about 3 percent growth in the number of jobs in 2004. </p><p>How quickly they retreat.  This macro economics <em>merde</em> is why I didn’t even bother buying the textbook when I was forced to take the class for my econ major.  After one test, the professor asked me if I hadn’t read a certain chapter, as my incorrect answer on an otherwise decent test indicated to him that I hadn’t read it.  He was astounded when I told him I didn’t even own the textbook, and furthermore, I had no intention of wasting any precious time or brain space on something that was obviously wrong in the theoretical sense and manifestly inaccurate in application.</p><p>Mogambo quotes John Crudele’s demonstration of how most of those 112,000 jobs were fictional anyhow: <em> “By now my readers should have a PHD (pretty high disdain) for Capitol Hill math. This one, though, is a cake taker. I’ll translate: Included in the 112,000 new jobs in January were 76,000 jobs that supposedly exist because people who weren’t hired in December couldn’t be fired in January. Got that? They didn’t get hired in December, or fired in January, so they showed up as new employees in January as a statistical fluke. So, really there were only an abysmally small 36,000 new jobs in January. “</em></p><p>I guess that means the economy only has to produce 345,455 new jobs per month in order to meet the White House’s prediction.  Well, if they can  find 76,000 jobs that don’t exist, I’m sure they can find another few million.  The exposure of Saddam Hussein’s secret printing operations should blow the entire notion of official government economics statistics away once and for all.  It won’t, but it should.</p></div>",
  "content_text": "The Washington Post reports:\nThe White House on Thursday struggled anew to contain the fallout over an overly optimistic forecast that 2.6 million jobs will be created this year and some Republicans expressed concern about the damage being done to President Bush.  The chairman of Bush’s re-election campaign, Marc Racicot, continued a general Bush administration retreat by saying the forecast of 2.6 million jobs was only a “stated goal.”  “It was a theoretical discussion by an economist,” he told NBC’s “Today” show.  White House spokesman Scott McClellan called it “a snapshot in time by economic forecasters.”\nSince 112,000 jobs were created in January, to meet the goal would require adding an average of about 335,000 new jobs each month over the course of the year — well above the 166,000 jobs a month predicted by a recent survey of forecasters by the Blue Chip Economic Indicators newsletter.  In fact, the White House had implied that 3.8 million jobs would be created this year by projecting about 3 percent growth in the number of jobs in 2004.\nHow quickly they retreat.  This macro economics\nmerde\nis why I didn’t even bother buying the textbook when I was forced to take the class for my econ major.  After one test, the professor asked me if I hadn’t read a certain chapter, as my incorrect answer on an otherwise decent test indicated to him that I hadn’t read it.  He was astounded when I told him I didn’t even own the textbook, and furthermore, I had no intention of wasting any precious time or brain space on something that was obviously wrong in the theoretical sense and manifestly inaccurate in application.\nMogambo quotes John Crudele’s demonstration of how most of those 112,000 jobs were fictional anyhow:\n“By now my readers should have a PHD (pretty high disdain) for Capitol Hill math. This one, though, is a cake taker. I’ll translate: Included in the 112,000 new jobs in January were 76,000 jobs that supposedly exist because people who weren’t hired in December couldn’t be fired in January. Got that? They didn’t get hired in December, or fired in January, so they showed up as new employees in January as a statistical fluke. So, really there were only an abysmally small 36,000 new jobs in January. “\nI guess that means the economy only has to produce 345,455 new jobs per month in order to meet the White House’s prediction.  Well, if they can  find 76,000 jobs that don’t exist, I’m sure they can find another few million.  The exposure of Saddam Hussein’s secret printing operations should blow the entire notion of official government economics statistics away once and for all.  It won’t, but it should.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-19T19:43:00+00:00"
}