{
  "url": "https://voxday.net/2004/02/07/its-apophasis-stupid/",
  "scraped_at": "2025-12-13T15:47:47.850766",
  "title": "It’s the apophasis, stupid!",
  "date_display": "February 7, 2004",
  "date_iso": "2004-02-07T12:12:00+00:00",
  "date_from_url": "2004-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Eponymous isn’t actually stupid, and <a href=\"http://blogs.salon.com/0002874/2004/02/07.html#a551\">even in this post</a> purporting to deny that Kerry insulted Bush’s service in the National Guard she is amusing.  But if you are familiar with the art of the rhetorical insult, you will be immediately notice that the senator used a combination of apophasis and parallelism to first deny that he was making a point of that to which he specifically wished attention to be drawn, and equating National Guard service with fleeing to Canada.  The statement has plausible deniability from a pure grammatical perspective, but none from a rhetorical one.</p><p>I don’t blame Kerry for contrasting his service record with Bush at all; he’d have to be crazy not to.  But considering that politics is nothing if not the practice of rhetoric, there’s no doubt that he did insult both Bush and the National Guard.  For a victorious Commander-in-Chief, Bush is very weak on the military front, but based on this little incident I don’t expect Senator Kerry to be able to exploit it effectively.</p></div>",
  "content_text": "Eponymous isn’t actually stupid, and\neven in this post\npurporting to deny that Kerry insulted Bush’s service in the National Guard she is amusing.  But if you are familiar with the art of the rhetorical insult, you will be immediately notice that the senator used a combination of apophasis and parallelism to first deny that he was making a point of that to which he specifically wished attention to be drawn, and equating National Guard service with fleeing to Canada.  The statement has plausible deniability from a pure grammatical perspective, but none from a rhetorical one.\nI don’t blame Kerry for contrasting his service record with Bush at all; he’d have to be crazy not to.  But considering that politics is nothing if not the practice of rhetoric, there’s no doubt that he did insult both Bush and the National Guard.  For a victorious Commander-in-Chief, Bush is very weak on the military front, but based on this little incident I don’t expect Senator Kerry to be able to exploit it effectively.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-07T12:12:00+00:00"
}