{
  "url": "https://voxday.net/2004/02/06/kmc-on-marriage/",
  "scraped_at": "2025-12-13T15:47:29.860553",
  "title": "KMC on “marriage”",
  "date_display": "February 6, 2004",
  "date_iso": "2004-02-06T16:38:00+00:00",
  "date_from_url": "2004-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m generally loathe to continue a previous day’s discussion, so as to avoid beating a lifeless equine, but Kevin McCullough wanted to contribute his take by way of <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36979\">his column today</a>.  I don’t think I buy into the concept myself; Canada is showing that there’s no need for such a redefinition of marriage in order to crack down on the traditional and the faithful with newly manufactured hate crimes, while in other places, like Zurich,  such “marriage” exists without any attendant speech codes and PC enforcement.  As with gun control, a failure to look beyond the borders can sometimes create false dichotomies.  But don’t take my word for it, go see for yourself.</p><p>KMC writes: <em>…if a state were to give “sanctity” to an otherwise “immoral” activity then there is no need to worry about what that church says anymore. In fact, if the right hate-crime laws are passed then maybe … just perhaps … we can shut down those voices who say such things all together.</em></p><p>Maybe this argument might impress a few moderates and shaky conservatives who still believe that legality equates to morality.  Since my libertarian logic rejects that concept, I’m left fairly cold by this notion.  But, it is conceivable and it is true that the Stalinist nature of the American gay rights movement is surpassed only by the abortionette Left.  Not being privy to the inner circles of the Lavender Mafia, I have no idea what the grand master plan behind such “marriage” is.  The Norwegian and Swedish statistics suggest that most homosexuals aren’t actually interested in “marrying” and are highly unlikely to stay “married” even if they do go through with it .  Perhaps the Gayfather will deign to enlighten us; I’m pretty sure our non-rabid queer friends have no more clue than we do.</p><p>Speaking of columns, I just turned in next week’s.  I imagine we may get a few angry feminist sorts popping their noses in, assuming they aren’t too bent out of shape to fit.  If nothing else, there should be some amusing fodder for the cannons.  Just a little something to anticipate in case you feel the need to sharpen your knives over the weekend.</p></div>",
  "content_text": "I’m generally loathe to continue a previous day’s discussion, so as to avoid beating a lifeless equine, but Kevin McCullough wanted to contribute his take by way of\nhis column today\n.  I don’t think I buy into the concept myself; Canada is showing that there’s no need for such a redefinition of marriage in order to crack down on the traditional and the faithful with newly manufactured hate crimes, while in other places, like Zurich,  such “marriage” exists without any attendant speech codes and PC enforcement.  As with gun control, a failure to look beyond the borders can sometimes create false dichotomies.  But don’t take my word for it, go see for yourself.\nKMC writes:\n…if a state were to give “sanctity” to an otherwise “immoral” activity then there is no need to worry about what that church says anymore. In fact, if the right hate-crime laws are passed then maybe … just perhaps … we can shut down those voices who say such things all together.\nMaybe this argument might impress a few moderates and shaky conservatives who still believe that legality equates to morality.  Since my libertarian logic rejects that concept, I’m left fairly cold by this notion.  But, it is conceivable and it is true that the Stalinist nature of the American gay rights movement is surpassed only by the abortionette Left.  Not being privy to the inner circles of the Lavender Mafia, I have no idea what the grand master plan behind such “marriage” is.  The Norwegian and Swedish statistics suggest that most homosexuals aren’t actually interested in “marrying” and are highly unlikely to stay “married” even if they do go through with it .  Perhaps the Gayfather will deign to enlighten us; I’m pretty sure our non-rabid queer friends have no more clue than we do.\nSpeaking of columns, I just turned in next week’s.  I imagine we may get a few angry feminist sorts popping their noses in, assuming they aren’t too bent out of shape to fit.  If nothing else, there should be some amusing fodder for the cannons.  Just a little something to anticipate in case you feel the need to sharpen your knives over the weekend.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-06T16:38:00+00:00"
}