{
  "url": "https://voxday.net/2004/02/19/liberal-talk-radio/",
  "scraped_at": "2025-12-13T15:50:00.694052",
  "title": "Liberal talk radio",
  "date_display": "February 19, 2004",
  "date_iso": "2004-02-19T11:54:00+00:00",
  "date_from_url": "2004-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Star Tribune <a href=\"http://startribune.com/stories/484/4421900.html\">gets optimistic</a>: <em>Another conservative caller asks accusingly, “Do you believe socialism is superior to capitalism?” “No,” Schultz says, but he’s irritated.  “You get so stuck in a rut, hung up in this philosophy,” he tells the caller, his throat tightening and making him sound a little like Rush again. “When does dealing with the real problem overrun your fixation with ideology?”</em></p><p>What an intellectual zero.  This guy is the ultimate media ho, the only good thing is that his dedication to conservativism was probably no more genuine than his newfound love of leftism.  If he had any knowledge whatsoever, he’d know that there is no separation between ideology and real problems.  A foolish question like the one above is an evasion, although it’s probable that he couldn’t define the difference between capitalism and socialism if his radio show depended on it.</p></div>",
  "content_text": "The Star Tribune\ngets optimistic\n:\nAnother conservative caller asks accusingly, “Do you believe socialism is superior to capitalism?” “No,” Schultz says, but he’s irritated.  “You get so stuck in a rut, hung up in this philosophy,” he tells the caller, his throat tightening and making him sound a little like Rush again. “When does dealing with the real problem overrun your fixation with ideology?”\nWhat an intellectual zero.  This guy is the ultimate media ho, the only good thing is that his dedication to conservativism was probably no more genuine than his newfound love of leftism.  If he had any knowledge whatsoever, he’d know that there is no separation between ideology and real problems.  A foolish question like the one above is an evasion, although it’s probable that he couldn’t define the difference between capitalism and socialism if his radio show depended on it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-19T11:54:00+00:00"
}