{
  "url": "https://voxday.net/2004/02/13/mailvox-organized-religion/",
  "scraped_at": "2025-12-13T15:48:58.631826",
  "title": "Mailvox: Organized religion",
  "date_display": "February 13, 2004",
  "date_iso": "2004-02-13T13:07:00+00:00",
  "date_from_url": "2004-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DB writes: <em>Organized religion has always mystified me.  I don’t have a problem with it, but I don’t understand it.  For example, I think the Bible is a fascinating book, and has plenty of good advice and stories.  But taking things like Jesus rising from the dead and Moses parting the Red Sea literally as actual events stretches the bounds of my credulity.  My problem is not with Christian philosophy, but with accepting their version of events as the true versions of what occurred.  A related problem comes into play for me when considering all the various sects of Christianity, let alone other major religions.  How did you come to settle on the Baptist sect?  What do you think happens to those who worship other religions?  How can you be sure that God prefers that we worship him as Baptists, and not as say, Catholic?  Even more drastically, how can you be positive that God even exists, considering that you most likely heard about Him through other people?</em></p><p>I don’t put much credence in my particular sect versus the Christian church as a whole.  I am not a Southern Baptist because I analyzed the minutiae of the denomination in comparison with others, but because I happened to find a particular Southern Baptist church as a great place to worship Jesus Christ.  If the leaders of the SBC began promulgating anti-Biblical non-Christian teachings as other denominations have done, I would leave it in a heartbeat without remorse.  My only loyalty is to Jesus Christ, everything else is unimportant in comparison.  So, I am not sure that God prefers, or even cares, that His Son is worshipped with electric guitars or Gregorian chant.  The idea that the rocks will cry out if we do not seems to suggest that he is not worried overmuch with such details.</p><p>As for your questions, I believeJesus Christ when He said that He was the only way.  I also accept that He told Peter that the decisions of others and the subsequent consequences were no direct concern of Peter’s or mine.  I am not indifferent to the eternal fate of others, but neither am I answerable for them.  As for my faith, it is intellectually strong because I have too often seen that the wisdom of the Bible is far greater than the wisdom of Man, even when Man has the advantage of 2,000 or more years of experience upon which to draw.  And my personal experience of God’s actions in my life and the lives of those around me tends to correlate very closely with this Biblical wisdom as well.</p><p>I don’t view this as an argument to convince anyone, mind you.  I am not trying to do so.  But having lived life sampling a good part of the best that the world has to offer and then experiencing some of what Jesus Christ taught was a mere prelude, I am both intellectually and emotionally satisfied with the path that I have chosen.</p><p>Regarding the truth of the Bible, I have no more doubt about Jesus Christ than I do about Alexander the Great.  By virtue of secular historical standards, the evidence for the former far surpasses that of the latter.  I have seen modern science and archeology fail far too often before the ancient record of the Bible to be much concerned about apparent contradictions that remain therein.  In a world where cloning has now been accomplished – despite being an avid sci-fi reader, I never would have imagined it happening in my lifetime – I am very hesitant to even consider using the word impossible with regards to anything except the abstract laws of logic.</p></div>",
  "content_text": "DB writes:\nOrganized religion has always mystified me.  I don’t have a problem with it, but I don’t understand it.  For example, I think the Bible is a fascinating book, and has plenty of good advice and stories.  But taking things like Jesus rising from the dead and Moses parting the Red Sea literally as actual events stretches the bounds of my credulity.  My problem is not with Christian philosophy, but with accepting their version of events as the true versions of what occurred.  A related problem comes into play for me when considering all the various sects of Christianity, let alone other major religions.  How did you come to settle on the Baptist sect?  What do you think happens to those who worship other religions?  How can you be sure that God prefers that we worship him as Baptists, and not as say, Catholic?  Even more drastically, how can you be positive that God even exists, considering that you most likely heard about Him through other people?\nI don’t put much credence in my particular sect versus the Christian church as a whole.  I am not a Southern Baptist because I analyzed the minutiae of the denomination in comparison with others, but because I happened to find a particular Southern Baptist church as a great place to worship Jesus Christ.  If the leaders of the SBC began promulgating anti-Biblical non-Christian teachings as other denominations have done, I would leave it in a heartbeat without remorse.  My only loyalty is to Jesus Christ, everything else is unimportant in comparison.  So, I am not sure that God prefers, or even cares, that His Son is worshipped with electric guitars or Gregorian chant.  The idea that the rocks will cry out if we do not seems to suggest that he is not worried overmuch with such details.\nAs for your questions, I believeJesus Christ when He said that He was the only way.  I also accept that He told Peter that the decisions of others and the subsequent consequences were no direct concern of Peter’s or mine.  I am not indifferent to the eternal fate of others, but neither am I answerable for them.  As for my faith, it is intellectually strong because I have too often seen that the wisdom of the Bible is far greater than the wisdom of Man, even when Man has the advantage of 2,000 or more years of experience upon which to draw.  And my personal experience of God’s actions in my life and the lives of those around me tends to correlate very closely with this Biblical wisdom as well.\nI don’t view this as an argument to convince anyone, mind you.  I am not trying to do so.  But having lived life sampling a good part of the best that the world has to offer and then experiencing some of what Jesus Christ taught was a mere prelude, I am both intellectually and emotionally satisfied with the path that I have chosen.\nRegarding the truth of the Bible, I have no more doubt about Jesus Christ than I do about Alexander the Great.  By virtue of secular historical standards, the evidence for the former far surpasses that of the latter.  I have seen modern science and archeology fail far too often before the ancient record of the Bible to be much concerned about apparent contradictions that remain therein.  In a world where cloning has now been accomplished – despite being an avid sci-fi reader, I never would have imagined it happening in my lifetime – I am very hesitant to even consider using the word impossible with regards to anything except the abstract laws of logic.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-13T13:07:00+00:00"
}