{
  "url": "https://voxday.net/2004/02/02/mailvox-government-they-deserve/",
  "scraped_at": "2025-12-13T15:46:44.513617",
  "title": "Mailvox: the government they deserve",
  "date_display": "February 2, 2004",
  "date_iso": "2004-02-02T16:17:00+00:00",
  "date_from_url": "2004-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SB writes: <em>The public gets the government it deserves.  People will vote for politicians promising more beer and potato chips.  They will vote for politicians promising to cancel all debts, and to grab money from the wealthy and redistribute it.  That’s why the States at first did not want to allow poor people to have the vote.  We gave them the vote, and now we have the unions, the bankruptcy laws, the redistribution of wealth, and everything that anyone would expect.  That’s how it works.  If Americans are short sighted, demand a free lunch, and for that matter demand free sex and other perversions, then that is exactly what they will get in a democracy.  Perhaps our democratic experiment is a failure, and we are really demo-crazy.</em></p><p>Certainly everyone from de Tocqueville to Marx and Schumpeter have argued that this was the inevitable end of democracy.  And perhaps it is a failure.  In which case, those of us who love freedom have two choices.  We allow it to die with or without protest.  I imagine you probably know my position on the matter.</p></div>",
  "content_text": "SB writes:\nThe public gets the government it deserves.  People will vote for politicians promising more beer and potato chips.  They will vote for politicians promising to cancel all debts, and to grab money from the wealthy and redistribute it.  That’s why the States at first did not want to allow poor people to have the vote.  We gave them the vote, and now we have the unions, the bankruptcy laws, the redistribution of wealth, and everything that anyone would expect.  That’s how it works.  If Americans are short sighted, demand a free lunch, and for that matter demand free sex and other perversions, then that is exactly what they will get in a democracy.  Perhaps our democratic experiment is a failure, and we are really demo-crazy.\nCertainly everyone from de Tocqueville to Marx and Schumpeter have argued that this was the inevitable end of democracy.  And perhaps it is a failure.  In which case, those of us who love freedom have two choices.  We allow it to die with or without protest.  I imagine you probably know my position on the matter.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-02T16:17:00+00:00"
}