{
  "url": "https://voxday.net/2004/02/03/mailvox-on-drugs/",
  "scraped_at": "2025-12-13T15:47:02.562426",
  "title": "Mailvox: On drugs",
  "date_display": "February 3, 2004",
  "date_iso": "2004-02-03T17:50:00+00:00",
  "date_from_url": "2004-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Katherine comments: <em>Vox, you do nothing for improving the public opinion of the libertarian party, which is that it is a group of people who seek mostly to curb societal disapproval of the few vices they have left. After your little rant accusing “paranoid drug warriors” of being prudes because they don’t support random individuals having the freedom to use every kind of hard drug they can get their hands on, I’m not so sure they were wrong.  Want to bring more people to the libertarian party? Stop telling people who disagree with you that they are prudes. </em></p><p>I never said anything about prudes.  Nothing personal, truly, but I don’t think anti-drug conservatives are prudes.  With regards to this specific matter, I think they’re uninformed, illogical, short-sighted and, quite frequently, downright stupid.  I also know from personal experience that if you repeatedly smash a person in the face with their total failure of logic on a specific matter, they will eventually wake up.  I have been very successful in convincing rock-hard conservative Republicans who have never dreamed of touching an illegal chemical that the Drug War is evil, dangerous and a total contradiction of their core beliefs.  As for paranoid, what else would you call someone who is more afraid of an imaginary threat than of something that is indisputably real and uniquely lethal?</p><p>I was an elite NCAA Division 1 athlete and very seldom used the drugs in which most of my friends habitually engaged.  I’ve been 100 percent clean for over a decade, even when living in a country where marijuana is openly sold by a chain of stores.  But I never said drugs are safe.  They’re not.  And yet, 100,000 people die every year on the highways but we don’t ban cars because 75 percent of those trips are unnecessary expeditions in pursuit of a shopping buzz.  Conservatives wet their pants because a few people more people might OD here and there or drop out of the job market if drugs are legalized, and because of this irrational fear, they happily embrace expanding central government power, the only thing that has killed more humans this century than every drug, every car accident, every war, and every murderous criminal combined – and this despite the fact that 20 years of trampling all over civil liberties and the Constitution has only increased drug availability and potency exactly as the Prohibition experiment indicated.  You can’t even withdraw a measly $3,000 from your bank now without it being reported to the FBI, thanks to this “conservative” policy.</p><p>The upshot is that the Drug War is yet another example of short-sighted conservatives being snookered by statists.  The centralizers burn to increase central power by any means necessary, and this has been one of their most successful tactics.  Remember, back when the country actually was conservative, opium, cocaine and marijuana were all legal.  There’s nothing inherently conservative about the Drug War, and there’s nothing inherently libertine about opposing it.  I don’t want drugs to be legal so that I can use them, I want them to be legal so government agents don’t have an excuse to trample on the Constitution, steal private property and shoot people in the head.</p></div>",
  "content_text": "Katherine comments:\nVox, you do nothing for improving the public opinion of the libertarian party, which is that it is a group of people who seek mostly to curb societal disapproval of the few vices they have left. After your little rant accusing “paranoid drug warriors” of being prudes because they don’t support random individuals having the freedom to use every kind of hard drug they can get their hands on, I’m not so sure they were wrong.  Want to bring more people to the libertarian party? Stop telling people who disagree with you that they are prudes.\nI never said anything about prudes.  Nothing personal, truly, but I don’t think anti-drug conservatives are prudes.  With regards to this specific matter, I think they’re uninformed, illogical, short-sighted and, quite frequently, downright stupid.  I also know from personal experience that if you repeatedly smash a person in the face with their total failure of logic on a specific matter, they will eventually wake up.  I have been very successful in convincing rock-hard conservative Republicans who have never dreamed of touching an illegal chemical that the Drug War is evil, dangerous and a total contradiction of their core beliefs.  As for paranoid, what else would you call someone who is more afraid of an imaginary threat than of something that is indisputably real and uniquely lethal?\nI was an elite NCAA Division 1 athlete and very seldom used the drugs in which most of my friends habitually engaged.  I’ve been 100 percent clean for over a decade, even when living in a country where marijuana is openly sold by a chain of stores.  But I never said drugs are safe.  They’re not.  And yet, 100,000 people die every year on the highways but we don’t ban cars because 75 percent of those trips are unnecessary expeditions in pursuit of a shopping buzz.  Conservatives wet their pants because a few people more people might OD here and there or drop out of the job market if drugs are legalized, and because of this irrational fear, they happily embrace expanding central government power, the only thing that has killed more humans this century than every drug, every car accident, every war, and every murderous criminal combined – and this despite the fact that 20 years of trampling all over civil liberties and the Constitution has only increased drug availability and potency exactly as the Prohibition experiment indicated.  You can’t even withdraw a measly $3,000 from your bank now without it being reported to the FBI, thanks to this “conservative” policy.\nThe upshot is that the Drug War is yet another example of short-sighted conservatives being snookered by statists.  The centralizers burn to increase central power by any means necessary, and this has been one of their most successful tactics.  Remember, back when the country actually was conservative, opium, cocaine and marijuana were all legal.  There’s nothing inherently conservative about the Drug War, and there’s nothing inherently libertine about opposing it.  I don’t want drugs to be legal so that I can use them, I want them to be legal so government agents don’t have an excuse to trample on the Constitution, steal private property and shoot people in the head.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-03T17:50:00+00:00"
}