{
  "url": "https://voxday.net/2004/02/02/mailvox-you-vill-be-silen/",
  "scraped_at": "2025-12-13T15:46:40.821725",
  "title": "Mailvox: You VILL be silent!",
  "date_display": "February 2, 2004",
  "date_iso": "2004-02-02T15:33:00+00:00",
  "date_from_url": "2004-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JN writes: <em>We have the chance to reform the judiciary in the next four years: replace federal judgeships, Supreme Court appointments etc..  By having a temper tantrum you are playing right into the hand of Sen Kennedy and Leheay’s.  You are also jeopardizing the lives of the unborn innocents, it is unconscionable you could do this!  If unborn children mean anything to you you will button your lip.</em></p><p>Gee, maybe if I just shut my mouth and quietly accept the long march towards global socialism, everything will turn out peachy keen!  It’s interesting, too, to see how a call to stand by one’s principles is equated with a temper tantrum.  JN has to open his eyes and realize that George Delano and the Republican Party have no intention of abiding by their publicly professed principles.  “But he said he loved me,” he’ll sob one day, like a girl who’s just been deflowered and abandoned by her smooth-talking lover.  “He said he loved me!”  See, the thing is, George Delano doesn’t mean what he says.  Nor does the Republican Party leadership.  That’s kind of the entire point.</p><p>Of course, if we just vote Republican, we’ll get great Supreme Court judges who will fight for the unborn like Earl Warren, Warren Burger, David Souter, Anthony Kennedy, Sandra Day O’Conner… hmmm, wait a minute!</p></div>",
  "content_text": "JN writes:\nWe have the chance to reform the judiciary in the next four years: replace federal judgeships, Supreme Court appointments etc..  By having a temper tantrum you are playing right into the hand of Sen Kennedy and Leheay’s.  You are also jeopardizing the lives of the unborn innocents, it is unconscionable you could do this!  If unborn children mean anything to you you will button your lip.\nGee, maybe if I just shut my mouth and quietly accept the long march towards global socialism, everything will turn out peachy keen!  It’s interesting, too, to see how a call to stand by one’s principles is equated with a temper tantrum.  JN has to open his eyes and realize that George Delano and the Republican Party have no intention of abiding by their publicly professed principles.  “But he said he loved me,” he’ll sob one day, like a girl who’s just been deflowered and abandoned by her smooth-talking lover.  “He said he loved me!”  See, the thing is, George Delano doesn’t mean what he says.  Nor does the Republican Party leadership.  That’s kind of the entire point.\nOf course, if we just vote Republican, we’ll get great Supreme Court judges who will fight for the unborn like Earl Warren, Warren Burger, David Souter, Anthony Kennedy, Sandra Day O’Conner… hmmm, wait a minute!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-02T15:33:00+00:00"
}