{
  "url": "https://voxday.net/2004/02/24/mailvox-where-are-our-enemies/",
  "scraped_at": "2025-12-13T15:50:42.756344",
  "title": "Mailvox: Where are our enemies",
  "date_display": "February 24, 2004",
  "date_iso": "2004-02-24T15:48:00+00:00",
  "date_from_url": "2004-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An MP stationed in Germany writes: <em>Great article!  Unfortunately, my belief is that the military, in the words of theJBS, has been hijacked by the politicians at its very own.  so long as the head is evil, the body will sin…no matter how many good folks there are in the body.  No more brass willing to say “no…that’s unconstitutional.  we cannot deploy for that reason.”  it all boils down tothis, “my people are destroyed for a lack of knowledge”. …and it’s only getting worse.  lastly, you did name the real enemies of america.  it’s a shame that our worse enemies always come from within.</em></p><p>As with Rome, America’s only serious enemies will always come from within.  Only Carthage was ever capable of seriously challenging Roman hegemony; Mithradates, for all of his pretensions, never offered a serious threat.  In the same way, only international Communism led by the Soviet Union and now, in its mutated neo-capitalist form, led by the People’s Republic of China, can even think of posing an external challenge to the United States.</p><p>But societal collapse through decadence and the expansion of central power is not only probable, elements of it are quite visible today.  The sad and ironic thing is that some of it will come through those hoping and honestly trying to stave off collapse.</p><p>A retired major adds: <em>Thanks for a great piece! This piece is the best critique of our futile effort at forming an “empire.”</em></p></div>",
  "content_text": "An MP stationed in Germany writes:\nGreat article!  Unfortunately, my belief is that the military, in the words of theJBS, has been hijacked by the politicians at its very own.  so long as the head is evil, the body will sin…no matter how many good folks there are in the body.  No more brass willing to say “no…that’s unconstitutional.  we cannot deploy for that reason.”  it all boils down tothis, “my people are destroyed for a lack of knowledge”. …and it’s only getting worse.  lastly, you did name the real enemies of america.  it’s a shame that our worse enemies always come from within.\nAs with Rome, America’s only serious enemies will always come from within.  Only Carthage was ever capable of seriously challenging Roman hegemony; Mithradates, for all of his pretensions, never offered a serious threat.  In the same way, only international Communism led by the Soviet Union and now, in its mutated neo-capitalist form, led by the People’s Republic of China, can even think of posing an external challenge to the United States.\nBut societal collapse through decadence and the expansion of central power is not only probable, elements of it are quite visible today.  The sad and ironic thing is that some of it will come through those hoping and honestly trying to stave off collapse.\nA retired major adds:\nThanks for a great piece! This piece is the best critique of our futile effort at forming an “empire.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-24T15:48:00+00:00"
}