{
  "url": "https://voxday.net/2004/02/10/mailvox-dont-trust-tears/",
  "scraped_at": "2025-12-13T15:48:26.149368",
  "title": "Mailvox: Don’t trust the tears",
  "date_display": "February 10, 2004",
  "date_iso": "2004-02-10T17:46:00+00:00",
  "date_from_url": "2004-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JW writes: <em>I read your commentary with great interest.  I have long been disgusted by feminine manipulative techniques.  I am particularly contemptuous of the technique of crying when asked for accountability.  I am also contemptuous of men who let women get away with it.  I am an attorney with my own firm.  Before that, I was the only woman partner in an insurance defense firm.  During my tenure there, I saw men turn into absolute doofuses because a secretary would cry instead of taking responsibility for bad behavior.  These women would try that technique once with me [JW is a lady attorney]–and then never again.  That’s because they knew it wouldn’t work. So, perhaps men should take responsibility for their behavior in these instances too.</em></p><p>I dated a pretty blonde who drove a white Camaro in high school.  She regularly drove 85 and got pulled over with some degree of regularity – 14 times in one summer alone.  Every time, she’d simply turn on the waterworks and get out of a ticket.  Over the seven years before I lost contact with her, she never once got a speeding ticket.  I had 10 in that period and I didn’t drive anywhere nearly as fast as she did.</p><p>There’s no question that men act as enablers in teaching women to be irresponsible.  I’m guilty of it myself.  But that does not mean that women are unaccountable for their failure to take responsibility for themselves, anymore than the predatory young men who take sexual advantage of young women are not responsible because they were taught that women have the same sexual impulses and appetites that they do.</p></div>",
  "content_text": "JW writes:\nI read your commentary with great interest.  I have long been disgusted by feminine manipulative techniques.  I am particularly contemptuous of the technique of crying when asked for accountability.  I am also contemptuous of men who let women get away with it.  I am an attorney with my own firm.  Before that, I was the only woman partner in an insurance defense firm.  During my tenure there, I saw men turn into absolute doofuses because a secretary would cry instead of taking responsibility for bad behavior.  These women would try that technique once with me [JW is a lady attorney]–and then never again.  That’s because they knew it wouldn’t work. So, perhaps men should take responsibility for their behavior in these instances too.\nI dated a pretty blonde who drove a white Camaro in high school.  She regularly drove 85 and got pulled over with some degree of regularity – 14 times in one summer alone.  Every time, she’d simply turn on the waterworks and get out of a ticket.  Over the seven years before I lost contact with her, she never once got a speeding ticket.  I had 10 in that period and I didn’t drive anywhere nearly as fast as she did.\nThere’s no question that men act as enablers in teaching women to be irresponsible.  I’m guilty of it myself.  But that does not mean that women are unaccountable for their failure to take responsibility for themselves, anymore than the predatory young men who take sexual advantage of young women are not responsible because they were taught that women have the same sexual impulses and appetites that they do.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-10T17:46:00+00:00"
}