{
  "url": "https://voxday.net/2004/02/09/mailvox-check-one/",
  "scraped_at": "2025-12-13T15:48:04.694931",
  "title": "Mailvox: check one-half",
  "date_display": "February 9, 2004",
  "date_iso": "2004-02-09T12:00:00+00:00",
  "date_from_url": "2004-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jill writes, somewhat as predicted: <em>Vox you are ranting this time and making no sense. First you don’t even eludicate exactly on WHAT women are supposedly “not taking responsibility.” And two, don’t make me LAUGH.  Just because men think women don’t take responsibility is nothing more than projection. It has never changed, even down to men STILL blaming women for THEIR lack of responsibility.I suggest men grow up and take the responsibility they have avoided for centuries before they take it upon themselves to preach to the sex that has been shouldering that lack of responsibility.</em></p><p>How can “their words, their actions and their decisions” possibly be considered a failure to elucidate for what women are failing to take responsibility?  The specifics vary from individual to individual.  I’ll consider believing that women are collectively ready to take general responsibility for themselves the next time I see a woman insult someone, get punched in the mouth, then get up and say, “yeah, I deserved that.”  Which has happened, in my experience, ah, let me see… never.</p><p>A female friend of mine once got badly hurt after mouthing off to a stranger who rather forcefully demonstrated his belief in the inherent equality of men and women.  Her date, a similarly propagandized young man, didn’t defend her, presumably on grounds of self-responsibility.  Why should he bear the consequences for her words?  A rather damning indictment of where 30 years of feminism have gotten us, true, but she did learn what every man knows; take responsibility for your words, as they can have unpleasant and unforeseen consequences.</p><p>I love the capital letters.  Jill’s email doesn’t quite count as (1)<em> asserting that women don’t respect men and have every reason for doing so</em>, but the implication is certainly there based on the context of the response.  I’ll call it one-half down, three and one-half to go.  In any event, there’s a lot more to taking responsibility than being willing to raise a child after you’ve had sex.</p></div>",
  "content_text": "Jill writes, somewhat as predicted:\nVox you are ranting this time and making no sense. First you don’t even eludicate exactly on WHAT women are supposedly “not taking responsibility.” And two, don’t make me LAUGH.  Just because men think women don’t take responsibility is nothing more than projection. It has never changed, even down to men STILL blaming women for THEIR lack of responsibility.I suggest men grow up and take the responsibility they have avoided for centuries before they take it upon themselves to preach to the sex that has been shouldering that lack of responsibility.\nHow can “their words, their actions and their decisions” possibly be considered a failure to elucidate for what women are failing to take responsibility?  The specifics vary from individual to individual.  I’ll consider believing that women are collectively ready to take general responsibility for themselves the next time I see a woman insult someone, get punched in the mouth, then get up and say, “yeah, I deserved that.”  Which has happened, in my experience, ah, let me see… never.\nA female friend of mine once got badly hurt after mouthing off to a stranger who rather forcefully demonstrated his belief in the inherent equality of men and women.  Her date, a similarly propagandized young man, didn’t defend her, presumably on grounds of self-responsibility.  Why should he bear the consequences for her words?  A rather damning indictment of where 30 years of feminism have gotten us, true, but she did learn what every man knows; take responsibility for your words, as they can have unpleasant and unforeseen consequences.\nI love the capital letters.  Jill’s email doesn’t quite count as (1)\nasserting that women don’t respect men and have every reason for doing so\n, but the implication is certainly there based on the context of the response.  I’ll call it one-half down, three and one-half to go.  In any event, there’s a lot more to taking responsibility than being willing to raise a child after you’ve had sex.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-09T12:00:00+00:00"
}