{
  "url": "https://voxday.net/2004/02/24/mailvox-he-wants-to-jump/",
  "scraped_at": "2025-12-13T15:50:46.391576",
  "title": "Mailvox: he wants to jump",
  "date_display": "February 24, 2004",
  "date_iso": "2004-02-24T15:58:00+00:00",
  "date_from_url": "2004-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MDM writes: <em>I just returned from Army Airborne School, where I had the pleasure of making some new friends in the Army and Marine Corps.  One of the most talked about topics on discussion was, “people who support the troops and still say bring them home.”  This is a contradictory statement if we have ever heard one.  It’s like saying to journalists, “we support journalism just don’t finish your articles.”  If you think that reads like nonsense, try asking some troops for yourself. After all, it’s my fellow troops asses that are on the line, shouldn’t the decision be left to us, if it is left up to anyone? By the way, I love your column so don’t think I am an ass.  No 40K players are all that bad, now are they?</em></p><p>You can certainly disagree with me on a single issue without fear of being called an ass, MDM.  But if you think there’s a contradiction there, what do you make of those troops who agree with me?  And as much as I admire the US military and the fundamental good judgment of the American soldier, I don’t think military dictatorship is the answer to our political problems.  That is essentially what you’re talking about here, although not in so many words.  I would say that a better analogy would be: “we support journalism, please write about national sovereignty instead of the best way to rebuild the Iraqi economy.”</p><p>And I play Fantasy Battles, by the way.</p></div>",
  "content_text": "MDM writes:\nI just returned from Army Airborne School, where I had the pleasure of making some new friends in the Army and Marine Corps.  One of the most talked about topics on discussion was, “people who support the troops and still say bring them home.”  This is a contradictory statement if we have ever heard one.  It’s like saying to journalists, “we support journalism just don’t finish your articles.”  If you think that reads like nonsense, try asking some troops for yourself. After all, it’s my fellow troops asses that are on the line, shouldn’t the decision be left to us, if it is left up to anyone? By the way, I love your column so don’t think I am an ass.  No 40K players are all that bad, now are they?\nYou can certainly disagree with me on a single issue without fear of being called an ass, MDM.  But if you think there’s a contradiction there, what do you make of those troops who agree with me?  And as much as I admire the US military and the fundamental good judgment of the American soldier, I don’t think military dictatorship is the answer to our political problems.  That is essentially what you’re talking about here, although not in so many words.  I would say that a better analogy would be: “we support journalism, please write about national sovereignty instead of the best way to rebuild the Iraqi economy.”\nAnd I play Fantasy Battles, by the way.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-24T15:58:00+00:00"
}