{
  "url": "https://voxday.net/2004/02/09/mailvox-avoiding-responsibility/",
  "scraped_at": "2025-12-13T15:47:59.550616",
  "title": "Mailvox: Avoiding responsibility",
  "date_display": "February 9, 2004",
  "date_iso": "2004-02-09T10:18:00+00:00",
  "date_from_url": "2004-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CM writes: <em>You went the long speculative way around in order to get to your speculative, sort-of conclusion. It was a conclusion that left me frustrated, and so I decided to do something responsible about it, instead of: just whine, complain to a gurlll-frain or write you an unconstructive, insulting letter.  ANYBODY on the planet, male or female, who doesn’t take responsibility for their behaviors, is basically a liar about reality and therefore sins relentlessly against most everybody around them – male or female. That this avoidance of truth-seeking, truth-seeing, and truth-telling is primarily (as you imply) a female sin, is an interesting speculation. I tend to doubt it, and am now going to study the matter. My first step will be to take it up with 6 family counselors I know, 4 who are women and 2 who are men. I promise to write you about what I find out. Give me a couple of months, please.</em></p><p>Thank you for your self-restraint and decision to approach the matter constructively.  I’ll be quite interested to hear the results of your little investigation.  However, I am sure that plenty of men also seek to avoid responsibility.  Just look at all the fatherless children, for one thing, and stoners living in their parent’s basement.  But logically, there are three possibilities:</p><p>1.  Men try harder to avoid responsibility<br> <br>2.  Women try harder to avoid responsibility<br> <br>3.  Both men and women try equally hard to avoid responsibility</br></br></br></br></p><p>Those are the three options.  I don’t find (3) to be remotely credible.  My personal experience, which is admittedly only anecdotal, strongly tends to lean towards (2).  To give one example, when I graduated from college, every single man in my class with whom I was acquainted already had a job.  Less than half of the women, all graduating from the same elite university, did.</p><p>I happen to believe that many women are worthy of respect that they do not receive.  I do not have a definitive answer for why they do not, I am merely attempting to suggest one possible solution that may help these women begin to receive the respect they deserve.  The key, of course, is to begin by understanding that not everyone is worthy of respect.  To suggest that everyone is so worthy does nothing but diminish the meaning of the word.  All we have the right to expect is polite civility and the chance to prove ourselves worthy of respect.</p></div>",
  "content_text": "CM writes:\nYou went the long speculative way around in order to get to your speculative, sort-of conclusion. It was a conclusion that left me frustrated, and so I decided to do something responsible about it, instead of: just whine, complain to a gurlll-frain or write you an unconstructive, insulting letter.  ANYBODY on the planet, male or female, who doesn’t take responsibility for their behaviors, is basically a liar about reality and therefore sins relentlessly against most everybody around them – male or female. That this avoidance of truth-seeking, truth-seeing, and truth-telling is primarily (as you imply) a female sin, is an interesting speculation. I tend to doubt it, and am now going to study the matter. My first step will be to take it up with 6 family counselors I know, 4 who are women and 2 who are men. I promise to write you about what I find out. Give me a couple of months, please.\nThank you for your self-restraint and decision to approach the matter constructively.  I’ll be quite interested to hear the results of your little investigation.  However, I am sure that plenty of men also seek to avoid responsibility.  Just look at all the fatherless children, for one thing, and stoners living in their parent’s basement.  But logically, there are three possibilities:\n1.  Men try harder to avoid responsibility\n2.  Women try harder to avoid responsibility\n3.  Both men and women try equally hard to avoid responsibility\nThose are the three options.  I don’t find (3) to be remotely credible.  My personal experience, which is admittedly only anecdotal, strongly tends to lean towards (2).  To give one example, when I graduated from college, every single man in my class with whom I was acquainted already had a job.  Less than half of the women, all graduating from the same elite university, did.\nI happen to believe that many women are worthy of respect that they do not receive.  I do not have a definitive answer for why they do not, I am merely attempting to suggest one possible solution that may help these women begin to receive the respect they deserve.  The key, of course, is to begin by understanding that not everyone is worthy of respect.  To suggest that everyone is so worthy does nothing but diminish the meaning of the word.  All we have the right to expect is polite civility and the chance to prove ourselves worthy of respect.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-09T10:18:00+00:00"
}