{
  "url": "https://voxday.net/2004/02/05/mailvox-notions-of-decline/",
  "scraped_at": "2025-12-13T15:47:22.146551",
  "title": "Mailvox: notions of decline",
  "date_display": "February 5, 2004",
  "date_iso": "2004-02-05T16:19:00+00:00",
  "date_from_url": "2004-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hank writes on homosexuality and Roman decline: <em>Speaking of false correlations here’s a great counter example. The rise of Christianity tracks the collapse of the Roman empire. Perhaps Christianity is the root of the collapse. I’d guess probably not, but they both share the same space of history so we could try and draw that kind of a ridiculous conclusion.</em></p><p>If you’d look at how the homosexual emperors were behaving, you’d better understand the notional relationship between the moral degradation and the imperial decline.  More than one emperor was murdered by his bodyguard because they couldn’t stomach his behavior, which didn’t contribute a great deal to political stability.  Edward II met a similar fate, as well, but he was an aberration for an English king.</p><p>I think my favorite example is this. “He [Elagabulus] impersonated the Great Mother in a lion-drawn chariot and publicly posed as the Venus Pudica, dropping to his knees with buttocks thrust before a male partner….  He had to be dissuaded from castrating himself, reluctantly accepting circumcision as a compromise.”   His reign didn’t last long or end well.  Gibbons writes: “he was massacred by the indignant Praetorians, his mutilated corpse dragged through the streets of the city, and thrown into the Tiber.”</p><p>I imagine that when our president begins behaving in like manner, total collapse won’t be too far off.  When you compare the first openly Christian emperor (Constantine) with the first openly homosexual emperor (Nero), you get an interesting picture of the different influences on the society.  (Yes, I know about Sulla and Caesar, but the first kept it hidden and wasn’t an emperor, in the case of the second there are only rumors and insults.  I’m not sure about Tiberius, but then, neither were the Romans.)</p><p>UPDATE: by the way, I’m quite certain that Christianity helped bring about the ultimate downfall of Rome.  Generally speaking, the intellectual freedom that Christianity can and has inspired in many individuals is not particularly conducive to totalitarian rule, which, no doubt, is why totalitarians tend to hate Christians and attempt to control the Church.  I personally view homosexuality as a mid-to-late stage symptom of societal decline, not a cause.</p></div>",
  "content_text": "Hank writes on homosexuality and Roman decline:\nSpeaking of false correlations here’s a great counter example. The rise of Christianity tracks the collapse of the Roman empire. Perhaps Christianity is the root of the collapse. I’d guess probably not, but they both share the same space of history so we could try and draw that kind of a ridiculous conclusion.\nIf you’d look at how the homosexual emperors were behaving, you’d better understand the notional relationship between the moral degradation and the imperial decline.  More than one emperor was murdered by his bodyguard because they couldn’t stomach his behavior, which didn’t contribute a great deal to political stability.  Edward II met a similar fate, as well, but he was an aberration for an English king.\nI think my favorite example is this. “He [Elagabulus] impersonated the Great Mother in a lion-drawn chariot and publicly posed as the Venus Pudica, dropping to his knees with buttocks thrust before a male partner….  He had to be dissuaded from castrating himself, reluctantly accepting circumcision as a compromise.”   His reign didn’t last long or end well.  Gibbons writes: “he was massacred by the indignant Praetorians, his mutilated corpse dragged through the streets of the city, and thrown into the Tiber.”\nI imagine that when our president begins behaving in like manner, total collapse won’t be too far off.  When you compare the first openly Christian emperor (Constantine) with the first openly homosexual emperor (Nero), you get an interesting picture of the different influences on the society.  (Yes, I know about Sulla and Caesar, but the first kept it hidden and wasn’t an emperor, in the case of the second there are only rumors and insults.  I’m not sure about Tiberius, but then, neither were the Romans.)\nUPDATE: by the way, I’m quite certain that Christianity helped bring about the ultimate downfall of Rome.  Generally speaking, the intellectual freedom that Christianity can and has inspired in many individuals is not particularly conducive to totalitarian rule, which, no doubt, is why totalitarians tend to hate Christians and attempt to control the Church.  I personally view homosexuality as a mid-to-late stage symptom of societal decline, not a cause.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-05T16:19:00+00:00"
}