{
  "url": "https://voxday.net/2004/02/05/mailvox-corrupt-judicial-syste/",
  "scraped_at": "2025-12-13T15:47:15.488157",
  "title": "Mailvox: the corrupt judicial system",
  "date_display": "February 5, 2004",
  "date_iso": "2004-02-05T08:28:00+00:00",
  "date_from_url": "2004-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DD comments in response to another reader’s declaration that prosecutors and judges are ambitious and out to “get their man”:<em> I’ve been a prosecutor for 15 years, long enough to lose any naivete. You’re dead wrong. Yes, there are a FEW individuals in those fields more concerned with their own cheap ambitions than justice. However, the overwhelming majority of cops, DAs and judges are honorable men and women who could earn much more money doing something far safer, but continue to do what they do because they want to make a difference. Don’t trash things about which you have no personal knowledge.</em></p><p>That’s an anecdotal attempt to fragantize the equine ejectus, DD, and it won’t stand up before those of us who do have personal knowledge.  Most judges are corrupt to the core and DA’s simply serve the interests of the State, not justice. In one case where I was assisting preparation, the judge overruled an objection when the Asst. DA began to offer testimony – they’re not allowed to, but no bar lawyer ever challenges them on this – because, as she said, although the plaintiff’s objection was technically correct, she was just gathering information and was going to admit the testimony because she wasn’t going to rule on it.  Then she granted the motion to dismiss on the sole basis of the testimony she’d just allowed in violation of the federal rules of court procedure.  Even worse, the “testimony” was blatantly false and the Asst. DA couldn’t even produce any witness because the only one was dead.  I have the transcript; even the judge in the subsequent lawsuit admitted that the hearing was a joke.</p><p>I was also the sole witness in an unrelated case where there was no question whatsoever about the wording of a contract, but the judge was too bored to care, so he decided it by flipping a coin.  Those have been my two personal experiences, also anecdotal, true, but my cynical view of the court system is backed up by the larger facts as well.</p><p>Judges routinely lie to the juries in their instructions to them, as permitted by the Supreme Court (Sparf v U.S. 156 U.S. 51, 1895), where “the U.S. Supreme Court ruled that although juries have the right to ignore a judge’s instructions on the law, the jury shouldn’t be aware of it.”   There’s also the whole sham of administrative courts, which are designed to look like real judicial courts, but get around the protections of the common law.  Which is why we have the “tax courts” and “child services courts” consisting of agents of those very services dressed up like judges and pretending to be impartial, whereas they are executive branch employees operating in overt defiance of the separation of powers doctrine.</p><p>And then, there’s “case law”, which judges use to redefine what the law says. For example, in one state, private property is only interpreted to mean “things that grow in the ground” thanks to one judge’s baseless declaration back in the 19th century.  There are hundreds of examples of this form of corruption.</p><p>The judicial system is entirely corrupt, from the United States Supreme Court down to the state district courts, which has the terrible effect of tainting the actions of even the most well-meaning people working within it.  I have sympathy for these individuals, but no respect for the system whatsoever.  Sure, there are good people working inside it; one of my  best and oldest friends is a high-powered attorney and I’ve lifted weights and done martial arts with friends who are cops for years.  Still, I have no doubt that there were plenty of nice, well-meaning people in the Waffen SS and the KGB too – I doubt they were doing what they did for the money either, but because they believed what they were told.  There has never been a police state without police, prosecutors and judges; history demonstrates that individuals in such professions are by no means worthy of a free pass based on their occupation, indeed, it tends to suggest precisely the opposite.</p><p>This isn’t to say that it is ambition that corrupts the people of the system, it’s just that most of those operating within it are not especially bright and have very little idea with regards to what the law actually says or what justice actually demands.  And yet, America’s hope may well rest on them, on people like Joe Banister, who are courageous enough to admit that they are a small cog in a vast and corrupt machine doing great injustice to the American people.</p></div>",
  "content_text": "DD comments in response to another reader’s declaration that prosecutors and judges are ambitious and out to “get their man”:\nI’ve been a prosecutor for 15 years, long enough to lose any naivete. You’re dead wrong. Yes, there are a FEW individuals in those fields more concerned with their own cheap ambitions than justice. However, the overwhelming majority of cops, DAs and judges are honorable men and women who could earn much more money doing something far safer, but continue to do what they do because they want to make a difference. Don’t trash things about which you have no personal knowledge.\nThat’s an anecdotal attempt to fragantize the equine ejectus, DD, and it won’t stand up before those of us who do have personal knowledge.  Most judges are corrupt to the core and DA’s simply serve the interests of the State, not justice. In one case where I was assisting preparation, the judge overruled an objection when the Asst. DA began to offer testimony – they’re not allowed to, but no bar lawyer ever challenges them on this – because, as she said, although the plaintiff’s objection was technically correct, she was just gathering information and was going to admit the testimony because she wasn’t going to rule on it.  Then she granted the motion to dismiss on the sole basis of the testimony she’d just allowed in violation of the federal rules of court procedure.  Even worse, the “testimony” was blatantly false and the Asst. DA couldn’t even produce any witness because the only one was dead.  I have the transcript; even the judge in the subsequent lawsuit admitted that the hearing was a joke.\nI was also the sole witness in an unrelated case where there was no question whatsoever about the wording of a contract, but the judge was too bored to care, so he decided it by flipping a coin.  Those have been my two personal experiences, also anecdotal, true, but my cynical view of the court system is backed up by the larger facts as well.\nJudges routinely lie to the juries in their instructions to them, as permitted by the Supreme Court (Sparf v U.S. 156 U.S. 51, 1895), where “the U.S. Supreme Court ruled that although juries have the right to ignore a judge’s instructions on the law, the jury shouldn’t be aware of it.”   There’s also the whole sham of administrative courts, which are designed to look like real judicial courts, but get around the protections of the common law.  Which is why we have the “tax courts” and “child services courts” consisting of agents of those very services dressed up like judges and pretending to be impartial, whereas they are executive branch employees operating in overt defiance of the separation of powers doctrine.\nAnd then, there’s “case law”, which judges use to redefine what the law says. For example, in one state, private property is only interpreted to mean “things that grow in the ground” thanks to one judge’s baseless declaration back in the 19th century.  There are hundreds of examples of this form of corruption.\nThe judicial system is entirely corrupt, from the United States Supreme Court down to the state district courts, which has the terrible effect of tainting the actions of even the most well-meaning people working within it.  I have sympathy for these individuals, but no respect for the system whatsoever.  Sure, there are good people working inside it; one of my  best and oldest friends is a high-powered attorney and I’ve lifted weights and done martial arts with friends who are cops for years.  Still, I have no doubt that there were plenty of nice, well-meaning people in the Waffen SS and the KGB too – I doubt they were doing what they did for the money either, but because they believed what they were told.  There has never been a police state without police, prosecutors and judges; history demonstrates that individuals in such professions are by no means worthy of a free pass based on their occupation, indeed, it tends to suggest precisely the opposite.\nThis isn’t to say that it is ambition that corrupts the people of the system, it’s just that most of those operating within it are not especially bright and have very little idea with regards to what the law actually says or what justice actually demands.  And yet, America’s hope may well rest on them, on people like Joe Banister, who are courageous enough to admit that they are a small cog in a vast and corrupt machine doing great injustice to the American people.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-05T08:28:00+00:00"
}