{
  "url": "https://voxday.net/2004/02/09/mailvox-hes-divorced-im-so-shocked/",
  "scraped_at": "2025-12-13T15:48:14.007916",
  "title": "Mailvox: He’s divorced?  I’m so shocked!",
  "date_display": "February 9, 2004",
  "date_iso": "2004-02-09T20:17:00+00:00",
  "date_from_url": "2004-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AW responds to today’s column: <em>“Indeed, one wonders that women have sex at all after plodding one’s way through this morass of marital misery.”  Because it’s the surest and simplest way to pay for your meal ticket if you have no other talents or skills.  As my first wife once said to me, “I don’t enjoy sex with you, I’ve never enjoyed sex with you, and now that I’ve got two kids, a house, and a new car, I don’t have to fake it any longer.”</em></p><p>“Perhaps women have been spoiled by a lifetime of freely saying things to others that would have earned a man doing the same a black eye.”  Backed up by legal system that operates on the principle, “First, handcuff the man.”  Never mind saying the most venomous things without fear of reprisal, even if she’s throwing crockery (see wife 1.0 again), it’s the man’s fault. The wonder is that more men don’t say “forget this” and decide to turn gay.  Or maybe this explains the remarkable strides made by a certain agenda in the last decade…</p><p>“People… who don’t need people… are the ha-a-appiest people.”<br> <br>– Dilbert</br></br></p></div>",
  "content_text": "AW responds to today’s column:\n“Indeed, one wonders that women have sex at all after plodding one’s way through this morass of marital misery.”  Because it’s the surest and simplest way to pay for your meal ticket if you have no other talents or skills.  As my first wife once said to me, “I don’t enjoy sex with you, I’ve never enjoyed sex with you, and now that I’ve got two kids, a house, and a new car, I don’t have to fake it any longer.”\n“Perhaps women have been spoiled by a lifetime of freely saying things to others that would have earned a man doing the same a black eye.”  Backed up by legal system that operates on the principle, “First, handcuff the man.”  Never mind saying the most venomous things without fear of reprisal, even if she’s throwing crockery (see wife 1.0 again), it’s the man’s fault. The wonder is that more men don’t say “forget this” and decide to turn gay.  Or maybe this explains the remarkable strides made by a certain agenda in the last decade…\n“People… who don’t need people… are the ha-a-appiest people.”\n– Dilbert",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-09T20:17:00+00:00"
}