{
  "url": "https://voxday.net/2004/02/25/mailvox-leave-shadow-to-its-darkness/",
  "scraped_at": "2025-12-13T15:51:18.179098",
  "title": "Mailvox: leave the shadow to its darkness",
  "date_display": "February 25, 2004",
  "date_iso": "2004-02-25T20:32:00+00:00",
  "date_from_url": "2004-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JR writes: <em>we live in an era of small men and small minds. I see no point in engaging the culture. If any of you could offer me words of encouragment they would be greatly appreciated. My 7 and 4 year old boys are playing under my feet as I write this, the depression I feel about the world I am preparing them for is almost overwhelming at times.</em></p><p>Go see <strong>The Passion of the Christ</strong>.  You are thinking too much on that which required his sacrifice.  Remember that you serve him, not the world, and he is mightier than the one that is in the world.  Look to the light, never to the shadow.  As Nietzsche wisely said, stare too long into the Abyss, and soon, the Abyss stares back.</p><p>You are preparing your boys to claim their great birthright as the sons of God, to be men who will stand fearlessly in the gap in the service of the One King.  The fallen world will look on them in hate and fear, and tremble when it sees in them the One they serve.</p></div>",
  "content_text": "JR writes:\nwe live in an era of small men and small minds. I see no point in engaging the culture. If any of you could offer me words of encouragment they would be greatly appreciated. My 7 and 4 year old boys are playing under my feet as I write this, the depression I feel about the world I am preparing them for is almost overwhelming at times.\nGo see\nThe Passion of the Christ\n.  You are thinking too much on that which required his sacrifice.  Remember that you serve him, not the world, and he is mightier than the one that is in the world.  Look to the light, never to the shadow.  As Nietzsche wisely said, stare too long into the Abyss, and soon, the Abyss stares back.\nYou are preparing your boys to claim their great birthright as the sons of God, to be men who will stand fearlessly in the gap in the service of the One King.  The fallen world will look on them in hate and fear, and tremble when it sees in them the One they serve.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-25T20:32:00+00:00"
}