{
  "url": "https://voxday.net/2004/02/25/mailvox-its-always-microsofts-fau/",
  "scraped_at": "2025-12-13T15:51:08.253313",
  "title": "Mailvox: It’s always Microsoft’s fault",
  "date_display": "February 25, 2004",
  "date_iso": "2004-02-25T14:57:00+00:00",
  "date_from_url": "2004-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Double-M writes: <em>I really enjoy your stuff.  I use to identify myself as a Christian Republican, but your articles opened my eyes.  After a cataloging of my beliefs, I have changed to identify myself as a Christian Libertarian.  I try to read the blog everyday, but whenever I miss a couple of days I can’t read your past posts.  The blogspot will not show any information in the body that is below the links on the left side of the page. Is it a cause of Internet Explorer?</em></p><p>It sure is.  If you insist on sticking with the second-greatest servitor of the digital Devil, switch your text size to smallest and everything will work fine.  Alternatively, download Opera or Mozilla – you get pop-up blockers too, which is nice – and experience the problems nevermore.  Or, just make a habit of stopping by every day.  That’s okay too.</p><p>Oh, and according to Salon, that would make you a “self-styled Christian Libertarian”, by the way.  Welcome to the club.</p></div>",
  "content_text": "Double-M writes:\nI really enjoy your stuff.  I use to identify myself as a Christian Republican, but your articles opened my eyes.  After a cataloging of my beliefs, I have changed to identify myself as a Christian Libertarian.  I try to read the blog everyday, but whenever I miss a couple of days I can’t read your past posts.  The blogspot will not show any information in the body that is below the links on the left side of the page. Is it a cause of Internet Explorer?\nIt sure is.  If you insist on sticking with the second-greatest servitor of the digital Devil, switch your text size to smallest and everything will work fine.  Alternatively, download Opera or Mozilla – you get pop-up blockers too, which is nice – and experience the problems nevermore.  Or, just make a habit of stopping by every day.  That’s okay too.\nOh, and according to Salon, that would make you a “self-styled Christian Libertarian”, by the way.  Welcome to the club.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-25T14:57:00+00:00"
}