{
  "url": "https://voxday.net/2004/02/15/mailvox-on-beauty/",
  "scraped_at": "2025-12-13T15:49:19.303113",
  "title": "Mailvox: On beauty",
  "date_display": "February 15, 2004",
  "date_iso": "2004-02-15T12:39:00+00:00",
  "date_from_url": "2004-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sarah comments: <em>All I meant to say though is that standards for ‘beauty’ are relative….  You see, there is a continuum:  Ugly (sorry for not being PC), Unattractive, Plain, Pretty, Beautiful </em></p><p>I disagree.  While there are fads in beauty, to say that standards are relative is to destroy the concept entirely.  I’d no more accept the notion here than I would with regards to morality.  Nor is there any need to qualify things such as inner and outer beauty, that’s just the weasel’s way of trying to avoid what can be a prickly subject as we have a perfectly good words to use in the case of the former concept that don’t require corrupting the language.  As Hayek points out with regards to social justice, any concept which requires an adjective to modify the noun is by definition something fundamentally different than the noun in its properly understood form.</p><p>While the Romans may have written odes to the character and fortitude of Cornelia, mother of the Gracchi, there’s a reason that oceans of ink have been spilled in praise of the exterior qualities of women throughout the ages.  This isn’t to say that beauty is the only thing worth pursuing in a woman – far from it – but I despise the notion that one cannot or should not speak honestly about something that is obvious to everyone.  Standards in beauty do change, but slowly, over generations.  At any given point in time, I think we can speak about beauty in the same manner that we speak of anything else that is widely and well understood.  This is just my opinion, but I tend to see feminine pulchritude breaking down in the following manner:</p><p>Flawless: Helen of Troy 1000-ship launching.  Cheryl Tiegs, Veronika Verikova<br> <br>Gorgeous: Almost perfect.  Stunning.  Michelle Pfeiffer, Bai Ling<br> <br>Beautiful: Far above the norm.  Eye-catching.  Sandra Bullock, Gwyneth Paltrow<br> <br>Pretty: Mostly good, often one great feature.  Anna Kournikova, Uma Thurmon<br> <br>Cute: More good than bad.  Jeanine Garofalo, Laura Bush<br> <br>Plain: Nondescript.  No particularly good or bad features.  Kerry’s <a href=\"http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2004/02/15/wus15.xml&amp;sSheet=/portal/2004/02/15/ixportaltop.html\">purported amorressa</a><br> <br>Unattractive: Okay, with one bad feature.  Hilllary Clinton and her Tree Trunks of Doom<br> <br>Ugly:  Not much good, multiple bad features.  Donna Shalala.  Any woman whose description contains the adjective “bulldog”.<br> <br>Scary: Nothing good, mostly bad features.   Janet Reno<br> <br>Oh Sweet Moses, You Poor Thing: a false lead on the genetics tree.  Helen Thomas of UPI</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Space Bunny denies, denies, denies that she looks anything like a blonde Sandra Bullock, but that argument sank like the USS Arizona when my father, who sees about one movie per decade and knows absolutely nothing about Hollywood celebrities, came over one day and told us, “you know, your mother took me to a movie and there was this girl in it who looked exactly like you.”  Sure enough, Mom had dragged him off to see <em>Miss Congeniality</em>.</p><p>Not that it’s her only virtue, but I think she’s beautiful, anyhow.</p><p><em>NOTE – hey, it’s the weekend and there’s no football.  Do you seriously want another raging debate on abortion, gay marriage or strict literal constructionalism?</em></p></div>",
  "content_text": "Sarah comments:\nAll I meant to say though is that standards for ‘beauty’ are relative….  You see, there is a continuum:  Ugly (sorry for not being PC), Unattractive, Plain, Pretty, Beautiful\nI disagree.  While there are fads in beauty, to say that standards are relative is to destroy the concept entirely.  I’d no more accept the notion here than I would with regards to morality.  Nor is there any need to qualify things such as inner and outer beauty, that’s just the weasel’s way of trying to avoid what can be a prickly subject as we have a perfectly good words to use in the case of the former concept that don’t require corrupting the language.  As Hayek points out with regards to social justice, any concept which requires an adjective to modify the noun is by definition something fundamentally different than the noun in its properly understood form.\nWhile the Romans may have written odes to the character and fortitude of Cornelia, mother of the Gracchi, there’s a reason that oceans of ink have been spilled in praise of the exterior qualities of women throughout the ages.  This isn’t to say that beauty is the only thing worth pursuing in a woman – far from it – but I despise the notion that one cannot or should not speak honestly about something that is obvious to everyone.  Standards in beauty do change, but slowly, over generations.  At any given point in time, I think we can speak about beauty in the same manner that we speak of anything else that is widely and well understood.  This is just my opinion, but I tend to see feminine pulchritude breaking down in the following manner:\nFlawless: Helen of Troy 1000-ship launching.  Cheryl Tiegs, Veronika Verikova\nGorgeous: Almost perfect.  Stunning.  Michelle Pfeiffer, Bai Ling\nBeautiful: Far above the norm.  Eye-catching.  Sandra Bullock, Gwyneth Paltrow\nPretty: Mostly good, often one great feature.  Anna Kournikova, Uma Thurmon\nCute: More good than bad.  Jeanine Garofalo, Laura Bush\nPlain: Nondescript.  No particularly good or bad features.  Kerry’s\npurported amorressa\nUnattractive: Okay, with one bad feature.  Hilllary Clinton and her Tree Trunks of Doom\nUgly:  Not much good, multiple bad features.  Donna Shalala.  Any woman whose description contains the adjective “bulldog”.\nScary: Nothing good, mostly bad features.   Janet Reno\nOh Sweet Moses, You Poor Thing: a false lead on the genetics tree.  Helen Thomas of UPI\nSpace Bunny denies, denies, denies that she looks anything like a blonde Sandra Bullock, but that argument sank like the USS Arizona when my father, who sees about one movie per decade and knows absolutely nothing about Hollywood celebrities, came over one day and told us, “you know, your mother took me to a movie and there was this girl in it who looked exactly like you.”  Sure enough, Mom had dragged him off to see\nMiss Congeniality\n.\nNot that it’s her only virtue, but I think she’s beautiful, anyhow.\nNOTE – hey, it’s the weekend and there’s no football.  Do you seriously want another raging debate on abortion, gay marriage or strict literal constructionalism?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-15T12:39:00+00:00"
}