{
  "url": "https://voxday.net/2004/02/24/mailvox-another-fallacy/",
  "scraped_at": "2025-12-13T15:50:54.849848",
  "title": "Mailvox: another fallacy",
  "date_display": "February 24, 2004",
  "date_iso": "2004-02-24T18:50:00+00:00",
  "date_from_url": "2004-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>EB writes: <em>Vox I think you are making the Isolationist mistake. As much as Woodrow Wilson’s notions of Global Order were misguided so is the polar opposite idea of total foreign isolation. WWII and the rise of Hitler are perfect examples of how ignoring the problems of the world generally comes back to haunt us. If we leave Iraq and Afghanistan now the worst the islamofacist world has to offer will seize power. Instead of millions of allies we will have created millions of fanatical enemies. On top of that we will be making the same mistake Clinton did in Somolia. </em></p><p>If we were seriously concerned about ending future problems, we’d be invading France, Holland and Denmark.  Islamic domination there will cause far more problems than where it has been established for 1300 years.  Secondly, to conflate Iraq with Somalia is such an exaggeration as to border on complete intellectual dishonesty.  Cutting and running after doing nothing but feeding a few people is hardly the same thing as pulling out after completely decapitating an entire regime after militarily conquering the whole country.  Col. Qaddafi did not start quaking in his boots after Somalia, he did after Iraq.  The message, such as it is, has been sent.  It is the continuing occupation and not what should have been a victorious withdrawal that risks diluting it.</p><p>Furthermore, to suggest that Hitler wouldn’t have risen to power if the US had been more involved in Germany reveals an almost complete ignorance of the post-WWI situation.  The problem in Germany was not a dearth of international involvement; Hitler’s rise fed off an understandable hatred of the crushing French-led international economic abuse of Germany that followed the war.</p></div>",
  "content_text": "EB writes:\nVox I think you are making the Isolationist mistake. As much as Woodrow Wilson’s notions of Global Order were misguided so is the polar opposite idea of total foreign isolation. WWII and the rise of Hitler are perfect examples of how ignoring the problems of the world generally comes back to haunt us. If we leave Iraq and Afghanistan now the worst the islamofacist world has to offer will seize power. Instead of millions of allies we will have created millions of fanatical enemies. On top of that we will be making the same mistake Clinton did in Somolia.\nIf we were seriously concerned about ending future problems, we’d be invading France, Holland and Denmark.  Islamic domination there will cause far more problems than where it has been established for 1300 years.  Secondly, to conflate Iraq with Somalia is such an exaggeration as to border on complete intellectual dishonesty.  Cutting and running after doing nothing but feeding a few people is hardly the same thing as pulling out after completely decapitating an entire regime after militarily conquering the whole country.  Col. Qaddafi did not start quaking in his boots after Somalia, he did after Iraq.  The message, such as it is, has been sent.  It is the continuing occupation and not what should have been a victorious withdrawal that risks diluting it.\nFurthermore, to suggest that Hitler wouldn’t have risen to power if the US had been more involved in Germany reveals an almost complete ignorance of the post-WWI situation.  The problem in Germany was not a dearth of international involvement; Hitler’s rise fed off an understandable hatred of the crushing French-led international economic abuse of Germany that followed the war.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-24T18:50:00+00:00"
}