{
  "url": "https://voxday.net/2004/02/02/mailvox-ribbit-quoth-people/",
  "scraped_at": "2025-12-13T15:46:42.661756",
  "title": "Mailvox: Ribbit, quoth the people",
  "date_display": "February 2, 2004",
  "date_iso": "2004-02-02T16:10:00+00:00",
  "date_from_url": "2004-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>GM writes: <em>I can only find one thing to disagree with in your column, “A Legacy of Betrayal.”  Power used badly is not useless, it is evil.  Otherwise, you have hit the nail on the head.  I’ve tried explaining Republican behavior to conservatives by using the analogy of “boiling the frog”.  The Democrats always try to drop the frog into boiling water, as in the first two years of the Clinton administration when they raised taxes, passed the Brady Bill and attempted to instantly socialize our medical care system, all at once.  Came 1994 and the frog jumped out of the pot.  The Republicans picked the little fella up and slipped him into a pot of nice, cool Republican water.  Then they began to increase the temperature gradually with bills like Kennedy-Kassebaum and Kennedy-Hatch, passing Hillary’s health care plan piecemeal, so’s the frog didn’t notice.  George Delano has gotten the frog up to about medium rare, and the frog thinks everything’s fine.  If you want Socialism done right, vote GOP.</em></p><p>I actually get far more of these sorts of emails from Republicans and conservatives than the previous sort.  Nor am I the only one, as even the whore doggies are getting a little nervous about the marked lack of enthusiasm for George Delano.  I don’t think it will be enough for Kerry to win, but it might help the Libertarians and Constitutionals to hit new records.  And if it is enough for Kerry to win, so be it, perhaps the frog will be galvanized to leap out of the pot.  In any case, sacrificing principles for pragmatism deserves to be punished.</p></div>",
  "content_text": "GM writes:\nI can only find one thing to disagree with in your column, “A Legacy of Betrayal.”  Power used badly is not useless, it is evil.  Otherwise, you have hit the nail on the head.  I’ve tried explaining Republican behavior to conservatives by using the analogy of “boiling the frog”.  The Democrats always try to drop the frog into boiling water, as in the first two years of the Clinton administration when they raised taxes, passed the Brady Bill and attempted to instantly socialize our medical care system, all at once.  Came 1994 and the frog jumped out of the pot.  The Republicans picked the little fella up and slipped him into a pot of nice, cool Republican water.  Then they began to increase the temperature gradually with bills like Kennedy-Kassebaum and Kennedy-Hatch, passing Hillary’s health care plan piecemeal, so’s the frog didn’t notice.  George Delano has gotten the frog up to about medium rare, and the frog thinks everything’s fine.  If you want Socialism done right, vote GOP.\nI actually get far more of these sorts of emails from Republicans and conservatives than the previous sort.  Nor am I the only one, as even the whore doggies are getting a little nervous about the marked lack of enthusiasm for George Delano.  I don’t think it will be enough for Kerry to win, but it might help the Libertarians and Constitutionals to hit new records.  And if it is enough for Kerry to win, so be it, perhaps the frog will be galvanized to leap out of the pot.  In any case, sacrificing principles for pragmatism deserves to be punished.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-02T16:10:00+00:00"
}