{
  "url": "https://voxday.net/2004/02/04/mailvox-another-easy-one/",
  "scraped_at": "2025-12-13T15:47:11.808431",
  "title": "Mailvox: Another easy one",
  "date_display": "February 4, 2004",
  "date_iso": "2004-02-04T15:59:00+00:00",
  "date_from_url": "2004-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AW writes: <em>Since you are a Christian, how do you reconcile the idea of a literal hell with a loving God. I am not trying to provoke a debate, or anything of that nature. Rather, I am (was) a Christian myself, who is struggling heavily with my faith because of this. As I read the Bible, hell is a place of torture, and I just don’t get it. It isn’t the idea of separation from God that causes me problems, but the idea of people being tortured for eternity because of temporal crimes, or bad decisions. I realize you don’t hold yourself up as a theological teacher, but since you are a person whose opinions I respect, I was just hoping to get your take or possibly a book you can recommend that discusses this issue. </em></p><p>Evolution, drugs and now Hell… and here I was hoping for something more on the order of: Janet Jackson, over or under the muscle?</p><p>Anyhow, let me first state that a) I don’t actually know anything about this; b) neither does anyone else; c) there is information in the Bible, which also states that no one is capable of understanding these things clearly.  Nor am I a professional theologian, then again, I actually believe in God.  Keep your expectations low, as I’m flying free here.  Please note that assuming many Christian postulates are required to play here; atheist friends, please save the “I don’t believe X anyhow” for another post.</p><p>First, I think it’s important to keep in mind that our opinions are utterly irrelevant.  Either God and Hell exist or they do not.  The truth is what it is, so even if God is a cruel, malicious psychopath who gets His rocks off by seeing humans spin their wheels, fail, die and burn forever, it is arguably in your best eternal interest to stay on His good side.  Believe or don’t believe, but don’t disbelieve because you don’t like what you perceive to be the truth. That’s just stupid ostrichism unless you’re actually willing to pay that inestimable price.  Given that most people behave like craven sheep when threatened by an audit, I find it very difficult to believe that anyone is seriously interested in going to the mat – or rather, the Pit, over this principle.</p><p>Now, I don’t think that’s actually the case.  The deeper problem, I think, stems from the notion that a loving, all-powerful God is some sort of control freak.  I’m not a Biblical scholar, but I’m reasonably well read in the Scriptures and I’ve yet to read anything to indicate that supports a broad view that God is minutely managing everything.  Whereas, to the contrary, there are many examples suggesting that we and the angels have tremendous free will and power.  Jesus never disputed that Satan had the power to offer him all the kingdoms of the world, and both he and Paul referred to the Prince of the World, indicating that it is not God who rules over the Earth, but Satan.  This is why CS Lewis referred to the concept of the Divine Invasion, which is present in both the Chronicles of Narnia and the Space Trilogy.  A winter land, a shadowed planet, taken over and ruled by evil, which God must invade in order to begin restoring his original ideal.</p><p>As spirits, we have an eternal component which has been tainted by this shadow, and without being cleansed by the blood of the Lamb, we cannot approach the presence of God.  Valuing free will, God does not force us to be cleansed, but merely offers such cleansing to us.  There’s a lot of theories about Hell, of course, but since I suspect that God exists outside of the space-time continuum, it is possible that our spirits will also exist outside the space-time continuum.  Since we know nothing of it, it is possible that everything that is outside of God’s presence is nothing but chaos and fire, which the damned are sentenced to dwell since they cannot approach the order of God’s presence.  In this case, torture is not so much punishment as it is simply an inevitable result of a bad decision.  And we suffer the never-ending consequences for bad decisions all the time.  The mother who leaves her baby in the bathtub for ‘just a second”, the father who shoots at a flicker of movement that he thinks is a deer, the teenager who turns around to talk to his friend while he’s driving… I see nothing out of what appears to be the natural order in that concept.</p><p>I am not saying that any of this is the case, you understand, only that it is certainly possible to conceive of a reasonable scenario which permits the simultaneous existence of a loving God and an eternal Hell.  But in any case, as I mentioned before, I don’t think it actually matters from our point of view, except perhaps to assuage our feelings.  It’s very clear from the Bible that our task is not to understand God – which at any rate is as impossible for us as it is for the characters in a video game to understand the intentions of the designer – but to obey Him.</p></div>",
  "content_text": "AW writes:\nSince you are a Christian, how do you reconcile the idea of a literal hell with a loving God. I am not trying to provoke a debate, or anything of that nature. Rather, I am (was) a Christian myself, who is struggling heavily with my faith because of this. As I read the Bible, hell is a place of torture, and I just don’t get it. It isn’t the idea of separation from God that causes me problems, but the idea of people being tortured for eternity because of temporal crimes, or bad decisions. I realize you don’t hold yourself up as a theological teacher, but since you are a person whose opinions I respect, I was just hoping to get your take or possibly a book you can recommend that discusses this issue.\nEvolution, drugs and now Hell… and here I was hoping for something more on the order of: Janet Jackson, over or under the muscle?\nAnyhow, let me first state that a) I don’t actually know anything about this; b) neither does anyone else; c) there is information in the Bible, which also states that no one is capable of understanding these things clearly.  Nor am I a professional theologian, then again, I actually believe in God.  Keep your expectations low, as I’m flying free here.  Please note that assuming many Christian postulates are required to play here; atheist friends, please save the “I don’t believe X anyhow” for another post.\nFirst, I think it’s important to keep in mind that our opinions are utterly irrelevant.  Either God and Hell exist or they do not.  The truth is what it is, so even if God is a cruel, malicious psychopath who gets His rocks off by seeing humans spin their wheels, fail, die and burn forever, it is arguably in your best eternal interest to stay on His good side.  Believe or don’t believe, but don’t disbelieve because you don’t like what you perceive to be the truth. That’s just stupid ostrichism unless you’re actually willing to pay that inestimable price.  Given that most people behave like craven sheep when threatened by an audit, I find it very difficult to believe that anyone is seriously interested in going to the mat – or rather, the Pit, over this principle.\nNow, I don’t think that’s actually the case.  The deeper problem, I think, stems from the notion that a loving, all-powerful God is some sort of control freak.  I’m not a Biblical scholar, but I’m reasonably well read in the Scriptures and I’ve yet to read anything to indicate that supports a broad view that God is minutely managing everything.  Whereas, to the contrary, there are many examples suggesting that we and the angels have tremendous free will and power.  Jesus never disputed that Satan had the power to offer him all the kingdoms of the world, and both he and Paul referred to the Prince of the World, indicating that it is not God who rules over the Earth, but Satan.  This is why CS Lewis referred to the concept of the Divine Invasion, which is present in both the Chronicles of Narnia and the Space Trilogy.  A winter land, a shadowed planet, taken over and ruled by evil, which God must invade in order to begin restoring his original ideal.\nAs spirits, we have an eternal component which has been tainted by this shadow, and without being cleansed by the blood of the Lamb, we cannot approach the presence of God.  Valuing free will, God does not force us to be cleansed, but merely offers such cleansing to us.  There’s a lot of theories about Hell, of course, but since I suspect that God exists outside of the space-time continuum, it is possible that our spirits will also exist outside the space-time continuum.  Since we know nothing of it, it is possible that everything that is outside of God’s presence is nothing but chaos and fire, which the damned are sentenced to dwell since they cannot approach the order of God’s presence.  In this case, torture is not so much punishment as it is simply an inevitable result of a bad decision.  And we suffer the never-ending consequences for bad decisions all the time.  The mother who leaves her baby in the bathtub for ‘just a second”, the father who shoots at a flicker of movement that he thinks is a deer, the teenager who turns around to talk to his friend while he’s driving… I see nothing out of what appears to be the natural order in that concept.\nI am not saying that any of this is the case, you understand, only that it is certainly possible to conceive of a reasonable scenario which permits the simultaneous existence of a loving God and an eternal Hell.  But in any case, as I mentioned before, I don’t think it actually matters from our point of view, except perhaps to assuage our feelings.  It’s very clear from the Bible that our task is not to understand God – which at any rate is as impossible for us as it is for the characters in a video game to understand the intentions of the designer – but to obey Him.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-04T15:59:00+00:00"
}