{
  "url": "https://voxday.net/2004/02/05/marriage-and-state-2/",
  "scraped_at": "2025-12-13T15:47:20.282398",
  "title": "Marriage and the State",
  "date_display": "February 5, 2004",
  "date_iso": "2004-02-05T15:34:00+00:00",
  "date_from_url": "2004-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stanley Kurtz defends marriage: <em>Because marriage is deeply implicated in the interests of children, it is a matter of public concern. Children are helpless. They depend upon adults. Over and above their parents, children depend upon society to create institutions that keep them from chaos. Children cannot articulate their needs. Children cannot vote. Yet children are society. They are us, and they are our future. That is why society has the right to give special support and encouragement to an institution that is necessary to the well being of children — even if that means special benefits for some, and not for others. The dependence intrinsic to human childhood is why unadulterated libertarianism can never work.</em></p><p>This is such a crock of illogic.  Like Stanley, I’m 100 percent opposed to the oxymoronic concept of “gay marriage”, but it’s ridiculous to state that unadulterated libertarianism can never work where marriage is concerned.  People were successfully married and raised children for thousands of years without state recognition.</p><p>Doesn’t anyone read history anymore?</p><p>He does, however, provide interesting evidence that common estimates of the gay population are wildly exaggerated: <em>we are dealing with a strikingly small population — too small to draw clear conclusions. In Norway, same-sex registered partnerships form only .68 percent as often as heterosexual marriages. In Sweden, registered partnerships form only .55 percent as often as heterosexual marriages (i.e. about one half of 1 percent as often).</em></p><p>So much for the ten percent theory.  I never bought that for a second anyhow.  And this is in Scandinavia, where men are even less likely to marry the mothers of their children than in America.</p></div>",
  "content_text": "Stanley Kurtz defends marriage:\nBecause marriage is deeply implicated in the interests of children, it is a matter of public concern. Children are helpless. They depend upon adults. Over and above their parents, children depend upon society to create institutions that keep them from chaos. Children cannot articulate their needs. Children cannot vote. Yet children are society. They are us, and they are our future. That is why society has the right to give special support and encouragement to an institution that is necessary to the well being of children — even if that means special benefits for some, and not for others. The dependence intrinsic to human childhood is why unadulterated libertarianism can never work.\nThis is such a crock of illogic.  Like Stanley, I’m 100 percent opposed to the oxymoronic concept of “gay marriage”, but it’s ridiculous to state that unadulterated libertarianism can never work where marriage is concerned.  People were successfully married and raised children for thousands of years without state recognition.\nDoesn’t anyone read history anymore?\nHe does, however, provide interesting evidence that common estimates of the gay population are wildly exaggerated:\nwe are dealing with a strikingly small population — too small to draw clear conclusions. In Norway, same-sex registered partnerships form only .68 percent as often as heterosexual marriages. In Sweden, registered partnerships form only .55 percent as often as heterosexual marriages (i.e. about one half of 1 percent as often).\nSo much for the ten percent theory.  I never bought that for a second anyhow.  And this is in Scandinavia, where men are even less likely to marry the mothers of their children than in America.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-05T15:34:00+00:00"
}