{
  "url": "https://voxday.net/2004/02/16/maybe-she-did-do-i/",
  "scraped_at": "2025-12-13T15:49:24.467405",
  "title": "Maybe she did do it",
  "date_display": "February 16, 2004",
  "date_iso": "2004-02-16T07:37:00+00:00",
  "date_from_url": "2004-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>WND writes: <em>Meanwhile, Misha Schubert, a former classmate of Polier from the Columbia School of Journalism, says it’s hard to believe the allegations of an affair between Polier and Kerry.  “For one thing,” writes Schubert in today’s Australian, “at the time my former journalism-school classmate was supposed to be sharing intimate moments with the senator, she was working up to 80 hours a week on student assignments and dating one of our classmates. If she had time to manage an affair as well, that would have made her one hell of an overachiever.” </em></p><p>That’s the lamest excuse I’ve ever heard.  First, people can always find the time to get jiggy if they’re so inclined.  They’ll run themselves down and do without sleep if they have to.  Second, no student at any school puts in 80 hours a week doing anything with the possible exception of med-school students.  I knew business school students who still had the time to road-trip to Mexico; considering how little most journalists know, I rather doubt she spent 80 hours a semester working on anything.</p></div>",
  "content_text": "WND writes:\nMeanwhile, Misha Schubert, a former classmate of Polier from the Columbia School of Journalism, says it’s hard to believe the allegations of an affair between Polier and Kerry.  “For one thing,” writes Schubert in today’s Australian, “at the time my former journalism-school classmate was supposed to be sharing intimate moments with the senator, she was working up to 80 hours a week on student assignments and dating one of our classmates. If she had time to manage an affair as well, that would have made her one hell of an overachiever.”\nThat’s the lamest excuse I’ve ever heard.  First, people can always find the time to get jiggy if they’re so inclined.  They’ll run themselves down and do without sleep if they have to.  Second, no student at any school puts in 80 hours a week doing anything with the possible exception of med-school students.  I knew business school students who still had the time to road-trip to Mexico; considering how little most journalists know, I rather doubt she spent 80 hours a semester working on anything.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-16T07:37:00+00:00"
}