{
  "url": "https://voxday.net/2004/02/11/mind-boggles-2/",
  "scraped_at": "2025-12-13T15:48:34.981926",
  "title": "The mind boggles",
  "date_display": "February 11, 2004",
  "date_iso": "2004-02-11T11:37:00+00:00",
  "date_from_url": "2004-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Another <a href=\"http://startribune.com/stories/789/4369580.html\">major security hole</a> in Windows.   Good thing they don’t use that shoddy Open Source method of designing software.  The amazing thing is that it’s these jokers who are sowing Fear Uncertainty and Doubt about Linux, and people are buying it.  Meanwhile, their cryptography is actually based on the flawed code.  If you wrote this into a novel, no one would believe you for the irony.</p><p>Linux is perhaps the ultimate demonstration that people are really, honestly and truly stupid, viewed in the collective.  To paraphrase Neal Stephenson: why would you want to pay a lot of money to drive a leaky station wagon that breaks down all the time when you can drive this here tank for free?  Because you don’t know how to fix a tank?  You don’t know how to fix the station wagon either!</p><p>I’m not saying Linux is perfect.  I’m not saying OpenOffice is perfect.  Both have a long ways to go before they become the obvious choice for the quasi computer illiterate.  But considering the huge number of problems with Windows and the enormous price-differential between it and Linux, I find it simply staggering that many people won’t even consider making the migration.</p></div>",
  "content_text": "Another\nmajor security hole\nin Windows.   Good thing they don’t use that shoddy Open Source method of designing software.  The amazing thing is that it’s these jokers who are sowing Fear Uncertainty and Doubt about Linux, and people are buying it.  Meanwhile, their cryptography is actually based on the flawed code.  If you wrote this into a novel, no one would believe you for the irony.\nLinux is perhaps the ultimate demonstration that people are really, honestly and truly stupid, viewed in the collective.  To paraphrase Neal Stephenson: why would you want to pay a lot of money to drive a leaky station wagon that breaks down all the time when you can drive this here tank for free?  Because you don’t know how to fix a tank?  You don’t know how to fix the station wagon either!\nI’m not saying Linux is perfect.  I’m not saying OpenOffice is perfect.  Both have a long ways to go before they become the obvious choice for the quasi computer illiterate.  But considering the huge number of problems with Windows and the enormous price-differential between it and Linux, I find it simply staggering that many people won’t even consider making the migration.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-11T11:37:00+00:00"
}