{
  "url": "https://voxday.net/2004/02/01/mysterious-motives/",
  "scraped_at": "2025-12-13T15:46:26.818916",
  "title": "Mysterious motives",
  "date_display": "February 1, 2004",
  "date_iso": "2004-02-01T11:48:00+00:00",
  "date_from_url": "2004-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Washington Times: <em>Leaders in the legal arena even have signaled that they would like to see divorce expanded to include unmarried couples who break up.  In 2002, the American Law Institute (ALI) said in a report that domestic partners often live together for a long time and share parenting duties, a residence and other assets.  When such relationships end, they should be treated like a divorce, with alimony assigned to one ex-partner and property divided the same as marital assets, said authors of the ALI report, “Principles of the Law of Family Dissolution: Analysis and Recommendations.” The new policy should apply to unmarried heterosexual couples and homosexual couples, the ALI said. </em></p><p>Why on Earth would non-marital relationships be treated like a marriage upon dissolution?  Unlike a marriage, there’s no inherent contract that’s been broken, and therefore no claims to be made.  Which is quite often the entire point of not getting married in the first place.  Of course, non-marital divorce would generate a lot of work for lawyers….</p></div>",
  "content_text": "The Washington Times:\nLeaders in the legal arena even have signaled that they would like to see divorce expanded to include unmarried couples who break up.  In 2002, the American Law Institute (ALI) said in a report that domestic partners often live together for a long time and share parenting duties, a residence and other assets.  When such relationships end, they should be treated like a divorce, with alimony assigned to one ex-partner and property divided the same as marital assets, said authors of the ALI report, “Principles of the Law of Family Dissolution: Analysis and Recommendations.” The new policy should apply to unmarried heterosexual couples and homosexual couples, the ALI said.\nWhy on Earth would non-marital relationships be treated like a marriage upon dissolution?  Unlike a marriage, there’s no inherent contract that’s been broken, and therefore no claims to be made.  Which is quite often the entire point of not getting married in the first place.  Of course, non-marital divorce would generate a lot of work for lawyers….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-01T11:48:00+00:00"
}