{
  "url": "https://voxday.net/2004/02/03/new-fave/",
  "scraped_at": "2025-12-13T15:46:59.251660",
  "title": "A new fave",
  "date_display": "February 3, 2004",
  "date_iso": "2004-02-03T15:46:00+00:00",
  "date_from_url": "2004-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As most of you know, I have no fear of the Left, being more steeped in its foundations than most of its advocates and devotees.  Thus, I often find Eponymous to be rather humorous, and to be honest, he deserved a link just for the <a href=\"http://blogs.salon.com/0002874/stories/2003/11/22/annCoultersBeautySecret.html\">Ann Coulter as vampire countess</a> alone.  I even tend to agree with him on the nightmarish Meghan Gurdon columns on NRO, which make my eyeballs feel as if they’re bleeding on the few occasions I’ve troubled to read them.</p><p>He’s generally not inclined to take me on, unfortunately, and his readers are about as intellectually sophisticated as you’d imagine, but he is the one funny left-wing blogger that I’ve encountered.  Sure, the obsession with who Ben Shapiro and Kyle Williams are not sleeping with gets old, but one must give credit where credit is due and I happen to find it amusing.  Maybe you won’t, but hey, it’s my blog.</p><p>UPDATE – Apparently he is a she.  I was under the mistaken impression that Eponymous was a homosexual he.</p></div>",
  "content_text": "As most of you know, I have no fear of the Left, being more steeped in its foundations than most of its advocates and devotees.  Thus, I often find Eponymous to be rather humorous, and to be honest, he deserved a link just for the\nAnn Coulter as vampire countess\nalone.  I even tend to agree with him on the nightmarish Meghan Gurdon columns on NRO, which make my eyeballs feel as if they’re bleeding on the few occasions I’ve troubled to read them.\nHe’s generally not inclined to take me on, unfortunately, and his readers are about as intellectually sophisticated as you’d imagine, but he is the one funny left-wing blogger that I’ve encountered.  Sure, the obsession with who Ben Shapiro and Kyle Williams are not sleeping with gets old, but one must give credit where credit is due and I happen to find it amusing.  Maybe you won’t, but hey, it’s my blog.\nUPDATE – Apparently he is a she.  I was under the mistaken impression that Eponymous was a homosexual he.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-03T15:46:00+00:00"
}