{
  "url": "https://voxday.net/2004/02/28/no-fear/",
  "scraped_at": "2025-12-13T15:51:42.501767",
  "title": "No fear",
  "date_display": "February 28, 2004",
  "date_iso": "2004-02-28T16:03:00+00:00",
  "date_from_url": "2004-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ezra comments: <em>I fear this movie will simply give a huge amount of guilt to those unbelievers who watch it, feeling this remorse for “doing that terrible thing to Christ” and cause them to therefore think they can and should take some sort of action to make reparations to God. That would miss the point entirely that Christ died (and RESURRECTED) because the hope of reparations is futile!</em></p><p>No guilt, no repentance.  No repentance, no salvation.  There is a specific action that an unbeliever needs to take.  I have no idea if anyone will be led to do so after seeing the movie, but of one thing I am absolutely sure.  God speaks to the heart in a myriad of ways.</p><p>I attended a Billy Graham crusade once out of curiousity after I had already become a Christian.  His speaking was uninspired, his message was an uninteresting take on the one that I had heard many, many times before.  I thought, well, it’s too bad that he’s gotten so old and has lost his fastball – in a mostly full football stadium, I would have been surprised to see more than ten or twenty people go forward.  I was quite startled when at least 10,000 people responded to the altar call.  Were they all genuine?  I have no idea, not being gifted with the ability to read hearts or minds.</p><p>But then I remembered a preacher who once said that he is nothing more than a conduit.  Tens of thousands of people pray before he preaches anywhere.  Hearts and spirits are prepared, and his simple words are simply the catalyst, a match thrown into the waiting gasoline vapors.</p></div>",
  "content_text": "Ezra comments:\nI fear this movie will simply give a huge amount of guilt to those unbelievers who watch it, feeling this remorse for “doing that terrible thing to Christ” and cause them to therefore think they can and should take some sort of action to make reparations to God. That would miss the point entirely that Christ died (and RESURRECTED) because the hope of reparations is futile!\nNo guilt, no repentance.  No repentance, no salvation.  There is a specific action that an unbeliever needs to take.  I have no idea if anyone will be led to do so after seeing the movie, but of one thing I am absolutely sure.  God speaks to the heart in a myriad of ways.\nI attended a Billy Graham crusade once out of curiousity after I had already become a Christian.  His speaking was uninspired, his message was an uninteresting take on the one that I had heard many, many times before.  I thought, well, it’s too bad that he’s gotten so old and has lost his fastball – in a mostly full football stadium, I would have been surprised to see more than ten or twenty people go forward.  I was quite startled when at least 10,000 people responded to the altar call.  Were they all genuine?  I have no idea, not being gifted with the ability to read hearts or minds.\nBut then I remembered a preacher who once said that he is nothing more than a conduit.  Tens of thousands of people pray before he preaches anywhere.  Hearts and spirits are prepared, and his simple words are simply the catalyst, a match thrown into the waiting gasoline vapors.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-28T16:03:00+00:00"
}