{
  "url": "https://voxday.net/2004/02/19/now-this-makes-me-shudder/",
  "scraped_at": "2025-12-13T15:50:08.383171",
  "title": "Now this makes me shudder",
  "date_display": "February 19, 2004",
  "date_iso": "2004-02-19T18:09:00+00:00",
  "date_from_url": "2004-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>K-Lo of NRO’s Corner quotes John Podhoretz and writes: <em>“America has done some extraordinary and wonderful things these past three years” under the leadership of George W. Bush. There are miles to go and there are things that have not gone quite right–or which some of us may disagree with for some very real reasons–but the accomplishments are substantial and critically important. </em></p><p>Now, if that doesn’t make you pull the lever for a third party, nothing will.  Increasing central government power faster than anyone since FDR, and there’s still miles to go?  Apparently George Delano isn’t the quasi-socialist I believe him to be, it seems he’ll settle for nothing less than outright communism.</p><p>The thing that bothers me most about George Delano isn’t the War on Terror, even though I have massive reservations about it and how he’s handled it.  I freely admit that there may well be aspects to it that we do not know and may never know – no, I assume there are.  But if he’s so focused on it, then why does he just hand everything else off to the Democrats?  Why not say, look, we’re declaring war, we’re in a war, and you’re either with us or against us.  Then abolish half of the Cabinet departments and slash domestic spending in half.  Or three-quarters, whatever.</p><p>But this war that isn’t a war and handing the Democrats their platform on a silver platter… I don’t buy it for a second.  Perhaps it’s George Delano, for all his clumsy diction and seeming average Joe-ness, and not the sophmoric Bill Clinton, who is the unusually good liar.</p></div>",
  "content_text": "K-Lo of NRO’s Corner quotes John Podhoretz and writes:\n“America has done some extraordinary and wonderful things these past three years” under the leadership of George W. Bush. There are miles to go and there are things that have not gone quite right–or which some of us may disagree with for some very real reasons–but the accomplishments are substantial and critically important.\nNow, if that doesn’t make you pull the lever for a third party, nothing will.  Increasing central government power faster than anyone since FDR, and there’s still miles to go?  Apparently George Delano isn’t the quasi-socialist I believe him to be, it seems he’ll settle for nothing less than outright communism.\nThe thing that bothers me most about George Delano isn’t the War on Terror, even though I have massive reservations about it and how he’s handled it.  I freely admit that there may well be aspects to it that we do not know and may never know – no, I assume there are.  But if he’s so focused on it, then why does he just hand everything else off to the Democrats?  Why not say, look, we’re declaring war, we’re in a war, and you’re either with us or against us.  Then abolish half of the Cabinet departments and slash domestic spending in half.  Or three-quarters, whatever.\nBut this war that isn’t a war and handing the Democrats their platform on a silver platter… I don’t buy it for a second.  Perhaps it’s George Delano, for all his clumsy diction and seeming average Joe-ness, and not the sophmoric Bill Clinton, who is the unusually good liar.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-19T18:09:00+00:00"
}