{
  "url": "https://voxday.net/2004/02/22/now-isnt-that-interesting/",
  "scraped_at": "2025-12-13T15:50:37.630070",
  "title": "Now, isn’t that interesting….",
  "date_display": "February 22, 2004",
  "date_iso": "2004-02-22T17:32:00+00:00",
  "date_from_url": "2004-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Maimonides writes:  “Jesus of Nazareth… impelled people to believe that he was a prophet sent by God to clarify perplexities in the Torah, and that he was the Messiah that was predicted by each and every seer. He interpreted the Torah and its precepts in such a fashion as to lead to their total annulment, to the abolition of all its commandments and to the violation of its prohibitions.  The sages, of blessed memory, having become aware of his plans before his reputation spread among our people, meted out fitting punishment to him.”</p><p>Clearly he’s anti-semitic!  Someone call Abie Foxman and the ADL!  Harvey Weinstein, get on the phone and start threatening publishers!  Wait, he’s a 12th century Jewish sage?  And then there’s this little passage from the Talmud, which apparently isn’t so concerned with precision that it can’t be judiciously edited when something becomes socially problematic.  Now, there’s an idea!  Wouldn’t life be a lot simpler now if we just got rid of those bits about God calling homosexuality an abomination in the Bible?</p><p><em>“On the eve of Passover they hung Jesus of Nazareth,” said the passage, which was censored in the 16th century to evade the wrath of Christians. “The herald went out before him for 40 days saying, ‘Jesus goes forth to be stoned, because he has practiced magic, enticed and led astray Israel. Anyone who knows anything in his favor, let him come and declare concerning him.’ And they found nothing in his favor.”</em></p><p>I’ve heard that Jews are supposed to be somewhat more prone to being self-hating than the norm, but this is ridiculous.  Either Mel Gibson and his movie are not anti-semitic, or the great Jewish philosophers and the Talmud itself are.  I suppose we <a href=\"http://www.sbcbaptistpress.org/bpfeature.asp?ID=1299\">should blame those doggone anti-semitic Southern Baptists</a> for pointing out these interesting little dichotomies.</p></div>",
  "content_text": "Maimonides writes:  “Jesus of Nazareth… impelled people to believe that he was a prophet sent by God to clarify perplexities in the Torah, and that he was the Messiah that was predicted by each and every seer. He interpreted the Torah and its precepts in such a fashion as to lead to their total annulment, to the abolition of all its commandments and to the violation of its prohibitions.  The sages, of blessed memory, having become aware of his plans before his reputation spread among our people, meted out fitting punishment to him.”\nClearly he’s anti-semitic!  Someone call Abie Foxman and the ADL!  Harvey Weinstein, get on the phone and start threatening publishers!  Wait, he’s a 12th century Jewish sage?  And then there’s this little passage from the Talmud, which apparently isn’t so concerned with precision that it can’t be judiciously edited when something becomes socially problematic.  Now, there’s an idea!  Wouldn’t life be a lot simpler now if we just got rid of those bits about God calling homosexuality an abomination in the Bible?\n“On the eve of Passover they hung Jesus of Nazareth,” said the passage, which was censored in the 16th century to evade the wrath of Christians. “The herald went out before him for 40 days saying, ‘Jesus goes forth to be stoned, because he has practiced magic, enticed and led astray Israel. Anyone who knows anything in his favor, let him come and declare concerning him.’ And they found nothing in his favor.”\nI’ve heard that Jews are supposed to be somewhat more prone to being self-hating than the norm, but this is ridiculous.  Either Mel Gibson and his movie are not anti-semitic, or the great Jewish philosophers and the Talmud itself are.  I suppose we\nshould blame those doggone anti-semitic Southern Baptists\nfor pointing out these interesting little dichotomies.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-22T17:32:00+00:00"
}