{
  "url": "https://voxday.net/2004/02/28/oh-go-read-history-book/",
  "scraped_at": "2025-12-13T15:51:33.707133",
  "title": "Oh, go read a history book",
  "date_display": "February 28, 2004",
  "date_iso": "2004-02-28T03:08:00+00:00",
  "date_from_url": "2004-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Si blathers: <em>The point is, people who readily believe calumnious stories with no evidence, simply because the stories fit their racial biases, are as racist as the anti-Semites they decry.</em></p><p>First, there was evidence of the media coverage, on WND and elsewhere.  That’s not definitive proof, but a reasonable point with which to make commentary.  If I were to fact-check everything on which I opine, I’d write one column a week, not make numerous daily blog posts.  Second, it didn’t fit my racial bias – Saudi is not a race – but it certainly did fit what I know of the kingdom based on past information from a friend who has had extensive dealings with it.</p><p>Si then reveals his etymological ignorance: <em>Perhaps his own brand of anti-semitism (since Arabs are, after all, Semites).</em> Anti-semitism has nothing to do with the Semitic racial group per se.  It is a word concocted by German Jew haters who were looking for a kinder, gentler expression more acceptable to the general German public than the traditional <em>judenhassen</em>.</p><p>You don’t have to hate Arabs to loathe the despicable governments that have ruled over them since the colonial era.  Plenty of Arabs hate them too, especially since most of the modern Arab countries are colonial legacies that have little to no relationship with the tribal boundaries delineated over many centuries.</p></div>",
  "content_text": "Si blathers:\nThe point is, people who readily believe calumnious stories with no evidence, simply because the stories fit their racial biases, are as racist as the anti-Semites they decry.\nFirst, there was evidence of the media coverage, on WND and elsewhere.  That’s not definitive proof, but a reasonable point with which to make commentary.  If I were to fact-check everything on which I opine, I’d write one column a week, not make numerous daily blog posts.  Second, it didn’t fit my racial bias – Saudi is not a race – but it certainly did fit what I know of the kingdom based on past information from a friend who has had extensive dealings with it.\nSi then reveals his etymological ignorance:\nPerhaps his own brand of anti-semitism (since Arabs are, after all, Semites).\nAnti-semitism has nothing to do with the Semitic racial group per se.  It is a word concocted by German Jew haters who were looking for a kinder, gentler expression more acceptable to the general German public than the traditional\njudenhassen\n.\nYou don’t have to hate Arabs to loathe the despicable governments that have ruled over them since the colonial era.  Plenty of Arabs hate them too, especially since most of the modern Arab countries are colonial legacies that have little to no relationship with the tribal boundaries delineated over many centuries.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-28T03:08:00+00:00"
}