{
  "url": "https://voxday.net/2004/02/04/oh-irony-4/",
  "scraped_at": "2025-12-13T15:47:13.625831",
  "title": "Oh, the irony",
  "date_display": "February 4, 2004",
  "date_iso": "2004-02-04T18:29:00+00:00",
  "date_from_url": "2004-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wired reports: <em>Jerome Armstrong, an Internet strategist for the Dean campaign and Moulitsas’ partner in a political consulting firm, <a href=\"http://www.wired.com/news/politics/0,1283,62049,00.html\">first encountered Yellin</a> on MyDD, his now-mothballed blog. Armstrong is clearly impressed by Yellin and fondly recalls the teenager’s first electoral effort.  “When Stephen ran for student council, he told me he had divided the school into interest groups, the jocks, the popular kids, etc., and tried to figure out where his support was and how to appeal to them,” said Armstrong. “He was applying political strategy to a high school race.”   Despite his political smarts, Yellin did not win a seat.   “I had a nice strategy,” said Yellin, “but I didn’t realize that the most popular people win, not the most competent.” </em></p><p>No doubt this kid will make a fantastic Democratic analyst, being so clueless that he lost his first school election.  Oh, how I loathe these young political types!  In my own dabblings in this sort of thing, I won both races I managed, one my own campaign for school vice-president in elementary school, the other for my friend who was running for senior class president his junior year of college.  The key to the first was realizing that all the very popular people were running for president, so I ran for VP, won, and discovered that I hated absolutely everything about school politics and the sort of kids who think they matter.   The kid who won the presidential election and is no doubt a Congressman by now won the hearts and minds of the electorate by promising longer recess.  In fifth grade!</p><p>The key to the second was working to my candidate’s strength.  He happened to be extraordinarily good-looking, so I arranged to get the Dean of Student’s login and password, used it to break into the university’s computer system and printed out a list of all the junior girls arranged by dorm and room number.  (Mass mailings through the university’s mail system weren’t possible and he was going up against the popular three-year incumbent).  We designed a little flyer that just basically said he was running underneath a big picture of him looking very handsome, all blond bangs, sculpted cheekbones and white teeth, then dropped a copy off under the doors of every junior girl on campus the night before the election.  We got about ten phone numbers apiece and he won in a landslide the next afternoon.</p><p>Lesson: you can never be too attractive, or too cynical.  Sometimes I miss not having a conscience.</p><p><em>This post brought to you courtesy of <a href=\"http://www.claywhittaker.com/\">Clay Whittaker</a></em></p></div>",
  "content_text": "Wired reports:\nJerome Armstrong, an Internet strategist for the Dean campaign and Moulitsas’ partner in a political consulting firm,\nfirst encountered Yellin\non MyDD, his now-mothballed blog. Armstrong is clearly impressed by Yellin and fondly recalls the teenager’s first electoral effort.  “When Stephen ran for student council, he told me he had divided the school into interest groups, the jocks, the popular kids, etc., and tried to figure out where his support was and how to appeal to them,” said Armstrong. “He was applying political strategy to a high school race.”   Despite his political smarts, Yellin did not win a seat.   “I had a nice strategy,” said Yellin, “but I didn’t realize that the most popular people win, not the most competent.”\nNo doubt this kid will make a fantastic Democratic analyst, being so clueless that he lost his first school election.  Oh, how I loathe these young political types!  In my own dabblings in this sort of thing, I won both races I managed, one my own campaign for school vice-president in elementary school, the other for my friend who was running for senior class president his junior year of college.  The key to the first was realizing that all the very popular people were running for president, so I ran for VP, won, and discovered that I hated absolutely everything about school politics and the sort of kids who think they matter.   The kid who won the presidential election and is no doubt a Congressman by now won the hearts and minds of the electorate by promising longer recess.  In fifth grade!\nThe key to the second was working to my candidate’s strength.  He happened to be extraordinarily good-looking, so I arranged to get the Dean of Student’s login and password, used it to break into the university’s computer system and printed out a list of all the junior girls arranged by dorm and room number.  (Mass mailings through the university’s mail system weren’t possible and he was going up against the popular three-year incumbent).  We designed a little flyer that just basically said he was running underneath a big picture of him looking very handsome, all blond bangs, sculpted cheekbones and white teeth, then dropped a copy off under the doors of every junior girl on campus the night before the election.  We got about ten phone numbers apiece and he won in a landslide the next afternoon.\nLesson: you can never be too attractive, or too cynical.  Sometimes I miss not having a conscience.\nThis post brought to you courtesy of\nClay Whittaker",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-04T18:29:00+00:00"
}