{
  "url": "https://voxday.net/2004/02/18/on-arts-martia/",
  "scraped_at": "2025-12-13T15:49:55.136255",
  "title": "On the arts martial",
  "date_display": "February 18, 2004",
  "date_iso": "2004-02-18T16:53:00+00:00",
  "date_from_url": "2004-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tonya writes: <em>now dern it, vox, you’re not keeping up with the comments.  yesterday in one of the comment threads several people (myself included) were clamoring for your expertise on which types of martial arts to look into.  and what do we get?  total freakin’ silence! </em></p><p>Sorry, I’ve just been under the weather for about ten days now with a viral bug and the very thought of exercise – which the doctor is forbidding – is tremendously frustrating to me.  First, don’t worry about the spiritual aspects, since there are almost none in the vast majority of American schools.  I recommend very different sorts of schools for those under 13 and those who are older, however</p><p>Younger kids will do fine in the traditional belt factory, as all they’re learning is the techniques and any decent Tae Kwon Do school will do.  Just visit it and be sure that the top instructors actually do the teaching, that the students are respectful and the purple and red belts appear to know their stuff.  Children can learn the basics, but even a kid with a black belt is still just a kid with a black belt, not a fighter.</p><p>Adults and teenagers need to go to a fighting-oriented school.  How do you know you’re at one?  1) Everyone, from white to black, is sparring.  2) They are actually making contact to the head.  3) At least one spectator will be there in his robes, watching with a pair of crutches or other visible signs of damage.  If the answer to “what night do you spar” is anything but a specific day of the week, it isn’t a fight school.  We were particularly harsh, as we sparred Wednesdays and often Saturdays as well.  Also, don’t buy into the rubbish about how they teach control and if you can tap someone you can just as easily hit them hard blah blah blah.  It isn’t true and I’ve beaten the smack out of enough touch-fighters to prove it.  The knowledge that you won’t get hit creates a false situation from the start, and you can’t develop the necessary toughness without getting punched in the face a few times.</p><p>Also, ask around.  Even the belt factories will know which schools are the serious fight schools.  I once had a black belt correctly identify my instructor without my telling him after I hit the guy with a single uppercut.  As for style, I’d lean more towards aikido or jujitsu and away from the tae kwon do and tang soo do.  The latter tend to be very strong on feet and very weak on hands and grappling.  The best, if you can find it, is a school that has masters in a variety of styles, which will provide decent knowledge of locks and throws as well as plenty of time throwing hard style punches and kicks.</p><p>I wish I knew more locks and throws, as that’s the area in which my training was weakest.  But the main thing is to find a school that fights.  There’s no substitute for rounds sparred, and sparred hard.  My own training was a blend of Shorin Ryu karate with Wing Chun kung fu, mixed in with Philippino kali.  I figure that I probably fought a mimimum of 3,000 two-minute rounds during the time I was actively training.</p><p>UPDATE – Shaolin Master Bob points out that belt factories where the belt tests are scheduled are definitely to be avoided.  I concur completely.  The time it takes to master a skill or a technique is wholly subjective; scheduled tests indicate a total lack of concern for individual development.</p></div>",
  "content_text": "Tonya writes:\nnow dern it, vox, you’re not keeping up with the comments.  yesterday in one of the comment threads several people (myself included) were clamoring for your expertise on which types of martial arts to look into.  and what do we get?  total freakin’ silence!\nSorry, I’ve just been under the weather for about ten days now with a viral bug and the very thought of exercise – which the doctor is forbidding – is tremendously frustrating to me.  First, don’t worry about the spiritual aspects, since there are almost none in the vast majority of American schools.  I recommend very different sorts of schools for those under 13 and those who are older, however\nYounger kids will do fine in the traditional belt factory, as all they’re learning is the techniques and any decent Tae Kwon Do school will do.  Just visit it and be sure that the top instructors actually do the teaching, that the students are respectful and the purple and red belts appear to know their stuff.  Children can learn the basics, but even a kid with a black belt is still just a kid with a black belt, not a fighter.\nAdults and teenagers need to go to a fighting-oriented school.  How do you know you’re at one?  1) Everyone, from white to black, is sparring.  2) They are actually making contact to the head.  3) At least one spectator will be there in his robes, watching with a pair of crutches or other visible signs of damage.  If the answer to “what night do you spar” is anything but a specific day of the week, it isn’t a fight school.  We were particularly harsh, as we sparred Wednesdays and often Saturdays as well.  Also, don’t buy into the rubbish about how they teach control and if you can tap someone you can just as easily hit them hard blah blah blah.  It isn’t true and I’ve beaten the smack out of enough touch-fighters to prove it.  The knowledge that you won’t get hit creates a false situation from the start, and you can’t develop the necessary toughness without getting punched in the face a few times.\nAlso, ask around.  Even the belt factories will know which schools are the serious fight schools.  I once had a black belt correctly identify my instructor without my telling him after I hit the guy with a single uppercut.  As for style, I’d lean more towards aikido or jujitsu and away from the tae kwon do and tang soo do.  The latter tend to be very strong on feet and very weak on hands and grappling.  The best, if you can find it, is a school that has masters in a variety of styles, which will provide decent knowledge of locks and throws as well as plenty of time throwing hard style punches and kicks.\nI wish I knew more locks and throws, as that’s the area in which my training was weakest.  But the main thing is to find a school that fights.  There’s no substitute for rounds sparred, and sparred hard.  My own training was a blend of Shorin Ryu karate with Wing Chun kung fu, mixed in with Philippino kali.  I figure that I probably fought a mimimum of 3,000 two-minute rounds during the time I was actively training.\nUPDATE – Shaolin Master Bob points out that belt factories where the belt tests are scheduled are definitely to be avoided.  I concur completely.  The time it takes to master a skill or a technique is wholly subjective; scheduled tests indicate a total lack of concern for individual development.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-18T16:53:00+00:00"
}