{
  "url": "https://voxday.net/2004/02/16/onward-christian-lunatics/",
  "scraped_at": "2025-12-13T15:49:28.128848",
  "title": "Onward Christian lunatics",
  "date_display": "February 16, 2004",
  "date_iso": "2004-02-16T13:15:00+00:00",
  "date_from_url": "2004-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First it was rock music – eek!  Then Dungeons &amp; Dragons – eek!  Then Harry Potter – eek!  Now Dan Brown – eek!  I am so very sick and tired of listening to whiny fearful Christians getting their collective panties in a bunch about what non-Christians read and watch for entertainment.  “It could, maybe, possibly lead someone, someday, into something that is BAD!”</p><p>Please.</p><p>Listen to me very closely.  There is only one thing that has caused the publishing industry to pay any attention whatsoever to Christian concerns about reading material.  That is the massive success of the <em>Left Behind</em> novels.  The success of Mel Gibson’s <em>Passion</em> will have far more of an impact on Hollywood than every protest and complaint about the Harry Potter films combined and multiplied by one hundred.</p><p>Sure, I’m extremely irritated that my publisher sent out 50 copies of an overtly Christian novel to 50 different Christian media outlets – almost all of whom have pontificated at length about the evils of Harry Potter – and only one bothered to review it.  Meanwhile, Publisher’s Weekly and a number of major secular science fiction outlets did see fit to do so.  Now, you can certainly dismiss my attitude as sour grapes if you like.  What you shouldn’t dismiss so easily is my large New York publisher – who also publishes some of Dan Brown’s novels – concluding that Christians are all talk, and they would rather whine than put their money and their media where their mouth is.</p><p>Do you really believe he’ll think twice about ignoring the complaints of a group of people who, from his perspective, barely exist?  Are you going to threaten not to buy his books?  You’re already quite clearly not doing so!  So, why would he possibly care about whatever it is you have to say?</p><p>The sad thing is that an author could probably get more press from the Christian media by writing a lousy novel about a transexual serial killer priest who rapes and murders his way to the papacy than he could by writing a good novel written from a Christian worldview that glorifies Jesus Christ.  If Christians will not support Christian alternatives, then they had better not be surprised when the alternatives to the worldly things that offend them disappear altogether.</p></div>",
  "content_text": "First it was rock music – eek!  Then Dungeons & Dragons – eek!  Then Harry Potter – eek!  Now Dan Brown – eek!  I am so very sick and tired of listening to whiny fearful Christians getting their collective panties in a bunch about what non-Christians read and watch for entertainment.  “It could, maybe, possibly lead someone, someday, into something that is BAD!”\nPlease.\nListen to me very closely.  There is only one thing that has caused the publishing industry to pay any attention whatsoever to Christian concerns about reading material.  That is the massive success of the\nLeft Behind\nnovels.  The success of Mel Gibson’s\nPassion\nwill have far more of an impact on Hollywood than every protest and complaint about the Harry Potter films combined and multiplied by one hundred.\nSure, I’m extremely irritated that my publisher sent out 50 copies of an overtly Christian novel to 50 different Christian media outlets – almost all of whom have pontificated at length about the evils of Harry Potter – and only one bothered to review it.  Meanwhile, Publisher’s Weekly and a number of major secular science fiction outlets did see fit to do so.  Now, you can certainly dismiss my attitude as sour grapes if you like.  What you shouldn’t dismiss so easily is my large New York publisher – who also publishes some of Dan Brown’s novels – concluding that Christians are all talk, and they would rather whine than put their money and their media where their mouth is.\nDo you really believe he’ll think twice about ignoring the complaints of a group of people who, from his perspective, barely exist?  Are you going to threaten not to buy his books?  You’re already quite clearly not doing so!  So, why would he possibly care about whatever it is you have to say?\nThe sad thing is that an author could probably get more press from the Christian media by writing a lousy novel about a transexual serial killer priest who rapes and murders his way to the papacy than he could by writing a good novel written from a Christian worldview that glorifies Jesus Christ.  If Christians will not support Christian alternatives, then they had better not be surprised when the alternatives to the worldly things that offend them disappear altogether.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-16T13:15:00+00:00"
}