{
  "url": "https://voxday.net/2004/02/19/pat-buchanan-lays-waste-to-neocons/",
  "scraped_at": "2025-12-13T15:50:12.051297",
  "title": "Pat Buchanan lays waste to the neocons",
  "date_display": "February 19, 2004",
  "date_iso": "2004-02-19T20:00:00+00:00",
  "date_from_url": "2004-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Patrick J. Buchanan writes: <em>On the dust jacket of his book, Richard Perle appends a Washington Post depiction of himself as the “intellectual guru of the hard-line neoconservative movement in foreign policy.”  The guru’s reputation, however, <a href=\"http://www.amconmag.com/3_1_04/cover.html\">does not survive a reading</a>. Indeed, on putting down Perle’s new book the thought recurs: the neoconservative moment may be over. For they are not only losing their hold on power, they are losing their grip on reality.</em></p><p>An End to Evil: How to Win the War on Terror opens on a note of hysteria. In the War on Terror, writes Perle, “There is no middle way for Americans: It is victory or holocaust.” “What is new since 9/11 is the chilling realization that the terrorist threat we thought we had contained” now menaces “our survival as a nation.”  But how is our survival as a nation menaced when not one American has died in a terrorist attack on U.S. soil since 9/11? Are we really in imminent peril of a holocaust like that visited upon the Jews of Poland?</p><p>“[A] radical strain within Islam,” says Perle, “ … seeks to overthrow our civilization and remake the nations of the West into Islamic societies, imposing on the whole world its religion and laws.”  Well, yes. Militant Islam has preached that since the 7th century. But what are the odds the Boys of Tora Bora are going to “overthrow our civilization” and coerce us all to start praying to Mecca five times a day?</p><p>I never bought the notion that neocons were more loyal to Israel than the USA.  But in light of some of the hysterical and nonsensical accusations of anti-semitism made against those who criticize them, I start to wonder if perhaps they are not protesting too much.  What the hell is that “two democracy” argument anyhow, especially considering that WE’RE NOT A FREAKING DEMOCRACY!  I’m all for Israel, but I don’t think that it should be a major factor in our foreign policy nor can I imagine why it would be.</p><p>There can be little question that neoconservativism is, as Buchanan approvingly quotes, “liberalism with very sharp teeth”.  The article is long, but it is one that <a href=\"http://www.amconmag.com/3_1_04/cover.html\">you must read</a>.  It actually inspired me to write to Mr. Buchanan and tell him that as he had done everything but sow the neoconservative earth with salt, I imagined Mr. Perle and Mr. Frum now had a very good idea of what Carthage must have felt like once Rome was finished with it.</p></div>",
  "content_text": "Patrick J. Buchanan writes:\nOn the dust jacket of his book, Richard Perle appends a Washington Post depiction of himself as the “intellectual guru of the hard-line neoconservative movement in foreign policy.”  The guru’s reputation, however,\ndoes not survive a reading\n. Indeed, on putting down Perle’s new book the thought recurs: the neoconservative moment may be over. For they are not only losing their hold on power, they are losing their grip on reality.\nAn End to Evil: How to Win the War on Terror opens on a note of hysteria. In the War on Terror, writes Perle, “There is no middle way for Americans: It is victory or holocaust.” “What is new since 9/11 is the chilling realization that the terrorist threat we thought we had contained” now menaces “our survival as a nation.”  But how is our survival as a nation menaced when not one American has died in a terrorist attack on U.S. soil since 9/11? Are we really in imminent peril of a holocaust like that visited upon the Jews of Poland?\n“[A] radical strain within Islam,” says Perle, “ … seeks to overthrow our civilization and remake the nations of the West into Islamic societies, imposing on the whole world its religion and laws.”  Well, yes. Militant Islam has preached that since the 7th century. But what are the odds the Boys of Tora Bora are going to “overthrow our civilization” and coerce us all to start praying to Mecca five times a day?\nI never bought the notion that neocons were more loyal to Israel than the USA.  But in light of some of the hysterical and nonsensical accusations of anti-semitism made against those who criticize them, I start to wonder if perhaps they are not protesting too much.  What the hell is that “two democracy” argument anyhow, especially considering that WE’RE NOT A FREAKING DEMOCRACY!  I’m all for Israel, but I don’t think that it should be a major factor in our foreign policy nor can I imagine why it would be.\nThere can be little question that neoconservativism is, as Buchanan approvingly quotes, “liberalism with very sharp teeth”.  The article is long, but it is one that\nyou must read\n.  It actually inspired me to write to Mr. Buchanan and tell him that as he had done everything but sow the neoconservative earth with salt, I imagined Mr. Perle and Mr. Frum now had a very good idea of what Carthage must have felt like once Rome was finished with it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-19T20:00:00+00:00"
}