{
  "url": "https://voxday.net/2004/02/29/problem-of-evi/",
  "scraped_at": "2025-12-13T15:51:55.756959",
  "title": "The problem of evil",
  "date_display": "February 29, 2004",
  "date_iso": "2004-02-29T16:15:00+00:00",
  "date_from_url": "2004-02-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The president of VQPF, the Zinkster his own gay self, wrote: <em>The Bible? The Bible is a beautifully written work of fiction.  I always wonder where was this caring, all powerful God or Supreme Being when the Nazis were in power? When slavery was taking place? Where was he? Or she? Or it? On a coffee break.</em></p><p>This is a variant of the oft-asked question of why bad things happen to good people.  It is a significant question, and indeed, a major stumbling block to me in the years before I became Christian.  Now, before I address this question, it is important to understand a few things.  I am not a theologian and I am not particularly well-versed in theology.  I postulate that human understanding cannot fully comprehend or explain God, and so my conclusions are, at best, barely educated guesses.  I do not know the fullness of the truth and neither does any other human being, past or present, with one notable exception.  The fact that [your favorite theologian or philosopher here] once said something proves nothing definitively.  In other words, argue with me all you like, but there’s no point in getting upset about it – save that for something on which we can have a more substantive debate.</p><p>With that out of the way, let me state that I believe the common Christian notion that God is in complete control of the world, that He has a specific plan for our individual lives, that He guides our every step and orchestrates every incident we encounter is one of the most Satanically damaging concepts ever invented by the forces of darkness.  I believe that this notion is logically and Biblically flawed, and has an evil effect on both Christians and nonbelievers alike.  My reasoning is as follows:</p><p>1.  Neither omnipotence nor omniscience imply omniderigence, or to put it more casually, uber control freakdom.  If you inquire as to why most Christians believe that God is in control, they will state that He is all-powerful and all-knowing and has made the Heavens and the Earth.  They sometimes cite the verse relating to knowledge of sparrows.  But knowing when a sparrow falls does not imply striking it dead, nor does the possession of power indicate its use.  Nor does making something imply active maintenance – does Toyota change your oil?</p><p>2.  Jesus Christ would not have taught us to pray that God’s Will be done here on Earth as it is in Heaven, unless God’s Will was not being done here on Earth.</p><p>3.  There are numerous instances in the Old Testament where Israel and others go against God’s Will.  Therefore, it is possible for humans to act in opposition to God, without him dictating their actions.  Furthermore, the very notion of Lucifer’s Fall indicates strongly that God is not in control of all things.</p><p>4.  Jesus Christ does not argue with Satan when Satan offers him the nations of the world.  Instead, he rejects the offer.  The clear implication is that the nations of the world were Satan’s to give.  This is supported by Jesus and Paul’s later references to the god of this world being distinct from the God that is the Heavenly Father.</p><p>5.  Jesus Christ says that Satan has no hold on him, presumably because he has not sinned.  Therefore, Satan does have a hold on everyone who has sinned, namely, the rest of us on the planet.</p><p>6.  Jesus Christ’s command to follow his own example of healing the sick and raising the dead indicates that neither sickness or death are God’s Will for individual humans or humanity as a whole.</p><p>7.  For reasons beyond our ken, God requires humans to act as conduits for acting on this planet.  This is why Satan hates Christians so passionately, as they represent the beachhead of divine power which will eventually overthrow his rule of this fallen world.</p><p>Based on these and other reasons, I have concluded that it is a massive error to blame God for evils such as National Socialism, slavery and the designated hitter.  These are human creations, enthusiastically cheered on by the reigning ruler of the planet, who seeks nothing less than the total destruction of mankind.  About 18 months ago, I wrote an article entitled <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=26592\">Satan, Science and the Supernatural</a>, in which I pointed out that Satan is not only evil, but he is a deceiver.  And what deception could be more useful than to lead people into believing that all the evil of the world is caused by the only power that can ameliorate their suffering?</p><p>In summary, I believe that these evils exist because the world is ruled by a sadistic supernatural serial killer who is vehemently opposed to God.  Only those who turn to Jesus Christ have the ability to stand against this terrible usurper and his minions, which is why despite all of the many shortcomings of the Christian church, some of the greatest evils of the world have been brought to an end – temporarily, I suspect – by Christians, including the two examples that you cited.</p><p>This is why prayer matters, why faith is so massively important, and why Jesus Christ said his sacrifice would set us free.  My understanding is without question incomplete, but I believe that it is more in accordance with both the world and the Word than the shallow, ominously-smiling Sunday School teaching that God wants little Bobby to go through chemo, little Susy to be born addicted to heroin and little Schmuly to die in a gas chamber because it’s good for them.  Where was God?  My guess – and that’s all it is – is that He was watching with tears in His eyes and waiting for someone to stand in the gap between Divine Heaven and Fallen Earth to be a conduit for His power to end the evil.</p><p><em>Notes – I know that the atheist Soviet Union helped defeat the National Socialists.  I am also aware that slavery continues, and that it is permitted in the Bible.  However, divorce was also permitted, even though Jesus said that God hates it. Which again suggests that God is not omniderigent.</em></p></div>",
  "content_text": "The president of VQPF, the Zinkster his own gay self, wrote:\nThe Bible? The Bible is a beautifully written work of fiction.  I always wonder where was this caring, all powerful God or Supreme Being when the Nazis were in power? When slavery was taking place? Where was he? Or she? Or it? On a coffee break.\nThis is a variant of the oft-asked question of why bad things happen to good people.  It is a significant question, and indeed, a major stumbling block to me in the years before I became Christian.  Now, before I address this question, it is important to understand a few things.  I am not a theologian and I am not particularly well-versed in theology.  I postulate that human understanding cannot fully comprehend or explain God, and so my conclusions are, at best, barely educated guesses.  I do not know the fullness of the truth and neither does any other human being, past or present, with one notable exception.  The fact that [your favorite theologian or philosopher here] once said something proves nothing definitively.  In other words, argue with me all you like, but there’s no point in getting upset about it – save that for something on which we can have a more substantive debate.\nWith that out of the way, let me state that I believe the common Christian notion that God is in complete control of the world, that He has a specific plan for our individual lives, that He guides our every step and orchestrates every incident we encounter is one of the most Satanically damaging concepts ever invented by the forces of darkness.  I believe that this notion is logically and Biblically flawed, and has an evil effect on both Christians and nonbelievers alike.  My reasoning is as follows:\n1.  Neither omnipotence nor omniscience imply omniderigence, or to put it more casually, uber control freakdom.  If you inquire as to why most Christians believe that God is in control, they will state that He is all-powerful and all-knowing and has made the Heavens and the Earth.  They sometimes cite the verse relating to knowledge of sparrows.  But knowing when a sparrow falls does not imply striking it dead, nor does the possession of power indicate its use.  Nor does making something imply active maintenance – does Toyota change your oil?\n2.  Jesus Christ would not have taught us to pray that God’s Will be done here on Earth as it is in Heaven, unless God’s Will was not being done here on Earth.\n3.  There are numerous instances in the Old Testament where Israel and others go against God’s Will.  Therefore, it is possible for humans to act in opposition to God, without him dictating their actions.  Furthermore, the very notion of Lucifer’s Fall indicates strongly that God is not in control of all things.\n4.  Jesus Christ does not argue with Satan when Satan offers him the nations of the world.  Instead, he rejects the offer.  The clear implication is that the nations of the world were Satan’s to give.  This is supported by Jesus and Paul’s later references to the god of this world being distinct from the God that is the Heavenly Father.\n5.  Jesus Christ says that Satan has no hold on him, presumably because he has not sinned.  Therefore, Satan does have a hold on everyone who has sinned, namely, the rest of us on the planet.\n6.  Jesus Christ’s command to follow his own example of healing the sick and raising the dead indicates that neither sickness or death are God’s Will for individual humans or humanity as a whole.\n7.  For reasons beyond our ken, God requires humans to act as conduits for acting on this planet.  This is why Satan hates Christians so passionately, as they represent the beachhead of divine power which will eventually overthrow his rule of this fallen world.\nBased on these and other reasons, I have concluded that it is a massive error to blame God for evils such as National Socialism, slavery and the designated hitter.  These are human creations, enthusiastically cheered on by the reigning ruler of the planet, who seeks nothing less than the total destruction of mankind.  About 18 months ago, I wrote an article entitled\nSatan, Science and the Supernatural\n, in which I pointed out that Satan is not only evil, but he is a deceiver.  And what deception could be more useful than to lead people into believing that all the evil of the world is caused by the only power that can ameliorate their suffering?\nIn summary, I believe that these evils exist because the world is ruled by a sadistic supernatural serial killer who is vehemently opposed to God.  Only those who turn to Jesus Christ have the ability to stand against this terrible usurper and his minions, which is why despite all of the many shortcomings of the Christian church, some of the greatest evils of the world have been brought to an end – temporarily, I suspect – by Christians, including the two examples that you cited.\nThis is why prayer matters, why faith is so massively important, and why Jesus Christ said his sacrifice would set us free.  My understanding is without question incomplete, but I believe that it is more in accordance with both the world and the Word than the shallow, ominously-smiling Sunday School teaching that God wants little Bobby to go through chemo, little Susy to be born addicted to heroin and little Schmuly to die in a gas chamber because it’s good for them.  Where was God?  My guess – and that’s all it is – is that He was watching with tears in His eyes and waiting for someone to stand in the gap between Divine Heaven and Fallen Earth to be a conduit for His power to end the evil.\nNotes – I know that the atheist Soviet Union helped defeat the National Socialists.  I am also aware that slavery continues, and that it is permitted in the Bible.  However, divorce was also permitted, even though Jesus said that God hates it. Which again suggests that God is not omniderigent.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-29T16:15:00+00:00"
}