{
  "url": "https://voxday.net/2004/02/17/pseudo-mystery-of-brats/",
  "scraped_at": "2025-12-13T15:49:37.742417",
  "title": "The pseudo-mystery of brats",
  "date_display": "February 17, 2004",
  "date_iso": "2004-02-17T19:28:00+00:00",
  "date_from_url": "2004-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The St. Paul Pioneer Press wonders: <em>You’ve seen them: Terrorist toddlers screaming at the supermarket. Kamikaze kindergartners with anger issues on the playground. Surly adolescents with no respect for anyone older than 18.  And you’ve wondered: Have kids always been this way and I’m just getting crankier? Or are today’s parents spineless saps producing <a href=\"http://www.twincities.com/mld/twincities/living/7967384.htm\">an inordinate number of brats</a>?</em></p><p>This is no mystery.  The notion, pushed by one “expert” in the article, that children are over-disciplined today defies belief.  There’s no question that there’s a direct link between the distaste for discipline on the part of parents and the lunatic behavior of their children.  And when the state leaps in to ensure that parents are afraid to discipline, the problem gets even worse.  There is no problem so dire that the state cannot make it worse.</p><p>One idiot couple in Minnesota called child protection services to ask if it was child abuse if their neighbor spanked his own children.  Note – they weren’t accusing him of child abuse, they just wanted to know.  Needless to say, they were both surprised and horrified when, based on this question, the Child Nazis leaped at the opportunity to wreak havoc on a family and had the guy arrested and thrown in jail for two days.</p><p>Sure, there are parents who mistreat their children.  But when you consider that governments around the world have murdered hundreds of millions of innocent citizens for no reason at all, why would you turn to the state as a solution.  In Child Protection, just like everything else in which it intervenes, the state does nothing except make matters worse.</p><p>Of course, it won’t be long before refusing to have your child vaccinated will be dubbed child abuse.  If you can get thrown in jail for being accused of having spanked your child, I’m sure they’ll be able to justify jailing someone for failing to have their six-month old inoculated against Hepatitis B.</p></div>",
  "content_text": "The St. Paul Pioneer Press wonders:\nYou’ve seen them: Terrorist toddlers screaming at the supermarket. Kamikaze kindergartners with anger issues on the playground. Surly adolescents with no respect for anyone older than 18.  And you’ve wondered: Have kids always been this way and I’m just getting crankier? Or are today’s parents spineless saps producing\nan inordinate number of brats\n?\nThis is no mystery.  The notion, pushed by one “expert” in the article, that children are over-disciplined today defies belief.  There’s no question that there’s a direct link between the distaste for discipline on the part of parents and the lunatic behavior of their children.  And when the state leaps in to ensure that parents are afraid to discipline, the problem gets even worse.  There is no problem so dire that the state cannot make it worse.\nOne idiot couple in Minnesota called child protection services to ask if it was child abuse if their neighbor spanked his own children.  Note – they weren’t accusing him of child abuse, they just wanted to know.  Needless to say, they were both surprised and horrified when, based on this question, the Child Nazis leaped at the opportunity to wreak havoc on a family and had the guy arrested and thrown in jail for two days.\nSure, there are parents who mistreat their children.  But when you consider that governments around the world have murdered hundreds of millions of innocent citizens for no reason at all, why would you turn to the state as a solution.  In Child Protection, just like everything else in which it intervenes, the state does nothing except make matters worse.\nOf course, it won’t be long before refusing to have your child vaccinated will be dubbed child abuse.  If you can get thrown in jail for being accused of having spanked your child, I’m sure they’ll be able to justify jailing someone for failing to have their six-month old inoculated against Hepatitis B.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-17T19:28:00+00:00"
}