{
  "url": "https://voxday.net/2004/02/15/republican-principle-or-lack-thereof/",
  "scraped_at": "2025-12-13T15:49:15.898005",
  "title": "Republican principle or lack thereof",
  "date_display": "February 15, 2004",
  "date_iso": "2004-02-15T08:50:00+00:00",
  "date_from_url": "2004-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://www.foxnews.com/story/0,2933,111159,00.html\">a must-read</a> for every conservative Republican.  It seals the deal on the notion that national Republicans are about anything but power, power, power.  I don’t see how anyone can possibly believe that keeping these unprincipled whores in office is a good idea, much less argue with a straight face that it is vital to the continued health and liberty of the country.</p><p><em> When Congress adjourns this year, Sen. Peter Fitzgerald, R-Ill., will retire after just one term. He’s retiring because his own party has turned on him and promised to run a primary candidate against him. That’s because this particular senator decided that while he was in office he’d be his own man and vote his own conscience. He wouldn’t be a lackey for his party, he wouldn’t vote pork home to his state, and he wouldn’t do what the special interests who run his party told him to do. And that got him into trouble.  When Fitzgerald announced his retirement last April, he’d already been the scorn of his home state’s newspaper columnists and editorial boards. The Republican Party — both state and national — was elated to see him go. The Washington Times ran an editorial gloating over his departure….</em></p><p>Six years ago, Fitzgerald ran against troubled incumbent Democrat Carol Moseley Braun. He financed his own campaign, indicating early on that he’d be beholden to no one. The media immediately tapped him as a fringe candidate from the Christian right — an ill-informed and unfair characterization. A better label would be “principled.”  Fitzgerald showed more of that rare Washington commodity in one term than most politicians show in a lifetime.</p><p>Fitzgerald’s crowning achievement in his brief career was his opposition to the federalization of a planned expansion of Chicago’s O’Hare International Airport. Congress’ seal of approval would have ensured that the $13 billion expansion forge ahead, without any input from Illinois residents, including those who owned the hundreds of homes and dozens of businesses that would have been bulldozed to make way for the new runways. The expansion was pushed by a shady consortium of business developers, who launched a PR campaign just as its major players were making political contributions to prominent and powerful Illinois politicians. Fitzgerald’s opposition to federalizing what should have been a local issue postponed the expansion, which later fizzled when the airlines endured post-Sept. 11 financial problems.</p><p>Fitzgerald showed some admirable backbone there, too. He was the only senator in the U.S. Congress to vote against the $15 billion airline bailout, despite the fact that United Airlines is based in Illinois and American Airlines has a major hub at O’Hare.  Fitzgerald next earned the wrath of fellow Speaker of the House Dennis Hastert, a fellow Republican and probably the most powerful politician in Illinois, if not the country. Fitzgerald and Hastert first tangled over Fitzgerald’s refusal to support Hastert’s efforts to secure a glut of federal funding for the Abraham Lincoln Presidential Library, located in Illinois. Hastert pulled rank to secure the money, and Fitzgerald criticized him publicly for it.</p><p>Fitzgerald then refused sign a letter written by the Illinois’ congressional delegation to President Bush, which requested the White House’s help in securing federal dollars (read: pork) for the state. Fitzgerald infuriated his colleagues when he wrote in a reply, “the mere fact that a project is located somewhere in Illinois does not mean that it is inherently meritorious and necessarily worthy of support.” </p></div>",
  "content_text": "This is\na must-read\nfor every conservative Republican.  It seals the deal on the notion that national Republicans are about anything but power, power, power.  I don’t see how anyone can possibly believe that keeping these unprincipled whores in office is a good idea, much less argue with a straight face that it is vital to the continued health and liberty of the country.\nWhen Congress adjourns this year, Sen. Peter Fitzgerald, R-Ill., will retire after just one term. He’s retiring because his own party has turned on him and promised to run a primary candidate against him. That’s because this particular senator decided that while he was in office he’d be his own man and vote his own conscience. He wouldn’t be a lackey for his party, he wouldn’t vote pork home to his state, and he wouldn’t do what the special interests who run his party told him to do. And that got him into trouble.  When Fitzgerald announced his retirement last April, he’d already been the scorn of his home state’s newspaper columnists and editorial boards. The Republican Party — both state and national — was elated to see him go. The Washington Times ran an editorial gloating over his departure….\nSix years ago, Fitzgerald ran against troubled incumbent Democrat Carol Moseley Braun. He financed his own campaign, indicating early on that he’d be beholden to no one. The media immediately tapped him as a fringe candidate from the Christian right — an ill-informed and unfair characterization. A better label would be “principled.”  Fitzgerald showed more of that rare Washington commodity in one term than most politicians show in a lifetime.\nFitzgerald’s crowning achievement in his brief career was his opposition to the federalization of a planned expansion of Chicago’s O’Hare International Airport. Congress’ seal of approval would have ensured that the $13 billion expansion forge ahead, without any input from Illinois residents, including those who owned the hundreds of homes and dozens of businesses that would have been bulldozed to make way for the new runways. The expansion was pushed by a shady consortium of business developers, who launched a PR campaign just as its major players were making political contributions to prominent and powerful Illinois politicians. Fitzgerald’s opposition to federalizing what should have been a local issue postponed the expansion, which later fizzled when the airlines endured post-Sept. 11 financial problems.\nFitzgerald showed some admirable backbone there, too. He was the only senator in the U.S. Congress to vote against the $15 billion airline bailout, despite the fact that United Airlines is based in Illinois and American Airlines has a major hub at O’Hare.  Fitzgerald next earned the wrath of fellow Speaker of the House Dennis Hastert, a fellow Republican and probably the most powerful politician in Illinois, if not the country. Fitzgerald and Hastert first tangled over Fitzgerald’s refusal to support Hastert’s efforts to secure a glut of federal funding for the Abraham Lincoln Presidential Library, located in Illinois. Hastert pulled rank to secure the money, and Fitzgerald criticized him publicly for it.\nFitzgerald then refused sign a letter written by the Illinois’ congressional delegation to President Bush, which requested the White House’s help in securing federal dollars (read: pork) for the state. Fitzgerald infuriated his colleagues when he wrote in a reply, “the mere fact that a project is located somewhere in Illinois does not mean that it is inherently meritorious and necessarily worthy of support.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-15T08:50:00+00:00"
}