{
  "url": "https://voxday.net/2004/02/11/saloth-sar-or-monica/",
  "scraped_at": "2025-12-13T15:48:42.410330",
  "title": "Saloth Sar or Monica",
  "date_display": "February 11, 2004",
  "date_iso": "2004-02-11T21:29:00+00:00",
  "date_from_url": "2004-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonah Goldberg was right to be impressed by <a href=\"http://www.smalltime.com/dictator.html\">Guess the Dictator</a>: <em>Well, I win this round. You are player number 3 to pick Pol Pot from Dictator of Cambodia, and what a clever choice it was! You almost had me for a while, but you let your guard down. Don’t worry, it happens to all of us sooner or later. Please play again, and next time I’ll be ready for you, Pol Pot from Dictator of Cambodia.</em></p><p>I was shocked when it came up with the final question of “are you responsible for the Killing Fields” as the one immediately previous had been “do you talk to your neighbors through a fence”, leading me to conclude that it was off on completely the wrong track altogether.</p><p>I daresay it won’t come up with Sargon or Muhammad bin Tughlak, though.</p></div>",
  "content_text": "Jonah Goldberg was right to be impressed by\nGuess the Dictator\n:\nWell, I win this round. You are player number 3 to pick Pol Pot from Dictator of Cambodia, and what a clever choice it was! You almost had me for a while, but you let your guard down. Don’t worry, it happens to all of us sooner or later. Please play again, and next time I’ll be ready for you, Pol Pot from Dictator of Cambodia.\nI was shocked when it came up with the final question of “are you responsible for the Killing Fields” as the one immediately previous had been “do you talk to your neighbors through a fence”, leading me to conclude that it was off on completely the wrong track altogether.\nI daresay it won’t come up with Sargon or Muhammad bin Tughlak, though.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-11T21:29:00+00:00"
}