{
  "url": "https://voxday.net/2004/02/20/self-destructive-jews-at-it-again/",
  "scraped_at": "2025-12-13T15:50:20.936218",
  "title": "Self-destructive Jews, at it again",
  "date_display": "February 20, 2004",
  "date_iso": "2004-02-20T11:38:00+00:00",
  "date_from_url": "2004-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rabbi Daniel Lapin writes: <em>From audiences around America, I am encountering bitterness at Jewish organizations insisting that belief in the New Testament is de facto evidence of anti-Semitism. Christians heard Jewish leaders denouncing Gibson for making a movie that follows Gospel accounts of the Crucifixion long before any of them had even seen the movie. Furthermore, Christians are hurt that Jewish groups are presuming to teach them what Christian Scripture “really means.” Listen to a rabbi whom I debated on the Fox television show hosted by Bill O’Reilly last September. This is what he said, “We have a responsibility as Jews, as thinking Jews, as people of theology, to respond to our Christian brothers and to engage them, be it Protestants, be it Catholics, and say, look, this is not your history, this is not your theology, this does not represent what you believe in.”</em></p><p>The amazing ability of the Jewish people to survive the hatred of a fallen world can only be approached by their self-selected spokesmen’s continuing affinity for self-destructive idiocy.  Just as the Polish Jewish leadership’s <a href=\"http://www.datasync.com/~davidg59/rumkowsk.html\">notion of cooperating peacefully</a> with the National Socialists didn’t work out particularly well, the idea that lecturing Christians on their theology is going to reduce anti-semitism (or as it is more properly called, Jew-hating), is doomed to failure.  If believing in the truth of the Gospel makes me an anti-semite, despite <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=28445\">my vocal support </a>for Israel and the Jewish people, then I’ll wear the label proudly.  As I’ve written before, do the Jews have so few enemies in the world that <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36447\">they need to go out of their way </a>to create new ones?</p><p>Rabbi Lapin continues: <em>Many individual Jews have shared with me their embarrassment that groups, ostensibly representing them, attack Passion but are silent about depraved entertainment that encourages killing cops and brutalizing women. Citing artistic freedom, Jewish groups helped protect sacrilegious exhibits such as the anti-Christian feces extravaganza presented by the Brooklyn Museum four years ago. One can hardly blame Christians for assuming that Jews feel artistic freedom is important only when exercised by those hostile toward Christianity.</em></p><p>Yeah, this hardly escaped me either.  I don’t recall Martin Scorsese being quizzed on his father’s beliefs, or Spike Lee, or any of the producers of teen slasher flicks.  And Hollywood’s refusal to distribute what promises to be an extraordinarily successful movie does raise some nasty questions about the Jewish domination of the industry as well.  Still, I don’t believe that Foxman and the ADL truly speak for American Jewry anymore than Al Sharpton speaks for American blacks, nor do I think this unseemly and self-defeating campaign against Mel Gibson and his movie will have any serious effect on how evangelical Christians feel about Jews and Israel.  If God blesses those who bless Israel and curses those who curse it, then that’s all that matters and who cares what a few short-sighted individuals are blathering on about anyway.</p><p>In any event, here’s hoping that America’s Jews will be wise enough to heed Rabbi Lapin, not Foxman and his ilk.</p><p><em>NOTE – I am quite aware of the historical sufferings of Jews at the hands of medieval Christians.  But to hold Christians today responsible for the evil actions of their misguided ancestors is to subscribe to a notion of collective responsibility which justifies not only those past persecutions of Jews, but new ones today.</em></p></div>",
  "content_text": "Rabbi Daniel Lapin writes:\nFrom audiences around America, I am encountering bitterness at Jewish organizations insisting that belief in the New Testament is de facto evidence of anti-Semitism. Christians heard Jewish leaders denouncing Gibson for making a movie that follows Gospel accounts of the Crucifixion long before any of them had even seen the movie. Furthermore, Christians are hurt that Jewish groups are presuming to teach them what Christian Scripture “really means.” Listen to a rabbi whom I debated on the Fox television show hosted by Bill O’Reilly last September. This is what he said, “We have a responsibility as Jews, as thinking Jews, as people of theology, to respond to our Christian brothers and to engage them, be it Protestants, be it Catholics, and say, look, this is not your history, this is not your theology, this does not represent what you believe in.”\nThe amazing ability of the Jewish people to survive the hatred of a fallen world can only be approached by their self-selected spokesmen’s continuing affinity for self-destructive idiocy.  Just as the Polish Jewish leadership’s\nnotion of cooperating peacefully\nwith the National Socialists didn’t work out particularly well, the idea that lecturing Christians on their theology is going to reduce anti-semitism (or as it is more properly called, Jew-hating), is doomed to failure.  If believing in the truth of the Gospel makes me an anti-semite, despite\nmy vocal support\nfor Israel and the Jewish people, then I’ll wear the label proudly.  As I’ve written before, do the Jews have so few enemies in the world that\nthey need to go out of their way\nto create new ones?\nRabbi Lapin continues:\nMany individual Jews have shared with me their embarrassment that groups, ostensibly representing them, attack Passion but are silent about depraved entertainment that encourages killing cops and brutalizing women. Citing artistic freedom, Jewish groups helped protect sacrilegious exhibits such as the anti-Christian feces extravaganza presented by the Brooklyn Museum four years ago. One can hardly blame Christians for assuming that Jews feel artistic freedom is important only when exercised by those hostile toward Christianity.\nYeah, this hardly escaped me either.  I don’t recall Martin Scorsese being quizzed on his father’s beliefs, or Spike Lee, or any of the producers of teen slasher flicks.  And Hollywood’s refusal to distribute what promises to be an extraordinarily successful movie does raise some nasty questions about the Jewish domination of the industry as well.  Still, I don’t believe that Foxman and the ADL truly speak for American Jewry anymore than Al Sharpton speaks for American blacks, nor do I think this unseemly and self-defeating campaign against Mel Gibson and his movie will have any serious effect on how evangelical Christians feel about Jews and Israel.  If God blesses those who bless Israel and curses those who curse it, then that’s all that matters and who cares what a few short-sighted individuals are blathering on about anyway.\nIn any event, here’s hoping that America’s Jews will be wise enough to heed Rabbi Lapin, not Foxman and his ilk.\nNOTE – I am quite aware of the historical sufferings of Jews at the hands of medieval Christians.  But to hold Christians today responsible for the evil actions of their misguided ancestors is to subscribe to a notion of collective responsibility which justifies not only those past persecutions of Jews, but new ones today.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-20T11:38:00+00:00"
}