{
  "url": "https://voxday.net/2004/02/04/staying-off-doggy-lis/",
  "scraped_at": "2025-12-13T15:47:09.960157",
  "title": "Staying off the doggy list",
  "date_display": "February 4, 2004",
  "date_iso": "2004-02-04T15:26:00+00:00",
  "date_from_url": "2004-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Adler of NRO isn’t afraid to take on a Republican administration: <em>It should be no surprise that the long-coddled sugar industry — and its hangers on — are pulling out all the stops to derail trade agreements that could loosen import restrictions on foreign sugar. But it is nothing short of outrageous that the Bush Administration appears to be capitulating, as noted in yesterday’s print WSJ. Under the proposed Central American Free Trade Agreement, a small trickle of foreign sugar will be allowed in, and the Administration is apologizing to the sugar industry for it…. Americans (including all kinds of American companies that use sugar) will pay more for sweeteners, all to protect one well-connected industry. It’s enough to make a free trader sick.</em></p><p>Another republican principle sold down the river by Republicans?  Say it isn’t so!  Not George Delano!  Slowly, conservatives begin to wake up.  Slowly, but surely.  Notice that these Free Trade Agreements are always anything but?  There’s no need for massive encyclopedic tomes, all you need is a one-page document saying: Congress shall make no law…..  Of course, neither Democrats nor Republicans pay any attention to that sort of thing.</p></div>",
  "content_text": "John Adler of NRO isn’t afraid to take on a Republican administration:\nIt should be no surprise that the long-coddled sugar industry — and its hangers on — are pulling out all the stops to derail trade agreements that could loosen import restrictions on foreign sugar. But it is nothing short of outrageous that the Bush Administration appears to be capitulating, as noted in yesterday’s print WSJ. Under the proposed Central American Free Trade Agreement, a small trickle of foreign sugar will be allowed in, and the Administration is apologizing to the sugar industry for it…. Americans (including all kinds of American companies that use sugar) will pay more for sweeteners, all to protect one well-connected industry. It’s enough to make a free trader sick.\nAnother republican principle sold down the river by Republicans?  Say it isn’t so!  Not George Delano!  Slowly, conservatives begin to wake up.  Slowly, but surely.  Notice that these Free Trade Agreements are always anything but?  There’s no need for massive encyclopedic tomes, all you need is a one-page document saying: Congress shall make no law…..  Of course, neither Democrats nor Republicans pay any attention to that sort of thing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-04T15:26:00+00:00"
}