{
  "url": "https://voxday.net/2004/02/17/stepping-in/",
  "scraped_at": "2025-12-13T15:49:39.551276",
  "title": "Stepping in",
  "date_display": "February 17, 2004",
  "date_iso": "2004-02-17T20:55:00+00:00",
  "date_from_url": "2004-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some friends of ours have children who have never really been disciplined.  They always marvel that the one child, who has been notoriously out of control even by modern standards, seems to particularly revere and obey me.  I’ve never told them the reason is that one day, I told him to go upstairs because his mother was calling him.  His reaction was to kick me in the groin.</p><p>He was very surprised when I picked him up by the throat, pulled him nose to nose and told him that if he ever kicked me again, I was going to kick him right back.  I then informed him that he would treat me and all other adults with respect in the future, or we’d have another talk with his feet dangling two feet off the ground and his face turning purple.  Then I put him down and told him to go upstairs because his mother was calling him.  He ran right upstairs without a word of complaint.</p><p>That was many years ago.  We’ve gotten along just fine ever since, and on the very few occasions that I’ve told him to do anything, he all but salutes.  He’s not afraid of me, but he doesn’t seem terribly keen on testing boundaries around me either.  They learn quick, those puppies.</p><p>Martial arts is a fantastic way to help even older teenagers understand authority.  My younger brother was a hellion and had progressed to committing minor Federal felonies, so I basically ordered him to study martial arts with us for six months.  By the end of that time, he’d completely lost his angst-laden teen bravado – I knew he’d be okay when one day he was assigned to spar with me and I noticed he was shaking.  When I asked him if he was cold, he said, no, he was scared.</p><p>“Why are you scared?”<br> <br>“Cause you’re gonna hit me.”<br> <br>“Yeah, so?”<br> <br>“And it’s gonna hurt!”<br> <br>“Yeah, so?”</br></br></br></br></br></br></br></br></p><p>Once I saw that he realized true strength does not involve posing and showing off in front of your friends, but the determination to get up after you get knocked down, I told him he could quit.  I don’t remember him ever showing up there again, but then, he didn’t need it anymore.  I also don’t think that it hurt him to see that the baddest black Dragon of them all, our sensei, was a cheerful, happy-go-lucky guy who was always smiling, even when he was beating the absolute <em>merde</em> out of you.</p><p>I’m a firm believer in the notion that every male needs to get beaten down at some point in his life, generally somewhere around the age of 13-16.   Maybe even sooner if you’ve got a penchant for bullying others.  Some of us definitely need it more than others.  Actually, I’m starting to think that it would do more than a few females good as well.  There’s nothing like a good right hook putting you on  your back to remind you that you are not, in fact, the center of the universe or the greatest thing since sliced bread.  I don’t advocate uncontrolled violence, but I’ve never seen a faster teacher than Mr. Pain.</p><p>Like our sensei used to say: “So, you can’t remember to keep your hands up?  Don’t worry, I’ll remind you.”</p></div>",
  "content_text": "Some friends of ours have children who have never really been disciplined.  They always marvel that the one child, who has been notoriously out of control even by modern standards, seems to particularly revere and obey me.  I’ve never told them the reason is that one day, I told him to go upstairs because his mother was calling him.  His reaction was to kick me in the groin.\nHe was very surprised when I picked him up by the throat, pulled him nose to nose and told him that if he ever kicked me again, I was going to kick him right back.  I then informed him that he would treat me and all other adults with respect in the future, or we’d have another talk with his feet dangling two feet off the ground and his face turning purple.  Then I put him down and told him to go upstairs because his mother was calling him.  He ran right upstairs without a word of complaint.\nThat was many years ago.  We’ve gotten along just fine ever since, and on the very few occasions that I’ve told him to do anything, he all but salutes.  He’s not afraid of me, but he doesn’t seem terribly keen on testing boundaries around me either.  They learn quick, those puppies.\nMartial arts is a fantastic way to help even older teenagers understand authority.  My younger brother was a hellion and had progressed to committing minor Federal felonies, so I basically ordered him to study martial arts with us for six months.  By the end of that time, he’d completely lost his angst-laden teen bravado – I knew he’d be okay when one day he was assigned to spar with me and I noticed he was shaking.  When I asked him if he was cold, he said, no, he was scared.\n“Why are you scared?”\n“Cause you’re gonna hit me.”\n“Yeah, so?”\n“And it’s gonna hurt!”\n“Yeah, so?”\nOnce I saw that he realized true strength does not involve posing and showing off in front of your friends, but the determination to get up after you get knocked down, I told him he could quit.  I don’t remember him ever showing up there again, but then, he didn’t need it anymore.  I also don’t think that it hurt him to see that the baddest black Dragon of them all, our sensei, was a cheerful, happy-go-lucky guy who was always smiling, even when he was beating the absolute\nmerde\nout of you.\nI’m a firm believer in the notion that every male needs to get beaten down at some point in his life, generally somewhere around the age of 13-16.   Maybe even sooner if you’ve got a penchant for bullying others.  Some of us definitely need it more than others.  Actually, I’m starting to think that it would do more than a few females good as well.  There’s nothing like a good right hook putting you on  your back to remind you that you are not, in fact, the center of the universe or the greatest thing since sliced bread.  I don’t advocate uncontrolled violence, but I’ve never seen a faster teacher than Mr. Pain.\nLike our sensei used to say: “So, you can’t remember to keep your hands up?  Don’t worry, I’ll remind you.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-17T20:55:00+00:00"
}