{
  "url": "https://voxday.net/2004/02/09/straight-talkin-george-delano/",
  "scraped_at": "2025-12-13T15:48:10.246434",
  "title": "Straight-talkin’ George Delano",
  "date_display": "February 9, 2004",
  "date_iso": "2004-02-09T19:10:00+00:00",
  "date_from_url": "2004-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Podhoretz writes: <em>As a frustrated White House official told me last week, everything the president has done to anger conservatives arises from proposals he made while he was running for president in 2000. They accepted his advocacy of the proposals then, so why are they complaining now? He did not run for president as a small-government conservative, and yet they backed him to the hilt four years ago. So why the enmity today?</em></p><p>It’s a good question, and a sobering one. Recall that conservatives backed Bush in 2000 without knowing just how dreadfully he and this nation would be challenged by the events of 9/11 and their aftermath. They supported him, in other words, when he was merely promising to be a big-spending conservative.  The president they got turned into a great wartime leader, and now some conservatives are griping about how he is actually fulfilling some of the promises they were willing to overlook when they wanted to back a winner four years ago.</p><p>Yeah, see this is precisely why some of us on the Right didn’t vote for him then.  And it’s why we won’t vote for him in 2004.  What I’d like to know is why no one ever lies when they run for office and then governs to the Right of their campaign promises.</p></div>",
  "content_text": "John Podhoretz writes:\nAs a frustrated White House official told me last week, everything the president has done to anger conservatives arises from proposals he made while he was running for president in 2000. They accepted his advocacy of the proposals then, so why are they complaining now? He did not run for president as a small-government conservative, and yet they backed him to the hilt four years ago. So why the enmity today?\nIt’s a good question, and a sobering one. Recall that conservatives backed Bush in 2000 without knowing just how dreadfully he and this nation would be challenged by the events of 9/11 and their aftermath. They supported him, in other words, when he was merely promising to be a big-spending conservative.  The president they got turned into a great wartime leader, and now some conservatives are griping about how he is actually fulfilling some of the promises they were willing to overlook when they wanted to back a winner four years ago.\nYeah, see this is precisely why some of us on the Right didn’t vote for him then.  And it’s why we won’t vote for him in 2004.  What I’d like to know is why no one ever lies when they run for office and then governs to the Right of their campaign promises.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-09T19:10:00+00:00"
}