{
  "url": "https://voxday.net/2004/02/25/thats-lot-of-accidents/",
  "scraped_at": "2025-12-13T15:51:13.379781",
  "title": "That’s a lot of accidents",
  "date_display": "February 25, 2004",
  "date_iso": "2004-02-25T17:55:00+00:00",
  "date_from_url": "2004-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>In a dark corner of Andrews Air Force base on the outskirts of Washington DC, America’s war-wounded come home.  The human cost of humbling tyrants.  No ceremony, no big welcome.  More than 11,000 medical evacuees have come through Andrews in the past nine months, the Air Force says.  Most, we suspect, from Iraq. But that’s <a href=\"http://www.channel4.com/news/2004/02/week_2/10_iraq2.html\">8,000 more than the Pentagon says</a> have been wounded there.  Most of those wounded in action come through the vast Walter Reed Medical Center in Washington.  The American public is, for the most part, unaware that the true casualty count of the war in Iraq may actually be higher than official figures suggest. </em></p><p>How is it possible for a republican people to make important decisions about the direction of the country when the truth is hidden from them?  This is yet another reprehensible decision for which George Delano’s administration must answer.  This isn’t some sneaking form of pro-Democratic attack, it is a simple matter of a demand for the truth.  I no longer believe the Republican Party has any more dedication to the truth than the pathologically dishonest Democratic Party, which is why I don’t support it regardless of what its supposedly conservative leaders say.  This sort of action on the part of the administration does nothing to convince me that I am incorrect in my skeptical assumptions.</p></div>",
  "content_text": "In a dark corner of Andrews Air Force base on the outskirts of Washington DC, America’s war-wounded come home.  The human cost of humbling tyrants.  No ceremony, no big welcome.  More than 11,000 medical evacuees have come through Andrews in the past nine months, the Air Force says.  Most, we suspect, from Iraq. But that’s\n8,000 more than the Pentagon says\nhave been wounded there.  Most of those wounded in action come through the vast Walter Reed Medical Center in Washington.  The American public is, for the most part, unaware that the true casualty count of the war in Iraq may actually be higher than official figures suggest.\nHow is it possible for a republican people to make important decisions about the direction of the country when the truth is hidden from them?  This is yet another reprehensible decision for which George Delano’s administration must answer.  This isn’t some sneaking form of pro-Democratic attack, it is a simple matter of a demand for the truth.  I no longer believe the Republican Party has any more dedication to the truth than the pathologically dishonest Democratic Party, which is why I don’t support it regardless of what its supposedly conservative leaders say.  This sort of action on the part of the administration does nothing to convince me that I am incorrect in my skeptical assumptions.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-25T17:55:00+00:00"
}