{
  "url": "https://voxday.net/2004/02/26/theyre-not-all-in-middle/",
  "scraped_at": "2025-12-13T15:51:21.843612",
  "title": "They’re not all in the middle",
  "date_display": "February 26, 2004",
  "date_iso": "2004-02-26T12:37:00+00:00",
  "date_from_url": "2004-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peggy Noonan writes: <em>It has been a big political week for the president, with his burly and more pointedly partisan than usual speech to the Republican governors on Monday, then his marriage announcement Tuesday. When he twitted John Kerry to the governors he signaled whom the White House not only assumes will be the Democratic nominee but prefers as an opponent. Those around the president think Mr. Kerry comes across as cold, aloof and a typical pol–“Al Gore without the charm,” as one of them put it this week.</em></p><p>But they are convinced it is going to be a close race. That’s not just spin to rev the troops; it’s their conviction. They don’t see us as a 50-50 country but as a 48-48 country, with the fight over the remaining 4% of the population. It took me aback when I heard this–not that it was surprising, but it reminded me of something Lee Atwater told me 20 years ago. Forty percent of the country will vote Democrat no matter what, he said, and 40% will vote Republican. Every presidential contest is a wrestling match for the 20% in the middle.  That was true then, or at least the polls bore it out. Now that 20 has shrunk to four. I’m not sure what that means. No one else is either. But somehow it strikes me as both inevitable and not good. </p><p>The mistake that Peggy Noonan and both sets of political operatives are making is the assumption that the middle is where the votes are to be found.  Consider that less than 52 percent of the electorate voted.  Almost every day, I hear from people who have voted Republican all their lives who are turning to the Libertarian and Constitution parties, or considering simply staying home.  Chasing the middle is counterproductive if you lose more from your right flank (or left, in the case of the Democrats) than you gain in the center.</p><p>I’m pretty much a lost cause where Republicans are concerned.  But there are many who are just beginning to think about leaving the party for the first time.  I think this is a positive development for future freedom; I’m merely surprised that it doesn’t appear to bother Republican strategists at all.</p></div>",
  "content_text": "Peggy Noonan writes:\nIt has been a big political week for the president, with his burly and more pointedly partisan than usual speech to the Republican governors on Monday, then his marriage announcement Tuesday. When he twitted John Kerry to the governors he signaled whom the White House not only assumes will be the Democratic nominee but prefers as an opponent. Those around the president think Mr. Kerry comes across as cold, aloof and a typical pol–“Al Gore without the charm,” as one of them put it this week.\nBut they are convinced it is going to be a close race. That’s not just spin to rev the troops; it’s their conviction. They don’t see us as a 50-50 country but as a 48-48 country, with the fight over the remaining 4% of the population. It took me aback when I heard this–not that it was surprising, but it reminded me of something Lee Atwater told me 20 years ago. Forty percent of the country will vote Democrat no matter what, he said, and 40% will vote Republican. Every presidential contest is a wrestling match for the 20% in the middle.  That was true then, or at least the polls bore it out. Now that 20 has shrunk to four. I’m not sure what that means. No one else is either. But somehow it strikes me as both inevitable and not good.\nThe mistake that Peggy Noonan and both sets of political operatives are making is the assumption that the middle is where the votes are to be found.  Consider that less than 52 percent of the electorate voted.  Almost every day, I hear from people who have voted Republican all their lives who are turning to the Libertarian and Constitution parties, or considering simply staying home.  Chasing the middle is counterproductive if you lose more from your right flank (or left, in the case of the Democrats) than you gain in the center.\nI’m pretty much a lost cause where Republicans are concerned.  But there are many who are just beginning to think about leaving the party for the first time.  I think this is a positive development for future freedom; I’m merely surprised that it doesn’t appear to bother Republican strategists at all.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-26T12:37:00+00:00"
}