{
  "url": "https://voxday.net/2004/02/16/they-got-colors-backward/",
  "scraped_at": "2025-12-13T15:49:34.014907",
  "title": "They got the colors backward",
  "date_display": "February 16, 2004",
  "date_iso": "2004-02-16T20:34:00+00:00",
  "date_from_url": "2004-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Professor Joseph Olson of Hamline University School of Law, St. Paul, Minnesota, points out some interesting facts concerning the most recent American Presidential election:</em></p><p>Population of counties won by: Gore 127 million Bush 143 million<br> <br>Square miles of land won by: Gore 580,000 Bush 2,427,000<br> <br>States won by: Gore 19 Bush 29<br> <br>Murder rate per 100,000 residents in counties won by:  Gore 13.2 Bush 2.1</br></br></br></br></br></br></p><p>Professor Olson adds, “In aggregate, the map of the territory Bush won was mostly the land owned by the taxpaying citizens of this great country.  Gore’s was territory encompassed those citizens living in government-owned tenements and living off government welfare…”Olson believes the U.S. is now somewhere between the “apathy” and the “complacency” phase of Professor Tyler’s definition of democracy; with some 40 percent of the nation’s population already having reached the “governmental dependency” phase.</p><p>I’m not so sure about these statistics, or even the existence of said professor.  It sure doesn’t sound like a typical Minnesota academic, for one thing.  And for another, we appear to have lost two states.  But in any event, the more significant question is: were those non-dependent taxpayers suckered?  George Delano’s performance seems to indicate that he prefers a dependent populace.  It doesn’t matter how slow you drive if you’re heading the wrong way, if you refuse to turn around.</p><p>UPDATE – Good to know my instincts were sound.  How hard is it to remember 50 states?  I didn’t even bother posting the first part as the language sounded too modern to be the quote from Tyler.  Also, academics don’t say “this great country”, politicians do.  See Snopes for <a href=\"http://www.snopes.com/politics/quotes/tyler.asp\">details on the fraud</a>.  The larger point may well be true, but it doesn’t excuse simply creating fiction to make a point.  Not if you’re going to pass it off as non-fiction, anyhow.</p></div>",
  "content_text": "Professor Joseph Olson of Hamline University School of Law, St. Paul, Minnesota, points out some interesting facts concerning the most recent American Presidential election:\nPopulation of counties won by: Gore 127 million Bush 143 million\nSquare miles of land won by: Gore 580,000 Bush 2,427,000\nStates won by: Gore 19 Bush 29\nMurder rate per 100,000 residents in counties won by:  Gore 13.2 Bush 2.1\nProfessor Olson adds, “In aggregate, the map of the territory Bush won was mostly the land owned by the taxpaying citizens of this great country.  Gore’s was territory encompassed those citizens living in government-owned tenements and living off government welfare…”Olson believes the U.S. is now somewhere between the “apathy” and the “complacency” phase of Professor Tyler’s definition of democracy; with some 40 percent of the nation’s population already having reached the “governmental dependency” phase.\nI’m not so sure about these statistics, or even the existence of said professor.  It sure doesn’t sound like a typical Minnesota academic, for one thing.  And for another, we appear to have lost two states.  But in any event, the more significant question is: were those non-dependent taxpayers suckered?  George Delano’s performance seems to indicate that he prefers a dependent populace.  It doesn’t matter how slow you drive if you’re heading the wrong way, if you refuse to turn around.\nUPDATE – Good to know my instincts were sound.  How hard is it to remember 50 states?  I didn’t even bother posting the first part as the language sounded too modern to be the quote from Tyler.  Also, academics don’t say “this great country”, politicians do.  See Snopes for\ndetails on the fraud\n.  The larger point may well be true, but it doesn’t excuse simply creating fiction to make a point.  Not if you’re going to pass it off as non-fiction, anyhow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-16T20:34:00+00:00"
}