{
  "url": "https://voxday.net/2004/02/17/vaccines-and-wsj/",
  "scraped_at": "2025-12-13T15:49:35.879468",
  "title": "Vaccines and the WSJ",
  "date_display": "February 17, 2004",
  "date_iso": "2004-02-17T07:21:00+00:00",
  "date_from_url": "2004-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Wall Street Journal blathers: <em><a href=\"http://www.opinionjournal.com/editorial/feature.html?id=110004700\">Everyone in our business</a> learns to take a punch, but even we’ve been surprised by the furious response to an editorial we ran a few weeks ago about vaccines. The subject deserves further attention, not least because the goal of our antagonists appears to be to shut down public debate on the matter.  For the past few years, a small coterie of parents has taken to loudly claiming that thimerosal, a preservative used in vaccines for 60 years, is the cause of autism in their children. Their allegations have scared many parents about immunizations, sent trial lawyers scurrying to sue the few remaining vaccine makers, and inspired an ugly political dispute. Lost in the controversy has been a little thing called science.</em></p><p>What a total crock.  Every time I look into the “studies” that have been performed, it’s some kind of meta study or soft scientific equivalent.  There has never been a single, proper double-blind study with a statistically significant number of test objects receiving live and dummy vaccines of which I am aware.  The vaccine proponents claims such a study would be immoral because it would leave half the children unvaccinated – that doesn’t sound scientifically objective to me, it sounds like a predetermined bias towards an unknown result.  To claim that science is being ignored only by the vaccine opponents is so dishonest it has to be willful.</p><p>Furthermore, logic dictates that the government protection offered to vaccine makers, protection unavailable to almost any manufacturer or retailer in America, indicates that the probability of harm is well known.  You will never convince a parent of a healthy child who dies or slips into autism only hours after getting a shot that vaccines are wholly safe.  Finally, there’s one vital piece of evidence that vaccines are bad for you: the government is for them.  Enough said.</p><p>One respondent to the article replied: <em>The WSJ is correct in saying there is no established proof that thimerosal causes autism. There’s also no established proof it doesn’t, and the National Institute of Health has called such a link plausible. Hearings last week showed the scientific community divided on the question, and parents’ fears have not been calmed by a CDC study that said one thing in draft and another in final release–after the data had been blatantly altered. Sen. Frist’s attempt to “modernize” VICP [the government immunity for vaccine makers] by sneaking through liability immunization for his favorite contributors in anonymous “Homeland Security” riders didn’t help either. </em></p></div>",
  "content_text": "The Wall Street Journal blathers:\nEveryone in our business\nlearns to take a punch, but even we’ve been surprised by the furious response to an editorial we ran a few weeks ago about vaccines. The subject deserves further attention, not least because the goal of our antagonists appears to be to shut down public debate on the matter.  For the past few years, a small coterie of parents has taken to loudly claiming that thimerosal, a preservative used in vaccines for 60 years, is the cause of autism in their children. Their allegations have scared many parents about immunizations, sent trial lawyers scurrying to sue the few remaining vaccine makers, and inspired an ugly political dispute. Lost in the controversy has been a little thing called science.\nWhat a total crock.  Every time I look into the “studies” that have been performed, it’s some kind of meta study or soft scientific equivalent.  There has never been a single, proper double-blind study with a statistically significant number of test objects receiving live and dummy vaccines of which I am aware.  The vaccine proponents claims such a study would be immoral because it would leave half the children unvaccinated – that doesn’t sound scientifically objective to me, it sounds like a predetermined bias towards an unknown result.  To claim that science is being ignored only by the vaccine opponents is so dishonest it has to be willful.\nFurthermore, logic dictates that the government protection offered to vaccine makers, protection unavailable to almost any manufacturer or retailer in America, indicates that the probability of harm is well known.  You will never convince a parent of a healthy child who dies or slips into autism only hours after getting a shot that vaccines are wholly safe.  Finally, there’s one vital piece of evidence that vaccines are bad for you: the government is for them.  Enough said.\nOne respondent to the article replied:\nThe WSJ is correct in saying there is no established proof that thimerosal causes autism. There’s also no established proof it doesn’t, and the National Institute of Health has called such a link plausible. Hearings last week showed the scientific community divided on the question, and parents’ fears have not been calmed by a CDC study that said one thing in draft and another in final release–after the data had been blatantly altered. Sen. Frist’s attempt to “modernize” VICP [the government immunity for vaccine makers] by sneaking through liability immunization for his favorite contributors in anonymous “Homeland Security” riders didn’t help either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-17T07:21:00+00:00"
}