{
  "url": "https://voxday.net/2004/02/22/vox-live/",
  "scraped_at": "2025-12-13T15:50:34.625401",
  "title": "Vox Live",
  "date_display": "February 22, 2004",
  "date_iso": "2004-02-22T15:50:00+00:00",
  "date_from_url": "2004-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Doug Kenline suggests <a href=\"http://www.channelstorm.com\">Channel Storm</a>, which does look like an interesting solution.  Of course, I’m not a Mac guy, so unless someone feels like contributing a G4-powered Macintosh out of what Space Bunny would probably be the first to tell you – no, actually White Buffalo would – would have to be a seriously inordinate interest in whatever I have to say, I can’t see it happening terribly soon now.</p><p>The MP3 radio concept is possibly more workable.  Using a texting system to substitute for call-ins might be workable and have the additional advantage of preventing the likelihood of things devolving into shouting matches – just a thought – although I don’t know why anyone would want to have listened to my voice the last twelve days anyhow.  In a textual world, no one has to know exactly how badly your mucus membranes are draining.</p><p>Anyhow, I’ll start looking into it.  If anyone has any thoughts – and remember, I prefer Linux solutions – shoot them this way.  The problem is that I’m not particularly interested in playing producer, and without much effort in that area, whatever is done is likely to basically suck.  I mean, why do you think I’m using Blogger and Haloscan in the first place?  Because they require zero effort on my part, allowing me to concentrate on the part I enjoy.</p></div>",
  "content_text": "Doug Kenline suggests\nChannel Storm\n, which does look like an interesting solution.  Of course, I’m not a Mac guy, so unless someone feels like contributing a G4-powered Macintosh out of what Space Bunny would probably be the first to tell you – no, actually White Buffalo would – would have to be a seriously inordinate interest in whatever I have to say, I can’t see it happening terribly soon now.\nThe MP3 radio concept is possibly more workable.  Using a texting system to substitute for call-ins might be workable and have the additional advantage of preventing the likelihood of things devolving into shouting matches – just a thought – although I don’t know why anyone would want to have listened to my voice the last twelve days anyhow.  In a textual world, no one has to know exactly how badly your mucus membranes are draining.\nAnyhow, I’ll start looking into it.  If anyone has any thoughts – and remember, I prefer Linux solutions – shoot them this way.  The problem is that I’m not particularly interested in playing producer, and without much effort in that area, whatever is done is likely to basically suck.  I mean, why do you think I’m using Blogger and Haloscan in the first place?  Because they require zero effort on my part, allowing me to concentrate on the part I enjoy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-22T15:50:00+00:00"
}