{
  "url": "https://voxday.net/2004/02/07/why-media-hates-bloggers/",
  "scraped_at": "2025-12-13T15:47:49.662035",
  "title": "Why the media hates bloggers",
  "date_display": "February 7, 2004",
  "date_iso": "2004-02-07T16:52:00+00:00",
  "date_from_url": "2004-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tasty Manatees <a href=\"http://www.tastymanatees.com/archives/000450.html\">sums it up very well</a> – competition, and dangerous competition at that: <em>What’s important is that Goldberg and his fellow pundits have almost no idea how the Federal regulatory process works when they write about the Environmental Protection Agency or why Senator So-and-So chose blue socks this morning. They mostly rely on the opinions of experts like me who spent years in school and practice learning how to do what we do or insiders who see what goes on behind the scenes. There are no required qualifications for writing other than knowing how to write competent and interesting prose in the English language, a task that many of the “experts” can do quite well (other than myself, of course). Now, the inside men and the experts that the journalists and pundits have relied on for years don’t need them to get their points across. Most of us don’t realize it, yet, but in time, we will.</em></p><p>It’s true.  I realize that most of you probably view me as a media figure, but I’m not.  I’ve never had a regular day-job at a newspaper or magazine, and while I’ve got a reasonably respectable publishing history, it’s pretty much been done as a hobby.  I did not take a single English or journalism course throughout my college career, which is probably why I actually know something about a variety of industries – having worked in them – unlike many cradle-to-grave journalistas.  I consider this blog to be as important to me as my column; more important in some ways.</p><p>There are exceptions, of course, but they are few and far between.  The dirty little secret of journalism is that most career journalists have a very broad but shallow knowledge base.  Interestingly enough, they tend not to be very intellectual, so they tend to be poorly read as well.  Also, as verbally oriented people, they tend to overrate verbally facile people and underrate those whose intelligence manifests itself in less immediately obvious ways.<br> <br><em><br> <br>This post brought to you courtesy of <a href=\"http://blackfive.blogs.com/\">Blackfive, the paratrooper of love</a>.</br></br></em></br></br></p></div>",
  "content_text": "Tasty Manatees\nsums it up very well\n– competition, and dangerous competition at that:\nWhat’s important is that Goldberg and his fellow pundits have almost no idea how the Federal regulatory process works when they write about the Environmental Protection Agency or why Senator So-and-So chose blue socks this morning. They mostly rely on the opinions of experts like me who spent years in school and practice learning how to do what we do or insiders who see what goes on behind the scenes. There are no required qualifications for writing other than knowing how to write competent and interesting prose in the English language, a task that many of the “experts” can do quite well (other than myself, of course). Now, the inside men and the experts that the journalists and pundits have relied on for years don’t need them to get their points across. Most of us don’t realize it, yet, but in time, we will.\nIt’s true.  I realize that most of you probably view me as a media figure, but I’m not.  I’ve never had a regular day-job at a newspaper or magazine, and while I’ve got a reasonably respectable publishing history, it’s pretty much been done as a hobby.  I did not take a single English or journalism course throughout my college career, which is probably why I actually know something about a variety of industries – having worked in them – unlike many cradle-to-grave journalistas.  I consider this blog to be as important to me as my column; more important in some ways.\nThere are exceptions, of course, but they are few and far between.  The dirty little secret of journalism is that most career journalists have a very broad but shallow knowledge base.  Interestingly enough, they tend not to be very intellectual, so they tend to be poorly read as well.  Also, as verbally oriented people, they tend to overrate verbally facile people and underrate those whose intelligence manifests itself in less immediately obvious ways.\nThis post brought to you courtesy of\nBlackfive, the paratrooper of love\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-07T16:52:00+00:00"
}