{
  "url": "https://voxday.net/2004/02/25/will-wonders-never-cease-6/",
  "scraped_at": "2025-12-13T15:51:05.995414",
  "title": "Will wonders never cease",
  "date_display": "February 25, 2004",
  "date_iso": "2004-02-25T14:28:00+00:00",
  "date_from_url": "2004-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First Pravda, now Salon.  The Right Hook prints a fair bit of yesterday’s column verbatim: <em>Other conservatives are more troubled by Bush’s war policies. Vox Day, a self-described “Christian libertarian” and syndicated columnist, declares on right-wing Web tabloid World Net Daily: “Our matchless soldiers have won the war” in Iraq, but “cannot win the peace.” Day makes clear he’s a fervent supporter of the military, but argues that the Bush administration’s exercise of U.S. military power in Iraq and elsewhere is irresponsible and dangerous:</em></p><p>“The policy of Pax Americana enforced by our troops stationed around the world is not only a failure, it is leading to the corruption of the American military …   “A military machine is a delicate creature, designed to do one thing very well — destroy the opposition. It is a well-known fact of military history that fighting troops and garrison troops are two very different things, and attempting to turn the former into the latter significantly impedes their ability to perform their primary mission.</p><p>“Consider that the U.S. military accomplished its mission in Iraq — taking Baghdad and destroying the Hussein regime — with the loss of 106 soldiers in battle and accidents. Since then, the occupation has cost another 437 American lives lost to combat, accidents and suicide. Consider also that the wars for Kuwait and Afghanistan cost 247 and 76 combat deaths, respectively.”</p><p>But in the Middle East, says Day, the U.S. has in fact failed to complete the mission:</p><p>“The beheading of the Hussein regime sent a powerful message to America’s enemies. The subsequent elimination of the Saudi and Iranian regimes would have cost fewer American lives and been an even more powerful demonstration of American might, perhaps strong enough to bring a generation of peace. But instead, America has chosen to play Israel’s futile game of one step forward, one step back, allowing its enemies to regroup in safe havens, then come back and attack troops who are pinned down like sitting ducks. This is an old game, dating back to the Korean police action, and it has never played out well, demonstrated most clearly by the continuing threat posed by North Korea …</p><p>“Stationing troops in 144 of the 191 U.N. member states around the world has not brought peace. History proves that no utopian vision, however sweeping, will ever bring a permanent peace. Let us then abandon visions of a global Pax Americana, bring our soldiers home, and only send them forth when war is necessary and declared. And when the war is won and the enemy is destroyed, bring the troops home again immediately. They deserve no less.”</p><p>They got the right-wing part correct, although I’m hardly a conservative.  I’m not surprised that the Left would attempt to use me against Bush – their philosophy has always been “by any means necessary”.  But then, intellectual consistency has never been a part of their game, either.  Consider how they’re actually turning to states rights as a means of trying to support government redefinition of marriage.  I find it interesting that their hunger for power exceeds their desire to support proactive Wilsonian foreign involvement.</p><p>Thanks to <a href=\"http://www.evangelicaloutpost.com\">Evangelical Outpost</a> for bringing this to my attention.</p></div>",
  "content_text": "First Pravda, now Salon.  The Right Hook prints a fair bit of yesterday’s column verbatim:\nOther conservatives are more troubled by Bush’s war policies. Vox Day, a self-described “Christian libertarian” and syndicated columnist, declares on right-wing Web tabloid World Net Daily: “Our matchless soldiers have won the war” in Iraq, but “cannot win the peace.” Day makes clear he’s a fervent supporter of the military, but argues that the Bush administration’s exercise of U.S. military power in Iraq and elsewhere is irresponsible and dangerous:\n“The policy of Pax Americana enforced by our troops stationed around the world is not only a failure, it is leading to the corruption of the American military …   “A military machine is a delicate creature, designed to do one thing very well — destroy the opposition. It is a well-known fact of military history that fighting troops and garrison troops are two very different things, and attempting to turn the former into the latter significantly impedes their ability to perform their primary mission.\n“Consider that the U.S. military accomplished its mission in Iraq — taking Baghdad and destroying the Hussein regime — with the loss of 106 soldiers in battle and accidents. Since then, the occupation has cost another 437 American lives lost to combat, accidents and suicide. Consider also that the wars for Kuwait and Afghanistan cost 247 and 76 combat deaths, respectively.”\nBut in the Middle East, says Day, the U.S. has in fact failed to complete the mission:\n“The beheading of the Hussein regime sent a powerful message to America’s enemies. The subsequent elimination of the Saudi and Iranian regimes would have cost fewer American lives and been an even more powerful demonstration of American might, perhaps strong enough to bring a generation of peace. But instead, America has chosen to play Israel’s futile game of one step forward, one step back, allowing its enemies to regroup in safe havens, then come back and attack troops who are pinned down like sitting ducks. This is an old game, dating back to the Korean police action, and it has never played out well, demonstrated most clearly by the continuing threat posed by North Korea …\n“Stationing troops in 144 of the 191 U.N. member states around the world has not brought peace. History proves that no utopian vision, however sweeping, will ever bring a permanent peace. Let us then abandon visions of a global Pax Americana, bring our soldiers home, and only send them forth when war is necessary and declared. And when the war is won and the enemy is destroyed, bring the troops home again immediately. They deserve no less.”\nThey got the right-wing part correct, although I’m hardly a conservative.  I’m not surprised that the Left would attempt to use me against Bush – their philosophy has always been “by any means necessary”.  But then, intellectual consistency has never been a part of their game, either.  Consider how they’re actually turning to states rights as a means of trying to support government redefinition of marriage.  I find it interesting that their hunger for power exceeds their desire to support proactive Wilsonian foreign involvement.\nThanks to\nEvangelical Outpost\nfor bringing this to my attention.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-25T14:28:00+00:00"
}