{
  "url": "https://voxday.net/2004/02/13/wont-you-help-hi/",
  "scraped_at": "2025-12-13T15:49:04.072614",
  "title": "Won’t you help him?",
  "date_display": "February 13, 2004",
  "date_iso": "2004-02-13T15:07:00+00:00",
  "date_from_url": "2004-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Billy Evans writes: <em>My name is Billy Evans. I am a very sick little boy.  My mother is typing this for me, because I can’t. She is crying. The reason she is so sad is because I’m so sick. I was born without a body. It doesn’t hurt, except when I try to breathe.  The doctors gave me an artificial body. It is a burlap Bag filled with leaves. The doctors said that was the Best they could do ON account of us having No money OR Insurance. I would like to have a body transplant, but we need more money. Mommy doesn’t work because she said nobody Hires crying people. I said, ” Don’t cry, Mommy and ” and She hugged my burlap bag. Mommy always gives me hugs, Even though she’s allergic to burlap and it makes her sneeze and chafes her real bad.</em></p><p>I hope you will help me. You can help me if you Forward this email to everyone you know. Forward it to People you don’t know, the too. Dr. Johansen said that for every person you forward this email to, Bill Gates Will team up with AOL and send a nickel to NASA. With that funding, NASA will collect prayers from school Children all over America and have the astronauts take them up into space so that the angels can hear them Better…. What kind of cruel person are you that you can’t take Five freakin’ minutes to forward this to all your Friends so that they can feel guilt and shame about Ignoring A poor, bodiless nine-year-old boy? Please help me.</p><p>This desperate plea for help brought to you by reader and Good Samaritan JN.</p></div>",
  "content_text": "Billy Evans writes:\nMy name is Billy Evans. I am a very sick little boy.  My mother is typing this for me, because I can’t. She is crying. The reason she is so sad is because I’m so sick. I was born without a body. It doesn’t hurt, except when I try to breathe.  The doctors gave me an artificial body. It is a burlap Bag filled with leaves. The doctors said that was the Best they could do ON account of us having No money OR Insurance. I would like to have a body transplant, but we need more money. Mommy doesn’t work because she said nobody Hires crying people. I said, ” Don’t cry, Mommy and ” and She hugged my burlap bag. Mommy always gives me hugs, Even though she’s allergic to burlap and it makes her sneeze and chafes her real bad.\nI hope you will help me. You can help me if you Forward this email to everyone you know. Forward it to People you don’t know, the too. Dr. Johansen said that for every person you forward this email to, Bill Gates Will team up with AOL and send a nickel to NASA. With that funding, NASA will collect prayers from school Children all over America and have the astronauts take them up into space so that the angels can hear them Better…. What kind of cruel person are you that you can’t take Five freakin’ minutes to forward this to all your Friends so that they can feel guilt and shame about Ignoring A poor, bodiless nine-year-old boy? Please help me.\nThis desperate plea for help brought to you by reader and Good Samaritan JN.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-13T15:07:00+00:00"
}