{
  "url": "https://voxday.net/2004/02/24/writers-friend/",
  "scraped_at": "2025-12-13T15:50:39.462173",
  "title": "The writer’s friend",
  "date_display": "February 24, 2004",
  "date_iso": "2004-02-24T09:14:00+00:00",
  "date_from_url": "2004-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been meaning to talk up my little toy for a while, but I just hadn’t gotten around to it.  This is as good a time as any, I suppose, since I found it very useful on a recent six-hour trip.  Imagine being able to carry a 200-volume library around with you at all times, instantly accessible and with a backlight so you can read in the dark.  War and Peace, the Brothers Karamazov and the complete Aristotle ouvre balanced by the entire 20-book Aubrey-Maturin series, the eight Flinx novels and everything Douglas Adams ever wrote.</p><p>Now, add to that a nice keyboard with full-size keys, enough data storage to satisfy Stephen King’s annual output – and did I mention instant-on capacity?  Not to mention the ability to easily sync Microsoft Word documents.  And a battery life that doesn’t quite live up to its 30-hour billing, but far exceeds a laptop plus a pair of spare batteries.  Yeah, I thought I just saw you lick your lips.</p><p>Oh, she’s not perfect.  The screen scratches a bit too easily – in a year I’ve put one chip and one minute scratch in it – and there’s no way to shield it properly.  The backlight drains her fast, and she hums annoyingly in the process.  The Microsoft Word sync won’t sync with the permanent SmartDrive storage, adding what should be an unnecessary pair of steps to the backup process.</p><p>But it is indeed a handy little thing.  I managed to not only read a quality Dan Simmons short story but an entire mind-candy sci-fi novel in addition to knocking out a thousand words on my next novel, bringing me to within shouting distance of the end.  A good thing, too, since I’m supposed to turn it in at the end of March.  Every writer really should take a good, hard look at the <a href=\"http://www.alphasmart.com\">Alphasmart Dana</a>.</p></div>",
  "content_text": "I’ve been meaning to talk up my little toy for a while, but I just hadn’t gotten around to it.  This is as good a time as any, I suppose, since I found it very useful on a recent six-hour trip.  Imagine being able to carry a 200-volume library around with you at all times, instantly accessible and with a backlight so you can read in the dark.  War and Peace, the Brothers Karamazov and the complete Aristotle ouvre balanced by the entire 20-book Aubrey-Maturin series, the eight Flinx novels and everything Douglas Adams ever wrote.\nNow, add to that a nice keyboard with full-size keys, enough data storage to satisfy Stephen King’s annual output – and did I mention instant-on capacity?  Not to mention the ability to easily sync Microsoft Word documents.  And a battery life that doesn’t quite live up to its 30-hour billing, but far exceeds a laptop plus a pair of spare batteries.  Yeah, I thought I just saw you lick your lips.\nOh, she’s not perfect.  The screen scratches a bit too easily – in a year I’ve put one chip and one minute scratch in it – and there’s no way to shield it properly.  The backlight drains her fast, and she hums annoyingly in the process.  The Microsoft Word sync won’t sync with the permanent SmartDrive storage, adding what should be an unnecessary pair of steps to the backup process.\nBut it is indeed a handy little thing.  I managed to not only read a quality Dan Simmons short story but an entire mind-candy sci-fi novel in addition to knocking out a thousand words on my next novel, bringing me to within shouting distance of the end.  A good thing, too, since I’m supposed to turn it in at the end of March.  Every writer really should take a good, hard look at the\nAlphasmart Dana\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-02-24T09:14:00+00:00"
}