{
  "url": "https://voxday.net/2003/12/09/about-time-2/",
  "scraped_at": "2025-12-13T15:37:54.760803",
  "title": "About time",
  "date_display": "December 9, 2003",
  "date_iso": "2003-12-09T08:33:00+00:00",
  "date_from_url": "2003-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em><a href=\"http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2003/12/09/weu09.xml&amp;sSheet=/news/2003/12/09/ixworld.html&amp;secureRefresh=true&amp;_requestid=173022\">The latest Eurobarometer</a> to be released this week found that just 48 per cent of EU citizens viewed membership as a “good thing”, down from 54 per cent last spring.  Britain was by far the most negative state, with positive feelings tumbling to 28 per cent, but even the French were below half for the first time after months of battles with Brussels over tax cuts and illegal aid to ailing firms.</em></p><p>Next to the UN, the European Union is the most dangerous ur-governmental entity on the planet.  I’m glad that the people of Europe are finally beginning to wake up to the neo-fascist monster that is devouring them.  Better late than never.<br> <br><em><br> <br>When the sole East European member dared to raise a dissenting voice he was told his vote “didn’t count”.</br></br></em></br></br></p><p>That’s what you get when you deal with intellectual heirs of Jacobins and Nazis, who dream of reviving the Carolingian empire.  He was probably surprised.  I’m not.</p></div>",
  "content_text": "The latest Eurobarometer\nto be released this week found that just 48 per cent of EU citizens viewed membership as a “good thing”, down from 54 per cent last spring.  Britain was by far the most negative state, with positive feelings tumbling to 28 per cent, but even the French were below half for the first time after months of battles with Brussels over tax cuts and illegal aid to ailing firms.\nNext to the UN, the European Union is the most dangerous ur-governmental entity on the planet.  I’m glad that the people of Europe are finally beginning to wake up to the neo-fascist monster that is devouring them.  Better late than never.\nWhen the sole East European member dared to raise a dissenting voice he was told his vote “didn’t count”.\nThat’s what you get when you deal with intellectual heirs of Jacobins and Nazis, who dream of reviving the Carolingian empire.  He was probably surprised.  I’m not.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-09T08:33:00+00:00"
}