{
  "url": "https://voxday.net/2003/12/26/and-one-more-gif/",
  "scraped_at": "2025-12-13T15:40:07.671547",
  "title": "And one more gift",
  "date_display": "December 26, 2003",
  "date_iso": "2003-12-26T15:37:00+00:00",
  "date_from_url": "2003-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>However much it would bother the official Favorite Scottish Neo-pagan of Vox Popoli, I consider this to be a real Christmas present of sorts.  Mr. Charles Stross announces that he has finished the first draft of the ninth and final novellette of <em>Accelerando</em>.  The novel will be published by Ace in 2005.  I will certainly be picking up a copy of that, along with <em>Glasshouse</em>, its already-written – albet not yet published – sequel.</p><p>I sent him an invitation today to be interviewed on the fascinating subject of singularity.  The short length of a column cannot possibly do him justice, of course, but we can post the whole thing right here.  Ah, yes, the joy of the blog….</p><p>UPDATE – Before we make it official, we should probably make sure that <a href=\"http://mitglied.lycos.de/tombraiderpics/Downloads/Pics/Lc/NellMcAndrew/laranell001.jpg\">Nell McAndrew </a>is not a neo-pagan herself first.  As much as we admire Mr. Stross, there is simply <a href=\"http://www.antipope.org/charlie/pix/charlie-scaled.jpg\">no comparison</a>.  Shall we say, presumptive Favorite Scottish Neo-pagan,  then?</p></div>",
  "content_text": "However much it would bother the official Favorite Scottish Neo-pagan of Vox Popoli, I consider this to be a real Christmas present of sorts.  Mr. Charles Stross announces that he has finished the first draft of the ninth and final novellette of\nAccelerando\n.  The novel will be published by Ace in 2005.  I will certainly be picking up a copy of that, along with\nGlasshouse\n, its already-written – albet not yet published – sequel.\nI sent him an invitation today to be interviewed on the fascinating subject of singularity.  The short length of a column cannot possibly do him justice, of course, but we can post the whole thing right here.  Ah, yes, the joy of the blog….\nUPDATE – Before we make it official, we should probably make sure that\nNell McAndrew\nis not a neo-pagan herself first.  As much as we admire Mr. Stross, there is simply\nno comparison\n.  Shall we say, presumptive Favorite Scottish Neo-pagan,  then?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-26T15:37:00+00:00"
}