{
  "url": "https://voxday.net/2003/12/28/because-hes-coward/",
  "scraped_at": "2025-12-13T15:40:30.702916",
  "title": "Because he’s a coward",
  "date_display": "December 28, 2003",
  "date_iso": "2003-12-28T20:38:00+00:00",
  "date_from_url": "2003-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tim Graham writes in NRO’s Corner: <em>Al Franken’s boast in his book that he challenged Rich Lowry to a fistfight gains a little bit of perspective in today’s Washington Post magazine. Humor columnist Gene Weingarten wanted to parody a moment of right-left civility, but guess who was too “busy” to even get in an e-mail sandbox with one of his hate objects, the Ann Coulter doll:</em></p><p>“I decided to invite an arch-liberal and an arch-conservative to meet in this column and constructively discuss their differences, with me as moderator. I wanted the liberal to be Al Franken, the author of the best-selling Lies and the Lying Liars Who Tell Them, and the conservative to be Ann Coulter, author of the best-selling Traitor: Liberal Treachery From the Cold War to the War on Terrorism. Ann agreed right away. But Al begged off, saying he was too ‘busy,’ even for a worthy cause like helping combat the plague of name-calling. What a milksoppy, pantywaist, jellyfish, weasel-out wuss he turned out to be.” Weingarten reports that Michael Kinsley and Molly Ivins also rejected the challenge. So Gene and Ann have a typically Weingartenesque exchange on toilet paper and the merits of dogs vs. cats. </p><p>I still haven’t heard back from Al about <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=34828\">my challenge</a>.  So, obviously he’s just as much of a coward as he claims Rich Lowry to be.   I have to admit, I’d never considered making the same offer to Mr. Kinsley or Ms Ivins – I imagine Molly probably packs an okay punch, but she’s surely about as quick as molasses.  I am, of course, far too much of a elite university-neutered, gender bias-free, sensitive New Age 90’s male to harbor any compunction about <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=32034\">beating down a woman</a>, even one who is old, fat and slow.  We’re all equal, right?</p></div>",
  "content_text": "Tim Graham writes in NRO’s Corner:\nAl Franken’s boast in his book that he challenged Rich Lowry to a fistfight gains a little bit of perspective in today’s Washington Post magazine. Humor columnist Gene Weingarten wanted to parody a moment of right-left civility, but guess who was too “busy” to even get in an e-mail sandbox with one of his hate objects, the Ann Coulter doll:\n“I decided to invite an arch-liberal and an arch-conservative to meet in this column and constructively discuss their differences, with me as moderator. I wanted the liberal to be Al Franken, the author of the best-selling Lies and the Lying Liars Who Tell Them, and the conservative to be Ann Coulter, author of the best-selling Traitor: Liberal Treachery From the Cold War to the War on Terrorism. Ann agreed right away. But Al begged off, saying he was too ‘busy,’ even for a worthy cause like helping combat the plague of name-calling. What a milksoppy, pantywaist, jellyfish, weasel-out wuss he turned out to be.” Weingarten reports that Michael Kinsley and Molly Ivins also rejected the challenge. So Gene and Ann have a typically Weingartenesque exchange on toilet paper and the merits of dogs vs. cats.\nI still haven’t heard back from Al about\nmy challenge\n.  So, obviously he’s just as much of a coward as he claims Rich Lowry to be.   I have to admit, I’d never considered making the same offer to Mr. Kinsley or Ms Ivins – I imagine Molly probably packs an okay punch, but she’s surely about as quick as molasses.  I am, of course, far too much of a elite university-neutered, gender bias-free, sensitive New Age 90’s male to harbor any compunction about\nbeating down a woman\n, even one who is old, fat and slow.  We’re all equal, right?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-28T20:38:00+00:00"
}