{
  "url": "https://voxday.net/2003/12/09/biggest-scanda/",
  "scraped_at": "2025-12-13T15:37:52.876829",
  "title": "The biggest scandal",
  "date_display": "December 9, 2003",
  "date_iso": "2003-12-09T08:12:00+00:00",
  "date_from_url": "2003-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>according to the <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36023\">Environmental Protection Agency</a>, they were giving these kids very toxic levels of mercury. I mean as a 150- to 200-pound adult the EPA says you’re not supposed to take in more than one microgram per day. They were taking little seven- and 10-pound babies and pumping 50 and 75 micrograms of mercury into them in one shot. That’s like giving an adult 1,000 micrograms.</em></p><p>Once the truth comes out, this will be the biggest scandal in American history.  Bigger than the Federal income tax fraud and bigger than the Federal Reserve’s inflation scam.  That’s just money, but this is the ruined health and minds of two generation of children.  I have no doubt that the CDC were horrified once they realized just what had been wrought and are doing their best to hide the truth so that they and the vaccine makers aren’t lynched by thousands of furious parents.</p><p>I didn’t know a single autistic child when I was a kid, and we got a small number of shots.  Now, children get 21 shots before they turn two, and there is an autistic child or two in almost every social circle.  This isn’t just the diagnosis people going overboard, as with ADD, these are mental and developmental problems obvious to anyone who spends five minutes with the kid.  For those who are dubious, consider the following logic.  The US Congress protects both the vaccine makers and doctors from liability.  If there’s no danger from vaccines, why this unusual freedom from liability?  Second, the Federal fund for vaccine-damaged children has paid out hundreds of millions of dollars despite the fact that it’s extremely hard to prove vaccine damage by their standards.  If there’s no danger from vaccines, how is this possible?  If one microgram of mercury is dangerous for an adult, how is 50 micrograms not dangerous for an infant weighing 25 times less?</p><p>If anyone wants to take issue, <em>answer these questions</em>.  Don’t cite a lack of studies on the issue, since almost none have been done.  Metastudies are worthless, while the solution to finding the truth is easy.  Take two thousand children.  Shoot one thousand up with the usual vaccine load, and leave the other thousand unvaccinated.  Track them for ten years and see which group is healthier and in better shape.  Why hasn’t this been done?  Because, the vaccine lobby says, it would be unethical to not vaccinate a group of children.  Right – nothing to see, don’t look here, just move along, people.</p></div>",
  "content_text": "according to the\nEnvironmental Protection Agency\n, they were giving these kids very toxic levels of mercury. I mean as a 150- to 200-pound adult the EPA says you’re not supposed to take in more than one microgram per day. They were taking little seven- and 10-pound babies and pumping 50 and 75 micrograms of mercury into them in one shot. That’s like giving an adult 1,000 micrograms.\nOnce the truth comes out, this will be the biggest scandal in American history.  Bigger than the Federal income tax fraud and bigger than the Federal Reserve’s inflation scam.  That’s just money, but this is the ruined health and minds of two generation of children.  I have no doubt that the CDC were horrified once they realized just what had been wrought and are doing their best to hide the truth so that they and the vaccine makers aren’t lynched by thousands of furious parents.\nI didn’t know a single autistic child when I was a kid, and we got a small number of shots.  Now, children get 21 shots before they turn two, and there is an autistic child or two in almost every social circle.  This isn’t just the diagnosis people going overboard, as with ADD, these are mental and developmental problems obvious to anyone who spends five minutes with the kid.  For those who are dubious, consider the following logic.  The US Congress protects both the vaccine makers and doctors from liability.  If there’s no danger from vaccines, why this unusual freedom from liability?  Second, the Federal fund for vaccine-damaged children has paid out hundreds of millions of dollars despite the fact that it’s extremely hard to prove vaccine damage by their standards.  If there’s no danger from vaccines, how is this possible?  If one microgram of mercury is dangerous for an adult, how is 50 micrograms not dangerous for an infant weighing 25 times less?\nIf anyone wants to take issue,\nanswer these questions\n.  Don’t cite a lack of studies on the issue, since almost none have been done.  Metastudies are worthless, while the solution to finding the truth is easy.  Take two thousand children.  Shoot one thousand up with the usual vaccine load, and leave the other thousand unvaccinated.  Track them for ten years and see which group is healthier and in better shape.  Why hasn’t this been done?  Because, the vaccine lobby says, it would be unethical to not vaccinate a group of children.  Right – nothing to see, don’t look here, just move along, people.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-09T08:12:00+00:00"
}