{
  "url": "https://voxday.net/2003/12/02/bloody-right-hes-hero/",
  "scraped_at": "2025-12-13T15:36:56.395029",
  "title": "Bloody right he’s a hero",
  "date_display": "December 2, 2003",
  "date_iso": "2003-12-02T15:46:00+00:00",
  "date_from_url": "2003-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Gloria Feldt, president of Planned Parenthood Federation of America, sent out an e-mail to some 80,000 abortion-rights advocates across the country to advertise the group’s effort to protect the Austin project.  The e-mail references Danze by name, calls him an “out-of-control anti-choice fanatic” and accuses him of harassing local builders and threatening to blacklist them.</em></p><p>“As alarming as you and I find his blacklist strategy, anti-choice activists around the country <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35896\">consider Mr. Danze a hero</a> and right now, they’re eagerly pursuing ways to bring his harassing tactics to more communities,” Feldt wrote in the e-mail. “We’ve got to let friends and foes alike know that, for every out-of-control anti-choice fanatic that crawls out of the woodwork, there are thousands of us ready, willing and able to defend the essential health services that Planned Parenthood clinics provide for women and families all across this country.”</p><p>Color me an out-of-control anti-choice fanatic too.  Or, as I would put it, someone who is extreme about not killing children in any way for any reason.  Got a problem with that, Oberleutnant Feldt?  Essential health services – what a crock of propagandistic Newspeak.  I have zero tolerance for the executioners of Planned Parenthood.  If we were willing to carpet-bomb Dresden in the interest of preventing Germans from collecting taxes from the French, should we not at least be willing to speak out in protest against abortionettes murdering children?  We need more men like Chris Danze.</p><p>I have said it before.  I will say it again.  Calling a feminist a feminazi is an insult to National Socialism.</p></div>",
  "content_text": "Gloria Feldt, president of Planned Parenthood Federation of America, sent out an e-mail to some 80,000 abortion-rights advocates across the country to advertise the group’s effort to protect the Austin project.  The e-mail references Danze by name, calls him an “out-of-control anti-choice fanatic” and accuses him of harassing local builders and threatening to blacklist them.\n“As alarming as you and I find his blacklist strategy, anti-choice activists around the country\nconsider Mr. Danze a hero\nand right now, they’re eagerly pursuing ways to bring his harassing tactics to more communities,” Feldt wrote in the e-mail. “We’ve got to let friends and foes alike know that, for every out-of-control anti-choice fanatic that crawls out of the woodwork, there are thousands of us ready, willing and able to defend the essential health services that Planned Parenthood clinics provide for women and families all across this country.”\nColor me an out-of-control anti-choice fanatic too.  Or, as I would put it, someone who is extreme about not killing children in any way for any reason.  Got a problem with that, Oberleutnant Feldt?  Essential health services – what a crock of propagandistic Newspeak.  I have zero tolerance for the executioners of Planned Parenthood.  If we were willing to carpet-bomb Dresden in the interest of preventing Germans from collecting taxes from the French, should we not at least be willing to speak out in protest against abortionettes murdering children?  We need more men like Chris Danze.\nI have said it before.  I will say it again.  Calling a feminist a feminazi is an insult to National Socialism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-02T15:46:00+00:00"
}