{
  "url": "https://voxday.net/2003/12/10/but-this-is-really-funny/",
  "scraped_at": "2025-12-13T15:38:00.225293",
  "title": "But this is really funny!",
  "date_display": "December 10, 2003",
  "date_iso": "2003-12-10T07:29:00+00:00",
  "date_from_url": "2003-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em><a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36046\">An attempt by Democrats</a> to provide an alternative to what they consider is conservative-dominated talk radio flopped after just two days when the show’s host quit.   Jeff Gerbino, a comedian who hosted “High Ground” on Minneapolis’ WMNN for the first two days of the show’s existence said the former Democratic candidate who created the show was forcing him to make it a “shameless plug for the DFL,” according to the Star Tribune newspaper.</em></p><p>Turning the show into an “infomercial for the Democratic Party” would ring hollow for the audience and he couldn’t be funny or provocative in such a format, Gerbino told the paper.</p><p>Democratic talk radio will never work.  There are plenty of funny people who are left wing, but the problem is that their humor is unrelated to their politics.  Al Franken has little to work with except the personalities of his targets, whereas the right can point to the policies themselves as being incoherent, utterly illogical and risible.  I’ve seldom found that young left wing activists have a sense of humor, whereas most young right wing activists do.  They have to, in dealing with their college administrations.</p></div>",
  "content_text": "An attempt by Democrats\nto provide an alternative to what they consider is conservative-dominated talk radio flopped after just two days when the show’s host quit.   Jeff Gerbino, a comedian who hosted “High Ground” on Minneapolis’ WMNN for the first two days of the show’s existence said the former Democratic candidate who created the show was forcing him to make it a “shameless plug for the DFL,” according to the Star Tribune newspaper.\nTurning the show into an “infomercial for the Democratic Party” would ring hollow for the audience and he couldn’t be funny or provocative in such a format, Gerbino told the paper.\nDemocratic talk radio will never work.  There are plenty of funny people who are left wing, but the problem is that their humor is unrelated to their politics.  Al Franken has little to work with except the personalities of his targets, whereas the right can point to the policies themselves as being incoherent, utterly illogical and risible.  I’ve seldom found that young left wing activists have a sense of humor, whereas most young right wing activists do.  They have to, in dealing with their college administrations.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-10T07:29:00+00:00"
}