{
  "url": "https://voxday.net/2003/12/16/dialectic-or-dichotomy/",
  "scraped_at": "2025-12-13T15:38:55.023350",
  "title": "Dialectic or dichotomy",
  "date_display": "December 16, 2003",
  "date_iso": "2003-12-16T09:10:00+00:00",
  "date_from_url": "2003-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>TE writes: <em>You’re right about the classrooms.  When my daughter was in kindergarten she could read, write, add, subtract and do some simple multiplication.  I asked the school system about her level when she was going to enter the 1st grade.  I was told not to worry, she would sit in the class until the rest of the kids caught up!</em></p><p>Space Bunny points out the telling dichotomy between what public school teachers and educrats say publicly and what they tell parents in private.  When they are attempting to cadge more money from an unsuspecting state legislature, they lament that their burden is overwhelming because they lack support from parents.  How can they possibly be expected to teach these children anything in eight hours a day when the children aren’t being helped by parents at home?  Parental support is vital for learning!</p><p>However, when a parent actually does help his child and teaches them reading, writing and arithmetic by daily spending one/eighth the time demanded by the educationists, they tell the parent to butt out and leave the kid to them.  How very mysterious!</p><p>No, not really.  You cannot possibly understand the public school system or the fundamental purpose of the classroom environment if you are still operating under the mistaken assumption that either are designed to teach children a basic foundation of knowledge or to maximize their potential.  Both are <a href=\"http://www.sntp.net/education/look_say_2.htm\">conceived to hold them back</a> and cripple them, and the latter has been that way since it was first conceived by an elite caste to suppress the more numerous children of the lower castes.</p><p>Free your children from intellectual maiming.  Keep them out of the public schools.</p></div>",
  "content_text": "TE writes:\nYou’re right about the classrooms.  When my daughter was in kindergarten she could read, write, add, subtract and do some simple multiplication.  I asked the school system about her level when she was going to enter the 1st grade.  I was told not to worry, she would sit in the class until the rest of the kids caught up!\nSpace Bunny points out the telling dichotomy between what public school teachers and educrats say publicly and what they tell parents in private.  When they are attempting to cadge more money from an unsuspecting state legislature, they lament that their burden is overwhelming because they lack support from parents.  How can they possibly be expected to teach these children anything in eight hours a day when the children aren’t being helped by parents at home?  Parental support is vital for learning!\nHowever, when a parent actually does help his child and teaches them reading, writing and arithmetic by daily spending one/eighth the time demanded by the educationists, they tell the parent to butt out and leave the kid to them.  How very mysterious!\nNo, not really.  You cannot possibly understand the public school system or the fundamental purpose of the classroom environment if you are still operating under the mistaken assumption that either are designed to teach children a basic foundation of knowledge or to maximize their potential.  Both are\nconceived to hold them back\nand cripple them, and the latter has been that way since it was first conceived by an elite caste to suppress the more numerous children of the lower castes.\nFree your children from intellectual maiming.  Keep them out of the public schools.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-16T09:10:00+00:00"
}