{
  "url": "https://voxday.net/2003/12/27/dick-simkanin-tria/",
  "scraped_at": "2025-12-13T15:40:15.834455",
  "title": "Dick Simkanin Trial",
  "date_display": "December 27, 2003",
  "date_iso": "2003-12-27T12:34:00+00:00",
  "date_from_url": "2003-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you live near Fort Worth, Texas, and are opposed to raw government tyranny, you should consider showing up at the <a href=\"http://dicksimkanin.blogspot.com/\">Fort Worth Federal Courthouse at 9:00 AM on January 5th</a>.  Dick Simkanin, a man who refused to withhold income taxes for his employees, has languished in jail for seven months despite having no criminal record and NOT having been convicted of a single crime.  After two grand juries failed to indict him, he finally faced a trial on November 26, which ended in a mistrial after Judge John McBryde refused the jury nine separate requests for information, including one for a copy of the Internal Revenue Code and one for the judge to provide a copy of the specific US statute that required Simkanin to withhold.  Simkanin was then re-indicted by a grand jury that refused to either take Simkanin’s testimony or see evidence that Simkanin wished to present in a <a href=\"http://www.givemeliberty.org/rtplawsuit/Update12-20-03.htm\">process that violated numerous rules of court procedure.</a></p><p>The second trial will be on January 5th.  The US government and the corrupt IRS-Federal Court cabal must not be permitted to run roughshod over the Constitution, Federal law and the rules of court procedure to imprison an innocent man who is guilty of nothing more than obeying the law.</p><p>Eventually, the truth will come out.</p></div>",
  "content_text": "If you live near Fort Worth, Texas, and are opposed to raw government tyranny, you should consider showing up at the\nFort Worth Federal Courthouse at 9:00 AM on January 5th\n.  Dick Simkanin, a man who refused to withhold income taxes for his employees, has languished in jail for seven months despite having no criminal record and NOT having been convicted of a single crime.  After two grand juries failed to indict him, he finally faced a trial on November 26, which ended in a mistrial after Judge John McBryde refused the jury nine separate requests for information, including one for a copy of the Internal Revenue Code and one for the judge to provide a copy of the specific US statute that required Simkanin to withhold.  Simkanin was then re-indicted by a grand jury that refused to either take Simkanin’s testimony or see evidence that Simkanin wished to present in a\nprocess that violated numerous rules of court procedure.\nThe second trial will be on January 5th.  The US government and the corrupt IRS-Federal Court cabal must not be permitted to run roughshod over the Constitution, Federal law and the rules of court procedure to imprison an innocent man who is guilty of nothing more than obeying the law.\nEventually, the truth will come out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-27T12:34:00+00:00"
}