{
  "url": "https://voxday.net/2003/12/06/dissen/",
  "scraped_at": "2025-12-13T15:37:33.225674",
  "title": "A dissent",
  "date_display": "December 6, 2003",
  "date_iso": "2003-12-06T11:50:00+00:00",
  "date_from_url": "2003-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Sports Guy: <em>“it’s like comparing Jessica Biel to Jessica Alba. Hey, you’re fine with Jessica Biel. She may even appear in a few All-Star Games. But Jessica Alba … good Lord.”</em></p><p>I’m so disappointed in Mr. Simmons.  He <a href=\"http://espn.go.com/page2/s/simmons/031205.html\">has it exactly backward</a>s.  Clearly, he’s still recovering from the Grady Little affair.  But this next bit doesn’t surprise me at all, since I happen to be on a mailing list of more than a little interest to Mr. Curt Schilling.</p><p><em>“I’m a longtime member of SOSH, a den for diehards that weeds out weaker members and has 250-post threads on subjects like “Does Casey Fossum’s delivery point seem different to you?” and “One Man’s Thoughts on Nomar’s Last 500 At-Bats, In Order.”…  An admitted internet junkie hoping to get a handle on Sox fans, Schilling couldn’t have picked a better place. He stumbled into a SOSH chat room at 2:30 in the morning and found about 20 fans in there, which is my favorite part of the story — only the guys from SOSH would be chatting about the Sox at 2:30 A.M. on Thanksgiving night. After he introduced himself, they verified his identity with a barrage of questions, then spent the rest of their time pleading for him to come to Boston. He ended up staying in the chat room past 4 o’clock, talking about anything and everything. I’m not making this up.”</em></p><p>Hope Curt gets his Cy Young in Boston.  The World Series?  Well, let’s face it.  For the rest of the world, the failure to win a World Series is a lot more amusing.</p></div>",
  "content_text": "The Sports Guy:\n“it’s like comparing Jessica Biel to Jessica Alba. Hey, you’re fine with Jessica Biel. She may even appear in a few All-Star Games. But Jessica Alba … good Lord.”\nI’m so disappointed in Mr. Simmons.  He\nhas it exactly backward\ns.  Clearly, he’s still recovering from the Grady Little affair.  But this next bit doesn’t surprise me at all, since I happen to be on a mailing list of more than a little interest to Mr. Curt Schilling.\n“I’m a longtime member of SOSH, a den for diehards that weeds out weaker members and has 250-post threads on subjects like “Does Casey Fossum’s delivery point seem different to you?” and “One Man’s Thoughts on Nomar’s Last 500 At-Bats, In Order.”…  An admitted internet junkie hoping to get a handle on Sox fans, Schilling couldn’t have picked a better place. He stumbled into a SOSH chat room at 2:30 in the morning and found about 20 fans in there, which is my favorite part of the story — only the guys from SOSH would be chatting about the Sox at 2:30 A.M. on Thanksgiving night. After he introduced himself, they verified his identity with a barrage of questions, then spent the rest of their time pleading for him to come to Boston. He ended up staying in the chat room past 4 o’clock, talking about anything and everything. I’m not making this up.”\nHope Curt gets his Cy Young in Boston.  The World Series?  Well, let’s face it.  For the rest of the world, the failure to win a World Series is a lot more amusing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-06T11:50:00+00:00"
}