{
  "url": "https://voxday.net/2003/12/14/dont-hold-your-breath-kar/",
  "scraped_at": "2025-12-13T15:38:35.069618",
  "title": "Don’t hold your breath, Karl",
  "date_display": "December 14, 2003",
  "date_iso": "2003-12-14T21:45:00+00:00",
  "date_from_url": "2003-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Christopher Manion writes: <em>Ever since the invasion of Iraq, Karl Rove has been traveling the country mobilizing the evangelical vote for the 2004 elections. In city after city, he is meeting with evangelical leaders. He begs: “in 2000, only 16 million of you voted. We need the other four million.”  Rove has coupled these overtures to evangelicals with similar meetings with the Jewish community (in Cincinatti, he left the evangelical meeting to join the representatives of Jewish organizations one floor up in the same hotel). In both meetings, Rove stresses the importance of President Bush’s invasion of Iraq andhis support of Israel. But only with the evangelicals does he stress the president’s unwavering support for the moral issues that are their priorities abortion, pornography, judges, and (most important) the Marriage Amendment.</em></p><p>I can’t vouch for the veracity of the numbers, but I can tell you two things.  1) I am one of the four million who didn’t vote for either a Republican or a Democrat in 2000.  2) There will be more than four million who won’t vote for either next time.  I believe that President Bush is a Christian – it’s not for me to judge, in any case – I simply don’t believe that he is either a traditional conservative or a man whose principles of government are primarily driven by his faith.</p><p>A man of principle does what he believes is right regardless of the cost.  I don’t see that in President Bush, still less the Republican Party.  I see no reason why evangelical Christians should spend any money or effort supporting it.  I now style myself a Christian Libertarian, and I hope that one day, I’ll be able to cast a vote for a principled member of that party.</p></div>",
  "content_text": "Christopher Manion writes:\nEver since the invasion of Iraq, Karl Rove has been traveling the country mobilizing the evangelical vote for the 2004 elections. In city after city, he is meeting with evangelical leaders. He begs: “in 2000, only 16 million of you voted. We need the other four million.”  Rove has coupled these overtures to evangelicals with similar meetings with the Jewish community (in Cincinatti, he left the evangelical meeting to join the representatives of Jewish organizations one floor up in the same hotel). In both meetings, Rove stresses the importance of President Bush’s invasion of Iraq andhis support of Israel. But only with the evangelicals does he stress the president’s unwavering support for the moral issues that are their priorities abortion, pornography, judges, and (most important) the Marriage Amendment.\nI can’t vouch for the veracity of the numbers, but I can tell you two things.  1) I am one of the four million who didn’t vote for either a Republican or a Democrat in 2000.  2) There will be more than four million who won’t vote for either next time.  I believe that President Bush is a Christian – it’s not for me to judge, in any case – I simply don’t believe that he is either a traditional conservative or a man whose principles of government are primarily driven by his faith.\nA man of principle does what he believes is right regardless of the cost.  I don’t see that in President Bush, still less the Republican Party.  I see no reason why evangelical Christians should spend any money or effort supporting it.  I now style myself a Christian Libertarian, and I hope that one day, I’ll be able to cast a vote for a principled member of that party.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-14T21:45:00+00:00"
}