{
  "url": "https://voxday.net/2003/12/15/even-when-im-wrong-im-rig/",
  "scraped_at": "2025-12-13T15:38:45.845428",
  "title": "Even when I’m wrong, I’m right",
  "date_display": "December 15, 2003",
  "date_iso": "2003-12-15T20:12:00+00:00",
  "date_from_url": "2003-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DC, who is my kanji superior, writes: <em>Your experience with Japanese is interesting, but incomplete, and reading Japanese is not precisely analogous to reading English.  Like you, I studied Japanese as an adult (beginning when I was 43). Also like you, I found that the kana were easy to learn, and that the kanji are difficult. I presently know 500-1000 kanji. This is not sufficient to read a Japanese newspaper, but it is sufficient to read a Japanese patent, and my intent in studying Japanese was to be able to read Japanese patents.</em></p><p>Initially, I thought that Japanese would be much easier to read if the kanji were replaced with kana (or even romaji). I now know, after reading hundreds of Japanese patents, that reading Japanese is infinitely easier using kanji than it would be using only a phonetic system. The reason for this unexpected conclusion is that Japanese is a phonetically poor language. There are only about 110 syllables in Japanese, depending on who is counting. This results in a large number of homophones which are difficult to understand outside of the context of a sentence. Use of kanji for reading eliminates the ambiguity associated with these homophones, and improves reading comprehension.</p><p>English is much different. A large number of syllables are used, and there are relatively few homophones or homonyms. Consequently, there is no need for ideographic characters to provide meaning to written text. Teaching phonetics for English is the best way to learn to read.  My wife is a reading specialist, and the primary methodology she uses in teaching is phonetics and phonemic awareness.</p><p>I quit with kanji before reaching DC’s conclusion, but I have little doubt that he’s correct.  I do remember thinking that it was just insane to cling to what wasn’t even a Japanese system – it’s Chinese – instead of switching to kana, but now that I don’t have to learn 3,000 ideographs myself, I’m kind of glad they do.  The world is already far too homogenized. <a href=\"http://www.engrish.com/category_index.php?category=Clothing\">Engrish</a> is great, though.  “The ribbon that becomes you, cookie girl… favorite ribbon time!”  You tell ’em, coffee boy.</p></div>",
  "content_text": "DC, who is my kanji superior, writes:\nYour experience with Japanese is interesting, but incomplete, and reading Japanese is not precisely analogous to reading English.  Like you, I studied Japanese as an adult (beginning when I was 43). Also like you, I found that the kana were easy to learn, and that the kanji are difficult. I presently know 500-1000 kanji. This is not sufficient to read a Japanese newspaper, but it is sufficient to read a Japanese patent, and my intent in studying Japanese was to be able to read Japanese patents.\nInitially, I thought that Japanese would be much easier to read if the kanji were replaced with kana (or even romaji). I now know, after reading hundreds of Japanese patents, that reading Japanese is infinitely easier using kanji than it would be using only a phonetic system. The reason for this unexpected conclusion is that Japanese is a phonetically poor language. There are only about 110 syllables in Japanese, depending on who is counting. This results in a large number of homophones which are difficult to understand outside of the context of a sentence. Use of kanji for reading eliminates the ambiguity associated with these homophones, and improves reading comprehension.\nEnglish is much different. A large number of syllables are used, and there are relatively few homophones or homonyms. Consequently, there is no need for ideographic characters to provide meaning to written text. Teaching phonetics for English is the best way to learn to read.  My wife is a reading specialist, and the primary methodology she uses in teaching is phonetics and phonemic awareness.\nI quit with kanji before reaching DC’s conclusion, but I have little doubt that he’s correct.  I do remember thinking that it was just insane to cling to what wasn’t even a Japanese system – it’s Chinese – instead of switching to kana, but now that I don’t have to learn 3,000 ideographs myself, I’m kind of glad they do.  The world is already far too homogenized.\nEngrish\nis great, though.  “The ribbon that becomes you, cookie girl… favorite ribbon time!”  You tell ’em, coffee boy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-15T20:12:00+00:00"
}