{
  "url": "https://voxday.net/2003/12/04/fatty-foibles/",
  "scraped_at": "2025-12-13T15:37:10.098342",
  "title": "Fatty foibles",
  "date_display": "December 4, 2003",
  "date_iso": "2003-12-04T08:52:00+00:00",
  "date_from_url": "2003-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The problem with the rabbi’s theory – <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35951\">that husbands are to blame for their wives getting fat</a> – is that it offers no explanation for why so many single women do the same.  It also shows a level of ignorance with regards to gym culture and its mentality.  Working out, for the most part, requires desire that comes from within.  Most of the men and women that I know at the gym have a bit of an obsessive-compulsive element to their nature and don’t really care what anyone else thinks of it one way or another.  It really bothers them to not work out, in a way that is not entirely rational.  I’m informed that I approach full psychotic if I miss three days in a row.</p><p>This may have something to do with endorphin release, or the simple familiarity of habit, I don’t know.  But to ignore it and say that it all stems from insufficient attention strikes me as misguided.  Are women such children that they can’t even be held responsible for what goes in their mouth?  Sure, I know that many women are allergic to responsibility, and I have no doubt that the rabbi’s theory will be most welcome to them.  The whole thing reminds me of sitting in a stairwell with a friend in college one day and watching a little chunker waddle down the stairs past us, lamenting that she just couldn’t lose weight, while alternately taking bites from the doughnuts she was carrying in either hand.  Gee, I wonder why?</p><p>I mentioned this to Space Bunny – who works out as if she might to be forced to pose for a centerfold at any moment – and she pointed out that women are a lot more concerned about what other women think of their appearance than what their husbands think anyway.  Which must be true, because let’s face it, otherwise she’d never wear anything but a little black dress or a Dallas Cowboys Cheerleaders outfit every day of the year.  It’s all about social expectations.  All the women of our extended Bible study are married, with anywhere from one to five children apiece, and every single one of them is slender and attractive.  They don’t all have the flawless genetics of the Gorgeous Couple Too Nice to Hate (as much as you might wish you could)TM, but they maintain themselves in such a way that more than one friend, invited to a party or a barbecue, has wondered if there was some sort of factory where these lovely Christian women were made.  And, could they place an order, please?</p><p>If she’s correct and the problem is social, then I don’t know what the answer is, except to choose your friends carefully.  But then, that doesn’t seem right either.  In any case, no one but the individual herself can actually do anything about her weight, so to try placing the blame elsewhere is unlikely to solve the problem.</p></div>",
  "content_text": "The problem with the rabbi’s theory –\nthat husbands are to blame for their wives getting fat\n– is that it offers no explanation for why so many single women do the same.  It also shows a level of ignorance with regards to gym culture and its mentality.  Working out, for the most part, requires desire that comes from within.  Most of the men and women that I know at the gym have a bit of an obsessive-compulsive element to their nature and don’t really care what anyone else thinks of it one way or another.  It really bothers them to not work out, in a way that is not entirely rational.  I’m informed that I approach full psychotic if I miss three days in a row.\nThis may have something to do with endorphin release, or the simple familiarity of habit, I don’t know.  But to ignore it and say that it all stems from insufficient attention strikes me as misguided.  Are women such children that they can’t even be held responsible for what goes in their mouth?  Sure, I know that many women are allergic to responsibility, and I have no doubt that the rabbi’s theory will be most welcome to them.  The whole thing reminds me of sitting in a stairwell with a friend in college one day and watching a little chunker waddle down the stairs past us, lamenting that she just couldn’t lose weight, while alternately taking bites from the doughnuts she was carrying in either hand.  Gee, I wonder why?\nI mentioned this to Space Bunny – who works out as if she might to be forced to pose for a centerfold at any moment – and she pointed out that women are a lot more concerned about what other women think of their appearance than what their husbands think anyway.  Which must be true, because let’s face it, otherwise she’d never wear anything but a little black dress or a Dallas Cowboys Cheerleaders outfit every day of the year.  It’s all about social expectations.  All the women of our extended Bible study are married, with anywhere from one to five children apiece, and every single one of them is slender and attractive.  They don’t all have the flawless genetics of the Gorgeous Couple Too Nice to Hate (as much as you might wish you could)TM, but they maintain themselves in such a way that more than one friend, invited to a party or a barbecue, has wondered if there was some sort of factory where these lovely Christian women were made.  And, could they place an order, please?\nIf she’s correct and the problem is social, then I don’t know what the answer is, except to choose your friends carefully.  But then, that doesn’t seem right either.  In any case, no one but the individual herself can actually do anything about her weight, so to try placing the blame elsewhere is unlikely to solve the problem.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-04T08:52:00+00:00"
}