{
  "url": "https://voxday.net/2003/12/20/federalism-and-rig/",
  "scraped_at": "2025-12-13T15:39:13.001439",
  "title": "Federalism and the Right",
  "date_display": "December 20, 2003",
  "date_iso": "2003-12-20T13:42:00+00:00",
  "date_from_url": "2003-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ramesh Ponnuru of NRO writes: <em>In several recent debates, various conservatives have been accused of betraying their professed commitment to federalism. The accusations have sometimes come from liberals, but more often from libertarians and other conservatives. It’s no use replying to the liberals that they are no respecters of federalism themselves; since federalism is not part of their political creed, violations of it are not betrayals of principle. But many libertarians say they believe in federalism too. So it has been possible for the conservatives in the dock to accuse the libertarians of hypocrisy right back.  If the accusers were right in each of these instances, one would have to conclude that a true federalist would oppose each of the following:</em></p><p>All right, let’s see just how big a hypocrite this Christian Libertarian happens to be….</p><p><em>federal tort reform</em></p><p>I don’t know enough about this to have an opinion.  Certainly, the current court system is a disaster.  But I don’t understand how it could be hypocritical to reform the federal courts.  Those are the courts with which I’m primarily concerned.</p><p><em>federal legislation to restrict state taxes on the Internet</em></p><p>I’m for anything that restricts taxes of any kind.  Also, a detailed perusal of Federal and state tax regulations shows that many states have signed over their income taxing authority to the Federal government, as well as a number of other taxes.  This is why the amount of your state income tax is derived from your Federal income tax.  It is also why you probably do not owe state income tax, if you are not liable for the Federal tax.  I think Ramesh needs to do more homework on this one before listing it here.</p><p><em>a federal constitutional amendment to ban gay marriage</em></p><p>For it.  But the Supreme Court has already federalized the question.  I don’t understand how, once the issue has been made federal by the Left, the Right is supposed to throw its hands up and surrender.  Rolling it back to the states is preferable, to be sure.</p><p><em>federal laws against medical marijuana</em></p><p>against it</p><p><em>federal legislation to combat rape in state prisons</em></p><p>No opinion.</p><p><em>federal bans on partial-birth abortion and cloning</em></p><p>If there is a federal ban on murder, then it seems easy enough to justify the abortion ban by simple definition.  I’d rather leave cloning up to the states.</p><p><em>Roe v. Wade</em></p><p>against it</p><p><em>a federal ban on some kinds of state broadband regulation</em></p><p>against it</p><p><em>a federal ban on state laws criminalizing sodomy</em></p><p>against it</p></div>",
  "content_text": "Ramesh Ponnuru of NRO writes:\nIn several recent debates, various conservatives have been accused of betraying their professed commitment to federalism. The accusations have sometimes come from liberals, but more often from libertarians and other conservatives. It’s no use replying to the liberals that they are no respecters of federalism themselves; since federalism is not part of their political creed, violations of it are not betrayals of principle. But many libertarians say they believe in federalism too. So it has been possible for the conservatives in the dock to accuse the libertarians of hypocrisy right back.  If the accusers were right in each of these instances, one would have to conclude that a true federalist would oppose each of the following:\nAll right, let’s see just how big a hypocrite this Christian Libertarian happens to be….\nfederal tort reform\nI don’t know enough about this to have an opinion.  Certainly, the current court system is a disaster.  But I don’t understand how it could be hypocritical to reform the federal courts.  Those are the courts with which I’m primarily concerned.\nfederal legislation to restrict state taxes on the Internet\nI’m for anything that restricts taxes of any kind.  Also, a detailed perusal of Federal and state tax regulations shows that many states have signed over their income taxing authority to the Federal government, as well as a number of other taxes.  This is why the amount of your state income tax is derived from your Federal income tax.  It is also why you probably do not owe state income tax, if you are not liable for the Federal tax.  I think Ramesh needs to do more homework on this one before listing it here.\na federal constitutional amendment to ban gay marriage\nFor it.  But the Supreme Court has already federalized the question.  I don’t understand how, once the issue has been made federal by the Left, the Right is supposed to throw its hands up and surrender.  Rolling it back to the states is preferable, to be sure.\nfederal laws against medical marijuana\nagainst it\nfederal legislation to combat rape in state prisons\nNo opinion.\nfederal bans on partial-birth abortion and cloning\nIf there is a federal ban on murder, then it seems easy enough to justify the abortion ban by simple definition.  I’d rather leave cloning up to the states.\nRoe v. Wade\nagainst it\na federal ban on some kinds of state broadband regulation\nagainst it\na federal ban on state laws criminalizing sodomy\nagainst it",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-20T13:42:00+00:00"
}