{
  "url": "https://voxday.net/2003/12/01/from-mouth-of-horses-ass/",
  "scraped_at": "2025-12-13T15:36:46.396730",
  "title": "From the mouth of the horse’s ass",
  "date_display": "December 1, 2003",
  "date_iso": "2003-12-01T09:17:00+00:00",
  "date_from_url": "2003-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s one of the actual emails from the now-famous<a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35885\"> University of Tennessee Issues Committee</a>, not the most infamous one, but the one that I thought was most perfectly illustrative of the mind, such as it is, of the campus left.  It was CC’d to the entire committee, which goes to show how smugly assured these jokers happen to be.  The literary quality of an email should never be judged as harshly something that is written for public scrutiny, of course, but I nevertheless find some of the word choices to be so bizarre as to suggest semi-literacy.  Somewhere, an English teacher is weeping.  Rock on, comrade.</p><p><em>Subject: RE: Issues in the Beacon<br> <br>Date: Thu, 13 Nov 2003 16:49:09 -0500</br></br></em></p><p>fortunately someone brought a beacon to work today, so i got to see our GLORIOUS front page coverage of carlson. i was disappointed to see that the issues committee wasn’t mentioned anywhere in the article, but nevertheless it was great coverage. apparently the guy who wrote the article is aware of his mistake and he has apologized for not mentioning the small detail of HOW tucker came to the university unfortunately my thirst to see the issues committee’s name in print was satisfied on page five.</p><p>like most of you, i spent much of my day drafting a letter to the editor in response to <a href=\"http://dailybeacon.utk.edu/article.php/12707\">the piece</a>. however, i probably spent more time thinking about what a little brat this guy is and what i would do to him given the chance–torture that would put the spanish inquisition to shame, etc–but ultimately i don’t think it would do any good. he simply isn’t worth any more of our time.  i think it goes without saying that we shouldn’t be talking to him as much about what goes on within the committee. as he mentioned, he did apply to the committee and he was rejected (largely due to his closed-mindedness and attitude). during the interview he did ask questions about our budget and its source, which we revealed to him because it’s public information that he wouldn’t have to search hard for. however, it’s obvious that he acquired this info (and other info) about us purely for his own interests in bashing us. as witnessed in his past bashings of campus committees, responses to his opines only warranted further insane and unfounded bashings. the WCC found that out the hard way.</p><p>i think we can learn from their situation and instead not reply to the absolute bullshit that this guy writes. to paraphrase, i make no allusions as to what this email is. this is not an attempt to change a single rejected applicant/op-ed writer’s mind. this is a desperate plea to tell you that i think we’re doing a fucking incredible job as a committee.</p><p>rock<br> <br>–[name withheld to protect the asinine]</br></br></p></div>",
  "content_text": "Here’s one of the actual emails from the now-famous\nUniversity of Tennessee Issues Committee\n, not the most infamous one, but the one that I thought was most perfectly illustrative of the mind, such as it is, of the campus left.  It was CC’d to the entire committee, which goes to show how smugly assured these jokers happen to be.  The literary quality of an email should never be judged as harshly something that is written for public scrutiny, of course, but I nevertheless find some of the word choices to be so bizarre as to suggest semi-literacy.  Somewhere, an English teacher is weeping.  Rock on, comrade.\nSubject: RE: Issues in the Beacon\nDate: Thu, 13 Nov 2003 16:49:09 -0500\nfortunately someone brought a beacon to work today, so i got to see our GLORIOUS front page coverage of carlson. i was disappointed to see that the issues committee wasn’t mentioned anywhere in the article, but nevertheless it was great coverage. apparently the guy who wrote the article is aware of his mistake and he has apologized for not mentioning the small detail of HOW tucker came to the university unfortunately my thirst to see the issues committee’s name in print was satisfied on page five.\nlike most of you, i spent much of my day drafting a letter to the editor in response to\nthe piece\n. however, i probably spent more time thinking about what a little brat this guy is and what i would do to him given the chance–torture that would put the spanish inquisition to shame, etc–but ultimately i don’t think it would do any good. he simply isn’t worth any more of our time.  i think it goes without saying that we shouldn’t be talking to him as much about what goes on within the committee. as he mentioned, he did apply to the committee and he was rejected (largely due to his closed-mindedness and attitude). during the interview he did ask questions about our budget and its source, which we revealed to him because it’s public information that he wouldn’t have to search hard for. however, it’s obvious that he acquired this info (and other info) about us purely for his own interests in bashing us. as witnessed in his past bashings of campus committees, responses to his opines only warranted further insane and unfounded bashings. the WCC found that out the hard way.\ni think we can learn from their situation and instead not reply to the absolute bullshit that this guy writes. to paraphrase, i make no allusions as to what this email is. this is not an attempt to change a single rejected applicant/op-ed writer’s mind. this is a desperate plea to tell you that i think we’re doing a fucking incredible job as a committee.\nrock\n–[name withheld to protect the asinine]",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-01T09:17:00+00:00"
}