{
  "url": "https://voxday.net/2003/12/15/glad-to-be-of-ser-vice/",
  "scraped_at": "2025-12-13T15:38:47.669373",
  "title": "Glad to be of SER-vice",
  "date_display": "December 15, 2003",
  "date_iso": "2003-12-15T20:25:00+00:00",
  "date_from_url": "2003-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RK writes: <em>What a wonderful gift, your article <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36131\">How to teach your child to read</a> at WND.  I am working with my soon-to-be three year old granddaughter to teach her to read using phonics.  I was kind of winging it.  Now I have something concrete to work with.  Here’s wishing a Merry Christmas to you and yours from my granddaughters A, 2 years, S, 2 months and from their “Pappa”.  Thanks again.</em></p><p>Actually, this is precisely why I wrote the article.  It’s not hard, truly!  Even a grandparent probably has enough time to do it, and it’s a nice excuse to spend time with your grandkids.  And what a great gift, to give them such a useful head start in life.</p><p>By the way, the two sigmas mentioned in the column refers to how a different character is used when a Greek word ends in sigma.  This second sigma looks rather like our letter s, as opposed to a circle with a horizontal stem.  The proper way to read it is to say “sigma?” while expressing some disbelief, then shout “two sigmas!” and allow a certain amount of time for the ensuing hilarity.  It’s always a party at the Digital Ghetto.</p></div>",
  "content_text": "RK writes:\nWhat a wonderful gift, your article\nHow to teach your child to read\nat WND.  I am working with my soon-to-be three year old granddaughter to teach her to read using phonics.  I was kind of winging it.  Now I have something concrete to work with.  Here’s wishing a Merry Christmas to you and yours from my granddaughters A, 2 years, S, 2 months and from their “Pappa”.  Thanks again.\nActually, this is precisely why I wrote the article.  It’s not hard, truly!  Even a grandparent probably has enough time to do it, and it’s a nice excuse to spend time with your grandkids.  And what a great gift, to give them such a useful head start in life.\nBy the way, the two sigmas mentioned in the column refers to how a different character is used when a Greek word ends in sigma.  This second sigma looks rather like our letter s, as opposed to a circle with a horizontal stem.  The proper way to read it is to say “sigma?” while expressing some disbelief, then shout “two sigmas!” and allow a certain amount of time for the ensuing hilarity.  It’s always a party at the Digital Ghetto.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-15T20:25:00+00:00"
}