{
  "url": "https://voxday.net/2003/12/07/he-thought-that-he-thoug/",
  "scraped_at": "2025-12-13T15:37:38.808729",
  "title": "He thought that he thought",
  "date_display": "December 7, 2003",
  "date_iso": "2003-12-07T12:25:00+00:00",
  "date_from_url": "2003-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>“Dean has provided no reason to expect from him especially elevated reasoning…. He seems to be an Everett Wharton. “The Prime Minister,” one of Anthony Trollope’s parliamentary novels, introduces Wharton, who was, Trollope wrote, “no fool”:  “[He] had read much, and although he generally forgot what he read, there were left with him from his reading certain nebulous lights, begotten by other men’s thinking, which enabled him to talk on most subjects. It cannot be said of him that he did much thinking for himself — but he thought that he thought.”</em></p><p>Dean seems like that, which is not surprising or disqualifying: Most political leaders are not people of reflection, but of ambition-dictated action, living off borrowed intellectual capital. Given the accumulating evidence, the professors’ pin-up should dismount his intellectual high horse.</p><p>“He thought that he thought.”  What a fantastic summary.  It should serve as the epitaph of the entire Left.</p><p>So, Howard Dean says that Lao Tzu is his favorite philosopher.  I happened to pick up a major in what used to be called Oriental Studies, and I’m willing to bet that if you gave him a list of 100 quotes from Confucius, Mencius, Mo Tzu, Han Fei and Lao Tzu, he couldn’t identify more than five of them without guessing.  Granted, I’m not sure I could get more than 20 correct myself – it’s been a while – but then, I’m not claiming that Lao Tzu is my favorite philosopher.</p><p>If you’ve seriously studied any aspect of Asian culture, then you know that the vast, vast majority of Westerners who claim to like one form of it or another actually know next to nothing about it, and understand even less.  This goes triply for an American talking about anything relating to the Tao.  One thing that I love about <em>The Tale of Genji</em> is that it always serves as an excellent reminder of how I know so very little about what is truly a very alien mindset.</p><p>As for my favorite philosopher, it’s a toss-up.  Douglas Adams or Friedrich Nietzsche.  And yes, I could nail those quotes, for I am so hip that I have difficulty seeing over my own pelvis.</p></div>",
  "content_text": "“Dean has provided no reason to expect from him especially elevated reasoning…. He seems to be an Everett Wharton. “The Prime Minister,” one of Anthony Trollope’s parliamentary novels, introduces Wharton, who was, Trollope wrote, “no fool”:  “[He] had read much, and although he generally forgot what he read, there were left with him from his reading certain nebulous lights, begotten by other men’s thinking, which enabled him to talk on most subjects. It cannot be said of him that he did much thinking for himself — but he thought that he thought.”\nDean seems like that, which is not surprising or disqualifying: Most political leaders are not people of reflection, but of ambition-dictated action, living off borrowed intellectual capital. Given the accumulating evidence, the professors’ pin-up should dismount his intellectual high horse.\n“He thought that he thought.”  What a fantastic summary.  It should serve as the epitaph of the entire Left.\nSo, Howard Dean says that Lao Tzu is his favorite philosopher.  I happened to pick up a major in what used to be called Oriental Studies, and I’m willing to bet that if you gave him a list of 100 quotes from Confucius, Mencius, Mo Tzu, Han Fei and Lao Tzu, he couldn’t identify more than five of them without guessing.  Granted, I’m not sure I could get more than 20 correct myself – it’s been a while – but then, I’m not claiming that Lao Tzu is my favorite philosopher.\nIf you’ve seriously studied any aspect of Asian culture, then you know that the vast, vast majority of Westerners who claim to like one form of it or another actually know next to nothing about it, and understand even less.  This goes triply for an American talking about anything relating to the Tao.  One thing that I love about\nThe Tale of Genji\nis that it always serves as an excellent reminder of how I know so very little about what is truly a very alien mindset.\nAs for my favorite philosopher, it’s a toss-up.  Douglas Adams or Friedrich Nietzsche.  And yes, I could nail those quotes, for I am so hip that I have difficulty seeing over my own pelvis.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-07T12:25:00+00:00"
}