{
  "url": "https://voxday.net/2003/12/06/hes-so-fucking-tuff/",
  "scraped_at": "2025-12-13T15:37:35.122474",
  "title": "He’s so fucking tuff!",
  "date_display": "December 6, 2003",
  "date_iso": "2003-12-06T21:28:00+00:00",
  "date_from_url": "2003-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>”I voted for what I thought was best for the country. Did I expect Howard Dean to go off to the left and say, ‘I’m against everything’? Sure. Did I expect George Bush to fuck it up as badly as he did? I don’t think anybody did.”</em><br> <br>– Senator John Kerry, Democratic presidential candidate</br></br></p><p>I’m really starting to enjoy this election cycle.  The Democratic candidates are imploding like frogs with firecrackers inserted inappropriately.  It’s like Nine Little Indians, except that it’s funny instead of frightening.  What with Lieberman and the jelly doughnut threat, Kucinich’s <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35993\">dating reality show</a>, Dean being Dean and now this, we may get that dream ticket of Dean-Sharpton for which everyone with a sense of humor is hoping.  I thought Kerry had hit the height of his absurdity when he went on Leno wearing that stupid leather jacket, but this is even better.  We’re reaching Perot-Stockton levels of unintended humor here.  I just wish that he’d posed for a matching photo sticking his tongue out and making devils horns.</p><p>Dude, that would have been too <em>radical!</em> You <em>totally</em> would have gotten the “rock” vote!  Of course, the only zeros who a) think it’s cool to talk like that, and b) vote, are on the UT Issues Committee – or were on the committee until recently – and are probably Deanie weenies anyhow.</p><p><em>Rock</em>,<br> <br>Vox</br></br></p></div>",
  "content_text": "”I voted for what I thought was best for the country. Did I expect Howard Dean to go off to the left and say, ‘I’m against everything’? Sure. Did I expect George Bush to fuck it up as badly as he did? I don’t think anybody did.”\n– Senator John Kerry, Democratic presidential candidate\nI’m really starting to enjoy this election cycle.  The Democratic candidates are imploding like frogs with firecrackers inserted inappropriately.  It’s like Nine Little Indians, except that it’s funny instead of frightening.  What with Lieberman and the jelly doughnut threat, Kucinich’s\ndating reality show\n, Dean being Dean and now this, we may get that dream ticket of Dean-Sharpton for which everyone with a sense of humor is hoping.  I thought Kerry had hit the height of his absurdity when he went on Leno wearing that stupid leather jacket, but this is even better.  We’re reaching Perot-Stockton levels of unintended humor here.  I just wish that he’d posed for a matching photo sticking his tongue out and making devils horns.\nDude, that would have been too\nradical!\nYou\ntotally\nwould have gotten the “rock” vote!  Of course, the only zeros who a) think it’s cool to talk like that, and b) vote, are on the UT Issues Committee – or were on the committee until recently – and are probably Deanie weenies anyhow.\nRock\n,\nVox",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-06T21:28:00+00:00"
}