{
  "url": "https://voxday.net/2003/12/31/i-warned-you-penelope/",
  "scraped_at": "2025-12-13T15:40:51.717909",
  "title": "I warned you, Penelope",
  "date_display": "December 31, 2003",
  "date_iso": "2003-12-31T12:09:00+00:00",
  "date_from_url": "2003-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it tremendously amusing when someone complains that I have embarrassed them by utilizing the cruel device of quoting them at length in public.  It is particularly ironic when they are clearly unaware that I respond every week to critical email, while at the same time asserting detailed knowledge of me, my philosophy and my membership, or lack thereof, in various organizations.</p><p>I do not post private correspondence.  When you send me an insult-filled diatribe about a column I have published somewhere, <em>we are not corresponding</em>.  I freely admit that I rather enjoy vivisecting nonsensical lunacies for the benefit of my readers, but such missives are wholly unsolicited nevertheless.</p><p>I have zero sympathy for those who believe they should be able to freely rail at public figures without consequence.  Perhaps most columnists suffer such blather in Olympian silence; I do not.  I stand by what I write, and I expect everyone else to do  likewise.  Polite and reasonable criticism will always receive polite and respectful treatment, both in this blog and via email.  Baseless assertions and petty insults will be mercilessly mocked.  The choice, dear hate mailer, is always yours.</p><p>I have said it before.  I will say it again.  Don’t bring it if you can’t take it.</p></div>",
  "content_text": "I find it tremendously amusing when someone complains that I have embarrassed them by utilizing the cruel device of quoting them at length in public.  It is particularly ironic when they are clearly unaware that I respond every week to critical email, while at the same time asserting detailed knowledge of me, my philosophy and my membership, or lack thereof, in various organizations.\nI do not post private correspondence.  When you send me an insult-filled diatribe about a column I have published somewhere,\nwe are not corresponding\n.  I freely admit that I rather enjoy vivisecting nonsensical lunacies for the benefit of my readers, but such missives are wholly unsolicited nevertheless.\nI have zero sympathy for those who believe they should be able to freely rail at public figures without consequence.  Perhaps most columnists suffer such blather in Olympian silence; I do not.  I stand by what I write, and I expect everyone else to do  likewise.  Polite and reasonable criticism will always receive polite and respectful treatment, both in this blog and via email.  Baseless assertions and petty insults will be mercilessly mocked.  The choice, dear hate mailer, is always yours.\nI have said it before.  I will say it again.  Don’t bring it if you can’t take it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-31T12:09:00+00:00"
}