{
  "url": "https://voxday.net/2003/12/03/it-already-lost-me/",
  "scraped_at": "2025-12-13T15:37:01.599274",
  "title": "It already lost me",
  "date_display": "December 3, 2003",
  "date_iso": "2003-12-03T11:35:00+00:00",
  "date_from_url": "2003-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>William F. Buckley writes: <em>There are of course shoals out there. They are economic realities. They drain the value of the dollar and the vat of human enterprise. But there is something else to look out for, which is the credibility of democratic practice. If everybody preaches A while condoning B, you get not only inflated costs, but deflated confidence in democratic government.</em></p><p>Mine is pretty much at zero anyhow.  I don’t believe in democracy.  Neither, for that matter, do you.  I will take a self-professed democrat’s claims of belief in democracy seriously when he advocates replacing Congress with e-voting.  The technology is already here.  Come on, democrats, it’s time to practice what you preach.</p><p>ADDENDA: NB writes <em>“Replace Congress and Constitutional questions before the federal judiciary with e-voting.   No sense circumventing the demagogues only to leave the oligarchs in charge.”</em></p><p>Right, good point.  Let’s get rid of both branches while we’re at it.  Since the Constitution is meaningless now, what is the point of checks and balances on the perfectly realized will of the people?  We’ll probably need to keep a President, just for signing treaties and declaring whatever it is we call war now, but the Imperial Judiciary is, with Congress, officially relegated to the dustbin of history.</p></div>",
  "content_text": "William F. Buckley writes:\nThere are of course shoals out there. They are economic realities. They drain the value of the dollar and the vat of human enterprise. But there is something else to look out for, which is the credibility of democratic practice. If everybody preaches A while condoning B, you get not only inflated costs, but deflated confidence in democratic government.\nMine is pretty much at zero anyhow.  I don’t believe in democracy.  Neither, for that matter, do you.  I will take a self-professed democrat’s claims of belief in democracy seriously when he advocates replacing Congress with e-voting.  The technology is already here.  Come on, democrats, it’s time to practice what you preach.\nADDENDA: NB writes\n“Replace Congress and Constitutional questions before the federal judiciary with e-voting.   No sense circumventing the demagogues only to leave the oligarchs in charge.”\nRight, good point.  Let’s get rid of both branches while we’re at it.  Since the Constitution is meaningless now, what is the point of checks and balances on the perfectly realized will of the people?  We’ll probably need to keep a President, just for signing treaties and declaring whatever it is we call war now, but the Imperial Judiciary is, with Congress, officially relegated to the dustbin of history.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-03T11:35:00+00:00"
}