{
  "url": "https://voxday.net/2003/12/05/ive-heard-that-too/",
  "scraped_at": "2025-12-13T15:37:19.233551",
  "title": "I’ve heard that too",
  "date_display": "December 5, 2003",
  "date_iso": "2003-12-05T11:13:00+00:00",
  "date_from_url": "2003-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Curry writes a letter to WND: <em>I’ve heard homosexuals say, “A person who speaks out most against homosexuality is a person who would really deep down like to share that experience and would probably enjoy it”.   No one speaks out against that lifestyle more than I. If what they say is true, then their lifestyle must be a choice since I’ve chosen not to do it in all of my 54 years.</em></p><p>Every single time – okay, both times – I’ve written a column even tangentially related to homosexuality, I’ve been accused of being queer myself.  As Mr. Curry points out, were this true, it would simply prove that homosexual behavior is a choice, and an easily controlled one at that.  Of course, I’ve yet to hear from an offended group as utterly devoid of logic as the queer crowd.  I can’t even get offended by the attacks; it’s like being mauled by declawed kitten.</p><p>Hissy Queer:  “How dare you say that being gay is bad!  You’re bad!  Gay is good!  You’re gay!  Homophobe!  You’re secretly gay!”<br> <br>Me:  “Do you even listen to yourself?”</br></br></p><p>One of these days I’ll dig up an old email from the gentleman who describes himself as the father of the gay rights movement, apparently unaware of the irony, and post it here.  His strategy, if you can even call it that, consists of the assertion that homosexuality is a positive good, in all ways.  According to him, it is healthier than being normal, more morally pure than being normal, more ethical, etc.  Which naturally makes one wonder what color the sky in his world might be.  Lavender, most likely.</p><p>The other common homosexual response to criticism – aside from the inevitable butchery of language involved in the assertion of “homophobia” – is to assert that the critic is jealous.  Jealous, I ask, of what? <a href=\"http://www.hivandhepatitis.com/2002conf/14th_aids/7.html\">Disease</a>, <a href=\"http://www.youth.org/loco/PERSONProject/Alerts/States/Minnesota/suicide.html\">a proclivity for suicide</a> and bad dance music?  Sounds like a real party, Penelope.</p></div>",
  "content_text": "John Curry writes a letter to WND:\nI’ve heard homosexuals say, “A person who speaks out most against homosexuality is a person who would really deep down like to share that experience and would probably enjoy it”.   No one speaks out against that lifestyle more than I. If what they say is true, then their lifestyle must be a choice since I’ve chosen not to do it in all of my 54 years.\nEvery single time – okay, both times – I’ve written a column even tangentially related to homosexuality, I’ve been accused of being queer myself.  As Mr. Curry points out, were this true, it would simply prove that homosexual behavior is a choice, and an easily controlled one at that.  Of course, I’ve yet to hear from an offended group as utterly devoid of logic as the queer crowd.  I can’t even get offended by the attacks; it’s like being mauled by declawed kitten.\nHissy Queer:  “How dare you say that being gay is bad!  You’re bad!  Gay is good!  You’re gay!  Homophobe!  You’re secretly gay!”\nMe:  “Do you even listen to yourself?”\nOne of these days I’ll dig up an old email from the gentleman who describes himself as the father of the gay rights movement, apparently unaware of the irony, and post it here.  His strategy, if you can even call it that, consists of the assertion that homosexuality is a positive good, in all ways.  According to him, it is healthier than being normal, more morally pure than being normal, more ethical, etc.  Which naturally makes one wonder what color the sky in his world might be.  Lavender, most likely.\nThe other common homosexual response to criticism – aside from the inevitable butchery of language involved in the assertion of “homophobia” – is to assert that the critic is jealous.  Jealous, I ask, of what?\nDisease\n,\na proclivity for suicide\nand bad dance music?  Sounds like a real party, Penelope.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-05T11:13:00+00:00"
}