{
  "url": "https://voxday.net/2003/12/02/leftward-ti/",
  "scraped_at": "2025-12-13T15:36:49.742029",
  "title": "The leftward tilt",
  "date_display": "December 2, 2003",
  "date_iso": "2003-12-02T09:20:00+00:00",
  "date_from_url": "2003-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AS asks: <em>I’d like to get your opinion as to why college campuses are such bastions of leftism.  The University of Tennessee is just one of countless examples of the political leanings in the academic world.  This bias, of course, is nothing new.  William F. Buckley showed the world in the 1950s what campus politics were like, and atheism was in vogue for 150 yeas before that.  What causes this left political leaning?</em></p><p>I think there’s a few factors.  First, those who wind up in academia are usually not the sort of people who know in undergrad what sort of career they’re going to pursue, nor are they ready to handle the responsibility of a full-time job upon graduation.  So, instead of working, they avoid the harsh realities of the real world by attending various stages of graduate school and they continue obtaining degrees until they are pretty much unemployable as anything but a professor.  This isn’t true of all graduate students, of course, but it fits the profile of the majority.</p><p>Second, the sort of people attracted to academia are abstract thinkers.  There’s nothing wrong with that – I’m an abstract thinker myself – but in the absence of real-world experience or a serious dedication to supporting your theories with hard evidence, it’s pretty easy for the abstract thinker to divorce himself from objective reality.  This is why you still have many economics professors who are avowed Marxists despite the fact that no one has taken the labor theory of value – which only happens to be the entire base and justification for the Marxist system – seriously for over 25 years.  A normal person would conclude that the whole system has to be junked since the base is disproven and the model hasn’t worked anywhere in more than 100 years; the left-wing academic will continue to insist that it just hasn’t been applied properly, an argument they can cling to for eternity considering that Marx was incredibly vague about things.</p><p>“And then, for reasons that I won’t bother to explain, the State will magically disappear, poof, and everyone will have 70 virgins!”  Right, Karl, whatever, now go take a bath.</p><p>Finally, in case you haven’t noticed, many professors are still emotional teenagers.  They live around 18-23 year olds, they interact with them all the time, and they like to consider themselves much younger than their real age.  PJ O’Rourke has a hilarious send up of this in one of his books.  As with most emotion-based thinkers, strange arguments based on mythical fairness and what Thomas Sowell calls universal justice tend to appeal to them in the same way it appeals to little kids.  The truth is that life isn’t fair, and the most cursory reading of history will show that it never has been fair in any society anywhere.  When faced with this reality, the adult shrugs his shoulders and deals with it.  The child gets very upset and expects Mommy to do something about it.  Substitute government for Mommy and you will get a much better handle on how the academic Left thinks.  This is why you cannot expect or hope for any degree of consistency from a leftist academic; it just doesn’t exist.</p><p>The deeper truth is that, as <a href=\"http://www.townhall.com/columnists/dennisprager/dp20031202.shtml\">Dennis Prager points out</a>,  “Wisdom begins with fear of God.”  Few in academia have either.</p></div>",
  "content_text": "AS asks:\nI’d like to get your opinion as to why college campuses are such bastions of leftism.  The University of Tennessee is just one of countless examples of the political leanings in the academic world.  This bias, of course, is nothing new.  William F. Buckley showed the world in the 1950s what campus politics were like, and atheism was in vogue for 150 yeas before that.  What causes this left political leaning?\nI think there’s a few factors.  First, those who wind up in academia are usually not the sort of people who know in undergrad what sort of career they’re going to pursue, nor are they ready to handle the responsibility of a full-time job upon graduation.  So, instead of working, they avoid the harsh realities of the real world by attending various stages of graduate school and they continue obtaining degrees until they are pretty much unemployable as anything but a professor.  This isn’t true of all graduate students, of course, but it fits the profile of the majority.\nSecond, the sort of people attracted to academia are abstract thinkers.  There’s nothing wrong with that – I’m an abstract thinker myself – but in the absence of real-world experience or a serious dedication to supporting your theories with hard evidence, it’s pretty easy for the abstract thinker to divorce himself from objective reality.  This is why you still have many economics professors who are avowed Marxists despite the fact that no one has taken the labor theory of value – which only happens to be the entire base and justification for the Marxist system – seriously for over 25 years.  A normal person would conclude that the whole system has to be junked since the base is disproven and the model hasn’t worked anywhere in more than 100 years; the left-wing academic will continue to insist that it just hasn’t been applied properly, an argument they can cling to for eternity considering that Marx was incredibly vague about things.\n“And then, for reasons that I won’t bother to explain, the State will magically disappear, poof, and everyone will have 70 virgins!”  Right, Karl, whatever, now go take a bath.\nFinally, in case you haven’t noticed, many professors are still emotional teenagers.  They live around 18-23 year olds, they interact with them all the time, and they like to consider themselves much younger than their real age.  PJ O’Rourke has a hilarious send up of this in one of his books.  As with most emotion-based thinkers, strange arguments based on mythical fairness and what Thomas Sowell calls universal justice tend to appeal to them in the same way it appeals to little kids.  The truth is that life isn’t fair, and the most cursory reading of history will show that it never has been fair in any society anywhere.  When faced with this reality, the adult shrugs his shoulders and deals with it.  The child gets very upset and expects Mommy to do something about it.  Substitute government for Mommy and you will get a much better handle on how the academic Left thinks.  This is why you cannot expect or hope for any degree of consistency from a leftist academic; it just doesn’t exist.\nThe deeper truth is that, as\nDennis Prager points out\n,  “Wisdom begins with fear of God.”  Few in academia have either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-02T09:20:00+00:00"
}