{
  "url": "https://voxday.net/2003/12/24/mailbox-fear-of-metaphorical-plane/",
  "scraped_at": "2025-12-13T15:39:49.311933",
  "title": "Mailbox: Fear of a Metaphorical Planet",
  "date_display": "December 24, 2003",
  "date_iso": "2003-12-24T08:35:00+00:00",
  "date_from_url": "2003-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JD writes:<em> I can tell that you are a baptist because your ravings about “your” view of the world and its similarities to Tolkiens writings are waaay off to the religious right. To compare the United Nations to Sauron, and the nations of France, Germany, Russia and, China to the Nazgul,  is just ridiculous. I somewhat agree to your comparison between orcs and islamic extremists because of their violent natures. But to label them as “monsters” or less than human, publicly no less, is un-christian. And what are baptists after all, but uber-christians. There are no christians but the baptists.</em></p><p>Why is “your” in quotes?  Whose view do you expect me to have?  Strange.  Anyhow, this sort of historical ignorance is depressing, as people used to say the same sort of thing when they would insist that the European Economic Community was nothing more than a trade federation intended to boost the economies of Europe, and would NEVER prove to be the framework of a political entity, much less a totalitarian one.  Of course, I don’t hear that argument anymore now that the European Commission is giving orders to the once-sovereign English Parliament and entire nations are forced to vote and re-vote until they finally produce the acceptable response.</p><p>At what point will JD and others begin to understand that the UN is a great threat to humanity, perhaps even the greatest it will ever face?  Once it usurps the laws of the USA?  Once it has taxing power and an army?  When it <a href=\"http://disarmament2.un.org/cab/poa.html\">orders the confiscation of all private firearms</a>?  No, as usual, the threat will not be recognized by the Great Fat and Happy until it is too late and the enemy is at their throats.  This is not theoretical; Kofi Annan has been stumping hard for the global UN tax as proposed by Paul Tobin, and the EU already has what could be used as the nucleus of the blue-helmeted horde.  Furthermore, there is already precedent for American soldiers being forced against their will to serve under UN colors as in the <a href=\"http://www.mikenew.com/wnd6-7.html\">Michael New court martial</a>.  I have no doubt at all that I will be proved correct on this matter, and I can tell you now that I will take absolutely no joy in being right.</p><p>As to orcs… it’s called metaphor, JD.  Deal with it.  I never wrote anything about monsters or literal subhuman status….  Oh dear, it just occurred to me that perhaps he thinks the Sauron-UN comparison is ridiculous because there isn’t a great flaming eye on top of the building in New York City.  For the love of all that’s good and holy, JD, get thee to a dictionary!</p><p>I am, as anyone who reads my column knows, a Southern Baptist.  I have never once claimed, nor ever heard a fellow Baptist claim, that our understanding of Christianity is the only correct one.   To believe with your heart and confess with your tongue that Jesus Christ is Lord is the only standard to which I subscribe, and while I can judge the latter, none but God can judge the former.  Tonight, as is my custom, I will take great joy in attending midnight mass with my Christian brothers and sisters who happen to be Catholic, and together we will celebrate the birth of Our Lord.</p></div>",
  "content_text": "JD writes:\nI can tell that you are a baptist because your ravings about “your” view of the world and its similarities to Tolkiens writings are waaay off to the religious right. To compare the United Nations to Sauron, and the nations of France, Germany, Russia and, China to the Nazgul,  is just ridiculous. I somewhat agree to your comparison between orcs and islamic extremists because of their violent natures. But to label them as “monsters” or less than human, publicly no less, is un-christian. And what are baptists after all, but uber-christians. There are no christians but the baptists.\nWhy is “your” in quotes?  Whose view do you expect me to have?  Strange.  Anyhow, this sort of historical ignorance is depressing, as people used to say the same sort of thing when they would insist that the European Economic Community was nothing more than a trade federation intended to boost the economies of Europe, and would NEVER prove to be the framework of a political entity, much less a totalitarian one.  Of course, I don’t hear that argument anymore now that the European Commission is giving orders to the once-sovereign English Parliament and entire nations are forced to vote and re-vote until they finally produce the acceptable response.\nAt what point will JD and others begin to understand that the UN is a great threat to humanity, perhaps even the greatest it will ever face?  Once it usurps the laws of the USA?  Once it has taxing power and an army?  When it\norders the confiscation of all private firearms\n?  No, as usual, the threat will not be recognized by the Great Fat and Happy until it is too late and the enemy is at their throats.  This is not theoretical; Kofi Annan has been stumping hard for the global UN tax as proposed by Paul Tobin, and the EU already has what could be used as the nucleus of the blue-helmeted horde.  Furthermore, there is already precedent for American soldiers being forced against their will to serve under UN colors as in the\nMichael New court martial\n.  I have no doubt at all that I will be proved correct on this matter, and I can tell you now that I will take absolutely no joy in being right.\nAs to orcs… it’s called metaphor, JD.  Deal with it.  I never wrote anything about monsters or literal subhuman status….  Oh dear, it just occurred to me that perhaps he thinks the Sauron-UN comparison is ridiculous because there isn’t a great flaming eye on top of the building in New York City.  For the love of all that’s good and holy, JD, get thee to a dictionary!\nI am, as anyone who reads my column knows, a Southern Baptist.  I have never once claimed, nor ever heard a fellow Baptist claim, that our understanding of Christianity is the only correct one.   To believe with your heart and confess with your tongue that Jesus Christ is Lord is the only standard to which I subscribe, and while I can judge the latter, none but God can judge the former.  Tonight, as is my custom, I will take great joy in attending midnight mass with my Christian brothers and sisters who happen to be Catholic, and together we will celebrate the birth of Our Lord.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-24T08:35:00+00:00"
}