{
  "url": "https://voxday.net/2003/12/29/mailbox-why-write/",
  "scraped_at": "2025-12-13T15:40:34.038176",
  "title": "Mailbox: Why write?",
  "date_display": "December 29, 2003",
  "date_iso": "2003-12-29T00:30:00+00:00",
  "date_from_url": "2003-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BG writes: <em>I read your articles from time to time. I feel they are above the average individual. Do you feel that your articles are directed to a certain person, or just for whoever stumbles upon them? I myself have read only a few, and think you are one of the best writers I have ever heard of….  Surely you must have a plan, or have been given a call. I truly hope you don’t waste your talents picking apart the evil of the left while trying to show off your obviously elevated writing intellect. I’m not slamming you at all. I wish there were more people like you, a long time ago there were. </em></p><p>What makes this a difficult question to answer is that the truth is rather prosaic.  I write because that’s what I do.  I was writing almost every day back when no one ever read anything I’d written, and were I ever to lose my various publication outlets, I would continue to write in much the same manner that I do now.</p><p>It is possible that my writing is at times too elevated.  Certainly, UPS has been told this by editors at some of America’s largest newspapers and I have been encouraged by numerous people, including members of my own family, to make it more accessible.  I even made an attempt at this – rewriting my WND column for the syndicate using less complex sentences – but it was too much work to be worth the effort.  This isn’t an artistic arrogance thing or anything like that, it’s just that one writes how one happens to write – which is usually not the way one speaks, by the way.  One thing I have noticed is that there is a rhythmic component to my prose that only becomes noticeable when an editor modifies a word or two and throws the pattern off – often the changes are quite gramatically correct, but I find them very jarring.</p><p>For whom am I writing?  Those who love truth and freedom.  Those who are open to new ideas.  Those who are willing to read and weigh the evidence before dismissing what is written.  I’m not particularly interested in preaching to the choir nor in earnestly trying to convince those who think differently than I do – I’m well aware that most people think very differently, and that’s been the case for as long as I can remember.  It doesn’t bother me in the least.</p><p>On a daily and weekly basis, I simply write about what interests me and is at least vaguely related to the topics of the day.  I don’t have a plan, and I don’t write to show off.  My friends are often amused by the assumptions made by people who believe they know much about me, much less understand me.  Writing is my amusement, not my work, and I consider myself truly fortunate to have achieved a small measure of success at something I very much enjoy.  This is why you will probably never see me running from news show to news show, trying to build my career and literary fame by becoming a talking head.  It’s not of zero interest to me, but my interest level in it is just slightly ahead of the notion of acquiring a coaching license and becoming a professional soccer coach.  I probably won’t do either.</p><p>Is that crazy?  Perhaps, by modern standards.  But I am happy and I am content, which in this age of envy, dissatisfaction and rage, is more than many can honestly say.</p></div>",
  "content_text": "BG writes:\nI read your articles from time to time. I feel they are above the average individual. Do you feel that your articles are directed to a certain person, or just for whoever stumbles upon them? I myself have read only a few, and think you are one of the best writers I have ever heard of….  Surely you must have a plan, or have been given a call. I truly hope you don’t waste your talents picking apart the evil of the left while trying to show off your obviously elevated writing intellect. I’m not slamming you at all. I wish there were more people like you, a long time ago there were.\nWhat makes this a difficult question to answer is that the truth is rather prosaic.  I write because that’s what I do.  I was writing almost every day back when no one ever read anything I’d written, and were I ever to lose my various publication outlets, I would continue to write in much the same manner that I do now.\nIt is possible that my writing is at times too elevated.  Certainly, UPS has been told this by editors at some of America’s largest newspapers and I have been encouraged by numerous people, including members of my own family, to make it more accessible.  I even made an attempt at this – rewriting my WND column for the syndicate using less complex sentences – but it was too much work to be worth the effort.  This isn’t an artistic arrogance thing or anything like that, it’s just that one writes how one happens to write – which is usually not the way one speaks, by the way.  One thing I have noticed is that there is a rhythmic component to my prose that only becomes noticeable when an editor modifies a word or two and throws the pattern off – often the changes are quite gramatically correct, but I find them very jarring.\nFor whom am I writing?  Those who love truth and freedom.  Those who are open to new ideas.  Those who are willing to read and weigh the evidence before dismissing what is written.  I’m not particularly interested in preaching to the choir nor in earnestly trying to convince those who think differently than I do – I’m well aware that most people think very differently, and that’s been the case for as long as I can remember.  It doesn’t bother me in the least.\nOn a daily and weekly basis, I simply write about what interests me and is at least vaguely related to the topics of the day.  I don’t have a plan, and I don’t write to show off.  My friends are often amused by the assumptions made by people who believe they know much about me, much less understand me.  Writing is my amusement, not my work, and I consider myself truly fortunate to have achieved a small measure of success at something I very much enjoy.  This is why you will probably never see me running from news show to news show, trying to build my career and literary fame by becoming a talking head.  It’s not of zero interest to me, but my interest level in it is just slightly ahead of the notion of acquiring a coaching license and becoming a professional soccer coach.  I probably won’t do either.\nIs that crazy?  Perhaps, by modern standards.  But I am happy and I am content, which in this age of envy, dissatisfaction and rage, is more than many can honestly say.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-29T00:30:00+00:00"
}