{
  "url": "https://voxday.net/2003/12/27/mailbox-exemplary-indoctrination/",
  "scraped_at": "2025-12-13T15:40:12.856586",
  "title": "Mailbox: Exemplary Indoctrination",
  "date_display": "December 27, 2003",
  "date_iso": "2003-12-27T10:53:00+00:00",
  "date_from_url": "2003-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SB writes: <em>Now I know why I read this blog again.  Wow, that’s just about the oddest thing I have ever read.  My son attends a public elementary school that is only slightly less conservative than Jerry Falwell.  Of course, I live in a relatively conservative state (Texas), and grew up in one (Tennessee), so perhaps the experience differs depending on where you have children in school.  I’m not sure a “rightist” education is any better than a “leftist” one.  Granted, I’m not exactly sure what would constitute a “leftist” one (teaching egalitarianism, avoiding sexist language, leaving religious references out of the curriculum, perhaps?)…. I have a feeling my version of politically neutral education is exactly what this person was referring to as “leftist indoctrination.” </em></p><p>Never trust your feelings in matters of simple fact.  This <a href=\"http://www1.umn.edu/humanrts/edumat/hreduseries/tb1b/Section2/activity2.html\">straightforward role-playing of Marxist distribution theory</a> is what the public school teacher was writing about  – hardly politically neutral – and this is only one example of many.  I got my hands on a Profiles of Learning test five years ago, and the amount of raw propaganda in the reading comprehension section was unbelievable.  I’m quite sure I would have completely failed the “comprehension” test, simply because I was in possession of facts that contradicted the “correct” answers – the test really struck me as being more something to weed out those with views deemed inappropriate than to test any ability to read.  I recall that one Wisconsin homeschooled girl who scored over 1400 on her SATs failed it – fortunately, the public outcry in Minnesota over the PoL’s brainwashing program caused the state Senate to repeal it, which has slowed down its implementation somewhat.</p><p>Like most parents whose children are in public school, SB is unlikely to have much information about precisely what is being taught in his child’s school, what the education establishment is planning to teach there in the near future, and why.  He cannot know, because he is not permitted to see the most important tests that his child is given.  This determination to hear, see and think no evil of the government schools is interesting, in light of the fact that more and more public school teachers – even award-winning teachers like <a href=\"http://www.johntaylorgatto.com/fourthpurpose/1.htm\">John Gatto</a> – are damning them in no uncertain terms.</p></div>",
  "content_text": "SB writes:\nNow I know why I read this blog again.  Wow, that’s just about the oddest thing I have ever read.  My son attends a public elementary school that is only slightly less conservative than Jerry Falwell.  Of course, I live in a relatively conservative state (Texas), and grew up in one (Tennessee), so perhaps the experience differs depending on where you have children in school.  I’m not sure a “rightist” education is any better than a “leftist” one.  Granted, I’m not exactly sure what would constitute a “leftist” one (teaching egalitarianism, avoiding sexist language, leaving religious references out of the curriculum, perhaps?)…. I have a feeling my version of politically neutral education is exactly what this person was referring to as “leftist indoctrination.”\nNever trust your feelings in matters of simple fact.  This\nstraightforward role-playing of Marxist distribution theory\nis what the public school teacher was writing about  – hardly politically neutral – and this is only one example of many.  I got my hands on a Profiles of Learning test five years ago, and the amount of raw propaganda in the reading comprehension section was unbelievable.  I’m quite sure I would have completely failed the “comprehension” test, simply because I was in possession of facts that contradicted the “correct” answers – the test really struck me as being more something to weed out those with views deemed inappropriate than to test any ability to read.  I recall that one Wisconsin homeschooled girl who scored over 1400 on her SATs failed it – fortunately, the public outcry in Minnesota over the PoL’s brainwashing program caused the state Senate to repeal it, which has slowed down its implementation somewhat.\nLike most parents whose children are in public school, SB is unlikely to have much information about precisely what is being taught in his child’s school, what the education establishment is planning to teach there in the near future, and why.  He cannot know, because he is not permitted to see the most important tests that his child is given.  This determination to hear, see and think no evil of the government schools is interesting, in light of the fact that more and more public school teachers – even award-winning teachers like\nJohn Gatto\n– are damning them in no uncertain terms.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-27T10:53:00+00:00"
}