{
  "url": "https://voxday.net/2003/12/31/mailbox-on-learning-language/",
  "scraped_at": "2025-12-13T15:40:53.554369",
  "title": "Mailbox: On learning language",
  "date_display": "December 31, 2003",
  "date_iso": "2003-12-31T13:38:00+00:00",
  "date_from_url": "2003-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB commiserates about the Vikes and asks: <em>Question…did you learn those foreign languages at an early age?  I have recently tried to learn a bit of Italian.  Although I can speak and understand some basics, I can’t imagine the amount of work it would take to get fluent at reading the language. If you learned to read either of these languages as an adult, were there any particular strategies you used to help you in your quest?</em></p><p>No, I did not.  I had five years of German in junior high and high school with an excellent German teacher.  I studiedJapanese in college and learned Italian as an adult while living in Europe.  My Italian is usually described as “bellissimo… per un americano”, which is to say that it’s functionally conversational as long as the other person doesn’t speak troppo veloce or use a lot of idioms.  I still remember trying to figure out how the heck a wolf had come into the picture during a conversation about school when my friend saw my confusion, laughed, and explained that “in the mouth of the wolf” is an idiom used to say that you’re facing a difficult situation.  One responds by saying “hit the wolf”, if I recall correctly.  Of course, Italians are so shocked that you speak any Italian that they tend to give you far too much credit.  My German used to be quite good, but it’s been so long since I’ve used it that it’s a real struggle.  More often than not, it tends to come out Italian.  The Japanese is totally shot.</p><p>I find that reading a language is much easier than speaking it.  The tough part about reading Italian is the placement of pronouns, as they tend to scatter si and ci around pretty haphazardly – the fact that both words are part of the reflexive verb structure as well as serving as a pronoun and at least one other unrelated word doesn’t make it any easier – and the use of the gender-specific “the” as a pronoun is also confusing.  La what?  Which la?  Le?  Who?  Speaking also doesn’t help as much with reading as you’d hope.  I was reading “Il visconte dimezzato” and fortunately, references to starvation, putrifecation and corpses hadn’t tended to come up in my everyday conversation with people, so I was forced to resort to the dictionary distressingly often.</p><p>I would recommend starting with a book like 501 Italian Verbs, published by Barron’s, which has the seven simple tenses and seven complex tenses for the most common verbs.  Verbs are the key to any language, as once you have that, its usually relatively easy to figure out the subject and the object.  Make up a flash card system or use something like <a href=\"http://www.openwindow.com/index.html\">WinFlash</a> on your computer.  Don’t go on from the present indicative until you know 85 percent of them down cold, then start mixing in the imperfect, future and present perfect conjugations.  Unfortunately, there’s a lot of irregulars, but having the basics down really helps.  Just do 15 minutes every day, and you’ll make progress.</p></div>",
  "content_text": "JB commiserates about the Vikes and asks:\nQuestion…did you learn those foreign languages at an early age?  I have recently tried to learn a bit of Italian.  Although I can speak and understand some basics, I can’t imagine the amount of work it would take to get fluent at reading the language. If you learned to read either of these languages as an adult, were there any particular strategies you used to help you in your quest?\nNo, I did not.  I had five years of German in junior high and high school with an excellent German teacher.  I studiedJapanese in college and learned Italian as an adult while living in Europe.  My Italian is usually described as “bellissimo… per un americano”, which is to say that it’s functionally conversational as long as the other person doesn’t speak troppo veloce or use a lot of idioms.  I still remember trying to figure out how the heck a wolf had come into the picture during a conversation about school when my friend saw my confusion, laughed, and explained that “in the mouth of the wolf” is an idiom used to say that you’re facing a difficult situation.  One responds by saying “hit the wolf”, if I recall correctly.  Of course, Italians are so shocked that you speak any Italian that they tend to give you far too much credit.  My German used to be quite good, but it’s been so long since I’ve used it that it’s a real struggle.  More often than not, it tends to come out Italian.  The Japanese is totally shot.\nI find that reading a language is much easier than speaking it.  The tough part about reading Italian is the placement of pronouns, as they tend to scatter si and ci around pretty haphazardly – the fact that both words are part of the reflexive verb structure as well as serving as a pronoun and at least one other unrelated word doesn’t make it any easier – and the use of the gender-specific “the” as a pronoun is also confusing.  La what?  Which la?  Le?  Who?  Speaking also doesn’t help as much with reading as you’d hope.  I was reading “Il visconte dimezzato” and fortunately, references to starvation, putrifecation and corpses hadn’t tended to come up in my everyday conversation with people, so I was forced to resort to the dictionary distressingly often.\nI would recommend starting with a book like 501 Italian Verbs, published by Barron’s, which has the seven simple tenses and seven complex tenses for the most common verbs.  Verbs are the key to any language, as once you have that, its usually relatively easy to figure out the subject and the object.  Make up a flash card system or use something like\nWinFlash\non your computer.  Don’t go on from the present indicative until you know 85 percent of them down cold, then start mixing in the imperfect, future and present perfect conjugations.  Unfortunately, there’s a lot of irregulars, but having the basics down really helps.  Just do 15 minutes every day, and you’ll make progress.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-31T13:38:00+00:00"
}