{
  "url": "https://voxday.net/2003/12/24/mailbox-true/",
  "scraped_at": "2025-12-13T15:39:56.311366",
  "title": "Mailbox: True",
  "date_display": "December 24, 2003",
  "date_iso": "2003-12-24T16:25:00+00:00",
  "date_from_url": "2003-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>D-Lo writes: <em>After reading your commentary on the JRR Tolkien fiction epic turned movie” Return of the King” I can now understand why you are also so intrigued by football in the NFL.  The former was written as a work of fiction, the latter has become a work of fiction on par with WWF/WWE. Since the Minnesota Vikings were egregiously robbed by overt officiating on behalf of the Dallas Cowboys on December 28th, 1975 in the famous Hail Mary pass, it’s all become a sham!</em></p><p>You mean, infamous Hail Mary pass.  The game that stole the Super Bowl.  The game that killed Fran Tarkenton’s dad.  The game that defined my Purple heart.  I had cheered both the Vikings and the Cowboys as a small child, because my mother was a college friend of Roger Staubach and I’d been brought up to support the Naval Academy, Roger Staubach and the Dallas Cowboys.  But that game….</p><p>Speaking of Mom, I probably get my taste for the martial arts from her.  She was at that game with my Dad and when they got back, some hours later, she was still hopping mad.  At some point, apparently her primary affection had been transferred to the Vikes.  When I told her that a referee had been injured by a thrown bottle, her response was as immediate as it was unchristian.  “Good – I threw everything I had except my purse!”  Which explained why they hadn’t brought me home a program.</p><p>Okay, maybe it wasn’t right, but it still makes me laugh.  You have to love Mom.  She dresses up with a full headdress complete with tom-tom to watch the Redskins – alone.  I don’t quite understand it, but she likes the Vikes, the Redskins and the Cowboys, in that order… I think.  Her only real football loyalty is to USC, as far as I can tell, unless they play the Naval Academy.</p></div>",
  "content_text": "D-Lo writes:\nAfter reading your commentary on the JRR Tolkien fiction epic turned movie” Return of the King” I can now understand why you are also so intrigued by football in the NFL.  The former was written as a work of fiction, the latter has become a work of fiction on par with WWF/WWE. Since the Minnesota Vikings were egregiously robbed by overt officiating on behalf of the Dallas Cowboys on December 28th, 1975 in the famous Hail Mary pass, it’s all become a sham!\nYou mean, infamous Hail Mary pass.  The game that stole the Super Bowl.  The game that killed Fran Tarkenton’s dad.  The game that defined my Purple heart.  I had cheered both the Vikings and the Cowboys as a small child, because my mother was a college friend of Roger Staubach and I’d been brought up to support the Naval Academy, Roger Staubach and the Dallas Cowboys.  But that game….\nSpeaking of Mom, I probably get my taste for the martial arts from her.  She was at that game with my Dad and when they got back, some hours later, she was still hopping mad.  At some point, apparently her primary affection had been transferred to the Vikes.  When I told her that a referee had been injured by a thrown bottle, her response was as immediate as it was unchristian.  “Good – I threw everything I had except my purse!”  Which explained why they hadn’t brought me home a program.\nOkay, maybe it wasn’t right, but it still makes me laugh.  You have to love Mom.  She dresses up with a full headdress complete with tom-tom to watch the Redskins – alone.  I don’t quite understand it, but she likes the Vikes, the Redskins and the Cowboys, in that order… I think.  Her only real football loyalty is to USC, as far as I can tell, unless they play the Naval Academy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-24T16:25:00+00:00"
}