{
  "url": "https://voxday.net/2003/12/30/mailbox-secular-inquisition/",
  "scraped_at": "2025-12-13T15:40:44.342947",
  "title": "Mailbox: the Secular Inquisition",
  "date_display": "December 30, 2003",
  "date_iso": "2003-12-30T10:33:00+00:00",
  "date_from_url": "2003-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JH writes: <em>In your latest column, you refer to secularist American politicians as a “secular inquisition.”  In using this phrase, you trivialize the sufferings of hundreds of thousands of Christians (and non-Christians). If you were a reader of European history, you would know that Protestants and proto-Protestants suffered appallingly at the hands of the Roman and Spanish Inquisitions.  You insult the memory of these martyrs when you compare non-violent advocates of secularism to the fiends of centuries past.</em></p><p>I am, as many of you know, a reader of European history.  Which I have read in italiano and Deutsch, as well as English.  The purpose of the Spanish Inquisition – which was a government affair instigated at the command of Queen Isabella – was not to persecute non-Christians, it was to ferret out non-Christians – mostly Jews – who were falsely pretending to be Christians in order to violate the King’s proclamation which banned Jews from the kingdom, as well as heretics pretending to be orthodox.  It was not a haphazard persecution of imaginary enemies, although like all government programs, it had a tendency to run amok at times.</p><p>I once thought much as JH, until I began reading some of the historical documents relating to the Spanish Inquisition.  The first thing that struck me was how the rules and procedures were tightly written to protect those being “asked the question”.  They could only be tortured twice, by law, and no blood was allowed to be shed.  Contrast with this the procedures which are used by modern secular torturers, which are far more savage and used with far less discrimination.  Much of what was assumed of the Inquisitions was largely after-the-fact Protestant propaganda – and please keep in mind that I am a Protestant myself, I am no Catholic apologist.</p><p>Furthermore, the <a href=\"http://www.bringyou.to/apologetics/num25.htm\">most recent analyses of the Inquisition estimate around 6,000 executions in 356 years</a>.  This pales in comparison to nearly every human tragedy of the past, and is again testimony to the relatively civilized nature of the Inquisition.  One can hardly call it a great tragedy when more than twice as many American children are killed on bicycles ever year than perished in the dread flames of the <em>auto-da-fe</em>.  I am not defending the Inquisition itself, I do, however, insist on defending the historical record and I stand by my condemnation of the secular inquisition, which poses a far greater threat than the Spanish Inquisition ever did.</p><p>I think it is fair to lay at least partial blame for the Molochian holocaust of American abortion at the feet of this secular inquisition; a tragedy which in a single year far exceeds the 356-year toll of the Inquisition.  In any case, the secular inquisition – which consists of more than America’s politicians – has only been with us for about thirty years; it has another 326 to go before one can absolve it of innocence in comparison with one of its historical predecessors.  As to the Roman, I have not done my due diligence, but I will be glad to address that question once I have.</p></div>",
  "content_text": "JH writes:\nIn your latest column, you refer to secularist American politicians as a “secular inquisition.”  In using this phrase, you trivialize the sufferings of hundreds of thousands of Christians (and non-Christians). If you were a reader of European history, you would know that Protestants and proto-Protestants suffered appallingly at the hands of the Roman and Spanish Inquisitions.  You insult the memory of these martyrs when you compare non-violent advocates of secularism to the fiends of centuries past.\nI am, as many of you know, a reader of European history.  Which I have read in italiano and Deutsch, as well as English.  The purpose of the Spanish Inquisition – which was a government affair instigated at the command of Queen Isabella – was not to persecute non-Christians, it was to ferret out non-Christians – mostly Jews – who were falsely pretending to be Christians in order to violate the King’s proclamation which banned Jews from the kingdom, as well as heretics pretending to be orthodox.  It was not a haphazard persecution of imaginary enemies, although like all government programs, it had a tendency to run amok at times.\nI once thought much as JH, until I began reading some of the historical documents relating to the Spanish Inquisition.  The first thing that struck me was how the rules and procedures were tightly written to protect those being “asked the question”.  They could only be tortured twice, by law, and no blood was allowed to be shed.  Contrast with this the procedures which are used by modern secular torturers, which are far more savage and used with far less discrimination.  Much of what was assumed of the Inquisitions was largely after-the-fact Protestant propaganda – and please keep in mind that I am a Protestant myself, I am no Catholic apologist.\nFurthermore, the\nmost recent analyses of the Inquisition estimate around 6,000 executions in 356 years\n.  This pales in comparison to nearly every human tragedy of the past, and is again testimony to the relatively civilized nature of the Inquisition.  One can hardly call it a great tragedy when more than twice as many American children are killed on bicycles ever year than perished in the dread flames of the\nauto-da-fe\n.  I am not defending the Inquisition itself, I do, however, insist on defending the historical record and I stand by my condemnation of the secular inquisition, which poses a far greater threat than the Spanish Inquisition ever did.\nI think it is fair to lay at least partial blame for the Molochian holocaust of American abortion at the feet of this secular inquisition; a tragedy which in a single year far exceeds the 356-year toll of the Inquisition.  In any case, the secular inquisition – which consists of more than America’s politicians – has only been with us for about thirty years; it has another 326 to go before one can absolve it of innocence in comparison with one of its historical predecessors.  As to the Roman, I have not done my due diligence, but I will be glad to address that question once I have.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-30T10:33:00+00:00"
}