{
  "url": "https://voxday.net/2003/12/30/mailbox-failing-reading-comprehension/",
  "scraped_at": "2025-12-13T15:40:42.500149",
  "title": "Mailbox: Failing reading comprehension 101",
  "date_display": "December 30, 2003",
  "date_iso": "2003-12-30T09:31:00+00:00",
  "date_from_url": "2003-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PZ writes: <em>As a flaming liberal I don’t understand why your side thinks we need government running our religious lives. Is it he place of government to decide if a gay couple can get married? If so, show me where it’s at in the Constitution. Is it the place of government to say gays should go to jail for having consensual sex? I don’t think so. Religion is an excuse to hate, or better put, your version of religion justifies your hate on anyone who doesn’t pander to your religious beliefs. I have a suggestion, grow up.</em></p><p>PZ leaps in by demonstrating that he’s unfamiliar with both my column and the blog, as well as his failure to comprehend what he reads.  It seems that in his mind, defending Howard Dean’s suspiciously timed quasi-profession of faith is tantamount to advocating government running the religious lives of the people.  As all my regular readers know, I am a libertarian and do not want the government doing anything except defending national borders and property rights.  While I have supported the Defense of Marriage Amendment in the past – not that PZ would know – this is only because the state is already integrated into the process.  I will withdraw my support of DoMA the moment marriage is returned to the sole purview of the churches.  As for religion being an excuse to hate, I have a plethora of hate-filled emails from atheists that disprove this, as do the writings of many a secularist hatemonger such as Lenin.  Furthermore, PZ contradicts himself.  Howard Dean is pandering to Christians, so therefore I hate him because he isn’t pandering to my religious beliefs?  This makes no sense.</p><p><em>I’m thinking you’re one of those religious nuts who has to have YOUR religion stroked or you’re not satisfied. If Dean wasn’t a Christian you’d have another reason to hate him wouldn’t you. I like how so-called Christians use their religions to justify bigotry and hate. </em></p><p>Here PZ equates a failure to support politically with hate.  An interesting insight into the unstable mind of the Left.  He may like how so-called Christians justify bigotry and hate, but I don’t know what that has to do with my column on Howard Dean, except for PZ’s very broad expansion of the concept of hate.  And, of course, Howard Dean IS stroking my religion, so again, PZ reveals his inability to understand either what Howard Dean is doing, why Christians are taking exception to it or what I wrote in defense of his actions.<br> <br><em><br> <br>This statement is a blatant lie; “And having wrapped up the loyalties of the small, but vicious anti-Christian left, Dean knows he now must tack hard to the religious right to have any hope of winning in November. He cannot hope to win the evangelical vote.: I dont have a problem with religions but clearly you think anyone who disagrees with YOU is a “vicious anti-Christian.” Once again, grow up…and stop listening to those whove taught you to hate.</br></br></em></br></br></p><p>Another howler.  Is there an anti-Christian left?  Yes, there certainly is.  Is it numerically large?  Not according to any poll I’ve ever seen.  Is it vicious?  Yes, one need merely peruse its writings.  Who do these people most strongly support in the Democratic primary?  Howard Dean.  Is Howard Dean tacking to the religious right?  He has announced his intention to do so in the Boston Globe.  Can he win the evangelical vote?  No, not a single political expert believes he can.  Not a single untruth, much less a blatant lie, in my statement.   There are many, many people who disagree with me, Republicans and Democrats alike, for I am neither.  Considering that I stated the number of vicious anti-Christians is small, how is it remotely conceivable to state that I think anyone who disagrees with me belongs to that group?</p><p>As to the repeated instruction to “grow up”, these, combined with the baseless and irrational assertions made, demonstrate that PZ is engaging in some powerful emotional projection.  He would do well to heed his own advice.</p><p><em>An adult knows people have opposing points of views and doesn’t label everyone in a group as being anti-anything. When you attack, expect to be attacked back. If you can’t take it, stop attacking or stop writing.</em></p><p>Again, PZ engages in projection, while making me wonder how he would choose to label a group that consists solely of those who virulently oppose something in every way.  Would no adult label Greenpeace anti-pollution?  Just a silly, silly assertion.  I never said all Dean supporters fell into the anti-Christian category, only that those individuals who do fall into that group are strong Dean supporters.  And once more, PZ reveals his total lack of familiarity with me, my column and my blog, as I can state with reasonable assurance that there is no nationally syndicated columnist who responds publicly to a higher percentage of his critical mail than I do.</p><p>Of course, as PZ has now learned, there’s a reason why my hate mail has dropped 90 percent since I instituted the Mailbox.   Write whatever you want – attack me however you like – there’s a reasonable chance I’ll publish it.  And it’s possible that you might even come off well.</p><p>But your odds, well, they’re not so good.</p></div>",
  "content_text": "PZ writes:\nAs a flaming liberal I don’t understand why your side thinks we need government running our religious lives. Is it he place of government to decide if a gay couple can get married? If so, show me where it’s at in the Constitution. Is it the place of government to say gays should go to jail for having consensual sex? I don’t think so. Religion is an excuse to hate, or better put, your version of religion justifies your hate on anyone who doesn’t pander to your religious beliefs. I have a suggestion, grow up.\nPZ leaps in by demonstrating that he’s unfamiliar with both my column and the blog, as well as his failure to comprehend what he reads.  It seems that in his mind, defending Howard Dean’s suspiciously timed quasi-profession of faith is tantamount to advocating government running the religious lives of the people.  As all my regular readers know, I am a libertarian and do not want the government doing anything except defending national borders and property rights.  While I have supported the Defense of Marriage Amendment in the past – not that PZ would know – this is only because the state is already integrated into the process.  I will withdraw my support of DoMA the moment marriage is returned to the sole purview of the churches.  As for religion being an excuse to hate, I have a plethora of hate-filled emails from atheists that disprove this, as do the writings of many a secularist hatemonger such as Lenin.  Furthermore, PZ contradicts himself.  Howard Dean is pandering to Christians, so therefore I hate him because he isn’t pandering to my religious beliefs?  This makes no sense.\nI’m thinking you’re one of those religious nuts who has to have YOUR religion stroked or you’re not satisfied. If Dean wasn’t a Christian you’d have another reason to hate him wouldn’t you. I like how so-called Christians use their religions to justify bigotry and hate.\nHere PZ equates a failure to support politically with hate.  An interesting insight into the unstable mind of the Left.  He may like how so-called Christians justify bigotry and hate, but I don’t know what that has to do with my column on Howard Dean, except for PZ’s very broad expansion of the concept of hate.  And, of course, Howard Dean IS stroking my religion, so again, PZ reveals his inability to understand either what Howard Dean is doing, why Christians are taking exception to it or what I wrote in defense of his actions.\nThis statement is a blatant lie; “And having wrapped up the loyalties of the small, but vicious anti-Christian left, Dean knows he now must tack hard to the religious right to have any hope of winning in November. He cannot hope to win the evangelical vote.: I dont have a problem with religions but clearly you think anyone who disagrees with YOU is a “vicious anti-Christian.” Once again, grow up…and stop listening to those whove taught you to hate.\nAnother howler.  Is there an anti-Christian left?  Yes, there certainly is.  Is it numerically large?  Not according to any poll I’ve ever seen.  Is it vicious?  Yes, one need merely peruse its writings.  Who do these people most strongly support in the Democratic primary?  Howard Dean.  Is Howard Dean tacking to the religious right?  He has announced his intention to do so in the Boston Globe.  Can he win the evangelical vote?  No, not a single political expert believes he can.  Not a single untruth, much less a blatant lie, in my statement.   There are many, many people who disagree with me, Republicans and Democrats alike, for I am neither.  Considering that I stated the number of vicious anti-Christians is small, how is it remotely conceivable to state that I think anyone who disagrees with me belongs to that group?\nAs to the repeated instruction to “grow up”, these, combined with the baseless and irrational assertions made, demonstrate that PZ is engaging in some powerful emotional projection.  He would do well to heed his own advice.\nAn adult knows people have opposing points of views and doesn’t label everyone in a group as being anti-anything. When you attack, expect to be attacked back. If you can’t take it, stop attacking or stop writing.\nAgain, PZ engages in projection, while making me wonder how he would choose to label a group that consists solely of those who virulently oppose something in every way.  Would no adult label Greenpeace anti-pollution?  Just a silly, silly assertion.  I never said all Dean supporters fell into the anti-Christian category, only that those individuals who do fall into that group are strong Dean supporters.  And once more, PZ reveals his total lack of familiarity with me, my column and my blog, as I can state with reasonable assurance that there is no nationally syndicated columnist who responds publicly to a higher percentage of his critical mail than I do.\nOf course, as PZ has now learned, there’s a reason why my hate mail has dropped 90 percent since I instituted the Mailbox.   Write whatever you want – attack me however you like – there’s a reasonable chance I’ll publish it.  And it’s possible that you might even come off well.\nBut your odds, well, they’re not so good.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-30T09:31:00+00:00"
}