{
  "url": "https://voxday.net/2003/12/30/mailbox-howard-dean-compassionate/",
  "scraped_at": "2025-12-13T15:40:47.998651",
  "title": "Mailbox: Howard Dean, compassionate conservative",
  "date_display": "December 30, 2003",
  "date_iso": "2003-12-30T19:45:00+00:00",
  "date_from_url": "2003-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Seriously,  the header on an email from one SP is “Howard Dean Lives Compassionately and is Conservative”, who goes on to write: <em>How sad that your religious convictions preach exclusion rather than inclusion.  Jesus was anything but exclusive is thoughts and deeds.  Jesus did not use invective as you do, he loved rather than hated. Where are you sitting to judge others who differ in opinion on issues of separation of church and state. Do you support those who call themselves Christians but practice exclusion and spew invective. </em></p><p>Looks like Gov. Dean has nailed down the LSD vote.  Yes, I fully support those who practice exclusion and “spew invective”.  I think a few quotes from the man whose words are clearly unknown to SP will suffice by way of response:</p><p>“None shall come to the Father but by me.”  (Sounds pretty exclusionary to me.)</p><p>“The Son of Man will send out his angels, and they will gather out of his kingdom all things that offend, and those who practice lawlessness, and will cast them into the furnace of fire.  There will be a wailing and gnashing of teeth.”  (For those who don’t know, Jesus is the Son of Man.  More exclusion, and at his command.)</p><p>“Thus you have made the commandment of God of no effect by your tradition.  Hypocrites!”</p><p>“It is not good to take the children’s bread and throw it to the little dogs.”  (Samaritans being equated with little dogs.)</p><p>“O faithless and perverse generation, how long shall I be with you?  How long shall I bear with you?”</p><p>“Serpents, brood of vipers!  How can you escape the condemnation of hell?”</p><p>Woe to you, scribes and Pharisees, hypocrites!  For you are like white-washed tombs which indeed appear beautiful outwardly, but inside are full of dead men’s bones and all uncleanness.”</p><p>The only significant flaw that I can see with my invective is that it falls far short of the slashing example set by Jesus Christ.  There was more from SP, but it didn’t merit response, being wholly delusional.  His argument boils down to the notion that since Howard Dean wants to take your money away from you and give it to other people, he is being loving like Jesus.</p><p>Never mind that Jesus also said: “But if he refuses to even hear the church, let him be to you like a heathen and a tax collector.”</p></div>",
  "content_text": "Seriously,  the header on an email from one SP is “Howard Dean Lives Compassionately and is Conservative”, who goes on to write:\nHow sad that your religious convictions preach exclusion rather than inclusion.  Jesus was anything but exclusive is thoughts and deeds.  Jesus did not use invective as you do, he loved rather than hated. Where are you sitting to judge others who differ in opinion on issues of separation of church and state. Do you support those who call themselves Christians but practice exclusion and spew invective.\nLooks like Gov. Dean has nailed down the LSD vote.  Yes, I fully support those who practice exclusion and “spew invective”.  I think a few quotes from the man whose words are clearly unknown to SP will suffice by way of response:\n“None shall come to the Father but by me.”  (Sounds pretty exclusionary to me.)\n“The Son of Man will send out his angels, and they will gather out of his kingdom all things that offend, and those who practice lawlessness, and will cast them into the furnace of fire.  There will be a wailing and gnashing of teeth.”  (For those who don’t know, Jesus is the Son of Man.  More exclusion, and at his command.)\n“Thus you have made the commandment of God of no effect by your tradition.  Hypocrites!”\n“It is not good to take the children’s bread and throw it to the little dogs.”  (Samaritans being equated with little dogs.)\n“O faithless and perverse generation, how long shall I be with you?  How long shall I bear with you?”\n“Serpents, brood of vipers!  How can you escape the condemnation of hell?”\nWoe to you, scribes and Pharisees, hypocrites!  For you are like white-washed tombs which indeed appear beautiful outwardly, but inside are full of dead men’s bones and all uncleanness.”\nThe only significant flaw that I can see with my invective is that it falls far short of the slashing example set by Jesus Christ.  There was more from SP, but it didn’t merit response, being wholly delusional.  His argument boils down to the notion that since Howard Dean wants to take your money away from you and give it to other people, he is being loving like Jesus.\nNever mind that Jesus also said: “But if he refuses to even hear the church, let him be to you like a heathen and a tax collector.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-30T19:45:00+00:00"
}