{
  "url": "https://voxday.net/2003/12/12/maybe-you-need-to-listen-harder/",
  "scraped_at": "2025-12-13T15:38:19.707746",
  "title": "Maybe you need to listen harder",
  "date_display": "December 12, 2003",
  "date_iso": "2003-12-12T11:06:00+00:00",
  "date_from_url": "2003-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em><a href=\"http://www.nationalreview.com/goldberg/goldberg200312111243.asp\">By the way, where the hell is this much-vaunted blogosphere</a>? If three freshman congressmen from Wisconsin hinted that they wanted to regulate the use of umlauts on the internet in honor of Leif Ericson’s birthday, bloggers would be on the steps of Congress up-ending cans of gasoline on themselves in protest at such an infringement on free speech. But here we have all three branches of the government severely restricting independent speech outside of the dinosaurs of Old Media and the relative silence — minus a few noble exceptions (The Volokh conspiracy, Instapundit) — is deafening.</em><br> <br>– Jonah Goldberg, NRO</br></br></p><p>Jonah, some of us are speaking out.  If you don’t hear it, well, that’s too bad.  The Bipartisan Campaign Reform Act is absolutely an unconstitional abomination, but then, it is only the latest among many Supreme Court abominations.  It may suit the professional punditocracy to shout and point fingers to no avail – yes, I probably count as one in a technical sense, but I’m in no way an NYC/Beltway columnist – but we’re truly at the beating-a-dead-horse point where the Supreme Court is concerned.  From a Constitutional perspective, there is a giant fork sticking out of the back of every justice except Thomas and Scalia.  They are done.</p><p>So, the issue is a larger one.  All three branches of the Federal government have demonstrated in the last three years that they have no respect or regard for the Constitution.  WHAT DO WE DO ABOUT THIS?  Especially considering that champions of the current administration, including Jonah himself, are unwilling to see or hear any evil of it.  Republicans gave us this unconstitutional law, and a mostly Republican-appointed Supreme Court upheld it.  So we should vote for more Republicans?  I don’t think so.</p><p>The Bipartisan Campaign Reform Act demonstrates, <em>sopratutto,</em> that we need a new party.  If you want to oppose it, Jonah, then make the leap.  Go Libertarian.  You are a conservative, true, but the Republican party is leaving you.  As for these terrible laws themselves, civil disobedience is the only answer until we can change them.</p></div>",
  "content_text": "By the way, where the hell is this much-vaunted blogosphere\n? If three freshman congressmen from Wisconsin hinted that they wanted to regulate the use of umlauts on the internet in honor of Leif Ericson’s birthday, bloggers would be on the steps of Congress up-ending cans of gasoline on themselves in protest at such an infringement on free speech. But here we have all three branches of the government severely restricting independent speech outside of the dinosaurs of Old Media and the relative silence — minus a few noble exceptions (The Volokh conspiracy, Instapundit) — is deafening.\n– Jonah Goldberg, NRO\nJonah, some of us are speaking out.  If you don’t hear it, well, that’s too bad.  The Bipartisan Campaign Reform Act is absolutely an unconstitional abomination, but then, it is only the latest among many Supreme Court abominations.  It may suit the professional punditocracy to shout and point fingers to no avail – yes, I probably count as one in a technical sense, but I’m in no way an NYC/Beltway columnist – but we’re truly at the beating-a-dead-horse point where the Supreme Court is concerned.  From a Constitutional perspective, there is a giant fork sticking out of the back of every justice except Thomas and Scalia.  They are done.\nSo, the issue is a larger one.  All three branches of the Federal government have demonstrated in the last three years that they have no respect or regard for the Constitution.  WHAT DO WE DO ABOUT THIS?  Especially considering that champions of the current administration, including Jonah himself, are unwilling to see or hear any evil of it.  Republicans gave us this unconstitutional law, and a mostly Republican-appointed Supreme Court upheld it.  So we should vote for more Republicans?  I don’t think so.\nThe Bipartisan Campaign Reform Act demonstrates,\nsopratutto,\nthat we need a new party.  If you want to oppose it, Jonah, then make the leap.  Go Libertarian.  You are a conservative, true, but the Republican party is leaving you.  As for these terrible laws themselves, civil disobedience is the only answer until we can change them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-12T11:06:00+00:00"
}