{
  "url": "https://voxday.net/2003/12/13/more-real-than-real-dea/",
  "scraped_at": "2025-12-13T15:38:29.931372",
  "title": "More real than the real deal",
  "date_display": "December 13, 2003",
  "date_iso": "2003-12-13T07:18:00+00:00",
  "date_from_url": "2003-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The combination of unreasonable love for the game and the ability to extricate gems like this from the forgotten mists of sports history is possibly the main reason that I love <a href=\"http://espn.go.com/page2/s/simmons/031212.html\">The Sports Guy</a>.</p><p><em>And if I’m wrong, then Steve Smith can inexplicably beat the crap out of me during the next wide receiver meeting when I’m not looking.</em></p><p>And then there’s those timely current events references too: <em> (And we haven’t even gotten to Koren Robinson and Shaun Alexander yet — they were the John Muhammad and Lee Boyd Malvo of fantasy football this year. Let’s save them for another time.)</em></p><p>Truer words were never spoken.  Who was Hasselbeck throwing all those TDs to anyhow?  Itula Tualo or whomever?  This season was just brutal.  I had Hasselbeck and Manning, and was profitably playing a matchups strategy until deciding to go with the hot hand and ride my big hoss – Manning – into the playoffs since I had Stephen Davis and Domanick Davis, plus Marshall Faulk coming back healthy.  I dealt Hasselbeck for Reggie Wayne, acquired Chad Johnson and thought I was good to go, right?</p><p>Wrong!  Oh, so painfully wrong!  Somehow, I managed to run into the worst possible combination of matchups, lose four straight and finish well short of the playoffs <em>while simultaneously amassing the highest point total in the league!</em> I was regularly outscoring the entire point total of two teams combined <em>and losing</em>.  But no, I’m not bitter.</p></div>",
  "content_text": "The combination of unreasonable love for the game and the ability to extricate gems like this from the forgotten mists of sports history is possibly the main reason that I love\nThe Sports Guy\n.\nAnd if I’m wrong, then Steve Smith can inexplicably beat the crap out of me during the next wide receiver meeting when I’m not looking.\nAnd then there’s those timely current events references too:\n(And we haven’t even gotten to Koren Robinson and Shaun Alexander yet — they were the John Muhammad and Lee Boyd Malvo of fantasy football this year. Let’s save them for another time.)\nTruer words were never spoken.  Who was Hasselbeck throwing all those TDs to anyhow?  Itula Tualo or whomever?  This season was just brutal.  I had Hasselbeck and Manning, and was profitably playing a matchups strategy until deciding to go with the hot hand and ride my big hoss – Manning – into the playoffs since I had Stephen Davis and Domanick Davis, plus Marshall Faulk coming back healthy.  I dealt Hasselbeck for Reggie Wayne, acquired Chad Johnson and thought I was good to go, right?\nWrong!  Oh, so painfully wrong!  Somehow, I managed to run into the worst possible combination of matchups, lose four straight and finish well short of the playoffs\nwhile simultaneously amassing the highest point total in the league!\nI was regularly outscoring the entire point total of two teams combined\nand losing\n.  But no, I’m not bitter.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-13T07:18:00+00:00"
}