{
  "url": "https://voxday.net/2003/12/31/mowbray-gang-agley/",
  "scraped_at": "2025-12-13T15:40:59.127873",
  "title": "Mowbray gang agley",
  "date_display": "December 31, 2003",
  "date_iso": "2003-12-31T18:14:00+00:00",
  "date_from_url": "2003-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joel Mowbray writes: <em>Technically, the former head of the Central Command in the Middle East didn’t say “Jews.”  He instead used a term that has become a new favorite for anti-Semites: “neoconservatives.”  As the name implies, “neoconservative” was originally meant to denote someone who is a newcomer to the right.  In the 90’s, many people self-identified themselves as “neocons,” but today that term has become synonymous with “Jews.”</em></p><p>Joel Mowbray has done some yeoman’s work on Saudi Arabia in the last year, but he’s seriously smoking crack if he thinks that neoconservative is synonymous with Jew.  A neoconservative is someone who pretends to be a conservative, but supports a Wilsonian foreign policy.  Alternatively, a big government conservative.  In either case, a left-moderate in conservative clothes.</p><p>There may be many Jewish neoconservatives these days, as their formerly beloved Marxists and left-liberals have turned on them with a vengeance over Israel.  Unfortunately, they haven’t abandoned many of their anti-conservative positions.  If they had, there would be no need for the adjective “neo” now, would there.  I am opposed to neoconservatives.  I also defend the Jewish people and Israel at every opportunity.  Am I, too, an anti-semite?  The fraudulent manufacture of verbal offense via code word is much better left to the anti-intellectual vocabulary perverters of the Left.</p><p>Zinni hasn’t tarnished his reputation.  Mowbray, sadly, has.</p></div>",
  "content_text": "Joel Mowbray writes:\nTechnically, the former head of the Central Command in the Middle East didn’t say “Jews.”  He instead used a term that has become a new favorite for anti-Semites: “neoconservatives.”  As the name implies, “neoconservative” was originally meant to denote someone who is a newcomer to the right.  In the 90’s, many people self-identified themselves as “neocons,” but today that term has become synonymous with “Jews.”\nJoel Mowbray has done some yeoman’s work on Saudi Arabia in the last year, but he’s seriously smoking crack if he thinks that neoconservative is synonymous with Jew.  A neoconservative is someone who pretends to be a conservative, but supports a Wilsonian foreign policy.  Alternatively, a big government conservative.  In either case, a left-moderate in conservative clothes.\nThere may be many Jewish neoconservatives these days, as their formerly beloved Marxists and left-liberals have turned on them with a vengeance over Israel.  Unfortunately, they haven’t abandoned many of their anti-conservative positions.  If they had, there would be no need for the adjective “neo” now, would there.  I am opposed to neoconservatives.  I also defend the Jewish people and Israel at every opportunity.  Am I, too, an anti-semite?  The fraudulent manufacture of verbal offense via code word is much better left to the anti-intellectual vocabulary perverters of the Left.\nZinni hasn’t tarnished his reputation.  Mowbray, sadly, has.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-31T18:14:00+00:00"
}