{
  "url": "https://voxday.net/2003/12/15/next-challenge/",
  "scraped_at": "2025-12-13T15:38:41.689897",
  "title": "The next challenge",
  "date_display": "December 15, 2003",
  "date_iso": "2003-12-15T15:31:00+00:00",
  "date_from_url": "2003-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I didn’t think it was possible, but John Kerry is already making himself look like more of a doorknob than before.  Now this floppy-haired, foul-mouthed caricature of a candidate is complaining that “if [blah blah blah], we might have caught Saddam Hussein sooner.”  Sure, John, maybe we’d take you seriously if you’d been filling the airwaves with all your helpful ideas <em>before</em> the US Army caught the guy.  And if you were a different person, you might have a chance to win the election next year.</p><p>The important thing is to make sure that the globalists don’t get away with sneaking Hussein off to the Hague.  Oh, they’d love another Nuremburg, and the excuse to set themselves up as the ultimate arbiter of global justice.  The President better not let them get away with it.  Just hand him over to the Iraqis; I’m sure they’ll be able to think of something to do with him.</p><p>But don’t make the mistake of thinking that the war is over.  I’m very curious to see what happens next with regards to Syria, Iran and Saudi Arabia.</p></div>",
  "content_text": "I didn’t think it was possible, but John Kerry is already making himself look like more of a doorknob than before.  Now this floppy-haired, foul-mouthed caricature of a candidate is complaining that “if [blah blah blah], we might have caught Saddam Hussein sooner.”  Sure, John, maybe we’d take you seriously if you’d been filling the airwaves with all your helpful ideas\nbefore\nthe US Army caught the guy.  And if you were a different person, you might have a chance to win the election next year.\nThe important thing is to make sure that the globalists don’t get away with sneaking Hussein off to the Hague.  Oh, they’d love another Nuremburg, and the excuse to set themselves up as the ultimate arbiter of global justice.  The President better not let them get away with it.  Just hand him over to the Iraqis; I’m sure they’ll be able to think of something to do with him.\nBut don’t make the mistake of thinking that the war is over.  I’m very curious to see what happens next with regards to Syria, Iran and Saudi Arabia.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-15T15:31:00+00:00"
}