{
  "url": "https://voxday.net/2003/12/14/oh-its-worse-than-tha/",
  "scraped_at": "2025-12-13T15:38:31.774167",
  "title": "Oh, it’s worse than that",
  "date_display": "December 14, 2003",
  "date_iso": "2003-12-14T14:22:00+00:00",
  "date_from_url": "2003-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SC writes: <em>I keep hoping that an intelligent atheist would write this message to you, but I’m daily confounded by the vacuous idiocy in the letters you post.  I’m writing to offer you a potential explanation on why any likely rebuttal is both irrational and idiotic — your article was correct.  My close friends, among us atheists, agnostics and Christians, have long argued the position that to be truly atheist is as much faith as is Christianity, Judaism, or Islam.  Perhaps surprisingly to you, this requisite position is agreed upon by all the atheists.  Not a single one of the atheists in the group was offended or surprised by your article, as most of its topics had been expounded before.</em></p><p>Given that supposed rational, intelligent atheists objected to Bob Schieffer’s ‘no atheists in foxholes’ statement, I suspect that a well-formulated response to your article is unlikely.</p><p>Actually, I not only posted the two most thoughtful and reasonable responses to the original article – as well as my takes on them – but refrained from posting any of the truly ludicrous ones until now.  I even visited one of the atheist forums, and the responses were so childish and of such poor quality that the person who referred me to it was embarrassed and apologized.  Since this thing has dragged on far longer than I’d ever imagined, I’ll end the discussion for the time being with a fairly typical atheist response which happened to arrive this morning at the same time as SC’s email.</p><p>Daniel yaps: <em>You are sure a christian to laugh at!!!!!  U stupid cok suker…. i would put a bullet in your head if i were beside you, moron.</em></p><p>That’s the critique in its entirety, spellings and all.  Yes, proud atheists of the world, Daniel, too, is one of you.  Notice that like many of you, he claims to be laughing but is actually far more angry than amused.  In any case, I’d be curious to hear a defense of how his ethical and moral system a) has been independently and rationally developed; b) is superior to that laid out in the Bible; or c) is supposed to impress anyone with its rationality or altruism.  Just as I must claim all semi-literate Bible thumpers as my intellectual kin, you must claim him.  Keep in mind as well that a significant minority of the atheist responses I received were in this vein, and heavily outnumbered the more reasonable critiques.</p></div>",
  "content_text": "SC writes:\nI keep hoping that an intelligent atheist would write this message to you, but I’m daily confounded by the vacuous idiocy in the letters you post.  I’m writing to offer you a potential explanation on why any likely rebuttal is both irrational and idiotic — your article was correct.  My close friends, among us atheists, agnostics and Christians, have long argued the position that to be truly atheist is as much faith as is Christianity, Judaism, or Islam.  Perhaps surprisingly to you, this requisite position is agreed upon by all the atheists.  Not a single one of the atheists in the group was offended or surprised by your article, as most of its topics had been expounded before.\nGiven that supposed rational, intelligent atheists objected to Bob Schieffer’s ‘no atheists in foxholes’ statement, I suspect that a well-formulated response to your article is unlikely.\nActually, I not only posted the two most thoughtful and reasonable responses to the original article – as well as my takes on them – but refrained from posting any of the truly ludicrous ones until now.  I even visited one of the atheist forums, and the responses were so childish and of such poor quality that the person who referred me to it was embarrassed and apologized.  Since this thing has dragged on far longer than I’d ever imagined, I’ll end the discussion for the time being with a fairly typical atheist response which happened to arrive this morning at the same time as SC’s email.\nDaniel yaps:\nYou are sure a christian to laugh at!!!!!  U stupid cok suker…. i would put a bullet in your head if i were beside you, moron.\nThat’s the critique in its entirety, spellings and all.  Yes, proud atheists of the world, Daniel, too, is one of you.  Notice that like many of you, he claims to be laughing but is actually far more angry than amused.  In any case, I’d be curious to hear a defense of how his ethical and moral system a) has been independently and rationally developed; b) is superior to that laid out in the Bible; or c) is supposed to impress anyone with its rationality or altruism.  Just as I must claim all semi-literate Bible thumpers as my intellectual kin, you must claim him.  Keep in mind as well that a significant minority of the atheist responses I received were in this vein, and heavily outnumbered the more reasonable critiques.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-14T14:22:00+00:00"
}