{
  "url": "https://voxday.net/2003/12/29/on-radio-22/",
  "scraped_at": "2025-12-13T15:40:38.841399",
  "title": "On the radio",
  "date_display": "December 29, 2003",
  "date_iso": "2003-12-29T20:30:00+00:00",
  "date_from_url": "2003-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://kmc.crosswalk.com\">Kevin McCullough</a> invited me to talk with him about Tolkien on his radio show this afternoon.  It was fun, although radio is an annoyingly short-term medium that prevents one from going into any reasonable detail.  He did ask me one tough question, though: who is the hero of <em>The Lord of the Rings</em>.  I went with Frodo, although I think you can make a reasonable case for Aragorn.  I tend to agree with those who think Peter Jackson went just a little overboard with the noble Sam.</p><p>One aspect that I find interesting is that Tolkien creates three, not one, Christ-figures.  Frodo is the Lamb, who must shoulder the burden.  Gandalf is the Savior Risen.  And Aragorn, of course, is the King Returning back to claim his throne.  The trilogy may have been accidental, but I don’t think this three-in-one is, do you?</p><p>I would have mentioned that, but we ran out of time.  Sorry, Kevin.  Maybe we can talk about CS Lewis next time?</p></div>",
  "content_text": "Kevin McCullough\ninvited me to talk with him about Tolkien on his radio show this afternoon.  It was fun, although radio is an annoyingly short-term medium that prevents one from going into any reasonable detail.  He did ask me one tough question, though: who is the hero of\nThe Lord of the Rings\n.  I went with Frodo, although I think you can make a reasonable case for Aragorn.  I tend to agree with those who think Peter Jackson went just a little overboard with the noble Sam.\nOne aspect that I find interesting is that Tolkien creates three, not one, Christ-figures.  Frodo is the Lamb, who must shoulder the burden.  Gandalf is the Savior Risen.  And Aragorn, of course, is the King Returning back to claim his throne.  The trilogy may have been accidental, but I don’t think this three-in-one is, do you?\nI would have mentioned that, but we ran out of time.  Sorry, Kevin.  Maybe we can talk about CS Lewis next time?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-29T20:30:00+00:00"
}