{
  "url": "https://voxday.net/2003/12/08/opening-window/",
  "scraped_at": "2025-12-13T15:37:47.738032",
  "title": "Opening the window",
  "date_display": "December 8, 2003",
  "date_iso": "2003-12-08T15:44:00+00:00",
  "date_from_url": "2003-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lisa writes: <em>Ok, so I am not highly motivated about private viewing of naked ladies.  I am concerned about Microsoft.  I have gone through the hate, seething, loathing, gosh it’s like getting away from a bad boyfriend.  In this cycle, I really have had to look at why I was having these shifting feelings.  In the end, I decided the reason is that I fear Microsoft.  But, I am stuck, I do not know how to install or use any of the open source systems.  I just upgraded my machine, and though a fantastic machine, it probably is not compatable with open source materials and won’t be for a year (or five, about how long it took my last new computer to become compliant) or more.</em></p><p>So, through my doubt, because I fear Microsoft (corpo-socialism, ack!! but true), I will ask you what you suggest as far as becoming a free-tech.  How do I start, what would be useful reading, what is legitimately feasable for a tech-twit to get in the way of software to at least begin looking at this stuff?  If you state something, I hope you have ideas about doing something about it?!? </p><p>You have to walk before you can run, and only about 10 percent of the computer-using community is really ready to seriously go for broke and ride the tank right now.  But it’s easy to take the first steps, which consist of getting losing Explorer, Office and Outlook/Outlook Express.  Explorer is the easiest and you have lots of options.  I would start with downloading <a href=\"http://www.opera.com\">Opera</a> and giving it a whirl.  The ability to turn pop-up blocking on and off at will is really nice.  There are other options too, including Mozilla and Mozilla Firebird.</p><p>The second step, and probably the most important with regards to getting comfortable with the concept of Open Source software, is making the move to OpenOffice 1.1.  You can <a href=\"http://www.openoffice.org\">download this for Windows</a> – or buy the CDs – and get the functional equivalents of Word, Excel, Powerpoint etc.  They aren’t perfectly identical, but are similar enough that you won’t have any problem operating things.  Nor will you have to change your files.  I use .sxw (Writer format) files for my new stuff, but my current novel is still in the very same .doc file I was using with Word.</p><p>Email can be a little more problematic, since conversions can be a pain and Hotmail requires the use of poppers that require a bit of technical fiddling, but there are many, many options here.  Eudora is probably the most popular, although both Opera and Mozilla have email components which will serve as an integrated suite ala Explorer/Outlook express.  And then, of course, there’s the big leap to Linux, which encompasses all of these steps and then more.</p><p>But there’s no need to make the migration all at once.  Take one step at a time, try each application out, and move on from there.  It’s worth it, and if you value freedom, I think it’s worth investing the time and effort involved.  The Trusted Computing threat is real; this is neither paranoia nor media hype, but the considered opinion of many informed people in the technical field.  It is Palladium and the TCG, more than anything, that has turned me from a Microsoft user and fan to an outspoken opponent.</p></div>",
  "content_text": "Lisa writes:\nOk, so I am not highly motivated about private viewing of naked ladies.  I am concerned about Microsoft.  I have gone through the hate, seething, loathing, gosh it’s like getting away from a bad boyfriend.  In this cycle, I really have had to look at why I was having these shifting feelings.  In the end, I decided the reason is that I fear Microsoft.  But, I am stuck, I do not know how to install or use any of the open source systems.  I just upgraded my machine, and though a fantastic machine, it probably is not compatable with open source materials and won’t be for a year (or five, about how long it took my last new computer to become compliant) or more.\nSo, through my doubt, because I fear Microsoft (corpo-socialism, ack!! but true), I will ask you what you suggest as far as becoming a free-tech.  How do I start, what would be useful reading, what is legitimately feasable for a tech-twit to get in the way of software to at least begin looking at this stuff?  If you state something, I hope you have ideas about doing something about it?!?\nYou have to walk before you can run, and only about 10 percent of the computer-using community is really ready to seriously go for broke and ride the tank right now.  But it’s easy to take the first steps, which consist of getting losing Explorer, Office and Outlook/Outlook Express.  Explorer is the easiest and you have lots of options.  I would start with downloading\nOpera\nand giving it a whirl.  The ability to turn pop-up blocking on and off at will is really nice.  There are other options too, including Mozilla and Mozilla Firebird.\nThe second step, and probably the most important with regards to getting comfortable with the concept of Open Source software, is making the move to OpenOffice 1.1.  You can\ndownload this for Windows\n– or buy the CDs – and get the functional equivalents of Word, Excel, Powerpoint etc.  They aren’t perfectly identical, but are similar enough that you won’t have any problem operating things.  Nor will you have to change your files.  I use .sxw (Writer format) files for my new stuff, but my current novel is still in the very same .doc file I was using with Word.\nEmail can be a little more problematic, since conversions can be a pain and Hotmail requires the use of poppers that require a bit of technical fiddling, but there are many, many options here.  Eudora is probably the most popular, although both Opera and Mozilla have email components which will serve as an integrated suite ala Explorer/Outlook express.  And then, of course, there’s the big leap to Linux, which encompasses all of these steps and then more.\nBut there’s no need to make the migration all at once.  Take one step at a time, try each application out, and move on from there.  It’s worth it, and if you value freedom, I think it’s worth investing the time and effort involved.  The Trusted Computing threat is real; this is neither paranoia nor media hype, but the considered opinion of many informed people in the technical field.  It is Palladium and the TCG, more than anything, that has turned me from a Microsoft user and fan to an outspoken opponent.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-08T15:44:00+00:00"
}