{
  "url": "https://voxday.net/2003/12/30/poorly-educated-easily-led/",
  "scraped_at": "2025-12-13T15:40:46.170473",
  "title": "Poorly educated, easily led",
  "date_display": "December 30, 2003",
  "date_iso": "2003-12-30T18:11:00+00:00",
  "date_from_url": "2003-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PhD Mom writes: <em> I had to laugh when I read the email from someone who couldn’t imagine what a “leftist” education would be.  Although I have since recovered, in my elementary, secondary, and most of my college educations, I was the victim of just such a scheme.</em></p><p>For example, in my junior high years, I was taught that the Palestinians were right and Zionism was racism.  I was taught that abortion is a right, and “anti-choice” extremists were not only disagreeable, but both stupid and cruel.  I was taught that animals are more important than people.  In my math class, we once figured the cost of raising a child as opposed to the cost of having an abortion.  Every year, when we had debates and individual presentations, the issues of gun control, abortion, prayer in schools, and Palestine were always among the most popular.  There was no question which side of the argument would garner the better grade.</p><p>In college, I was trained in Marxism, Maoism, and feminism.  I was taught a class on sexism, racism, classism and heterosexism in American life by an avowed Wiccan who wore a pentagram around her neck in class.  I was taught political economy by a professor who carried a copy of Das Kapital everywhere he went and called it his “Bible.”  (Of course, none of my instructors would ever have carried a REAL Bible.)</p><p>At long last, God chased me down and changed my mind.  I became a Christian just before beginning my PhD dissertation, after many years as a teacher’s pet feminist secularist.  Things…changed. My professors were terribly disappointed and lost all respect for me (though eventually they did pass my dissertation which was promptly academically published, despite treating pro-life activists as a legitimate political faction instead of a disease in the body politic).</p><p>On the way, however, there was no end to the insults to which I was subjected.  For example, I asked my major professor for a letter of reference to apply to teach at a Christian college.  He agreed, but told me I shouldn’t need it.  “A place like that,” he said, “isn’t looking for excellence.”  Really?  Suppose I had received the same reply when asking for a reference for a historically black university?  Would I have had grounds to sue?  You betcha–and this professor would have been the first to say so.  But in the rareified air of the academy, only one kind of prejudice doesn’t have an odor to it.</p><p>At any rate, I hope now your correspondent understands what a “leftist” education is.  It is not a “fair and balanced” (you’ll excuse the expression) view, egalitarianism, or a grounding in justice and equality.  It is a form of elitist brianwashing that beats down those who are subject to it, presses its case at every opportunity, and demands adherence to communist catechism in even the smallest of things.  And, in the absence of radical internal change, the victim nearly always emerges in the form required for the Democratic party to succeed. </p><p>Another poorly-educated, easily-led Christian.  And a mother, no less!  I wonder how she manages to survive the sexist oppression of her home life.  The poor thing.</p></div>",
  "content_text": "PhD Mom writes:\nI had to laugh when I read the email from someone who couldn’t imagine what a “leftist” education would be.  Although I have since recovered, in my elementary, secondary, and most of my college educations, I was the victim of just such a scheme.\nFor example, in my junior high years, I was taught that the Palestinians were right and Zionism was racism.  I was taught that abortion is a right, and “anti-choice” extremists were not only disagreeable, but both stupid and cruel.  I was taught that animals are more important than people.  In my math class, we once figured the cost of raising a child as opposed to the cost of having an abortion.  Every year, when we had debates and individual presentations, the issues of gun control, abortion, prayer in schools, and Palestine were always among the most popular.  There was no question which side of the argument would garner the better grade.\nIn college, I was trained in Marxism, Maoism, and feminism.  I was taught a class on sexism, racism, classism and heterosexism in American life by an avowed Wiccan who wore a pentagram around her neck in class.  I was taught political economy by a professor who carried a copy of Das Kapital everywhere he went and called it his “Bible.”  (Of course, none of my instructors would ever have carried a REAL Bible.)\nAt long last, God chased me down and changed my mind.  I became a Christian just before beginning my PhD dissertation, after many years as a teacher’s pet feminist secularist.  Things…changed. My professors were terribly disappointed and lost all respect for me (though eventually they did pass my dissertation which was promptly academically published, despite treating pro-life activists as a legitimate political faction instead of a disease in the body politic).\nOn the way, however, there was no end to the insults to which I was subjected.  For example, I asked my major professor for a letter of reference to apply to teach at a Christian college.  He agreed, but told me I shouldn’t need it.  “A place like that,” he said, “isn’t looking for excellence.”  Really?  Suppose I had received the same reply when asking for a reference for a historically black university?  Would I have had grounds to sue?  You betcha–and this professor would have been the first to say so.  But in the rareified air of the academy, only one kind of prejudice doesn’t have an odor to it.\nAt any rate, I hope now your correspondent understands what a “leftist” education is.  It is not a “fair and balanced” (you’ll excuse the expression) view, egalitarianism, or a grounding in justice and equality.  It is a form of elitist brianwashing that beats down those who are subject to it, presses its case at every opportunity, and demands adherence to communist catechism in even the smallest of things.  And, in the absence of radical internal change, the victim nearly always emerges in the form required for the Democratic party to succeed.\nAnother poorly-educated, easily-led Christian.  And a mother, no less!  I wonder how she manages to survive the sexist oppression of her home life.  The poor thing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-30T18:11:00+00:00"
}