{
  "url": "https://voxday.net/2003/12/02/post-parodic-university/",
  "scraped_at": "2025-12-13T15:36:54.536619",
  "title": "The post-parodic university",
  "date_display": "December 2, 2003",
  "date_iso": "2003-12-02T14:19:00+00:00",
  "date_from_url": "2003-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From <a href=\"http://www.nationalreview.com/nr_comment/steorts200312020838.asp\">Jason Steorts</a> at National Review: <em>Among the more colorful figures hawking their wares at American universities is self-styled “ecofeminist” Carol J. Adams, known principally for her 1999 book The Sexual Politics of Meat: A Feminist-Vegetarian Critical Theory. Adams traverses the campus speaking circuit and presents a slideshow that, according to her website, addresses “the animalizing of women in contemporary cultural images and the sexualizing of animals used for food.”</em></p><p>Yes, this is the sort of intellectual that university officials like to bring in to speak to students.  The woman actually makes her living by talking about the sexual politics of meat.  Forget postmodern, this is post-parody.  I wonder if she’s ever been to the University of Tennessee?</p></div>",
  "content_text": "From\nJason Steorts\nat National Review:\nAmong the more colorful figures hawking their wares at American universities is self-styled “ecofeminist” Carol J. Adams, known principally for her 1999 book The Sexual Politics of Meat: A Feminist-Vegetarian Critical Theory. Adams traverses the campus speaking circuit and presents a slideshow that, according to her website, addresses “the animalizing of women in contemporary cultural images and the sexualizing of animals used for food.”\nYes, this is the sort of intellectual that university officials like to bring in to speak to students.  The woman actually makes her living by talking about the sexual politics of meat.  Forget postmodern, this is post-parody.  I wonder if she’s ever been to the University of Tennessee?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-02T14:19:00+00:00"
}