{
  "url": "https://voxday.net/2003/12/20/random-slides-in-impress/",
  "scraped_at": "2025-12-13T15:39:14.488454",
  "title": "Random slides in Impress",
  "date_display": "December 20, 2003",
  "date_iso": "2003-12-20T20:59:00+00:00",
  "date_from_url": "2003-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AG writes: <em>Hey, I’m trying to use OpenOffice to make the alphabet and phonics slides like you suggest.  Actually, it’s something that I have been wanting to do for a long time but have been spurred on by your article.  Also, the fact that I was reading at age 3, and my daughter will soon be 4 and is not reading yet…well, this shames me into finally working with her more diligently and with more purpose.  I also have a two year old son that I can start with, and another infant daughter that can be taught before too long. Anyway, are you aware of a way to randomize an OpenOffice presentation?  Being such a proponent of open source, I would hope that you could provide a link to such a method.</em></p><p>I’m working on learning about this now, but unfortunately the list of OO macros did not include an Impress random slideshow.  If anyone knows about one, let me know.  In the meantime, I’ve been cheating – one of my old machines is booted to Windows specifically to use Powerpoint with the random macro added.  But I’ll get there with OO Impress, it just might take a little work first.  To be honest, it hasn’t been a real priority.</p></div>",
  "content_text": "AG writes:\nHey, I’m trying to use OpenOffice to make the alphabet and phonics slides like you suggest.  Actually, it’s something that I have been wanting to do for a long time but have been spurred on by your article.  Also, the fact that I was reading at age 3, and my daughter will soon be 4 and is not reading yet…well, this shames me into finally working with her more diligently and with more purpose.  I also have a two year old son that I can start with, and another infant daughter that can be taught before too long. Anyway, are you aware of a way to randomize an OpenOffice presentation?  Being such a proponent of open source, I would hope that you could provide a link to such a method.\nI’m working on learning about this now, but unfortunately the list of OO macros did not include an Impress random slideshow.  If anyone knows about one, let me know.  In the meantime, I’ve been cheating – one of my old machines is booted to Windows specifically to use Powerpoint with the random macro added.  But I’ll get there with OO Impress, it just might take a little work first.  To be honest, it hasn’t been a real priority.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-20T20:59:00+00:00"
}