{
  "url": "https://voxday.net/2003/12/15/reading-resources/",
  "scraped_at": "2025-12-13T15:38:39.868145",
  "title": "Reading Resources",
  "date_display": "December 15, 2003",
  "date_iso": "2003-12-15T08:16:00+00:00",
  "date_from_url": "2003-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.bobbooks.com/\">Bob Books</a> are some great first books for a kid learning to read.  By the time he’s done with set C1, he’s ready for real books in small doses.  They run $15 per set, $75 for all five.</p><p>OpenOffice Impress is part of the free OpenOffice software suite.  You can <a href=\"http://download.openoffice.org/1.1.0/\">download it for Windows, Linux or Macintosh</a>, along with Writer (Word), and Calc (Excel).  It will run and save normal Powerpoint .ppt files.</p><p>If you prefer to stick with Microsoft and either have PowerPoint at work or a friend on whose system you can create the slideshows, <a href=\"http://www.microsoft.com/office/ork/xp/appndx/appa13.htm\">Powerpoint Viewer</a> will allow you to run them.  If you do have Powerpoint, it’s a lot easier learning how to add <a href=\"http://www.rdpslides.com/pptfaq/FAQ00429.htm\">this macro to randomize a slideshow</a> instead of doing it by hand every time.</p><p>It’s easier to teach phonics, of course, when you have a <a href=\"http://www.orange.ne.jp/~corindb/5phonics.shtml\">comprehensive list of English phonics</a>.</p></div>",
  "content_text": "Bob Books\nare some great first books for a kid learning to read.  By the time he’s done with set C1, he’s ready for real books in small doses.  They run $15 per set, $75 for all five.\nOpenOffice Impress is part of the free OpenOffice software suite.  You can\ndownload it for Windows, Linux or Macintosh\n, along with Writer (Word), and Calc (Excel).  It will run and save normal Powerpoint .ppt files.\nIf you prefer to stick with Microsoft and either have PowerPoint at work or a friend on whose system you can create the slideshows,\nPowerpoint Viewer\nwill allow you to run them.  If you do have Powerpoint, it’s a lot easier learning how to add\nthis macro to randomize a slideshow\ninstead of doing it by hand every time.\nIt’s easier to teach phonics, of course, when you have a\ncomprehensive list of English phonics\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-15T08:16:00+00:00"
}