{
  "url": "https://voxday.net/2003/12/28/religion-and-war-2/",
  "scraped_at": "2025-12-13T15:40:20.994327",
  "title": "Religion and War",
  "date_display": "December 28, 2003",
  "date_iso": "2003-12-28T11:20:00+00:00",
  "date_from_url": "2003-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Star Tribune reports: <em>Most Minnesotans say religion plays a role in causing war, and most also think that certain religions are more likely than others to encourage violence among their believers.</em></p><p>The latter is certainly true, the former is absurd.  This sort of ignorance, bordering on complete idiocy, really annoys me.  I am a bit of an armchair military historian – I’ve had a strong interest in wargames since I was young – and for some time, I have been contemplating an exhaustive compilation of all the recorded wars of history and determining if their root cause had much, if anything, to do with any religion in general and Christianity in particular.  My historical instincts lead me to estimate that 15 percent of all wars have a partial or primary religious component – albeit only 5 percent if Islam is excluded.</p><p>An initial look at the Wikipedia list of wars seems to indicate that this estimate is a reasonable one.  The <a href=\"http://en.wikipedia.org/wiki/List_of_wars\">list of 126 wars</a> is by no means comprehensive, but includes all of the major wars of the post-Renaissance, including many that most people have never heard of.  Everyone knows of the Crusades, but few realize that Russia fought seven distinct border wars with Turkey, not including the Crimean War, only one of which was nominally religious.  This list is heavily oriented towards the modern era and Europe in particular, so it is quite likely that the percentage of wars involving religion is unusually high since wars of the ancients and in the Far East were usually fought between co-religionists or were simple wars of conquest.</p><p>In any event, of the 126 wars, only 14 can be reasonably laid at the feet of religion.  That is 11 percent – meaning that 89 percent of history’s wars have little or nothing to do with religion.  This calculation includes counting all four Arab-Israeli wars separately and splitting the difference in the two wars of Chechen independence as well as the two wars of the ongoing War on Terror.  There is a reason that the Thirty Years’ War – a vicious, but fairly minor war in terms of historical significance – is often cited when religion is blamed for war, there simply aren’t very many wars that centered around religion as a cause.</p><p>Note that the medieval period is sadly underrepresented – not a single war between the war-torn Italian city-states is listed – as are the Middle and Far Easts.  This list would lead one to think that Japan was a peaceable land until the Sino-Japanese war of 1894, while anyone familiar with Japanese history and the culture of bushido knows that nothing could be further from the truth.  Balancing this is the fact that the religion-based wars of Islamic expansion are also left out – but then, so are the irreligious wars of the Mongols, Huns, Assyrians, Babylonians and Egyptians.</p><p>Of course, some will probably argue that the fact that people harbor religious beliefs allows the various kings, emperors and governments whose hunger for fame, wealth and power to more easily manipulate their people into war.  But this is semantical nonsense, one might as easily say that having a good harvest “plays a role in causing war” with equal accuracy.  Furthermore, the scant history of irreligious states such as the Soviet Union and the People’s Republic of China is no more peaceful than the historical norm.  Throughout most of history, people have had no choice about fighting the wars imposed upon them by their leaders.  And, in any case, that’s not what the Star Tribune article is implying, nor it what most people are saying when they blame religion for the human failing that is war.</p></div>",
  "content_text": "The Star Tribune reports:\nMost Minnesotans say religion plays a role in causing war, and most also think that certain religions are more likely than others to encourage violence among their believers.\nThe latter is certainly true, the former is absurd.  This sort of ignorance, bordering on complete idiocy, really annoys me.  I am a bit of an armchair military historian – I’ve had a strong interest in wargames since I was young – and for some time, I have been contemplating an exhaustive compilation of all the recorded wars of history and determining if their root cause had much, if anything, to do with any religion in general and Christianity in particular.  My historical instincts lead me to estimate that 15 percent of all wars have a partial or primary religious component – albeit only 5 percent if Islam is excluded.\nAn initial look at the Wikipedia list of wars seems to indicate that this estimate is a reasonable one.  The\nlist of 126 wars\nis by no means comprehensive, but includes all of the major wars of the post-Renaissance, including many that most people have never heard of.  Everyone knows of the Crusades, but few realize that Russia fought seven distinct border wars with Turkey, not including the Crimean War, only one of which was nominally religious.  This list is heavily oriented towards the modern era and Europe in particular, so it is quite likely that the percentage of wars involving religion is unusually high since wars of the ancients and in the Far East were usually fought between co-religionists or were simple wars of conquest.\nIn any event, of the 126 wars, only 14 can be reasonably laid at the feet of religion.  That is 11 percent – meaning that 89 percent of history’s wars have little or nothing to do with religion.  This calculation includes counting all four Arab-Israeli wars separately and splitting the difference in the two wars of Chechen independence as well as the two wars of the ongoing War on Terror.  There is a reason that the Thirty Years’ War – a vicious, but fairly minor war in terms of historical significance – is often cited when religion is blamed for war, there simply aren’t very many wars that centered around religion as a cause.\nNote that the medieval period is sadly underrepresented – not a single war between the war-torn Italian city-states is listed – as are the Middle and Far Easts.  This list would lead one to think that Japan was a peaceable land until the Sino-Japanese war of 1894, while anyone familiar with Japanese history and the culture of bushido knows that nothing could be further from the truth.  Balancing this is the fact that the religion-based wars of Islamic expansion are also left out – but then, so are the irreligious wars of the Mongols, Huns, Assyrians, Babylonians and Egyptians.\nOf course, some will probably argue that the fact that people harbor religious beliefs allows the various kings, emperors and governments whose hunger for fame, wealth and power to more easily manipulate their people into war.  But this is semantical nonsense, one might as easily say that having a good harvest “plays a role in causing war” with equal accuracy.  Furthermore, the scant history of irreligious states such as the Soviet Union and the People’s Republic of China is no more peaceful than the historical norm.  Throughout most of history, people have had no choice about fighting the wars imposed upon them by their leaders.  And, in any case, that’s not what the Star Tribune article is implying, nor it what most people are saying when they blame religion for the human failing that is war.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-28T11:20:00+00:00"
}