{
  "url": "https://voxday.net/2003/12/24/secession-and-slavery/",
  "scraped_at": "2025-12-13T15:39:51.134314",
  "title": "Secession and slavery",
  "date_display": "December 24, 2003",
  "date_iso": "2003-12-24T09:02:00+00:00",
  "date_from_url": "2003-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Walter Williams <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=36294\">raises some excellent points</a> about the Constitutionality of secession, and the unlikelihood that such exercising such a right would be permitted.  I only wonder what the Federal excuse for an invasion would be.  I expect that all of those who still believe that the Civil War was primarily about slavery – all the repeated declarations about preserving the Union to the contrary notwithstanding – would probably swallow whatever nonsense was given out as the official reason.</p><p>Why is it that the right to self-determination is something worth fighting for in foreign lands, and something that must be fought against in our own?  If slavery trumps a right to self-determination, why are we not invading the Sudan right now, not to mention Eastern Europe?  I often wonder if those who mindlessly repeat what little they remember of fifth-grade history ever stop to think about the logical implications of what they are saying.</p><p>Abraham Lincoln said the Civil War was not about slavery.  Jefferson Davis said the Second (failed) American Revolution was not about slavery.  Robert E. Lee didn’t even own slaves – what on Earth was he fighting so brilliantly for?  If the principles on both sides of the Civil War didn’t believe it had anything to do with slavery, why do you?  And if secession was treason, why was no Confederate ever tried for it, much less found guilty?  Perhaps a second war of States Rights will one day convince the doubters.</p><p>I am, like most Americans, opposed to slavery.  But I do not believe in throwing out the Constitution and using the evil of totalitarian oppression to end other evils.  If there is an evil worth fighting a war to stop, it is the Holocaust of the Innocent.  By the slavery theorist’s logic, we should impose a Federal ban on abortion, then invade any states that refuse to honor the ban.  If the slavery theory is correct and the Civil War was right, then there is no reason why we should not resort to the same extreme measures to end what is surely a far worse evil.</p></div>",
  "content_text": "Walter Williams\nraises some excellent points\nabout the Constitutionality of secession, and the unlikelihood that such exercising such a right would be permitted.  I only wonder what the Federal excuse for an invasion would be.  I expect that all of those who still believe that the Civil War was primarily about slavery – all the repeated declarations about preserving the Union to the contrary notwithstanding – would probably swallow whatever nonsense was given out as the official reason.\nWhy is it that the right to self-determination is something worth fighting for in foreign lands, and something that must be fought against in our own?  If slavery trumps a right to self-determination, why are we not invading the Sudan right now, not to mention Eastern Europe?  I often wonder if those who mindlessly repeat what little they remember of fifth-grade history ever stop to think about the logical implications of what they are saying.\nAbraham Lincoln said the Civil War was not about slavery.  Jefferson Davis said the Second (failed) American Revolution was not about slavery.  Robert E. Lee didn’t even own slaves – what on Earth was he fighting so brilliantly for?  If the principles on both sides of the Civil War didn’t believe it had anything to do with slavery, why do you?  And if secession was treason, why was no Confederate ever tried for it, much less found guilty?  Perhaps a second war of States Rights will one day convince the doubters.\nI am, like most Americans, opposed to slavery.  But I do not believe in throwing out the Constitution and using the evil of totalitarian oppression to end other evils.  If there is an evil worth fighting a war to stop, it is the Holocaust of the Innocent.  By the slavery theorist’s logic, we should impose a Federal ban on abortion, then invade any states that refuse to honor the ban.  If the slavery theory is correct and the Civil War was right, then there is no reason why we should not resort to the same extreme measures to end what is surely a far worse evil.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-24T09:02:00+00:00"
}