{
  "url": "https://voxday.net/2003/12/31/so-not-surprised-2/",
  "scraped_at": "2025-12-13T15:40:49.851874",
  "title": "So not surprised",
  "date_display": "December 31, 2003",
  "date_iso": "2003-12-31T08:07:00+00:00",
  "date_from_url": "2003-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>California’s parks department, staggered by the state’s budget problems and trying to avoid closing dozens of parks, announced Tuesday it will raise entrance and camping fees to their <a href=\"http://www.mercurynews.com/mld/mercurynews/news/local/7603208.htm\">highest levels in history</a>.  Some fees will more than double at California’s 277 state parks, which range from redwood forests to “Baywatch” beaches, desert ghost towns to mountain ranges, and battlefields to Lake Tahoe shoreline sites.  Getting into Hearst Castle, for example, will jump from $12 to $25.</em></p><p>I warned about this.  When you vote for a pragmatic Republican, you not only get tax increases, you usually get tax increases that are worse than anything the Democrats can put together.  This is the first step – Arnold will soon go back on his pledge not to raise taxes, because “the situation is worse than he realized it was before he took office.”  Isn’t it always.</p><p>The spending half of the equation won’t be significantly addressed because that’s harder.  So, Schwarzenegger will be saluted in the press for his “courage” and California Republicans will finally begin to realize that they screwed themselves badly in electing a pragmatic man without any commitment to small government principles.</p><p>In truth, he’s already violated his pledge.  Fees are taxes, they’re just slightly more optional.</p></div>",
  "content_text": "California’s parks department, staggered by the state’s budget problems and trying to avoid closing dozens of parks, announced Tuesday it will raise entrance and camping fees to their\nhighest levels in history\n.  Some fees will more than double at California’s 277 state parks, which range from redwood forests to “Baywatch” beaches, desert ghost towns to mountain ranges, and battlefields to Lake Tahoe shoreline sites.  Getting into Hearst Castle, for example, will jump from $12 to $25.\nI warned about this.  When you vote for a pragmatic Republican, you not only get tax increases, you usually get tax increases that are worse than anything the Democrats can put together.  This is the first step – Arnold will soon go back on his pledge not to raise taxes, because “the situation is worse than he realized it was before he took office.”  Isn’t it always.\nThe spending half of the equation won’t be significantly addressed because that’s harder.  So, Schwarzenegger will be saluted in the press for his “courage” and California Republicans will finally begin to realize that they screwed themselves badly in electing a pragmatic man without any commitment to small government principles.\nIn truth, he’s already violated his pledge.  Fees are taxes, they’re just slightly more optional.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-31T08:07:00+00:00"
}