{
  "url": "https://voxday.net/2003/12/10/speaking-of-gravitas/",
  "scraped_at": "2025-12-13T15:38:03.533015",
  "title": "Speaking of gravitas",
  "date_display": "December 10, 2003",
  "date_iso": "2003-12-10T09:55:00+00:00",
  "date_from_url": "2003-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I imagine that last post should have erased whatever remnants of it were left to me.  Which is fine, since I wasn’t expecting to be named to the Roman Senate anyhow.  I never seriously considered stopping the blog, although the point HL made was not frivolous and I think that it is always worthwhile to step back from time to time and ask yourself why you’re doing something.  I don’t know if the vast majority of WND readers are unaware of the blog or are simply uninterested in it, but it’s true that only a very small percentage of the Monday readers make it over here on a daily basis.  It will also be interesting to see if the column’s kickoff in the Dallas Morning News and the UT Daily Beacon next month will follow this pattern, although I won’t have very good information on how many people are reading it there.</p><p>In case anyone’s interested, of all the weekly or twice-weekly columnists, I tend to run number three on WND over the course of the week.  I can’t divulge the actual numbers – that’s WND business, not mine – but it should surprise no one to learn that Ann Coulter is blonde head-and-shoulders above the rest of us.  Mr. Patrick J. Buchanan and I trade off running a distant second, although Pat usually has the advantage as he hits more home runs, so to speak, than I do.  I’ve learned that technology columns like yesterday’s tend to run below average, while the perfect storm would be writing about Rush Limbaugh accusing Hillary Clinton of being a gay Nazi feminist while on a college campus.</p><p>Still, as much as I appreciate people reading the column and the blog, I’m really not interested in chasing readership.  That way lies boredom and burnout, so I hope you’ll just keep in mind that for every boring treatise on operating systems or economics arcana, there will surely be a scathing piece on the vagaries and idiocies of the Left following soon.  Variety is the spice of life, for the writer as well as the reader.  I don’t usually publish fan mail here – let’s face it, it’s a lot more fun responding to hate mail – but some of the things people wrote about the blog were interesting.</p><p>TO writes: <em>I’m more interested in reading your blog then I am in reading your column though I do venture over to your columns once in a while. Your blogs are a lot more thought provoking because it’s more like a running conversation I get to listen into.</em></p><p>TS writes: <em>I appreciate the writer whose views of you change when he gets a chance to see your less polished work, but I believe that’s actually a good thing.  Getting a fuller picture of your views and stances on myriad subjects allows people to read your stuff with more understanding.  For instance, if the guy that railed at you about the suicide column knew you better, he would have recognized the angst and the loss that dominated that column rather than getting lost in the Christian portion of it. </em></p><p>JS writes: <em>I enjoy your writings not just because you so eloquently defend positions I agree with, but because in some cases you’ve also challenged me and have changed my mind on some things.  I’ve always had some sympathy for libertarian positions, but maybe I’ll officially join the club soon.  The Republicans aren’t doing much to keep me.</em></p><p>JU writes: <em>About six months ago, I was delighted to discover your column.  As a twenty-three year old catholic libertarian I enjoyed your, in my experience unique,ability to stylishly expound alternately on liberty, God, and Wing Commander tremendously.  Your written words resonated in erie, sympathetic harmony with my own thoughts, views, and values to a degree far beyond that of any commentator I had ever come across.  By the end of that first day I had devoured the entirety of your World-Net-Daily archive, and it thereafter became a weekly ritual for me to enjoy your column first thing each Monday morning.  However, as much of a treat as it was for me to discover your column, the discovery, about one month ago of your weblog, was if anything more delightful by an order of magnitude.</em></p><p>DB writes: <em>KEEP THE BLOG!!!! When I get up with my morning cup of brew, do I sit down to catch up on things by first heading to fox news? Heading to cnn??? EEK! Heading to MSNBC??? EEK! Do I grab the remote control and turn on the TV for the Today Show??? NEVER! What do I do???? I sit right down in front of my lap top and head over to VOX POPOLI of course!!!!! I love the blog and I don’t think it takes anything away from the weekly column in World Net Daily. I think if anything the blog reinforces the column. I’ve written you before telling of how I’m working on an M.D. and consider myself a pretty bright guy! With the blog, I can feel like a total idiot every day of the week instead of just on Monday!!</em></p><p>And more in that vein….  By the way, don’t be so hard on HR.  In the same email, he also wrote: <em>Let me state the obvious. You’re the writing expert here. I’m just a guy who owns a software company and enjoys reading what you write. Of course you’ll do what you think is best, and you’ll probably be right.  No offense meant. I really do hope you stick around.</em></p><p>I certainly took no offense.  HR was just pointing out that if I wanted to be a serious journalist, I should probably rethink the blog.  But I’m not a journalist, much less a serious one, I’m simply a writer expressing my views, take them or leave them.  If they can’t stand on their own, then they’re worthless anyhow.  In any case, if we couldn’t question ourselves, we wouldn’t be libertarians and conservatives.  We’d be ur-Stalinist hive-minders like the Democratic Left.<br/></p></div>",
  "content_text": "I imagine that last post should have erased whatever remnants of it were left to me.  Which is fine, since I wasn’t expecting to be named to the Roman Senate anyhow.  I never seriously considered stopping the blog, although the point HL made was not frivolous and I think that it is always worthwhile to step back from time to time and ask yourself why you’re doing something.  I don’t know if the vast majority of WND readers are unaware of the blog or are simply uninterested in it, but it’s true that only a very small percentage of the Monday readers make it over here on a daily basis.  It will also be interesting to see if the column’s kickoff in the Dallas Morning News and the UT Daily Beacon next month will follow this pattern, although I won’t have very good information on how many people are reading it there.\nIn case anyone’s interested, of all the weekly or twice-weekly columnists, I tend to run number three on WND over the course of the week.  I can’t divulge the actual numbers – that’s WND business, not mine – but it should surprise no one to learn that Ann Coulter is blonde head-and-shoulders above the rest of us.  Mr. Patrick J. Buchanan and I trade off running a distant second, although Pat usually has the advantage as he hits more home runs, so to speak, than I do.  I’ve learned that technology columns like yesterday’s tend to run below average, while the perfect storm would be writing about Rush Limbaugh accusing Hillary Clinton of being a gay Nazi feminist while on a college campus.\nStill, as much as I appreciate people reading the column and the blog, I’m really not interested in chasing readership.  That way lies boredom and burnout, so I hope you’ll just keep in mind that for every boring treatise on operating systems or economics arcana, there will surely be a scathing piece on the vagaries and idiocies of the Left following soon.  Variety is the spice of life, for the writer as well as the reader.  I don’t usually publish fan mail here – let’s face it, it’s a lot more fun responding to hate mail – but some of the things people wrote about the blog were interesting.\nTO writes:\nI’m more interested in reading your blog then I am in reading your column though I do venture over to your columns once in a while. Your blogs are a lot more thought provoking because it’s more like a running conversation I get to listen into.\nTS writes:\nI appreciate the writer whose views of you change when he gets a chance to see your less polished work, but I believe that’s actually a good thing.  Getting a fuller picture of your views and stances on myriad subjects allows people to read your stuff with more understanding.  For instance, if the guy that railed at you about the suicide column knew you better, he would have recognized the angst and the loss that dominated that column rather than getting lost in the Christian portion of it.\nJS writes:\nI enjoy your writings not just because you so eloquently defend positions I agree with, but because in some cases you’ve also challenged me and have changed my mind on some things.  I’ve always had some sympathy for libertarian positions, but maybe I’ll officially join the club soon.  The Republicans aren’t doing much to keep me.\nJU writes:\nAbout six months ago, I was delighted to discover your column.  As a twenty-three year old catholic libertarian I enjoyed your, in my experience unique,ability to stylishly expound alternately on liberty, God, and Wing Commander tremendously.  Your written words resonated in erie, sympathetic harmony with my own thoughts, views, and values to a degree far beyond that of any commentator I had ever come across.  By the end of that first day I had devoured the entirety of your World-Net-Daily archive, and it thereafter became a weekly ritual for me to enjoy your column first thing each Monday morning.  However, as much of a treat as it was for me to discover your column, the discovery, about one month ago of your weblog, was if anything more delightful by an order of magnitude.\nDB writes:\nKEEP THE BLOG!!!! When I get up with my morning cup of brew, do I sit down to catch up on things by first heading to fox news? Heading to cnn??? EEK! Heading to MSNBC??? EEK! Do I grab the remote control and turn on the TV for the Today Show??? NEVER! What do I do???? I sit right down in front of my lap top and head over to VOX POPOLI of course!!!!! I love the blog and I don’t think it takes anything away from the weekly column in World Net Daily. I think if anything the blog reinforces the column. I’ve written you before telling of how I’m working on an M.D. and consider myself a pretty bright guy! With the blog, I can feel like a total idiot every day of the week instead of just on Monday!!\nAnd more in that vein….  By the way, don’t be so hard on HR.  In the same email, he also wrote:\nLet me state the obvious. You’re the writing expert here. I’m just a guy who owns a software company and enjoys reading what you write. Of course you’ll do what you think is best, and you’ll probably be right.  No offense meant. I really do hope you stick around.\nI certainly took no offense.  HR was just pointing out that if I wanted to be a serious journalist, I should probably rethink the blog.  But I’m not a journalist, much less a serious one, I’m simply a writer expressing my views, take them or leave them.  If they can’t stand on their own, then they’re worthless anyhow.  In any case, if we couldn’t question ourselves, we wouldn’t be libertarians and conservatives.  We’d be ur-Stalinist hive-minders like the Democratic Left.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-10T09:55:00+00:00"
}