{
  "url": "https://voxday.net/2003/12/10/speaking-of-speaking/",
  "scraped_at": "2025-12-13T15:38:06.881625",
  "title": "Speaking of speaking",
  "date_display": "December 10, 2003",
  "date_iso": "2003-12-10T17:49:00+00:00",
  "date_from_url": "2003-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I seem to have misplaced an email from someone enquiring about speaking engagments a week or two ago.  I’ve been filled in on the procedure by my syndicate, so if you’re still interested, shoot me an email.</p><p>[Random absurdity about impersonating Ann Coulter on Fox News deleted upon further reflection.  It was funny to me and two of my best friends, but what do they know?  Leave Big Chilly alone for ten minutes, and the next thing you know he’s wearing pink chiffon, rolling around onstage in front of 800 people singing Like A Virgin in a deep bass.  And as for the White Buffalo, let’s just say that anyone who features a poetry reading accompanied by freeform interpretive dance <em>at their own wedding</em> has some seriously questionable judgment.]</p><p>Gravitas: Anywhere But Here</p></div>",
  "content_text": "I seem to have misplaced an email from someone enquiring about speaking engagments a week or two ago.  I’ve been filled in on the procedure by my syndicate, so if you’re still interested, shoot me an email.\n[Random absurdity about impersonating Ann Coulter on Fox News deleted upon further reflection.  It was funny to me and two of my best friends, but what do they know?  Leave Big Chilly alone for ten minutes, and the next thing you know he’s wearing pink chiffon, rolling around onstage in front of 800 people singing Like A Virgin in a deep bass.  And as for the White Buffalo, let’s just say that anyone who features a poetry reading accompanied by freeform interpretive dance\nat their own wedding\nhas some seriously questionable judgment.]\nGravitas: Anywhere But Here",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-10T17:49:00+00:00"
}