{
  "url": "https://voxday.net/2003/12/25/tales-of-white-buffalo/",
  "scraped_at": "2025-12-13T15:40:00.721613",
  "title": "Tales of the White Buffalo",
  "date_display": "December 25, 2003",
  "date_iso": "2003-12-25T13:27:00+00:00",
  "date_from_url": "2003-12-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Julie writes: <em>I can only imagine who the WB picked number 1 to earn his glorious award, but try these two daisies on for size: In a league where receptions are only worth 1/2 a point, the first overall pick this year was: Terrell Owens.  Thusly, the male coach of team Furious Anger has ever since been refered to as Nancy. Ouch. Worse yet, the number  5 overall pick:  Amos Zero…  Zero…   How the heck to you spell that anyway?  Ah well.. you know who I’m talking about.  This is far worse when you consider that Clinton Portis was still on the board.</em></p><p>I’ll bet there are a lot of us out here who’d like to see more WB tales…</p><p>Ask and you shall receive… this is also a belated response to a request from CL regarding campus poetry slams.  First, the WB’s infamous pick was Randall Cunningham in 1999, echoing Dennis Green’s third-worst coaching decision – that is to say: 1) taking the cursed knee; 2) Picking Dimitrius Underwood; 3) Going with Randall over Brad Johnson in 1999.   Still, none of these are as bad as one guy in my brother’s league, who last year picked Kordell “INT” Stewart #1.  You can’t even ride a guy who does something like that, you just have to replace him with someone who actually watches football now and then.</p><p>Anyhow, our senior year of college, I inadvertantly made an enemy of a squidgy little girl in one of my classes, who took great exception to not being able to make inane assertions about the assigned text without being verbally sliced and diced in public.  She complained to my professor, who then requested that I refrain from criticizing anything this poor, intellectually-defenseless female might happen to say in the future.  Since she was the 4.0 apple-of-her-professor’s eye and I had shown up two week’s late for the semester on the very last day that one could show up without being dropped, I could hardly fault the man for his partiality.  So, I agreed to the condition and promptly stopped going to class.  Got an A anyhow, since it mostly was on Plato and I already knew the material, so the whole thing was no big deal in my opinion.</p><p>The White Buffalo, however, disagreed and vowed that Squidgy must be destroyed.  Such is the Way of the White Buffalo.  He learned that Squidgy, being a good campus pseudo-intellectual, took active part in a monthly poetry slam, where everyone wore black mocknecks and inflected execrable verse on one another, invariably to polite applause.  The WB proposed that the three of us – WB, Big Chilly and I – should each compose the worst poems we could possibly write, then read them aloud at the lunchtime poetry slam.  The brilliant clincher, contributed by Big Chilly, was that we would not show each other the poems before reading them aloud to an unsuspecting public.  And so it was agreed, and we drank a solemn toast to confusion upon the foe.</p><p>I composed an abomination that ran thusly:</p><p>I like you<br> <br>You like me<br> <br>I think that’s neat,<br> <br>Like a room that’s just been vacuumed.<br> <br>Vaccuum me.</br></br></br></br></br></br></br></br></p><p>And so on, in like manner.  I should note that this was prior to any of the infamous trio of “sexist pornographers” becoming Christians, and that in this particular crowd, a white male talking about anything that could possibly be interpreted as female submission was tantamount to a chauvinist act of war.  After sitting through a few howlers, including one by the university’s Poet Laureate which began, unforgettably: “Where do the homeless people go when it rains?” Big Chilly was the first to step up to the podium, reading first a short poem about losing his keys, then wowing the crowd with <em>The Eagle and the Lama</em>.  It was hard not to laugh, especially when he dropped the bomb about “swooping down upon the back of that belching beast.”</p><p>I was up next, and I did not dare to meet anyone’s eyes, reading my splendidly awful creation in a tightly compressed voice that the crowd mistook for deep emotion, although the metaphor could hardly be missed by a coma victim.  Their intense interest only made it harder to keep a straight face, especially when the newspaper that Big Chilly was hiding behind began to shake.  But I held it together, even through the applause, and then all eyes were on the White Buffalo, who unleashed the unspeakable act of artistic desecration that is <em>The Heart: A Tautology</em>.   It struck the awed crowd into respectful silence, with lines like “won’t you send up a Space Shuttle Columbia of love to colonize my windswept soul”, “my hopping, sneezing pomegranite” and that unforgettable stanza:</p><p>“Agammemnon, slay my combatants<br> <br>So that the mighty hand of Jocasta,<br> <br>Like a very large lemon drop,<br> <br>Will fall upon my brazen breast.”</br></br></br></br></br></br></p><p>I seriously thought I was going to blow out my spleen or something, but even under this intense provocation, all three of us held it together, as our intent was to leave decorously without alerting the ridiculous would-be artistes that they’d been brutally mocked.  Unfortunately, before we could make our escape, Squidgy took the podium and prefaced her poem with the statement: “Okay, this poem is from the point of view of me – dramatic pause – and a lizard.”  That was too much.  She’d effortlessly managed to top our very worst.  All three of us simultaneously exploded with laughter and fled outside, where we nearly expired from laughing so hard.</p><p>So, the moral of the story is: do not mess with the White Buffalo.  I seem to recall hearing that Squidgy never showed her face in that class again, although I can’t vouch for it because, as I said, I’d already bagged it myself.  Believe it or not, this was not the only time that <em>The Heart: A Tautology</em> appeared in public – it was even published in a real newspaper once –  nor was this our only act of artistic ridicule on campus.  But those are stories for another day.</p></div>",
  "content_text": "Julie writes:\nI can only imagine who the WB picked number 1 to earn his glorious award, but try these two daisies on for size: In a league where receptions are only worth 1/2 a point, the first overall pick this year was: Terrell Owens.  Thusly, the male coach of team Furious Anger has ever since been refered to as Nancy. Ouch. Worse yet, the number  5 overall pick:  Amos Zero…  Zero…   How the heck to you spell that anyway?  Ah well.. you know who I’m talking about.  This is far worse when you consider that Clinton Portis was still on the board.\nI’ll bet there are a lot of us out here who’d like to see more WB tales…\nAsk and you shall receive… this is also a belated response to a request from CL regarding campus poetry slams.  First, the WB’s infamous pick was Randall Cunningham in 1999, echoing Dennis Green’s third-worst coaching decision – that is to say: 1) taking the cursed knee; 2) Picking Dimitrius Underwood; 3) Going with Randall over Brad Johnson in 1999.   Still, none of these are as bad as one guy in my brother’s league, who last year picked Kordell “INT” Stewart #1.  You can’t even ride a guy who does something like that, you just have to replace him with someone who actually watches football now and then.\nAnyhow, our senior year of college, I inadvertantly made an enemy of a squidgy little girl in one of my classes, who took great exception to not being able to make inane assertions about the assigned text without being verbally sliced and diced in public.  She complained to my professor, who then requested that I refrain from criticizing anything this poor, intellectually-defenseless female might happen to say in the future.  Since she was the 4.0 apple-of-her-professor’s eye and I had shown up two week’s late for the semester on the very last day that one could show up without being dropped, I could hardly fault the man for his partiality.  So, I agreed to the condition and promptly stopped going to class.  Got an A anyhow, since it mostly was on Plato and I already knew the material, so the whole thing was no big deal in my opinion.\nThe White Buffalo, however, disagreed and vowed that Squidgy must be destroyed.  Such is the Way of the White Buffalo.  He learned that Squidgy, being a good campus pseudo-intellectual, took active part in a monthly poetry slam, where everyone wore black mocknecks and inflected execrable verse on one another, invariably to polite applause.  The WB proposed that the three of us – WB, Big Chilly and I – should each compose the worst poems we could possibly write, then read them aloud at the lunchtime poetry slam.  The brilliant clincher, contributed by Big Chilly, was that we would not show each other the poems before reading them aloud to an unsuspecting public.  And so it was agreed, and we drank a solemn toast to confusion upon the foe.\nI composed an abomination that ran thusly:\nI like you\nYou like me\nI think that’s neat,\nLike a room that’s just been vacuumed.\nVaccuum me.\nAnd so on, in like manner.  I should note that this was prior to any of the infamous trio of “sexist pornographers” becoming Christians, and that in this particular crowd, a white male talking about anything that could possibly be interpreted as female submission was tantamount to a chauvinist act of war.  After sitting through a few howlers, including one by the university’s Poet Laureate which began, unforgettably: “Where do the homeless people go when it rains?” Big Chilly was the first to step up to the podium, reading first a short poem about losing his keys, then wowing the crowd with\nThe Eagle and the Lama\n.  It was hard not to laugh, especially when he dropped the bomb about “swooping down upon the back of that belching beast.”\nI was up next, and I did not dare to meet anyone’s eyes, reading my splendidly awful creation in a tightly compressed voice that the crowd mistook for deep emotion, although the metaphor could hardly be missed by a coma victim.  Their intense interest only made it harder to keep a straight face, especially when the newspaper that Big Chilly was hiding behind began to shake.  But I held it together, even through the applause, and then all eyes were on the White Buffalo, who unleashed the unspeakable act of artistic desecration that is\nThe Heart: A Tautology\n.   It struck the awed crowd into respectful silence, with lines like “won’t you send up a Space Shuttle Columbia of love to colonize my windswept soul”, “my hopping, sneezing pomegranite” and that unforgettable stanza:\n“Agammemnon, slay my combatants\nSo that the mighty hand of Jocasta,\nLike a very large lemon drop,\nWill fall upon my brazen breast.”\nI seriously thought I was going to blow out my spleen or something, but even under this intense provocation, all three of us held it together, as our intent was to leave decorously without alerting the ridiculous would-be artistes that they’d been brutally mocked.  Unfortunately, before we could make our escape, Squidgy took the podium and prefaced her poem with the statement: “Okay, this poem is from the point of view of me – dramatic pause – and a lizard.”  That was too much.  She’d effortlessly managed to top our very worst.  All three of us simultaneously exploded with laughter and fled outside, where we nearly expired from laughing so hard.\nSo, the moral of the story is: do not mess with the White Buffalo.  I seem to recall hearing that Squidgy never showed her face in that class again, although I can’t vouch for it because, as I said, I’d already bagged it myself.  Believe it or not, this was not the only time that\nThe Heart: A Tautology\nappeared in public – it was even published in a real newspaper once –  nor was this our only act of artistic ridicule on campus.  But those are stories for another day.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-25T13:27:00+00:00"
}