{
  "url": "https://voxday.net/2003/12/11/this-is-defense-of-rational-atheis/",
  "scraped_at": "2025-12-13T15:38:17.883887",
  "title": "This is a defense of rational atheism?",
  "date_display": "December 11, 2003",
  "date_iso": "2003-12-11T22:13:00+00:00",
  "date_from_url": "2003-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And we hear again from Sugar, who is apparently not only ignorant of history, but also irony.  Ladies and gentlemen, once more, the irrational atheist.</p><p><em>Vox Day employs the usual tactic of religious apologists in trying to distract people by attacking atheists for their alleged crimes so people won’t focus on the crimes of religion.  The fact is, Vox, religion is responsible for most of the wars since the founding of Christianity.  (Fascism and Communism are also religions except they worship people on Earth instead of fictitious people in the sky.)  And, yes, scholars have estimated that those good Christians <a href=\"http://www.summerlands.com/crossroads/remembrance/current.htm\">killed about 500,000 people during the witch hunts</a>.</em></p><p>Think how many tens of millions had to die and hundreds of millions had to suffer because of Stalin’s religious education.  Spare me from the dogmatic mind (are you dogmatic, Vox Day or are you a freethinker?)! By the way, Vox, many of the wars the U.S. engaged in has a religious cast, particularly the wars against the Native Americans, the Spanish, the Mexicans and the Germans (World War I only).  American presidents like Bush weren’t the first to realize that religion is a great way to dull the minds of the people, to whip of a war frenzy, and to hold out the mythical promise of an afterlife for those so stupid as to sacrifice their lives (Bush, Cheney, Pearle, and Wolfowicz were too smart to do that during the Vietnam War).</p><p>The Dark Ages, the blood of millions of murdered people (men, women, children) and the destruction of billions of lives is on the bloody hands of your religion, Vox.  I hope you can bear up under the strain (and the flaming pit awaits you for promoting the lie of Christianity).  May you rest in peace!</p></div>",
  "content_text": "And we hear again from Sugar, who is apparently not only ignorant of history, but also irony.  Ladies and gentlemen, once more, the irrational atheist.\nVox Day employs the usual tactic of religious apologists in trying to distract people by attacking atheists for their alleged crimes so people won’t focus on the crimes of religion.  The fact is, Vox, religion is responsible for most of the wars since the founding of Christianity.  (Fascism and Communism are also religions except they worship people on Earth instead of fictitious people in the sky.)  And, yes, scholars have estimated that those good Christians\nkilled about 500,000 people during the witch hunts\n.\nThink how many tens of millions had to die and hundreds of millions had to suffer because of Stalin’s religious education.  Spare me from the dogmatic mind (are you dogmatic, Vox Day or are you a freethinker?)! By the way, Vox, many of the wars the U.S. engaged in has a religious cast, particularly the wars against the Native Americans, the Spanish, the Mexicans and the Germans (World War I only).  American presidents like Bush weren’t the first to realize that religion is a great way to dull the minds of the people, to whip of a war frenzy, and to hold out the mythical promise of an afterlife for those so stupid as to sacrifice their lives (Bush, Cheney, Pearle, and Wolfowicz were too smart to do that during the Vietnam War).\nThe Dark Ages, the blood of millions of murdered people (men, women, children) and the destruction of billions of lives is on the bloody hands of your religion, Vox.  I hope you can bear up under the strain (and the flaming pit awaits you for promoting the lie of Christianity).  May you rest in peace!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-11T22:13:00+00:00"
}