{
  "url": "https://voxday.net/2003/12/08/this-is-lef/",
  "scraped_at": "2025-12-13T15:37:49.219419",
  "title": "This is the Left",
  "date_display": "December 8, 2003",
  "date_iso": "2003-12-08T15:53:00+00:00",
  "date_from_url": "2003-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em><a href=\"http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2003/12/07/wstal07.xml&amp;sSheet=/news/2003/12/07/ixworld.html\">Erika Riemann was 14</a> when she was imprisoned by by the communist regime in East Germany. She had defaced a portrait of Stalin hanging in her school by painting a red bow over his moustache with her mother’s lipstick.  In three East German prisons, including a former Nazi concentration camp, she was repeatedly raped, starved and beaten. Finally she was forced to endure a mock mass extermination in a gas chamber.</em></p><p>I wonder what their ideal punishment is for daring to draw a moustache on Hillary.  Remember this the next time you hear a left-liberal lecturing you about tolerance.  It must drive them berserk that they haven’t been successful in convincing everyone that Stalin is <em>really</em> right-wing, as they were with his more infamous fellow socialist.</p></div>",
  "content_text": "Erika Riemann was 14\nwhen she was imprisoned by by the communist regime in East Germany. She had defaced a portrait of Stalin hanging in her school by painting a red bow over his moustache with her mother’s lipstick.  In three East German prisons, including a former Nazi concentration camp, she was repeatedly raped, starved and beaten. Finally she was forced to endure a mock mass extermination in a gas chamber.\nI wonder what their ideal punishment is for daring to draw a moustache on Hillary.  Remember this the next time you hear a left-liberal lecturing you about tolerance.  It must drive them berserk that they haven’t been successful in convincing everyone that Stalin is\nreally\nright-wing, as they were with his more infamous fellow socialist.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-08T15:53:00+00:00"
}