{
  "url": "https://voxday.net/2003/12/21/thus-spake-jean-francois/",
  "scraped_at": "2025-12-13T15:39:22.992333",
  "title": "Thus spake Jean-Francois",
  "date_display": "December 21, 2003",
  "date_iso": "2003-12-21T17:57:00+00:00",
  "date_from_url": "2003-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sen. John F. Kerry (D-Mass.), a presidential aspirant, portrayed the success with Libya as an exception to the Bush Doctrine. <em>“Ironically, this significant advance represents a complete U-turn in the Bush administration’s overall foreign policy,” he said in a statement Saturday. “An administration that scorns multilateralism and boasts about a rigid doctrine of military preemption has almost in spite of itself demonstrated the enormous potential for improving our national security through diplomacy.”</em></p><p>Let’s see.  Two American enemies have been beaten down and smacked around.  Immediately after this, an old American enemy decides to make nice.  Can you spot the connection?  Jean-Francois Kerry can’t.  Ironically, it is those who believe George Bush is too synaptically-challenged to be President who will consider this a persuasive argument.  I am not a Bush fan, but neither do I recommend making the mistake of confusing a glib tongue with intelligence, much less wisdom.</p></div>",
  "content_text": "Sen. John F. Kerry (D-Mass.), a presidential aspirant, portrayed the success with Libya as an exception to the Bush Doctrine.\n“Ironically, this significant advance represents a complete U-turn in the Bush administration’s overall foreign policy,” he said in a statement Saturday. “An administration that scorns multilateralism and boasts about a rigid doctrine of military preemption has almost in spite of itself demonstrated the enormous potential for improving our national security through diplomacy.”\nLet’s see.  Two American enemies have been beaten down and smacked around.  Immediately after this, an old American enemy decides to make nice.  Can you spot the connection?  Jean-Francois Kerry can’t.  Ironically, it is those who believe George Bush is too synaptically-challenged to be President who will consider this a persuasive argument.  I am not a Bush fan, but neither do I recommend making the mistake of confusing a glib tongue with intelligence, much less wisdom.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-21T17:57:00+00:00"
}