{
  "url": "https://voxday.net/2003/12/23/we-need-more-of-these/",
  "scraped_at": "2025-12-13T15:39:35.669698",
  "title": "We need more of these?",
  "date_display": "December 23, 2003",
  "date_iso": "2003-12-23T08:43:00+00:00",
  "date_from_url": "2003-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now they’ve cloned <a href=\"http://www.cvm.tamu.edu/news/releases/deer_clone.shtml\">white-tailed deer</a>.  Why?  We don’t have enough?  While I don’t have anything against hunting, I’ve never quite understood the allure of driving three hours north and freezing your rear end off sitting in a tree in the north woods in order to wait for a glimpse of the very same animal that is in your backyard, en masse, every single night.  I remember one evening when my Dad and brothers had left to go hunt, and two hours later, I barely managed to avoid running over three deer less than fifty yards from the house with the truck.  And no, we did not live in the country.</p><p>I have to say, as much as it still boggles my mind that Man has developed cloning technology in my lifetime, I’m a little disappointed with the results.  I hope someone is building a secret army of clones somewhere or something, because the reality is really falling far short of all the science fiction I’ve read.  Where’s my laser pistol?  Where’s my lightsabre?  The real globalist conspiracy has to be the most boring conspiracy ever – what lousy excuse for a conspiracy to take over the world has a web site <a href=\"http://www.mediantics.com/maximedia/geneva/cgg1.htm\">announcing their intentions</a>?  A web site, by the way, they don’t bother to update.</p><p>And if you’re going to clone something, clone Morgan Fairchild.  Can’t have too many of those.</p><p>I’m not sure how I feel about cloning.  I don’t know enough to have an opinion on it, although from what little I understand, I can’t support either the destruction of conceived but unused people or the use of clones for harvesting or study purposes.  My technophilic instincts tend to war against my ethics here, to a certain extent.</p></div>",
  "content_text": "Now they’ve cloned\nwhite-tailed deer\n.  Why?  We don’t have enough?  While I don’t have anything against hunting, I’ve never quite understood the allure of driving three hours north and freezing your rear end off sitting in a tree in the north woods in order to wait for a glimpse of the very same animal that is in your backyard, en masse, every single night.  I remember one evening when my Dad and brothers had left to go hunt, and two hours later, I barely managed to avoid running over three deer less than fifty yards from the house with the truck.  And no, we did not live in the country.\nI have to say, as much as it still boggles my mind that Man has developed cloning technology in my lifetime, I’m a little disappointed with the results.  I hope someone is building a secret army of clones somewhere or something, because the reality is really falling far short of all the science fiction I’ve read.  Where’s my laser pistol?  Where’s my lightsabre?  The real globalist conspiracy has to be the most boring conspiracy ever – what lousy excuse for a conspiracy to take over the world has a web site\nannouncing their intentions\n?  A web site, by the way, they don’t bother to update.\nAnd if you’re going to clone something, clone Morgan Fairchild.  Can’t have too many of those.\nI’m not sure how I feel about cloning.  I don’t know enough to have an opinion on it, although from what little I understand, I can’t support either the destruction of conceived but unused people or the use of clones for harvesting or study purposes.  My technophilic instincts tend to war against my ethics here, to a certain extent.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-23T08:43:00+00:00"
}