{
  "url": "https://voxday.net/2003/12/18/yeah-that-line-worked-real-well-for/",
  "scraped_at": "2025-12-13T15:39:00.551386",
  "title": "Yeah, that line worked real well for Clinton",
  "date_display": "December 18, 2003",
  "date_iso": "2003-12-18T14:50:00+00:00",
  "date_from_url": "2003-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Responding to an exclusive yearender DRUDGE dispatch, which presented NIELSEN’s Top 20 BOOKSCAN list of 2003 sales, O’Reilly called the DRUDGE REPORT a “threat to democracy.”</em></p><p>“I mean you can’t believe a word Matt Drudge says,” O’Reilly told the cameras. “Now you’ve got the Matt Drudges of the world and these other people, Michael Moore and all of these crazies, all right, no responsibility… that is a threat to democracy, I think.” O’Reilly warned: “They’ll just spin it and twist it and take it out of proportion every which way.”</p><p>So Matt Drudge is now magically manipulating Bookscan numbers?  O’Reilly has been seriously losing it for some time now, but he’s going off the deep end here.  People may call him a conservative, but if you’ve read what passes for his first book, you know he’s nothing of the kind, except perhaps this new model “big government conservative” of which Fred Barnes writes.  Or, as I see it, weak sister moderate bootlicker.</p><p>You want extreme? <em>(I’ll give you extreme.  You can’t handle extreme.)</em> Ditch the dying dollar and adopt the gold standard.  Do it now, before China or the EU does and steals world economic leadership.  We rode the dollar hegemony pony as far as it would go, and it was a good run – even a record-setting run in historical terms.  But it’s ending.</p></div>",
  "content_text": "Responding to an exclusive yearender DRUDGE dispatch, which presented NIELSEN’s Top 20 BOOKSCAN list of 2003 sales, O’Reilly called the DRUDGE REPORT a “threat to democracy.”\n“I mean you can’t believe a word Matt Drudge says,” O’Reilly told the cameras. “Now you’ve got the Matt Drudges of the world and these other people, Michael Moore and all of these crazies, all right, no responsibility… that is a threat to democracy, I think.” O’Reilly warned: “They’ll just spin it and twist it and take it out of proportion every which way.”\nSo Matt Drudge is now magically manipulating Bookscan numbers?  O’Reilly has been seriously losing it for some time now, but he’s going off the deep end here.  People may call him a conservative, but if you’ve read what passes for his first book, you know he’s nothing of the kind, except perhaps this new model “big government conservative” of which Fred Barnes writes.  Or, as I see it, weak sister moderate bootlicker.\nYou want extreme?\n(I’ll give you extreme.  You can’t handle extreme.)\nDitch the dying dollar and adopt the gold standard.  Do it now, before China or the EU does and steals world economic leadership.  We rode the dollar hegemony pony as far as it would go, and it was a good run – even a record-setting run in historical terms.  But it’s ending.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-18T14:50:00+00:00"
}