{
  "url": "https://voxday.net/2003/12/09/zero-arent-you-paying-attention/",
  "scraped_at": "2025-12-13T15:37:58.400709",
  "title": "Zero – aren’t you paying attention?",
  "date_display": "December 9, 2003",
  "date_iso": "2003-12-09T23:08:00+00:00",
  "date_from_url": "2003-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After making some solid points about the flaws of Linux on the desktop, TS writes: <em>You’re worried about privacy I’m sure.  But too much privacy in and of itself is dangerous.  The scourge of internet pornography and gambling is brought about precisely because people feel like what they are doing is, at least, mildly anonymous.  How many kid touching priests would be found out rather quickly if law enforcement were allowed to monitor their electronic communications 24/7.  People hide behind their precious privacy and claim they have the right to steal copyrighted works or corrupt young kids.  It’s time we shined a spotlight in the dark corners and run these people out of Dodge.</em></p><p>I totally disagree.  Freedom always comes at a price.  I prefer a million homosexual pedophile priests instead of a single government with the power TS would like to give them.  It will use it to do one thing: kill large numbers of people.  This is ALWAYS the result, and usually within ten years of obtaining totalitarian power.  Those uncorrupted young kids TS hopes to protect will be dead in prison camps because the sort of people who are seeking this unmitigated power have a very different set of values than TS.  Nor will giving them this power even prevent what TS hopes to prevent, because once granted that power, they will not deign to use it for the approved ends, but their own instead.  It’s pretty clear that at least one branch of our government is more likely to invent a constitutional right to touch kids at this point than to make use of totalitarian powers to stop such evil.</p><p><em><br> <br>I’m not quite sure why you hate Microsoft either.  Where does this hatred come from?  They are successful because they give people what they want.  You may not like that but that’s your problem not Microsoft’s.  Sure, they are a monopoly but since when is that in and of itself immoral or illegal.  Only when Microsoft steps over the line and hurts customers is being a monopoly a bad thing.</br></br></em></p><p>Microsoft is not a monopoly.  However, they have chosen to use their market power to get in bed with the totalitarian and would-be totalitarian governments of the world instead of using it to further human freedom.  If MS used their market share to encourage financial privacy, built PGP into Outlook and pursued a general philosophy of protecting and defending individual privacy instead of violating it, I’d be their biggest fan.  Unfortunately, they’re going directly the other way.  I have no doubt they will find many fans on this path.  Humanity has never lacked those who lick the boots of their oppressors.</p></div>",
  "content_text": "After making some solid points about the flaws of Linux on the desktop, TS writes:\nYou’re worried about privacy I’m sure.  But too much privacy in and of itself is dangerous.  The scourge of internet pornography and gambling is brought about precisely because people feel like what they are doing is, at least, mildly anonymous.  How many kid touching priests would be found out rather quickly if law enforcement were allowed to monitor their electronic communications 24/7.  People hide behind their precious privacy and claim they have the right to steal copyrighted works or corrupt young kids.  It’s time we shined a spotlight in the dark corners and run these people out of Dodge.\nI totally disagree.  Freedom always comes at a price.  I prefer a million homosexual pedophile priests instead of a single government with the power TS would like to give them.  It will use it to do one thing: kill large numbers of people.  This is ALWAYS the result, and usually within ten years of obtaining totalitarian power.  Those uncorrupted young kids TS hopes to protect will be dead in prison camps because the sort of people who are seeking this unmitigated power have a very different set of values than TS.  Nor will giving them this power even prevent what TS hopes to prevent, because once granted that power, they will not deign to use it for the approved ends, but their own instead.  It’s pretty clear that at least one branch of our government is more likely to invent a constitutional right to touch kids at this point than to make use of totalitarian powers to stop such evil.\nI’m not quite sure why you hate Microsoft either.  Where does this hatred come from?  They are successful because they give people what they want.  You may not like that but that’s your problem not Microsoft’s.  Sure, they are a monopoly but since when is that in and of itself immoral or illegal.  Only when Microsoft steps over the line and hurts customers is being a monopoly a bad thing.\nMicrosoft is not a monopoly.  However, they have chosen to use their market power to get in bed with the totalitarian and would-be totalitarian governments of the world instead of using it to further human freedom.  If MS used their market share to encourage financial privacy, built PGP into Outlook and pursued a general philosophy of protecting and defending individual privacy instead of violating it, I’d be their biggest fan.  Unfortunately, they’re going directly the other way.  I have no doubt they will find many fans on this path.  Humanity has never lacked those who lick the boots of their oppressors.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-12-09T23:08:00+00:00"
}