{
  "url": "https://voxday.net/2010/09/01/another-dawkins-argument-destroyed/",
  "scraped_at": "2026-01-08T23:36:14.370303",
  "title": "Another Dawkins argument destroyed",
  "date_display": "September 1, 2010",
  "date_iso": "2010-09-01T21:35:00+00:00",
  "date_from_url": "2010-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which a scientific experiment indicates that replacing fallible eyewitness testimony with “scientific evidence” such as DNA <a href=\"http://mylivenews.info/life-fallible-dna-evidence-can-mean-prison-or-freedom.html\">would be a really bad idea</a>:</p><blockquote><p>Interpreting alleles in a joined or partial sample is where the subjective opinion of an algebraist could play a part. To test this, New Scientist teamed up by Itiel Dror, a neuroscientist at University College London and head of Cognitive Consultants International, and Greg Hampikian of Boise State University in Idaho.</p><p>We took a mixed sample of DNA evidence from an actual crime scene- a coterie rape committed in Georgia, US- which helped to convict a fortify called Kerry Robinson, who is currently in prison. We presented it, and Robinson’s DNA contour, to 17 experienced analysts working in the same accredited government lab in the US, out of any contextual information that might bias their judgement.</p><p>In the spring case, two analysts from the Georgia Bureau of Investigation concluded that Robinson “could not have existence excluded” from the crime scene sample, based on his DNA profile. (A second man convicted of the same crime also testified that Robinson was an assailant, in return for a lesser jail term.) Each of our 17 analysts independently examined the profiles from the DNA ad~, the victim’s profile and those of two other suspects and was asked to connoisseur whether the suspects’ profiles could be “excluded”, “cannot be excluded” or whether the results were “indecisive”.</p><p>If DNA analysis were totally objective, then all 17 analysts should get to the same conclusion. However, we found that just one agreed through the original judgement that Robinson “cannot be excluded”. Four analysts related the evidence was inconclusive and 12 said he could be excluded.</p></blockquote><p>What science fetishists consistently fail to understand is that <i>scientists</i> are the weakest link in the reliability of science.  The scientific method is reliable only insofar as the humans who perform the observations and test the results are reliable.  And there is no shortage of evidence, scientific and otherwise, to show that scientists are as intrinsically unreliable as every other collection of human beings.</p></div>",
  "content_text": "In which a scientific experiment indicates that replacing fallible eyewitness testimony with “scientific evidence” such as DNA\nwould be a really bad idea\n:\nInterpreting alleles in a joined or partial sample is where the subjective opinion of an algebraist could play a part. To test this, New Scientist teamed up by Itiel Dror, a neuroscientist at University College London and head of Cognitive Consultants International, and Greg Hampikian of Boise State University in Idaho.\nWe took a mixed sample of DNA evidence from an actual crime scene- a coterie rape committed in Georgia, US- which helped to convict a fortify called Kerry Robinson, who is currently in prison. We presented it, and Robinson’s DNA contour, to 17 experienced analysts working in the same accredited government lab in the US, out of any contextual information that might bias their judgement.\nIn the spring case, two analysts from the Georgia Bureau of Investigation concluded that Robinson “could not have existence excluded” from the crime scene sample, based on his DNA profile. (A second man convicted of the same crime also testified that Robinson was an assailant, in return for a lesser jail term.) Each of our 17 analysts independently examined the profiles from the DNA ad~, the victim’s profile and those of two other suspects and was asked to connoisseur whether the suspects’ profiles could be “excluded”, “cannot be excluded” or whether the results were “indecisive”.\nIf DNA analysis were totally objective, then all 17 analysts should get to the same conclusion. However, we found that just one agreed through the original judgement that Robinson “cannot be excluded”. Four analysts related the evidence was inconclusive and 12 said he could be excluded.\nWhat science fetishists consistently fail to understand is that\nscientists\nare the weakest link in the reliability of science.  The scientific method is reliable only insofar as the humans who perform the observations and test the results are reliable.  And there is no shortage of evidence, scientific and otherwise, to show that scientists are as intrinsically unreliable as every other collection of human beings.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-01T20:35:00+00:00"
}