{
  "url": "https://voxday.net/2010/09/09/anti-book-burners/",
  "scraped_at": "2026-01-08T23:36:56.544437",
  "title": "The anti-book burners",
  "date_display": "September 9, 2010",
  "date_iso": "2010-09-09T17:15:00+00:00",
  "date_from_url": "2010-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One guess as to my opinion about Terry Jones’s announcement that he intended to burn a Talmud and a Koran on September 11th.  Here’s the hint… I’m a libertarian.</p><p>I didn’t get outraged by Mr. Myers assaulting a communion cracker or trashcanning a Koran and I’m certainly not bothered by Mr. Jones burning whatever book he wants to burn so long as he happens to own it.  What is far more troublesome is <a href=\"http://www.nationalreview.com/corner/246024/palin-comes-out-against-koran-burning-daniel-foster\">the reaction of so many public figures</a>, mainstream and conservative alike, as they fall all over each other to condemn a man exercising his Constitutionally-protected free speech rights.  It is obvious that they are far more afraid of provoking the wrath of foreign Muslims than they are of provoking the wrath of the decadent American citizenry.</p><p>Needless to say, the anti-book burners won’t decry <a href=\"http://news.yahoo.com/s/ap/20100909/ap_on_re_as/quran_burning_reaction\">the Afghans burning American flags</a> and chanting “Death to Christians” in response to the mere suggestion that someone <i>intends</i> to burn a Koran.  They are no defenders of freedom or respect for religion, they are already subservient dhimmis.</p></div>",
  "content_text": "One guess as to my opinion about Terry Jones’s announcement that he intended to burn a Talmud and a Koran on September 11th.  Here’s the hint… I’m a libertarian.\nI didn’t get outraged by Mr. Myers assaulting a communion cracker or trashcanning a Koran and I’m certainly not bothered by Mr. Jones burning whatever book he wants to burn so long as he happens to own it.  What is far more troublesome is\nthe reaction of so many public figures\n, mainstream and conservative alike, as they fall all over each other to condemn a man exercising his Constitutionally-protected free speech rights.  It is obvious that they are far more afraid of provoking the wrath of foreign Muslims than they are of provoking the wrath of the decadent American citizenry.\nNeedless to say, the anti-book burners won’t decry\nthe Afghans burning American flags\nand chanting “Death to Christians” in response to the mere suggestion that someone\nintends\nto burn a Koran.  They are no defenders of freedom or respect for religion, they are already subservient dhimmis.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-09T16:15:00+00:00"
}