{
  "url": "https://voxday.net/2010/09/03/applying-science-to-string-theory/",
  "scraped_at": "2026-01-08T23:36:29.147484",
  "title": "Applying science to string theory",
  "date_display": "September 3, 2010",
  "date_iso": "2010-09-03T17:15:00+00:00",
  "date_from_url": "2010-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What <a href=\"http://www.sciencedaily.com/releases/2010/09/100901091938.htm\">a novel idea</a>!</p><blockquote><p>String theory was originally developed to describe the fundamental particles and forces that make up our universe. The new research, led by a team from Imperial College London, describes the unexpected discovery that string theory also seems to predict the behaviour of entangled quantum particles. As this prediction can be tested in the laboratory, researchers can now test string theory.</p></blockquote><p>Of course it seems probable that if the prediction is incorrect, the string theoreticians will follow the example of the Darwinists and insist that string theory is still totally scientific and totally accurate even though every attempt to utilize it to make predictions keep showing it to be reliably incorrect.  When even <i>Richard Dawkins</i> feels the need to start using qualifiers in his would-be magnum opus in defense of the theory of evolution by (probably) natural selection, henceforth TEpNS, only the most fanatic Darwinist could fail to recognize that there is a very real possibility that the theory’s future lies with space aether, phrenology, and phlogistons.</p></div>",
  "content_text": "What\na novel idea\n!\nString theory was originally developed to describe the fundamental particles and forces that make up our universe. The new research, led by a team from Imperial College London, describes the unexpected discovery that string theory also seems to predict the behaviour of entangled quantum particles. As this prediction can be tested in the laboratory, researchers can now test string theory.\nOf course it seems probable that if the prediction is incorrect, the string theoreticians will follow the example of the Darwinists and insist that string theory is still totally scientific and totally accurate even though every attempt to utilize it to make predictions keep showing it to be reliably incorrect.  When even\nRichard Dawkins\nfeels the need to start using qualifiers in his would-be magnum opus in defense of the theory of evolution by (probably) natural selection, henceforth TEpNS, only the most fanatic Darwinist could fail to recognize that there is a very real possibility that the theory’s future lies with space aether, phrenology, and phlogistons.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-03T16:15:00+00:00"
}