{
  "url": "https://voxday.net/2010/09/28/democrats-knew-obama-was-ineligible/",
  "scraped_at": "2026-01-08T23:38:19.560477",
  "title": "Democrats knew Obama was ineligible",
  "date_display": "September 28, 2010",
  "date_iso": "2010-09-28T07:14:00+00:00",
  "date_from_url": "2010-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Which is why the Hawaiian Democratic Party <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=207197\">changed its statement</a> regarding Mr. Soetoro/Soebarkah’s Constitutional qualifications:</p><blockquote><p>In choosing Al Gore and Joe Lieberman in 2000, this was their statement:</p><p>“THIS IS TO CERTIFY that the following candidates for President and Vice-President of the United States <b>are legally qualified to serve under the provisions of the United States Constitution</b> and are the duly chosen candidates of both the state and the national Democratic Parties by balloting at the Presidential Preference Poll and Caucus held March 7, 2000 in the State of Hawaii and by acclamation at the National Democratic Convention held August 14-17, 2000 in Los Angeles, California.”</p><p>The wording was almost identical on behalf of John Kerry and John Edwards in 2004:</p><p>But in 2008, the words missing include “the provisions of the United States Constitution.” It states, “THIS IS TO CERTIFY that the following candidates for President and Vice President of the United States are <b>legally qualified to serve under the provisions of the national Democratic Parties balloting</b> at the Presidential Preference Poll and Caucus held on February 19th, 2008, in the State of Hawaii and by acclamation at the National Democratic Convention held August 27, 2009, in Denver, Colorado.”</p></blockquote><p>Correct me if I’m wrong, but “the provisions of the United States Constitution” are not synonymous with “the provisions of the National Democratic Parties balloting”.  In other words, the Hawaiian Democrats were covering their posteriors in the event, as is gradually coming to pass, that it was discovered Obama is Constitutionally ineligible to hold the office of president.  At this point, there can be little doubt that Obama is not hiding his records due to any grand strategery “to make his opponents look foolish” – his abysmal approval ratings show the absurdity of that defense – but because they will reveal his Constitutional ineligibility for the office he is illegally and illegitimately holding.  It is worth noting, too, that the Democratic National Committee did not certify Obama’s eligibility in any other state despite the false ex posto facto claims of Nancy Pelosi.</p><p>Given that this is arguably the greatest political scandal in American history, it is remarkable that the mainstream media is so loathe to touch it.  Especially considering that it’s already made a #1 New York Times-selling bestseller for Jerome Corsi.</p></div>",
  "content_text": "Which is why the Hawaiian Democratic Party\nchanged its statement\nregarding Mr. Soetoro/Soebarkah’s Constitutional qualifications:\nIn choosing Al Gore and Joe Lieberman in 2000, this was their statement:\n“THIS IS TO CERTIFY that the following candidates for President and Vice-President of the United States\nare legally qualified to serve under the provisions of the United States Constitution\nand are the duly chosen candidates of both the state and the national Democratic Parties by balloting at the Presidential Preference Poll and Caucus held March 7, 2000 in the State of Hawaii and by acclamation at the National Democratic Convention held August 14-17, 2000 in Los Angeles, California.”\nThe wording was almost identical on behalf of John Kerry and John Edwards in 2004:\nBut in 2008, the words missing include “the provisions of the United States Constitution.” It states, “THIS IS TO CERTIFY that the following candidates for President and Vice President of the United States are\nlegally qualified to serve under the provisions of the national Democratic Parties balloting\nat the Presidential Preference Poll and Caucus held on February 19th, 2008, in the State of Hawaii and by acclamation at the National Democratic Convention held August 27, 2009, in Denver, Colorado.”\nCorrect me if I’m wrong, but “the provisions of the United States Constitution” are not synonymous with “the provisions of the National Democratic Parties balloting”.  In other words, the Hawaiian Democrats were covering their posteriors in the event, as is gradually coming to pass, that it was discovered Obama is Constitutionally ineligible to hold the office of president.  At this point, there can be little doubt that Obama is not hiding his records due to any grand strategery “to make his opponents look foolish” – his abysmal approval ratings show the absurdity of that defense – but because they will reveal his Constitutional ineligibility for the office he is illegally and illegitimately holding.  It is worth noting, too, that the Democratic National Committee did not certify Obama’s eligibility in any other state despite the false ex posto facto claims of Nancy Pelosi.\nGiven that this is arguably the greatest political scandal in American history, it is remarkable that the mainstream media is so loathe to touch it.  Especially considering that it’s already made a #1 New York Times-selling bestseller for Jerome Corsi.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-28T06:14:00+00:00"
}