{
  "url": "https://voxday.net/2010/09/23/erik-scott-memorial-blog/",
  "scraped_at": "2026-01-08T23:38:01.116267",
  "title": "Erik Scott memorial blog",
  "date_display": "September 23, 2010",
  "date_iso": "2010-09-23T15:45:00+00:00",
  "date_from_url": "2010-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The father of the military veteran shot dead by Las Vegas police addresses the upcoming attempt <a href=\"http://erikbscottmemorialblog.blogspot.com/2010/09/erik-scott-medical-misdirection.html\">to assassinate his son’s character</a>:</p><blockquote><p>The Clark County Coroner’s Inquest Hearing into my son’s slaying on July 10th at the Summerlin Costco store will be held in Las Vegas, NV, this week. As a one-sided, unchallenged insult to the tenets of U.S. due process, the hearing promises to be quite a show. And that’s exactly how it should be viewed: As a deadly serious TV reality show. It will be nauseating amateur theater carefully orchestrated and controlled by the Las Vegas Metropolitan Police Department and their joined-at-the-hip ally, the District Attorney’s office.</p><p>This “Coroner’s Cop-Clearing Circus” is billed as an informal “fact-finding” exercise, but facts will be in short supply. Instead, this abomination of justice has only two objectives: To destroy Erik Scott’s reputation, and to exonerate the three Metro officers who gunned down Erik in a crowd of approximately 50 people, shooting him seven times. At least five of those rounds were fired into Erik’s back, after he was on the ground, convulsing, bleeding profusely, fighting for air, and dying a painful, needless death. His heart and lungs had been destroyed by hollow-point bullets that slammed into his body at high velocity, then mushroomed, ripping his insides to shreds.</p><p>Metro officers and the DA will attempt to shift the jury’s and TV audience’s attention far away from the facts of Erik’s horrific, senseless killing. First, we’ll hear that the Costco surveillance video recordings (or the store’s “critical cameras,” if we’re to believe Sheriff Gillespie’s latest comments) were “unusable,” thanks to a mysterious hard-disk “glitch.” Don’t believe it. I don’t. Any digital security-video system deployed by a $73-billion-per-year corporation that ranks Number 25 on the Fortune 500 list will have multiple hard-disk backups onsite. Further, the video will be streamed offsite to a remote storage location. I guarantee there’s an unadulterated copy of that video somewhere, but Metro will not allow it to be seen by the family, our attorney, Ross Goodman, or Las Vegas citizens.</p></blockquote><p>If those videotapes are “lost” or “destroyed”, that will constitute compelling evidence, bordering on absolute proof, that the three officers involved, one of whom has shot three people in his five years as a “law enforcement officer”, murdered Mr. Scott’s son.  Lethal abuses of authority, compounded by the criminal coverup, should be punished much more harshly than ordinary first-degree murders by citizens not given badges by the state and local governments.  Which reminds me, it is both ironic and pathetic that so many law enforcement officers attempt to portray their occupation as non-civilian and pseudo-military <i>even when they are defending the murder of a real military man by their civilian brother officers</i>.</p><p>Reading through the memorial blog, am amazed by Mr. Scott’s restraint and wish him the very best in seeking justice for his slain son.  Given the apparent facts, I would find it very difficult to blame him if he instead elected to personally behead those three cops and their family members with a rusty butter knife.</p><p>In the meantime, Confederate Yankee <a href=\"http://confederateyankee.mu.nu/archives/306043.php\">adds to his ongoing summation</a> of the shooting.</p></div>",
  "content_text": "The father of the military veteran shot dead by Las Vegas police addresses the upcoming attempt\nto assassinate his son’s character\n:\nThe Clark County Coroner’s Inquest Hearing into my son’s slaying on July 10th at the Summerlin Costco store will be held in Las Vegas, NV, this week. As a one-sided, unchallenged insult to the tenets of U.S. due process, the hearing promises to be quite a show. And that’s exactly how it should be viewed: As a deadly serious TV reality show. It will be nauseating amateur theater carefully orchestrated and controlled by the Las Vegas Metropolitan Police Department and their joined-at-the-hip ally, the District Attorney’s office.\nThis “Coroner’s Cop-Clearing Circus” is billed as an informal “fact-finding” exercise, but facts will be in short supply. Instead, this abomination of justice has only two objectives: To destroy Erik Scott’s reputation, and to exonerate the three Metro officers who gunned down Erik in a crowd of approximately 50 people, shooting him seven times. At least five of those rounds were fired into Erik’s back, after he was on the ground, convulsing, bleeding profusely, fighting for air, and dying a painful, needless death. His heart and lungs had been destroyed by hollow-point bullets that slammed into his body at high velocity, then mushroomed, ripping his insides to shreds.\nMetro officers and the DA will attempt to shift the jury’s and TV audience’s attention far away from the facts of Erik’s horrific, senseless killing. First, we’ll hear that the Costco surveillance video recordings (or the store’s “critical cameras,” if we’re to believe Sheriff Gillespie’s latest comments) were “unusable,” thanks to a mysterious hard-disk “glitch.” Don’t believe it. I don’t. Any digital security-video system deployed by a $73-billion-per-year corporation that ranks Number 25 on the Fortune 500 list will have multiple hard-disk backups onsite. Further, the video will be streamed offsite to a remote storage location. I guarantee there’s an unadulterated copy of that video somewhere, but Metro will not allow it to be seen by the family, our attorney, Ross Goodman, or Las Vegas citizens.\nIf those videotapes are “lost” or “destroyed”, that will constitute compelling evidence, bordering on absolute proof, that the three officers involved, one of whom has shot three people in his five years as a “law enforcement officer”, murdered Mr. Scott’s son.  Lethal abuses of authority, compounded by the criminal coverup, should be punished much more harshly than ordinary first-degree murders by citizens not given badges by the state and local governments.  Which reminds me, it is both ironic and pathetic that so many law enforcement officers attempt to portray their occupation as non-civilian and pseudo-military\neven when they are defending the murder of a real military man by their civilian brother officers\n.\nReading through the memorial blog, am amazed by Mr. Scott’s restraint and wish him the very best in seeking justice for his slain son.  Given the apparent facts, I would find it very difficult to blame him if he instead elected to personally behead those three cops and their family members with a rusty butter knife.\nIn the meantime, Confederate Yankee\nadds to his ongoing summation\nof the shooting.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-23T14:45:00+00:00"
}