{
  "url": "https://voxday.net/2010/09/09/futile-cya-attemp/",
  "scraped_at": "2026-01-08T23:36:54.707926",
  "title": "A futile CYA attempt",
  "date_display": "September 9, 2010",
  "date_iso": "2010-09-09T13:30:00+00:00",
  "date_from_url": "2010-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears that those of us who have been pointing out that Krugman advocated a $600 billion stimulus only two months before claiming a $787 billion stimulus was too small have finally force the man <a href=\"http://community.nytimes.com/comments/krugman.blogs.nytimes.com/2010/09/07/600-billion/\">to address the issue</a>.  Unsurprisingly, he does so both dishonestly and incompetently:</p><blockquote><p>Oy, it seems that another out-of-context quote of mine is being used to claim that I thought the Obama stimulus plan was just dandy. So: back in 2008, I wrote <a href=\"http://krugman.blogs.nytimes.com/2008/11/10/stimulus-math-wonkish/\">this piece</a> in which I called for stimulus of 4 percent of GDP, or $600 billion. Didn’t we get that, and more?</p><p>No. If you read the actual argument — which explains in detail how I arrived at the number — you’ll see that I was thinking in terms of a one-year program; $600 billion is 4 percent of one year’s GDP. I wasn’t clear about the issue of stimulus spread out over 2 years; but if you apply the math in that post, you’ll see that it implies a two-year program twice that size, which was just about what Christina Romer concluded was appropriate.</p></blockquote><p>There is one little problem here, which should be obvious to everyone. <i>Krugman never said anything about a multi-year stimulus package</i>.  The fact that the $787 billion stimulus package covered two years has no bearing on the length of the $600 billion stimulus he was advocating.  He can no more claim to have advocated a $1.2 trillion stimulus package over two years than a $6 trillion stimulus package over ten.</p><p>Furthermore, as one of his commenters pointed out, he used the specific $600 billion figure – indicating a one year stimulus – only four days later: <i>“All indications are that the new administration will offer a major stimulus package. My own back-of-the-envelope calculations say that the package should be huge, on the order of $600 billion.  So the question becomes, will the Obama people dare to propose something on that scale?  Let’s hope that the answer to that question is yes, that the new administration will indeed be that daring.”</i></p><p>He was wrong, he was busted and no amount of equivocation on his part can demonstrate otherwise.</p></div>",
  "content_text": "It appears that those of us who have been pointing out that Krugman advocated a $600 billion stimulus only two months before claiming a $787 billion stimulus was too small have finally force the man\nto address the issue\n.  Unsurprisingly, he does so both dishonestly and incompetently:\nOy, it seems that another out-of-context quote of mine is being used to claim that I thought the Obama stimulus plan was just dandy. So: back in 2008, I wrote\nthis piece\nin which I called for stimulus of 4 percent of GDP, or $600 billion. Didn’t we get that, and more?\nNo. If you read the actual argument — which explains in detail how I arrived at the number — you’ll see that I was thinking in terms of a one-year program; $600 billion is 4 percent of one year’s GDP. I wasn’t clear about the issue of stimulus spread out over 2 years; but if you apply the math in that post, you’ll see that it implies a two-year program twice that size, which was just about what Christina Romer concluded was appropriate.\nThere is one little problem here, which should be obvious to everyone.\nKrugman never said anything about a multi-year stimulus package\n.  The fact that the $787 billion stimulus package covered two years has no bearing on the length of the $600 billion stimulus he was advocating.  He can no more claim to have advocated a $1.2 trillion stimulus package over two years than a $6 trillion stimulus package over ten.\nFurthermore, as one of his commenters pointed out, he used the specific $600 billion figure – indicating a one year stimulus – only four days later:\n“All indications are that the new administration will offer a major stimulus package. My own back-of-the-envelope calculations say that the package should be huge, on the order of $600 billion.  So the question becomes, will the Obama people dare to propose something on that scale?  Let’s hope that the answer to that question is yes, that the new administration will indeed be that daring.”\nHe was wrong, he was busted and no amount of equivocation on his part can demonstrate otherwise.",
  "tags": [
    "economics",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-09T12:30:00+00:00"
}