{
  "url": "https://voxday.net/2010/09/30/gay-rights-killed-clementi/",
  "scraped_at": "2026-01-08T23:38:34.237650",
  "title": "Gay rights killed Clementi",
  "date_display": "September 30, 2010",
  "date_iso": "2010-09-30T08:07:00+00:00",
  "date_from_url": "2010-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The body count of the gay rights movement <a href=\"http://apnews.myway.com/article/20100930/D9II1KAG2.html\">grows by one</a>.</p><blockquote><p>A college student jumped to his death off a bridge a day after authorities say two classmates surreptitiously recorded him having sex with a man in his dorm room and broadcast it over the Internet.  Rutgers University freshman Tyler Clementi jumped from the George Washington Bridge last week, said his family’s attorney, Paul Mainardi. Police recovered a man’s body Wednesday afternoon in the Hudson River just north of the bridge, and authorities were trying to determine if it was Clementi’s.</p><p>ABC News and The Star-Ledger of Newark reported that Clementi left on his Facebook page on Sept. 22 a note that read: “Jumping off the gw bridge sorry.” On Wednesday, his Facebook page was accessible only to friends.  Two Rutgers freshmen have been charged with illegally taping the 18-year-old Clementi having sex and broadcasting the images via an Internet chat program.</p><p>Steven Goldstein, chairman of the gay rights group Garden State Equality, said in a statement Wednesday that his group considers Clementi’s death a hate crime.</p></blockquote><p>It was obvious from the start that the orientationally-challenged activists would attempt to blame Clementi’s death on his roommate.  But the surreptitious filming of sexual activity, while an obvious breach of etiquette as well as the law in some states, is neither uncommon nor tantamount to attempting to destroy someone’s life.  Nor should the online streaming be considered anything but a joke; <i>American Pie</i> is a comedy, not a horror flick, after all.  The problem is not that American university campuses are intolerant of the orientationally challenged, as the subtext of the media coverage suggests, but rather that they are much too tolerant.</p><p>It is obvious that Clementi didn’t kill himself simply because his actions were made public; as a musician, no doubt he had been filmed before and some of those films may have even been put online.  He killed himself because he could not live with the shame of knowing that everyone would be aware of his submission to what he apparently believed to be evil desires.  While giving in to our desire for evil is something that we all do from time to time, it is also true that some desires happen to be more shameful or humiliating than others.  For example, a man’s desire for his neighbor’s wife is sinful, but few consider it to be as appalling as his desire for his neighbor’s child.</p><p>While Clementi <i>may</i> have been taught that his desires were wrong, (we don’t have any details on his upbringing, but the last name suggests a Catholic heritage), he was also steeped in years of indoctrination telling him that his abnormal desires were perfectly right and should not be resisted.  That is why he felt free to act on them as soon as he got to college and out from under his parents’ eyes.</p><p>And that is why his suicide poses a problem for the “morality is a human construct” crowd.  Despite literal decades of preaching about the morality of homosexuality, despite the pansexual propaganda of the public and private schools, the knowledge that what he was doing was shameful and wrong still managed to penetrate Mr. Clementi’s mind.  A normal man being forced to confront his immorality in such a public way might have reacted with anger, irritation, embarrassment, or amusement, but only one who is both psychologically disturbed and appalled by his own actions will destroy himself over it.</p><p>As was discussed a few days ago regarding the police, people usually have the psychological causality of the orientationally-challenged exactly backwards.  Psychological disturbance and self-destructive activity are seldom the <i>result</i> of the hardships of the job or the intolerance of the normally oriented, they are instead usually <i>the primary cause</i> of the pursuit of the police occupation or the same sex.</p><p>So it was not a juvenile prank that killed the unfortunate Mr. Clementi even though it served as the proximate trigger for his lethal actions.  If anyone other than Mr. Clementi should be blamed for his suicide, it is those who repeatedly encouraged him to behave in a way that would fill him with such guilt, remorse, and shame.</p></div>",
  "content_text": "The body count of the gay rights movement\ngrows by one\n.\nA college student jumped to his death off a bridge a day after authorities say two classmates surreptitiously recorded him having sex with a man in his dorm room and broadcast it over the Internet.  Rutgers University freshman Tyler Clementi jumped from the George Washington Bridge last week, said his family’s attorney, Paul Mainardi. Police recovered a man’s body Wednesday afternoon in the Hudson River just north of the bridge, and authorities were trying to determine if it was Clementi’s.\nABC News and The Star-Ledger of Newark reported that Clementi left on his Facebook page on Sept. 22 a note that read: “Jumping off the gw bridge sorry.” On Wednesday, his Facebook page was accessible only to friends.  Two Rutgers freshmen have been charged with illegally taping the 18-year-old Clementi having sex and broadcasting the images via an Internet chat program.\nSteven Goldstein, chairman of the gay rights group Garden State Equality, said in a statement Wednesday that his group considers Clementi’s death a hate crime.\nIt was obvious from the start that the orientationally-challenged activists would attempt to blame Clementi’s death on his roommate.  But the surreptitious filming of sexual activity, while an obvious breach of etiquette as well as the law in some states, is neither uncommon nor tantamount to attempting to destroy someone’s life.  Nor should the online streaming be considered anything but a joke;\nAmerican Pie\nis a comedy, not a horror flick, after all.  The problem is not that American university campuses are intolerant of the orientationally challenged, as the subtext of the media coverage suggests, but rather that they are much too tolerant.\nIt is obvious that Clementi didn’t kill himself simply because his actions were made public; as a musician, no doubt he had been filmed before and some of those films may have even been put online.  He killed himself because he could not live with the shame of knowing that everyone would be aware of his submission to what he apparently believed to be evil desires.  While giving in to our desire for evil is something that we all do from time to time, it is also true that some desires happen to be more shameful or humiliating than others.  For example, a man’s desire for his neighbor’s wife is sinful, but few consider it to be as appalling as his desire for his neighbor’s child.\nWhile Clementi\nmay\nhave been taught that his desires were wrong, (we don’t have any details on his upbringing, but the last name suggests a Catholic heritage), he was also steeped in years of indoctrination telling him that his abnormal desires were perfectly right and should not be resisted.  That is why he felt free to act on them as soon as he got to college and out from under his parents’ eyes.\nAnd that is why his suicide poses a problem for the “morality is a human construct” crowd.  Despite literal decades of preaching about the morality of homosexuality, despite the pansexual propaganda of the public and private schools, the knowledge that what he was doing was shameful and wrong still managed to penetrate Mr. Clementi’s mind.  A normal man being forced to confront his immorality in such a public way might have reacted with anger, irritation, embarrassment, or amusement, but only one who is both psychologically disturbed and appalled by his own actions will destroy himself over it.\nAs was discussed a few days ago regarding the police, people usually have the psychological causality of the orientationally-challenged exactly backwards.  Psychological disturbance and self-destructive activity are seldom the\nresult\nof the hardships of the job or the intolerance of the normally oriented, they are instead usually\nthe primary cause\nof the pursuit of the police occupation or the same sex.\nSo it was not a juvenile prank that killed the unfortunate Mr. Clementi even though it served as the proximate trigger for his lethal actions.  If anyone other than Mr. Clementi should be blamed for his suicide, it is those who repeatedly encouraged him to behave in a way that would fill him with such guilt, remorse, and shame.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-30T07:07:00+00:00"
}