{
  "url": "https://voxday.net/2010/09/10/hearts-and-minds-2/",
  "scraped_at": "2026-01-08T23:37:06.106113",
  "title": "Hearts and minds",
  "date_display": "September 10, 2010",
  "date_iso": "2010-09-10T19:11:00+00:00",
  "date_from_url": "2010-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At least they’re not burning Korans.  Because, you know, that might upset someone a lot more than merely <a href=\"http://www.dailymail.co.uk/news/travelnews/article-1310540/Twelve-US-soldiers-face-trial-Afghan-civilians-killed-sport--whistle-blower-originally-ignored.html\">slaughtering innocent civilians</a>:</p><blockquote><p>A dozen U.S. soldiers are facing trial accused of being part of a ‘kill team’ that allegedly killed Afghan civilians in an arbitrary fashion – and they even collected their victims fingers as trophies of war.  Five soldiers have been charged with killing three Afghan men ‘for sport’.  And seven more are accused of covering up the murders.</p></blockquote><p>I’m a little surprised the federal appeals court that legalized torture the other day hasn’t weighed in to declare that it is illegal for federal employees to be put on trial for murder on national security grounds.  By the way, that decision was even worse than you probably thought, as it barred torture victims the chance to prove that they were tortured <i>even if they only presented evidence that was not classified information</i>.</p></div>",
  "content_text": "At least they’re not burning Korans.  Because, you know, that might upset someone a lot more than merely\nslaughtering innocent civilians\n:\nA dozen U.S. soldiers are facing trial accused of being part of a ‘kill team’ that allegedly killed Afghan civilians in an arbitrary fashion – and they even collected their victims fingers as trophies of war.  Five soldiers have been charged with killing three Afghan men ‘for sport’.  And seven more are accused of covering up the murders.\nI’m a little surprised the federal appeals court that legalized torture the other day hasn’t weighed in to declare that it is illegal for federal employees to be put on trial for murder on national security grounds.  By the way, that decision was even worse than you probably thought, as it barred torture victims the chance to prove that they were tortured\neven if they only presented evidence that was not classified information\n.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-10T18:11:00+00:00"
}