{
  "url": "https://voxday.net/2010/09/13/immigration-and-fate-of-empires/",
  "scraped_at": "2026-01-08T23:37:18.918845",
  "title": "Immigration and the fate of empires",
  "date_display": "September 13, 2010",
  "date_iso": "2010-09-13T13:15:00+00:00",
  "date_from_url": "2010-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sir John Glubb on how immigrants do not strengthen an empire, but rather transform it, weaken it and ultimately <a href=\"http://www.arlev.co.uk/glubb/index.htm\">help bring about its demise</a>:</p><blockquote><p><i>The Influx of Foreigners</i></p><p>One of the oft-repeated phenomena of great empires is the influx of foreigners to the capital city.  Roman historians often complain of the number of Asians and Africans in Rome.  Baghdad, in its prime in the ninth century, was international in its population – Persians, Turks, Arabs, Armenians, Egyptians, Africans, and Greeks mingled in its streets.</p><p>In London today, Cypriots, Greeks, Italians, Russians, Africans, Germans, and Indians jostle one another on the buses and in the undergournd, so that it sometimes seems difficult to find any British.  The same applies to New York, perhaps even more so.  This problem does not consist in any inferiority of one race as compared with another, but simply in the differences between them.</p><p>In the age of the first outburst and the subsequent Age of Conquests, the race is normally ethnically more or less homogeneous.  This state of affairs facilitates a feeling of solidarity and comradeship.  But in the Ages of Commerce and Affluence, every type of foreigner floods into the great city, the streets of which are reputed to be paved with gold.  As, in most cases, this great city is also the capital of the empire, the cosmopolitan crowd at the seat of the empire exercises a political influence greatly in excess of its relative numbers.</p><p>Second- or third-generation foreign immigrants may appear outwardly to be entirely assimilated, but they often constitute a weakness in two directions.  First, their basic human nature often differs from that of the original imperial stock.  If the earlier imperial race was stubborn and slow-moving, the immigrants might come from more emotional races, thereby introducing cracks and schisms into the national policies, even if all were equally loyal.</p><p>Second, while the nation is still affluent, all the diverse races may appear equally loyal.  But in an acute emergency, the immigrants will often be less willing to sacrifice their lives and their property than will be the original descendants of the founder race.</p><p>Third, the immigrants are liable to form communities of their own, protecting primarily their own interests, and only in the second degree that of the nation as a whole.</p><p>Fourth, many of the foreign immigrants will probably belong to races originally conquered by and absorbed into the empire.  While the empire is enjoying its High Noon of prosperity, all these people are proud and glad to be imperial citizens.  But when decline sets in, it is extraordinary how the memory of ancient wars, perhaps centuries before, is suddenly revived, and local or provincial movements appear demanding secession or independence.  Some day this phenomenon will doubtless appear in the now apparently monolithic and authoritarian Soviet empire.  It is amazing for how long such provincial sentiments can survive.</p></blockquote><p>As I noted in a previous post, the influx of Irish, German, and Scandinavian immigrants distinctly transformed the political culture of America in a fundamentally anti-Constitutional manner, not despite but <i>because</i> of their assimilation.  In this essay, we can see the way in which the Jewish European immigrants of the post-WWII period have had a predictably inimical effect as well as predict the ultimate outcome of the much larger and more recent wave of Central American immigration.  I find this piece to be fascinating because while I hadn’t read Glubb before, I had reached very similar conclusions on the basis of my own historical readings.</p><p>The important thing to note is that none of this has <i>anything</i> to do with racial or cultural superiorities, but rather the mere fact of racial and cultural differences between immigrant cultures and host cultures playing out in a repetitive and entirely predictable manner.  There’s no point in attempting to assign particular blame to any specific immigrant group, much less to decry awareness of historical patterns as being somehow anti-Irish, anti-semitic, or anti-laraza.  If the same pattern has played out everywhere from Asia to Europe and now America over three thousand years, there isn’t any rational grounds to believe that the White Anglo-Saxon Protestant culture upon which the American Empire was originally built was going to be harmed significantly less by the immmigration of smart Russian Jews and hard-working Swedish Lutherans than it is by involuntarily imported African slaves, uneducated Mexican Catholics or half-barbaric Somali Muslims.</p><p>The theory points to a very different conclusion than the multiculturalist critic will likely assume.  Contra the fevered fears of violent reaction they imagine it will inspire, this theory of imperial decline actually indicates that there is no point even attempting to restrict immigration at this late stage because the imperial culture of America has already been fatally diluted and is now well into the final stage of decadence.  The time in which an imperial culture can be preserved is during the Ages of Commerce and Affluence; if the preservationist forces wait until the Ages of Intellect or Decadence to react to immigrant-driven transformations, it is already too late.</p><p>What applying Glubb’s theory to the present situation indicates is that those who value the historical imperial culture of America would do much better to focus on building anew on a smaller scale rather than wasting time, money, and opportunity cost on futile attempts to regain what has already been lost.  There is a lot to contemplate there, and much of it is not terribly pleasant, but the fact that his <i>historical</i> conclusions happen to point in exactly the same direction as independently developed <i>economic</i> conclusions tends to indicate that they merit more than simply being brushed aside unconsidered.</p></div>",
  "content_text": "Sir John Glubb on how immigrants do not strengthen an empire, but rather transform it, weaken it and ultimately\nhelp bring about its demise\n:\nThe Influx of Foreigners\nOne of the oft-repeated phenomena of great empires is the influx of foreigners to the capital city.  Roman historians often complain of the number of Asians and Africans in Rome.  Baghdad, in its prime in the ninth century, was international in its population – Persians, Turks, Arabs, Armenians, Egyptians, Africans, and Greeks mingled in its streets.\nIn London today, Cypriots, Greeks, Italians, Russians, Africans, Germans, and Indians jostle one another on the buses and in the undergournd, so that it sometimes seems difficult to find any British.  The same applies to New York, perhaps even more so.  This problem does not consist in any inferiority of one race as compared with another, but simply in the differences between them.\nIn the age of the first outburst and the subsequent Age of Conquests, the race is normally ethnically more or less homogeneous.  This state of affairs facilitates a feeling of solidarity and comradeship.  But in the Ages of Commerce and Affluence, every type of foreigner floods into the great city, the streets of which are reputed to be paved with gold.  As, in most cases, this great city is also the capital of the empire, the cosmopolitan crowd at the seat of the empire exercises a political influence greatly in excess of its relative numbers.\nSecond- or third-generation foreign immigrants may appear outwardly to be entirely assimilated, but they often constitute a weakness in two directions.  First, their basic human nature often differs from that of the original imperial stock.  If the earlier imperial race was stubborn and slow-moving, the immigrants might come from more emotional races, thereby introducing cracks and schisms into the national policies, even if all were equally loyal.\nSecond, while the nation is still affluent, all the diverse races may appear equally loyal.  But in an acute emergency, the immigrants will often be less willing to sacrifice their lives and their property than will be the original descendants of the founder race.\nThird, the immigrants are liable to form communities of their own, protecting primarily their own interests, and only in the second degree that of the nation as a whole.\nFourth, many of the foreign immigrants will probably belong to races originally conquered by and absorbed into the empire.  While the empire is enjoying its High Noon of prosperity, all these people are proud and glad to be imperial citizens.  But when decline sets in, it is extraordinary how the memory of ancient wars, perhaps centuries before, is suddenly revived, and local or provincial movements appear demanding secession or independence.  Some day this phenomenon will doubtless appear in the now apparently monolithic and authoritarian Soviet empire.  It is amazing for how long such provincial sentiments can survive.\nAs I noted in a previous post, the influx of Irish, German, and Scandinavian immigrants distinctly transformed the political culture of America in a fundamentally anti-Constitutional manner, not despite but\nbecause\nof their assimilation.  In this essay, we can see the way in which the Jewish European immigrants of the post-WWII period have had a predictably inimical effect as well as predict the ultimate outcome of the much larger and more recent wave of Central American immigration.  I find this piece to be fascinating because while I hadn’t read Glubb before, I had reached very similar conclusions on the basis of my own historical readings.\nThe important thing to note is that none of this has\nanything\nto do with racial or cultural superiorities, but rather the mere fact of racial and cultural differences between immigrant cultures and host cultures playing out in a repetitive and entirely predictable manner.  There’s no point in attempting to assign particular blame to any specific immigrant group, much less to decry awareness of historical patterns as being somehow anti-Irish, anti-semitic, or anti-laraza.  If the same pattern has played out everywhere from Asia to Europe and now America over three thousand years, there isn’t any rational grounds to believe that the White Anglo-Saxon Protestant culture upon which the American Empire was originally built was going to be harmed significantly less by the immmigration of smart Russian Jews and hard-working Swedish Lutherans than it is by involuntarily imported African slaves, uneducated Mexican Catholics or half-barbaric Somali Muslims.\nThe theory points to a very different conclusion than the multiculturalist critic will likely assume.  Contra the fevered fears of violent reaction they imagine it will inspire, this theory of imperial decline actually indicates that there is no point even attempting to restrict immigration at this late stage because the imperial culture of America has already been fatally diluted and is now well into the final stage of decadence.  The time in which an imperial culture can be preserved is during the Ages of Commerce and Affluence; if the preservationist forces wait until the Ages of Intellect or Decadence to react to immigrant-driven transformations, it is already too late.\nWhat applying Glubb’s theory to the present situation indicates is that those who value the historical imperial culture of America would do much better to focus on building anew on a smaller scale rather than wasting time, money, and opportunity cost on futile attempts to regain what has already been lost.  There is a lot to contemplate there, and much of it is not terribly pleasant, but the fact that his\nhistorical\nconclusions happen to point in exactly the same direction as independently developed\neconomic\nconclusions tends to indicate that they merit more than simply being brushed aside unconsidered.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-13T12:15:00+00:00"
}