{
  "url": "https://voxday.net/2010/09/28/killing-meat-eaters/",
  "scraped_at": "2026-01-08T23:38:21.440103",
  "title": "Killing the meat eaters",
  "date_display": "September 28, 2010",
  "date_iso": "2010-09-28T13:30:00+00:00",
  "date_from_url": "2010-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reading <a href=\"http://opinionator.blogs.nytimes.com/2010/09/19/the-meat-eaters/\">this philosophical ode to trans-species totalitarianism</a>, one is reminded that Hitler, too, was a vegetarian:</p><blockquote><p>It would be good to prevent the vast suffering and countless violent deaths caused by predation.  There is therefore one reason to think that it would be instrumentally good if  predatory animal species were to become extinct and be replaced by new herbivorous species, provided that this could occur without ecological upheaval involving more harm than would be prevented by the end of predation.  The claim that existing animal species are sacred or irreplaceable is subverted by the moral irrelevance of the criteria for individuating animal species.  I am therefore inclined to embrace the heretical conclusion that we have reason to desire the extinction of all carnivorous species, and I await the usual fate of heretics when this article is opened to comment.</p></blockquote><p>But what about the plants?  Do they not also live?  This monstrous proposal is dependent upon the commission of <i>mass herbicide</i>?  One has no other choice but to conclude that the Athenians had it right.  The best response to a philosopher is to provide him with nice, hearty draught of hemlock.</p></div>",
  "content_text": "Reading\nthis philosophical ode to trans-species totalitarianism\n, one is reminded that Hitler, too, was a vegetarian:\nIt would be good to prevent the vast suffering and countless violent deaths caused by predation.  There is therefore one reason to think that it would be instrumentally good if  predatory animal species were to become extinct and be replaced by new herbivorous species, provided that this could occur without ecological upheaval involving more harm than would be prevented by the end of predation.  The claim that existing animal species are sacred or irreplaceable is subverted by the moral irrelevance of the criteria for individuating animal species.  I am therefore inclined to embrace the heretical conclusion that we have reason to desire the extinction of all carnivorous species, and I await the usual fate of heretics when this article is opened to comment.\nBut what about the plants?  Do they not also live?  This monstrous proposal is dependent upon the commission of\nmass herbicide\n?  One has no other choice but to conclude that the Athenians had it right.  The best response to a philosopher is to provide him with nice, hearty draught of hemlock.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-28T12:30:00+00:00"
}