{
  "url": "https://voxday.net/2010/09/10/madness-of-monetarists/",
  "scraped_at": "2026-01-08T23:37:02.024978",
  "title": "The madness of the monetarists",
  "date_display": "September 10, 2010",
  "date_iso": "2010-09-10T10:09:00+00:00",
  "date_from_url": "2010-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Citi’s chief economist takes the concept of financial insanity <a href=\"http://online.wsj.com/article/SB10001424052748704644404575481390712384072.html?mod=WSJ_hps_RIGHTTopCarousel_1#articleTabs%3Darticle\">to new heights</a>:</p><blockquote><p>To restore monetary policy effectiveness in a low interest rate environment when confronted with deflationary or contractionary shocks, it is necessary to get rid of the zlb completely. This can be done in three ways: abolishing currency, taxing currency and ending the fixed exchange rate between currency and bank reserves with the Fed. All three are unorthodox. The third is unorthodox and innovative. All three are conceptually simple. The first and third are administratively easy to implement.</p><p>The first method does away with currency completely. This has the additional benefit of inconveniencing the main users of currency—operators in the grey, black and outright criminal economies. Adequate substitutes for the legitimate uses of currency, on which positive or negative interest could be paid, are available.</p><p>The second approach, proposed by Gesell, is to tax currency by making it subject to an expiration date. Currency would have to be “stamped” periodically by the Fed to keep it current. When done so, interest (positive or negative) is received or paid.</p><p>The third method ends the fixed exchange rate (set at one) between dollar deposits with the Fed (reserves) and dollar bills. There could be a currency reform first. All existing dollar bills and coin would be converted by a certain date and at a fixed exchange rate into a new currency called, say, the rallod. Reserves at the Fed would continue to be denominated in dollars. As long as the Federal Funds target rate is positive or zero, the Fed would maintain the fixed exchange rate between the dollar and the rallod.</p></blockquote><p>This helps explain why gold prices have remained so strong despite declining debt and the deflationary environment.  The one scenario that makes sense for the price of gold to continue to rise despite deflation (an increase in the value of money due to a decrease in the available supply of it) is if the “store of value” aspect of that money is increasingly under threat.  Gold prices rising during deflation indicates that the increasing value of gold as denominated in non-gold goods and services is rising faster than the increasing value of money is rising against them, which is basically what we have been observing for the last two years.</p><p>All three of these Citi-endorsed suggestions go significantly beyond the Helicopter Ben’s conventional Keynesian lunacy. It wouldn’t only destroy the global economy, but as Mike Shedlock points out, <a href=\"http://globaleconomicanalysis.blogspot.com/2010/09/instant-insanity.html\">it wouldn’t even accomplish the increase in credit</a> that the banks are attempting to create in the first place.  Implementing any of these three measures, but especially the first, would be rather like burning down the house to collect on fire insurance when you haven’t bothered with the minor step of taking out an insurance policy on the place first.</p><p>So this proposal to <i>abolish currency</i> should eliminate any last vestiges of doubt that the banks are a) insane with greed, b) incompetent, and c) totally uninterested in the well-being of the rest of the country.  It seems increasingly obvious that abolishing the banking industry would be a much better idea.</p></div>",
  "content_text": "Citi’s chief economist takes the concept of financial insanity\nto new heights\n:\nTo restore monetary policy effectiveness in a low interest rate environment when confronted with deflationary or contractionary shocks, it is necessary to get rid of the zlb completely. This can be done in three ways: abolishing currency, taxing currency and ending the fixed exchange rate between currency and bank reserves with the Fed. All three are unorthodox. The third is unorthodox and innovative. All three are conceptually simple. The first and third are administratively easy to implement.\nThe first method does away with currency completely. This has the additional benefit of inconveniencing the main users of currency—operators in the grey, black and outright criminal economies. Adequate substitutes for the legitimate uses of currency, on which positive or negative interest could be paid, are available.\nThe second approach, proposed by Gesell, is to tax currency by making it subject to an expiration date. Currency would have to be “stamped” periodically by the Fed to keep it current. When done so, interest (positive or negative) is received or paid.\nThe third method ends the fixed exchange rate (set at one) between dollar deposits with the Fed (reserves) and dollar bills. There could be a currency reform first. All existing dollar bills and coin would be converted by a certain date and at a fixed exchange rate into a new currency called, say, the rallod. Reserves at the Fed would continue to be denominated in dollars. As long as the Federal Funds target rate is positive or zero, the Fed would maintain the fixed exchange rate between the dollar and the rallod.\nThis helps explain why gold prices have remained so strong despite declining debt and the deflationary environment.  The one scenario that makes sense for the price of gold to continue to rise despite deflation (an increase in the value of money due to a decrease in the available supply of it) is if the “store of value” aspect of that money is increasingly under threat.  Gold prices rising during deflation indicates that the increasing value of gold as denominated in non-gold goods and services is rising faster than the increasing value of money is rising against them, which is basically what we have been observing for the last two years.\nAll three of these Citi-endorsed suggestions go significantly beyond the Helicopter Ben’s conventional Keynesian lunacy. It wouldn’t only destroy the global economy, but as Mike Shedlock points out,\nit wouldn’t even accomplish the increase in credit\nthat the banks are attempting to create in the first place.  Implementing any of these three measures, but especially the first, would be rather like burning down the house to collect on fire insurance when you haven’t bothered with the minor step of taking out an insurance policy on the place first.\nSo this proposal to\nabolish currency\nshould eliminate any last vestiges of doubt that the banks are a) insane with greed, b) incompetent, and c) totally uninterested in the well-being of the rest of the country.  It seems increasingly obvious that abolishing the banking industry would be a much better idea.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-10T09:09:00+00:00"
}