{
  "url": "https://voxday.net/2010/09/16/mailvox-defending-free-trade/",
  "scraped_at": "2026-01-08T23:37:37.310558",
  "title": "Mailvox: defending free trade",
  "date_display": "September 16, 2010",
  "date_iso": "2010-09-16T14:15:00+00:00",
  "date_from_url": "2010-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>EJ takes exception to my previous post critiquing Ricardian comparative advantage:</p><blockquote><p>I have to disagree with you regarding free trade.</p><p>You write: <i>“This example assumes that there is something that the old man can do that is of value to the young man. But that’s not necessarily true. What if instead of 2 people, there are 20 and all the old man can usefully do is gather 5 coconuts a day when two young girls with no other useful skills can gather 100, more than the castaway society needs, in the same time? Yes, total production will increase +5, but so what? No one is going to give him anything for his worthless coconuts because there is already a coconut glut thanks to the highly productive young girls. Austrian-savvy individuals should be able to see the seeds of an Austrian critique of Ricardo here.”</i></p><p>Your example fails to take into account that there are always other needs to be satisfied, needs which require other goods beside coconuts.  Either the old man or the young girls can, for instance, gather berries, help build a hut, etc.  Ricardo is right in that, by shifting the old man’s production into that which he does comparatively best, society benefits.  The only time this isn’t true is if every need has already been satisfied and there is absolutely no other task that the old man can do.  Your assumption strikes me as an unwarranted; it is certainly not true that all needs have been met in the world we live in.</p><p>Ricardo’s discovery has astounding consequences for libertarians.  I’ve noticed in your writings that your libertarianism seems to stem from an understanding that men is fallen, and that, therefore, it makes little sense to allow a fallen man to lord it over his fellow creatures.  This was largely my take, too, but thanks to Voxiversity, I’ve been reading my Rothbard.  Since voluntary exchange benefits both parties, free trade between two people is a good which should be extended as far and wide as possible.</p><p>This is not to say tariffs are always wrong.  As Ilana Mercer pointed out in last week’s column, a revenue tariff on all goods would be a reasonable way to fund a minimal state.  But free trade itself remains sound.</p></blockquote><p>There are two significant errors here that render EJ’s criticism invalid.  The first flaw is this erroneous simplification. <i>“The only time this isn’t true is if every need has already been satisfied and there is absolutely no other task that the old man can do.”</i></p><p>The proper formulation would have been as follows: “It isn’t true whenever there is no other need that the old man is not only capable of satisfying, but willing to satisfy in return for the compensation that he is offered in return.”  It is irrelevant to argue that all needs have not been met in the world; the old man on his desert island has no ability to meet the needs of a hungry child in Somalia and the meager compensation he is offered for collecting sea shells may be insufficient to move him to collect them.</p><p>Furthermore, there may be no demand for the services he can supply.  The bankruptcy of Say’s Law can be seen in the way the old man’s ability to donate sperm to his nubile female castaways in no way creates any demand for the product.  In much the same way, the international market for American workers whose only skills concern filling out paperwork for regulatory compliance and creating Powerpoint demonstrations is extremely limited.</p><p>The second and much more serious error is in the statement that “voluntary exchange benefits both parties”.  This is both logically and empirically false because it posits a non-existent human rationalism without temporal limits.  While it is true that value is subjective, thereby allowing the possibility to defend totally irrational actions as at least nominally rational, this still doesn’t avoid the problem of how the subjective values that the Misean acting man assigns are necessarily momentary in nature.  What the acting man defines as a beneficial exchange at one moment he may very well not define as beneficial in the very next moment for a wide variety of reasons.  And it is this fatal flaw in the logical foundation that causes the entire edifice in support of free trade to collapse.</p></div>",
  "content_text": "EJ takes exception to my previous post critiquing Ricardian comparative advantage:\nI have to disagree with you regarding free trade.\nYou write:\n“This example assumes that there is something that the old man can do that is of value to the young man. But that’s not necessarily true. What if instead of 2 people, there are 20 and all the old man can usefully do is gather 5 coconuts a day when two young girls with no other useful skills can gather 100, more than the castaway society needs, in the same time? Yes, total production will increase +5, but so what? No one is going to give him anything for his worthless coconuts because there is already a coconut glut thanks to the highly productive young girls. Austrian-savvy individuals should be able to see the seeds of an Austrian critique of Ricardo here.”\nYour example fails to take into account that there are always other needs to be satisfied, needs which require other goods beside coconuts.  Either the old man or the young girls can, for instance, gather berries, help build a hut, etc.  Ricardo is right in that, by shifting the old man’s production into that which he does comparatively best, society benefits.  The only time this isn’t true is if every need has already been satisfied and there is absolutely no other task that the old man can do.  Your assumption strikes me as an unwarranted; it is certainly not true that all needs have been met in the world we live in.\nRicardo’s discovery has astounding consequences for libertarians.  I’ve noticed in your writings that your libertarianism seems to stem from an understanding that men is fallen, and that, therefore, it makes little sense to allow a fallen man to lord it over his fellow creatures.  This was largely my take, too, but thanks to Voxiversity, I’ve been reading my Rothbard.  Since voluntary exchange benefits both parties, free trade between two people is a good which should be extended as far and wide as possible.\nThis is not to say tariffs are always wrong.  As Ilana Mercer pointed out in last week’s column, a revenue tariff on all goods would be a reasonable way to fund a minimal state.  But free trade itself remains sound.\nThere are two significant errors here that render EJ’s criticism invalid.  The first flaw is this erroneous simplification.\n“The only time this isn’t true is if every need has already been satisfied and there is absolutely no other task that the old man can do.”\nThe proper formulation would have been as follows: “It isn’t true whenever there is no other need that the old man is not only capable of satisfying, but willing to satisfy in return for the compensation that he is offered in return.”  It is irrelevant to argue that all needs have not been met in the world; the old man on his desert island has no ability to meet the needs of a hungry child in Somalia and the meager compensation he is offered for collecting sea shells may be insufficient to move him to collect them.\nFurthermore, there may be no demand for the services he can supply.  The bankruptcy of Say’s Law can be seen in the way the old man’s ability to donate sperm to his nubile female castaways in no way creates any demand for the product.  In much the same way, the international market for American workers whose only skills concern filling out paperwork for regulatory compliance and creating Powerpoint demonstrations is extremely limited.\nThe second and much more serious error is in the statement that “voluntary exchange benefits both parties”.  This is both logically and empirically false because it posits a non-existent human rationalism without temporal limits.  While it is true that value is subjective, thereby allowing the possibility to defend totally irrational actions as at least nominally rational, this still doesn’t avoid the problem of how the subjective values that the Misean acting man assigns are necessarily momentary in nature.  What the acting man defines as a beneficial exchange at one moment he may very well not define as beneficial in the very next moment for a wide variety of reasons.  And it is this fatal flaw in the logical foundation that causes the entire edifice in support of free trade to collapse.",
  "tags": [
    "economics",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-16T13:15:00+00:00"
}