{
  "url": "https://voxday.net/2010/09/12/mailvox-decline-of-broadway/",
  "scraped_at": "2026-01-08T23:37:13.437960",
  "title": "Mailvox: the decline of Broadway",
  "date_display": "September 12, 2010",
  "date_iso": "2010-09-12T09:31:00+00:00",
  "date_from_url": "2010-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CB has a request:</p><blockquote><p>I’ve seen you mention several times before how gays have killed Broadway. I recently mentioned that to someone who jumped down my throat about being ‘ignorant’ and ‘homophobic’ and the other crap liberals throw at people. I was wondering if you knew any articles or statistics to throw back at him to shut him up. I mean I have no raw data to confirm it, it just seems observably true. Like the sky being blue. Got anything more concrete I could hit him with. I’d love to shut him up.</p></blockquote><p>It’s easy enough.  According to <a href=\"http://www.broadwayleague.com/index.php?url_identifier=season-by-season-stats-1\">The Broadway League</a>, there were 39 shows running a combined 1,070 weeks that sold 8.4 million tickets in the 1989-1990 season.  That is 7,850 tickets sold per show-week.  In the 1999-2000 season, there were 37 shows running a combined 1,460 weeks that sold 11.38 million tickets.  That is 7,794 tickets sold per show-week.  In the 2009-2010 season, 39 shows ran a combined 1,464 weeks resulting in 8,121 <i>tickets</i> per show-week.</p><p>So, despite a 24% increase in the US population over the last 20 years, Broadway attendance has remained relatively flat.  Consider the stock market and the housing market by way of comparison; it would be considered an epic disaster if the Dow returned to its January 1990 level of 2,707 (now 10,463) or the Case-Shiller index returned to its January 1990 level of 75.58 (now 138.03).  Broadway’s gross revenues have increased 106% in inflation-adjusted dollars over the last two decades, which is why the superficial observer is likely to erroneously conclude that it is in good shape, but it must be kept in mind that this increase is primarily the result of a 45% increase in show-weeks and therefore gross costs as well.</p><p>However, the situation is almost certainly somewhat worse than it looks.  The reason is that the 2009-2010 statistics are exaggerated due to a recent change from “Net Gross” to “Gross Gross” and “Paid Attendance” to “Total Attendance”.  Hence the change from “tickets sold” to “tickets” in the 2009-2010 season.  During the 2008-2009 season, for which the previous statistical metric remained relevant, tickets sold per show week were already flat at 7,848.  That means Broadway required ten percent more shows and 478 more show-weeks than the 1989-1990 season in order to stay even on average paid attendance.</p><p>One can, of course, quite reasonably argue that there are other factors involved in causing this 20-year attendance stasis, but there can be no argument that stasis and <i>relative</i> decline do not exist.  And given this, there can be little doubt that the content, particularly the increasingly homo-esoteric nature of it that appears to have begun in earnest in 1991 with the premiere of Tony Kushner’s <i>Angels in America: A Gay Fantasia in National Themes</i>, is one of the significant causal factors.</p></div>",
  "content_text": "CB has a request:\nI’ve seen you mention several times before how gays have killed Broadway. I recently mentioned that to someone who jumped down my throat about being ‘ignorant’ and ‘homophobic’ and the other crap liberals throw at people. I was wondering if you knew any articles or statistics to throw back at him to shut him up. I mean I have no raw data to confirm it, it just seems observably true. Like the sky being blue. Got anything more concrete I could hit him with. I’d love to shut him up.\nIt’s easy enough.  According to\nThe Broadway League\n, there were 39 shows running a combined 1,070 weeks that sold 8.4 million tickets in the 1989-1990 season.  That is 7,850 tickets sold per show-week.  In the 1999-2000 season, there were 37 shows running a combined 1,460 weeks that sold 11.38 million tickets.  That is 7,794 tickets sold per show-week.  In the 2009-2010 season, 39 shows ran a combined 1,464 weeks resulting in 8,121\ntickets\nper show-week.\nSo, despite a 24% increase in the US population over the last 20 years, Broadway attendance has remained relatively flat.  Consider the stock market and the housing market by way of comparison; it would be considered an epic disaster if the Dow returned to its January 1990 level of 2,707 (now 10,463) or the Case-Shiller index returned to its January 1990 level of 75.58 (now 138.03).  Broadway’s gross revenues have increased 106% in inflation-adjusted dollars over the last two decades, which is why the superficial observer is likely to erroneously conclude that it is in good shape, but it must be kept in mind that this increase is primarily the result of a 45% increase in show-weeks and therefore gross costs as well.\nHowever, the situation is almost certainly somewhat worse than it looks.  The reason is that the 2009-2010 statistics are exaggerated due to a recent change from “Net Gross” to “Gross Gross” and “Paid Attendance” to “Total Attendance”.  Hence the change from “tickets sold” to “tickets” in the 2009-2010 season.  During the 2008-2009 season, for which the previous statistical metric remained relevant, tickets sold per show week were already flat at 7,848.  That means Broadway required ten percent more shows and 478 more show-weeks than the 1989-1990 season in order to stay even on average paid attendance.\nOne can, of course, quite reasonably argue that there are other factors involved in causing this 20-year attendance stasis, but there can be no argument that stasis and\nrelative\ndecline do not exist.  And given this, there can be little doubt that the content, particularly the increasingly homo-esoteric nature of it that appears to have begun in earnest in 1991 with the premiere of Tony Kushner’s\nAngels in America: A Gay Fantasia in National Themes\n, is one of the significant causal factors.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-12T08:31:00+00:00"
}