{
  "url": "https://voxday.net/2010/09/14/mailvox-praxeology-and-free-trade/",
  "scraped_at": "2026-01-08T23:37:26.306037",
  "title": "Mailvox: praxeology and free trade",
  "date_display": "September 14, 2010",
  "date_iso": "2010-09-14T19:55:00+00:00",
  "date_from_url": "2010-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>S asks about reconciling trade barriers with distrust of government:</p><blockquote><p>as always, great work with the blog. I’m a big fan of your writing on economics, especially when applying Austrian theory to show how badly Keynesians misunderstand the subject. As such, I was hoping to ask you for some clarification regarding free trade. I read your book, <i>The Return of the Great Depression</i>, and found your comments on free trade rather interesting. (It’s been 9 months since I read the book so I apologise if I misrepresent any of your arguments.)</p><p>If I understand what you write correctly, it seems that the paradigm of comparative advantage espoused by Ricardo and his intellectual descendants doesn’t really make sense because of what you characterise as “the n-body problem”. In other words comparative advantage might work when dealing with two isolated counterparties, but what works for two entities does not necessarily work for three or more because of the exponentially increasing complexities introduced by additional trading entities. On this basis, you argue that a policy of unrestricted free trade doesn’t make any sense from a theoretical or practical perspective.</p><p>Here’s my question: given that the conclusions of praxeology generally argue that government intervention is a bad idea, how can this be consistent with a policy of government intervention in trade using tariffs to support specific industries or the general economy?</p><p>I’ve been trying to figure this out for a while. The articles at Mises.org generally reference Ricardo’s theory to support their arguments even though Ricardo wasn’t an Austrian theorist. Then there’s this article which makes a lot of interesting points in favour of protectionism, even though it’s written by a guy who is a Keynesian (as far as I can tell). What are your thoughts on the “correct” policy regarding trade?</p></blockquote><p>There are three ways to consider the problem.  We can look at it logically, we can look at it empirically, and we can look at it historically.  The Ricardian position fails by all three metrics, in part because there is an inherent fallacy in your observed dichotomy.  To observe that government is always inefficient and to mistrust its application of power is not synonymous with saying that there is absolutely no role for national governments.  Libertarian minarchy is neither anarchy nor the U.S. Constitution, but I think it is worthwhile to note that protecting the borders and funding itself through tariffs are two of the very few genuine powers that the U.S. Constitution grants the federal government.</p><p>It is a very odd and perverted form of American conservatism that supports democracy-building on the other side of the globe, but argues against American industry-protecting import duties.</p><p>But that’s a tangent.  Getting back to the logical angle, the Ricardian notion of comparative advantage completely fails because it is too focused on the TOTAL production rather than the nation-specific production or the effects on a nation of being forced to exchange its manufacturing from one set of goods to another.  But the biggest problem is that because it relies on a labor theory of value, it fails to take demand, much less the limits of demand, into account.  Furthermore, being a pre-industrial concept, comaprative advantage simply does not envision that a nation could possibly have <i>nothing</i> to physically produce that is considered worthy of trade. Consider the Wikipedia example.</p><p><i>Two men live alone on an isolated island. To survive they must undertake a few basic economic activities like water carrying, fishing, cooking and shelter construction and maintenance. The first man is young, strong, and educated. He is also faster, better, and more productive at everything. He has an absolute advantage in all activities. The second man is old, weak, and uneducated. He has an absolute disadvantage in all economic activities. In some activities the difference between the two is great; in others it is small.</i></p><p>Despite the fact that the younger man has absolute advantage in all activities, it is not in the interest of either of them to work in isolation since they both can benefit from specialization and exchange. If the two men divide the work according to comparative advantage then the young man will specialize in tasks at which he is most productive, while the older man will concentrate on tasks where his productivity is only a little less than that of the young man. Such an arrangement will increase total production for a given amount of labor supplied by both men and it will benefit both of them.</p><p>This example assumes that there is something that the old man can do that is of value to the young man.  But that’s not necessarily true.  What if instead of 2 people, there are 20 and all the old man can usefully do is gather 5 coconuts a day when two young girls with no other useful skills can gather 100, more than the castaway society needs, in the same time?  Yes, total production will increase +5, but so what?  No one is going to give him anything for his worthless coconuts because there is already a coconut glut thanks to the highly productive young girls.  Austrian-savvy individuals should be able to see the seeds of an Austrian critique of Ricardo here.</p><p>Anyhow, that’s just a superficial first pass at the intrinsic logical flaw of Ricardian comparative advantage.  More on the empirical and historical flaws as well as the government question in future posts.</p></div>",
  "content_text": "S asks about reconciling trade barriers with distrust of government:\nas always, great work with the blog. I’m a big fan of your writing on economics, especially when applying Austrian theory to show how badly Keynesians misunderstand the subject. As such, I was hoping to ask you for some clarification regarding free trade. I read your book,\nThe Return of the Great Depression\n, and found your comments on free trade rather interesting. (It’s been 9 months since I read the book so I apologise if I misrepresent any of your arguments.)\nIf I understand what you write correctly, it seems that the paradigm of comparative advantage espoused by Ricardo and his intellectual descendants doesn’t really make sense because of what you characterise as “the n-body problem”. In other words comparative advantage might work when dealing with two isolated counterparties, but what works for two entities does not necessarily work for three or more because of the exponentially increasing complexities introduced by additional trading entities. On this basis, you argue that a policy of unrestricted free trade doesn’t make any sense from a theoretical or practical perspective.\nHere’s my question: given that the conclusions of praxeology generally argue that government intervention is a bad idea, how can this be consistent with a policy of government intervention in trade using tariffs to support specific industries or the general economy?\nI’ve been trying to figure this out for a while. The articles at Mises.org generally reference Ricardo’s theory to support their arguments even though Ricardo wasn’t an Austrian theorist. Then there’s this article which makes a lot of interesting points in favour of protectionism, even though it’s written by a guy who is a Keynesian (as far as I can tell). What are your thoughts on the “correct” policy regarding trade?\nThere are three ways to consider the problem.  We can look at it logically, we can look at it empirically, and we can look at it historically.  The Ricardian position fails by all three metrics, in part because there is an inherent fallacy in your observed dichotomy.  To observe that government is always inefficient and to mistrust its application of power is not synonymous with saying that there is absolutely no role for national governments.  Libertarian minarchy is neither anarchy nor the U.S. Constitution, but I think it is worthwhile to note that protecting the borders and funding itself through tariffs are two of the very few genuine powers that the U.S. Constitution grants the federal government.\nIt is a very odd and perverted form of American conservatism that supports democracy-building on the other side of the globe, but argues against American industry-protecting import duties.\nBut that’s a tangent.  Getting back to the logical angle, the Ricardian notion of comparative advantage completely fails because it is too focused on the TOTAL production rather than the nation-specific production or the effects on a nation of being forced to exchange its manufacturing from one set of goods to another.  But the biggest problem is that because it relies on a labor theory of value, it fails to take demand, much less the limits of demand, into account.  Furthermore, being a pre-industrial concept, comaprative advantage simply does not envision that a nation could possibly have\nnothing\nto physically produce that is considered worthy of trade. Consider the Wikipedia example.\nTwo men live alone on an isolated island. To survive they must undertake a few basic economic activities like water carrying, fishing, cooking and shelter construction and maintenance. The first man is young, strong, and educated. He is also faster, better, and more productive at everything. He has an absolute advantage in all activities. The second man is old, weak, and uneducated. He has an absolute disadvantage in all economic activities. In some activities the difference between the two is great; in others it is small.\nDespite the fact that the younger man has absolute advantage in all activities, it is not in the interest of either of them to work in isolation since they both can benefit from specialization and exchange. If the two men divide the work according to comparative advantage then the young man will specialize in tasks at which he is most productive, while the older man will concentrate on tasks where his productivity is only a little less than that of the young man. Such an arrangement will increase total production for a given amount of labor supplied by both men and it will benefit both of them.\nThis example assumes that there is something that the old man can do that is of value to the young man.  But that’s not necessarily true.  What if instead of 2 people, there are 20 and all the old man can usefully do is gather 5 coconuts a day when two young girls with no other useful skills can gather 100, more than the castaway society needs, in the same time?  Yes, total production will increase +5, but so what?  No one is going to give him anything for his worthless coconuts because there is already a coconut glut thanks to the highly productive young girls.  Austrian-savvy individuals should be able to see the seeds of an Austrian critique of Ricardo here.\nAnyhow, that’s just a superficial first pass at the intrinsic logical flaw of Ricardian comparative advantage.  More on the empirical and historical flaws as well as the government question in future posts.",
  "tags": [
    "economics",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-14T18:55:00+00:00"
}