{
  "url": "https://voxday.net/2010/09/30/nro-endorses-assassinating-americans_30/",
  "scraped_at": "2026-01-08T23:38:37.987442",
  "title": "NRO endorses assassinating Americans",
  "date_display": "September 30, 2010",
  "date_iso": "2010-09-30T19:15:00+00:00",
  "date_from_url": "2010-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am not a conservative.  I am a Christian libertarian technodemocrat.  But if <a href=\"http://www.nationalreview.com/corner/248276/re-assassination-andrew-c-mccarthy\">this is what is actually supposed to pass for conservative opinion leadership</a> at a leading conservative publication, it’s no wonder that the Tea Partiers are abandoning both the Republican Party and the conservative media:</p><blockquote><p>The Obama administration is not, by authorizing Awlaki’s assassination, green-lighting his killing under all conceivable circumstances. The administration, I suspect, is just making sure that if he’s found congregating in a sanctuary with other terrorists, we can bomb the sanctuary — we don’t have to forfeit a worthy military operation just because one of the terrorists happens to be an American citizen. But if he’s found under other circumstances, where there is no demonstrable military value in killing him, he will be captured, held, interrogated (one hopes), and tried — either by a civilian or (I would hope) a military court.</p><p>This seems like common sense to me. The unfortunate thing is that the assassination authorization should never have been made public. Clearly, the administration leaked it to underscore the president’s willingness to fight al-Qaeda aggressively. All the leak has done, though, is cause unnecessary legal headaches. If the administration had handled this top-secret authorization appropriately, chances are: Awlaki would, at some point, have been either killed or captured; the attendant circumstances would have made it obvious why the option chosen (kill or capture) was chosen; and no one would ever have thought to ask whether Obama had authorized his assassination.</p></blockquote><p>In other words, McCarthy is just fine with passing laws that <i>authorize the government murder of its own citizens</i> because it happens to be politically unviable at the moment.  This is deeply, profoundly, and abysmally stupid.  It is insane.  And there is literally nothing conservative, in the American political sense of the word, about it.</p><p>If I were the editor of NRO, I would fire McCarthy on the spot for this defense of legalizing government murder.</p><p>His argument is risibly incompetent and not only depends entirely upon the transient nature of temporal politics but also upon what he imagines Obama’s reasoning behind the assassination authorization to be.  McCarthy writes: “We are a political society, not a legal one. The executive branch typically has vast legal authority, but its exercise of that authority is hemmed in — thank goodness — by politics.”</p><p>Ergo, under his reasoning, once it becomes politically popular to murder certain American citizens en masse, it will be legal to do so.  This isn’t merely madness, it is the familiar route to the guillotine, the gulag, and the gas chamber.  To make this argument while simultaneously claiming to wear the mantle of Edmund Burke, among others, is a grotesque offense to reason, history, and conservatism itself.</p><p>If Awlaki is genuinely a traitor, the correct Constitutional thing to do is to arrest him, put him on trial for treason, and then execute him.  The fact that the Obama administration is openly attempting to omit the first two steps <i>with the support of the conservative and mainstream media alike</i> is an indication of how completely lawless both the United States government and its lapdog media have become.</p><p>UPDATE: McCarthy isn’t the only NROcon to cheer on Obama’s American citizen assassination policy.  David French writes: <i>“We need to stop incentivizing enemy violations of the laws of war, and one way to do that is to find them and capture or kill them no matter their location, no matter their clothing, and no matter their nationality.”</i></p><p>He also attempts to claim that it’s not “assassination” so long as the person assassinated is an enemy.  Which, no doubt, would be news to Abraham Lincoln, among others.  And William F. Buckley wept.</p></div>",
  "content_text": "I am not a conservative.  I am a Christian libertarian technodemocrat.  But if\nthis is what is actually supposed to pass for conservative opinion leadership\nat a leading conservative publication, it’s no wonder that the Tea Partiers are abandoning both the Republican Party and the conservative media:\nThe Obama administration is not, by authorizing Awlaki’s assassination, green-lighting his killing under all conceivable circumstances. The administration, I suspect, is just making sure that if he’s found congregating in a sanctuary with other terrorists, we can bomb the sanctuary — we don’t have to forfeit a worthy military operation just because one of the terrorists happens to be an American citizen. But if he’s found under other circumstances, where there is no demonstrable military value in killing him, he will be captured, held, interrogated (one hopes), and tried — either by a civilian or (I would hope) a military court.\nThis seems like common sense to me. The unfortunate thing is that the assassination authorization should never have been made public. Clearly, the administration leaked it to underscore the president’s willingness to fight al-Qaeda aggressively. All the leak has done, though, is cause unnecessary legal headaches. If the administration had handled this top-secret authorization appropriately, chances are: Awlaki would, at some point, have been either killed or captured; the attendant circumstances would have made it obvious why the option chosen (kill or capture) was chosen; and no one would ever have thought to ask whether Obama had authorized his assassination.\nIn other words, McCarthy is just fine with passing laws that\nauthorize the government murder of its own citizens\nbecause it happens to be politically unviable at the moment.  This is deeply, profoundly, and abysmally stupid.  It is insane.  And there is literally nothing conservative, in the American political sense of the word, about it.\nIf I were the editor of NRO, I would fire McCarthy on the spot for this defense of legalizing government murder.\nHis argument is risibly incompetent and not only depends entirely upon the transient nature of temporal politics but also upon what he imagines Obama’s reasoning behind the assassination authorization to be.  McCarthy writes: “We are a political society, not a legal one. The executive branch typically has vast legal authority, but its exercise of that authority is hemmed in — thank goodness — by politics.”\nErgo, under his reasoning, once it becomes politically popular to murder certain American citizens en masse, it will be legal to do so.  This isn’t merely madness, it is the familiar route to the guillotine, the gulag, and the gas chamber.  To make this argument while simultaneously claiming to wear the mantle of Edmund Burke, among others, is a grotesque offense to reason, history, and conservatism itself.\nIf Awlaki is genuinely a traitor, the correct Constitutional thing to do is to arrest him, put him on trial for treason, and then execute him.  The fact that the Obama administration is openly attempting to omit the first two steps\nwith the support of the conservative and mainstream media alike\nis an indication of how completely lawless both the United States government and its lapdog media have become.\nUPDATE: McCarthy isn’t the only NROcon to cheer on Obama’s American citizen assassination policy.  David French writes:\n“We need to stop incentivizing enemy violations of the laws of war, and one way to do that is to find them and capture or kill them no matter their location, no matter their clothing, and no matter their nationality.”\nHe also attempts to claim that it’s not “assassination” so long as the person assassinated is an enemy.  Which, no doubt, would be news to Abraham Lincoln, among others.  And William F. Buckley wept.",
  "tags": [
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-30T18:15:00+00:00"
}