{
  "url": "https://voxday.net/2010/09/05/raw-on-new-atheists/",
  "scraped_at": "2026-01-08T23:36:36.743478",
  "title": "RAW on the New Atheists",
  "date_display": "September 5, 2010",
  "date_iso": "2010-09-05T13:04:00+00:00",
  "date_from_url": "2010-09-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This excerpt from <i>Prometheus Rising</i> is a surprisingly accurate portrayal of the Dawkinsian rational materialist, in light of how it was written by a non-theistic scientific mystic 27 years ago:</p><blockquote><p>Rationalist robots, like the other robots, may be totally mechanized or may have some slight flexibility, or “freedom” built into their circuitry.  The totally robotized make up the vast horde of the Fundamentalist wing of the Materialist church and the other True Believers in the scientific paradigm of 1968, 1958, 1948 or whenever their nervous systems stopped taking new imprints.</p><p>These are the people who are perpetually frightened and dismayed by the large portion of human behavior mediated through Circuit II mammalian politics.  They think that because this territorial-emotional (“patriotic”) behavior is not Rational, it should not exist.  They accept Darwin as dogma, but are nervous about “Darwinism” (because it accepts mammalian politics as an Evolutionary Strategy that has worked thus far) and are repulsed by the data of ethology, genetics, and sociobiology.  They don’t like the rest of the human race much, because it is not guided by their favorite circuit, and they are uneasily aware that the rest of the human race does not like <i>them</i> much….</p><p>The totally robotized Rationalist, the one whose nervous system has stopped growing entirely, can be recognized by two signs: He or she is constantly trying to prove that much of the daily experience of the rest of humanity is “delusion”, “hallucination”, “group hallucination”, “mass hallucination”, “mere coincidence”, or “sloppy research”.  And he or she never thinks that any of his or her own experience would fit into any of those categories.</p></blockquote><p>Substitute “religious” for “patriotic” and “religions” for “politics” and he could have written that today.</p></div>",
  "content_text": "This excerpt from\nPrometheus Rising\nis a surprisingly accurate portrayal of the Dawkinsian rational materialist, in light of how it was written by a non-theistic scientific mystic 27 years ago:\nRationalist robots, like the other robots, may be totally mechanized or may have some slight flexibility, or “freedom” built into their circuitry.  The totally robotized make up the vast horde of the Fundamentalist wing of the Materialist church and the other True Believers in the scientific paradigm of 1968, 1958, 1948 or whenever their nervous systems stopped taking new imprints.\nThese are the people who are perpetually frightened and dismayed by the large portion of human behavior mediated through Circuit II mammalian politics.  They think that because this territorial-emotional (“patriotic”) behavior is not Rational, it should not exist.  They accept Darwin as dogma, but are nervous about “Darwinism” (because it accepts mammalian politics as an Evolutionary Strategy that has worked thus far) and are repulsed by the data of ethology, genetics, and sociobiology.  They don’t like the rest of the human race much, because it is not guided by their favorite circuit, and they are uneasily aware that the rest of the human race does not like\nthem\nmuch….\nThe totally robotized Rationalist, the one whose nervous system has stopped growing entirely, can be recognized by two signs: He or she is constantly trying to prove that much of the daily experience of the rest of humanity is “delusion”, “hallucination”, “group hallucination”, “mass hallucination”, “mere coincidence”, or “sloppy research”.  And he or she never thinks that any of his or her own experience would fit into any of those categories.\nSubstitute “religious” for “patriotic” and “religions” for “politics” and he could have written that today.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-05T12:04:00+00:00"
}