{
  "url": "https://voxday.net/2010/09/15/rino-rage/",
  "scraped_at": "2026-01-08T23:37:29.984001",
  "title": "RINO rage",
  "date_display": "September 15, 2010",
  "date_iso": "2010-09-15T10:25:00+00:00",
  "date_from_url": "2010-09-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lest one think for even a fraction of one second that the professional Republican class, also known as “the Republican leadership”, has any genuine commitment to any ideological principles <a href=\"http://www.foxnews.com/politics/2010/09/14/hours-polls-close-gloves-come-delaware/\">beyond maintaining its own power and influence</a>:</p><blockquote><p>Party fractures on full display, Republican aides told Fox News Tuesday that O’Donnell would not be getting national fundraising support. State party leaders had warned that O’Donnell cannot compete against Democrat Chris Coons and vigorously backed Castle, a nine-term congressman and former governor….  Party leaders no doubt were looking at midterm polls that showed Castle leading Coons in November but O’Donnell trailing. The seat could be critical for Republicans hoping to gain control of the Senate. They need to pick up 10 seats to do so.</p></blockquote><p>The point, which both the Republican establishment and a significant portion of the conservative media either does not understand after the eight-year Bush administration debacle or simply will not accept, is that <i>it doesn’t matter if your party is in power if the representatives of that party are not ideologically reliable</i>.  If elected Republicans are simply going to behave like Democrats Lite in office, there is no reason for conservatives to elect them.  None.</p><p>Lenin was correct in ascertaining that sometimes things have to get worse before they can get better.  The conservative movement is in much stronger shape due to Barack Obama-Soetoro-Sobarkah’s election that it would have been if the RINO McCain had been elected; McCain would have moved things about 50 percent as far to the left as Obama has, but would have ensured that more Democrats were elected to the House and Senate this fall rather than the incipient Democratic drubbing that is in the making.  The reason <a href=\"http://hotair.com/archives/2010/09/14/quotes-of-the-day-453/\">they would rather lose to a Democrat</a> than see a genuinely conservative Republican get elected is because the former doesn’t threaten their long-term dominance over the party.</p><p>There are two flaws with the pragmatic approach.  First, its analysis is always static and fails to recognize that the electorate responds to political dynamism.  Second, it is an inept strategy that by its very nature prevents reaching the nominal objectives.</p><p>As the Instapundit reader commented: <i>“It’s not enough, seemingly, to vote these people out. We have to stomp on them for them to get the message.”</i></p></div>",
  "content_text": "Lest one think for even a fraction of one second that the professional Republican class, also known as “the Republican leadership”, has any genuine commitment to any ideological principles\nbeyond maintaining its own power and influence\n:\nParty fractures on full display, Republican aides told Fox News Tuesday that O’Donnell would not be getting national fundraising support. State party leaders had warned that O’Donnell cannot compete against Democrat Chris Coons and vigorously backed Castle, a nine-term congressman and former governor….  Party leaders no doubt were looking at midterm polls that showed Castle leading Coons in November but O’Donnell trailing. The seat could be critical for Republicans hoping to gain control of the Senate. They need to pick up 10 seats to do so.\nThe point, which both the Republican establishment and a significant portion of the conservative media either does not understand after the eight-year Bush administration debacle or simply will not accept, is that\nit doesn’t matter if your party is in power if the representatives of that party are not ideologically reliable\n.  If elected Republicans are simply going to behave like Democrats Lite in office, there is no reason for conservatives to elect them.  None.\nLenin was correct in ascertaining that sometimes things have to get worse before they can get better.  The conservative movement is in much stronger shape due to Barack Obama-Soetoro-Sobarkah’s election that it would have been if the RINO McCain had been elected; McCain would have moved things about 50 percent as far to the left as Obama has, but would have ensured that more Democrats were elected to the House and Senate this fall rather than the incipient Democratic drubbing that is in the making.  The reason\nthey would rather lose to a Democrat\nthan see a genuinely conservative Republican get elected is because the former doesn’t threaten their long-term dominance over the party.\nThere are two flaws with the pragmatic approach.  First, its analysis is always static and fails to recognize that the electorate responds to political dynamism.  Second, it is an inept strategy that by its very nature prevents reaching the nominal objectives.\nAs the Instapundit reader commented:\n“It’s not enough, seemingly, to vote these people out. We have to stomp on them for them to get the message.”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-15T09:25:00+00:00"
}