{
  "url": "https://voxday.net/2010/09/02/scientific-hypocrisy/",
  "scraped_at": "2026-01-08T23:36:16.239861",
  "title": "Scientific hypocrisy",
  "date_display": "September 2, 2010",
  "date_iso": "2010-09-02T07:40:00+00:00",
  "date_from_url": "2010-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always enjoy the way atheist science fetishists who believe firmly in the scientific method as the sole arbiter of Truth simultaneously insist that they don’t have to read a book in order to reach conclusions about it.  So much for their supposed preference of observation to logic.  Catkiller challenged an atheist named Maxpower to read <i>The Irrational Atheist</i> and <a href=\"http://www.rightnation.us/forums/index.php?s=d49664fb257e1a8d20737099f8f07850&amp;autocom=blog&amp;blogid=7&amp;showentry=4598&amp;&amp;st=20\">this was the unsurprising <i>ad hominem</i> response</a>:</p><blockquote><p>I have not read the book (I prefer books like “The Science of Good and Evil” by Michael Shermer), but I did peruse the blog of the man who wrote The Irrational Atheist and read through some arguments he’s put forth. Since you’ve previously referred me to such nonsense as Jonah Goldberg, I should have expected some pretty poor arguments and old, tired fallacies that often turn up in theism-vs-atheism discussions, but I was particularly disappointed by the nutcase you’ve held up as your trump card this time. Here is what I have learned based on what I have read about and by Vox Day:</p><p>– He is a writer for World Net Daily, a fringe extremist website one step above Prison Planet or StormFront<br> – He appears to be a birther, an anti-feminist, and even opposes womens’ suffrage<br> – Oh, he also seems to be a white supremacist <br> – He has argued that Sam Harris is more immoral than Jeffrey Dahmer, which is a mind-boggling statement<br> – He appears to dispute the theory of evolution and the age of the earth<br> – He has stated that maybe “some” people don’t need God or the threat of punishment to be good, but he “certainly” does<br> – He has stated that, if commanded to do so by God, he would <a href=\"http://www.milobookclub.com/2007/02/12/mailvox-sharpening-knives/\">kill every 2-year-old on earth</a>.</br></br></br></br></br></br></p><p>This last part makes Vox Day a particularly dangerous brand of psychopath, since people often commit horrific acts when they mistakenly believe to have been ordered to do so by God. Parents who withhold medicine from dying children or who violently kill “possessed” children are prime examples. No atheist would have a reason for doing such a breathtakingly cruel thing.</p></blockquote><p>Well, <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2010/09/01/AR2010090103911.html?hpid=topnews\">this atheist</a> certainly would have if given the opportunity.  Consider <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2010/09/01/AR2010090103911.html?hpid=topnews\">his manifesto</a>: <i>“All programs on Discovery Health-TLC must stop encouraging the birth of any more parasitic human<br> infants and the false heroics behind those actions. In those programs’ places, programs encouraging human sterilization and infertility must be pushed….  Talk about Evolution. Talk about Malthus and Darwin until it sinks into the stupid people’s brains until they get it!!  The humans? The planet does not need humans. You MUST KNOW the human population is behind all the pollution and problems in the world, and YET you encourage the exact opposite instead of discouraging human growth and procreation.”</br></i></p><p>Atheists usually claim religion is behind all the problems in the world, but since they also believe religion is human-created, they are eventually forced to end up advocating mass murder of one form or another.  It would appear that Maxpower has forgotten the extraordinarily lethal behavior of a number of powerful, well-known atheists in dozens of countries during the 20th century.  The late James Lee may be unusual, but he is unfortunately no unique aberration.  The seed for mass slaughter is sown when atheists who share Lee’s faith in Malthus rather than the Apostle Paul and Darwin rather than the Gospels take positions of power.</p><p>By the way, the correct response to Maxpower’s question is that he hasn’t sufficiently understood what morality is to formulate a coherent question about it.  The threat of punishment from a supernatural deity is not a source of morality, let alone “the only ultimate” one.  Maxpower has done the metaphorical equivalent of confusing the possibility of a penalty flag for the NFL Competition Committee and the 32 NFL owners.  The ultimate source of morality is God, whose authority over Creation rests upon the fact of His being its Creator.  His game, His rules.  The threat of punishment is merely an incentive to abide by those rules and should never be confused with either the rules or the Rulegiver.</p></div>",
  "content_text": "I always enjoy the way atheist science fetishists who believe firmly in the scientific method as the sole arbiter of Truth simultaneously insist that they don’t have to read a book in order to reach conclusions about it.  So much for their supposed preference of observation to logic.  Catkiller challenged an atheist named Maxpower to read\nThe Irrational Atheist\nand\nthis was the unsurprising\nad hominem\nresponse\n:\nI have not read the book (I prefer books like “The Science of Good and Evil” by Michael Shermer), but I did peruse the blog of the man who wrote The Irrational Atheist and read through some arguments he’s put forth. Since you’ve previously referred me to such nonsense as Jonah Goldberg, I should have expected some pretty poor arguments and old, tired fallacies that often turn up in theism-vs-atheism discussions, but I was particularly disappointed by the nutcase you’ve held up as your trump card this time. Here is what I have learned based on what I have read about and by Vox Day:\n– He is a writer for World Net Daily, a fringe extremist website one step above Prison Planet or StormFront\n– He appears to be a birther, an anti-feminist, and even opposes womens’ suffrage\n– Oh, he also seems to be a white supremacist\n– He has argued that Sam Harris is more immoral than Jeffrey Dahmer, which is a mind-boggling statement\n– He appears to dispute the theory of evolution and the age of the earth\n– He has stated that maybe “some” people don’t need God or the threat of punishment to be good, but he “certainly” does\n– He has stated that, if commanded to do so by God, he would\nkill every 2-year-old on earth\n.\nThis last part makes Vox Day a particularly dangerous brand of psychopath, since people often commit horrific acts when they mistakenly believe to have been ordered to do so by God. Parents who withhold medicine from dying children or who violently kill “possessed” children are prime examples. No atheist would have a reason for doing such a breathtakingly cruel thing.\nWell,\nthis atheist\ncertainly would have if given the opportunity.  Consider\nhis manifesto\n:\n“All programs on Discovery Health-TLC must stop encouraging the birth of any more parasitic human\ninfants and the false heroics behind those actions. In those programs’ places, programs encouraging human sterilization and infertility must be pushed….  Talk about Evolution. Talk about Malthus and Darwin until it sinks into the stupid people’s brains until they get it!!  The humans? The planet does not need humans. You MUST KNOW the human population is behind all the pollution and problems in the world, and YET you encourage the exact opposite instead of discouraging human growth and procreation.”\nAtheists usually claim religion is behind all the problems in the world, but since they also believe religion is human-created, they are eventually forced to end up advocating mass murder of one form or another.  It would appear that Maxpower has forgotten the extraordinarily lethal behavior of a number of powerful, well-known atheists in dozens of countries during the 20th century.  The late James Lee may be unusual, but he is unfortunately no unique aberration.  The seed for mass slaughter is sown when atheists who share Lee’s faith in Malthus rather than the Apostle Paul and Darwin rather than the Gospels take positions of power.\nBy the way, the correct response to Maxpower’s question is that he hasn’t sufficiently understood what morality is to formulate a coherent question about it.  The threat of punishment from a supernatural deity is not a source of morality, let alone “the only ultimate” one.  Maxpower has done the metaphorical equivalent of confusing the possibility of a penalty flag for the NFL Competition Committee and the 32 NFL owners.  The ultimate source of morality is God, whose authority over Creation rests upon the fact of His being its Creator.  His game, His rules.  The threat of punishment is merely an incentive to abide by those rules and should never be confused with either the rules or the Rulegiver.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-02T06:40:00+00:00"
}