{
  "url": "https://voxday.net/2010/09/06/seven-years-off/",
  "scraped_at": "2026-01-08T23:36:42.186141",
  "title": "Seven Years Off",
  "date_display": "September 6, 2010",
  "date_iso": "2010-09-06T14:43:00+00:00",
  "date_from_url": "2010-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The first problem with <a href=\"http://www.nytimes.com/2010/09/06/opinion/06krugman.html?_r=2&amp;hp\">Paul Krugman’s hypothesis</a> is that 2010 is not 1938, it is 1931.  This should be obvious because at no point in the last two years has anyone except me, Robert Prechter, Mike Shedlock, Karl Denninger and a few other economic heretics admitted that we have been in a depression for months now.</p><blockquote><p>Here’s the situation: The U.S. economy has been crippled by a financial crisis. The president’s policies have limited the damage, but they were too cautious, and unemployment remains disastrously high. More action is clearly needed. Yet the public has soured on government activism, and seems poised to deal Democrats a severe defeat in the midterm elections.</p><p>The president in question is Franklin Delano Roosevelt; the year is 1938….</p><p>From an economic point of view World War II was, above all, a burst of deficit-financed government spending, on a scale that would never have been approved otherwise. Over the course of the war the federal government borrowed an amount equal to roughly twice the value of G.D.P. in 1940 — the equivalent of roughly $30 trillion today.</p><p>Had anyone proposed spending even a fraction that much before the war, people would have said the same things they’re saying today. They would have warned about crushing debt and runaway inflation. They would also have said, rightly, that the Depression was in large part caused by excess debt — and then have declared that it was impossible to fix this problem by issuing even more debt.</p><p>But guess what? Deficit spending created an economic boom — and the boom laid the foundation for long-run prosperity. Overall debt in the economy — public plus private — actually fell as a percentage of G.D.P., thanks to economic growth and, yes, some inflation, which reduced the real value of outstanding debts. And after the war, thanks to the improved financial position of the private sector, the economy was able to thrive without continuing deficits.</p></blockquote><p>The second problem here is that Krugman is making a standard <i>post hoc ergo propter hoc</i> mistake.  While the US did engage in a massive burst of unrestrained federal spending, it was not the spending that produced the postwar prosperity except in that it paid for the munitions and manpower that was used to destroy every industrialized economy that was not already destroyed by the Germans or the Japanese.</p><p>And the third problem, of course, is that the Keynesian notion that government spending is economic growth, let alone is capable of creating growth that is <i>a multiple</i> of the spending, is both logically and empirically false.  Remember, no one even began to recognize that the Great Depression was a great depression until the end of 1931.</p></div>",
  "content_text": "The first problem with\nPaul Krugman’s hypothesis\nis that 2010 is not 1938, it is 1931.  This should be obvious because at no point in the last two years has anyone except me, Robert Prechter, Mike Shedlock, Karl Denninger and a few other economic heretics admitted that we have been in a depression for months now.\nHere’s the situation: The U.S. economy has been crippled by a financial crisis. The president’s policies have limited the damage, but they were too cautious, and unemployment remains disastrously high. More action is clearly needed. Yet the public has soured on government activism, and seems poised to deal Democrats a severe defeat in the midterm elections.\nThe president in question is Franklin Delano Roosevelt; the year is 1938….\nFrom an economic point of view World War II was, above all, a burst of deficit-financed government spending, on a scale that would never have been approved otherwise. Over the course of the war the federal government borrowed an amount equal to roughly twice the value of G.D.P. in 1940 — the equivalent of roughly $30 trillion today.\nHad anyone proposed spending even a fraction that much before the war, people would have said the same things they’re saying today. They would have warned about crushing debt and runaway inflation. They would also have said, rightly, that the Depression was in large part caused by excess debt — and then have declared that it was impossible to fix this problem by issuing even more debt.\nBut guess what? Deficit spending created an economic boom — and the boom laid the foundation for long-run prosperity. Overall debt in the economy — public plus private — actually fell as a percentage of G.D.P., thanks to economic growth and, yes, some inflation, which reduced the real value of outstanding debts. And after the war, thanks to the improved financial position of the private sector, the economy was able to thrive without continuing deficits.\nThe second problem here is that Krugman is making a standard\npost hoc ergo propter hoc\nmistake.  While the US did engage in a massive burst of unrestrained federal spending, it was not the spending that produced the postwar prosperity except in that it paid for the munitions and manpower that was used to destroy every industrialized economy that was not already destroyed by the Germans or the Japanese.\nAnd the third problem, of course, is that the Keynesian notion that government spending is economic growth, let alone is capable of creating growth that is\na multiple\nof the spending, is both logically and empirically false.  Remember, no one even began to recognize that the Great Depression was a great depression until the end of 1931.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-06T13:43:00+00:00"
}