{
  "url": "https://voxday.net/2010/09/18/to-murder-and-to-lie/",
  "scraped_at": "2026-01-08T23:37:44.620378",
  "title": "To Murder and to Lie",
  "date_display": "September 18, 2010",
  "date_iso": "2010-09-18T00:00:00+00:00",
  "date_from_url": "2010-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Needless to say, we can be confident that all of the tapes and videotapes of <a href=\"http://pajamasmedia.com/blog/gunned-down-in-vegas-what-really-happened-to-erik-scott/\">the unprovoked shooting</a> are going to mysteriously vanish:</p><blockquote><p>Erik Scott was a West Point graduate, Army veteran, MBA graduate of Duke University, and a medical sales rep for Boston Scientific. He was gunned down by three Las Vegas police officers after they responded to a 911 call by Costco store employees reporting a man with a gun, possibly on narcotics, behaving erratically.</p><p>Scott was 38 years old, shopping with his girlfriend for items they needed as they moved in together. Unfortunately, those are the only details of the story on which anyone agrees.</p><p>To hear the side of the story presented by Scott’s family, friends, and some eyewitnesses, Erik Scott’s death was the result of ignorance and embellishment on the part of the Costco staff, and a combative, deterministic mindset from responding officers….</p><p>There are no commands or communications between Erik Scott and police captured on a nine-minute audiotape during which the shooting occurred. Officers not directly in front of the store are heard over the radio establishing a perimeter and trying to block off access to the store’s parking lot. The first indication Scott and the police have made contact is when a officer breaks in to call “shots fired” after Scott is on the ground, already dying or dead.</p></blockquote><p>It’s time for conservatives to wake up and realize that America’s jackbooted, militarized “law enforcement” thugs with badges and attitudes are not the friendly smalltown policemen of yore.  The police are far more of a problem than most of the “criminals” they affect to be saving everyone from.</p><p>And I’d like to hear those who will seriously attempt to argue that it was just the inherent stress and confusion of the job that caused the Las Vegas police to murder a military vet shopping at Costco with his girlfriend and then immediately initiate a coverup try to rationalize away the behavior of <a href=\"http://www.klewtv.com/news/local/102018443.html\">this brave brother officer</a>:</p><blockquote><p>A former Boise Police officer charged with sexually abusing several infants has been sentenced.  Stephen Young was sentenced to 25 years in prison on Wednesday. He’ll have to serve 12 and a half years before he’s eligible for parole. Young changed his plea in June from not guilty on four counts of lewd conduct to guilty of one count of sexual abuse of a minor.  That charge was for a victim between 14 and 18 months old.</p></blockquote><p>The fact is that the police are disproportionately sick and depraved individuals who get off on adrenaline and exercising power over others.  They are also psychologically weaker than the norm; those who believe the reason they have more failed marriages and commit more suicide than the norm is the stresses of the job have failed to consider the mindset of the average individual who wants to become a law enforcement officer.</p><p> UPDATE: The “stress and danger” faced by the policeman in the course of his job is massively exaggerated.  15 per 100,000 police <i>die</i> on the job, (even fewer are <i>killed</i>), which is 7.5% of the 200 per 100,000 fatality rate of the most dangerous occupation in the country, that of fisherman.  Loggers, airplane pilots, farmers and ranchers, roofers, ironworkers, sanitation workers, truckers and drivers, industrial machinists and construction workers all face more danger on the job than police do.  And nurses, EMTs, and doctors all see much worse human carnage than police do on a daily basis.</p><p>It should be reasonably easy to statistically demonstrate that the police are the psychologically weak individuals their bullying behavior suggests them to be.  If they have higher rates of suicide despite facing less danger than the more dangerous occupations and less stress than the emergency medical occupations, the logical conclusion will be that the problem is with the individuals who seek to become police rather than the nature of the job itself.</p></div>",
  "content_text": "Needless to say, we can be confident that all of the tapes and videotapes of\nthe unprovoked shooting\nare going to mysteriously vanish:\nErik Scott was a West Point graduate, Army veteran, MBA graduate of Duke University, and a medical sales rep for Boston Scientific. He was gunned down by three Las Vegas police officers after they responded to a 911 call by Costco store employees reporting a man with a gun, possibly on narcotics, behaving erratically.\nScott was 38 years old, shopping with his girlfriend for items they needed as they moved in together. Unfortunately, those are the only details of the story on which anyone agrees.\nTo hear the side of the story presented by Scott’s family, friends, and some eyewitnesses, Erik Scott’s death was the result of ignorance and embellishment on the part of the Costco staff, and a combative, deterministic mindset from responding officers….\nThere are no commands or communications between Erik Scott and police captured on a nine-minute audiotape during which the shooting occurred. Officers not directly in front of the store are heard over the radio establishing a perimeter and trying to block off access to the store’s parking lot. The first indication Scott and the police have made contact is when a officer breaks in to call “shots fired” after Scott is on the ground, already dying or dead.\nIt’s time for conservatives to wake up and realize that America’s jackbooted, militarized “law enforcement” thugs with badges and attitudes are not the friendly smalltown policemen of yore.  The police are far more of a problem than most of the “criminals” they affect to be saving everyone from.\nAnd I’d like to hear those who will seriously attempt to argue that it was just the inherent stress and confusion of the job that caused the Las Vegas police to murder a military vet shopping at Costco with his girlfriend and then immediately initiate a coverup try to rationalize away the behavior of\nthis brave brother officer\n:\nA former Boise Police officer charged with sexually abusing several infants has been sentenced.  Stephen Young was sentenced to 25 years in prison on Wednesday. He’ll have to serve 12 and a half years before he’s eligible for parole. Young changed his plea in June from not guilty on four counts of lewd conduct to guilty of one count of sexual abuse of a minor.  That charge was for a victim between 14 and 18 months old.\nThe fact is that the police are disproportionately sick and depraved individuals who get off on adrenaline and exercising power over others.  They are also psychologically weaker than the norm; those who believe the reason they have more failed marriages and commit more suicide than the norm is the stresses of the job have failed to consider the mindset of the average individual who wants to become a law enforcement officer.\nUPDATE: The “stress and danger” faced by the policeman in the course of his job is massively exaggerated.  15 per 100,000 police\ndie\non the job, (even fewer are\nkilled\n), which is 7.5% of the 200 per 100,000 fatality rate of the most dangerous occupation in the country, that of fisherman.  Loggers, airplane pilots, farmers and ranchers, roofers, ironworkers, sanitation workers, truckers and drivers, industrial machinists and construction workers all face more danger on the job than police do.  And nurses, EMTs, and doctors all see much worse human carnage than police do on a daily basis.\nIt should be reasonably easy to statistically demonstrate that the police are the psychologically weak individuals their bullying behavior suggests them to be.  If they have higher rates of suicide despite facing less danger than the more dangerous occupations and less stress than the emergency medical occupations, the logical conclusion will be that the problem is with the individuals who seek to become police rather than the nature of the job itself.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-17T23:00:00+00:00"
}