{
  "url": "https://voxday.net/2010/09/09/torture-is-illega/",
  "scraped_at": "2026-01-08T23:36:58.385648",
  "title": "Torture is illegal",
  "date_display": "September 9, 2010",
  "date_iso": "2010-09-09T20:15:00+00:00",
  "date_from_url": "2010-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But only <a href=\"http://www.nytimes.com/2010/09/09/us/09secrets.html\">if it isn’t secret</a>:</p><blockquote><p>A federal appeals court on Wednesday ruled that former prisoners of the C.I.A. could not sue over their alleged torture in overseas prisons because such a lawsuit might expose secret government information.  The sharply divided ruling was a major victory for the Obama administration’s efforts to advance a sweeping view of executive secrecy powers. It strengthens the White House’s hand as it has pushed an array of assertive counterterrorism policies, while raising an opportunity for the Supreme Court to rule for the first time in decades on the scope of the president’s power to restrict litigation that could reveal state secrets.</p></blockquote><p>If you don’t understand that the US has completely abandoned even the pretense of the rule of law by now, you’re probably not going to recognize it until either guillotines and/or pyres have been set up on the Mall or you find yourself in a detention camp.  This is a truly remarkable and totalitarian decision by the federal court.  It has declared that the mere <i>possibility</i> of exposing secret government information to the electorate – in a nominal democracy – trumps all of the unalienable rights endowed by the Creator and delineated in the Constitution.</p><p>It was a terrible mistake for the Supreme Court to create the abominable “state-secrets privilege” 50 years ago; this assertion of a privilege to secretly torture and assassinate  is merely the inevitable consequence of expanding the central state’s power to conceal its actions from the citizenry.</p></div>",
  "content_text": "But only\nif it isn’t secret\n:\nA federal appeals court on Wednesday ruled that former prisoners of the C.I.A. could not sue over their alleged torture in overseas prisons because such a lawsuit might expose secret government information.  The sharply divided ruling was a major victory for the Obama administration’s efforts to advance a sweeping view of executive secrecy powers. It strengthens the White House’s hand as it has pushed an array of assertive counterterrorism policies, while raising an opportunity for the Supreme Court to rule for the first time in decades on the scope of the president’s power to restrict litigation that could reveal state secrets.\nIf you don’t understand that the US has completely abandoned even the pretense of the rule of law by now, you’re probably not going to recognize it until either guillotines and/or pyres have been set up on the Mall or you find yourself in a detention camp.  This is a truly remarkable and totalitarian decision by the federal court.  It has declared that the mere\npossibility\nof exposing secret government information to the electorate – in a nominal democracy – trumps all of the unalienable rights endowed by the Creator and delineated in the Constitution.\nIt was a terrible mistake for the Supreme Court to create the abominable “state-secrets privilege” 50 years ago; this assertion of a privilege to secretly torture and assassinate  is merely the inevitable consequence of expanding the central state’s power to conceal its actions from the citizenry.",
  "tags": [
    "society",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-09-09T19:15:00+00:00"
}