{
  "url": "https://voxday.net/2006/10/03/gay-old-pedophiles/",
  "scraped_at": "2026-01-08T21:19:29.174520",
  "title": "Gay Old Pedophiles",
  "date_display": "October 3, 2006",
  "date_iso": "2006-10-03T14:43:00+00:00",
  "date_from_url": "2006-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As expected, a few statistically challenged gay men protested my use of the word pedophile in yesterday’s headline, despite the fact that I made use of the technically accurate term for Foley – ephebophile – in the column itself.  However, the queens doth protest too much, as a survey of the statistics from the Department of Justice for <a href=\"http://www.prevent-abuse-now.com/stats.htm#Substantiated\">substantiated sexual abuse</a> will show:</p><blockquote><p>Rate of sexual abuse by gender:<br> 1.7 victims per 1,000 female children<br> 0.4 victims per 1,000 male children.</br></br></p></blockquote><p>To keep things simple, we’ll put on our Pandagonian beret and assume that all sexual abuse is committed by men.  Defensive gays may look at these statistics and rightly claim that more heterosexual men sexually abuse children than homosexual men… but that is a futile attempt at sleight of hand because there are far more heterosexual men than homosexual men.</p><p>Since normal men outnumber gays by a factor of 49, one would expect there to be 19.6 victims per 1,000 female children, not 1.7.  So, while most gays are not pedophiles, the average gay man is approximately 11.5 times more likely to be a pedophile than the average normal man.</p><p>Of course, women do commit sexual abuse, but since they abuse both male and female children, the differential is not likely to change dramatically.</p><p>UPDATE: It appears that homosexual women are also disproportionately prone to commit child sexual abuse.  The data is sparse, but two different studies report that 53% and 65% of the underage victims of sexual abuse by women were female.  This supports my suspicion that the 11.5 percent ratio is unlikely to change much even with the blame properly apportioned to men and women alike.</p></div>",
  "content_text": "As expected, a few statistically challenged gay men protested my use of the word pedophile in yesterday’s headline, despite the fact that I made use of the technically accurate term for Foley – ephebophile – in the column itself.  However, the queens doth protest too much, as a survey of the statistics from the Department of Justice for\nsubstantiated sexual abuse\nwill show:\nRate of sexual abuse by gender:\n1.7 victims per 1,000 female children\n0.4 victims per 1,000 male children.\nTo keep things simple, we’ll put on our Pandagonian beret and assume that all sexual abuse is committed by men.  Defensive gays may look at these statistics and rightly claim that more heterosexual men sexually abuse children than homosexual men… but that is a futile attempt at sleight of hand because there are far more heterosexual men than homosexual men.\nSince normal men outnumber gays by a factor of 49, one would expect there to be 19.6 victims per 1,000 female children, not 1.7.  So, while most gays are not pedophiles, the average gay man is approximately 11.5 times more likely to be a pedophile than the average normal man.\nOf course, women do commit sexual abuse, but since they abuse both male and female children, the differential is not likely to change dramatically.\nUPDATE: It appears that homosexual women are also disproportionately prone to commit child sexual abuse.  The data is sparse, but two different studies report that 53% and 65% of the underage victims of sexual abuse by women were female.  This supports my suspicion that the 11.5 percent ratio is unlikely to change much even with the blame properly apportioned to men and women alike.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-03T13:43:00+00:00"
}