{
  "url": "https://voxday.net/2006/10/20/getting-closer/",
  "scraped_at": "2026-01-08T21:21:02.903299",
  "title": "Getting closer",
  "date_display": "October 20, 2006",
  "date_iso": "2006-10-20T14:15:00+00:00",
  "date_from_url": "2006-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The more observant among you may have noticed that Rowena finished the cover of the forthcoming third novel.  We don’t have a ship date yet since it won’t be sent off to the printers for another week or two, but you can place pre-orders at <a href=\"http://www.kandbbooksellers.com/\">K&amp;B Booksellers</a>, which is the only place you’ll be able to buy it in the USA for the forseeable future.</p><p>In case you’re interested what the book is about, here’s the back cover text:</p><blockquote><p>There is war among the Fallen. As the dread daughter of Moloch cuts a broad swath through the demon princes of Europe, the long-conquered Faery Kingdom of Albion threatens to rise against its dark master. Treachery and intrigue are the order of the day as evil battles evil and jackals lurk amidst the shadows to devour the defeated.</p><p>And though the angels of the Most High God take no part in these Fallen struggles, they are well aware of the dangers they pose for the millions of souls over whom they watch. For Moloch’s fearsome spawn seeks nothing less than another fiery human holocaust.</p><p>But in places where angels may not tread, a mortal is not always forbidden entry….</p></blockquote><p>It’s no highfalutin’ romance between an intelligent, beautiful, independent woman and the ruggedly dangerous were-seal who respects her or anything, but it may be of some small interest to a few of you.</p><p>On a related note, the Original Cyberpunk <a href=\"http://rantingroom.blogspot.com/2006/10/department-of-shameless-self-promotion.html\">has an essay in the latest Smart Pop book</a>, this one devoted to CSI.  Since I have never seen the show in any of its various iterations, I have nothing to say about it, except that I’m sure the OC’s contribution will be the funniest of the bunch.</p></div>",
  "content_text": "The more observant among you may have noticed that Rowena finished the cover of the forthcoming third novel.  We don’t have a ship date yet since it won’t be sent off to the printers for another week or two, but you can place pre-orders at\nK&B Booksellers\n, which is the only place you’ll be able to buy it in the USA for the forseeable future.\nIn case you’re interested what the book is about, here’s the back cover text:\nThere is war among the Fallen. As the dread daughter of Moloch cuts a broad swath through the demon princes of Europe, the long-conquered Faery Kingdom of Albion threatens to rise against its dark master. Treachery and intrigue are the order of the day as evil battles evil and jackals lurk amidst the shadows to devour the defeated.\nAnd though the angels of the Most High God take no part in these Fallen struggles, they are well aware of the dangers they pose for the millions of souls over whom they watch. For Moloch’s fearsome spawn seeks nothing less than another fiery human holocaust.\nBut in places where angels may not tread, a mortal is not always forbidden entry….\nIt’s no highfalutin’ romance between an intelligent, beautiful, independent woman and the ruggedly dangerous were-seal who respects her or anything, but it may be of some small interest to a few of you.\nOn a related note, the Original Cyberpunk\nhas an essay in the latest Smart Pop book\n, this one devoted to CSI.  Since I have never seen the show in any of its various iterations, I have nothing to say about it, except that I’m sure the OC’s contribution will be the funniest of the bunch.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-20T13:15:00+00:00"
}