{
  "url": "https://voxday.net/2006/10/13/han-shot-firs/",
  "scraped_at": "2026-01-08T21:20:22.386033",
  "title": "Han shot first",
  "date_display": "October 13, 2006",
  "date_iso": "2006-10-13T09:26:00+00:00",
  "date_from_url": "2006-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My parents and their friends must have hated Star Wars.  Big Chilly and I had four birthday parties between us at which the party consisted of going to see Star Wars.  I loved it so much that when I saw it for the first time, I cried when it was over because I didn’t want it to end.</p><p>I don’t hate Star Wars now, I merely harbor mild contempt for the megafranchise and maintain a near total indifference to it.  I’ve seen Episode I once (on opening night), about a third of Episode II (on TV) and haven’t bothered to watch Episode III even though it was seemingly on satellite nearly every other night for the last six weeks.</p><p>I saw Star Wars more than fifteen times.  I saw The Empire Strikes Back three or four times.  I have seen the Return of the Jedi twice, once the first time around and once in preparation for the prequels.*  I know Episode I is called The Phantom Menace, but I don’t even know what the other two are called.  This indifference isn’t spawned by a dislike for the Star Wars universe, I still love X-Wing and TIE Fighter and played all the way through Dark Forces.</p><p>But the movies, which started so brilliantly, started to go downhill with the last Rebel starship fleeing from Hoth.  I never liked Yoda, was bored by the Han-Leia romance, and while the shocking revelation – I am your father – made up for the boring bits, I couldn’t believe how bad Jedi was.</p><p>Something had changed.  I found myself hoping Luke would leave Leia, (who looked scary, not sexy, in that harem-girl outfit), with Jabba the Hutt, and actively rooted against the Ewoks.  Unfortunately, their rocks and clubs proved too lethal for Stormtroopers whose precision had once been described as being lethal enough to serve as identification.</p><p>About the three prequels, the less said, the better.  Suffice it to say that if there were any tears in my eyes at the end of The Phantom Menace, they were of repressed laughter.</p><p>All that being said, I think <a href=\"http://www.scalzi.com/whatever/004532.html\">John Scalzi overstates his case</a> when he argues that Star Wars is not entertainment, that it is merely the obsessive myth-making of an autistic artisan moving pieces around a universe that exists only in his own mind.  After all, as one of his commenters points out, Lucas didn’t even know he was myth-making until Joseph Campbell told him he was after the first movie had been released.</p><p>And on a tangential note, I think Kristine Kathryn Rusch is generally correct but goes slightly wide of the mark <a href=\"http://www.asimovs.com/_issue_0612/thoughtexperiments.shtml\">in this essay</a>, which previously appeared in a Smart Pop book.  The science fiction and fantasy genre does have a serious problem derived from it being somewhat of a closed shop, but I argue that this stems primarily from the hostility towards Christianity in particular and religion in general possessed by so many genre writers, reviewers and editors.</p><p><a href=\"http://www.milobookclub.com/2005/11/28/cs-lewis-and-problem-of-religion-in/\">As I wrote in another Smart Pop essay</a>, one which appeared last year in Ben Bella’s Narnia book, this hostility not only lessens the genre’s mass appeal, but tends to significantly reduce its literary quality as well.  It is hard, after all, to produce transcendent art when one is filled with relentless hate for that which transcends the material.</p><p>Interestingly enough, I once proposed this essay for publication in the SFWA’s Bulletin.  The editor initially accepted the idea of an essay on the literary rejection of SF&amp;F, but rejected it before I’d even turned anything in when he learned that I attributed this rejection to secularist hostility towards religion leading towards the genre-wide disease of poor characterization and fatuous demi-moralism.</p><p>Speaking of Ben Bella, Mr. Yeffeth will be relieved to learn that I finished my 5,000-word essay on <em>Gesamtkunstwerk</em> and video games today.  Like my previous essay on the connection between Margaret Thatcher and Douglas Adams, it looks totally insane at first glance, but upon sufficient reflection one realizes there may be a genuine case for it.  Of course, the consumption of two or three Amaretto Bitters will aid in this process of holistic grokkery.</p><p>*<em>Watching the extended edition DVD of THE FELLOWSHIP OF THE RING right before going to see THE TWO TOWERS in the theatre was a great way to do it.  Unfortunately, I wasn’t around or Big Chilly and I would have watched both extended DVDs prior to seeing THE RETURN OF THE KING on opening night.</em></p><p>As a consolation prize, however, I did see ROTK on opening night with a group of Tolkein fanatics, every single one of whom was in costume.  It is the only time I have ever felt improperly attired while wearing an Armani suit.</p></div>",
  "content_text": "My parents and their friends must have hated Star Wars.  Big Chilly and I had four birthday parties between us at which the party consisted of going to see Star Wars.  I loved it so much that when I saw it for the first time, I cried when it was over because I didn’t want it to end.\nI don’t hate Star Wars now, I merely harbor mild contempt for the megafranchise and maintain a near total indifference to it.  I’ve seen Episode I once (on opening night), about a third of Episode II (on TV) and haven’t bothered to watch Episode III even though it was seemingly on satellite nearly every other night for the last six weeks.\nI saw Star Wars more than fifteen times.  I saw The Empire Strikes Back three or four times.  I have seen the Return of the Jedi twice, once the first time around and once in preparation for the prequels.*  I know Episode I is called The Phantom Menace, but I don’t even know what the other two are called.  This indifference isn’t spawned by a dislike for the Star Wars universe, I still love X-Wing and TIE Fighter and played all the way through Dark Forces.\nBut the movies, which started so brilliantly, started to go downhill with the last Rebel starship fleeing from Hoth.  I never liked Yoda, was bored by the Han-Leia romance, and while the shocking revelation – I am your father – made up for the boring bits, I couldn’t believe how bad Jedi was.\nSomething had changed.  I found myself hoping Luke would leave Leia, (who looked scary, not sexy, in that harem-girl outfit), with Jabba the Hutt, and actively rooted against the Ewoks.  Unfortunately, their rocks and clubs proved too lethal for Stormtroopers whose precision had once been described as being lethal enough to serve as identification.\nAbout the three prequels, the less said, the better.  Suffice it to say that if there were any tears in my eyes at the end of The Phantom Menace, they were of repressed laughter.\nAll that being said, I think\nJohn Scalzi overstates his case\nwhen he argues that Star Wars is not entertainment, that it is merely the obsessive myth-making of an autistic artisan moving pieces around a universe that exists only in his own mind.  After all, as one of his commenters points out, Lucas didn’t even know he was myth-making until Joseph Campbell told him he was after the first movie had been released.\nAnd on a tangential note, I think Kristine Kathryn Rusch is generally correct but goes slightly wide of the mark\nin this essay\n, which previously appeared in a Smart Pop book.  The science fiction and fantasy genre does have a serious problem derived from it being somewhat of a closed shop, but I argue that this stems primarily from the hostility towards Christianity in particular and religion in general possessed by so many genre writers, reviewers and editors.\nAs I wrote in another Smart Pop essay\n, one which appeared last year in Ben Bella’s Narnia book, this hostility not only lessens the genre’s mass appeal, but tends to significantly reduce its literary quality as well.  It is hard, after all, to produce transcendent art when one is filled with relentless hate for that which transcends the material.\nInterestingly enough, I once proposed this essay for publication in the SFWA’s Bulletin.  The editor initially accepted the idea of an essay on the literary rejection of SF&F, but rejected it before I’d even turned anything in when he learned that I attributed this rejection to secularist hostility towards religion leading towards the genre-wide disease of poor characterization and fatuous demi-moralism.\nSpeaking of Ben Bella, Mr. Yeffeth will be relieved to learn that I finished my 5,000-word essay on\nGesamtkunstwerk\nand video games today.  Like my previous essay on the connection between Margaret Thatcher and Douglas Adams, it looks totally insane at first glance, but upon sufficient reflection one realizes there may be a genuine case for it.  Of course, the consumption of two or three Amaretto Bitters will aid in this process of holistic grokkery.\n*\nWatching the extended edition DVD of THE FELLOWSHIP OF THE RING right before going to see THE TWO TOWERS in the theatre was a great way to do it.  Unfortunately, I wasn’t around or Big Chilly and I would have watched both extended DVDs prior to seeing THE RETURN OF THE KING on opening night.\nAs a consolation prize, however, I did see ROTK on opening night with a group of Tolkein fanatics, every single one of whom was in costume.  It is the only time I have ever felt improperly attired while wearing an Armani suit.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-13T08:26:00+00:00"
}