{
  "url": "https://voxday.net/2006/10/31/im-not-so-sure/",
  "scraped_at": "2026-01-08T21:22:01.221976",
  "title": "I’m not so sure",
  "date_display": "October 31, 2006",
  "date_iso": "2006-10-31T12:11:00+00:00",
  "date_from_url": "2006-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think John Scalzi is <a href=\"http://www.scalzi.com/whatever/004576.html\">three-quarters right on this</a>, but it’s not the slam dunk he thinks it is:</p><blockquote><p>This conspiracy against men is apparently aided and abetted by the author’s belief, expressed in his comment section, that the publishing industry doesn’t actually make money, nor apparently is intended to. Leaving aside the fact that this is an assertion which I suspect will come rather as a surprise to most of the editors and publishers I know, I’m not entirely sure I’m following the logic there. Publishing is controlled by women, and therefore it won’t publish work for men, and that’s why it doesn’t make money? Because it’s not supposed to make money, publishing is controlled by women, who won’t publish work for men? The dark feminist conspiracy won’t let men publish their work unless they check their testicles at the door, and enter the room bearing fruity drinks and amusing coupons for foot rubs? Something along those lines. It’s kind of confusing to me.</p></blockquote><p>I don’t think there’s any publishing conspiracy against men, myself, but that the sales numbers do tend to indicate that there may be too much female influence on decisions made regarding what will appeal to men.  Scalzi is right to suggest that a problem finding a publisher likely isn’t with the publishers in most cases, but then, how does he explain precisely the same complaint being voiced by bestselling authors Tucker Max and Maddox?</p><p>No woman who finds Tucker Max or Maddox offensive was ever going to sign them to write a book, (despite <a href=\"http://www.tuckermax.com/archives/entries/pictures_tattoo_6.phtml\">the ample proof</a> that at least Tucker’s female fans are among the most appreciative in the world), which is why “mainstream publishers would have nothing to do with them” according to the New York Times.  As Frank Kelly Rich points out, “it took the Web to help fratire get around the hang-ups of mainstream publishing houses that professed to be searching for the male equivalent of chick lit, but which were frightened when they actually saw what it looked like.”</p><p>Publishers usually kill a book it offends someone on the pub board, regardless of the sales projections.  That’s why I was paid off by a conservative publishing house that didn’t want to publish a book it had already signed and which the editors loved; the kill decision came two days after learning that I wasn’t intending to restrict my criticism to the left side of the political spectrum.  The sales projections were among the highest for any of the books they’d signed at that time, but they killed it anyway after having someone at Fox News examine the chapter on Bill O’Reilly.</p><p>As John may remember, there were also SFWAns who stated that I’d never get published at Tor due to my politically incorrect opinions about the dearth of women writing hard science fiction being discussed on Electrolyte.  (A moot point, since I’ve never been a big Tor fan.)  Now, I don’t know if it’s video games, the fact that men are more likely to circumvent the publishing system – I mostly read pirate ebooks on my Treo and don’t buy a physical book unless I wish to cast a financial vote of support for the author – or that increased female influence in publishing has had the unintended result of decreasing the appeal of modern fiction to men, but it seems something is causing men to buy less fiction than before.  Given that the same thing has happened in television, I suspect it’s mostly a combination of 1 and 3.</p><p>Still, none of this excuses a bad author’s failure to get published, and anyway, smart women in publishing will come to understand, if they don’t already, that no one can control the market.  If a void is created, that void will eventually be filled.  The ratings abuse of CNN by Fox News  has demonstrated how foolish it is to ignore the void; if the mainstream publishers won’t provide men with what they want, men will simply go elsewhere.</p><p>And it’s clear that mainstream publishing and the conventional book business is in trouble.  I didn’t even bother looking for a publisher to replace Pocket Books, I mean, what was the point?  In the time it would take to find a publisher, I could publish it myself and write another book.  And having been thrice rejected by pub boards after being specifically solicited by an editor, I won’t even talk to a publisher that approaches me anymore unless I’m speaking with the ultimate decision-maker.</p><p>The freedom is of self-publishing is great; instead of a stupid stock photo cover which I’m under pressure to approve, I have a fantastic Rowena cover painting and no one can tell me that I can’t release free PDB and PDF versions to the Net.  Maybe I won’t make any money on it, but so what?  Writing fiction is one of the least efficient means of producing income known to man, so you might as well embrace it as an interesting hobby instead of an income-producing career.</p></div>",
  "content_text": "I think John Scalzi is\nthree-quarters right on this\n, but it’s not the slam dunk he thinks it is:\nThis conspiracy against men is apparently aided and abetted by the author’s belief, expressed in his comment section, that the publishing industry doesn’t actually make money, nor apparently is intended to. Leaving aside the fact that this is an assertion which I suspect will come rather as a surprise to most of the editors and publishers I know, I’m not entirely sure I’m following the logic there. Publishing is controlled by women, and therefore it won’t publish work for men, and that’s why it doesn’t make money? Because it’s not supposed to make money, publishing is controlled by women, who won’t publish work for men? The dark feminist conspiracy won’t let men publish their work unless they check their testicles at the door, and enter the room bearing fruity drinks and amusing coupons for foot rubs? Something along those lines. It’s kind of confusing to me.\nI don’t think there’s any publishing conspiracy against men, myself, but that the sales numbers do tend to indicate that there may be too much female influence on decisions made regarding what will appeal to men.  Scalzi is right to suggest that a problem finding a publisher likely isn’t with the publishers in most cases, but then, how does he explain precisely the same complaint being voiced by bestselling authors Tucker Max and Maddox?\nNo woman who finds Tucker Max or Maddox offensive was ever going to sign them to write a book, (despite\nthe ample proof\nthat at least Tucker’s female fans are among the most appreciative in the world), which is why “mainstream publishers would have nothing to do with them” according to the New York Times.  As Frank Kelly Rich points out, “it took the Web to help fratire get around the hang-ups of mainstream publishing houses that professed to be searching for the male equivalent of chick lit, but which were frightened when they actually saw what it looked like.”\nPublishers usually kill a book it offends someone on the pub board, regardless of the sales projections.  That’s why I was paid off by a conservative publishing house that didn’t want to publish a book it had already signed and which the editors loved; the kill decision came two days after learning that I wasn’t intending to restrict my criticism to the left side of the political spectrum.  The sales projections were among the highest for any of the books they’d signed at that time, but they killed it anyway after having someone at Fox News examine the chapter on Bill O’Reilly.\nAs John may remember, there were also SFWAns who stated that I’d never get published at Tor due to my politically incorrect opinions about the dearth of women writing hard science fiction being discussed on Electrolyte.  (A moot point, since I’ve never been a big Tor fan.)  Now, I don’t know if it’s video games, the fact that men are more likely to circumvent the publishing system – I mostly read pirate ebooks on my Treo and don’t buy a physical book unless I wish to cast a financial vote of support for the author – or that increased female influence in publishing has had the unintended result of decreasing the appeal of modern fiction to men, but it seems something is causing men to buy less fiction than before.  Given that the same thing has happened in television, I suspect it’s mostly a combination of 1 and 3.\nStill, none of this excuses a bad author’s failure to get published, and anyway, smart women in publishing will come to understand, if they don’t already, that no one can control the market.  If a void is created, that void will eventually be filled.  The ratings abuse of CNN by Fox News  has demonstrated how foolish it is to ignore the void; if the mainstream publishers won’t provide men with what they want, men will simply go elsewhere.\nAnd it’s clear that mainstream publishing and the conventional book business is in trouble.  I didn’t even bother looking for a publisher to replace Pocket Books, I mean, what was the point?  In the time it would take to find a publisher, I could publish it myself and write another book.  And having been thrice rejected by pub boards after being specifically solicited by an editor, I won’t even talk to a publisher that approaches me anymore unless I’m speaking with the ultimate decision-maker.\nThe freedom is of self-publishing is great; instead of a stupid stock photo cover which I’m under pressure to approve, I have a fantastic Rowena cover painting and no one can tell me that I can’t release free PDB and PDF versions to the Net.  Maybe I won’t make any money on it, but so what?  Writing fiction is one of the least efficient means of producing income known to man, so you might as well embrace it as an interesting hobby instead of an income-producing career.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-31T12:11:00+00:00"
}