{
  "url": "https://voxday.net/2006/10/23/it-takes-chuck-norris-to-hold-us-back/",
  "scraped_at": "2026-01-08T21:21:15.669832",
  "title": "It takes Chuck Norris to hold us back",
  "date_display": "October 23, 2006",
  "date_iso": "2006-10-23T12:34:00+00:00",
  "date_from_url": "2006-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It doesn’t surprise me to get kicked off the headliner’s strip at WND again, however long it happens to last this time.  But it gives me no small amount of pleasure to have it happen this time because <em>it took Chuck Norris to do it.</em> Here’s a few of my favorite biographical facts about <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=52567\">my new fellow columnist</a>:</p><blockquote><p>Chuck Norris doesn’t actually write books, the words assemble themselves out of fear.</p><p>The grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears.</p><p>Hellen Keller’s favorite color is Chuck Norris.</p><p>We live in an expanding universe. All of it is trying to get away from Chuck Norris.</p><p>Chuck Norris never has to wax his skis because they’re always slick with blood.</p></blockquote></div>",
  "content_text": "It doesn’t surprise me to get kicked off the headliner’s strip at WND again, however long it happens to last this time.  But it gives me no small amount of pleasure to have it happen this time because\nit took Chuck Norris to do it.\nHere’s a few of my favorite biographical facts about\nmy new fellow columnist\n:\nChuck Norris doesn’t actually write books, the words assemble themselves out of fear.\nThe grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears.\nHellen Keller’s favorite color is Chuck Norris.\nWe live in an expanding universe. All of it is trying to get away from Chuck Norris.\nChuck Norris never has to wax his skis because they’re always slick with blood.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-23T11:34:00+00:00"
}