{
  "url": "https://voxday.net/2006/10/04/less-pay-for-less-work/",
  "scraped_at": "2026-01-08T21:19:34.684774",
  "title": "Less pay for less work",
  "date_display": "October 4, 2006",
  "date_iso": "2006-10-04T07:46:00+00:00",
  "date_from_url": "2006-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t think this is any business of any government in the first place.  It’s not a government’s responsibility to guard against corporate idiocy and an employer should be free to pay an employee more just because he wears nice suits or she has big breasts if he’s dumb enough to do so… but at least they’re not trying to <a href=\"http://www.timesonline.co.uk/article/0,,3-2387750,00.html\">require companies to give people raises for work they haven’t done</a>:</p><blockquote><p>Women who take time out of the workplace for maternity leave have no automatic right to the same pay as male colleagues who are doing the same job but have not had time off, Europe’s top court ruled yesterday.</p></blockquote><p>One wonders if perhaps the European courts aren’t beginning to rethink the wisdom of encouraging women to work and importing Muslims to replace missing children instead of encouraging women to stay at home, have children and raise a succeeding generation of Europeans.</p><p>Or perhaps their motives are more nefarious and they wish to remove even the smallest incentive for a woman to have children.  Given the strange state of Brussels, either could be true.</p></div>",
  "content_text": "I don’t think this is any business of any government in the first place.  It’s not a government’s responsibility to guard against corporate idiocy and an employer should be free to pay an employee more just because he wears nice suits or she has big breasts if he’s dumb enough to do so… but at least they’re not trying to\nrequire companies to give people raises for work they haven’t done\n:\nWomen who take time out of the workplace for maternity leave have no automatic right to the same pay as male colleagues who are doing the same job but have not had time off, Europe’s top court ruled yesterday.\nOne wonders if perhaps the European courts aren’t beginning to rethink the wisdom of encouraging women to work and importing Muslims to replace missing children instead of encouraging women to stay at home, have children and raise a succeeding generation of Europeans.\nOr perhaps their motives are more nefarious and they wish to remove even the smallest incentive for a woman to have children.  Given the strange state of Brussels, either could be true.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-04T06:46:00+00:00"
}