{
  "url": "https://voxday.net/2006/10/22/lets-start-nuclear-war/",
  "scraped_at": "2026-01-08T21:21:08.443763",
  "title": "Let’s start a nuclear war",
  "date_display": "October 22, 2006",
  "date_iso": "2006-10-22T11:45:00+00:00",
  "date_from_url": "2006-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It has recently come to my attention that due to a sad lack of appreciation for over-the-top music – one rather doubts the Scissor Sisters will ever be quite as big in the USA as they are in the UK – far fewer people are familiar with <a href=\"http://www.youtube.com/watch?v=CPvCopt990w\">the following piece of audiovisual hilarity</a> than should be.</p><p>It’s gayer than gay, but a sight to warm Nate’s Union-hating heart anyway.  The link is slightly censored, although it boggles the mind as to why they censored those two lines given the rest of the video.</p><p>Perhaps the VQPF can inform us if the song is regarded as offensive or not.  It’s been a long time since I was last in a gay bar – don’t get too excited, we were an electronic band and almost everyone at the label was gay – but whether it is nor not, I can’t imagine it being regarded as anything except a signature anthem ala Erasure and the Pet Shop Boys because it’s so obviously awesome.</p><p>In any event given songs like “Infected Girls” and “There’s Something Very Wrong With Us So Let’s Go Out Tonight”, I can’t imagine that the band much cares what anyone thinks one way or another.  I particularly like their libertarian, but gentlemanly take in “<a href=\"http://www.youtube.com/watch?v=ls-dZYUXN-w\">I Buy the Drugs</a>“:</p><p><em>I buy the drugs<br>I light the fire<br>I am your main supplier<br>I am your man and I buy the drugs</br></br></br></em></p><p>UPDATE: Okay, that explains it.  They were signed to Warner UK, not Warner USA.  By the way, guys, they’ll be at First Ave next Friday, so let me know how the show was.</p></div>",
  "content_text": "It has recently come to my attention that due to a sad lack of appreciation for over-the-top music – one rather doubts the Scissor Sisters will ever be quite as big in the USA as they are in the UK – far fewer people are familiar with\nthe following piece of audiovisual hilarity\nthan should be.\nIt’s gayer than gay, but a sight to warm Nate’s Union-hating heart anyway.  The link is slightly censored, although it boggles the mind as to why they censored those two lines given the rest of the video.\nPerhaps the VQPF can inform us if the song is regarded as offensive or not.  It’s been a long time since I was last in a gay bar – don’t get too excited, we were an electronic band and almost everyone at the label was gay – but whether it is nor not, I can’t imagine it being regarded as anything except a signature anthem ala Erasure and the Pet Shop Boys because it’s so obviously awesome.\nIn any event given songs like “Infected Girls” and “There’s Something Very Wrong With Us So Let’s Go Out Tonight”, I can’t imagine that the band much cares what anyone thinks one way or another.  I particularly like their libertarian, but gentlemanly take in “\nI Buy the Drugs\n“:\nI buy the drugs\nI light the fire\nI am your main supplier\nI am your man and I buy the drugs\nUPDATE: Okay, that explains it.  They were signed to Warner UK, not Warner USA.  By the way, guys, they’ll be at First Ave next Friday, so let me know how the show was.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-22T10:45:00+00:00"
}