{
  "url": "https://voxday.net/2006/10/17/mailvox-history-time/",
  "scraped_at": "2026-01-08T21:20:40.588224",
  "title": "Mailvox: history time",
  "date_display": "October 17, 2006",
  "date_iso": "2006-10-17T08:24:00+00:00",
  "date_from_url": "2006-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>E. Silk writes a letter to WND:</p><blockquote><p>Bad news for Vox Day. After reading his article about allowing Iran and North Korea to have nuclear weapons because we can’t stop them from getting it – just like we couldn’t stop Hitler and his Nazi Party from taking over the world, or Hirohito and his cronies, I guess – the MENSA group has decided his IQ has dropped below their minimum requirement.</p><p>He’s out!</p></blockquote><p>Again with the MENSA!  What is up with that obsession on the part of my critics?  Anyhow, this is just embarrassing.  There is simply no comparison between the difficulty of permanently preventing technological proliferation and the difficulty in defeating a military opponent with expansionary proclivities.</p><p>There has never, to my knowledge, been a successful case of techno-monopoly on the part of a nation-state.  If you can think of one, do let me know, but the undeniable fact is that from silkworms to satellites, from iron armor to anti-ballistic missiles, know-how has always spread despite the best efforts of those who would prefer to keep it to themselves.</p><p>No one, on the other hand, has ever “taken over the world” with or without US opposition.  The examples of Germany and Japan are particularly feeble, as Germany was massively outnumbered, totally outgunned, had been roundly defeated only two decades before and had no chance of holding onto its gains in Europe once it attacked the Soviet Union and stupidly declared war on the United States.</p><p>Japan, meanwhile, managed to defeat a moribund China and take a few naval bases away from the USA and Great Britain.  Its ambition was regional and even that proved far too great for its very limited capacities.  As I have previously demonstrated, Japan didn’t have the wherewithal to even think about invading the USA; even the Pearl Harbor raid was a terrible strategic blunder that <a href=\"http://www.history.navy.mil/faqs/faq66-2.htm\">barely scratched American naval capabilities</a>.</p><p><em>Consider this.  The USA lost 12 ships, 3 permanently, of the 100 ships at Pearl Harbor.  The Japanese lost 1,392 ships to American submarines alone.  And just because I enjoy twisting knives:</em></p><p>“On 7 December 1941, the three Pacific Fleet aircraft carriers were USS  Enterprise (CV-6), USS Lexington (CV-2), and USS Saratoga (CV-3)….  Yorktown (CV-5), Ranger (CV-4) and Wasp (CV-7), along with the aircraft escort vessel Long Island (AVG-1), were in the Atlantic Fleet; Hornet (CV-8), commissioned in late October 1941, had yet to carry out her shakedown.”</p></div>",
  "content_text": "E. Silk writes a letter to WND:\nBad news for Vox Day. After reading his article about allowing Iran and North Korea to have nuclear weapons because we can’t stop them from getting it – just like we couldn’t stop Hitler and his Nazi Party from taking over the world, or Hirohito and his cronies, I guess – the MENSA group has decided his IQ has dropped below their minimum requirement.\nHe’s out!\nAgain with the MENSA!  What is up with that obsession on the part of my critics?  Anyhow, this is just embarrassing.  There is simply no comparison between the difficulty of permanently preventing technological proliferation and the difficulty in defeating a military opponent with expansionary proclivities.\nThere has never, to my knowledge, been a successful case of techno-monopoly on the part of a nation-state.  If you can think of one, do let me know, but the undeniable fact is that from silkworms to satellites, from iron armor to anti-ballistic missiles, know-how has always spread despite the best efforts of those who would prefer to keep it to themselves.\nNo one, on the other hand, has ever “taken over the world” with or without US opposition.  The examples of Germany and Japan are particularly feeble, as Germany was massively outnumbered, totally outgunned, had been roundly defeated only two decades before and had no chance of holding onto its gains in Europe once it attacked the Soviet Union and stupidly declared war on the United States.\nJapan, meanwhile, managed to defeat a moribund China and take a few naval bases away from the USA and Great Britain.  Its ambition was regional and even that proved far too great for its very limited capacities.  As I have previously demonstrated, Japan didn’t have the wherewithal to even think about invading the USA; even the Pearl Harbor raid was a terrible strategic blunder that\nbarely scratched American naval capabilities\n.\nConsider this.  The USA lost 12 ships, 3 permanently, of the 100 ships at Pearl Harbor.  The Japanese lost 1,392 ships to American submarines alone.  And just because I enjoy twisting knives:\n“On 7 December 1941, the three Pacific Fleet aircraft carriers were USS  Enterprise (CV-6), USS Lexington (CV-2), and USS Saratoga (CV-3)….  Yorktown (CV-5), Ranger (CV-4) and Wasp (CV-7), along with the aircraft escort vessel Long Island (AVG-1), were in the Atlantic Fleet; Hornet (CV-8), commissioned in late October 1941, had yet to carry out her shakedown.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-17T07:24:00+00:00"
}