{
  "url": "https://voxday.net/2006/10/30/mailvox-critics-sans-criticis/",
  "scraped_at": "2026-01-08T21:21:54.752710",
  "title": "Mailvox: critics sans criticism",
  "date_display": "October 30, 2006",
  "date_iso": "2006-10-30T16:59:00+00:00",
  "date_from_url": "2006-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PS doesn’t seem to grasp the concept of how one goes about making a case against someone:</p><blockquote><p>Are you embarassed at all that you write this article on ‘clowns of reason’ on a goofy far-right site that’s founder believes Dinosaurs were Dragons and lived with humans and there are hundreds of articles and columns praising creationism? (“Scientist Confirms: Noah’s Ark Real!”, “Did Creation Happen on October 20th, 6004 BC?”, “‘Gays’ hastening the upcoming Rapture?” etc.).</p></blockquote><p>No, not particularly.  I’m only responsible for my own work.  Personally, I find the pro-Republican “This is the Most Important Election Ever” columns that run every two years like clockwork to be more embarrassing.</p><blockquote><p>It seems to me that you hope to be a delightfully contrarian intellectual (“I joke that women shouldn’t vote! Aren’t I a stinker?”, “I’m a Christian Libertarian-Can you believe it!?”, “I’m an evangelical-but I”m in Mensa! Bet ya didn’t see that comin’!” “I love shitty post-modern literature like Umberto Eco but I really love the Bible most of all!”, “I hate Michael Moore-but I have a semi-Mohawk etc.) but are stuck at a hilariously wingnut website that is only visited by liberals who want to laugh and strange smelly men who hold their shotguns in one hand and their bible in another.</p></blockquote><p>I am not joking about women’s suffrage, of course.  But how dare PS suggest that the great dottore writes post-modern literature?  That’s far and away the most offensive thing in his email!  PS fails to realize that although his intellectual heroes are frauds, it doesn’t mean that everyone is.</p><blockquote><p>I know it probably hurts that only a few people read you, but don’t take it out on brilliant scientists and intellectuals who think more in one day than you do in a year. Drown your sorrow in Joy Division, Ayn Rand and William Dembski and call us when you start to think logically.</p></blockquote><p>Actually, I’ve sold a bt more than half as many books as Sam Harris and my WND<br>readership is much larger than his blog.  For whatever that’s worth, anyhow; while one always hopes for an audience, it isn’t the main reason one writes.  Furthermore, I note that like WT, PS doesn’t even attempt to defend Harris’ factual and logical errors elucidated in today’s column, most likely because it can’t be done.   As is so often the case with this sort of critic, he doesn’t actually say anything, he’s merely crying like a child upset about his little friend getting spanked in front of him.  It is sad that I can tear apart in fifteen minutes what takes those clowns months and months to painstakingly assemble, but then, the chances are that I’m rather more intelligent than they are.</br></p><p>Thought knows no labor theory of value, its defining factor is quality, not quantity.  One hopes that PS will consider bringing an actual argument next time.</p></div>",
  "content_text": "PS doesn’t seem to grasp the concept of how one goes about making a case against someone:\nAre you embarassed at all that you write this article on ‘clowns of reason’ on a goofy far-right site that’s founder believes Dinosaurs were Dragons and lived with humans and there are hundreds of articles and columns praising creationism? (“Scientist Confirms: Noah’s Ark Real!”, “Did Creation Happen on October 20th, 6004 BC?”, “‘Gays’ hastening the upcoming Rapture?” etc.).\nNo, not particularly.  I’m only responsible for my own work.  Personally, I find the pro-Republican “This is the Most Important Election Ever” columns that run every two years like clockwork to be more embarrassing.\nIt seems to me that you hope to be a delightfully contrarian intellectual (“I joke that women shouldn’t vote! Aren’t I a stinker?”, “I’m a Christian Libertarian-Can you believe it!?”, “I’m an evangelical-but I”m in Mensa! Bet ya didn’t see that comin’!” “I love shitty post-modern literature like Umberto Eco but I really love the Bible most of all!”, “I hate Michael Moore-but I have a semi-Mohawk etc.) but are stuck at a hilariously wingnut website that is only visited by liberals who want to laugh and strange smelly men who hold their shotguns in one hand and their bible in another.\nI am not joking about women’s suffrage, of course.  But how dare PS suggest that the great dottore writes post-modern literature?  That’s far and away the most offensive thing in his email!  PS fails to realize that although his intellectual heroes are frauds, it doesn’t mean that everyone is.\nI know it probably hurts that only a few people read you, but don’t take it out on brilliant scientists and intellectuals who think more in one day than you do in a year. Drown your sorrow in Joy Division, Ayn Rand and William Dembski and call us when you start to think logically.\nActually, I’ve sold a bt more than half as many books as Sam Harris and my WND\nreadership is much larger than his blog.  For whatever that’s worth, anyhow; while one always hopes for an audience, it isn’t the main reason one writes.  Furthermore, I note that like WT, PS doesn’t even attempt to defend Harris’ factual and logical errors elucidated in today’s column, most likely because it can’t be done.   As is so often the case with this sort of critic, he doesn’t actually say anything, he’s merely crying like a child upset about his little friend getting spanked in front of him.  It is sad that I can tear apart in fifteen minutes what takes those clowns months and months to painstakingly assemble, but then, the chances are that I’m rather more intelligent than they are.\nThought knows no labor theory of value, its defining factor is quality, not quantity.  One hopes that PS will consider bringing an actual argument next time.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-30T16:59:00+00:00"
}