{
  "url": "https://voxday.net/2006/10/15/mailvox-why-do-you-believe/",
  "scraped_at": "2026-01-08T21:20:31.507071",
  "title": "Mailvox: why do you believe",
  "date_display": "October 15, 2006",
  "date_iso": "2006-10-15T12:11:00+00:00",
  "date_from_url": "2006-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Hello, I’ve enjoyed for several years your articles and, more recently, your blog.  I’ve wanted to ask you about your Christianity.  I hope you will read this email because while it may not elicit your response, it is not mere foolishness.</p><p>I’ve been intrigued that someone of your intelligence is a professed Christian.  I myself am religious and intelligent.  [4-5 SD range]  In my life, this has made me an absolute anomaly among my very brilliant family and friends, all staunch atheists, as well as among the many wonderful, yet relatively simple, people I have known who love and live for God.</p><p>Now of course there are many very intelligent people of all religions, but I was so gratified to read you write recently of your awareness and experience of the difference between individuals with IQ’s of 130 and 100 being much the same as that between individuals with 100 and 70.  And it is certainly also true that being highly intelligent is not always found along with the most well honed critical thinking skills; I have not found fruitful discussions with even those religious people I’ve known who are quite bright.</p><p>I am specifically interested in why you believe in a triune God.  My religious belief is Islam (note this is not exactly the same as saying that my religion is<br>Islam), though I have studied the Hebrew and Christian Bibles in depth.  I feel convinced of uncompromised monotheism and that Islam is what is consistent with<br>all God’s revelation of Himself as preserved in Biblical Judaism, yet from time to time something in my mind questions this outrageous claim of Christianity, that perhaps such a bold, absurd, insane claim could possibly be true – that Prophet Jesus is in fact God and King.</br></br></p></blockquote><p>This demands a more lengthy and well-considered answer than I have time for today, (the local football derby is this afternoon), so I shall simply give the very short version: pattern recognition, and turn it over to the rest of you for initial responses.  Serious responses only, please, and think your responses through before you post them as I have no doubt that this particular emailer will have no trouble shredding the usual cliches.</p></div>",
  "content_text": "Hello, I’ve enjoyed for several years your articles and, more recently, your blog.  I’ve wanted to ask you about your Christianity.  I hope you will read this email because while it may not elicit your response, it is not mere foolishness.\nI’ve been intrigued that someone of your intelligence is a professed Christian.  I myself am religious and intelligent.  [4-5 SD range]  In my life, this has made me an absolute anomaly among my very brilliant family and friends, all staunch atheists, as well as among the many wonderful, yet relatively simple, people I have known who love and live for God.\nNow of course there are many very intelligent people of all religions, but I was so gratified to read you write recently of your awareness and experience of the difference between individuals with IQ’s of 130 and 100 being much the same as that between individuals with 100 and 70.  And it is certainly also true that being highly intelligent is not always found along with the most well honed critical thinking skills; I have not found fruitful discussions with even those religious people I’ve known who are quite bright.\nI am specifically interested in why you believe in a triune God.  My religious belief is Islam (note this is not exactly the same as saying that my religion is\nIslam), though I have studied the Hebrew and Christian Bibles in depth.  I feel convinced of uncompromised monotheism and that Islam is what is consistent with\nall God’s revelation of Himself as preserved in Biblical Judaism, yet from time to time something in my mind questions this outrageous claim of Christianity, that perhaps such a bold, absurd, insane claim could possibly be true – that Prophet Jesus is in fact God and King.\nThis demands a more lengthy and well-considered answer than I have time for today, (the local football derby is this afternoon), so I shall simply give the very short version: pattern recognition, and turn it over to the rest of you for initial responses.  Serious responses only, please, and think your responses through before you post them as I have no doubt that this particular emailer will have no trouble shredding the usual cliches.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-15T11:11:00+00:00"
}