{
  "url": "https://voxday.net/2006/10/05/mailvox-does-he-know-any-women/",
  "scraped_at": "2026-01-08T21:19:38.322568",
  "title": "Mailvox: does he know any women?",
  "date_display": "October 5, 2006",
  "date_iso": "2006-10-05T07:25:00+00:00",
  "date_from_url": "2006-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m beginning to think that Cedarford has never actually spoken to a real live woman:</p><blockquote><p>And my point is that it is good if they do, because middle America, particularly women, are profoundly disturbed by the police state and restrictions on rights they promise….</p></blockquote><p>This, right here, is evidence that otherwise intelligent people can say incredibly stupid things in defense of their most-cherished positions. It may be one of the silliest things I’ve ever seen anyone write here.</p><p>There is no evidence whatsoever that women are profoundly disturbed by a police state, to the contrary, they demand it on a regular basis!  Women are delighted when smoking is banned, they weep tears of joy when repressive gun control is enacted and they are happy to be strip-searched at the airport and halted at mandatory late-night traffic stops.  The reason is that most women are afraid of liberty and prefer <em>Recht und Ordnung</em> in the name of security; the  popularity of the Nazis with women, the suffragettes’ embrace of Fascism and the fact that there are no Founding Mothers are not random accidents of history.</p><p>The only reason the right-to-life movement hasn’t managed to win over women the way MADD and DARE have is because many women are more afraid of having a baby than of the physical repercussions of having an abortion.  They couldn’t be less concerned about Cedarford’s “anti-abortion police state”, and if one were to make women as fearful of abortion as they are of crime, drunk drivers, drugs and terrorism, they’d embrace that police state with open arms.</p></div>",
  "content_text": "I’m beginning to think that Cedarford has never actually spoken to a real live woman:\nAnd my point is that it is good if they do, because middle America, particularly women, are profoundly disturbed by the police state and restrictions on rights they promise….\nThis, right here, is evidence that otherwise intelligent people can say incredibly stupid things in defense of their most-cherished positions. It may be one of the silliest things I’ve ever seen anyone write here.\nThere is no evidence whatsoever that women are profoundly disturbed by a police state, to the contrary, they demand it on a regular basis!  Women are delighted when smoking is banned, they weep tears of joy when repressive gun control is enacted and they are happy to be strip-searched at the airport and halted at mandatory late-night traffic stops.  The reason is that most women are afraid of liberty and prefer\nRecht und Ordnung\nin the name of security; the  popularity of the Nazis with women, the suffragettes’ embrace of Fascism and the fact that there are no Founding Mothers are not random accidents of history.\nThe only reason the right-to-life movement hasn’t managed to win over women the way MADD and DARE have is because many women are more afraid of having a baby than of the physical repercussions of having an abortion.  They couldn’t be less concerned about Cedarford’s “anti-abortion police state”, and if one were to make women as fearful of abortion as they are of crime, drunk drivers, drugs and terrorism, they’d embrace that police state with open arms.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-05T06:25:00+00:00"
}