{
  "url": "https://voxday.net/2006/10/16/mailvox-no-nukes-revisited/",
  "scraped_at": "2026-01-08T21:20:35.158731",
  "title": "Mailvox: no nukes revisited",
  "date_display": "October 16, 2006",
  "date_iso": "2006-10-16T08:18:00+00:00",
  "date_from_url": "2006-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ES ensures that we hear from the “we MUST do SOMETHING!” school:</p><blockquote><p>Great idea!  And if the U.S. is really a friend of Israel, then we have nothing to worry about if Iran or North Korea sneak nuclear weapons into our country.  I mean, for how long can we stop them from trying?  Makes sense to me!!!</p><p>Oh, and if Israel is not the prophesied Israel from the Bible, well, just some more dead Jews.  Way to go!</p></blockquote><p>Yes, because when faced with a choice between doing the historically impossible – preventing foreign technological advancement – and the historically difficult but doable – protecting a national border – obviously it makes sense to direct one’s resources towards performing the impossible.  ES’ attempted criticism here merely highlights the complete logical disconnect between the Bush administration’s rhetoric and its actions.</p><p>Seriously, how can you possibly argue that the USA must attack both North Korea and Iran in order to prevent them from sneaking nuclear weapons across our unguarded borders?  And even if one was so gifted with the tongues of men and angels that one could make that case successfully, how could one possibly argue <em>for attacking Iran first</em>?</p><p>As for Israel, the greater part of its support from American evangelicals is based on the notion that it is, indeed, the Biblical Israel whose return from the diaspora is a sign of the approaching End Times.  One cannot reasonably expect them to a) believe that God is incapable of protecting His Chosen if that is the case or b) care any more about Israel than Namibia or Rwanda if it is not.</p><p>Simply crying “no nukes, no nukes” is no more convincing from hawkish neocons than it was from 60’s hippies.</p></div>",
  "content_text": "ES ensures that we hear from the “we MUST do SOMETHING!” school:\nGreat idea!  And if the U.S. is really a friend of Israel, then we have nothing to worry about if Iran or North Korea sneak nuclear weapons into our country.  I mean, for how long can we stop them from trying?  Makes sense to me!!!\nOh, and if Israel is not the prophesied Israel from the Bible, well, just some more dead Jews.  Way to go!\nYes, because when faced with a choice between doing the historically impossible – preventing foreign technological advancement – and the historically difficult but doable – protecting a national border – obviously it makes sense to direct one’s resources towards performing the impossible.  ES’ attempted criticism here merely highlights the complete logical disconnect between the Bush administration’s rhetoric and its actions.\nSeriously, how can you possibly argue that the USA must attack both North Korea and Iran in order to prevent them from sneaking nuclear weapons across our unguarded borders?  And even if one was so gifted with the tongues of men and angels that one could make that case successfully, how could one possibly argue\nfor attacking Iran first\n?\nAs for Israel, the greater part of its support from American evangelicals is based on the notion that it is, indeed, the Biblical Israel whose return from the diaspora is a sign of the approaching End Times.  One cannot reasonably expect them to a) believe that God is incapable of protecting His Chosen if that is the case or b) care any more about Israel than Namibia or Rwanda if it is not.\nSimply crying “no nukes, no nukes” is no more convincing from hawkish neocons than it was from 60’s hippies.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-16T07:18:00+00:00"
}