{
  "url": "https://voxday.net/2006/10/06/mailvox-yeah-i-dont-buy-i/",
  "scraped_at": "2026-01-08T21:19:43.826501",
  "title": "Mailvox: yeah, I don’t buy it",
  "date_display": "October 6, 2006",
  "date_iso": "2006-10-06T12:09:00+00:00",
  "date_from_url": "2006-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>KB protests a bit too vehemently, in my book:</p><blockquote><p>Love your site and articles, but to me this entry really falls.  It’s a cheap and inaccurate argument to say that when someone expresses dislike or criticism for something it’s because he or she is jealous.  If true, that would reveal some very ridiculous things about just what YOU admire and whom you envy.</p><p>I’m a thin, fit, small chested chick and I think women who get implants are pathetic.  It seems that studies also testify to the psychological weakness and instability of the types of women who choose this cosmetic disfigurement.  My husband is a fabulous piece of man, intellectually and physically superior to 99% of his gender – and at age 30 he’s basically bald.  We laugh together at those television commercials of all the insecure losers whose self identity is too fragile to accept the natural results of aging and their own genetics.</p><p>It’s not (necessarily) jealousy for a woman to dislike another woman’s implants.  I love gorgeous women; I hate what is fake.  I love people as they are; I hate when they try to or think they have to make themselves into something they’re not, whether this is the attempt to adopt an inauthentic personality, intellect, or physicality.</p></blockquote><p>While I agree that it is not NECESSARILY jealousy for a woman to dislike another woman’s breast implants – let’s face it, those are the only implants that set women off – I continue to assert that this is usually the case.  Of course this isn’t always true of every criticism or dislike, I’ve stated several times how tiresome I find being accused of being jealous of a Malkin or a Shapiro due to my criticism of them; of course, if that were the case then why wouldn’t I be similarly jealous of the far more successful Coulters, Goldbergs and Buchanans of the world?</p><p>(Do you want to know who I envy?  John Romero for one.  J. Gregory Keyes for another, at least today just after finishing his excellent <em>Age of Unreason</em> series.  Andrei Shevchenko for a third.  Whoever designed the Total War franchise for a fourth.  To even think to suggest that I would envy third- and fourth-rate commentators with mild gifts for self-promotion is downright insulting.)</p><p>As Spacebunny pointed out in the comments yesterday, the line of attack on women with breast implants could just as easily be applied to the many other individuals who elect to subject themselves to the 10.5 million other cosmetic procedures performed annually, <em>and yet they never are.</em> Lipo or rhinoplasty is as fake as breast augmentation, in fact, there’s probably more dishonesty surrounding rhinoplasty than any other procedure considering how many “deviated septums” are mysteriously fixed via external modifications.</p><p>KB also raises the larger question of inauthenticity.  But what is authentic?  I remember weighing 140 pounds and looking like an anorexic elf at the same height I am now.  After more than a decade of painful and unnatural activity, I’ve stacked on 40 additional pounds, most of which would disappear in less than a year if I quit lifting.  Is that authentic?  How about when I’m on creatine and add another five pounds of muscle… most of that is gone within a month of going off the powder.</p><p>I conclude there is nothing inherently moral or immoral about intentional body modification, regardless of the method.  Indeed, one can make a better Biblical case against a woman cutting her hair or a man eating too much than against most cosmetic surgery.</p><p>Given the hatred so many women harbor for more attractive women, I suspect that the real source of Irrational Implant-Induced Irritability is that it forces a woman to admit that she has a choice in a matter wherein she would prefer to believe she has none.  I think this is similar to the dislike many of the unfit harbor for the fit, it’s much nicer to think that the status quo is not your fault and there’s simply nothing you can do.  Whereas the flat woman can look at the natural D-cup with only mild envy, the augmented D-cup presents her with a direct challenge: you too can look like this if you so choose.</p><p>One does not need to be psychologically damaged in order to wish to look more attractive in a society where attractiveness is a significant material benefit.  I do question, however, the psychological well-being of someone who actively dislikes another person merely for the way in which the mere fact of the dislikee’s existence forces the disliker to acknowledge the fact that she has, in fact, made a choice.</p></div>",
  "content_text": "KB protests a bit too vehemently, in my book:\nLove your site and articles, but to me this entry really falls.  It’s a cheap and inaccurate argument to say that when someone expresses dislike or criticism for something it’s because he or she is jealous.  If true, that would reveal some very ridiculous things about just what YOU admire and whom you envy.\nI’m a thin, fit, small chested chick and I think women who get implants are pathetic.  It seems that studies also testify to the psychological weakness and instability of the types of women who choose this cosmetic disfigurement.  My husband is a fabulous piece of man, intellectually and physically superior to 99% of his gender – and at age 30 he’s basically bald.  We laugh together at those television commercials of all the insecure losers whose self identity is too fragile to accept the natural results of aging and their own genetics.\nIt’s not (necessarily) jealousy for a woman to dislike another woman’s implants.  I love gorgeous women; I hate what is fake.  I love people as they are; I hate when they try to or think they have to make themselves into something they’re not, whether this is the attempt to adopt an inauthentic personality, intellect, or physicality.\nWhile I agree that it is not NECESSARILY jealousy for a woman to dislike another woman’s breast implants – let’s face it, those are the only implants that set women off – I continue to assert that this is usually the case.  Of course this isn’t always true of every criticism or dislike, I’ve stated several times how tiresome I find being accused of being jealous of a Malkin or a Shapiro due to my criticism of them; of course, if that were the case then why wouldn’t I be similarly jealous of the far more successful Coulters, Goldbergs and Buchanans of the world?\n(Do you want to know who I envy?  John Romero for one.  J. Gregory Keyes for another, at least today just after finishing his excellent\nAge of Unreason\nseries.  Andrei Shevchenko for a third.  Whoever designed the Total War franchise for a fourth.  To even think to suggest that I would envy third- and fourth-rate commentators with mild gifts for self-promotion is downright insulting.)\nAs Spacebunny pointed out in the comments yesterday, the line of attack on women with breast implants could just as easily be applied to the many other individuals who elect to subject themselves to the 10.5 million other cosmetic procedures performed annually,\nand yet they never are.\nLipo or rhinoplasty is as fake as breast augmentation, in fact, there’s probably more dishonesty surrounding rhinoplasty than any other procedure considering how many “deviated septums” are mysteriously fixed via external modifications.\nKB also raises the larger question of inauthenticity.  But what is authentic?  I remember weighing 140 pounds and looking like an anorexic elf at the same height I am now.  After more than a decade of painful and unnatural activity, I’ve stacked on 40 additional pounds, most of which would disappear in less than a year if I quit lifting.  Is that authentic?  How about when I’m on creatine and add another five pounds of muscle… most of that is gone within a month of going off the powder.\nI conclude there is nothing inherently moral or immoral about intentional body modification, regardless of the method.  Indeed, one can make a better Biblical case against a woman cutting her hair or a man eating too much than against most cosmetic surgery.\nGiven the hatred so many women harbor for more attractive women, I suspect that the real source of Irrational Implant-Induced Irritability is that it forces a woman to admit that she has a choice in a matter wherein she would prefer to believe she has none.  I think this is similar to the dislike many of the unfit harbor for the fit, it’s much nicer to think that the status quo is not your fault and there’s simply nothing you can do.  Whereas the flat woman can look at the natural D-cup with only mild envy, the augmented D-cup presents her with a direct challenge: you too can look like this if you so choose.\nOne does not need to be psychologically damaged in order to wish to look more attractive in a society where attractiveness is a significant material benefit.  I do question, however, the psychological well-being of someone who actively dislikes another person merely for the way in which the mere fact of the dislikee’s existence forces the disliker to acknowledge the fact that she has, in fact, made a choice.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-06T11:09:00+00:00"
}