{
  "url": "https://voxday.net/2006/10/08/math-is-hard-3/",
  "scraped_at": "2026-01-08T21:19:59.881644",
  "title": "Math is hard",
  "date_display": "October 8, 2006",
  "date_iso": "2006-10-08T17:43:00+00:00",
  "date_from_url": "2006-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amynda was too busy with Womyn’s Studies <a href=\"http://pandagon.net/2006/10/08/conclusion-its-republicans-you-need-to-keep-away-from-kids-not-gay-men/\">to take statistics</a>:</p><blockquote><p>The erroneous notion that gay men are more likely to molest children is absolutely wrong, and anyone who was a teenage girl can attest that the notion that straight men mind their manners around teenage girls that are way too young for them is absolute horseshit. The stereotype that gay men are more likely to prey on children is a way to justify bigotry and a way to live in denial about the behavior of some straight men in a community.</p></blockquote><p>And a teenage girl who can do math would know that the fact there are somewhere between 36x and 49x more normal men than gay men means that despite there being more girls being molested by men than boys, a gay man is between 8 and 11 times more likely to prey on children.</p><p>This is why there is no heterosexual equivalent to NAMBLA and the worldwide push to drive the age of consent lower is almost uniformly led by gay men.  But why pay attention to statistics from the Department of Justice when you can instead rely upon Amynda’s persuasive adverbs and convincingly earthy assertions!</p><p>One result of the relentless pushing of homosexuality on mainstream America has been that far more normal Americans are to some degree familiar with aspects of the gay subculture.  Thus, they are well aware of homosexuality’s cult of youth and less susceptible to falling for blatantly dishonest defenses like this one.</p><p>UPDATE: What is it with this inability of female bloggers to deal with basic math?  Instapundit recently linked to a woman who is very, very upset about judicial punishments in Iran and while stoning women for adultery seems rather barbaric by Western standards – though who are multiculturalists to judge – I had to roll my eyes at this statement: <em>By the time you read this, seven more women in Iran will most likely have been stoned to death after being convicted of committing adultery.</em></p><p>Let’s say that I read very slowly and it took me 10 seconds to read that.  This would mean that 7,560 women were stoned to death while I was watching the Packers-Rams game, and more than 22 million Iranian women will be stoned to death this year.</p><p>The population of Iran is 68 million.  This suggests that MLB should be looking to Iran for pitchers who can throw a complete nine innings.</p></div>",
  "content_text": "Amynda was too busy with Womyn’s Studies\nto take statistics\n:\nThe erroneous notion that gay men are more likely to molest children is absolutely wrong, and anyone who was a teenage girl can attest that the notion that straight men mind their manners around teenage girls that are way too young for them is absolute horseshit. The stereotype that gay men are more likely to prey on children is a way to justify bigotry and a way to live in denial about the behavior of some straight men in a community.\nAnd a teenage girl who can do math would know that the fact there are somewhere between 36x and 49x more normal men than gay men means that despite there being more girls being molested by men than boys, a gay man is between 8 and 11 times more likely to prey on children.\nThis is why there is no heterosexual equivalent to NAMBLA and the worldwide push to drive the age of consent lower is almost uniformly led by gay men.  But why pay attention to statistics from the Department of Justice when you can instead rely upon Amynda’s persuasive adverbs and convincingly earthy assertions!\nOne result of the relentless pushing of homosexuality on mainstream America has been that far more normal Americans are to some degree familiar with aspects of the gay subculture.  Thus, they are well aware of homosexuality’s cult of youth and less susceptible to falling for blatantly dishonest defenses like this one.\nUPDATE: What is it with this inability of female bloggers to deal with basic math?  Instapundit recently linked to a woman who is very, very upset about judicial punishments in Iran and while stoning women for adultery seems rather barbaric by Western standards – though who are multiculturalists to judge – I had to roll my eyes at this statement:\nBy the time you read this, seven more women in Iran will most likely have been stoned to death after being convicted of committing adultery.\nLet’s say that I read very slowly and it took me 10 seconds to read that.  This would mean that 7,560 women were stoned to death while I was watching the Packers-Rams game, and more than 22 million Iranian women will be stoned to death this year.\nThe population of Iran is 68 million.  This suggests that MLB should be looking to Iran for pitchers who can throw a complete nine innings.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-08T16:43:00+00:00"
}