{
  "url": "https://voxday.net/2006/10/01/me-so-sad/",
  "scraped_at": "2026-01-08T21:19:10.649620",
  "title": "Me So Sad",
  "date_display": "October 1, 2006",
  "date_iso": "2006-10-01T13:43:00+00:00",
  "date_from_url": "2006-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Me So Michelle <a href=\"http://michellemalkin.com/archives/006025.htm\">is making a few more of her usual fact-free assertions</a>…. I don’t even know what this latest deal is about since I pay so little attention to the airhead anymore:</p><blockquote><p>You posted the picture. You engaged in gratuitous insults. You had nothing better to write about.</p><p>But how dare I respond.</p><p>I don’t consider it pointless to note that a professor with whom I cordially engaged in lengthy debates over profiling and WWII history has descended into madness. I invited Muller to appear with me on radio. I encouraged students to read our extensive blog exchanges and gave out his website address on C-SPAN and in countless other appearances. If you paid attention to his behavior over the course of those interactions, what he did on Friday was no surprise. He called on his readers to get my book banned. He helped organize a “Historians’ Committee for Fairness” that demanded that any media organization that had me on to talk about my book “formally apologize to the Japanese Americans who have been slandered by Ms. Malkin’s reckless presentation and invite a reputable historian to present a more even-handed view of the evidence.” He allied himself with a hate-filled nut who refers to me as “Me So Michelle.”</p></blockquote><p>Muller hardly “allied himself” with me, except in that we both found separate and serious historical inaccuracies in Malkin’s ludicrous book, IN DEFENSE OF INTERNMENT.  Given Malkin’s penchant for slinging insults, however feebly, I find it hysterical that she still gets her panties in a bunch over incoming fire.</p><p>“Me small Asian woman.  You no call me names.  Me call you names, okay Joe?”</p><p>As per usual, she offers no evidence that I am either “hate-filled” or a “nut”, but then, what can you expect from a woman who can’t count to six.  So much for that notion of Asian math supremacy.  I further note that Me So completely forgets to mention that while she was willing to debate Muller on some internment related matters, she has never dared to respond to me or anyone else regarding the question of military necessity because a five-minute comparison of her book with publicly available USN records will reveal that she didn’t even do five minutes worth of research on that rather important aspect of the issue.  In fact, the entire foundation of her book’s premise is tautological.</p><p>How dare she respond?  Please… she hasn’t dared to respond substantively to me for two years aside from attempting the occasional insult.</p><p>Me so scared….</p><p>UPDATE – Talk about panties and the bunching thereof.  Apparently <a href=\"http://flickr.com/photos/77759223@N00/197843842/\">someone photoshopped Malkin’s head onto some other girl’s bikini-clad body</a> and Muller linked to it, big fucking deal.  It was obviously a joke, Malkin’s protests notwithstanding.  Which leads me to the inescapable thought that if she thinks that’s so awful, I wonder if she’s aware of what one can do with 3D-rendered animations….</p><p>Hey, we could use an Asian chick anyhow.  Can you say “easter egg”?</p><p>UPDATE II – Malkin mentions at the bottom: <em>“I think what drives a lot of the haters crazy is that despite their ceaseless sniping, they can’t shut me up.”</em> Actually, I didn’t find it difficult at all.  In fact, her uncharacteristic silence on the subject was downright damning when compared to her usual volubility on matters relating to herself.  Notice how she links to nearly every site but the hate-filled one?</p><p>She’s rather a contemptible coward behind that faux bold front.  But don’t forget, this is a woman who couldn’t think fast enough on her feet to handle Chris freaking Matthews.  When you’re not smart enough to handle the hair brigade without breaking a sweat, you should probably rethink the whole public intellectual pose.</p></div>",
  "content_text": "Me So Michelle\nis making a few more of her usual fact-free assertions\n…. I don’t even know what this latest deal is about since I pay so little attention to the airhead anymore:\nYou posted the picture. You engaged in gratuitous insults. You had nothing better to write about.\nBut how dare I respond.\nI don’t consider it pointless to note that a professor with whom I cordially engaged in lengthy debates over profiling and WWII history has descended into madness. I invited Muller to appear with me on radio. I encouraged students to read our extensive blog exchanges and gave out his website address on C-SPAN and in countless other appearances. If you paid attention to his behavior over the course of those interactions, what he did on Friday was no surprise. He called on his readers to get my book banned. He helped organize a “Historians’ Committee for Fairness” that demanded that any media organization that had me on to talk about my book “formally apologize to the Japanese Americans who have been slandered by Ms. Malkin’s reckless presentation and invite a reputable historian to present a more even-handed view of the evidence.” He allied himself with a hate-filled nut who refers to me as “Me So Michelle.”\nMuller hardly “allied himself” with me, except in that we both found separate and serious historical inaccuracies in Malkin’s ludicrous book, IN DEFENSE OF INTERNMENT.  Given Malkin’s penchant for slinging insults, however feebly, I find it hysterical that she still gets her panties in a bunch over incoming fire.\n“Me small Asian woman.  You no call me names.  Me call you names, okay Joe?”\nAs per usual, she offers no evidence that I am either “hate-filled” or a “nut”, but then, what can you expect from a woman who can’t count to six.  So much for that notion of Asian math supremacy.  I further note that Me So completely forgets to mention that while she was willing to debate Muller on some internment related matters, she has never dared to respond to me or anyone else regarding the question of military necessity because a five-minute comparison of her book with publicly available USN records will reveal that she didn’t even do five minutes worth of research on that rather important aspect of the issue.  In fact, the entire foundation of her book’s premise is tautological.\nHow dare she respond?  Please… she hasn’t dared to respond substantively to me for two years aside from attempting the occasional insult.\nMe so scared….\nUPDATE – Talk about panties and the bunching thereof.  Apparently\nsomeone photoshopped Malkin’s head onto some other girl’s bikini-clad body\nand Muller linked to it, big fucking deal.  It was obviously a joke, Malkin’s protests notwithstanding.  Which leads me to the inescapable thought that if she thinks that’s so awful, I wonder if she’s aware of what one can do with 3D-rendered animations….\nHey, we could use an Asian chick anyhow.  Can you say “easter egg”?\nUPDATE II – Malkin mentions at the bottom:\n“I think what drives a lot of the haters crazy is that despite their ceaseless sniping, they can’t shut me up.”\nActually, I didn’t find it difficult at all.  In fact, her uncharacteristic silence on the subject was downright damning when compared to her usual volubility on matters relating to herself.  Notice how she links to nearly every site but the hate-filled one?\nShe’s rather a contemptible coward behind that faux bold front.  But don’t forget, this is a woman who couldn’t think fast enough on her feet to handle Chris freaking Matthews.  When you’re not smart enough to handle the hair brigade without breaking a sweat, you should probably rethink the whole public intellectual pose.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-01T12:43:00+00:00"
}