{
  "url": "https://voxday.net/2006/10/24/projection-2/",
  "scraped_at": "2026-01-08T21:21:21.139122",
  "title": "Projection",
  "date_display": "October 24, 2006",
  "date_iso": "2006-10-24T09:39:00+00:00",
  "date_from_url": "2006-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Limbaugh ignores who is really colluding with Democrats in <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=52587\">a feeble attempt to flip it around</a>:</p><blockquote><p>Will disgruntled conservatives really collude with Democrats?</p><p>Don’t discount the possibility that all this hype about conservatives staying home is a carefully orchestrated ruse to suppress their turnout. Even if it isn’t, the liberals’ arrogance and premature boasting will surely motivate to the polls all but those rare, implacable conservatives, because even disgruntled conservatives know we can’t afford to teach big-spending Republicans a lesson in the middle of a war.</p></blockquote><p>This is a perfect example of someone who is only paying attention to the media and his own wishful thinking.  Refusing to vote for faux conservative Republican politicians who act, think and vote like moderate Democrats is not colluding with Democrats, it is refusing to support those who are openly and proudly collaborating with them.</p><p>Bush and the national Republican leadership are far worse than even the most cynical Republican loyalist imagines, they are traitors <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=52576\">who are actively working to subvert the very concept of the United States as a nation</a> in favor of a pan-American supernational government.  Not that the domestic betrayals aren’t enough reason to stay far away from the current Republican party as possible, but they’re actually minor in comparison with the ultimate sell-out.</p></div>",
  "content_text": "David Limbaugh ignores who is really colluding with Democrats in\na feeble attempt to flip it around\n:\nWill disgruntled conservatives really collude with Democrats?\nDon’t discount the possibility that all this hype about conservatives staying home is a carefully orchestrated ruse to suppress their turnout. Even if it isn’t, the liberals’ arrogance and premature boasting will surely motivate to the polls all but those rare, implacable conservatives, because even disgruntled conservatives know we can’t afford to teach big-spending Republicans a lesson in the middle of a war.\nThis is a perfect example of someone who is only paying attention to the media and his own wishful thinking.  Refusing to vote for faux conservative Republican politicians who act, think and vote like moderate Democrats is not colluding with Democrats, it is refusing to support those who are openly and proudly collaborating with them.\nBush and the national Republican leadership are far worse than even the most cynical Republican loyalist imagines, they are traitors\nwho are actively working to subvert the very concept of the United States as a nation\nin favor of a pan-American supernational government.  Not that the domestic betrayals aren’t enough reason to stay far away from the current Republican party as possible, but they’re actually minor in comparison with the ultimate sell-out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-24T08:39:00+00:00"
}