{
  "url": "https://voxday.net/2006/10/13/scalzi-has-recipe_13/",
  "scraped_at": "2026-01-08T21:20:24.192686",
  "title": "Scalzi has the recipe",
  "date_display": "October 13, 2006",
  "date_iso": "2006-10-13T11:31:00+00:00",
  "date_from_url": "2006-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ampersand was a good pro-feminist zeta male.  He did his best to support the womyn in their titanic struggle against Patriarchy at Alas, A Blog: <em>“Please note that some posts are marked as “feminist, pro-feminist and feminist-friendly only.”</em></p><p>Alas, <a href=\"http://www.reclusiveleftist.com/?p=411\">the allure of turning Internet pimp</a> proved too sweet for poor Ampersand, demonstrating yet again for those who have not yet figured it out that feminism is nothing more than a tool used by corrupt men to make use of maleducated women who are silly enough to believe in the magic fairy unicorn with the rainbow-colored horn named “Empowerment”.</p><p>Oh, I laughed, I did.  I laughed indeed.  The whole affair is almost as funny <a href=\"http://www.feministe.us/blog/archives/2006/10/12/speaking-of-gloria-steinem/\">as Playboy’s assertion</a> that Amynda and her two <em>sorelle</em> possess one “almost frightening intellect” between them.</p><p>Since I am regularly informed that my opinions and modes of thought are frightening, we can deduce that “almost frightening” must be around three standard deviations above average.  145 IQ / 3 bloggers = just over 48 IQ apiece.  That sounds about right, actually.</p></div>",
  "content_text": "Ampersand was a good pro-feminist zeta male.  He did his best to support the womyn in their titanic struggle against Patriarchy at Alas, A Blog:\n“Please note that some posts are marked as “feminist, pro-feminist and feminist-friendly only.”\nAlas,\nthe allure of turning Internet pimp\nproved too sweet for poor Ampersand, demonstrating yet again for those who have not yet figured it out that feminism is nothing more than a tool used by corrupt men to make use of maleducated women who are silly enough to believe in the magic fairy unicorn with the rainbow-colored horn named “Empowerment”.\nOh, I laughed, I did.  I laughed indeed.  The whole affair is almost as funny\nas Playboy’s assertion\nthat Amynda and her two\nsorelle\npossess one “almost frightening intellect” between them.\nSince I am regularly informed that my opinions and modes of thought are frightening, we can deduce that “almost frightening” must be around three standard deviations above average.  145 IQ / 3 bloggers = just over 48 IQ apiece.  That sounds about right, actually.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-13T10:31:00+00:00"
}