{
  "url": "https://voxday.net/2006/10/09/seeing-where-we-stand/",
  "scraped_at": "2026-01-08T21:20:05.582408",
  "title": "Seeing where we stand",
  "date_display": "October 9, 2006",
  "date_iso": "2006-10-09T10:30:00+00:00",
  "date_from_url": "2006-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An <a href=\"http://www.breitbart.com/news/2006/10/08/D8KKLHBG0.html\">interesting vote looms</a>:</p><blockquote><p>Like other South Dakotans, people in this tiny farming town are confronting a historic opportunity on Nov. 7. They’ll sway a tortuous national debate by making a choice no statewide electorate has faced before: whether to approve a sweeping ban on virtually all abortions….</p><p>The most recent independent poll, in July, found 47 percent of voters opposed the ban, 39 percent favored it, 14 percent were undecided. When asked if they would approve a ban with exceptions for rape and incest, support rose to 59 percent.</p></blockquote><p>This is actual democracy at work.  The state legislature has approved the ban and the people’s referendum, not a handful of judges, will settle the matter.  Despite its flaws, I find it vastly preferable to the limited, representative faux-democracy which is expressly designed to reduce the impact of the people’s will it purports to champion in almost every way.</p><p>There are no shortage of Americans who don’t see abortion as murder, and while their number has no more moral weight than the numbers of Germans who didn’t see Jew-killing as murder or Turks who didn’t see Armenian-killing as murder, this vote will make it difficult for them or the pro-life side to continue to deny the reality of where the country stands on the issue.</p><p>As for me, I find abortion and the murderous mothers who choose to commit it to be equally disgusting.  Their twisted logic and foam-flecked defensiveness make it perfectly clear that they know very well that what they are doing is evil.  Consider <a href=\"http://bitingbeaver.blogspot.com/2006/10/hiatus-will-start-after-this-post.html\">the words of this blogging abortionette</a>, who is the beneficiary of a Pandagonian fundraiser contrived to aid her in the obliteration of her offspring:</p><p><em>When you know that you’re crossing that fucking picket line where those protestors will be screaming the same sort of shit that those commenters did, well….where does the anger go? When you understand that there are those that would fucking KILL you, leaving your existing children to be raised without a mother you start resenting that potential life more than you’ve ever resented anything before….I resent that there are so many that would have me put a gun to my head, or, better yet, they’d do it for me all because I had sex.</em></p><p>This would be downright humorous if it weren’t for the tragic fact that she is actively seeking to slaughter her unborn child.  While I can’t declare with certainty that everyone is as totally indifferent to her having sex as I am, I am certain that the primary reason so many people despise her and even see her as meriting death is because <em>she is blatantly stating her intentions to kill a child!</em> Would she be similarly outraged by those who decried her intention to drown one of her other children?</p><p>The concept of a child’s life being more important than an adult’s is hardly a novel one, as it is inherent in the concept of “women and children first” as well as the male duty to defend his family and his nation.  How unsurprising that a woman, particularly a feminist woman, should totally fail to grasp that honorable concept of duty and self-sacrifice.</p><p>The abortionette argument that the unborn can be slain at will because they aren’t human is no more compelling to anyone with a reasonably developed moral sense than the identical jihadist justification for killing Jews.  To permit those embracing practices so barbaric that the pagan Greeks rejected them more than two thousand years ago to remain members of good standing in our society only demonstrates the depths to which our society has devolved.</p><p>The truth is what it is, regardless of how palatable or convenient we find it.  I am open to the possibility that I am wrong, that there is nothing immoral about terminating pregnancies and we should therefore feel free to enjoy abortion-on-demand or even to advocate mandatory abortions of unpopular minorities.</p><p>But if I am correct and it is true that the wages of sin are death, then an increasingly infanticidal Western civilization will well merit its decline into ignominy and eventual historical obscurity.</p></div>",
  "content_text": "An\ninteresting vote looms\n:\nLike other South Dakotans, people in this tiny farming town are confronting a historic opportunity on Nov. 7. They’ll sway a tortuous national debate by making a choice no statewide electorate has faced before: whether to approve a sweeping ban on virtually all abortions….\nThe most recent independent poll, in July, found 47 percent of voters opposed the ban, 39 percent favored it, 14 percent were undecided. When asked if they would approve a ban with exceptions for rape and incest, support rose to 59 percent.\nThis is actual democracy at work.  The state legislature has approved the ban and the people’s referendum, not a handful of judges, will settle the matter.  Despite its flaws, I find it vastly preferable to the limited, representative faux-democracy which is expressly designed to reduce the impact of the people’s will it purports to champion in almost every way.\nThere are no shortage of Americans who don’t see abortion as murder, and while their number has no more moral weight than the numbers of Germans who didn’t see Jew-killing as murder or Turks who didn’t see Armenian-killing as murder, this vote will make it difficult for them or the pro-life side to continue to deny the reality of where the country stands on the issue.\nAs for me, I find abortion and the murderous mothers who choose to commit it to be equally disgusting.  Their twisted logic and foam-flecked defensiveness make it perfectly clear that they know very well that what they are doing is evil.  Consider\nthe words of this blogging abortionette\n, who is the beneficiary of a Pandagonian fundraiser contrived to aid her in the obliteration of her offspring:\nWhen you know that you’re crossing that fucking picket line where those protestors will be screaming the same sort of shit that those commenters did, well….where does the anger go? When you understand that there are those that would fucking KILL you, leaving your existing children to be raised without a mother you start resenting that potential life more than you’ve ever resented anything before….I resent that there are so many that would have me put a gun to my head, or, better yet, they’d do it for me all because I had sex.\nThis would be downright humorous if it weren’t for the tragic fact that she is actively seeking to slaughter her unborn child.  While I can’t declare with certainty that everyone is as totally indifferent to her having sex as I am, I am certain that the primary reason so many people despise her and even see her as meriting death is because\nshe is blatantly stating her intentions to kill a child!\nWould she be similarly outraged by those who decried her intention to drown one of her other children?\nThe concept of a child’s life being more important than an adult’s is hardly a novel one, as it is inherent in the concept of “women and children first” as well as the male duty to defend his family and his nation.  How unsurprising that a woman, particularly a feminist woman, should totally fail to grasp that honorable concept of duty and self-sacrifice.\nThe abortionette argument that the unborn can be slain at will because they aren’t human is no more compelling to anyone with a reasonably developed moral sense than the identical jihadist justification for killing Jews.  To permit those embracing practices so barbaric that the pagan Greeks rejected them more than two thousand years ago to remain members of good standing in our society only demonstrates the depths to which our society has devolved.\nThe truth is what it is, regardless of how palatable or convenient we find it.  I am open to the possibility that I am wrong, that there is nothing immoral about terminating pregnancies and we should therefore feel free to enjoy abortion-on-demand or even to advocate mandatory abortions of unpopular minorities.\nBut if I am correct and it is true that the wages of sin are death, then an increasingly infanticidal Western civilization will well merit its decline into ignominy and eventual historical obscurity.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-09T09:30:00+00:00"
}