{
  "url": "https://voxday.net/2006/10/05/where-responsibility-lies/",
  "scraped_at": "2026-01-08T21:19:41.973204",
  "title": "Where responsibility lies",
  "date_display": "October 5, 2006",
  "date_iso": "2006-10-05T09:33:00+00:00",
  "date_from_url": "2006-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I frequently criticize the maleficent effect of women’s involvement in politics, but, as <a href=\"http://www.dilbert.com/comics/dilbert/archive/dilbert-20060926.html\">this Dilbert cartoon illustrates rather nicely</a>, it’s not with women where the ultimate blame for the current state of civilization rests.</p><p>And I quite liked <a href=\"http://www.dilbert.com/comics/dilbert/archive/dilbert-20060927.html\">the next day’s cartoon</a>, wherein Mr. Adams describes one of the hot woman’s natural enemies.  While many men harbor an amount of dislike for pretty boys, you will see – and hear – almost as much visceral hatred taking a swimsuit model wearing a tight dress out in public than you would escorting an Orthodox Jew to synagogue in Riyadh.</p><p>I always wonder why small-breasted women who loudly snap “I bet those aren’t real” don’t simply shut up and get some decent implants themselves.  Do they not hear the envy and the spite in their own voices?  If they didn’t care it wouldn’t bother them, so obviously they do.  But if that’s the case, then why not do something about it?  If men could acquire hair or larger penises so easily, we’d be a nation of Fabio Jeremies.</p><p>Now, I don’t know if women would consider that to be a good thing or not, especially given how men tend to overdo it.  Given what some guys do with free weights alone, the mind threatens to boggle.</p></div>",
  "content_text": "I frequently criticize the maleficent effect of women’s involvement in politics, but, as\nthis Dilbert cartoon illustrates rather nicely\n, it’s not with women where the ultimate blame for the current state of civilization rests.\nAnd I quite liked\nthe next day’s cartoon\n, wherein Mr. Adams describes one of the hot woman’s natural enemies.  While many men harbor an amount of dislike for pretty boys, you will see – and hear – almost as much visceral hatred taking a swimsuit model wearing a tight dress out in public than you would escorting an Orthodox Jew to synagogue in Riyadh.\nI always wonder why small-breasted women who loudly snap “I bet those aren’t real” don’t simply shut up and get some decent implants themselves.  Do they not hear the envy and the spite in their own voices?  If they didn’t care it wouldn’t bother them, so obviously they do.  But if that’s the case, then why not do something about it?  If men could acquire hair or larger penises so easily, we’d be a nation of Fabio Jeremies.\nNow, I don’t know if women would consider that to be a good thing or not, especially given how men tend to overdo it.  Given what some guys do with free weights alone, the mind threatens to boggle.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-10-05T08:33:00+00:00"
}