{
  "url": "https://voxday.net/2022/03/28/an-interview-with-alex-macris/",
  "scraped_at": "2026-01-08T13:14:12.688846",
  "title": "An Interview with Alex Macris",
  "date_display": "March 28, 2022",
  "date_iso": "2022-03-28T13:32:08+00:00",
  "date_from_url": "2022-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Dark Herald interviews game designer and Arktoons author Alexander Macris <a href=\"https://arkhavencomics.com/2022/03/27/interview-alexander-macris/\">at the Arkhaven blog</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Yes, I’m pretending to be a reporter today.</p><p>Not. A. Journalist. A reporter, there’s a difference in my mind.</p><p>My introduction to Alexander Macris was rather typical for me. I was complaining about something. In this particular case, it was the Twitteratti canceling Tracy Hickman for promoting an upcoming revival of the Dragon Lance series. The Stans had decided that they were enraged that week over a tweet that jokingly threw some shade at Critical Role. Apparently, this tweet was attacking non-existent races, and for reasons that I am simply not stupid enough to understand, this is racist. In truth, I think the reason was one of economics. The demand for racism vastly outstrips the available supply these days.</p><p>I wrote an article about how ridiculous this all was. And also that I had absolutely no use at all for 5th Edition D&amp;D.</p><p>It was shortly after this, that the Darklings introduced me to a new gaming system called Adventurer Conqueror King. And I took note of the game designer’s name Alexander Macris. That was my introduction to him.</p><p>He has had a widespread career in the genre, having been a publisher, a tabletop game designer, and now a comic book creator. His latest project is <a href=\"https://www.arkhaven.com/comics/superhero/ascendant-star-spangled-squadron\">the graphic novel Ascendant</a>, currently available as a webtoon at Arkhaven.com. Mister Macris recently set aside some time for an interview with me.</p><p><strong>Dark Herald: </strong>Why did you create the role-playing game; Adventurer Conqueror King?</p><p><strong>Alexander Macris:</strong> I’ve been a lifelong tabletop gamer and a tabletop game designer since undergraduate when I wrote Modern Spearhead. In 2008 I began to run a campaign using Basic and Expert Dungeons &amp; Dragons as part of the “Old School Renaissance.” Unlike most D&amp;D campaigns, my campaign advanced into the rulership of huge empires with mass battles with thousands of troops. Over the two years of the campaign I adapted and wrote a lot of new material to handle gameplay at that scale. As the campaign was winding down, my wife Amy became chronically ill with what we now know to be mitochondrial disease. As she became bedridden I found myself with a lot of time where I needed to be at home nearby while she was sleeping, thus engaging in some quiet activity. Amy suggested I should publish my gaming material. I had the good fortune of partnering with some talented friends who were also very excited about the idea, and we took advantage of the opportunity from the then-new platform Kickstarter to launch a crowdfunding campaign. The name Adventurer Conqueror King System was inspired by the old Conan paperbacks, “Conan the Adventurer,” “Conan the Conqueror,” etc. Our first Kickstarter was successful enough to fund a second and the business grew from there. Today ACKS is well-regarded as the best version of D20 fantasy for players interested in a “domain play” with robust rules for everything from mass combat to magical experimentation.</p><p><strong>Dark Herald:</strong> When did you first see the problems that were setting in with the Big Two of DC and Marvel?</p><p><strong>Alexander Macris:</strong> I don’t see the situation at DC and Marvel as a problem so much as an opportunity. DC and Marvel seem to have decided to pursue new audiences by embracing viewpoints that appeal to that audience. If their choice succeeds, they’ll prosper. If it doesn’t, they’ll endure the failure. Either way, their choice creates an opportunity for independent comic creators who want to offer storytelling in more classic modes. I couldn’t make money offering Star-Spangled Squadron if every comic buyer was satisfied with the latest offering of Justice League.</p></blockquote><p>Read the whole thing there. And if you’re a comics reader, have a look at backing the crowdfunding campaign for the Arktoons comic <a href=\"https://www.indiegogo.com/projects/ascendant-star-spangled-squadron#/\"><em>ASCENDANT: STAR-SPANGLED SQUADRON</em>.</a></p><p><em><a href=\"https://social.infogalactic.com/micropost/0af74c89-4eda-44e7-a056-acaf4386e956\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Dark Herald interviews game designer and Arktoons author Alexander Macris\nat the Arkhaven blog\n.\nYes, I’m pretending to be a reporter today.\nNot. A. Journalist. A reporter, there’s a difference in my mind.\nMy introduction to Alexander Macris was rather typical for me. I was complaining about something. In this particular case, it was the Twitteratti canceling Tracy Hickman for promoting an upcoming revival of the Dragon Lance series. The Stans had decided that they were enraged that week over a tweet that jokingly threw some shade at Critical Role. Apparently, this tweet was attacking non-existent races, and for reasons that I am simply not stupid enough to understand, this is racist. In truth, I think the reason was one of economics. The demand for racism vastly outstrips the available supply these days.\nI wrote an article about how ridiculous this all was. And also that I had absolutely no use at all for 5th Edition D&D.\nIt was shortly after this, that the Darklings introduced me to a new gaming system called Adventurer Conqueror King. And I took note of the game designer’s name Alexander Macris. That was my introduction to him.\nHe has had a widespread career in the genre, having been a publisher, a tabletop game designer, and now a comic book creator. His latest project is\nthe graphic novel Ascendant\n, currently available as a webtoon at Arkhaven.com. Mister Macris recently set aside some time for an interview with me.\nDark Herald:\nWhy did you create the role-playing game; Adventurer Conqueror King?\nAlexander Macris:\nI’ve been a lifelong tabletop gamer and a tabletop game designer since undergraduate when I wrote Modern Spearhead. In 2008 I began to run a campaign using Basic and Expert Dungeons & Dragons as part of the “Old School Renaissance.” Unlike most D&D campaigns, my campaign advanced into the rulership of huge empires with mass battles with thousands of troops. Over the two years of the campaign I adapted and wrote a lot of new material to handle gameplay at that scale. As the campaign was winding down, my wife Amy became chronically ill with what we now know to be mitochondrial disease. As she became bedridden I found myself with a lot of time where I needed to be at home nearby while she was sleeping, thus engaging in some quiet activity. Amy suggested I should publish my gaming material. I had the good fortune of partnering with some talented friends who were also very excited about the idea, and we took advantage of the opportunity from the then-new platform Kickstarter to launch a crowdfunding campaign. The name Adventurer Conqueror King System was inspired by the old Conan paperbacks, “Conan the Adventurer,” “Conan the Conqueror,” etc. Our first Kickstarter was successful enough to fund a second and the business grew from there. Today ACKS is well-regarded as the best version of D20 fantasy for players interested in a “domain play” with robust rules for everything from mass combat to magical experimentation.\nDark Herald:\nWhen did you first see the problems that were setting in with the Big Two of DC and Marvel?\nAlexander Macris:\nI don’t see the situation at DC and Marvel as a problem so much as an opportunity. DC and Marvel seem to have decided to pursue new audiences by embracing viewpoints that appeal to that audience. If their choice succeeds, they’ll prosper. If it doesn’t, they’ll endure the failure. Either way, their choice creates an opportunity for independent comic creators who want to offer storytelling in more classic modes. I couldn’t make money offering Star-Spangled Squadron if every comic buyer was satisfied with the latest offering of Justice League.\nRead the whole thing there. And if you’re a comics reader, have a look at backing the crowdfunding campaign for the Arktoons comic\nASCENDANT: STAR-SPANGLED SQUADRON\n.\nDISCUSS ON SG",
  "tags": [
    "Arktoons",
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-28T13:53:23+00:00"
}