{
  "url": "https://voxday.net/2022/03/21/at-least-his-feelings-are-safe/",
  "scraped_at": "2026-01-08T13:13:28.585900",
  "title": "At Least His Feelings Are Safe",
  "date_display": "March 21, 2022",
  "date_iso": "2022-03-21T13:18:19+00:00",
  "date_from_url": "2022-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A tragi-comedy in three acts.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>SPACEBUNNY: </strong>Women instinctively hate and avoid gammas – <a href=\"https://www.yahoo.com/lifestyle/women-sharing-moment-realized-were-004502419.html\">these are all examples</a> of gamma behaviour and are not genuine nice guys. The genuine nice guy might not always get the girl, but he almost always eventually gets a girl, settles down, gets married and has a family. These guys will never have any of that.</p><p><strong>MGTOW</strong>: I just went MGTOW instead and stop caring about what women consider a nice guy or not. Actually I stopped caring what women consider full stop, my bank account and emotional health has never been better.</p><p><strong>VD: </strong>And you have also rendered yourself entirely irrelevant to human society until you die alone and forgotten. Congratulations. A hedonistic, coke-addled musician who can’t figure out how to put on a condom is literally more useful to the world than you are, and will contribute more to the future than you ever will. But at least you won’t get your feelings hurt again, and that’s what’s important.</p></blockquote><p>The reality is that the whole Men Going Their Own Way (MGTOW) act is little more than gamma posturing. Omegas who have no choice but to go their own way due to social rejection don’t make such a major production of it and are usually quite willing to admit that they are lonely and would prefer that things were otherwise. And most MGTOW will drop the act in a heartbeat if a woman happens to smile at them or say something nice to them, at least until they inevitably say something that causes the smile to vanish from her face and inspires her to flee as quickly as social etiquette permits.</p><p>Lifelong loneliness is not a reasonable price to pay for avoiding the occasional rejection by women. And there is no point in pretending you are not lonely, because if you weren’t, you wouldn’t be constantly posting on social media telling strangers how you don’t care what women think about you. And doubling down on the very weirdness that both men and women find off-putting is not something that will increase either your emotional health or your odds of social success.</p><p>If your life sucks, then change it. What have you got to lose?</p><p><em><a href=\"https://social.infogalactic.com/micropost/e93fad5e-f2a2-45fe-a98f-21650ffe8f6f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A tragi-comedy in three acts.\nSPACEBUNNY:\nWomen instinctively hate and avoid gammas –\nthese are all examples\nof gamma behaviour and are not genuine nice guys. The genuine nice guy might not always get the girl, but he almost always eventually gets a girl, settles down, gets married and has a family. These guys will never have any of that.\nMGTOW\n: I just went MGTOW instead and stop caring about what women consider a nice guy or not. Actually I stopped caring what women consider full stop, my bank account and emotional health has never been better.\nVD:\nAnd you have also rendered yourself entirely irrelevant to human society until you die alone and forgotten. Congratulations. A hedonistic, coke-addled musician who can’t figure out how to put on a condom is literally more useful to the world than you are, and will contribute more to the future than you ever will. But at least you won’t get your feelings hurt again, and that’s what’s important.\nThe reality is that the whole Men Going Their Own Way (MGTOW) act is little more than gamma posturing. Omegas who have no choice but to go their own way due to social rejection don’t make such a major production of it and are usually quite willing to admit that they are lonely and would prefer that things were otherwise. And most MGTOW will drop the act in a heartbeat if a woman happens to smile at them or say something nice to them, at least until they inevitably say something that causes the smile to vanish from her face and inspires her to flee as quickly as social etiquette permits.\nLifelong loneliness is not a reasonable price to pay for avoiding the occasional rejection by women. And there is no point in pretending you are not lonely, because if you weren’t, you wouldn’t be constantly posting on social media telling strangers how you don’t care what women think about you. And doubling down on the very weirdness that both men and women find off-putting is not something that will increase either your emotional health or your odds of social success.\nIf your life sucks, then change it. What have you got to lose?\nDISCUSS ON SG",
  "tags": [
    "Alpha Game",
    "Gamma",
    "SSH"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-21T13:18:38+00:00"
}