{
  "url": "https://voxday.net/2022/03/02/justified-and-necessary/",
  "scraped_at": "2026-01-08T13:11:16.973280",
  "title": "Justified and Necessary",
  "date_display": "March 2, 2022",
  "date_iso": "2022-03-02T14:00:00+00:00",
  "date_from_url": "2022-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The more you look into <a href=\"https://www.irishsavant.net/?p=1843\">the details of the history of the current Russo-Ukrainian conflict</a>, the more it becomes clear that a) this conflict has very little to do with the Ukrainian people per se, b) NATO, the US government, and the judeochristians who influence the latter are the parties responsible for the bloodshed, and c) Russia’s military intervention is not only justified and necessary, but long overdue.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Well if you’re like me you’ve been taken aback by the scale and comprehensiveness of the Russian invasion of Ukraine. It’s the boy who cried wolf all over again I suppose. However, a deeper analysis makes Putin’s move more understandable. I hadn’t been aware that Ukraine has become a de facto if not de jure NATO member, an absolute red line for Russia as Putin had made clear on numerous occasions. As he has pointed out the Ukrainian military control system has already been integrated into NATO and a network of airfields upgraded with US help which enables the rapid transportation of very large numbers of troops. Ukraine’s airspace is open to flights by US strategic and reconnaissance aircraft and drones that conduct surveillance over Russian territory. He added that the US-built Maritime Operations Centre in Ochakov makes it possible to support activity by NATO warships, including the use of precision weapons, against the Russian Black Sea Fleet and its supporting infrastructure.</p><p>Since the ZOG coup in 2014 that toppled Ukraine’s elected government and installed a largely Jewish regime in its place Russia has fully supported the Minsk agreement which provides the two eastern republics with political autonomy. But the Ukrainian regime, egged on by its American ZOG puppeteers, has ignored the agreement. In the interim the country has become ZATOised, subjecting the Donbass region to endless blockades, rocket attacks and shelling. As recorded by the OECD on <em>the day before Russia invaded Kiev fired over 1,500 shells on villages in Donetsk and Luganask</em>… The penny – kopek – has finally dropped that any form of partnership with the ZATO countries is futile.</p></blockquote><p>In support of the Savant’s narrative, there is this piece chronicling <a href=\"https://popularresistance.org/ukraine-intensifies-shelling-of-donbass-as-western-media-are-silent/\">the persistent Ukrainian artillery bombardment of civilians in the Donbass</a>. Note that it’s dated <strong>March 3, <em>2021</em></strong>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>While much of the world is focused on Covid-related issues, Ukraine’s seven-year war on the people of Donbass continues. In recent weeks, Kiev’s shelling of civilians has intensified, met by the predictable Western media silence.</p><p>Ostensibly, following the Minsk agreements, there was a ceasefire. In reality, Donbass residents in villages bordering peace lines are incessantly subject to Ukrainian shelling. Ukraine uses heavy weapons in violation of the agreement, including 82mm and 120mm mortar shells, routinely shelling at night when Organization for Security and Cooperation in Europe (OSCE) observers are not patrolling the area.</p><p>But Ukrainian forces also shell during the day, and have done so a lot more of late, including allegedly with phosphorus, and shelling further behind the front lines.</p><p>Most people could be forgiven for not being aware of events in Ukraine’s breakaway Republics of Donetsk and Lugansk (DPR/LPR) in the Donbass region, with corporate media either not touching the matter or doing so with glasses tinted heavily by the Ukrainian government. There are in fact journalists and news sites that regularly give updates, but they aren’t as widely known as they should be.</p><p>From my own September 2019 reporting from frontline villages of the DPR, I maintain contact with reporters and residents who update on the situation there.</p><p>One of these was the mayor of Gorlovka, a city northeast of Donetsk, who on his Telegram channel on February 19 detailed the nearby villages of Zaitsevo and Mine 6/7 being under heavy weapons fire (by Ukraine). On February 20, he wrote of Mine 6/7 and another village being heavily shelled since early morning, with locals saying more than one hundred hits occurred.</p><p>The same day, Alexey Karpushev, a resident of the northern city of Gorlovka, wrote, “From about five in the morning until now, there is heavy shelling of the city from the Air Force artillery.”</p><p>According to Karpushev – who is a former first secretary of Gorlovka’s committee of the Communist Party of Ukraine – in recent weeks, the number of attacks from the Ukrainian army “increased significantly.” He mentioned that a 22 year old civilian was recently seriously injured in the attacks.</p><p>I asked why the increased shelling now.</p><p>“Ukraine’s aggression intensified just when Biden came to power in the United States.” It is quite likely that President Volodymyr Zelensky feels more confident with the return of the warmongers to the White House.</p><cite><em>Ukraine Intensifies Shelling of Donbass as Western Media are Silent</em>, 3 March 2021</cite></blockquote><p>There is absolutely no question whatsoever that the Russian military operation enacted to remove the ZATO puppet regime from power in Ukraine is 100 percent justified, both morally and under international law. Nor is there any serious question that the operation is going to be successful, as a significant part of the Ukrainian regular forces are already trapped in a WWII-style grand encirclement.</p><div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img alt=\"\" decoding=\"async\" fetchpriority=\"high\" height=\"397\" src=\"https://social.infogalactic.com/images/posts/3ba0b215-2e40-48eb-bbc6-fcdd04c27858/original-3503daf523a087043c5d9f09a851290d.jpg?v=63813449971\" width=\"512\"><figcaption>UKRAINE MAP DAY 6 – The Saker</figcaption></img></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/260f81aa-6403-4a39-9f00-9175ac9067e8\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The more you look into\nthe details of the history of the current Russo-Ukrainian conflict\n, the more it becomes clear that a) this conflict has very little to do with the Ukrainian people per se, b) NATO, the US government, and the judeochristians who influence the latter are the parties responsible for the bloodshed, and c) Russia’s military intervention is not only justified and necessary, but long overdue.\nWell if you’re like me you’ve been taken aback by the scale and comprehensiveness of the Russian invasion of Ukraine. It’s the boy who cried wolf all over again I suppose. However, a deeper analysis makes Putin’s move more understandable. I hadn’t been aware that Ukraine has become a de facto if not de jure NATO member, an absolute red line for Russia as Putin had made clear on numerous occasions. As he has pointed out the Ukrainian military control system has already been integrated into NATO and a network of airfields upgraded with US help which enables the rapid transportation of very large numbers of troops. Ukraine’s airspace is open to flights by US strategic and reconnaissance aircraft and drones that conduct surveillance over Russian territory. He added that the US-built Maritime Operations Centre in Ochakov makes it possible to support activity by NATO warships, including the use of precision weapons, against the Russian Black Sea Fleet and its supporting infrastructure.\nSince the ZOG coup in 2014 that toppled Ukraine’s elected government and installed a largely Jewish regime in its place Russia has fully supported the Minsk agreement which provides the two eastern republics with political autonomy. But the Ukrainian regime, egged on by its American ZOG puppeteers, has ignored the agreement. In the interim the country has become ZATOised, subjecting the Donbass region to endless blockades, rocket attacks and shelling. As recorded by the OECD on\nthe day before Russia invaded Kiev fired over 1,500 shells on villages in Donetsk and Luganask\n… The penny – kopek – has finally dropped that any form of partnership with the ZATO countries is futile.\nIn support of the Savant’s narrative, there is this piece chronicling\nthe persistent Ukrainian artillery bombardment of civilians in the Donbass\n. Note that it’s dated\nMarch 3,\n2021\n.\nWhile much of the world is focused on Covid-related issues, Ukraine’s seven-year war on the people of Donbass continues. In recent weeks, Kiev’s shelling of civilians has intensified, met by the predictable Western media silence.\nOstensibly, following the Minsk agreements, there was a ceasefire. In reality, Donbass residents in villages bordering peace lines are incessantly subject to Ukrainian shelling. Ukraine uses heavy weapons in violation of the agreement, including 82mm and 120mm mortar shells, routinely shelling at night when Organization for Security and Cooperation in Europe (OSCE) observers are not patrolling the area.\nBut Ukrainian forces also shell during the day, and have done so a lot more of late, including allegedly with phosphorus, and shelling further behind the front lines.\nMost people could be forgiven for not being aware of events in Ukraine’s breakaway Republics of Donetsk and Lugansk (DPR/LPR) in the Donbass region, with corporate media either not touching the matter or doing so with glasses tinted heavily by the Ukrainian government. There are in fact journalists and news sites that regularly give updates, but they aren’t as widely known as they should be.\nFrom my own September 2019 reporting from frontline villages of the DPR, I maintain contact with reporters and residents who update on the situation there.\nOne of these was the mayor of Gorlovka, a city northeast of Donetsk, who on his Telegram channel on February 19 detailed the nearby villages of Zaitsevo and Mine 6/7 being under heavy weapons fire (by Ukraine). On February 20, he wrote of Mine 6/7 and another village being heavily shelled since early morning, with locals saying more than one hundred hits occurred.\nThe same day, Alexey Karpushev, a resident of the northern city of Gorlovka, wrote, “From about five in the morning until now, there is heavy shelling of the city from the Air Force artillery.”\nAccording to Karpushev – who is a former first secretary of Gorlovka’s committee of the Communist Party of Ukraine – in recent weeks, the number of attacks from the Ukrainian army “increased significantly.” He mentioned that a 22 year old civilian was recently seriously injured in the attacks.\nI asked why the increased shelling now.\n“Ukraine’s aggression intensified just when Biden came to power in the United States.” It is quite likely that President Volodymyr Zelensky feels more confident with the return of the warmongers to the White House.\nUkraine Intensifies Shelling of Donbass as Western Media are Silent\n, 3 March 2021\nThere is absolutely no question whatsoever that the Russian military operation enacted to remove the ZATO puppet regime from power in Ukraine is 100 percent justified, both morally and under international law. Nor is there any serious question that the operation is going to be successful, as a significant part of the Ukrainian regular forces are already trapped in a WWII-style grand encirclement.\nUKRAINE MAP DAY 6 – The Saker\nDISCUSS ON SG",
  "tags": [
    "neocons",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-02T14:28:23+00:00"
}