{
  "url": "https://voxday.net/2022/03/29/polishing-the-library/",
  "scraped_at": "2026-01-08T13:14:17.864284",
  "title": "Polishing the Library",
  "date_display": "March 29, 2022",
  "date_iso": "2022-03-29T11:34:49+00:00",
  "date_from_url": "2022-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that the Arkhaven site has been stabilized, we’ve been able to get <a href=\"https://arkhavencomics.com/product-category/leather/\">the Castalia Library store</a> updated and make some of the books that had not been available to purchase available again. We even managed to find a few copies of <em>THE MISSIONARIES</em> and <em>AWAKE IN THE NIGHT LAND</em> squirreled away; please don’t get too excited, as both books are already out of stock again. So the first three books in the Library series are now sold out.</p><p>The more significant news is that both Library and Libraria editions of <em><a href=\"https://arkhavencomics.com/product/book4-library/\">THE DIVINE COMEDY</a></em> are available, as are <em><a href=\"https://arkhavencomics.com/product/discourses-library-edition/\">DISCOURSES</a></em>, <em><a href=\"https://arkhavencomics.com/product/aristotle-rhetoric-library/\">RHETORIC</a></em>, <em><a href=\"https://arkhavencomics.com/product/ethics-library-edition/\">ETHICS</a></em>, and<em> <a href=\"https://arkhavencomics.com/product/the-jungle-books-library-edition/\">THE JUNGLE BOOKS</a></em>. The cover on the latter is especially fine, as a comparison with the more expensive Easton Press edition tends to demonstrate.</p><div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img alt=\"\" decoding=\"async\" fetchpriority=\"high\" height=\"497\" src=\"https://social.infogalactic.com/images/posts/164b1af4-b4cc-4371-994c-ed3329c89544/original-0b2daa1c436591f62dddabf179cfcd2b.jpg?v=63815751143\" width=\"704\"/></figure></div><p>The next book in the Castalia Library series is <em>POLITICS </em>by Aristotle, which will complete the three-volume ersatz trilogy that we are publishing. While we may one day publish a Complete Works set of Aristotle, we will not do so as part of <a href=\"https://arkhavencomics.com/product/castalia-library-subscription/\">the main subscription</a>. And don’t forget, subscribers can utilize their Library discount to purchase additional volumes at the subscription price.</p><p>On the production side, we’re now working on getting <em>ATOB Vol. I</em>, <em>ATOB Vol. II</em>, and <em>DISCOURSES </em>shipped in April and May. The bindery is having compressed air and water installed in preparation for the arrival of the machines, most likely in May.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9c4d9a7e-98b9-4c30-87cf-d3d6206d71f1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Now that the Arkhaven site has been stabilized, we’ve been able to get\nthe Castalia Library store\nupdated and make some of the books that had not been available to purchase available again. We even managed to find a few copies of\nTHE MISSIONARIES\nand\nAWAKE IN THE NIGHT LAND\nsquirreled away; please don’t get too excited, as both books are already out of stock again. So the first three books in the Library series are now sold out.\nThe more significant news is that both Library and Libraria editions of\nTHE DIVINE COMEDY\nare available, as are\nDISCOURSES\n,\nRHETORIC\n,\nETHICS\n, and\nTHE JUNGLE BOOKS\n. The cover on the latter is especially fine, as a comparison with the more expensive Easton Press edition tends to demonstrate.\nThe next book in the Castalia Library series is\nPOLITICS\nby Aristotle, which will complete the three-volume ersatz trilogy that we are publishing. While we may one day publish a Complete Works set of Aristotle, we will not do so as part of\nthe main subscription\n. And don’t forget, subscribers can utilize their Library discount to purchase additional volumes at the subscription price.\nOn the production side, we’re now working on getting\nATOB Vol. I\n,\nATOB Vol. II\n, and\nDISCOURSES\nshipped in April and May. The bindery is having compressed air and water installed in preparation for the arrival of the machines, most likely in May.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-29T11:45:42+00:00"
}