{
  "url": "https://voxday.net/2022/03/18/the-significance/",
  "scraped_at": "2026-01-08T13:13:08.269871",
  "title": "The Significance",
  "date_display": "March 18, 2022",
  "date_iso": "2022-03-18T13:55:37+00:00",
  "date_from_url": "2022-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A lot of the misinformation – as opposed to intentional disinformation – being broadcast across the West can be more correctly interpreted and understood if you consider some of <a href=\"https://thesaker.is/briefing-by-russian-defence-ministry-statement/\">the implications of the statements</a> being released by the Russian Defence Ministry.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>▫️ The Armed Forces of the Russian Federation continue the special military operation.</p><p>▫️ The grouping of troops of the Lugansk People’s Republic with the fire support of the Russian Armed Forces liberated more than 90 percent of the territory of the republic.</p><p>▫️ Currently, the units of the Lugansk People’s Republic are eliminating scattered groups of nationalists on the southern outskirts of Rubezhnoye liberated settlement.</p><p>▫️ In the Donetsk People’s Republic, the Armed Forces of the Russian Federation continue their successful offensive in the northern direction. During the day, they took control of Zolotaya Niva, Novodonetsky, Novomayorskoye and Prechistovka. The advance was 16 kilometers.</p></blockquote><p>Ignore the rhetoric and the various factual claims, which may or may not be true. What do you notice about the specific military <em>elements </em>that are being discussed?</p><p>The significant element worth noting here, in my opinion, is that the main offensives are being conducted by the Republican militias. The Russians aren’t even utilizing their second-line infantry against the best Ukrainian brigades in the east, except apparently in Mariupol where the formidable Azov Special Operations Detachment has been surrounded by Russian regulars.</p><p>The Russian military is offering artillery, air, and sea support to the militias, as well as air defense, but they are not engaging their armor and infantry forces on every front. This reliance upon the militias for the ground offensive may account for what Western observers consider to be suboptimal tactics and higher-than-expected casualty rates, as well as the observation that it is mostly older, outdated tanks and APCs being destroyed.</p><p>The fact that using one’s least-experienced and least-valued forces first has been a common method of warmaking since Xerxes sent the Medes against the Spartans before sending in his Immortals at the Battle of Thermopylae appears to have escaped the media’s military experts. Apparently their grasp of military history and theory doesn’t even rise to <a href=\"https://www.arkhaven.com/comics/fantasy/a-throne-of-bones/the-wardogs-coin\">the level of Arkhaven comics</a>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/678bcda7-e05a-459a-ac3d-9d9cc7b06a2d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A lot of the misinformation – as opposed to intentional disinformation – being broadcast across the West can be more correctly interpreted and understood if you consider some of\nthe implications of the statements\nbeing released by the Russian Defence Ministry.\n▫️ The Armed Forces of the Russian Federation continue the special military operation.\n▫️ The grouping of troops of the Lugansk People’s Republic with the fire support of the Russian Armed Forces liberated more than 90 percent of the territory of the republic.\n▫️ Currently, the units of the Lugansk People’s Republic are eliminating scattered groups of nationalists on the southern outskirts of Rubezhnoye liberated settlement.\n▫️ In the Donetsk People’s Republic, the Armed Forces of the Russian Federation continue their successful offensive in the northern direction. During the day, they took control of Zolotaya Niva, Novodonetsky, Novomayorskoye and Prechistovka. The advance was 16 kilometers.\nIgnore the rhetoric and the various factual claims, which may or may not be true. What do you notice about the specific military\nelements\nthat are being discussed?\nThe significant element worth noting here, in my opinion, is that the main offensives are being conducted by the Republican militias. The Russians aren’t even utilizing their second-line infantry against the best Ukrainian brigades in the east, except apparently in Mariupol where the formidable Azov Special Operations Detachment has been surrounded by Russian regulars.\nThe Russian military is offering artillery, air, and sea support to the militias, as well as air defense, but they are not engaging their armor and infantry forces on every front. This reliance upon the militias for the ground offensive may account for what Western observers consider to be suboptimal tactics and higher-than-expected casualty rates, as well as the observation that it is mostly older, outdated tanks and APCs being destroyed.\nThe fact that using one’s least-experienced and least-valued forces first has been a common method of warmaking since Xerxes sent the Medes against the Spartans before sending in his Immortals at the Battle of Thermopylae appears to have escaped the media’s military experts. Apparently their grasp of military history and theory doesn’t even rise to\nthe level of Arkhaven comics\n.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-18T13:55:40+00:00"
}