{
  "url": "https://voxday.net/2022/03/21/the-laptop-is-real/",
  "scraped_at": "2026-01-08T13:13:26.729139",
  "title": "The Laptop is Real",
  "date_display": "March 21, 2022",
  "date_iso": "2022-03-21T10:31:05+00:00",
  "date_from_url": "2022-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Of course, we all knew it was, and that it wasn’t “Russian disinformation” as dozens of now-discredited globalist “intelligence officers” falsely claimed it was in the runup to the 2020 US presidential election. And while we’ve learned to be deeply skeptical of a) any information actually being released to the public and b) the damning nature of any information that is released to the public <a href=\"https://gab.com/Lebronsonroids/posts/107992781183954219\">when a big drop is being advertised</a>, the fact that <em>The New York Times</em> is suddenly attempting to get in front of the Narrative on Hunter Biden’s laptop may be an indication that the full information from the laptop will actually be made available.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>People, there are over 100k texts we are curating and 128k emails. Before almost all were hidden in archives and difficult to access without a pertinent search term. We have also found thousands of pictures he “thought” he deleted. Some stuff, I’m uncomfortable even explaining. When I say it is over – I mean it. Please pray and keep your Constitution close.</p><p>The world is not ready for what my team has found. Fair warning, every person on planet earth, with a badge will have access by the end of week.</p><cite>Jack Maxey</cite></blockquote><p>But in general, I absolutely agree with this individual’s reaction to the news that the information is not only significant, but will be released by the end of the week.</p><p><em>Just release it. Why telegraph how earth shattering it will be. Either it won’t be or they take you out. The key to information is sneak attack not telling the enemy what you will do.</em></p><p>It’s increasingly tedious and tiresome to listen to self-promoters and would-be media figures babbling about “releasing the kraken” or whatever for days, weeks, and sometimes even months instead of simply putting the full, complete, and unredacted information in front of the public for the people to judge for themselves. And then, of course, nothing ever happens, no one is arrested, and nothing of any significance changes.</p><p>Optics and information is no substitute for action, as Mr. Putin has vividly demonstrated.</p><p>So, let me know once it happens, otherwise, I will continue to not pay any attention to it. I’m not interested in anyone’s opinion or interpretation or explanation of anything; if I can’t review the original source material, then I’m not interested in the massaged version abridged and dumbed-down for the public.</p><p><em><a href=\"https://social.infogalactic.com/micropost/3e82bf37-3463-40c4-8e61-d06cbea64faa\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Of course, we all knew it was, and that it wasn’t “Russian disinformation” as dozens of now-discredited globalist “intelligence officers” falsely claimed it was in the runup to the 2020 US presidential election. And while we’ve learned to be deeply skeptical of a) any information actually being released to the public and b) the damning nature of any information that is released to the public\nwhen a big drop is being advertised\n, the fact that\nThe New York Times\nis suddenly attempting to get in front of the Narrative on Hunter Biden’s laptop may be an indication that the full information from the laptop will actually be made available.\nPeople, there are over 100k texts we are curating and 128k emails. Before almost all were hidden in archives and difficult to access without a pertinent search term. We have also found thousands of pictures he “thought” he deleted. Some stuff, I’m uncomfortable even explaining. When I say it is over – I mean it. Please pray and keep your Constitution close.\nThe world is not ready for what my team has found. Fair warning, every person on planet earth, with a badge will have access by the end of week.\nJack Maxey\nBut in general, I absolutely agree with this individual’s reaction to the news that the information is not only significant, but will be released by the end of the week.\nJust release it. Why telegraph how earth shattering it will be. Either it won’t be or they take you out. The key to information is sneak attack not telling the enemy what you will do.\nIt’s increasingly tedious and tiresome to listen to self-promoters and would-be media figures babbling about “releasing the kraken” or whatever for days, weeks, and sometimes even months instead of simply putting the full, complete, and unredacted information in front of the public for the people to judge for themselves. And then, of course, nothing ever happens, no one is arrested, and nothing of any significance changes.\nOptics and information is no substitute for action, as Mr. Putin has vividly demonstrated.\nSo, let me know once it happens, otherwise, I will continue to not pay any attention to it. I’m not interested in anyone’s opinion or interpretation or explanation of anything; if I can’t review the original source material, then I’m not interested in the massaged version abridged and dumbed-down for the public.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "Fake News"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-21T10:31:08+00:00"
}