{
  "url": "https://voxday.net/2022/03/24/the-intoxification-of-success/",
  "scraped_at": "2026-01-08T13:13:45.536834",
  "title": "The Intoxification of Success",
  "date_display": "March 24, 2022",
  "date_iso": "2022-03-24T10:37:50+00:00",
  "date_from_url": "2022-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The neocons running the neo-liberal world order are not hesitating <a href=\"https://thesaker.is/renegade-interviews-michael-hudson-sanctions-the-blowback/\">to sabotage the economies</a> they are financially raping even though the negative consequences are obvious.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Ross: </strong>Michael, sanctions, sanctions, sanctions is all we hear now. We’re sanctioning people. The West sanction people back to the Stone Age. What are the unintended consequences of sanctions?</p><p><strong>Michael Hudson:</strong> Well, one is to serve very much like a protective tariff on the sanctioned country. For instance, when America made sanctions on European trade with Russia, Lithuania dutifully stopped exporting cheese to Russia. Well, the result is that Russia set up its own cheese’s sector, and now it’s self-sufficient in cheese. If you sanction a country, you force it to become more self-reliant and across the board, from agriculture to dairy products to technology, Russia is forced to become more self-reliant and at the same time to depend much more on trade with China for the things that it is still not self-reliant in. So America is bringing about exactly the opposite of what it intended. It’s hopeless to somehow isolate Russia and then be able to go after China without Russia. And instead, what it’s doing is integrating the Eurasian core, Russia and China, exactly the policy that Henry Kissinger warned against going all the way back to Mackinder a century ago that said, Eurasia is the world island, Russia and China could be the whole world centre. That’s what the fight is all about. Well, American sanctions are driving Russia and China together, and America has gone to China and said, Please don’t support Russia. It most recently, on Monday, March 14, Jake Sullivan came out and told China, we will sanction countries that break our sanctions against Russia. And basically, China said, fine. You know, we’ll just break off all the trade between East and West now and the East, Eurasia is pretty much self-sufficient. The West is not self-sufficient since it began to industrialise, and it’s heavily dependent on Russia for not only oil and gas, but palladium and many raw materials. So the sanctions are ending up driving a wedge between the European countries.</p><p><strong>Ross: </strong>Don’t people who apply these sanctions think this through? Are they so short-sighted they don’t understand that these sanctions are going to build further capacity within Russia, push Russia further towards China, make that economic alliance concrete and, ultimately, you’re not going to be able to keep the lights on in in Europe? All the while underestimating the fact that from a food security point of view – take the U.K., for instance, a net importer of food – not appreciating the fact that, for instance, Russia/Ukraine, they create twenty five percent, a quarter, of all wheat annually. The estimation this year is one hundred and two million tonnes Russia and Ukraine, wheat. Don’t people realise that there’s going to be a massive knock on effect?</p><p><strong>Michael Hudson:</strong> Yes, they do realise it. Yes, they’ve thought it all through. I worked with these people for more than 50 years.</p><p><strong>Ross: </strong>Who are these people?</p><p><strong>Michael Hudson: </strong>The neocons, basically, the people who are in charge of U.S. foreign policy? Victoria Nuland and her husband, Robert Kagan, the people that President Biden has appointed all around him, from Blinken to Sullivan and right down the line. They are basically urging people around the New American Century. They’re the people who said America can run the whole world and create its own reality. And yes, they know that this is going to cause enormous problems for Germany. They know that not only will it block the energy that Germany and Italy and other countries in Europe need through their oil and gas, but also it’ll block the use of gas for fertiliser, upping their fertiliser production and decreasing their food production. They look at this and they say, How can America gain from all of this? There’s always a way of gaining what something looks to be bad.</p></blockquote><p>In fact, sanctions against Russia and Iran have worked so well in bending those nations to the will of the global imperialists that now they’re actively pushing <a href=\"https://www.dailymail.co.uk/news/article-10646157/China-hit-sanctions-backs-Russias-war-Ukraine-minister-warns.html\">for sanctions on China</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Britain will sanction China if it supports Vladimir Putin’s invasion of Ukraine, a Cabinet minister warned last night. Trade Secretary Anne-Marie Trevelyan urged Beijing not to send arms or financial aid to Russia after the US claimed it requested China’s support, which both countries deny.</p><p>Joe Biden last week warned Chinese president Xi Jinping there will be ‘consequences’ if he backs the invasion.</p><p>‘We’ve sanctioned Belarus right alongside Russia precisely because they basically said ‘feel free to park your tanks on our lawn’. That is just not acceptable,’ she added.</p></blockquote><p>I used to wonder how Hitler could possibly have been dumb enough to seek a two-front war after being unable to finish off Britain in 1940, and how the Japanese armed forces could have imagined it was a good idea to bring the USA into the Pacific war while they were still absorbed with fighting the Communists and Kuomintang armies in China. Both ideas appeared, in historical hindsight, to have been obviously stupid even at the times the decisions were made. And it is already obvious that the multi-front economic war is a failure, even before the Chinese front has been opened.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>What is clear is that Western sanctions policy is the worst of all worlds. We are allowing Putin to exploit Russia’s leverage as a full-spectrum commodity superpower.</em></p><cite><em>Ambrose Evans-Pritchard</em></cite></blockquote><p>Now that I’ve seen how the neocons who have taken over the US empire and overthrown the governments of Iraq, Libya, and Ukraine are intoxicated with their successes, it doesn’t surprise me that they would attempt to extend their European satrapy by engaging in economic war with both Russia and China. And it shouldn’t surprise anyone if the consequences of their failure will be even more horrific for them and their subjects than the consequences of their previous failures were.</p><p><em><a href=\"https://social.infogalactic.com/micropost/d639d7e2-1746-4756-8ff5-7f87c585e412\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The neocons running the neo-liberal world order are not hesitating\nto sabotage the economies\nthey are financially raping even though the negative consequences are obvious.\nRoss:\nMichael, sanctions, sanctions, sanctions is all we hear now. We’re sanctioning people. The West sanction people back to the Stone Age. What are the unintended consequences of sanctions?\nMichael Hudson:\nWell, one is to serve very much like a protective tariff on the sanctioned country. For instance, when America made sanctions on European trade with Russia, Lithuania dutifully stopped exporting cheese to Russia. Well, the result is that Russia set up its own cheese’s sector, and now it’s self-sufficient in cheese. If you sanction a country, you force it to become more self-reliant and across the board, from agriculture to dairy products to technology, Russia is forced to become more self-reliant and at the same time to depend much more on trade with China for the things that it is still not self-reliant in. So America is bringing about exactly the opposite of what it intended. It’s hopeless to somehow isolate Russia and then be able to go after China without Russia. And instead, what it’s doing is integrating the Eurasian core, Russia and China, exactly the policy that Henry Kissinger warned against going all the way back to Mackinder a century ago that said, Eurasia is the world island, Russia and China could be the whole world centre. That’s what the fight is all about. Well, American sanctions are driving Russia and China together, and America has gone to China and said, Please don’t support Russia. It most recently, on Monday, March 14, Jake Sullivan came out and told China, we will sanction countries that break our sanctions against Russia. And basically, China said, fine. You know, we’ll just break off all the trade between East and West now and the East, Eurasia is pretty much self-sufficient. The West is not self-sufficient since it began to industrialise, and it’s heavily dependent on Russia for not only oil and gas, but palladium and many raw materials. So the sanctions are ending up driving a wedge between the European countries.\nRoss:\nDon’t people who apply these sanctions think this through? Are they so short-sighted they don’t understand that these sanctions are going to build further capacity within Russia, push Russia further towards China, make that economic alliance concrete and, ultimately, you’re not going to be able to keep the lights on in in Europe? All the while underestimating the fact that from a food security point of view – take the U.K., for instance, a net importer of food – not appreciating the fact that, for instance, Russia/Ukraine, they create twenty five percent, a quarter, of all wheat annually. The estimation this year is one hundred and two million tonnes Russia and Ukraine, wheat. Don’t people realise that there’s going to be a massive knock on effect?\nMichael Hudson:\nYes, they do realise it. Yes, they’ve thought it all through. I worked with these people for more than 50 years.\nRoss:\nWho are these people?\nMichael Hudson:\nThe neocons, basically, the people who are in charge of U.S. foreign policy? Victoria Nuland and her husband, Robert Kagan, the people that President Biden has appointed all around him, from Blinken to Sullivan and right down the line. They are basically urging people around the New American Century. They’re the people who said America can run the whole world and create its own reality. And yes, they know that this is going to cause enormous problems for Germany. They know that not only will it block the energy that Germany and Italy and other countries in Europe need through their oil and gas, but also it’ll block the use of gas for fertiliser, upping their fertiliser production and decreasing their food production. They look at this and they say, How can America gain from all of this? There’s always a way of gaining what something looks to be bad.\nIn fact, sanctions against Russia and Iran have worked so well in bending those nations to the will of the global imperialists that now they’re actively pushing\nfor sanctions on China\n.\nBritain will sanction China if it supports Vladimir Putin’s invasion of Ukraine, a Cabinet minister warned last night. Trade Secretary Anne-Marie Trevelyan urged Beijing not to send arms or financial aid to Russia after the US claimed it requested China’s support, which both countries deny.\nJoe Biden last week warned Chinese president Xi Jinping there will be ‘consequences’ if he backs the invasion.\n‘We’ve sanctioned Belarus right alongside Russia precisely because they basically said ‘feel free to park your tanks on our lawn’. That is just not acceptable,’ she added.\nI used to wonder how Hitler could possibly have been dumb enough to seek a two-front war after being unable to finish off Britain in 1940, and how the Japanese armed forces could have imagined it was a good idea to bring the USA into the Pacific war while they were still absorbed with fighting the Communists and Kuomintang armies in China. Both ideas appeared, in historical hindsight, to have been obviously stupid even at the times the decisions were made. And it is already obvious that the multi-front economic war is a failure, even before the Chinese front has been opened.\nWhat is clear is that Western sanctions policy is the worst of all worlds. We are allowing Putin to exploit Russia’s leverage as a full-spectrum commodity superpower.\nAmbrose Evans-Pritchard\nNow that I’ve seen how the neocons who have taken over the US empire and overthrown the governments of Iraq, Libya, and Ukraine are intoxicated with their successes, it doesn’t surprise me that they would attempt to extend their European satrapy by engaging in economic war with both Russia and China. And it shouldn’t surprise anyone if the consequences of their failure will be even more horrific for them and their subjects than the consequences of their previous failures were.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "neocons",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-24T11:49:42+00:00"
}