{
  "url": "https://voxday.net/2022/03/25/the-vaxx-kills-more-than-covid/",
  "scraped_at": "2026-01-08T13:13:54.310801",
  "title": "The Vaxx Kills More than Covid",
  "date_display": "March 25, 2022",
  "date_iso": "2022-03-25T13:00:00+00:00",
  "date_from_url": "2022-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A US military flight surgeon testifies that <a href=\"https://dailyexpose.uk/2022/03/25/military-doctor-testifies-ordered-suppress-covid-vaccine-injuries/\">the Covid vaccines have killed more</a> US soldiers than Covid did:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Dr. Theresa Long, a flight surgeon who holds a master’s degree in Public Health and is specially trained in the DMED, gave emotional testimony on March 10. She and two other flight surgeons reviewed DMED last year and made some stunning discoveries about the high incidence of apparent vaccine injuries among members of the military.</p><p>According to the whistleblowers, certain disorders spiked after the vaccine mandate went into effect, including miscarriages and cancers, and neurological problems which increased by 1000 percent.</p><p>Dr. Long testified that she was contacted by high level officer the night before the hearing, and told not to discuss her findings regarding the explosive military medical data in court. The whistleblower reportedly said she felt threatened after she tried to get her superiors to address the findings, “fearing for her life and for the safety of her children.”</p><p>Since the whistleblowers came forward with the DMED data, the DoD has thrown cold water on their conclusions, saying the increase in vaccine injuries was caused by a “glitch in the database.”</p><p>Politifact contacted Peter Graves, spokesperson for the Defense Health Agency’s Armed Forces Surveillance Division, who said the data for 2021 is correct, but for some reason, the data for the five years prior was inaccurate. Graves told PolitiFact by email that the division reviewed data in the DMED “and found that the data was incorrect for the years 2016-2020.”</p><p>In other words, for five straight years, the data was seriously corrupted and none of the DoD’s data analysts figured this out, and then it fixed itself on its own in 2021. The DoD has since put out new numbers showing more illnesses among the troops for the years prior to 2021….</p><p>Dr. Long also testified that the data shows that deaths of military members from the vaccines exceed deaths from COVID itself.</p></blockquote><p>No government statistics can be believed anymore, because all of the statistical offices have been converged. That being said, it is sound logic to assume that the errors are biased in support of the Narrative; the “glitch in the database” defense is even more <em>a priori</em> absurd than the idea that it is safer for an otherwise-healthy individual to be repeatedly injected with spike proteins and other untested substances than endure a few days of fatigue from Covid.</p><p><em>DISCUSS ON SG</em></p></div>",
  "content_text": "A US military flight surgeon testifies that\nthe Covid vaccines have killed more\nUS soldiers than Covid did:\nDr. Theresa Long, a flight surgeon who holds a master’s degree in Public Health and is specially trained in the DMED, gave emotional testimony on March 10. She and two other flight surgeons reviewed DMED last year and made some stunning discoveries about the high incidence of apparent vaccine injuries among members of the military.\nAccording to the whistleblowers, certain disorders spiked after the vaccine mandate went into effect, including miscarriages and cancers, and neurological problems which increased by 1000 percent.\nDr. Long testified that she was contacted by high level officer the night before the hearing, and told not to discuss her findings regarding the explosive military medical data in court. The whistleblower reportedly said she felt threatened after she tried to get her superiors to address the findings, “fearing for her life and for the safety of her children.”\nSince the whistleblowers came forward with the DMED data, the DoD has thrown cold water on their conclusions, saying the increase in vaccine injuries was caused by a “glitch in the database.”\nPolitifact contacted Peter Graves, spokesperson for the Defense Health Agency’s Armed Forces Surveillance Division, who said the data for 2021 is correct, but for some reason, the data for the five years prior was inaccurate. Graves told PolitiFact by email that the division reviewed data in the DMED “and found that the data was incorrect for the years 2016-2020.”\nIn other words, for five straight years, the data was seriously corrupted and none of the DoD’s data analysts figured this out, and then it fixed itself on its own in 2021. The DoD has since put out new numbers showing more illnesses among the troops for the years prior to 2021….\nDr. Long also testified that the data shows that deaths of military members from the vaccines exceed deaths from COVID itself.\nNo government statistics can be believed anymore, because all of the statistical offices have been converged. That being said, it is sound logic to assume that the errors are biased in support of the Narrative; the “glitch in the database” defense is even more\na priori\nabsurd than the idea that it is safer for an otherwise-healthy individual to be repeatedly injected with spike proteins and other untested substances than endure a few days of fatigue from Covid.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-25T13:00:00+00:00"
}