{
  "url": "https://voxday.net/2022/03/15/the-coming-false-flag/",
  "scraped_at": "2026-01-08T13:12:50.978457",
  "title": "The Coming False Flag",
  "date_display": "March 15, 2022",
  "date_iso": "2022-03-15T14:24:28+00:00",
  "date_from_url": "2022-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We haven’t seen the false flag we were all expecting at the start of the Russian special military operation, but Gonzalo Lira, a Chilean resident in Ukraine, <a href=\"https://www.youtube.com/watch?v=IRJ4umS7dJA\">appears to believe that one is imminent</a> and that it will likely involve chemical weapons.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Americans are planning a false flag operation in Ukraine. the word is that they plan to use<br/>chemical weapons in Ukraine, probably Kharkov where I’m located right now and the word is that they want to use chemical weapons because NATO and the United States have said that chemical weapons are a red line and if anybody uses chemical weapons they will invade.</p><p>Now the reason that they’re saying this is because the mainstream media in the United States is claiming that the Ukrainians are winning this war against Russia and that the Russians are just outmatched and out of desperation, the Russians are going to use chemical weapons and that’s why we have to stop them, we have to go in there and be the cavalry. You know, the white hats riding in on our white horses and show those evil Ruskies that chemical weapons are a no-no.</p><p>Well, this is a big lie. Right now the Russians are winning this war and winning it decisively. The fact is that the Ukrainian army’s command-and-control system is completely broken. The Ukrainian forces do not have an overall defensive strategy, for all intents and purposes, each unit is on its own. The Russians have successfully surrounded Kiev and Kharkov, the major cities. They’ve also surrounded and are in the process of pacifying Mariupol, so in the end, the Russians are winning. And most important of all, the Russians seem to have completely surrounded, and are currently, in all likelihood, annihilating the 60,000-strong army of the Ukraines which is currently in eastern Ukraine.</p><p>Not many people are talking about it but you should pay attention to that, that’s really important, because those 60,000 men represent the cream of the crop of the Ukrainian armed forces and they are<br/>surrounded. Not only are they surrounded, there is no possibility of them being refueled or resupplied so it’s only a matter of time to either overwhelm them, overrun them, or annihilate them. It’s as simple as that….</p><p>So if you’re American, you should understand that the media is lying to you. The russians are winning, clearly winning, and I don’t need anybody to report and and tell me that the Russians are winning, I can tell all on my own. You know how? Because every day, I hear the shelling of the Russians and it’s getting closer every day. I’m in the center of Kharkov and I’m telling you every day the Russians are getting closer, so I know that they’re winning….</p><p>Those thugs of the Zelensky regime, they want NATO intervention. They’ve been calling for it from day one and if they figure that doing a chemical attack false flag will get NATO in, they will not hesitate, not for a second. So understand what’s going on. I am here to tell you what is going on. The Zelensky regime and different factions in the United States mean to start a false flag so that they can get involved in this war.</p></blockquote><p>A lot of predictions are being made. Most of them will prove to be incorrect. But this one is at least consistent with recent NATO troop movements in Poland and the large military exercise, <a href=\"https://www.aljazeera.com/news/2022/3/14/nato-military-exercises-kick-off-in-norway-with-30000-troops\">Operation Cold Response</a>, that began yesterday in Norway.</p><p><em><a href=\"https://social.infogalactic.com/micropost/daecb6ee-6b47-422a-bbc8-e3d2616551a5\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "We haven’t seen the false flag we were all expecting at the start of the Russian special military operation, but Gonzalo Lira, a Chilean resident in Ukraine,\nappears to believe that one is imminent\nand that it will likely involve chemical weapons.\nThe Americans are planning a false flag operation in Ukraine. the word is that they plan to use\nchemical weapons in Ukraine, probably Kharkov where I’m located right now and the word is that they want to use chemical weapons because NATO and the United States have said that chemical weapons are a red line and if anybody uses chemical weapons they will invade.\nNow the reason that they’re saying this is because the mainstream media in the United States is claiming that the Ukrainians are winning this war against Russia and that the Russians are just outmatched and out of desperation, the Russians are going to use chemical weapons and that’s why we have to stop them, we have to go in there and be the cavalry. You know, the white hats riding in on our white horses and show those evil Ruskies that chemical weapons are a no-no.\nWell, this is a big lie. Right now the Russians are winning this war and winning it decisively. The fact is that the Ukrainian army’s command-and-control system is completely broken. The Ukrainian forces do not have an overall defensive strategy, for all intents and purposes, each unit is on its own. The Russians have successfully surrounded Kiev and Kharkov, the major cities. They’ve also surrounded and are in the process of pacifying Mariupol, so in the end, the Russians are winning. And most important of all, the Russians seem to have completely surrounded, and are currently, in all likelihood, annihilating the 60,000-strong army of the Ukraines which is currently in eastern Ukraine.\nNot many people are talking about it but you should pay attention to that, that’s really important, because those 60,000 men represent the cream of the crop of the Ukrainian armed forces and they are\nsurrounded. Not only are they surrounded, there is no possibility of them being refueled or resupplied so it’s only a matter of time to either overwhelm them, overrun them, or annihilate them. It’s as simple as that….\nSo if you’re American, you should understand that the media is lying to you. The russians are winning, clearly winning, and I don’t need anybody to report and and tell me that the Russians are winning, I can tell all on my own. You know how? Because every day, I hear the shelling of the Russians and it’s getting closer every day. I’m in the center of Kharkov and I’m telling you every day the Russians are getting closer, so I know that they’re winning….\nThose thugs of the Zelensky regime, they want NATO intervention. They’ve been calling for it from day one and if they figure that doing a chemical attack false flag will get NATO in, they will not hesitate, not for a second. So understand what’s going on. I am here to tell you what is going on. The Zelensky regime and different factions in the United States mean to start a false flag so that they can get involved in this war.\nA lot of predictions are being made. Most of them will prove to be incorrect. But this one is at least consistent with recent NATO troop movements in Poland and the large military exercise,\nOperation Cold Response\n, that began yesterday in Norway.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-15T15:25:31+00:00"
}