{
  "url": "https://voxday.net/2022/03/10/underestimating-the-enemy/",
  "scraped_at": "2026-01-08T13:12:16.932839",
  "title": "Underestimating the Enemy",
  "date_display": "March 10, 2022",
  "date_iso": "2022-03-10T10:57:51+00:00",
  "date_from_url": "2022-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Russian military veteran provides <a href=\"https://thesaker.is/the-opinion-of-a-professional-about-the-special-operation-in-ukraine-must-read/\">his professional take</a> on the Ukrainian operation:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>We underestimated the enemy’s power of informational, ideological, psychological resistance, they were waiting for us. Literally on the very first day, with one click of American bloody fingers, they deprived us of the support of the civilian population and those AFU units ready to become neutral. Millions of dollars, thousands of IT guys, global media corporations cut Ukraine off from any objective information, it stank in our country.</p><p>And our main losses were in the first three days. Now they will be rapidly reduced. Peacekeeping and humanitarian operations, like the Crimean one— are no longer carried out by the Russian army. The fighters received other orders, got involved, got angry, regrouped, any hopes for active support from the civilian population and those parts of the AFU who had changed their mind were dispelled.</p><p>There were few flowers and bread loaves to be seen, the people have been crushed by propaganda and lies, intimidated into insanity by the Nazis. Another important point was missed in the calculations — almost 600 thousand Ukrainians have passed through the ATO zone in the Donbas since 2014, today they have replenished the territorial defense everywhere, many have something to fear. Especially in the wake of fakes about executions without trial by the ATO.</p><p>Can you imagine what, during a year of service there, the Nazis stuffed into their heads – gave them the opportunity to shoot at the settlements of “quilted jackets and colorados” with impunity, to mock the civilian population there. So, the calculation for the help of locals and APU was inaccurate, the cancer in Ukrainian society is simply monstrous. But… we will cure it.</p><p>If we explain our tactics of the first days… this is a creatively reworked “reconnaissance by combat” of the Great Patriotic War. Only with a deep and rapid penetration into the Nazi-occupied territory. We provoked the activity of the enemy with tactical groups, deliberately drawing out parts of the APU and the National Guard from their locations. With a small number withstanding the terrible counterattacks of tanks and armored vehicles, of a superior in number motorized infantry.</p><p>Sometimes it was impossible to suppress the “Grads”, artillery and mortars hidden in residential neighborhoods that were nailing you. Urban areas could not be cleaned methodically in combat formations, causing supporting fire, attack helicopters, sappers, flamethrowers, tanks to carry machine-gun emplacements in houses and social infrastructure facilities.</p><p>This is a war unfamiliar to us veterans. Especially when the sky is under your full control, airfields are packed with attack aircraft and bombers, operational and tactical missile systems are in service, there is a lot of heavy artillery. Now it has become clear even to civilians: the correct name for what is happening truly is “a special military operation for denazification.” And the demilitarization of Nezalezhnaya was completed by the end of the third day.</p><p>The APU, as a single, manageable and effective structure, has ceased to exist. Today, there are dozens of groups of different numbers isolated from each other, hiding in cities and towns. No centralized supply, no air support, no approach of reinforcements. They are not able to act within the framework of any plans of the Ukrainian General Staff. Just crowds of armed men with orders to stand to the death.</p><p>The main groups “North” and “East” were beheaded and deprived of command — these are 22 brigades, which had been entrusted with the honorable duty to drown Donbass in blood at the beginning of March. We beat them to it by a week or two, starting our own special operation. Now 150 thousand people (together with national soldiers) are marinated in “cauldrons”, cut off from each other.</p></blockquote><p>This is a considerably more realistic analysis than the one provided by internationally recognized geopolitical forecaster and strategist on international affairs George Friedman which I reviewed on the Darkstream last night. The key takeaways:</p><ul class=\"wp-block-list\"><li><em>We underestimated the enemy’s power.</em> The intensity and the effect of the psychological operations should disturb everyone on both sides. But it shouldn’t actually surprise us in the wake of the Covid psyops. And the Russians clearly understand that the enemy is not Ukrainian.</li><li><em>This is a creatively reworked “reconnaissance by combat” of the Great Patriotic War. </em>Hence the advances on multiple fronts seemingly aimed at nowhere combined with the sudden halts that the globalist media interprets as “getting bogged down”. The focus is finding the enemy units and enveloping them, then gradually degrading their ability to fight before forcing mass surrenders.</li><li><em>This is a war unfamiliar to us veterans.</em> The Russians bent over backwards to avoid collateral civilian damage. This effort was not rewarded due to the successful propagandization of the Ukrainian people. While Russia is still not targeting civilians, it is no longer accepting the higher risks to its soldiers required to avoid collateral damage.</li><li><em>We beat them to it by a week or two, starting our own special operation. </em>This is why Putin ordered the attack when he did, and why the timing came as a surprise even to some of the Russian generals. It’s also how the Russians managed to surround 22 brigades – previously estimated by outsiders to be 10-12 brigades – in the Donbass Pocket.</li><li><em>The second stage of the operation. Recognizably, the Syrian scenario. </em>Russia will not go into the cities to eliminate the militant opposition. It will surround the cities, starve them, and wait for their surrender or suppression by the moderate majority. This was the tactic they used successfully in the Second Chechen War.</li><li><em>Losses are not just tolerable (from a military statistical point of view) — insignificant.</em> The relentless propaganda about massive Russian losses are pure projection, especially in light of the price that Russia paid during the Great Patriotic War aka WWII. Nor does it even make any sense in light of the fact that Russia has successfully taken an estimated 200,000 km2 in less than two weeks.</li><li><em>The final turning point. </em>He predicts the war rapidly comes to an end after Kharkov and Odessa submit. At least, this stage of the larger, unrestricted war.</li><li><em>Will the encircled Banderites begin to commit atrocities in their impotent anger? Well, Ukrainians should also carry this cross on their own.</em> From the Russian perspective, the civilians chose their side, both in their acceptance of the illegitimate Maidan regime in 2014 and their rejection of their liberators in 2022. They chose poorly. So the Russians aren’t going to lose any sleep over atrocities committed against people who consider them the enemy by the forces the people did not resist.</li></ul><p>It’s all a bit cold-blooded and ruthless, but then, one shouldn’t expect the Russian perspective to have much in common with the irrational, highly-emotional, media-programmed perspective that pervades the WereWest. And it comes with enough predictions that we should soon be able to see if it is a useful model or not. It certainly comports with the visual map of the operation’s progress.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img alt=\"\" class=\"wp-image-52681\" decoding=\"async\" fetchpriority=\"high\" height=\"325\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2022/03/image-3-1024x650.png\" srcset=\"https://voxday.net/wp-content/uploads/2022/03/image-3-1024x650.png 1024w, https://voxday.net/wp-content/uploads/2022/03/image-3-300x190.png 300w, https://voxday.net/wp-content/uploads/2022/03/image-3-768x488.png 768w, https://voxday.net/wp-content/uploads/2022/03/image-3.png 1035w\" width=\"512\"><figcaption><strong>UKRAINE INVASION DAY 13</strong></figcaption></img></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/f4c135aa-04c3-48c3-b323-5b07d3f21ab5\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A Russian military veteran provides\nhis professional take\non the Ukrainian operation:\nWe underestimated the enemy’s power of informational, ideological, psychological resistance, they were waiting for us. Literally on the very first day, with one click of American bloody fingers, they deprived us of the support of the civilian population and those AFU units ready to become neutral. Millions of dollars, thousands of IT guys, global media corporations cut Ukraine off from any objective information, it stank in our country.\nAnd our main losses were in the first three days. Now they will be rapidly reduced. Peacekeeping and humanitarian operations, like the Crimean one— are no longer carried out by the Russian army. The fighters received other orders, got involved, got angry, regrouped, any hopes for active support from the civilian population and those parts of the AFU who had changed their mind were dispelled.\nThere were few flowers and bread loaves to be seen, the people have been crushed by propaganda and lies, intimidated into insanity by the Nazis. Another important point was missed in the calculations — almost 600 thousand Ukrainians have passed through the ATO zone in the Donbas since 2014, today they have replenished the territorial defense everywhere, many have something to fear. Especially in the wake of fakes about executions without trial by the ATO.\nCan you imagine what, during a year of service there, the Nazis stuffed into their heads – gave them the opportunity to shoot at the settlements of “quilted jackets and colorados” with impunity, to mock the civilian population there. So, the calculation for the help of locals and APU was inaccurate, the cancer in Ukrainian society is simply monstrous. But… we will cure it.\nIf we explain our tactics of the first days… this is a creatively reworked “reconnaissance by combat” of the Great Patriotic War. Only with a deep and rapid penetration into the Nazi-occupied territory. We provoked the activity of the enemy with tactical groups, deliberately drawing out parts of the APU and the National Guard from their locations. With a small number withstanding the terrible counterattacks of tanks and armored vehicles, of a superior in number motorized infantry.\nSometimes it was impossible to suppress the “Grads”, artillery and mortars hidden in residential neighborhoods that were nailing you. Urban areas could not be cleaned methodically in combat formations, causing supporting fire, attack helicopters, sappers, flamethrowers, tanks to carry machine-gun emplacements in houses and social infrastructure facilities.\nThis is a war unfamiliar to us veterans. Especially when the sky is under your full control, airfields are packed with attack aircraft and bombers, operational and tactical missile systems are in service, there is a lot of heavy artillery. Now it has become clear even to civilians: the correct name for what is happening truly is “a special military operation for denazification.” And the demilitarization of Nezalezhnaya was completed by the end of the third day.\nThe APU, as a single, manageable and effective structure, has ceased to exist. Today, there are dozens of groups of different numbers isolated from each other, hiding in cities and towns. No centralized supply, no air support, no approach of reinforcements. They are not able to act within the framework of any plans of the Ukrainian General Staff. Just crowds of armed men with orders to stand to the death.\nThe main groups “North” and “East” were beheaded and deprived of command — these are 22 brigades, which had been entrusted with the honorable duty to drown Donbass in blood at the beginning of March. We beat them to it by a week or two, starting our own special operation. Now 150 thousand people (together with national soldiers) are marinated in “cauldrons”, cut off from each other.\nThis is a considerably more realistic analysis than the one provided by internationally recognized geopolitical forecaster and strategist on international affairs George Friedman which I reviewed on the Darkstream last night. The key takeaways:\nWe underestimated the enemy’s power.\nThe intensity and the effect of the psychological operations should disturb everyone on both sides. But it shouldn’t actually surprise us in the wake of the Covid psyops. And the Russians clearly understand that the enemy is not Ukrainian.\nThis is a creatively reworked “reconnaissance by combat” of the Great Patriotic War.\nHence the advances on multiple fronts seemingly aimed at nowhere combined with the sudden halts that the globalist media interprets as “getting bogged down”. The focus is finding the enemy units and enveloping them, then gradually degrading their ability to fight before forcing mass surrenders.\nThis is a war unfamiliar to us veterans.\nThe Russians bent over backwards to avoid collateral civilian damage. This effort was not rewarded due to the successful propagandization of the Ukrainian people. While Russia is still not targeting civilians, it is no longer accepting the higher risks to its soldiers required to avoid collateral damage.\nWe beat them to it by a week or two, starting our own special operation.\nThis is why Putin ordered the attack when he did, and why the timing came as a surprise even to some of the Russian generals. It’s also how the Russians managed to surround 22 brigades – previously estimated by outsiders to be 10-12 brigades – in the Donbass Pocket.\nThe second stage of the operation. Recognizably, the Syrian scenario.\nRussia will not go into the cities to eliminate the militant opposition. It will surround the cities, starve them, and wait for their surrender or suppression by the moderate majority. This was the tactic they used successfully in the Second Chechen War.\nLosses are not just tolerable (from a military statistical point of view) — insignificant.\nThe relentless propaganda about massive Russian losses are pure projection, especially in light of the price that Russia paid during the Great Patriotic War aka WWII. Nor does it even make any sense in light of the fact that Russia has successfully taken an estimated 200,000 km2 in less than two weeks.\nThe final turning point.\nHe predicts the war rapidly comes to an end after Kharkov and Odessa submit. At least, this stage of the larger, unrestricted war.\nWill the encircled Banderites begin to commit atrocities in their impotent anger? Well, Ukrainians should also carry this cross on their own.\nFrom the Russian perspective, the civilians chose their side, both in their acceptance of the illegitimate Maidan regime in 2014 and their rejection of their liberators in 2022. They chose poorly. So the Russians aren’t going to lose any sleep over atrocities committed against people who consider them the enemy by the forces the people did not resist.\nIt’s all a bit cold-blooded and ruthless, but then, one shouldn’t expect the Russian perspective to have much in common with the irrational, highly-emotional, media-programmed perspective that pervades the WereWest. And it comes with enough predictions that we should soon be able to see if it is a useful model or not. It certainly comports with the visual map of the operation’s progress.\nUKRAINE INVASION DAY 13\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-10T12:11:18+00:00"
}