{
  "url": "https://voxday.net/2022/03/09/us-admits-ukraine-biolabs/",
  "scraped_at": "2026-01-08T13:12:08.858914",
  "title": "US Admits Ukraine Biolabs",
  "date_display": "March 9, 2022",
  "date_iso": "2022-03-09T10:19:05+00:00",
  "date_from_url": "2022-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just two days ago, US bioweaponry labs in Ukraine were dismissed by the globalist media’s “fact-checkers” as conspiracy theories and Russian propaganda. And now <a href=\"https://twitter.com/zerohedge/status/1501321918468829191\">their existence has been publicly admitted</a> by the US government.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Rubio: </strong>I only have a minute left let me ask you, does Ukraine have chemical or biological weapons?</p><p><strong>Nuland:</strong> Ukraine has biological research facilities which, in fact, we are now quite concerned Russian forces may be seeking to gain control of. So we are working with the Ukrainians on how they can prevent any of those research materials from falling into the hands of Russian forces should they approach</p><p><strong>Rubio:</strong> I’m sure you’re aware that the Russian propaganda groups are already putting out there all kinds of information about how they’ve uncovered a plot by the Ukrainians to release biological weapons in the country, and with NATO’s coordination. If there’s a biological or chemical weapon incident or attack inside of Ukraine is there any doubt in your mind that 100 percent it would be the Russians that would be behind it?</p><p><strong>Nuland:</strong> There is no doubt in my mind, Senator, and it is classic Russian technique to blame on the other guy what they’re planning to do themselves.</p></blockquote><p>So, the US-based neocons have not only admitted to putting research laboratories for biological weapons in their puppet state of Ukraine, they’re trying to preemptively false flag any use of bioweapons there. China, however, <a href=\"https://twitter.com/MFA_China/status/1501185437901082629\">is clearly well-aware</a> of this distributed bioweapons operation in the wake of the Wuhan coronavirus release and is already calling them out about it.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The US has 336 labs in 30 countries under its control, including 26 in Ukraine alone. It should give a full account of its biological military activities at home and abroad and subject itself to multilateral verification.</p></blockquote><p>Once more, we see that the “Russian propaganda” is well-founded in fact. Once more we see that “conspiracy theory” can be reasonably described as “spoiler alerts”. And once more, we see that the US government is in the hands of some of the most evil people on the planet.</p><p><em><a href=\"https://social.infogalactic.com/micropost/334cea03-ba32-44e4-a57f-9dfb4e225c7c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Just two days ago, US bioweaponry labs in Ukraine were dismissed by the globalist media’s “fact-checkers” as conspiracy theories and Russian propaganda. And now\ntheir existence has been publicly admitted\nby the US government.\nRubio:\nI only have a minute left let me ask you, does Ukraine have chemical or biological weapons?\nNuland:\nUkraine has biological research facilities which, in fact, we are now quite concerned Russian forces may be seeking to gain control of. So we are working with the Ukrainians on how they can prevent any of those research materials from falling into the hands of Russian forces should they approach\nRubio:\nI’m sure you’re aware that the Russian propaganda groups are already putting out there all kinds of information about how they’ve uncovered a plot by the Ukrainians to release biological weapons in the country, and with NATO’s coordination. If there’s a biological or chemical weapon incident or attack inside of Ukraine is there any doubt in your mind that 100 percent it would be the Russians that would be behind it?\nNuland:\nThere is no doubt in my mind, Senator, and it is classic Russian technique to blame on the other guy what they’re planning to do themselves.\nSo, the US-based neocons have not only admitted to putting research laboratories for biological weapons in their puppet state of Ukraine, they’re trying to preemptively false flag any use of bioweapons there. China, however,\nis clearly well-aware\nof this distributed bioweapons operation in the wake of the Wuhan coronavirus release and is already calling them out about it.\nThe US has 336 labs in 30 countries under its control, including 26 in Ukraine alone. It should give a full account of its biological military activities at home and abroad and subject itself to multilateral verification.\nOnce more, we see that the “Russian propaganda” is well-founded in fact. Once more we see that “conspiracy theory” can be reasonably described as “spoiler alerts”. And once more, we see that the US government is in the hands of some of the most evil people on the planet.\nDISCUSS ON SG",
  "tags": [
    "neocons",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-09T10:42:35+00:00"
}