{
  "url": "https://voxday.net/2022/03/05/why-russia-is-holding-back/",
  "scraped_at": "2026-01-08T13:11:37.277234",
  "title": "Why Russia is Holding Back",
  "date_display": "March 5, 2022",
  "date_iso": "2022-03-05T09:59:59+00:00",
  "date_from_url": "2022-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Both Russians and outsiders have been wondering why Russia is using second-line troops and neglecting to make use of its air forces. But Zelensky’s most recent speech <a href=\"https://www.dailymail.co.uk/news/article-10580113/All-people-die-Zelensky-slams-NATOs-refusal-establish-no-fly-zone.html\">demonstrates why</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As Russian forces pound strategic locations, Ukraine’s president Volodymyr Zelensky accused the West of abandoning millions of his people to their deaths at the hands of Putin’s troops.</p><p>In a bitter and emotional speech late on Friday, Zelensky lashed out at NATO powers for refusing to impose a no-fly zone over his country, warning that ‘all the people who die from this day forward will also die because of you’. He claimed the West’s hesitancy will fully untie Russia’s hands as it escalates its air attack.</p><p>NATO says a no-fly zone could provoke widespread war in Europe with nuclear-armed Russia. But as the United States and other NATO members send weapons for Kyiv and more than 1million refugees spill through the continent, the conflict is already drawing in countries far beyond Ukraine’s borders.</p><p>‘The alliance has given the green light to the bombing of Ukrainian cities and villages,’ he said, warning that ‘the history of Europe will remember this forever’. In a separate video message to anti-war protesters in several European cities, Zelensky continued to appeal for help. ‘If we fall, you will fall,’ he said.</p><p>NATO Secretary-General Jens Stoltenberg had earlier ruled out the possibility of a no-fly zone, saying Western planes would have to shoot down Russian aircraft.</p></blockquote><p>Russia is holding back because it is actively prepared for a full-scale war with NATO. Whether that is in anticipation of a second invasion of Eastern Europe or in response to a potential NATO intervention is impossible to say, but I guarantee you that plans for both scenarios, as well as various others, are already in place and are being updated as the conflict proceeds.</p><p>For example, no one is talking about the possibility of China attacking from the East and opening up a second front. But Russia has to have a plan or three in place to deal with that possibility, however improbable it might be. Remember, while the USA ended up utilizing certain elements of <a href=\"https://infogalactic.com/info/War_Plan_Orange\">War Plan Orange</a>, its 1924 plan for a war in the Pacific with Japan, during World War II, it also had <a href=\"https://infogalactic.com/info/War_Plan_Red\">War Plan Red</a> on hand, which was a plan for a naval war with England that involved seizing the Great Lakes and Canadian ports, as well as <a href=\"https://infogalactic.com/info/United_States_color-coded_war_plans#List_of_Color_Plans\">a number of other plans</a> for various scenarios that never came to pass.</p><p>Those who talk about Putin’s “failure” due to Russia’s inability to decapitate the Ukrainian leadership in a single strike simply don’t understand the depth of planning that goes into any operation of this scale. In fact, it’s not dissimilar to game design, in that the event trees extend to a level of detail that most people would find impossible to comprehend, let alone keep active track of in their heads.</p><p>The Russian strategists already know that “if x, then y” for a dizzying array of possibilities. They’ve planned for this, they’ve wargamed this, and they’ve run thousands of simulations on this. It’s the EU and NATO leaderships that don’t know what’s happening, which is why you keep seeing stupid statements being made, then retracted, by various government officials. Zelensky is trying to provide the factions within NATO and the USA that have wanted war with Russia for years with enough ammunition to overcome the more sensible factions that understand why any such war would be insane and fatal for NATO, the EU, and possibly the USA.</p><p><em><a href=\"https://social.infogalactic.com/micropost/91f4ead2-112d-4343-8bc5-6602af60bd81\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Both Russians and outsiders have been wondering why Russia is using second-line troops and neglecting to make use of its air forces. But Zelensky’s most recent speech\ndemonstrates why\n:\nAs Russian forces pound strategic locations, Ukraine’s president Volodymyr Zelensky accused the West of abandoning millions of his people to their deaths at the hands of Putin’s troops.\nIn a bitter and emotional speech late on Friday, Zelensky lashed out at NATO powers for refusing to impose a no-fly zone over his country, warning that ‘all the people who die from this day forward will also die because of you’. He claimed the West’s hesitancy will fully untie Russia’s hands as it escalates its air attack.\nNATO says a no-fly zone could provoke widespread war in Europe with nuclear-armed Russia. But as the United States and other NATO members send weapons for Kyiv and more than 1million refugees spill through the continent, the conflict is already drawing in countries far beyond Ukraine’s borders.\n‘The alliance has given the green light to the bombing of Ukrainian cities and villages,’ he said, warning that ‘the history of Europe will remember this forever’. In a separate video message to anti-war protesters in several European cities, Zelensky continued to appeal for help. ‘If we fall, you will fall,’ he said.\nNATO Secretary-General Jens Stoltenberg had earlier ruled out the possibility of a no-fly zone, saying Western planes would have to shoot down Russian aircraft.\nRussia is holding back because it is actively prepared for a full-scale war with NATO. Whether that is in anticipation of a second invasion of Eastern Europe or in response to a potential NATO intervention is impossible to say, but I guarantee you that plans for both scenarios, as well as various others, are already in place and are being updated as the conflict proceeds.\nFor example, no one is talking about the possibility of China attacking from the East and opening up a second front. But Russia has to have a plan or three in place to deal with that possibility, however improbable it might be. Remember, while the USA ended up utilizing certain elements of\nWar Plan Orange\n, its 1924 plan for a war in the Pacific with Japan, during World War II, it also had\nWar Plan Red\non hand, which was a plan for a naval war with England that involved seizing the Great Lakes and Canadian ports, as well as\na number of other plans\nfor various scenarios that never came to pass.\nThose who talk about Putin’s “failure” due to Russia’s inability to decapitate the Ukrainian leadership in a single strike simply don’t understand the depth of planning that goes into any operation of this scale. In fact, it’s not dissimilar to game design, in that the event trees extend to a level of detail that most people would find impossible to comprehend, let alone keep active track of in their heads.\nThe Russian strategists already know that “if x, then y” for a dizzying array of possibilities. They’ve planned for this, they’ve wargamed this, and they’ve run thousands of simulations on this. It’s the EU and NATO leaderships that don’t know what’s happening, which is why you keep seeing stupid statements being made, then retracted, by various government officials. Zelensky is trying to provide the factions within NATO and the USA that have wanted war with Russia for years with enough ammunition to overcome the more sensible factions that understand why any such war would be insane and fatal for NATO, the EU, and possibly the USA.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-05T11:06:18+00:00"
}