{
  "url": "https://voxday.net/2022/03/17/why-there-are-no-whistleblowers/",
  "scraped_at": "2026-01-08T13:12:59.461163",
  "title": "Why There Are No Whistleblowers",
  "date_display": "March 17, 2022",
  "date_iso": "2022-03-17T11:06:55+00:00",
  "date_from_url": "2022-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Defenders of the vaxx regime sometimes ask where all the whistleblowers are if the vaxxines are as harmful and worthless as skeptics say they are. They’re either a) keeping their mouths shut or b) finding themselves fired and discredited, as <a href=\"https://childrenshealthdefense.org/defender/german-insurance-fires-andreas-schofbeck-covid-vaccine-injuries-data/\">the recent firing of a German insurance CEO</a> and the scrubbing of his company’s website demonstrates:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The CEO of one of Germany’s largest health insurance companies was abruptly fired last month after he released data suggesting German health authorities are significantly underreporting COVID-19 vaccine injuries. The data, released by Andreas Schofbeck of BKK/ProVita, have since been scrubbed from the company’s website.</p><p>According to Schofbeck’s Feb. 21 letter to the PEI:</p><p>– Data from 10.9 million people were analyzed.<br/>– According to physician billing data, 216,695 were treated for a vaccine adverse effect during the first 2.5 quarters of 2021.<br/>– Figures extrapolated over an entire year for a population of 83 million people means that 2.5-3 million people likely received treatment for an adverse effect.<br/>– 4-5% of vaccinated people received treatment for an adverse effect.<br/>– In his letter, Schofbeck speculated on possible causes for underreporting, stating: <em>“Our first assumption is that, since no compensation is paid for reporting vaccine adverse events, reporting to the Paul Ehrlich Institute is often not done because of the great expense involved. Physicians have reported to us that reporting a suspected vaccine adverse event takes about half an hour. This means that 3 million suspected cases of vaccine adverse events require about 1.5 million working hours of physicians.”</em></p><p>Schofbeck concluded the data present a “significant warning signal” and that “danger to human life cannot be ruled out.”</p></blockquote><p>However, I don’t recommend attempting to provide this sort of information to friends and family who are vaccinated in order to convince them of anything. They have already proven – conclusively – that they are literally too stupid and/or gullible to survive the hostile programmed environment of the Promethean Panopticon. The general response to the Russo-Ukrainian conflict underlines this; there is a strong correlation between vaccination status and accepting the globalist Narrative on Ukraine.</p><p>And this behavior suggests they will dutifully comply with the culling, whenever and however that happens in the future. Given what evilogy suggests about the rules the wicked follow, it appears that one must either a) belong to the wicked or b) freely submit to their demands in order to be culled. So, it’s possible that the vaxx is merely the first in a series of tests that are intended to reduce the planet’s population to the desired level while eliminating those deemed inferior from the species.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I hold at your neck the gom jabbar. This one kills only animals.</p><cite>Reverend Mother Gaius Helen Mohiam</cite></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/d6db67b4-11a0-4cf6-95f8-2acf0c36b30c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Defenders of the vaxx regime sometimes ask where all the whistleblowers are if the vaxxines are as harmful and worthless as skeptics say they are. They’re either a) keeping their mouths shut or b) finding themselves fired and discredited, as\nthe recent firing of a German insurance CEO\nand the scrubbing of his company’s website demonstrates:\nThe CEO of one of Germany’s largest health insurance companies was abruptly fired last month after he released data suggesting German health authorities are significantly underreporting COVID-19 vaccine injuries. The data, released by Andreas Schofbeck of BKK/ProVita, have since been scrubbed from the company’s website.\nAccording to Schofbeck’s Feb. 21 letter to the PEI:\n– Data from 10.9 million people were analyzed.\n– According to physician billing data, 216,695 were treated for a vaccine adverse effect during the first 2.5 quarters of 2021.\n– Figures extrapolated over an entire year for a population of 83 million people means that 2.5-3 million people likely received treatment for an adverse effect.\n– 4-5% of vaccinated people received treatment for an adverse effect.\n– In his letter, Schofbeck speculated on possible causes for underreporting, stating:\n“Our first assumption is that, since no compensation is paid for reporting vaccine adverse events, reporting to the Paul Ehrlich Institute is often not done because of the great expense involved. Physicians have reported to us that reporting a suspected vaccine adverse event takes about half an hour. This means that 3 million suspected cases of vaccine adverse events require about 1.5 million working hours of physicians.”\nSchofbeck concluded the data present a “significant warning signal” and that “danger to human life cannot be ruled out.”\nHowever, I don’t recommend attempting to provide this sort of information to friends and family who are vaccinated in order to convince them of anything. They have already proven – conclusively – that they are literally too stupid and/or gullible to survive the hostile programmed environment of the Promethean Panopticon. The general response to the Russo-Ukrainian conflict underlines this; there is a strong correlation between vaccination status and accepting the globalist Narrative on Ukraine.\nAnd this behavior suggests they will dutifully comply with the culling, whenever and however that happens in the future. Given what evilogy suggests about the rules the wicked follow, it appears that one must either a) belong to the wicked or b) freely submit to their demands in order to be culled. So, it’s possible that the vaxx is merely the first in a series of tests that are intended to reduce the planet’s population to the desired level while eliminating those deemed inferior from the species.\nI hold at your neck the gom jabbar. This one kills only animals.\nReverend Mother Gaius Helen Mohiam\nDISCUSS ON SG",
  "tags": [
    "corpocracy",
    "globalism",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-17T11:06:58+00:00"
}