{
  "url": "https://voxday.net/2022/03/04/yeah-thats-not-how-this-works/",
  "scraped_at": "2026-01-08T13:11:28.081389",
  "title": "Yeah, That’s Not How This Works",
  "date_display": "March 4, 2022",
  "date_iso": "2022-03-04T10:19:56+00:00",
  "date_from_url": "2022-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If the global media suddenly begins rehabilitating the image of Vladimir Putin and painting the Zelensky government as the bad guys who need to be regime-changed, <a href=\"https://www.rt.com/business/550953-ukraine-want-debts-forgiven/\">you’ll know why</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Ukraine has called on international financial organizations to cancel the country’s foreign debts claiming massive destruction in the country caused by the Russian military offensive that began last Thursday.</p><p>“The scale of destruction in Ukraine … is colossal! In view of this, our external creditors must be required to write off Ukraine’s debts. To date, the external debt is 1.6 trillion hryvnia, or more than $57 billion.</p><p>International financial organizations should revise the debt policy and zero out the debts of Ukraine!” the head of the Accounts Chamber of Ukraine, Valeriy Patskan, wrote on his Facebook page on Tuesday.</p></blockquote><p>That’s no way to win the support of the global satanists who rule the West. See, what you want to do is demand that <em>Russia </em>be forced to pay those debts while promising that they will be paid no matter what, one way or another. You don’t fill social media with blue-and-yellow flags by threatening the lifesblood of The Empire That Never Ended.</p><p><em><a href=\"https://social.infogalactic.com/micropost/d712d8d5-7236-4a74-b97e-9321c76dd1aa\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If the global media suddenly begins rehabilitating the image of Vladimir Putin and painting the Zelensky government as the bad guys who need to be regime-changed,\nyou’ll know why\n:\nUkraine has called on international financial organizations to cancel the country’s foreign debts claiming massive destruction in the country caused by the Russian military offensive that began last Thursday.\n“The scale of destruction in Ukraine … is colossal! In view of this, our external creditors must be required to write off Ukraine’s debts. To date, the external debt is 1.6 trillion hryvnia, or more than $57 billion.\nInternational financial organizations should revise the debt policy and zero out the debts of Ukraine!” the head of the Accounts Chamber of Ukraine, Valeriy Patskan, wrote on his Facebook page on Tuesday.\nThat’s no way to win the support of the global satanists who rule the West. See, what you want to do is demand that\nRussia\nbe forced to pay those debts while promising that they will be paid no matter what, one way or another. You don’t fill social media with blue-and-yellow flags by threatening the lifesblood of The Empire That Never Ended.\nDISCUSS ON SG",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-03-04T10:20:00+00:00"
}