{
  "url": "https://voxday.net/2025/11/12/a-faith-in-failure/",
  "scraped_at": "2026-01-08T20:36:24.763201",
  "title": "A Faith in Failure",
  "date_display": "November 12, 2025",
  "date_iso": "2025-11-12T13:47:25+00:00",
  "date_from_url": "2025-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher admits that <a href=\"https://roddreher.substack.com/p/what-i-saw-and-heard-in-washington\">conservatism has completely failed</a>, but he still refuses to give up either his hopes for reform or his faith in the essential goodness of the Synagogue of Satan while he laments the refusal of young men to swallow the same bullshit lies that their fathers and grandfathers did.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As our conversation went on, I heard real despair — and well-informed despair — that democracy is going to hold in the West, because the conditions that make for a viable democracy are disappearing: the dissolution of a common culture, the collapse of religion in his generation, the material impoverishment of his generation, and so forth.</p><p>I tell you, it was dark. But I kept hearing this, over and over, and I concluded that it cannot be dismissed.</p><p>The inability of us older people — Boomers, Xers, and older Millennials — to comprehend the world through the eyes of Zoomers is a big, big problem. Another strong theme: while it’s important to take a clear stand against anti-Semitism in the ranks, there is no way to gatekeep our way out of this. You cannot simply point at the Zoomers and say, “Thou shalt not,” and expect it to work. The problems are too deep and complex, and anyway, they have learned to have no respect for authority.</p><p>Why should they? The institutions of our society, as they see it, have lied and lied and lied, and still lie. They still lie in many ways about race (e.g., refusing to be honest about black crime), they lied about Covid, they lied about males and females, and they forced the insanity of gender ideology on us all. The military lied about Iraq. The universities embraced and enforced ideologies of lies. The Catholic Church lied about sexual abuse, and the connection to the prevalence of sexually active gay priests honeycombing the institution. They lied about the benefits of mass migration and diversity. They lied about Trump and Russia. The political parties and their corporate allies lied about what globalism would mean for ordinary people.</p><p>The media have lied and do lie about most things… Trust in the system is gone. Hell, I share most of these conclusions myself! The difference is that I am not a nihilist; I don’t want to tear it all down, but rather reform it.</p></blockquote></blockquote><p>There will be no reformation. There can be no reformation, for the obvious reason that there is nothing left to reform. Democracy is dead. The USA is no longer an American nation. The very purpose of the Constitution has not only been subverted, but inverted and is actively used to suppress and repress the rights of the very Posterity it was meant to secure.</p><p>As I wrote in 2004, one cannot revive a corpse. The lamentations of the conservatives are nothing more than morning for the world that they lost, for the world that they refused to defend on the basis of their fundamentally false assumptions about the wicked who have labored without ceasing to destroy America, Western civilization, and Christianity itself.</p><p>They have already succeeded in destroying the USA. They may be successful in destroying Western civilization. They will never succeed in destroying Christianity.</p><p>In the meantime, what is Rod Dreher’s plan for “reforming” this? I really fail to see how importing more Indians on H1B visas, attacking antisemitism, or sending more money to Israel is going to improve this situation in the slightest.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-69223\" decoding=\"async\" fetchpriority=\"high\" height=\"253\" sizes=\"(max-width: 568px) 100vw, 568px\" src=\"https://voxday.net/wp-content/uploads/2025/11/image-23.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/11/image-23.png 568w, https://voxday.net/wp-content/uploads/2025/11/image-23-300x134.png 300w\" width=\"568\"/></figure></div><p>So if the young men want to burn everyone who was responsible for this absolutely unnecessary and completely avoidable civilizational catastrophe at the stake, I, for one, absolutely understand their point of view and I don’t give a quantum of a fraction of a damn about all the conservative legalistic dancing about how those who were obviously responsible for creating the situation weren’t the only ones involved.</p><p>This perspective from a Republican politico of color only underlines how little the conservatives and the Republicans understand the situation.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“These idiots don’t understand that they can’t win an election on a whites-only platform,” he said. “They’re delusional. There are a lot of immigrants and native-born members of ethnic groups who are natural Republicans, and whom Donald Trump won in 2024. Take Indians, for example — if you think they are going to stick with a movement whose leader [Fuentes] denounces Usha Vance as a ‘jeet,’ you’re crazy. But that’s how they think.”</p><p>They’re not delusional. They simply don’t give one single solitary fragment of a fuck about winning elections anymore, nor should they. <em>They are not Republicans!</em> These myopic conservative morons should ask the young British men how much being ruled over by Jeets like Dishy Rishy appealed to them. They don’t want any foreigners as part of their movement, as part of their government, or as part of their society anymore. Because it’s not an ideological movement, <em>it’s an identity movement</em>, which is a natural, inevitable, and absolutely necessary development for whites in a multiracial, multireligious empire like the USA, as per Lee Kwan Yew, a politician whose grasp of politics vastly exceeded that of these conservative poltroons.</p><p>I publicly predicted all of this back in 2004. I said that the long-term winning strategy for Republicans was to stop pandering to minorities and become the White People’s Party. They didn’t listen then, they won’t listen now, and they probably won’t even begin to think about the possibility that I was correct until their electoral prospects begin to approach that of the current Conservative Party in the UK.</p></blockquote><p><em><a href=\"https://socialgalactic.com/micropost/ca128a2d-ff8c-4bcc-b6fe-dfe4628eb586\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Rod Dreher admits that\nconservatism has completely failed\n, but he still refuses to give up either his hopes for reform or his faith in the essential goodness of the Synagogue of Satan while he laments the refusal of young men to swallow the same bullshit lies that their fathers and grandfathers did.\nAs our conversation went on, I heard real despair — and well-informed despair — that democracy is going to hold in the West, because the conditions that make for a viable democracy are disappearing: the dissolution of a common culture, the collapse of religion in his generation, the material impoverishment of his generation, and so forth.\nI tell you, it was dark. But I kept hearing this, over and over, and I concluded that it cannot be dismissed.\nThe inability of us older people — Boomers, Xers, and older Millennials — to comprehend the world through the eyes of Zoomers is a big, big problem. Another strong theme: while it’s important to take a clear stand against anti-Semitism in the ranks, there is no way to gatekeep our way out of this. You cannot simply point at the Zoomers and say, “Thou shalt not,” and expect it to work. The problems are too deep and complex, and anyway, they have learned to have no respect for authority.\nWhy should they? The institutions of our society, as they see it, have lied and lied and lied, and still lie. They still lie in many ways about race (e.g., refusing to be honest about black crime), they lied about Covid, they lied about males and females, and they forced the insanity of gender ideology on us all. The military lied about Iraq. The universities embraced and enforced ideologies of lies. The Catholic Church lied about sexual abuse, and the connection to the prevalence of sexually active gay priests honeycombing the institution. They lied about the benefits of mass migration and diversity. They lied about Trump and Russia. The political parties and their corporate allies lied about what globalism would mean for ordinary people.\nThe media have lied and do lie about most things… Trust in the system is gone. Hell, I share most of these conclusions myself! The difference is that I am not a nihilist; I don’t want to tear it all down, but rather reform it.\nThere will be no reformation. There can be no reformation, for the obvious reason that there is nothing left to reform. Democracy is dead. The USA is no longer an American nation. The very purpose of the Constitution has not only been subverted, but inverted and is actively used to suppress and repress the rights of the very Posterity it was meant to secure.\nAs I wrote in 2004, one cannot revive a corpse. The lamentations of the conservatives are nothing more than morning for the world that they lost, for the world that they refused to defend on the basis of their fundamentally false assumptions about the wicked who have labored without ceasing to destroy America, Western civilization, and Christianity itself.\nThey have already succeeded in destroying the USA. They may be successful in destroying Western civilization. They will never succeed in destroying Christianity.\nIn the meantime, what is Rod Dreher’s plan for “reforming” this? I really fail to see how importing more Indians on H1B visas, attacking antisemitism, or sending more money to Israel is going to improve this situation in the slightest.\nSo if the young men want to burn everyone who was responsible for this absolutely unnecessary and completely avoidable civilizational catastrophe at the stake, I, for one, absolutely understand their point of view and I don’t give a quantum of a fraction of a damn about all the conservative legalistic dancing about how those who were obviously responsible for creating the situation weren’t the only ones involved.\nThis perspective from a Republican politico of color only underlines how little the conservatives and the Republicans understand the situation.\n“These idiots don’t understand that they can’t win an election on a whites-only platform,” he said. “They’re delusional. There are a lot of immigrants and native-born members of ethnic groups who are natural Republicans, and whom Donald Trump won in 2024. Take Indians, for example — if you think they are going to stick with a movement whose leader [Fuentes] denounces Usha Vance as a ‘jeet,’ you’re crazy. But that’s how they think.”\nThey’re not delusional. They simply don’t give one single solitary fragment of a fuck about winning elections anymore, nor should they.\nThey are not Republicans!\nThese myopic conservative morons should ask the young British men how much being ruled over by Jeets like Dishy Rishy appealed to them. They don’t want any foreigners as part of their movement, as part of their government, or as part of their society anymore. Because it’s not an ideological movement,\nit’s an identity movement\n, which is a natural, inevitable, and absolutely necessary development for whites in a multiracial, multireligious empire like the USA, as per Lee Kwan Yew, a politician whose grasp of politics vastly exceeded that of these conservative poltroons.\nI publicly predicted all of this back in 2004. I said that the long-term winning strategy for Republicans was to stop pandering to minorities and become the White People’s Party. They didn’t listen then, they won’t listen now, and they probably won’t even begin to think about the possibility that I was correct until their electoral prospects begin to approach that of the current Conservative Party in the UK.\nDISCUSS ON SG",
  "tags": [
    "cuckservative",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-11-12T14:15:10+00:00"
}