{
  "url": "https://voxday.net/2025/11/26/an-objective-achieved/",
  "scraped_at": "2026-01-08T20:37:38.954523",
  "title": "An Objective, Achieved",
  "date_display": "November 26, 2025",
  "date_iso": "2025-11-26T14:35:40+00:00",
  "date_from_url": "2025-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am, and have been for more than thirty years, a dedicated fan of David Sylvian. His music represents the pinnacle of all post-classical music as far as I am concerned, and while I consider <em>Gone To Earth</em> my proverbial desert island CD, I regard <em>Orpheus</em>, off <em>Secrets of the Beehive</em>, to be his best and most well-written song. And I’m not the only member of Psykosonik to regret never having met him when we were both living in the Twin Cities, although in fairness, I didn’t know it at the time.</p><p>And while I know I will never ascend to those musical heights, that knowledge hasn’t stopped me from trying to achieve something on the musical side that might at least merit being compared to it in some way, even if the comparison is entirely one-sided to my detriment. Think AODAL compared to LOTR, for example.</p><p>Anyhow, after dozens of attempts over 37 years, I think I finally managed to write a song that might qualify in that regard. It’s good enough that the professional audio engineer with whom I’ve been working chose to use it to demonstrate his incredible abilities to mix and master an AI track to levels that no one would have believed possible even three months ago. It’s called <em>One Last Breath</em> and you can hear <a href=\"https://aicentral.substack.com/p/how-to-mix-ai-music-stems\">a pre-release version of it at AI Central</a>, as well as a link to Max’s detailed explanation of what he does to breath audio life into the artifice of AI-generated music.</p><p>If you’re producing any AI music, you absolutely have to follow the link <a href=\"https://mixgenie.co/ai-mxing\">to Max’s site</a>, as he goes into more detail, provides before and after examples, and even has a special Thanksgiving sale offer on both mixes and masters. I very, very highly recommend the mix-and-master option using the extracted stems; while the mastering audibly improves the sound, the mixing is what really takes the track to the higher levels of audio nirvana. Please note that I don’t get anything out of this, this isn’t part of a referral program or anything, I’m just an extremely satisfied customer and fan of Max’s work.</p><p><em>Mission control, I’m letting go<br/>There’s nothing left you need to know<br/>Tell them I went out like fire<br/>Tell them anything they require<br/>But between us, just you and me<br/>I finally learned how to break free<br/>To be the man I always thought I’d be</em></p><p>Anyhow, check it out, and feel free to let me know what you think of it. For those who are curious about some of the oddly specific references in the lyrics, it was written for the soundtrack of the Moon comedy that Chuck Dixon and I wrote as a vehicle for Owen Benjamin, which we hope to make one day.</p><p><em><a href=\"https://socialgalactic.com/micropost/2bb6047b-1d36-486f-84df-6fd03a94ef24\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I am, and have been for more than thirty years, a dedicated fan of David Sylvian. His music represents the pinnacle of all post-classical music as far as I am concerned, and while I consider\nGone To Earth\nmy proverbial desert island CD, I regard\nOrpheus\n, off\nSecrets of the Beehive\n, to be his best and most well-written song. And I’m not the only member of Psykosonik to regret never having met him when we were both living in the Twin Cities, although in fairness, I didn’t know it at the time.\nAnd while I know I will never ascend to those musical heights, that knowledge hasn’t stopped me from trying to achieve something on the musical side that might at least merit being compared to it in some way, even if the comparison is entirely one-sided to my detriment. Think AODAL compared to LOTR, for example.\nAnyhow, after dozens of attempts over 37 years, I think I finally managed to write a song that might qualify in that regard. It’s good enough that the professional audio engineer with whom I’ve been working chose to use it to demonstrate his incredible abilities to mix and master an AI track to levels that no one would have believed possible even three months ago. It’s called\nOne Last Breath\nand you can hear\na pre-release version of it at AI Central\n, as well as a link to Max’s detailed explanation of what he does to breath audio life into the artifice of AI-generated music.\nIf you’re producing any AI music, you absolutely have to follow the link\nto Max’s site\n, as he goes into more detail, provides before and after examples, and even has a special Thanksgiving sale offer on both mixes and masters. I very, very highly recommend the mix-and-master option using the extracted stems; while the mastering audibly improves the sound, the mixing is what really takes the track to the higher levels of audio nirvana. Please note that I don’t get anything out of this, this isn’t part of a referral program or anything, I’m just an extremely satisfied customer and fan of Max’s work.\nMission control, I’m letting go\nThere’s nothing left you need to know\nTell them I went out like fire\nTell them anything they require\nBut between us, just you and me\nI finally learned how to break free\nTo be the man I always thought I’d be\nAnyhow, check it out, and feel free to let me know what you think of it. For those who are curious about some of the oddly specific references in the lyrics, it was written for the soundtrack of the Moon comedy that Chuck Dixon and I wrote as a vehicle for Owen Benjamin, which we hope to make one day.\nDISCUSS ON SG",
  "tags": [
    "AI Central",
    "music",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-11-26T14:46:35+00:00"
}