{
  "url": "https://voxday.net/2025/11/15/china-warns-japan-3/",
  "scraped_at": "2026-01-08T20:36:44.765608",
  "title": "China Warns Japan",
  "date_display": "November 15, 2025",
  "date_iso": "2025-11-15T17:52:37+00:00",
  "date_from_url": "2025-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The first female Prime Minister of Japan has already managed <a href=\"https://japantoday.com/category/politics/japan-trying-to-revive-wartime-militarism-with-its-taiwan-comments-china's-top-paper-says\">to seriously put her foot in it</a> with regards to the island of Taiwan.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Japan will suffer a “crushing defeat” by the Chinese military if it tries to use force to intervene over Taiwan, China’s defense ministry said on Friday, ramping up the rhetoric over Japanese Prime Minister Sanae Takaichi’s remarks about the island. Takaichi sparked a diplomatic row with Beijing with comments in parliament last week that a Chinese attack on Taiwan could amount to a “survival-threatening situation” and trigger a military response from Tokyo.</p><p>China’s top diplomat in Osaka shared a news article about Takaichi’s remarks about Taiwan on X and commented “the dirty neck that sticks itself in must be cut off”, prompting a protest from Japan’s embassy in Beijing to Chinese Vice Foreign Minister Sun Weidong.</p><p>Chinese Defense Ministry spokesperson Jiang Bin said that Takaichi’s words were extremely irresponsible and dangerous. “Should the Japanese side fail to draw lessons from history and dare to take a risk, or even use force to interfere in the Taiwan question, it will only suffer a crushing defeat against the steel-willed People’s Liberation Army and pay a heavy price,” Jiang said in a statement.</p><p>On Thursday, Sun summoned Japan’s Ambassador to China, Kenji Kanasugi, to lodge a “strong protest” over Takaichi’s remarks.</p></blockquote><p>The Chinese have already issued <a href=\"https://japantoday.com/category/politics/update2-ldp-official-vows-efforts-for-stable-japan-china-ties-despite-travel-alert\">a travel alert concerning Japan</a> and the Foreign Ministry has made it clear that <a href=\"https://www.mfa.gov.cn/eng/xw/fyrbt/lxjzh/202511/t20251113_11752756.html\">the new Prime Minister is an obvious concern</a> of the Chinese government.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>People’s Daily: </strong><em>Japanese Prime Minister Sanae Takaichi said last week that the mainland’s use of force on Taiwan could constitute a “survival-threatening situation” for Japan. It’s reported that during Diet deliberations, Sanae Takaichi said her remark is in line with the government’s position and she will not retract it. What’s China’s comment?</em></p><p><strong>Lin Jian:</strong> In the Diet last week, Japanese Prime Minister Sanae Takaichi made provocative remarks on Taiwan which imply the possibility of armed intervention in the Taiwan Strait. Despite China’s serious démarches and protests, she still refused to change course and take back what she had said. The wrongful remarks grossly violate the one-China principle, the guiding principles set forth in the four China-Japan political documents, and the basic norms of international relations. That constitutes a blatant interference in China’s internal affairs, a challenge to China’s core interests, and infringement on China’s sovereignty. China firmly opposes and will by no means tolerate such remarks. The Japanese side must correct its wrongdoing at once and retract the unjustified remarks. Otherwise, all the consequences arising therefrom must be borne by the Japanese side. </p><p>This year marks the 80th anniversary of the victory of the Chinese People’s War of Resistance Against Japanese Aggression and the World Anti-Fascist War. It is also the 80th anniversary of the recovery of Taiwan. Japan committed innumerable crimes during its colonial rule in Taiwan. Over the last century, Japanese militarists have waged aggression more than once under the pretext of “survival-threatening situation.” For example, Japan brazenly created the September 18th Incident under the pretext of exercising the right of self-defense. Its aggression against China inflicted untold suffering on the people of China, the rest of Asia, and the wider world. What’s Prime Minister Sanae Takaichi up to by reviving the phrase “survival-threatening situation”? Is Japan going to repeat its past mistakes of militarism? Does Japan try to once again make enemy with the Chinese and other Asian people? Does Japan attempt to subvert the post-WWII international order?</p><p>Taiwan belongs to China. How to resolve the Taiwan question and realize national reunification is a matter for the Chinese people to decide and brooks no interference by any external force. The attempt by the leader of Japan to wade into cross-Strait affairs is a serious affront to international justice, a blatant provocation to the post-WWII order, and a great blow to China-Japan relations. If Japan dares to attempt an armed intervention in the cross-Strait situation, it would be an act of aggression and definitely meet a firm response from China. We will firmly exercise our right to self-defense under the U.N. Charter and international law and defend China’s sovereignty and territorial integrity. Our message to Japan is clear: Japan must fully repent for its war crimes, immediately stop its wrong and provocative statements and moves that interfere in China’s internal affairs, and stop playing with fire on the Taiwan question. Those who play with fire will perish by it!</p></blockquote><p>It’s abundantly clear that the LDP did a deal with the Clown World devil in order to retain power despite its minority status, as both Takaichi and her predecessor aligned themselves and their party with Japan’s occupiers, who plan to use Japan as their primary fortress in Asia against China.</p><p>So, rather like Americans, the Japanese are desperate for a leader who will restore their demographics and instead find themselves saddled with another Clown World puppet pushing them into wars of zero interest for the people.</p><p>Because <em>democracy</em>…</p><p><em><a href=\"https://socialgalactic.com/micropost/b434aa57-faa2-41d8-b9da-1e9dfeaddac7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The first female Prime Minister of Japan has already managed\nto seriously put her foot in it\nwith regards to the island of Taiwan.\nJapan will suffer a “crushing defeat” by the Chinese military if it tries to use force to intervene over Taiwan, China’s defense ministry said on Friday, ramping up the rhetoric over Japanese Prime Minister Sanae Takaichi’s remarks about the island. Takaichi sparked a diplomatic row with Beijing with comments in parliament last week that a Chinese attack on Taiwan could amount to a “survival-threatening situation” and trigger a military response from Tokyo.\nChina’s top diplomat in Osaka shared a news article about Takaichi’s remarks about Taiwan on X and commented “the dirty neck that sticks itself in must be cut off”, prompting a protest from Japan’s embassy in Beijing to Chinese Vice Foreign Minister Sun Weidong.\nChinese Defense Ministry spokesperson Jiang Bin said that Takaichi’s words were extremely irresponsible and dangerous. “Should the Japanese side fail to draw lessons from history and dare to take a risk, or even use force to interfere in the Taiwan question, it will only suffer a crushing defeat against the steel-willed People’s Liberation Army and pay a heavy price,” Jiang said in a statement.\nOn Thursday, Sun summoned Japan’s Ambassador to China, Kenji Kanasugi, to lodge a “strong protest” over Takaichi’s remarks.\nThe Chinese have already issued\na travel alert concerning Japan\nand the Foreign Ministry has made it clear that\nthe new Prime Minister is an obvious concern\nof the Chinese government.\nPeople’s Daily:\nJapanese Prime Minister Sanae Takaichi said last week that the mainland’s use of force on Taiwan could constitute a “survival-threatening situation” for Japan. It’s reported that during Diet deliberations, Sanae Takaichi said her remark is in line with the government’s position and she will not retract it. What’s China’s comment?\nLin Jian:\nIn the Diet last week, Japanese Prime Minister Sanae Takaichi made provocative remarks on Taiwan which imply the possibility of armed intervention in the Taiwan Strait. Despite China’s serious démarches and protests, she still refused to change course and take back what she had said. The wrongful remarks grossly violate the one-China principle, the guiding principles set forth in the four China-Japan political documents, and the basic norms of international relations. That constitutes a blatant interference in China’s internal affairs, a challenge to China’s core interests, and infringement on China’s sovereignty. China firmly opposes and will by no means tolerate such remarks. The Japanese side must correct its wrongdoing at once and retract the unjustified remarks. Otherwise, all the consequences arising therefrom must be borne by the Japanese side.\nThis year marks the 80th anniversary of the victory of the Chinese People’s War of Resistance Against Japanese Aggression and the World Anti-Fascist War. It is also the 80th anniversary of the recovery of Taiwan. Japan committed innumerable crimes during its colonial rule in Taiwan. Over the last century, Japanese militarists have waged aggression more than once under the pretext of “survival-threatening situation.” For example, Japan brazenly created the September 18th Incident under the pretext of exercising the right of self-defense. Its aggression against China inflicted untold suffering on the people of China, the rest of Asia, and the wider world. What’s Prime Minister Sanae Takaichi up to by reviving the phrase “survival-threatening situation”? Is Japan going to repeat its past mistakes of militarism? Does Japan try to once again make enemy with the Chinese and other Asian people? Does Japan attempt to subvert the post-WWII international order?\nTaiwan belongs to China. How to resolve the Taiwan question and realize national reunification is a matter for the Chinese people to decide and brooks no interference by any external force. The attempt by the leader of Japan to wade into cross-Strait affairs is a serious affront to international justice, a blatant provocation to the post-WWII order, and a great blow to China-Japan relations. If Japan dares to attempt an armed intervention in the cross-Strait situation, it would be an act of aggression and definitely meet a firm response from China. We will firmly exercise our right to self-defense under the U.N. Charter and international law and defend China’s sovereignty and territorial integrity. Our message to Japan is clear: Japan must fully repent for its war crimes, immediately stop its wrong and provocative statements and moves that interfere in China’s internal affairs, and stop playing with fire on the Taiwan question. Those who play with fire will perish by it!\nIt’s abundantly clear that the LDP did a deal with the Clown World devil in order to retain power despite its minority status, as both Takaichi and her predecessor aligned themselves and their party with Japan’s occupiers, who plan to use Japan as their primary fortress in Asia against China.\nSo, rather like Americans, the Japanese are desperate for a leader who will restore their demographics and instead find themselves saddled with another Clown World puppet pushing them into wars of zero interest for the people.\nBecause\ndemocracy\n…\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2025-11-15T17:52:42+00:00"
}