{
  "url": "https://voxday.net/2025/11/26/clown-world-is-agreement-incapable/",
  "scraped_at": "2026-01-08T20:37:37.144636",
  "title": "Clown World is Agreement-Incapable",
  "date_display": "November 26, 2025",
  "date_iso": "2025-11-26T10:50:13+00:00",
  "date_from_url": "2025-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The 28-point peace plan announced last week is obviously dead on arrival. Clown World’s European puppets are already engaging in their characteristic surreal legalism as they explain how they’re going to put European troops from 20 countries into Odessa the day after the Russians sign the agreement, and that will be fine because they won’t be NATO troops even though all the countries contributing the troops are NATO members. <a href=\"https://simplicius76.substack.com/p/settlement-carnival-reaches-fever\">This very clever approach</a> was courtesy of President Macron of France.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The second component, the second line, is what we call the reinsurance forces. This means that, far from the front line, but in fallback sites, in Kiev, in Odessa, to give an example, things are planned, they have a confidentiality component, we set up reinsurance forces. Meaning that there are British, French, Turkish soldiers, who, on the day when peace is signed, i.e. not in a context of war, are there to carry out training and provide security, just as we do in certain countries on NATO’s eastern flank.</p><p>This will be a different case, because it’s not NATO, it’s an intergovernmental coalition, but we have around twenty countries that have already said what they are prepared to do actively, either in the air, on land, or at sea.</p></blockquote><p>I didn’t think the peace plan was viable because it didn’t give the Russians the one thing they want that they don’t already control, which is Odessa. If you’re winning a war in the operational, strategic, and economic contexts, there is no reason to take any deal that doesn’t give you what you’re going to be able to take eventually.</p><p>And now that its clear that the Europeans will play word games about NATO in order to establish their speed bumps intended to trigger US military intervention, there is no point in signing Minsk 3.0 and guarantee the war continues in 2-3 years in a potentially less advantageous environment.</p><p>Although, to be honest, I don’t see any sign that the European militaries will be any stronger in the future than they are today; by then at least one of the major governments, or quite possibly both the French and German regimes, will have been replaced by a pro-Russian nationalist one.</p><p><em><a href=\"https://socialgalactic.com/micropost/349ac1c3-23f2-46f5-a9ec-1227c7ac5f3a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The 28-point peace plan announced last week is obviously dead on arrival. Clown World’s European puppets are already engaging in their characteristic surreal legalism as they explain how they’re going to put European troops from 20 countries into Odessa the day after the Russians sign the agreement, and that will be fine because they won’t be NATO troops even though all the countries contributing the troops are NATO members.\nThis very clever approach\nwas courtesy of President Macron of France.\nThe second component, the second line, is what we call the reinsurance forces. This means that, far from the front line, but in fallback sites, in Kiev, in Odessa, to give an example, things are planned, they have a confidentiality component, we set up reinsurance forces. Meaning that there are British, French, Turkish soldiers, who, on the day when peace is signed, i.e. not in a context of war, are there to carry out training and provide security, just as we do in certain countries on NATO’s eastern flank.\nThis will be a different case, because it’s not NATO, it’s an intergovernmental coalition, but we have around twenty countries that have already said what they are prepared to do actively, either in the air, on land, or at sea.\nI didn’t think the peace plan was viable because it didn’t give the Russians the one thing they want that they don’t already control, which is Odessa. If you’re winning a war in the operational, strategic, and economic contexts, there is no reason to take any deal that doesn’t give you what you’re going to be able to take eventually.\nAnd now that its clear that the Europeans will play word games about NATO in order to establish their speed bumps intended to trigger US military intervention, there is no point in signing Minsk 3.0 and guarantee the war continues in 2-3 years in a potentially less advantageous environment.\nAlthough, to be honest, I don’t see any sign that the European militaries will be any stronger in the future than they are today; by then at least one of the major governments, or quite possibly both the French and German regimes, will have been replaced by a pro-Russian nationalist one.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "EU",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-11-26T10:50:15+00:00"
}