{
  "url": "https://voxday.net/2025/11/15/it-is-good-to-hate-the-boomer-3/",
  "scraped_at": "2026-01-08T20:36:42.948738",
  "title": "It is Good to Hate the Boomer",
  "date_display": "November 15, 2025",
  "date_iso": "2025-11-15T16:01:45+00:00",
  "date_from_url": "2025-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, we’ve finally reached the first Boomer cartoon in the <em>Hypergamouse</em> series on Sigma Game. In less than FIVE MINUTES <a href=\"https://sigmagame.substack.com/p/oh-nothing\">from the new post</a> going live:</p><p><em>Boomers were generations in the making. You have the wrong target and your hatred will get you to a place you don’t want to be.</em></p><p>The Boomers simply never grew up. They’re entering their 80s now and they <em>still </em>can’t take <em>any responsibility </em>for <em>their own collective actions</em> across more than sixty years of putative adulthood. Our hatred is not at all misplaced; God himself hates the wicked. Moreover, He appears to harbor particular hate for wicked generations who don’t care for, or about, the succeeding generations.</p><p>The Boomers collectively denied the faith and are worse than infidels. So it should not be a surprise that the judgment of the younger generations is falling so hard on them. Or that, by and large, they remain wholly unrepentant.</p><p><em>But if any provide not for his own, and specially for those of his own house, he hath denied the faith, and is worse than an infidel.</em> – 1 Timothy 5:8</p><p><em><a href=\"https://socialgalactic.com/micropost/a912eecd-6ef7-4802-b4e6-671aef13034a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "So, we’ve finally reached the first Boomer cartoon in the\nHypergamouse\nseries on Sigma Game. In less than FIVE MINUTES\nfrom the new post\ngoing live:\nBoomers were generations in the making. You have the wrong target and your hatred will get you to a place you don’t want to be.\nThe Boomers simply never grew up. They’re entering their 80s now and they\nstill\ncan’t take\nany responsibility\nfor\ntheir own collective actions\nacross more than sixty years of putative adulthood. Our hatred is not at all misplaced; God himself hates the wicked. Moreover, He appears to harbor particular hate for wicked generations who don’t care for, or about, the succeeding generations.\nThe Boomers collectively denied the faith and are worse than infidels. So it should not be a surprise that the judgment of the younger generations is falling so hard on them. Or that, by and large, they remain wholly unrepentant.\nBut if any provide not for his own, and specially for those of his own house, he hath denied the faith, and is worse than an infidel.\n– 1 Timothy 5:8\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-11-15T16:01:50+00:00"
}