{
  "url": "https://voxday.net/2025/11/28/the-fake-authors/",
  "scraped_at": "2026-01-08T20:37:49.924988",
  "title": "The Fake Authors",
  "date_display": "November 28, 2025",
  "date_iso": "2025-11-28T22:52:28+00:00",
  "date_from_url": "2025-11-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was always very dubious about the authorship of the one-off Southern bestseller. As a general rule, when an author just writes one book, he probably wasn’t the real author. Courtesy of CDAN:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Several decades ago, this A+ list author died. Over the years many of his personal items have come up for public auction. One item though, was originally sold secretly and the three times it has changed hands in the past couple of decades, the secrecy agreement goes with it. It is because the owner is not allowed to tell anyone what they have, that it gets sold so often. It is the original half typed, half handwritten manuscript that the author wrote but was credited to a different author. It is one of the biggest selling books of all time. The A+ list author didn’t think it matched his personality so gave it to one of his best friends. Later in life they made a deal to keep the true author secret.</p><p>Truman Capote/<em>To Kill A Mockingbird</em>/Harper Lee</p></blockquote><p>It would be interesting to see the results of a textual analysis of the text of <em>To Kill A Mockingbird</em> with other work by Capote. It’s obviously in his favored genre of semi-true crime. I don’t have an opinion on the real author, since I read it in English class more than 40 years ago, and I don’t remember much of it. I vaguely recall that I put it down as soon as I figured out that it was primarily concerned with contrasting racist white Southerners with the noble Negro who never done nothin’ to nobody.</p><p>We now know that the real “Shakespeare” was Sir Thomas North. I suspect that textual analysis is eventually going to prove that a lot of modern classics and bestsellers were essentially manufactured in much the same way media figures and landmark scientific studies are. Especially those, like <em>The Catcher in the Rye</em>, <em>To Kill A Mockingbird</em>, <em>Lord of the Flies</em>, and <em>Portnoy’s Complaint</em>, that were heavily utilized in the U.S. educational system to invert social assumptions and subvert society.</p><p>Alert Dennis McCarthy! Send out the Batsignal!</p><p><em><a href=\"https://socialgalactic.com/micropost/45bb1663-6399-410f-ba16-dafc820d7a3f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I was always very dubious about the authorship of the one-off Southern bestseller. As a general rule, when an author just writes one book, he probably wasn’t the real author. Courtesy of CDAN:\nSeveral decades ago, this A+ list author died. Over the years many of his personal items have come up for public auction. One item though, was originally sold secretly and the three times it has changed hands in the past couple of decades, the secrecy agreement goes with it. It is because the owner is not allowed to tell anyone what they have, that it gets sold so often. It is the original half typed, half handwritten manuscript that the author wrote but was credited to a different author. It is one of the biggest selling books of all time. The A+ list author didn’t think it matched his personality so gave it to one of his best friends. Later in life they made a deal to keep the true author secret.\nTruman Capote/\nTo Kill A Mockingbird\n/Harper Lee\nIt would be interesting to see the results of a textual analysis of the text of\nTo Kill A Mockingbird\nwith other work by Capote. It’s obviously in his favored genre of semi-true crime. I don’t have an opinion on the real author, since I read it in English class more than 40 years ago, and I don’t remember much of it. I vaguely recall that I put it down as soon as I figured out that it was primarily concerned with contrasting racist white Southerners with the noble Negro who never done nothin’ to nobody.\nWe now know that the real “Shakespeare” was Sir Thomas North. I suspect that textual analysis is eventually going to prove that a lot of modern classics and bestsellers were essentially manufactured in much the same way media figures and landmark scientific studies are. Especially those, like\nThe Catcher in the Rye\n,\nTo Kill A Mockingbird\n,\nLord of the Flies\n, and\nPortnoy’s Complaint\n, that were heavily utilized in the U.S. educational system to invert social assumptions and subvert society.\nAlert Dennis McCarthy! Send out the Batsignal!\nDISCUSS ON SG",
  "tags": [
    "books",
    "Clown World",
    "conspiracy",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-11-28T23:39:21+00:00"
}