{
  "url": "https://voxday.net/2025/11/14/the-banned-interview/",
  "scraped_at": "2026-01-08T20:36:35.943658",
  "title": "The Banned Interview",
  "date_display": "November 14, 2025",
  "date_iso": "2025-11-14T10:11:26+00:00",
  "date_from_url": "2025-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Italian media <a href=\"https://www.rt.com/russia/627767-censored-lavrov-interview-with-italian-liberal-newspaper/\">spiked this interview</a> with Russian Foreign Minister Sergei Lavrov for some reason:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em><strong>Corriere della Sera: </strong>Units of the Russian Armed Forces are currently controlling less territory than in 2022, several weeks into what you call a special military operation. If you are truly prevailing why can’t you deliver a decisive strike? Could you also explain why you are not publicising official losses?</em></p><p><strong>Sergey Lavrov:</strong> The special military operation is not a war for territories but an operation to save lives of millions of people who have lived on those territories for centuries and whom the Kiev junta seeks to eradicate – legally, by prohibiting their history, language and culture, and physically, by using Western weapons. Another important goal of the special military operation is to ensure Russia’s security and to undermine the plans of NATO and the EU to create a hostile puppet state at our western borders that, by law and in reality, relies on Nazi ideology. It is not the first time we have stopped fascist and Nazi aggressors. That happened during World War II and it will happen again.</p><p>Unlike Westerners who have wiped out entire neighbourhoods, we are sparing people – both civilians and military personnel. Our armed forces are acting extremely responsibly and delivering high-precision strikes exclusively at military targets and associated transport and energy infrastructure.</p><p>It is not customary to publicise battlefield losses. I can only say that this year, Russia has transferred over 9,000 bodies of Ukrainian personnel in repatriation. We have received 143 bodies of our fighters from Ukraine. You can come to your own conclusions.</p></blockquote><p>This isn’t, and has never been, a conventional war about territory and the industrial slaughter of civilians. Even if the Russians hadn’t been consistently telling everyone that for nearly four years, it’s entirely obvious from their conduct of the Special Military Operation.</p><p>If the Russians ever decide to go to actual war with NATO or the EU, the difference will be very, very clear to everyone.</p><p><em><a href=\"https://socialgalactic.com/micropost/4d2f2f8b-f1cd-49c4-a14e-498e6a3e828e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Italian media\nspiked this interview\nwith Russian Foreign Minister Sergei Lavrov for some reason:\nCorriere della Sera:\nUnits of the Russian Armed Forces are currently controlling less territory than in 2022, several weeks into what you call a special military operation. If you are truly prevailing why can’t you deliver a decisive strike? Could you also explain why you are not publicising official losses?\nSergey Lavrov:\nThe special military operation is not a war for territories but an operation to save lives of millions of people who have lived on those territories for centuries and whom the Kiev junta seeks to eradicate – legally, by prohibiting their history, language and culture, and physically, by using Western weapons. Another important goal of the special military operation is to ensure Russia’s security and to undermine the plans of NATO and the EU to create a hostile puppet state at our western borders that, by law and in reality, relies on Nazi ideology. It is not the first time we have stopped fascist and Nazi aggressors. That happened during World War II and it will happen again.\nUnlike Westerners who have wiped out entire neighbourhoods, we are sparing people – both civilians and military personnel. Our armed forces are acting extremely responsibly and delivering high-precision strikes exclusively at military targets and associated transport and energy infrastructure.\nIt is not customary to publicise battlefield losses. I can only say that this year, Russia has transferred over 9,000 bodies of Ukrainian personnel in repatriation. We have received 143 bodies of our fighters from Ukraine. You can come to your own conclusions.\nThis isn’t, and has never been, a conventional war about territory and the industrial slaughter of civilians. Even if the Russians hadn’t been consistently telling everyone that for nearly four years, it’s entirely obvious from their conduct of the Special Military Operation.\nIf the Russians ever decide to go to actual war with NATO or the EU, the difference will be very, very clear to everyone.\nDISCUSS ON SG",
  "tags": [
    "media",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-11-14T10:11:31+00:00"
}