{
  "url": "https://voxday.net/2025/11/23/the-dark-side-of-star-trek/",
  "scraped_at": "2026-01-08T20:37:23.204643",
  "title": "The Dark Side of Star Trek",
  "date_display": "November 23, 2025",
  "date_iso": "2025-11-23T16:49:27+00:00",
  "date_from_url": "2025-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Star Trek</em> was always problematic, and not just because of Gene Roddenberry’s alarming enthusiasm for young girls’ underwear, as <a href=\"https://arkhaven.substack.com/p/is-mr-roddenberry-a-secret-fascist\">the Dark Herald observes its intellectual roots</a> at Arkhaven.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A bunch of scientists, engineers and assorted smartasses got together and create a new organization dedicated to conquering the world and running it with enlightened scientific centrally planned totality. No politics needed because there will be no dissent at all — after all, how can you dissent from the perfection of science?</p><p>This is called a “Technocracy.”</p><p>In Wells’ horrible dream of the future this organization was called the Modern State Movement, (The movie version was called Wings Over the World). From their base in Basra, the self-proclaimed Air Dictatorship begins a campaign to bring order to the world by force, suppressing warlike “backward” national regimes and establishing a unified, rational, scientific world order. And they were dressed like BUF Black Shirts with breast plates.</p><p>They impose global peace, eliminate national sovereignty, abolish all traditional political systems, and construct a universal education program designed to create scientifically minded citizens, (yeah nothing bad can come from that).</p><p>All religion is suppressed… Of course</p><p>Family structures are destroyed — this is the big one for all of the totalitarian movements. The state is what raises the kids, not their parents. The state is what teaches children their governing values, not their families. Marriage is a very temporary and ephemeral matter, both sides are urged to move on from it as quickly as possible. And depending on how honest the technocrats are being about it — incest is to be encouraged.</p><p>Material abundance returns through centralized planning and technological management. The world eventually becomes a world state — stable, secular, regimented, paternalistic, eternal and it sounds like my idea of Hell on Earth. This is a world governed by Madelaine L’Engle’s IT.</p><p>From Things to Come, you can trace a straight line through to Doctor Who to Asimov’s Foundation to 1960s liberal utopianism, and Walt Disney’s original plan for EPCOT.</p></blockquote><p>A long time ago, I started writing what Nick Cole described as<em> STAR WARS NOT STAR WARS</em> with a co-writer. He was going to write <em>STAR TREK NOT STAR TREK</em> with a co-writer at the same time. But mine didn’t work out, for a variety of reasons, and Nick and Jason ended up writing <em>STAR WARS NOT STAR WARS </em>themselves, which was eventually published as <em>GALAXY’S EDGE</em> and worked out rather well for them.</p><p>It’s rather amusing that people in SF/F keep trying to cancel my science fiction career, when I am more than adept at sabotaging it myself. Did I ever mention that I turned down Blizzard and Simon &amp; Schuster when they approved my outline for the first <em>STARCRAFT</em> novel and asked me to write it? The lesson, as always is this: just shut up, write what they want you to write, and stop getting in your own way.</p><p>But the Dark Herald’s piece does give me an excellent idea… albeit one that will likely make JDA very, very sad.</p><p>In other writing news, I’ll be sending the <em>OUT OF THE SHADOWS</em> ebook to the Signed First Edition backers, the original MW ebook backers, and putting it up on Amazon this week. It will also be available as part of the Based Books Sale for everyone else. The paperback will be sent out to the <em>MIDNIGHT’S WAR</em> Vol. 7-12 backers along with <em>THE TRAGEDY OF THE TRIBUNE</em> omnibus both of them are ready.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-69329\" decoding=\"async\" fetchpriority=\"high\" height=\"768\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/11/image-32.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/11/image-32.png 512w, https://voxday.net/wp-content/uploads/2025/11/image-32-200x300.png 200w\" width=\"512\"/></figure></div><p><em><a href=\"https://socialgalactic.com/micropost/4d021286-e7b3-4f28-8df0-96230f471377\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Star Trek\nwas always problematic, and not just because of Gene Roddenberry’s alarming enthusiasm for young girls’ underwear, as\nthe Dark Herald observes its intellectual roots\nat Arkhaven.\nA bunch of scientists, engineers and assorted smartasses got together and create a new organization dedicated to conquering the world and running it with enlightened scientific centrally planned totality. No politics needed because there will be no dissent at all — after all, how can you dissent from the perfection of science?\nThis is called a “Technocracy.”\nIn Wells’ horrible dream of the future this organization was called the Modern State Movement, (The movie version was called Wings Over the World). From their base in Basra, the self-proclaimed Air Dictatorship begins a campaign to bring order to the world by force, suppressing warlike “backward” national regimes and establishing a unified, rational, scientific world order. And they were dressed like BUF Black Shirts with breast plates.\nThey impose global peace, eliminate national sovereignty, abolish all traditional political systems, and construct a universal education program designed to create scientifically minded citizens, (yeah nothing bad can come from that).\nAll religion is suppressed… Of course\nFamily structures are destroyed — this is the big one for all of the totalitarian movements. The state is what raises the kids, not their parents. The state is what teaches children their governing values, not their families. Marriage is a very temporary and ephemeral matter, both sides are urged to move on from it as quickly as possible. And depending on how honest the technocrats are being about it — incest is to be encouraged.\nMaterial abundance returns through centralized planning and technological management. The world eventually becomes a world state — stable, secular, regimented, paternalistic, eternal and it sounds like my idea of Hell on Earth. This is a world governed by Madelaine L’Engle’s IT.\nFrom Things to Come, you can trace a straight line through to Doctor Who to Asimov’s Foundation to 1960s liberal utopianism, and Walt Disney’s original plan for EPCOT.\nA long time ago, I started writing what Nick Cole described as\nSTAR WARS NOT STAR WARS\nwith a co-writer. He was going to write\nSTAR TREK NOT STAR TREK\nwith a co-writer at the same time. But mine didn’t work out, for a variety of reasons, and Nick and Jason ended up writing\nSTAR WARS NOT STAR WARS\nthemselves, which was eventually published as\nGALAXY’S EDGE\nand worked out rather well for them.\nIt’s rather amusing that people in SF/F keep trying to cancel my science fiction career, when I am more than adept at sabotaging it myself. Did I ever mention that I turned down Blizzard and Simon & Schuster when they approved my outline for the first\nSTARCRAFT\nnovel and asked me to write it? The lesson, as always is this: just shut up, write what they want you to write, and stop getting in your own way.\nBut the Dark Herald’s piece does give me an excellent idea… albeit one that will likely make JDA very, very sad.\nIn other writing news, I’ll be sending the\nOUT OF THE SHADOWS\nebook to the Signed First Edition backers, the original MW ebook backers, and putting it up on Amazon this week. It will also be available as part of the Based Books Sale for everyone else. The paperback will be sent out to the\nMIDNIGHT’S WAR\nVol. 7-12 backers along with\nTHE TRAGEDY OF THE TRIBUNE\nomnibus both of them are ready.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-11-23T16:58:56+00:00"
}