{
  "url": "https://voxday.net/2012/02/11/another-pattern-observed/",
  "scraped_at": "2025-12-14T04:47:00.679591",
  "title": "Another pattern observed",
  "date_display": "February 11, 2012",
  "date_iso": "2012-02-11T15:00:00+00:00",
  "date_from_url": "2012-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One doesn’t have to be a nasty, anti-intellectual piece of work to be a Calvinist, but one can certainly observe a pattern common to the champions of the self-appointed Elect.  In light of this, I have to praise the behavior of the Calvinists at Vox Popoli, as it has been absolutely exemplary in comparison with that of their historical antecedents.  Consider the track record of these leading lights:</p><p><b>John Calvin:</b> Responsible for the murder under color of law of Michael Servetus. <i>Calvin was particularly outraged when Servetus sent him a copy of the Institutes of the Christian Religion heavily annotated with arguments pointing to errors in the book. When Servetus mentioned that he would come to Geneva if Calvin agreed, Calvin wrote a letter to Farel on 13 February 1547 noting that if Servetus were to come, he would not assure him safe conduct: “for if he came, as far as my authority goes, I would not let him leave alive.”</i></p><p><b>Franciscus Gomarus:</b> <i>A Fleming who had been in Leyden since 1594, has been described as “a rather mediocre scholar” but “a forceful defender of the Calvinistic doctrine…a man of deep-rooted faith….  He engaged twice in personal disputation with Arminius in the assembly of the States of Holland in 1608, and was one of five Gomarists who met five Arminians or Remonstrants in the same assembly of 1609. On the death of Arminius shortly after this time, Konrad Vorstius, who sympathized with his views, was appointed to succeed him, in spite of the opposition of Gomarus and his friends. Gomarus took his defeat badly, resigned his post, and went to Middelburg in 1611, where he became preacher at the Reformed church….</i></p><p><b>John Piper: </b> Intemperate attacker of other Christian leaders and <a href=\"http://www.desiringgod.org/resource-library/ask-pastor-john/at-the-passion07-breakout-session-you-used-language-that-seemed-inappropriate-to-some-will-you-explain-why-you-did-that\">serial backtracker</a>. <i>“I am sitting here trying to figure out why I say things like that every now and then. I think it is a mixture of (sinful) audience titillation and (holy) scorn against my own flesh and against the devil, along with the desire to make the battle with Satan and my flesh feel gutsy and real and not middle-class pious.”</i></p><p>Yes, that’s probably it. <i>You’re just too damn holy for your own good.</i> Perhaps, I suggest merely as a possibility, he behaves thusly because he is not Elect, but rather a vessel ordained for destruction.  As amusing as I find The Most Holy and Appointed Rev. Piper, what struck me most about the larger pattern was this statement by Gomarus: <i>In response to the Court’s opinion Gomarus declared that “he would not dare die holding Arminius’ opinion, nor to appear with it before God’s judgement seat.”</i></p><p>La, such drama!  It’s not as if anyone was asking Gomarus to die holding Arminius’s opinion, and as events would subsequently prove, Arminius didn’t have any problem doing just that.  But it is fascinating that Gomarus presented exactly the same sort of histrionic appeal to the emotions that one often sees in Piper’s writings and which a few of the lesser members of Team Calvin have also exhibited here.</p><p>But for me, the anti-intellectual aspects of Calvinism are best exemplified by John Calvin himself.  A man who has genuine confidence in his intellect and his faith doesn’t respond with outrage when his errors are pointed out, much less do his best to ensure that his critics are killed.  Now, one cannot dismiss a case for the poor character of its champions, but it does cause one to entertain the notion that Total Depravity may be less theology than psychological projection.</p><p>There is now scientific evidence supporting my original hypothesis that social disorders produce much atheism.  So, I find myself wondering if there may be a similar causal link between this observed behavioral pattern and a belief in Total Depravity combined with the idea that one belongs to a predestined elect.  None of this means that the Calvinists could not be correct, just as no amount of social autism could prove that gods exist.  But it’s interesting to note how the patterns have persisted in both cases for literal centuries.</p></div>",
  "content_text": "One doesn’t have to be a nasty, anti-intellectual piece of work to be a Calvinist, but one can certainly observe a pattern common to the champions of the self-appointed Elect.  In light of this, I have to praise the behavior of the Calvinists at Vox Popoli, as it has been absolutely exemplary in comparison with that of their historical antecedents.  Consider the track record of these leading lights:\nJohn Calvin:\nResponsible for the murder under color of law of Michael Servetus.\nCalvin was particularly outraged when Servetus sent him a copy of the Institutes of the Christian Religion heavily annotated with arguments pointing to errors in the book. When Servetus mentioned that he would come to Geneva if Calvin agreed, Calvin wrote a letter to Farel on 13 February 1547 noting that if Servetus were to come, he would not assure him safe conduct: “for if he came, as far as my authority goes, I would not let him leave alive.”\nFranciscus Gomarus:\nA Fleming who had been in Leyden since 1594, has been described as “a rather mediocre scholar” but “a forceful defender of the Calvinistic doctrine…a man of deep-rooted faith….  He engaged twice in personal disputation with Arminius in the assembly of the States of Holland in 1608, and was one of five Gomarists who met five Arminians or Remonstrants in the same assembly of 1609. On the death of Arminius shortly after this time, Konrad Vorstius, who sympathized with his views, was appointed to succeed him, in spite of the opposition of Gomarus and his friends. Gomarus took his defeat badly, resigned his post, and went to Middelburg in 1611, where he became preacher at the Reformed church….\nJohn Piper:\nIntemperate attacker of other Christian leaders and\nserial backtracker\n.\n“I am sitting here trying to figure out why I say things like that every now and then. I think it is a mixture of (sinful) audience titillation and (holy) scorn against my own flesh and against the devil, along with the desire to make the battle with Satan and my flesh feel gutsy and real and not middle-class pious.”\nYes, that’s probably it.\nYou’re just too damn holy for your own good.\nPerhaps, I suggest merely as a possibility, he behaves thusly because he is not Elect, but rather a vessel ordained for destruction.  As amusing as I find The Most Holy and Appointed Rev. Piper, what struck me most about the larger pattern was this statement by Gomarus:\nIn response to the Court’s opinion Gomarus declared that “he would not dare die holding Arminius’ opinion, nor to appear with it before God’s judgement seat.”\nLa, such drama!  It’s not as if anyone was asking Gomarus to die holding Arminius’s opinion, and as events would subsequently prove, Arminius didn’t have any problem doing just that.  But it is fascinating that Gomarus presented exactly the same sort of histrionic appeal to the emotions that one often sees in Piper’s writings and which a few of the lesser members of Team Calvin have also exhibited here.\nBut for me, the anti-intellectual aspects of Calvinism are best exemplified by John Calvin himself.  A man who has genuine confidence in his intellect and his faith doesn’t respond with outrage when his errors are pointed out, much less do his best to ensure that his critics are killed.  Now, one cannot dismiss a case for the poor character of its champions, but it does cause one to entertain the notion that Total Depravity may be less theology than psychological projection.\nThere is now scientific evidence supporting my original hypothesis that social disorders produce much atheism.  So, I find myself wondering if there may be a similar causal link between this observed behavioral pattern and a belief in Total Depravity combined with the idea that one belongs to a predestined elect.  None of this means that the Calvinists could not be correct, just as no amount of social autism could prove that gods exist.  But it’s interesting to note how the patterns have persisted in both cases for literal centuries.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-11T15:00:00+00:00"
}