{
  "url": "https://voxday.net/2012/02/04/bf3-joys-of-recon/",
  "scraped_at": "2025-12-14T04:46:29.765804",
  "title": "BF3: the joys of recon",
  "date_display": "February 4, 2012",
  "date_iso": "2012-02-04T18:00:00+00:00",
  "date_from_url": "2012-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After acquiring a PS/3 mike, I am quite pleased with the results, although I’m not entirely sure I’m actually communicating with anyone.  In Operation Firestorm, I hopped a lift in a tank, then ditched at the Gas Station and headed high into the hills.  I set up the SOFLAM on a rock overlooking the battlefield, then ran up still higher to operate it remotely.</p><p>No one did anything right away, but it was clear that simply laser-targeting the enemy tanks and planes was making them skittish.  I kept reporting various vehicles and encouraging someone in my squad to Engineer up and loadout a Javelin; finally someone did and promptly took out two helicopters and a tank that was advancing on the Gas Station.  That was close enough to my position that I put away the remote, broke out the rifle, and took out the tank gunner who had exited the vehicle before it brewed up.</p><p>I took out four more enemies who were in a building near the Offices before someone managed to figure out where I was, climbed the hills, and took me out while I was busy spotting.  That wouldn’t have happened if I had a squadmate guarding my back, but <i>c’est la guerre video</i>.  Regardless, by this time few enemy planes or helicopters dared fly anymore and even the tanks were cautious about advancing very far past the Docks.  A few jeeps were tearing around with impunity, but when one stopped to capture the Gas Station, I took out the gunner with a 262 meter headshot, thus allowing two guys who’d been pinned down by him to kill the driver as well.</p><p>This must have been the final straw, as I saw in the camera that two jeeps and a man on foot were heading for my position with obvious ill intent.  I decided discretion was the better part of valor and headed further into the hills without trying to engage them.  They finally located and blew up my SOFLAM camera, so I headed into the combat area and attacked a flag or two in more conventional style.  I didn’t score as many personal points playing this way as I usually do when I’m attacking flags, but since it was a close and hard-fought battle that we won by 20 tickets, I’m pretty sure that my recon action made the difference between victory and defeat.  And, as a side bonus, my k/d ratio increased to 3.0.</p></div>",
  "content_text": "After acquiring a PS/3 mike, I am quite pleased with the results, although I’m not entirely sure I’m actually communicating with anyone.  In Operation Firestorm, I hopped a lift in a tank, then ditched at the Gas Station and headed high into the hills.  I set up the SOFLAM on a rock overlooking the battlefield, then ran up still higher to operate it remotely.\nNo one did anything right away, but it was clear that simply laser-targeting the enemy tanks and planes was making them skittish.  I kept reporting various vehicles and encouraging someone in my squad to Engineer up and loadout a Javelin; finally someone did and promptly took out two helicopters and a tank that was advancing on the Gas Station.  That was close enough to my position that I put away the remote, broke out the rifle, and took out the tank gunner who had exited the vehicle before it brewed up.\nI took out four more enemies who were in a building near the Offices before someone managed to figure out where I was, climbed the hills, and took me out while I was busy spotting.  That wouldn’t have happened if I had a squadmate guarding my back, but\nc’est la guerre video\n.  Regardless, by this time few enemy planes or helicopters dared fly anymore and even the tanks were cautious about advancing very far past the Docks.  A few jeeps were tearing around with impunity, but when one stopped to capture the Gas Station, I took out the gunner with a 262 meter headshot, thus allowing two guys who’d been pinned down by him to kill the driver as well.\nThis must have been the final straw, as I saw in the camera that two jeeps and a man on foot were heading for my position with obvious ill intent.  I decided discretion was the better part of valor and headed further into the hills without trying to engage them.  They finally located and blew up my SOFLAM camera, so I headed into the combat area and attacked a flag or two in more conventional style.  I didn’t score as many personal points playing this way as I usually do when I’m attacking flags, but since it was a close and hard-fought battle that we won by 20 tickets, I’m pretty sure that my recon action made the difference between victory and defeat.  And, as a side bonus, my k/d ratio increased to 3.0.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-04T18:00:00+00:00"
}