{
  "url": "https://voxday.net/2012/02/05/brainspider/",
  "scraped_at": "2025-12-14T04:46:31.620378",
  "title": "Brainspider",
  "date_display": "February 5, 2012",
  "date_iso": "2012-02-05T10:22:00+00:00",
  "date_from_url": "2012-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the Dread Ilk, David the Good, has released his third album.  Based on the video, he’s got a bit of a mid-90’s trance thing going on; “brainspider” would appear to be an appropriate theme.  “Phat Beat Saturday” made me think of Spooky on quaaludes.</p><p><i>In 2002 when I released <i><a href=\"http://www.cdbaby.com/cd/dgoodman2\">Space Age</a></i>, it was a grand experiment. Could I go into the studio for a year… and come out with something that was different… creative… and might even sell a few copies?</i></p><p>Apparently, yes. It sold well enough to break even and got some nice reviews. But back then, I had time to promote, write e-mails, drop off copies at events and venues and all that slavish sales stuff. Unfortunately, I’m much more interested in making the music than I am in selling it – though <i>Space Age</i> continues to sell online. The track “Elvira” is some kind of a hit… despite being ten years old, it gets played regularly on internet radio stations.</p><p>Really… why do I do this? It’s not for sales, though I like those. It’s for the joy of creating something and laughing my head off while doing so. It’s for people to pop into their stereos at a party so their friends think they’re insane. And it’s to continue annoying people that don’t like puns and songs about animals, science, grocery stores and pathetic attempts to woo non-existent women.</p><p>My second full album, <i><a href=\"http://www.cdbaby.com/cd/dgoodman3\">The Infinite</a></i>, got crashed half-way through by a drop-off in finances and time. I finished it and went broke. And had a baby at the same time. And had to move. The momentum was shattered just as it hit the Internet. No e-mails to listeners… no promotion… no physical copies sitting in coffee shops and dusty record stores. And, on top of that, the record is a downer. It’s about nuclear bombs, the loss of a father, a limbless angel, the emptiness of existence, and the battle between good and evil.</p><p>Hey… I like it, but not a lot of other folk seem to.</p><p>The new record drops all that. Sure, it mentions anarchy, guns, man-eating women and being trapped on an island… but in a positive, upbeat way that makes one feel good about their prospects and filled with a new faith in arachnohumanity. And, in keeping with Our Modern Era, it’s digital only. No more CDs to print and lose money on.</p><p>I hereby present <i>The Brainspider Affair</i>, 20 phat tracks of digital good stuff that’s guaranteed to change your life. Especially if you slip it into the DJ booth at a wedding.  One particularly phat track even has its own video on <a href=\"http://www.youtube.com/watch?v=IM1z0ojP9II\">Youtube</a>:</p><p>You can pick up the new album at the following locations: <a href=\"http://www.cdbaby.com/cd/davidthegood\">CD Baby</a>, <a href=\"http://www.amazon.com/The-Brainspider-Affair/dp/B006XF9Z52/ref=sr_1_1?ie=UTF8&amp;qid=1328283998&amp;sr=8-1 http://www.amazon.com/The-Brainspider-Affair/dp/B006XF9Z52/ref=sr_1_1?ie=UTF8&amp;qid=1328283998&amp;sr=8-1\">Amazon</a>, and <a href=\"http://itunes.apple.com/us/album/the-brainspider-affair/id495024914?ign-mpt=uo%3D4\">iTunes</a>.</p><p>Thank you, my friends… enjoy.</p></div>",
  "content_text": "One of the Dread Ilk, David the Good, has released his third album.  Based on the video, he’s got a bit of a mid-90’s trance thing going on; “brainspider” would appear to be an appropriate theme.  “Phat Beat Saturday” made me think of Spooky on quaaludes.\nIn 2002 when I released\nSpace Age\n, it was a grand experiment. Could I go into the studio for a year… and come out with something that was different… creative… and might even sell a few copies?\nApparently, yes. It sold well enough to break even and got some nice reviews. But back then, I had time to promote, write e-mails, drop off copies at events and venues and all that slavish sales stuff. Unfortunately, I’m much more interested in making the music than I am in selling it – though\nSpace Age\ncontinues to sell online. The track “Elvira” is some kind of a hit… despite being ten years old, it gets played regularly on internet radio stations.\nReally… why do I do this? It’s not for sales, though I like those. It’s for the joy of creating something and laughing my head off while doing so. It’s for people to pop into their stereos at a party so their friends think they’re insane. And it’s to continue annoying people that don’t like puns and songs about animals, science, grocery stores and pathetic attempts to woo non-existent women.\nMy second full album,\nThe Infinite\n, got crashed half-way through by a drop-off in finances and time. I finished it and went broke. And had a baby at the same time. And had to move. The momentum was shattered just as it hit the Internet. No e-mails to listeners… no promotion… no physical copies sitting in coffee shops and dusty record stores. And, on top of that, the record is a downer. It’s about nuclear bombs, the loss of a father, a limbless angel, the emptiness of existence, and the battle between good and evil.\nHey… I like it, but not a lot of other folk seem to.\nThe new record drops all that. Sure, it mentions anarchy, guns, man-eating women and being trapped on an island… but in a positive, upbeat way that makes one feel good about their prospects and filled with a new faith in arachnohumanity. And, in keeping with Our Modern Era, it’s digital only. No more CDs to print and lose money on.\nI hereby present\nThe Brainspider Affair\n, 20 phat tracks of digital good stuff that’s guaranteed to change your life. Especially if you slip it into the DJ booth at a wedding.  One particularly phat track even has its own video on\nYoutube\n:\nYou can pick up the new album at the following locations:\nCD Baby\n,\nAmazon\n, and\niTunes\n.\nThank you, my friends… enjoy.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-05T10:22:00+00:00"
}