{
  "url": "https://voxday.net/2012/02/22/dance-of-desperation/",
  "scraped_at": "2025-12-14T04:47:52.271195",
  "title": "A dance of desperation",
  "date_display": "February 22, 2012",
  "date_iso": "2012-02-22T18:05:00+00:00",
  "date_from_url": "2012-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In addition to proving the old adage about scientists finally struggling up to reach the final peak of knowledge, only to find the philosophers already ensconced there, this latest <a href=\"http://www.nytimes.com/2012/02/21/science/space/cosmologists-try-to-explain-a-universe-springing-from-nothing.html?_r=2\">attempt to dance around The Great Why</a> shows the increasing desperation of the scientific godless:</p><blockquote><p>It is, perhaps, the mystery of last resort. Scientists may be at least theoretically able to trace every last galaxy back to a bump in the Big Bang, to complete the entire quantum roll call of particles and forces. But the question of why there was a Big Bang or any quantum particles at all was presumed to lie safely out of scientific bounds, in the realms of philosophy or religion.</p><p>Now even that assumption is no longer safe, as exemplified by a new book by the cosmologist Lawrence M. Krauss. In it he joins a chorus of physicists and cosmologists who have been pushing into sacred ground, proclaiming more and more loudly in the last few years that science can explain how something — namely our star-spangled cosmos — could be born from, if not nothing, something very close to it. God, they argue, is not part of the equation….</p><p>Dr. Krauss delineates three different kinds of nothingness. First is what may have passed muster as nothing with the ancient Greeks: empty space. But we now know that even empty space is filled with energy, vibrating with electromagnetic fields and so-called virtual particles dancing in and out of existence on borrowed energy courtesy of the randomness that characterizes reality on the smallest scales, according to the rules of quantum theory.</p><p>Second is nothing, without even space and time. Following a similar quantum logic, theorists have proposed that whole universes, little bubbles of space-time, could pop into existence, like bubbles in boiling water, out of this nothing.</p><p>There is a deeper nothing in which even the laws of physics are absent. Where do the laws come from? Are they born with the universe, or is the universe born in accordance with them? Here Dr. Krauss, unhappily in my view, resorts to the newest and most controversial toy in the cosmologist’s toolbox: the multiverse, a nearly infinite assemblage of universes, each with its own randomly determined rules, particles and forces, that represent solutions to the basic equations of string theory — the alleged theory of everything, or perhaps, as wags say, anything.</p></blockquote><p>There is, of course, a fourth type of nothingness.  And that is the amount of scientific validity contained in Krauss’s desperate attempt to use a fraudulent veneer of science to avoid the obvious conclusions driven by the relevant philosophic logic.  This isn’t even science fiction, it’s just purely evasive fantasy.  If I were to seriously propose that full-grown unicorns, little rainbow-colored horned equines, could simply pop into existence, like bubbles in boiling water, <i>ex nihilo</i>, people would rightly dismiss me as a fantasist and a possibly insane one at that.</p><p>But substitute “universes” for “unicorns”, and suddenly, we’re talking science!</p></div>",
  "content_text": "In addition to proving the old adage about scientists finally struggling up to reach the final peak of knowledge, only to find the philosophers already ensconced there, this latest\nattempt to dance around The Great Why\nshows the increasing desperation of the scientific godless:\nIt is, perhaps, the mystery of last resort. Scientists may be at least theoretically able to trace every last galaxy back to a bump in the Big Bang, to complete the entire quantum roll call of particles and forces. But the question of why there was a Big Bang or any quantum particles at all was presumed to lie safely out of scientific bounds, in the realms of philosophy or religion.\nNow even that assumption is no longer safe, as exemplified by a new book by the cosmologist Lawrence M. Krauss. In it he joins a chorus of physicists and cosmologists who have been pushing into sacred ground, proclaiming more and more loudly in the last few years that science can explain how something — namely our star-spangled cosmos — could be born from, if not nothing, something very close to it. God, they argue, is not part of the equation….\nDr. Krauss delineates three different kinds of nothingness. First is what may have passed muster as nothing with the ancient Greeks: empty space. But we now know that even empty space is filled with energy, vibrating with electromagnetic fields and so-called virtual particles dancing in and out of existence on borrowed energy courtesy of the randomness that characterizes reality on the smallest scales, according to the rules of quantum theory.\nSecond is nothing, without even space and time. Following a similar quantum logic, theorists have proposed that whole universes, little bubbles of space-time, could pop into existence, like bubbles in boiling water, out of this nothing.\nThere is a deeper nothing in which even the laws of physics are absent. Where do the laws come from? Are they born with the universe, or is the universe born in accordance with them? Here Dr. Krauss, unhappily in my view, resorts to the newest and most controversial toy in the cosmologist’s toolbox: the multiverse, a nearly infinite assemblage of universes, each with its own randomly determined rules, particles and forces, that represent solutions to the basic equations of string theory — the alleged theory of everything, or perhaps, as wags say, anything.\nThere is, of course, a fourth type of nothingness.  And that is the amount of scientific validity contained in Krauss’s desperate attempt to use a fraudulent veneer of science to avoid the obvious conclusions driven by the relevant philosophic logic.  This isn’t even science fiction, it’s just purely evasive fantasy.  If I were to seriously propose that full-grown unicorns, little rainbow-colored horned equines, could simply pop into existence, like bubbles in boiling water,\nex nihilo\n, people would rightly dismiss me as a fantasist and a possibly insane one at that.\nBut substitute “universes” for “unicorns”, and suddenly, we’re talking science!",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-22T18:05:00+00:00"
}