{
  "url": "https://voxday.net/2012/02/23/dissecting-divine-hiddenness/",
  "scraped_at": "2025-12-14T04:47:56.485408",
  "title": "Dissecting Divine Hiddenness",
  "date_display": "February 23, 2012",
  "date_iso": "2012-02-23T12:08:00+00:00",
  "date_from_url": "2012-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is one of the more feeble arguments against the existence of God I have encountered, but since I haven’t actually critiqued it before, I thought I would take the opportunity to do so now.  From <a href=\"http://en.wikipedia.org/wiki/Divine_hiddenness\">Wikipedia</a>:</p><blockquote><p>The argument from nonbelief (or the argument from divine hiddenness) is a philosophical argument against the existence of God, specifically, the God of theism. The premise of the argument is that if God existed (and wanted humanity to know it), he would have brought about a situation in which every reasonable person believed in him; however, there are reasonable unbelievers, and therefore, this weighs against God’s existence. This argument is similar to the classic argument from evil in that it affirms inconsistency between the world that exists and the world that should exist if God had certain desires combined with the power to see them through. In fact, since ignorance of God would seem to be a natural evil, many would categorize the problem of divine hiddenness as an instance of the problem of evil.</p><p>1.  If there is a God, he is perfectly loving.<br> 2.  If a perfectly loving God exists, reasonable nonbelief does not occur.<br> 3.  Reasonable nonbelief occurs.<br> 4.  No perfectly loving God exists (from 2 and 3).<br> 5.  Hence, there is no God (from 1 and 4).</br></br></br></br></p></blockquote><p>This argument is a dreadful one because it manages to be unrelated to the Biblical God as well as logically fallacious.  Even if it wasn’t outright admitted in the very description, it is trivially easy to demonstrate that the argument cannot possibly apply to the Christian God by simple reference to the Bible.  Contrast these two statements:</p><p>a) If there is a God, he is perfectly loving.<br> b) ““Because of all their wickedness in Gilgal, I hated them there. Because of their sinful deeds, I will drive them out of my house. I will no longer love them; all their leaders are rebellious.” Hosea 9:15</br></p><p>Since perfect love both proscribes hatred and is not equal to conditional love, the argument clearly fails to apply to the Biblical God at the very first step.  As can be readily verified, the verse from Hosea is only one of the many verses in the Bible that describe, in some detail, those whom God hates, in some cases, with a self-described passion.  Therefore, it is patently obvious that the argument from Divine Hiddenness has absolutely no relevance to the Christian God.</p><p>As is so often the case, the atheist argument is dependent upon an intellectually dishonest bait-and-switch.  The argument doesn’t, and can’t, apply to the Christian God, and yet is presented as an argument against the Christian God, thus relying upon the failure of the interlocutor to notice the substitution of a hypothetical and nonexistent “perfectly loving god” for the actual God worshipped and described in the Bible.</p><p>Moreoever, the argument against the imaginary “perfectly loving God” even fails in its own right for the following reasons:</p><p>1.  It is false to say that God must be perfectly loving since the available evidence, both observable and documentary, indicates that God is not.<br> 2.  “No reasonable nonbelief” does not follow from “perfectly loving”.<br> 3.  There is no evidence that reasonable nonbelief occurs.  There is, to the contrary, considerable evidence that most nonbelief is both unreasoning and unreasonable.</br></br></p><p>To understand how astonishingly illogical the argument is, consider the following variant utilizing the same “logic”.</p><p>1.  If there are frogs, they are purple.<br> 2.  If a purple frog exists, no ribbetting will be heard.<br> 3.  Ribbetting is heard.<br> 4.  No purple frog exists (from 2 and 3).<br> 5.  Hence, there are no frogs (from 1 and 4).</br></br></br></br></p><p>Thus by the Argument from Ranine Hiddenness we are able to conclude that no frog exists, even though our conclusion flies in the face of the observable fact that something out there – though clearly not a frog! – can be heard going <i>ribbet, ribbet</i>.  And frankly, I think I’d be more impressed with the intellectual prowess exhibited by the average frog’s ribbets than by the cretins who produced this illogical drivel.</p><p>So, I will now pose the obvious question to Smiley, who was good enough to bring this argument to our attention earlier this week.  Do you still find the Argument from Divine Hiddenness to be “infinitely more convincing than any argument ever proposed by any Christian?”</p><p> UPDATE: <i>In the interest of spelling things out more slowly for those who are too ignorant to realize that the Christian God is the God of the Old Testament as well as the New, and are too lazy to bother looking up the various other references I mentioned, I will point out the obvious.  “But you have this in your favor: You hate the practices of the Nicolaitans, which I also hate.” – Revelations 2:6.</i></p></div>",
  "content_text": "This is one of the more feeble arguments against the existence of God I have encountered, but since I haven’t actually critiqued it before, I thought I would take the opportunity to do so now.  From\nWikipedia\n:\nThe argument from nonbelief (or the argument from divine hiddenness) is a philosophical argument against the existence of God, specifically, the God of theism. The premise of the argument is that if God existed (and wanted humanity to know it), he would have brought about a situation in which every reasonable person believed in him; however, there are reasonable unbelievers, and therefore, this weighs against God’s existence. This argument is similar to the classic argument from evil in that it affirms inconsistency between the world that exists and the world that should exist if God had certain desires combined with the power to see them through. In fact, since ignorance of God would seem to be a natural evil, many would categorize the problem of divine hiddenness as an instance of the problem of evil.\n1.  If there is a God, he is perfectly loving.\n2.  If a perfectly loving God exists, reasonable nonbelief does not occur.\n3.  Reasonable nonbelief occurs.\n4.  No perfectly loving God exists (from 2 and 3).\n5.  Hence, there is no God (from 1 and 4).\nThis argument is a dreadful one because it manages to be unrelated to the Biblical God as well as logically fallacious.  Even if it wasn’t outright admitted in the very description, it is trivially easy to demonstrate that the argument cannot possibly apply to the Christian God by simple reference to the Bible.  Contrast these two statements:\na) If there is a God, he is perfectly loving.\nb) ““Because of all their wickedness in Gilgal, I hated them there. Because of their sinful deeds, I will drive them out of my house. I will no longer love them; all their leaders are rebellious.” Hosea 9:15\nSince perfect love both proscribes hatred and is not equal to conditional love, the argument clearly fails to apply to the Biblical God at the very first step.  As can be readily verified, the verse from Hosea is only one of the many verses in the Bible that describe, in some detail, those whom God hates, in some cases, with a self-described passion.  Therefore, it is patently obvious that the argument from Divine Hiddenness has absolutely no relevance to the Christian God.\nAs is so often the case, the atheist argument is dependent upon an intellectually dishonest bait-and-switch.  The argument doesn’t, and can’t, apply to the Christian God, and yet is presented as an argument against the Christian God, thus relying upon the failure of the interlocutor to notice the substitution of a hypothetical and nonexistent “perfectly loving god” for the actual God worshipped and described in the Bible.\nMoreoever, the argument against the imaginary “perfectly loving God” even fails in its own right for the following reasons:\n1.  It is false to say that God must be perfectly loving since the available evidence, both observable and documentary, indicates that God is not.\n2.  “No reasonable nonbelief” does not follow from “perfectly loving”.\n3.  There is no evidence that reasonable nonbelief occurs.  There is, to the contrary, considerable evidence that most nonbelief is both unreasoning and unreasonable.\nTo understand how astonishingly illogical the argument is, consider the following variant utilizing the same “logic”.\n1.  If there are frogs, they are purple.\n2.  If a purple frog exists, no ribbetting will be heard.\n3.  Ribbetting is heard.\n4.  No purple frog exists (from 2 and 3).\n5.  Hence, there are no frogs (from 1 and 4).\nThus by the Argument from Ranine Hiddenness we are able to conclude that no frog exists, even though our conclusion flies in the face of the observable fact that something out there – though clearly not a frog! – can be heard going\nribbet, ribbet\n.  And frankly, I think I’d be more impressed with the intellectual prowess exhibited by the average frog’s ribbets than by the cretins who produced this illogical drivel.\nSo, I will now pose the obvious question to Smiley, who was good enough to bring this argument to our attention earlier this week.  Do you still find the Argument from Divine Hiddenness to be “infinitely more convincing than any argument ever proposed by any Christian?”\nUPDATE:\nIn the interest of spelling things out more slowly for those who are too ignorant to realize that the Christian God is the God of the Old Testament as well as the New, and are too lazy to bother looking up the various other references I mentioned, I will point out the obvious.  “But you have this in your favor: You hate the practices of the Nicolaitans, which I also hate.” – Revelations 2:6.",
  "tags": [
    "atheism",
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-23T12:08:00+00:00"
}