{
  "url": "https://voxday.net/2012/02/25/diverse-applications/",
  "scraped_at": "2025-12-14T04:48:09.513442",
  "title": "Diverse applications",
  "date_display": "February 25, 2012",
  "date_iso": "2012-02-25T15:00:00+00:00",
  "date_from_url": "2012-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the remarkable shared idiocies of the left and right alike is their staunch refusal to understand that immigrants from foreign cultures will not only retain many of their traditions from their former societies, but will view Western traditions through their own cultural lens and will therefore tend to expand Western customs in various ways <a href=\"http://www.telegraph.co.uk/health/healthnews/9104994/Sex-selection-abortions-are-widespread.html\">not always anticipated</a>:</p><blockquote><p>Dr Vincent Argent, who previously worked for the British Pregnancy Advisory Service and is now a GP and consultant obstetrician and gynaecologist, said he had “no doubt” that women were terminating pregnancies because of the sex of the baby and that he believed the practice was “fairly widespread”. This week The Daily Telegraph disclosed that women were being offered illegal abortions by doctors on the basis of the gender of the foetus.</p><p>Dr Argent said there were “an awful lot of covert abortions for sex selection going on” where women would have a scan or blood test to find out the sex, then ask for a termination without telling the doctor the real reason….  Dr Argent also disclosed that he believed that some colleagues had arranged terminations relating to the sex of the foetus and they felt it was reasonable to do so.</p><p>“I’ve had a consultant colleague in the North who expressed a view — that consultant was from an ethnic minority … He didn’t think it was ethically wrong because he thought that the cultural reason why some communities may prefer to have four male babies is as good a reason as the, if you like, the Anglo-Saxon cultural view, ‘Well I’m pregnant, I just don’t want it anyway.’”</p></blockquote><p>Of course, they are absolutely right.  If abortion is morally and legally acceptable, it is acceptable for any reason.  In fact, there is no moral or legal reason why people shouldn’t offer financial incentive to encourage undesirable populations to obtain abortions.  The federal government could even require abortions of all minority populations for those choosing to apply for welfare payments and there would be no logical or moral reason to oppose any such policy.</p><p>The disappearance of children with Down’s Syndrome is largely the result of abortion and pre-natal testing.  So, we can anticipate that the more immigration that takes place into the West, the more the male-female ratios will come to resemble those in India and China.</p></div>",
  "content_text": "One of the remarkable shared idiocies of the left and right alike is their staunch refusal to understand that immigrants from foreign cultures will not only retain many of their traditions from their former societies, but will view Western traditions through their own cultural lens and will therefore tend to expand Western customs in various ways\nnot always anticipated\n:\nDr Vincent Argent, who previously worked for the British Pregnancy Advisory Service and is now a GP and consultant obstetrician and gynaecologist, said he had “no doubt” that women were terminating pregnancies because of the sex of the baby and that he believed the practice was “fairly widespread”. This week The Daily Telegraph disclosed that women were being offered illegal abortions by doctors on the basis of the gender of the foetus.\nDr Argent said there were “an awful lot of covert abortions for sex selection going on” where women would have a scan or blood test to find out the sex, then ask for a termination without telling the doctor the real reason….  Dr Argent also disclosed that he believed that some colleagues had arranged terminations relating to the sex of the foetus and they felt it was reasonable to do so.\n“I’ve had a consultant colleague in the North who expressed a view — that consultant was from an ethnic minority … He didn’t think it was ethically wrong because he thought that the cultural reason why some communities may prefer to have four male babies is as good a reason as the, if you like, the Anglo-Saxon cultural view, ‘Well I’m pregnant, I just don’t want it anyway.’”\nOf course, they are absolutely right.  If abortion is morally and legally acceptable, it is acceptable for any reason.  In fact, there is no moral or legal reason why people shouldn’t offer financial incentive to encourage undesirable populations to obtain abortions.  The federal government could even require abortions of all minority populations for those choosing to apply for welfare payments and there would be no logical or moral reason to oppose any such policy.\nThe disappearance of children with Down’s Syndrome is largely the result of abortion and pre-natal testing.  So, we can anticipate that the more immigration that takes place into the West, the more the male-female ratios will come to resemble those in India and China.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-25T15:00:00+00:00"
}