{
  "url": "https://voxday.net/2012/02/12/eco-on-ever-ending-world/",
  "scraped_at": "2025-12-14T04:47:05.325218",
  "title": "Umberto Eco on the ever-ending world",
  "date_display": "February 12, 2012",
  "date_iso": "2012-02-12T11:49:00+00:00",
  "date_from_url": "2012-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <b><a href=\"http://espresso.repubblica.it/dettaglio/dove-andremo-a-finire/2173310/18\">Where will we go in the end?</a></b></p><p>First little thought.  We will not speak of the curse of the Mayans, but of certain newspapers, that are always citing Cassandra and day after day announce an ever-darker tomorrow, where the oceans overflow, the seasons end, and, of more immediate concern, the Default.  For example, after listening to his parents inform him about the destiny of the world, a ten year-old son of my friends began to cry and asked: “But is there really nothing good in my future?”</p><p>To console him, I could cite many extremely dolorous predictions concerning the years to come, as were customarily made throughout the past centuries.  Here is an excerpt from Vincenzo di Beauvais in the 13th century: “After the death of the Antichrist… the final judgment will be preceded by many signs that were indicated by the Evangelist…. In the first day the sea will rise forty cubits over the mountains and its surface will rise like a wall.  On the second day, it will submerge many who will go unseen.  On the third day, the marine monsters appearing on the surface of the sea will roar at the heavens.  On the fourth day, the sea and all the waters will catch fire.  On the fifth day the grass and the trees will emit a dew of blood.  On the sxith day, buildings will collapse.  On the seventh day, the stones will crash against each other.  On the eighth day, the entire earth will shake.  On the ninth day, the earth will be levelled.  On the tenth day, the men will come out of their caves and will wander like madmen unable to speak.  On the eleventh day, the bones of the dead will rise.  On the twelfth day, the stars will fall.  On the thirteenth day, the survivors still living will die to rise again with the dead.  On the fourteenth day, the heavens and the earth will burn.  On the fifteenth day, there will be a new heaven and a new earth and all will rise again.”  As you can see, we already have no lack of climactic alterations and tsunamis to threaten us.</p><p>Leaping over six centuries of more fatal prophesies, here is Balzac in 1836: “The modern industry, that produces for the masses, is destroying the creations of the antique arts, those works that possessed an individual hallmark for the consumer and the artisan alike.  Today we have “products”, we no longer have “works””.  Among these “products” that Balzac warned would be deprived of every artistic value, Leopardi was writing <i>The Flower of the Desert</i> in that same year, Manzoni had in hand the second draft of <i>The Betrothed</i>, three years later Chopin composed <i>Sonata No. 2 in B-flat minor</i>, twenty years later Flaubert published <i>Madame Bovary</i>, and there was still about thirty years before the appearance of the Impressionists and more than forty prior to the publication of <i>The Brothers Karamazov</i>.  As you see, in the past they were also overly afraid of the future.</p><p>A second thought.  Perhaps, if we reconsider, “evil times today” really are here, for as tradition has it, one of the typical signs the end of times is at hand is the fact that the world has gone to ruin.  Consider that at one time the rich lived in the center of Rome in luxurious palaces and the poor on the desolate peripheries; today it seems the palaces that face the Colosseum are like prostitutes, with toilets on the balcony that you can enter for four bucks.  I imagine the corrupt politicians go to live outside the imperial walls.</p><p>Yesterday the poor travelled in trains and only the rich were permitted airplanes; today the airlines cost forty cash, (those with the best price resemble cattle carriers in a time of war), while the trains become ever more expensive and luxurious, with bars reserved only for the hegemonic classes.  At one time, the rich went to Riccione, and in the worst case, to Rimini, while in the islands of the Indian Ocean there lived a miserable population as well as those deported there for life imprisonment.  Today, it is only politicians of rank who go to the Maldives, and in Rimini, on the other hand, you will find mostly lower-class Russians barely removed from the slavery of the soil.</p><p>Where will we go in the end?</p></blockquote><p>I’m more than a bit dubious about the bit concerning the modern palaces, but otherwise it was an unusually easy column to translate.  I’m also not sure about the reference to the slavery at the end, as the most literal translation would be “the slavery of the the fleshy spore-bearing inner mass of fungi.”</p></div>",
  "content_text": "Where will we go in the end?\nFirst little thought.  We will not speak of the curse of the Mayans, but of certain newspapers, that are always citing Cassandra and day after day announce an ever-darker tomorrow, where the oceans overflow, the seasons end, and, of more immediate concern, the Default.  For example, after listening to his parents inform him about the destiny of the world, a ten year-old son of my friends began to cry and asked: “But is there really nothing good in my future?”\nTo console him, I could cite many extremely dolorous predictions concerning the years to come, as were customarily made throughout the past centuries.  Here is an excerpt from Vincenzo di Beauvais in the 13th century: “After the death of the Antichrist… the final judgment will be preceded by many signs that were indicated by the Evangelist…. In the first day the sea will rise forty cubits over the mountains and its surface will rise like a wall.  On the second day, it will submerge many who will go unseen.  On the third day, the marine monsters appearing on the surface of the sea will roar at the heavens.  On the fourth day, the sea and all the waters will catch fire.  On the fifth day the grass and the trees will emit a dew of blood.  On the sxith day, buildings will collapse.  On the seventh day, the stones will crash against each other.  On the eighth day, the entire earth will shake.  On the ninth day, the earth will be levelled.  On the tenth day, the men will come out of their caves and will wander like madmen unable to speak.  On the eleventh day, the bones of the dead will rise.  On the twelfth day, the stars will fall.  On the thirteenth day, the survivors still living will die to rise again with the dead.  On the fourteenth day, the heavens and the earth will burn.  On the fifteenth day, there will be a new heaven and a new earth and all will rise again.”  As you can see, we already have no lack of climactic alterations and tsunamis to threaten us.\nLeaping over six centuries of more fatal prophesies, here is Balzac in 1836: “The modern industry, that produces for the masses, is destroying the creations of the antique arts, those works that possessed an individual hallmark for the consumer and the artisan alike.  Today we have “products”, we no longer have “works””.  Among these “products” that Balzac warned would be deprived of every artistic value, Leopardi was writing\nThe Flower of the Desert\nin that same year, Manzoni had in hand the second draft of\nThe Betrothed\n, three years later Chopin composed\nSonata No. 2 in B-flat minor\n, twenty years later Flaubert published\nMadame Bovary\n, and there was still about thirty years before the appearance of the Impressionists and more than forty prior to the publication of\nThe Brothers Karamazov\n.  As you see, in the past they were also overly afraid of the future.\nA second thought.  Perhaps, if we reconsider, “evil times today” really are here, for as tradition has it, one of the typical signs the end of times is at hand is the fact that the world has gone to ruin.  Consider that at one time the rich lived in the center of Rome in luxurious palaces and the poor on the desolate peripheries; today it seems the palaces that face the Colosseum are like prostitutes, with toilets on the balcony that you can enter for four bucks.  I imagine the corrupt politicians go to live outside the imperial walls.\nYesterday the poor travelled in trains and only the rich were permitted airplanes; today the airlines cost forty cash, (those with the best price resemble cattle carriers in a time of war), while the trains become ever more expensive and luxurious, with bars reserved only for the hegemonic classes.  At one time, the rich went to Riccione, and in the worst case, to Rimini, while in the islands of the Indian Ocean there lived a miserable population as well as those deported there for life imprisonment.  Today, it is only politicians of rank who go to the Maldives, and in Rimini, on the other hand, you will find mostly lower-class Russians barely removed from the slavery of the soil.\nWhere will we go in the end?\nI’m more than a bit dubious about the bit concerning the modern palaces, but otherwise it was an unusually easy column to translate.  I’m also not sure about the reference to the slavery at the end, as the most literal translation would be “the slavery of the the fleshy spore-bearing inner mass of fungi.”",
  "tags": [
    "Eco"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-12T11:49:00+00:00"
}