{
  "url": "https://voxday.net/2012/02/11/long-slog/",
  "scraped_at": "2025-12-14T04:47:03.513776",
  "title": "The long slog",
  "date_display": "February 11, 2012",
  "date_iso": "2012-02-11T20:56:00+00:00",
  "date_from_url": "2012-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some of you have wondered why I haven’t gotten around to X yet, for varying values of X.  The answer is that I’ve simply been very busy with a number of projects, including writing manuals, assembling legal documents, writing game designs, and working on the first novel in the <i>Arts of Dark and Light</i> series.  In other words, in the last 200 days, I have cranked out more than 200,000 words that no one has seen in addition to all of the various blog posts and columns during that time.</p><p>I’m about 20 days behind on my original schedule for the novel, so I’ve got to increase my average daily production from 725 to 945 words the rest of the way.  That won’t have any impact on the blog, but it does mean that I’m not likely to do much else until I get the first draft done within the one year I allotted for it.  This isn’t an apology, I’m simply letting you know that if it’s not related to the novel or the game designs, it probably isn’t getting done in the near future.  And if I don’t devote much time to a comment or an email, well, you can probably figure out why.</p></div>",
  "content_text": "Some of you have wondered why I haven’t gotten around to X yet, for varying values of X.  The answer is that I’ve simply been very busy with a number of projects, including writing manuals, assembling legal documents, writing game designs, and working on the first novel in the\nArts of Dark and Light\nseries.  In other words, in the last 200 days, I have cranked out more than 200,000 words that no one has seen in addition to all of the various blog posts and columns during that time.\nI’m about 20 days behind on my original schedule for the novel, so I’ve got to increase my average daily production from 725 to 945 words the rest of the way.  That won’t have any impact on the blog, but it does mean that I’m not likely to do much else until I get the first draft done within the one year I allotted for it.  This isn’t an apology, I’m simply letting you know that if it’s not related to the novel or the game designs, it probably isn’t getting done in the near future.  And if I don’t devote much time to a comment or an email, well, you can probably figure out why.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-11T20:56:00+00:00"
}