{
  "url": "https://voxday.net/2012/02/26/mailvox-thus-spake-purple-cow/",
  "scraped_at": "2025-12-14T04:48:13.206758",
  "title": "Mailvox: of bovine flatulence",
  "date_display": "February 26, 2012",
  "date_iso": "2012-02-26T12:57:00+00:00",
  "date_from_url": "2012-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I found this attempt to criticize the blog to be more than a little amusing, particularly in light of some recent discussions:</p><blockquote><p>The whole website is one giant Straw Man. He makes entirely false claims of what secularists believe and then demolishes those, rather than bothering to listen to what they are actually saying. It’s rather like my saying “all conservatives believe that the moon is made of blue cheese” then producing proof that it isn’t. Any moron can do that – your man is a pompous buffoon, with grandiose overblown views of his own intellectual prowess.</p><p>The site is also littered with factual errors. For instance in the piece about the CERN experiments , he firstly demonstrates a complete miss-understanding of scientific method, before completely miss-understanding the relevance of the possible faulty connector. (In fact if the connector does prove to be faulty that would make the neutrinos faster, rather than slower as he seems to think.) There are other possible sources of error in the experiment, but the connector isn’t the issue that would bring the speed below light speed.</p><p>So in summary, it’s the perfect website for the modern conservative American. It has an overblown sense of its own importance and intellectual capabilities, and busies itself debates points that its opponents haven’t actually made.  It’s like a blog version of Rush Limbaugh.</p></blockquote><p>First, I should like to invite Purple Cow to “make entirely true claims of what secularists believe” so that he need not fear I am attacking any straw men in lieu of the correct targets.  This is, of course, a blatant falsehood, and more than that, it is one habitually thrown out by many members of the godless Left whenever they wish to avoid having the errors in their arguments exposed in public.  Longtime readers will recall that a number of TIA critics tried to make precisely the same Appeal to Nonexistent Strawmen despite the fact that I was directly addressing explicit arguments, complete with quotes, citations, and page numbers, that had been presented by the various individuals being criticized.  This is the customary process:</p><p>1.  Secularist 1 presents argument.<br> 2.  I demolish S1’s argument.<br> 3.  I later make reference to S1’s argument in rhetorical form.<br> 4.  Secularist 2 claims I am attacking secularist strawmen.<br> 5.  I invite S2 to present his argument.</br></br></br></br></p><p>6a. <i>*crickets*</i><br> 6b. S2 presents the same argument as S1.</br></p><p>I further note that this sort of response is precisely why I continue to publicly drive home the undeniable statistical probability of my superior intelligence, because the likes of the Purple Cow almost inevitably attempt to challenge it on the basis of absolutely nothing but an unconvincing pose of self-appointed intellectual superiority.  This example is particularly amusing, because Purple Cow clearly didn’t even understand the rather important distinction between what I wrote about the CERN experiment and what I quoted <i>ScienceInsider</i> writing about it.  [Hint: if it’s blue text in a white box, then I probably didn’t write it.]  Purple Cow’s complaints about the “miss-understanding” of the scientific method and the “miss-understanding” of “the relevance of the possible faulty connector” simply don’t apply to me because <a href=\"http://www.milobookclub.com/2012/02/25/scientific-dilbertis/\">I never said anything about either</a>.</p><p>Moreover, Purple Cow clearly failed to understand that my point about the intrinsic unreliability of science and its consequent poor utility as a means of providing technocratic guidance to political governance, (and, of course, its ultimate reliance on the IT department), is valid regardless of what the effect of the faulty connector might have on the experiment.  Purple Cow is yet another excellent example of the mid-wit who erroneously assumes that because he is more intelligent than the average 100-IQ individual, he therefore must have correctly grasped that which is clearly and incontrovertibly over his head.</p><p>I should also like to point out that contra the oft-heard Appeal to Nonexistent Strawmen, this is one of the only blogs of which I am aware in which contrary arguments presented by critics are published in full, unedited.  So, I think it is not only false, but wildly dishonest, to claim that I avoid, in any way, the best arguments possessed by those who disagree with me.</p></div>",
  "content_text": "I found this attempt to criticize the blog to be more than a little amusing, particularly in light of some recent discussions:\nThe whole website is one giant Straw Man. He makes entirely false claims of what secularists believe and then demolishes those, rather than bothering to listen to what they are actually saying. It’s rather like my saying “all conservatives believe that the moon is made of blue cheese” then producing proof that it isn’t. Any moron can do that – your man is a pompous buffoon, with grandiose overblown views of his own intellectual prowess.\nThe site is also littered with factual errors. For instance in the piece about the CERN experiments , he firstly demonstrates a complete miss-understanding of scientific method, before completely miss-understanding the relevance of the possible faulty connector. (In fact if the connector does prove to be faulty that would make the neutrinos faster, rather than slower as he seems to think.) There are other possible sources of error in the experiment, but the connector isn’t the issue that would bring the speed below light speed.\nSo in summary, it’s the perfect website for the modern conservative American. It has an overblown sense of its own importance and intellectual capabilities, and busies itself debates points that its opponents haven’t actually made.  It’s like a blog version of Rush Limbaugh.\nFirst, I should like to invite Purple Cow to “make entirely true claims of what secularists believe” so that he need not fear I am attacking any straw men in lieu of the correct targets.  This is, of course, a blatant falsehood, and more than that, it is one habitually thrown out by many members of the godless Left whenever they wish to avoid having the errors in their arguments exposed in public.  Longtime readers will recall that a number of TIA critics tried to make precisely the same Appeal to Nonexistent Strawmen despite the fact that I was directly addressing explicit arguments, complete with quotes, citations, and page numbers, that had been presented by the various individuals being criticized.  This is the customary process:\n1.  Secularist 1 presents argument.\n2.  I demolish S1’s argument.\n3.  I later make reference to S1’s argument in rhetorical form.\n4.  Secularist 2 claims I am attacking secularist strawmen.\n5.  I invite S2 to present his argument.\n6a.\n*crickets*\n6b. S2 presents the same argument as S1.\nI further note that this sort of response is precisely why I continue to publicly drive home the undeniable statistical probability of my superior intelligence, because the likes of the Purple Cow almost inevitably attempt to challenge it on the basis of absolutely nothing but an unconvincing pose of self-appointed intellectual superiority.  This example is particularly amusing, because Purple Cow clearly didn’t even understand the rather important distinction between what I wrote about the CERN experiment and what I quoted\nScienceInsider\nwriting about it.  [Hint: if it’s blue text in a white box, then I probably didn’t write it.]  Purple Cow’s complaints about the “miss-understanding” of the scientific method and the “miss-understanding” of “the relevance of the possible faulty connector” simply don’t apply to me because\nI never said anything about either\n.\nMoreover, Purple Cow clearly failed to understand that my point about the intrinsic unreliability of science and its consequent poor utility as a means of providing technocratic guidance to political governance, (and, of course, its ultimate reliance on the IT department), is valid regardless of what the effect of the faulty connector might have on the experiment.  Purple Cow is yet another excellent example of the mid-wit who erroneously assumes that because he is more intelligent than the average 100-IQ individual, he therefore must have correctly grasped that which is clearly and incontrovertibly over his head.\nI should also like to point out that contra the oft-heard Appeal to Nonexistent Strawmen, this is one of the only blogs of which I am aware in which contrary arguments presented by critics are published in full, unedited.  So, I think it is not only false, but wildly dishonest, to claim that I avoid, in any way, the best arguments possessed by those who disagree with me.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-26T12:57:00+00:00"
}