{
  "url": "https://voxday.net/2012/02/24/mailvox-richard-dawkins-is-not-atheis/",
  "scraped_at": "2025-12-14T04:48:05.755026",
  "title": "Mailvox: Richard Dawkins is not an atheist!",
  "date_display": "February 24, 2012",
  "date_iso": "2012-02-24T18:04:00+00:00",
  "date_from_url": "2012-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been getting a fair amount of email and one or two people have been dropping OT bombs in the comments concerning <a href=\"http://www.telegraph.co.uk/news/religion/9102740/Richard-Dawkins-I-cant-be-sure-God-does-not-exist.html\">this discussion between Richard Dawkins and Rowan Williams</a>:</p><blockquote><p>There was surprise when Prof Dawkins acknowledged that he was less than 100 per cent certain of his conviction that there is no creator.  The philosopher Sir Anthony Kenny, who chaired the discussion, interjected: “Why don’t you call yourself an agnostic?” Prof Dawkins answered that he did.</p><p>An incredulous Sir Anthony replied: “You are described as the world’s most famous atheist.”</p><p>Prof Dawkins said that he was “6.9 out of seven” sure of his beliefs.  “I think the probability of a supernatural creator existing is very very low,” he added.</p></blockquote><p>While it pains me to have to defend the vastly overrated intellectual charlatan that is Richard Dawkins, I have no choice but to do so.  Nothing has changed and Dawkins is being entirely consistent with his previously declared position of being a technically agnostic de facto atheist here.  Consider these quotes from <i>The God Delusion</i>, published six years ago.</p><p><i>“The view that I shall defend is very different: agnosticism about the existence of God belongs firmly in the temporary or TAP category. Either he exists or he doesn’t. It is a scientific question; one day we may know the answer, and meanwhile we can say something pretty strong about the probability.”</i></p><p>“6 Very low probability, but short of zero. De facto atheist. ‘I cannot know for certain but I think God is very improbable, and I live my life on the assumption that he is not there.'”</p><p>“I count myself in category 6, but leaning towards 7 – 1 am agnostic only to the extent that I am agnostic about fairies at the bottom of the garden.”</p><p>In fact, when Dawkins says he is “6.9 out of 7” sure of his beliefs, he is explicitly referring to this seven point system.  So, Dawkins is not only holding his atheistic ground, he is actually strengthening it from 6.0 to 6.9 out of 7.  While the fact that Dawkins declared himself a literal agnostic in the very book in which he declared the importance of atheist evangelism is both ironic and incoherent, it will surprise no one who has read the chapter of <i>The Irrational Atheist</i> entitled “Darwin’s Judas”.</p><p>This article very nearly approaches the Platonic Form of a non-story.</p></div>",
  "content_text": "I’ve been getting a fair amount of email and one or two people have been dropping OT bombs in the comments concerning\nthis discussion between Richard Dawkins and Rowan Williams\n:\nThere was surprise when Prof Dawkins acknowledged that he was less than 100 per cent certain of his conviction that there is no creator.  The philosopher Sir Anthony Kenny, who chaired the discussion, interjected: “Why don’t you call yourself an agnostic?” Prof Dawkins answered that he did.\nAn incredulous Sir Anthony replied: “You are described as the world’s most famous atheist.”\nProf Dawkins said that he was “6.9 out of seven” sure of his beliefs.  “I think the probability of a supernatural creator existing is very very low,” he added.\nWhile it pains me to have to defend the vastly overrated intellectual charlatan that is Richard Dawkins, I have no choice but to do so.  Nothing has changed and Dawkins is being entirely consistent with his previously declared position of being a technically agnostic de facto atheist here.  Consider these quotes from\nThe God Delusion\n, published six years ago.\n“The view that I shall defend is very different: agnosticism about the existence of God belongs firmly in the temporary or TAP category. Either he exists or he doesn’t. It is a scientific question; one day we may know the answer, and meanwhile we can say something pretty strong about the probability.”\n“6 Very low probability, but short of zero. De facto atheist. ‘I cannot know for certain but I think God is very improbable, and I live my life on the assumption that he is not there.'”\n“I count myself in category 6, but leaning towards 7 – 1 am agnostic only to the extent that I am agnostic about fairies at the bottom of the garden.”\nIn fact, when Dawkins says he is “6.9 out of 7” sure of his beliefs, he is explicitly referring to this seven point system.  So, Dawkins is not only holding his atheistic ground, he is actually strengthening it from 6.0 to 6.9 out of 7.  While the fact that Dawkins declared himself a literal agnostic in the very book in which he declared the importance of atheist evangelism is both ironic and incoherent, it will surprise no one who has read the chapter of\nThe Irrational Atheist\nentitled “Darwin’s Judas”.\nThis article very nearly approaches the Platonic Form of a non-story.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-24T18:04:00+00:00"
}