{
  "url": "https://voxday.net/2012/02/19/mailvox-ironic-failure-of-reason/",
  "scraped_at": "2025-12-14T04:47:33.921750",
  "title": "Mailvox: an ironic failure of reason",
  "date_display": "February 19, 2012",
  "date_iso": "2012-02-19T12:31:00+00:00",
  "date_from_url": "2012-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Smiley reaches a logically erroneous conclusion:</p><blockquote><p>So how is the average person who did not have the same experiences as you, and does not find the logic convincing, supposed to believe? Elsewhere, you, like most christians, indicate that non-christians intentionally choose hell over heaven as though they deep down know that christianity is true.</p><p>This also seems at odds with a claim you made once, that you believe that it is rational to not believe in Christianity. So if it is rational, how can one be held accountable for not believing?</p><p>The Divine Hiddenness argument against the existence of the biblical god, uses that precise fact, as its core. I find that infinitely more convincing than any argument ever proposed by any Christian.</p><p>1. God sincerely wishes with all his heart to believe in him (I know VD’s God is much more cruel and indifferent than most Christians’ ideas, but he still does desire every individual human to believe in him)</p><p>2. It is rational to not believe in God</p><p>3. So there is no biblical God</p><p>Most Christians deny 2. But they are wrong. And you, VD, appear to agree.</p></blockquote><p>First, it is both absurd and petty to avoid capitalizing a proper noun.  Regardless what one thinks of Marxism, Buddhism, or Christianity, they all merit capital letters.  This is basic punctuation.  Second, I think this is a very common and reasonable line of thought which nevertheless reveals several logical errors on the part of the questioner.</p><p>The answer to the first question is simple.  Observation.  Even if we do not have certain experiences ourselves, we can reach valid conclusions by observing the effect those experiences have had on others.  Indeed, this is both how science operates as well as being one of the primary forms of transmitting Christian beliefs from its inception; the observed transformation that took place in the life of Saul, to say nothing of the cowardly disciples, no doubt played a large role in the subsequent beliefs of others, just as an observed transformation in one of my friend’s lives made a major impact on my own thinking about Christianity.</p><p>To say that non-Christians choose Hell over Heaven is not quite the same thing as saying that “they deep down know that christianity is true”.  While some consciously do make such a choice, most do so by rejecting the choice, but of course, the refusal to make a decision is tantamount to making a negative decision when a choice must be made.  Also, what most Christians actually mean in this regard is not that most non-Christians deep down subscribe to the Nicene Creed, but rather that they understand, deep down, that they are flawed and fallen beings in need of salvation from their sinful nature.</p><p>As the vulgar expression has it, they are aware there is a Jesus-sized hole in their hearts.  While one can certainly quibble about the size and shape of the hole if one wishes, it would be very difficult for anyone with any experience of humanity to altogether deny its existence, even though the materialist has no choice but to do so.  This, of course, is why so many people instinctively, and correctly, reject material reductionism regardless of whether they possess religious faith or not.</p><p>Now to get to the errors.</p><p>A.  To say that it is rational to not believe in the tenets of Christianity is not tantamount to saying that it is justifiable to not believe in those tenets.  Nor does it mean that belief in Christianity is irrational.  (For the sake of the pedantic, I will point out that I used “belief in Christianity” in the sense of “being a Christian”; obviously it would not be rational to insist that Christianity does not exist.)</p><p>B.  When has the rationality of an action ever excused one from accountability for it?  It is perfectly rational to print your own U.S. dollars from a laser printer and one can even present a sound mainstream economic argument for doing so, complete with a utilitarian moral justification, but that will not prevent one from being held accountable should one actually attempt to buy something with them.</p><p>C.  The Divine Hiddenness argument is both deeply stupid and theologically ignorant, so the fact that Smiley finds it “infinitely more convincing than any argument ever proposed by any Christian” tells us very little about anything but Smiley’s knowledge base and capacity for reason.  The number of questions being begged in the argument are downright embarrassing.  From Wikipedia: <i>The argument from nonbelief (or the argument from divine hiddenness) is a philosophical argument against the existence of God, specifically, the God of theism. The premise of the argument is that if God existed (and wanted humanity to know it), he would have brought about a situation in which every reasonable person believed in him; however, there are reasonable unbelievers, and therefore, this weighs against God’s existence.</i></p><p>I will address this argument in detail in a future post, but for now, Job 38:1-2 is sufficient to demolish it.</p><p><i>Then the LORD spoke to Job out of the storm. He said:  “Who is this that obscures my plans with words without knowledge?</i></p><p>D.  As to the syllogism presented, it is hopeless from the start.</p><p>1.  No.  The Biblical God clearly does not “sincerely wishes with all his heart” for people to believe in His existence.  In fact, such belief isn’t even enough to ensure one is not His enemy. <i>“You believe that there is one God. Good! Even the demons believe that—and shudder.”</i> And God knows perfectly well that some people genuinely don’t believe He exists. <i>“The fool says in his heart, “There is no God.”</i></p><p>2.  Yes, but as was already pointed out above, so what?</p><p>3.  The first step is false, the second step is irrelevant, and the conclusion is therefore false.  But even if both steps had been true, the conclusion still wouldn’t follow.</p></div>",
  "content_text": "Smiley reaches a logically erroneous conclusion:\nSo how is the average person who did not have the same experiences as you, and does not find the logic convincing, supposed to believe? Elsewhere, you, like most christians, indicate that non-christians intentionally choose hell over heaven as though they deep down know that christianity is true.\nThis also seems at odds with a claim you made once, that you believe that it is rational to not believe in Christianity. So if it is rational, how can one be held accountable for not believing?\nThe Divine Hiddenness argument against the existence of the biblical god, uses that precise fact, as its core. I find that infinitely more convincing than any argument ever proposed by any Christian.\n1. God sincerely wishes with all his heart to believe in him (I know VD’s God is much more cruel and indifferent than most Christians’ ideas, but he still does desire every individual human to believe in him)\n2. It is rational to not believe in God\n3. So there is no biblical God\nMost Christians deny 2. But they are wrong. And you, VD, appear to agree.\nFirst, it is both absurd and petty to avoid capitalizing a proper noun.  Regardless what one thinks of Marxism, Buddhism, or Christianity, they all merit capital letters.  This is basic punctuation.  Second, I think this is a very common and reasonable line of thought which nevertheless reveals several logical errors on the part of the questioner.\nThe answer to the first question is simple.  Observation.  Even if we do not have certain experiences ourselves, we can reach valid conclusions by observing the effect those experiences have had on others.  Indeed, this is both how science operates as well as being one of the primary forms of transmitting Christian beliefs from its inception; the observed transformation that took place in the life of Saul, to say nothing of the cowardly disciples, no doubt played a large role in the subsequent beliefs of others, just as an observed transformation in one of my friend’s lives made a major impact on my own thinking about Christianity.\nTo say that non-Christians choose Hell over Heaven is not quite the same thing as saying that “they deep down know that christianity is true”.  While some consciously do make such a choice, most do so by rejecting the choice, but of course, the refusal to make a decision is tantamount to making a negative decision when a choice must be made.  Also, what most Christians actually mean in this regard is not that most non-Christians deep down subscribe to the Nicene Creed, but rather that they understand, deep down, that they are flawed and fallen beings in need of salvation from their sinful nature.\nAs the vulgar expression has it, they are aware there is a Jesus-sized hole in their hearts.  While one can certainly quibble about the size and shape of the hole if one wishes, it would be very difficult for anyone with any experience of humanity to altogether deny its existence, even though the materialist has no choice but to do so.  This, of course, is why so many people instinctively, and correctly, reject material reductionism regardless of whether they possess religious faith or not.\nNow to get to the errors.\nA.  To say that it is rational to not believe in the tenets of Christianity is not tantamount to saying that it is justifiable to not believe in those tenets.  Nor does it mean that belief in Christianity is irrational.  (For the sake of the pedantic, I will point out that I used “belief in Christianity” in the sense of “being a Christian”; obviously it would not be rational to insist that Christianity does not exist.)\nB.  When has the rationality of an action ever excused one from accountability for it?  It is perfectly rational to print your own U.S. dollars from a laser printer and one can even present a sound mainstream economic argument for doing so, complete with a utilitarian moral justification, but that will not prevent one from being held accountable should one actually attempt to buy something with them.\nC.  The Divine Hiddenness argument is both deeply stupid and theologically ignorant, so the fact that Smiley finds it “infinitely more convincing than any argument ever proposed by any Christian” tells us very little about anything but Smiley’s knowledge base and capacity for reason.  The number of questions being begged in the argument are downright embarrassing.  From Wikipedia:\nThe argument from nonbelief (or the argument from divine hiddenness) is a philosophical argument against the existence of God, specifically, the God of theism. The premise of the argument is that if God existed (and wanted humanity to know it), he would have brought about a situation in which every reasonable person believed in him; however, there are reasonable unbelievers, and therefore, this weighs against God’s existence.\nI will address this argument in detail in a future post, but for now, Job 38:1-2 is sufficient to demolish it.\nThen the LORD spoke to Job out of the storm. He said:  “Who is this that obscures my plans with words without knowledge?\nD.  As to the syllogism presented, it is hopeless from the start.\n1.  No.  The Biblical God clearly does not “sincerely wishes with all his heart” for people to believe in His existence.  In fact, such belief isn’t even enough to ensure one is not His enemy.\n“You believe that there is one God. Good! Even the demons believe that—and shudder.”\nAnd God knows perfectly well that some people genuinely don’t believe He exists.\n“The fool says in his heart, “There is no God.”\n2.  Yes, but as was already pointed out above, so what?\n3.  The first step is false, the second step is irrelevant, and the conclusion is therefore false.  But even if both steps had been true, the conclusion still wouldn’t follow.",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-19T12:31:00+00:00"
}