{
  "url": "https://voxday.net/2012/02/20/portrait-of-facepa/",
  "scraped_at": "2025-12-14T04:47:41.247414",
  "title": "Portrait of afacepalm",
  "date_display": "February 20, 2012",
  "date_iso": "2012-02-20T18:00:00+00:00",
  "date_from_url": "2012-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is an actual dialogue from the comments that I felt deserves to survive the heat death of CoComment:</p><blockquote><p><b>Agnosticon: </b>There’s a lot of <i>mens rea</i> in this argument. [The Divine Hiddenness argument.]  It is basically a legal analogy.  A rational disbeliever allegedly does not have “guilty mind” and should therefore still be worthy of salvation, however he isn’t, a contradiction. Rational justification here is equivalent to non culpability, while that may not be full justification, it is not unjustified either, it occupies a gray region. I think the argument rests on the assumption that God would be wise enough to perceive this and avoid it, but He doesn’t, hence no God.</p><p><b>VD: </b>It is a stupid and logically invalid argument, as I will demonstrate when I get around to it. And, as I have pointed out on many occasions, legal and moral culpability are two very different things. Regardless, arguing about the fact of God’s existence on the basis of Man’s law is self-evidently stupid.</p><p><b>Agnosticon: </b>At least it doesn’t question beg, as does arguing for the existence of God based on God’s Law.</p><p><b>VD: </b>There is no “at least”, it’s simply invalid. And who is arguing for the existence of God based on God’s Law? If you still think I’m doing that, you’re simply demonstrating your intellectual limitations again.</p><p><b>Agnosticon: </b>I’m not saying that. I’m just anticipating some circularity in the rebuttal to the [Divine] Hiddenness argument, but I’ll wait until you give it.</p></blockquote><p>As a general service to commenters here, let me recommend that you read this and contemplate the wisdom of not publicly attempting to defend an argument that you have made by comparing it favorably with an argument that someone else has not actually made, but that you <i>anticipate them making</i>.  Even if an argument is intrinsically flawed, you can’t burn a bloody strawman until the straw is gathered and assembled.</p><p>And on a tangential note, I’d be curious to know what the regulars here deem the over/under on the percentage chance that Agnosticon can successfully anticipate the structure of my arguments, much less the actual argument itself?</p></div>",
  "content_text": "This is an actual dialogue from the comments that I felt deserves to survive the heat death of CoComment:\nAgnosticon:\nThere’s a lot of\nmens rea\nin this argument. [The Divine Hiddenness argument.]  It is basically a legal analogy.  A rational disbeliever allegedly does not have “guilty mind” and should therefore still be worthy of salvation, however he isn’t, a contradiction. Rational justification here is equivalent to non culpability, while that may not be full justification, it is not unjustified either, it occupies a gray region. I think the argument rests on the assumption that God would be wise enough to perceive this and avoid it, but He doesn’t, hence no God.\nVD:\nIt is a stupid and logically invalid argument, as I will demonstrate when I get around to it. And, as I have pointed out on many occasions, legal and moral culpability are two very different things. Regardless, arguing about the fact of God’s existence on the basis of Man’s law is self-evidently stupid.\nAgnosticon:\nAt least it doesn’t question beg, as does arguing for the existence of God based on God’s Law.\nVD:\nThere is no “at least”, it’s simply invalid. And who is arguing for the existence of God based on God’s Law? If you still think I’m doing that, you’re simply demonstrating your intellectual limitations again.\nAgnosticon:\nI’m not saying that. I’m just anticipating some circularity in the rebuttal to the [Divine] Hiddenness argument, but I’ll wait until you give it.\nAs a general service to commenters here, let me recommend that you read this and contemplate the wisdom of not publicly attempting to defend an argument that you have made by comparing it favorably with an argument that someone else has not actually made, but that you\nanticipate them making\n.  Even if an argument is intrinsically flawed, you can’t burn a bloody strawman until the straw is gathered and assembled.\nAnd on a tangential note, I’d be curious to know what the regulars here deem the over/under on the percentage chance that Agnosticon can successfully anticipate the structure of my arguments, much less the actual argument itself?",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-20T18:00:00+00:00"
}