{
  "url": "https://voxday.net/2012/02/15/richard-dawkins-sans-pants/",
  "scraped_at": "2025-12-14T04:47:16.258247",
  "title": "Richard Dawkins, sans pants",
  "date_display": "February 15, 2012",
  "date_iso": "2012-02-15T14:00:00+00:00",
  "date_from_url": "2012-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is absolutely and utterly hilarious.  In case you still don’t believe that Richard Dawkins is a cretinous ex-scientist long past his sell-by date, I suspect <a href=\"http://www.telegraph.co.uk/news/religion/9082059/For-once-Richard-Dawkins-is-lost-for-words.html\">this will suffice to convince you:</a></p><blockquote><p>If you were trying to come up with a definition of misplaced intellectual arrogance, you could not do better than having the planet’s most famous atheist issuing diktats on who does and doesn’t count as a proper Christian. Prof Dawkins then announced, triumphantly, that an “astonishing number [of Christians] couldn’t identify the first book in the New Testament”.</p><p>The transcript of the next minute or so only hints at how cringingly, embarrassingly bad it was for Dawkins.</p><p><i>Fraser: Richard, if I said to you what is the full title of The Origin Of Species, I’m sure you could tell me that.</i></p><p>Dawkins: Yes I could.</p><p>Fraser: Go on then.</p><p>Dawkins: On the Origin of Species…Uh…With, oh, God, On the Origin of Species. There is a sub-title with respect to the preservation of favoured races in the fight… in the struggle for life.</p><p>Fraser: If you asked people who believed in evolution what that question, and then you came back and said two percent got it right, it would be terribly easy for me to go they don’t really believe it after all.  It’s just not fair to ask people these questions.</p><p>It was a golden minute of radio. But as well as being hilarious, it was hugely symbolic.</p></blockquote><p>As I have said repeatedly, Richard Dawkins is a huge intellectual fraud, and perhaps those who previously expressed incredulity at the idea that I would quite easily trounce the old charlatan in a debate will find it just a bit more credible now.  This behavior isn’t an outlier or a momentary lapse of memory, it is entirely characteristic.  The man quite frequently pretends to knowledge that he patently does not possess and assumes he knows things that he obviously does not, which is why he avoids debate with those who are aware of his intellectual pretensions and are capable of exposing them.</p><p>It’s bad enough that Dawkins couldn’t come up with the name of what he considers to be the most important book ever written immediately after claiming he could do so, but in addition to stumbling a little on the subtitle, <i>he even forgot the rather important part of the title that refers to the actual mechanism supposedly responsible!</i> And furthermore, I am very, very skeptical of the assertion that 64 percent of self-identified Christians were not able to identify Matthew as the first book of the New Testament in a multiple choice question with four answers.  I’d quite like to see what the other options were, as my guess is that most of the people who got it wrong didn’t pay sufficient attention to the question and reflexively answered “Genesis”.</p><p>Just in case Richard is reading this, the correct answer is: <i>On the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life.</i></p><p>UPDATE: Here is <a href=\"http://www.youtube.com/watch?v=RTV-py1W8Rk\">the audio recording</a>.  It’s actually even better than the excerpt of the transcript provided, which I have updated accordingly.</p></div>",
  "content_text": "This is absolutely and utterly hilarious.  In case you still don’t believe that Richard Dawkins is a cretinous ex-scientist long past his sell-by date, I suspect\nthis will suffice to convince you:\nIf you were trying to come up with a definition of misplaced intellectual arrogance, you could not do better than having the planet’s most famous atheist issuing diktats on who does and doesn’t count as a proper Christian. Prof Dawkins then announced, triumphantly, that an “astonishing number [of Christians] couldn’t identify the first book in the New Testament”.\nThe transcript of the next minute or so only hints at how cringingly, embarrassingly bad it was for Dawkins.\nFraser: Richard, if I said to you what is the full title of The Origin Of Species, I’m sure you could tell me that.\nDawkins: Yes I could.\nFraser: Go on then.\nDawkins: On the Origin of Species…Uh…With, oh, God, On the Origin of Species. There is a sub-title with respect to the preservation of favoured races in the fight… in the struggle for life.\nFraser: If you asked people who believed in evolution what that question, and then you came back and said two percent got it right, it would be terribly easy for me to go they don’t really believe it after all.  It’s just not fair to ask people these questions.\nIt was a golden minute of radio. But as well as being hilarious, it was hugely symbolic.\nAs I have said repeatedly, Richard Dawkins is a huge intellectual fraud, and perhaps those who previously expressed incredulity at the idea that I would quite easily trounce the old charlatan in a debate will find it just a bit more credible now.  This behavior isn’t an outlier or a momentary lapse of memory, it is entirely characteristic.  The man quite frequently pretends to knowledge that he patently does not possess and assumes he knows things that he obviously does not, which is why he avoids debate with those who are aware of his intellectual pretensions and are capable of exposing them.\nIt’s bad enough that Dawkins couldn’t come up with the name of what he considers to be the most important book ever written immediately after claiming he could do so, but in addition to stumbling a little on the subtitle,\nhe even forgot the rather important part of the title that refers to the actual mechanism supposedly responsible!\nAnd furthermore, I am very, very skeptical of the assertion that 64 percent of self-identified Christians were not able to identify Matthew as the first book of the New Testament in a multiple choice question with four answers.  I’d quite like to see what the other options were, as my guess is that most of the people who got it wrong didn’t pay sufficient attention to the question and reflexively answered “Genesis”.\nJust in case Richard is reading this, the correct answer is:\nOn the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life.\nUPDATE: Here is\nthe audio recording\n.  It’s actually even better than the excerpt of the transcript provided, which I have updated accordingly.",
  "tags": [
    "atheism",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-15T14:00:00+00:00"
}