{
  "url": "https://voxday.net/2012/02/18/teachable-momen/",
  "scraped_at": "2025-12-14T04:47:28.414545",
  "title": "A teachable moment",
  "date_display": "February 18, 2012",
  "date_iso": "2012-02-18T10:34:00+00:00",
  "date_from_url": "2012-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was driving to the post office today, listening to the pure essence of awesome that is Rock Sugar, when it occurred to me that a previous attempt to “correct” me served as an ideal example of the frustration regularly experienced by more intelligent individuals forced to deal with the regular attempts of the mid-witted to demonstrate their intellectual “superiority” to all and sundry.</p><p>In my experience, those of very average or sub-normal intelligence seldom attempt to correct people.  They simply don’t dare.  And with the exception of the socially retarded sub-set, those of high intelligence also seldom bother, either because it’s so much more trouble than its worth or because they view one isolated correction as being akin to attempting to bail out the ocean with a teaspoon.  But mid-wits love little more than demonstrating that they know more than somebody else, especially in public, and they will readily leap at any opportunity to do so.</p><p>Anyhow, some time ago, I mentioned that <i>Shook Me Like a Prayer</i> was one of my favorite Rock Sugar mashups, and that I particularly liked the way it incorporated <i>Hell’s Bells</i> by AC/DC.  Someone, I don’t recall who, immediately took the opportunity to jump on that statement, explaining that it wasn’t AC/DC’s <i>Hell’s Bells</i>, but rather, <i>You Shook Me All Night Long</i> that was the song that had been mixed together with Madonna’s <i>Like a Prayer</i>.</p><p>That was both true and false… and this is precisely why I hate midwits.  First, they seldom have a sufficient grasp of the subjects they address, and second, they tend to inadvertently assume a position that requires the assumption that the person they are correcting is a complete and blithering idiot.  I mean, let’s consider the facts that had to be known in this case to the midwit concerned:</p><p>(1) The Rock Sugar song is called <i>Shook Me Like a Prayer</i> and Rock Sugar songs are usually named after the two songs most utilized in the mix.  Precisely how dumb does someone have to be in order to hear the song and somehow fail to recognize either chorus or the significance of “Shook Me” in the title?  65 IQ?  55?  Actually brain-dead?</p><p>(2) To quote Wikipedia, “<i>You Shook Me All Night Long</i> is one of AC/DC’s signature songs from their most successful album, Back in Black.”  It also has one of the most recognizable introductory guitar lines in rock history.</p><p>(3) Its occasional use during defensive stands in NFL games notwithstanding, <i>Hell’s Bells</i> is less well known than <i>You Shook Me All Night Long</i> and anyone who knows the former is almost surely familiar with the latter.</p><p>(4) Rock Sugar usually mixes in elements from at least three different songs even if only two of them serve as the primary sources and are referenced in the title.  For example, <i>Voices in the Jungle</i> also contains the famous guitar melody from <i>Sweet Child o’ Mine</i> in the second and third choruses.</p><p>(5) There are freaking BELLS sounding in the middle of the Rock Sugar song.</p><p>Any one of those known facts should have been enough to give the correcting individual pause, but as we saw, they did not.  Then add to those five known facts the two unknown ones that the midwit might have known, but couldn’t be reasonably assumed to know:</p><p>(6) AC/DC’s Back in Black was the first album I ever bought.</p><p>(7) I was a founding member of a band signed to Wax Trax! and TVT Records, and can therefore be expected to pay at least a little more attention to the more subtle elements that go into a song than the average individual.</p><p>Now, if you simply listen first to <a href=\"http://www.youtube.com/watch?v=2Kjh9lQXLWk\">Hell’s Bells</a> from the 22 second to the 40 second mark, then to <a href=\"http://www.youtube.com/watch?v=DpNrqxBWxQM\">Shook Me Like a Prayer</a> from the 2 minute 28 second mark to the two minute 44 second mark, it should be completely obvious what I was describing.  Despite not being one of the song’s two primary elements, <i>Hell’s Bells</i> is cleverly and seamlessly worked into the mix, which is precisely the aspect of the song I was praising.</p><p>The basic problem this example reveals isn’t that the midwit has no idea what he’s talking about, but that he has a partial understanding he erroneously assumes is a complete one.  For those who find themselves tempted to be constantly correcting others, it might be worth keeping this example in mind to encourage a moment’s hesitation and contemplation before you leap in and embarrass yourself by attempting to “correct” an understanding that is materially superior to your own.  At least on this blog, I have noticed that errors inspired by a combination of trigger words with insufficient reading comprehension appear to be the most common variety.</p><p> And on a barely tangential note, I was amused by DL’s email this morning:</p><blockquote><p>I was putzing around in my SNES emulator the other day and loaded up “X-Calibur” or some such at random.  Imagine my surprise (and triple-take to make sure I hadn’t misread) to find your past gig providing the music. Not a terrible little game, either. : )</p></blockquote><p>Psykosonik: like the Spanish Inquisition, only louder, faster, and electronic.</p></div>",
  "content_text": "I was driving to the post office today, listening to the pure essence of awesome that is Rock Sugar, when it occurred to me that a previous attempt to “correct” me served as an ideal example of the frustration regularly experienced by more intelligent individuals forced to deal with the regular attempts of the mid-witted to demonstrate their intellectual “superiority” to all and sundry.\nIn my experience, those of very average or sub-normal intelligence seldom attempt to correct people.  They simply don’t dare.  And with the exception of the socially retarded sub-set, those of high intelligence also seldom bother, either because it’s so much more trouble than its worth or because they view one isolated correction as being akin to attempting to bail out the ocean with a teaspoon.  But mid-wits love little more than demonstrating that they know more than somebody else, especially in public, and they will readily leap at any opportunity to do so.\nAnyhow, some time ago, I mentioned that\nShook Me Like a Prayer\nwas one of my favorite Rock Sugar mashups, and that I particularly liked the way it incorporated\nHell’s Bells\nby AC/DC.  Someone, I don’t recall who, immediately took the opportunity to jump on that statement, explaining that it wasn’t AC/DC’s\nHell’s Bells\n, but rather,\nYou Shook Me All Night Long\nthat was the song that had been mixed together with Madonna’s\nLike a Prayer\n.\nThat was both true and false… and this is precisely why I hate midwits.  First, they seldom have a sufficient grasp of the subjects they address, and second, they tend to inadvertently assume a position that requires the assumption that the person they are correcting is a complete and blithering idiot.  I mean, let’s consider the facts that had to be known in this case to the midwit concerned:\n(1) The Rock Sugar song is called\nShook Me Like a Prayer\nand Rock Sugar songs are usually named after the two songs most utilized in the mix.  Precisely how dumb does someone have to be in order to hear the song and somehow fail to recognize either chorus or the significance of “Shook Me” in the title?  65 IQ?  55?  Actually brain-dead?\n(2) To quote Wikipedia, “\nYou Shook Me All Night Long\nis one of AC/DC’s signature songs from their most successful album, Back in Black.”  It also has one of the most recognizable introductory guitar lines in rock history.\n(3) Its occasional use during defensive stands in NFL games notwithstanding,\nHell’s Bells\nis less well known than\nYou Shook Me All Night Long\nand anyone who knows the former is almost surely familiar with the latter.\n(4) Rock Sugar usually mixes in elements from at least three different songs even if only two of them serve as the primary sources and are referenced in the title.  For example,\nVoices in the Jungle\nalso contains the famous guitar melody from\nSweet Child o’ Mine\nin the second and third choruses.\n(5) There are freaking BELLS sounding in the middle of the Rock Sugar song.\nAny one of those known facts should have been enough to give the correcting individual pause, but as we saw, they did not.  Then add to those five known facts the two unknown ones that the midwit might have known, but couldn’t be reasonably assumed to know:\n(6) AC/DC’s Back in Black was the first album I ever bought.\n(7) I was a founding member of a band signed to Wax Trax! and TVT Records, and can therefore be expected to pay at least a little more attention to the more subtle elements that go into a song than the average individual.\nNow, if you simply listen first to\nHell’s Bells\nfrom the 22 second to the 40 second mark, then to\nShook Me Like a Prayer\nfrom the 2 minute 28 second mark to the two minute 44 second mark, it should be completely obvious what I was describing.  Despite not being one of the song’s two primary elements,\nHell’s Bells\nis cleverly and seamlessly worked into the mix, which is precisely the aspect of the song I was praising.\nThe basic problem this example reveals isn’t that the midwit has no idea what he’s talking about, but that he has a partial understanding he erroneously assumes is a complete one.  For those who find themselves tempted to be constantly correcting others, it might be worth keeping this example in mind to encourage a moment’s hesitation and contemplation before you leap in and embarrass yourself by attempting to “correct” an understanding that is materially superior to your own.  At least on this blog, I have noticed that errors inspired by a combination of trigger words with insufficient reading comprehension appear to be the most common variety.\nAnd on a barely tangential note, I was amused by DL’s email this morning:\nI was putzing around in my SNES emulator the other day and loaded up “X-Calibur” or some such at random.  Imagine my surprise (and triple-take to make sure I hadn’t misread) to find your past gig providing the music. Not a terrible little game, either. : )\nPsykosonik: like the Spanish Inquisition, only louder, faster, and electronic.",
  "tags": [
    "mailvox",
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-18T10:34:00+00:00"
}