{
  "url": "https://voxday.net/2012/02/29/team-calvin-question-2b/",
  "scraped_at": "2025-12-14T04:48:32.869928",
  "title": "Team Calvin: Question 2b",
  "date_display": "February 29, 2012",
  "date_iso": "2012-02-29T17:57:00+00:00",
  "date_from_url": "2012-02-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jamsco attempts a summary:</p><blockquote><p>Okay, I’m going to do what I did in Question AA and say what I think Vox is saying. Vox, again please correct what I have wrong.</p><p><i>We cannot apply Vs. 28-31 to all Christians, because it is in the context of vs.10-15, in which Jesus describes what the 12 should do in their first mission. This means we can’t apply Vs. 16-27 to all Christians either.</i></p><p>And since the comparative passages in Luke are in Chapters 9 and 12, we can’t apply the verses in Luke 10 and 11 to all Christians either.</p><p>This includes the Parable of the Good Samaritan, The Lords Prayer and the instruction to Take up your Cross and follow Jesus.</p><p>I have decided much of this in the last day or so, because I don’t like what it means if the Sparrows and Hairs passage applies to all Christians.</p><p>So what do I have wrong?</p></blockquote><p>Most of it.  But before I begin, I will note that this summary further supports my contention that Calvinism is primarily a consequence of a problem with reading comprehension.</p><p><i>We cannot reasonably apply Matthew 10 verses 28-31 to all Christians, because it is clearly in the context of verses 1-15, in which the twelve disciples are listed by name and Jesus describes what the twelve should do in their mission to the lost sheep of Israel. This means we can’t apply verses 16-31 to all Christians either.</i></p><p>I decided this the first time I read this passage, because my reading comprehension abilities have been objectively determined to be superior and I tend to have very little difficulty correctly determining to whom a message is being addressed.</p><p>Being a Calvinist, Jamsco can’t possibly understand that I don’t dislike the Sparrows and Hairs passage because I have never thought, for even a moment, that it contradicted my opinion concerning the voliscience of God, as compared to the omniscience postulated by Calvinists and other Christians.  It’s not as if I hadn’t encountered the passage prior to the last day or so, after all.</p><p>With regards to Luke, it’s quite clear that because he was working from second-hand sources, he has certain events out of order.  The fact that there are passages related to the sending of the Twelve in both chapter 9 and chapter 12 says absolutely nothing about the contents of chapter 10 and chapter 11, which quite clearly refer to different events taking place at different times.  This is hardly remarkable; in the massive and magnificent <i>The Cambridge Medieval History</i>, just to give one of many possible examples, there are references in <i>Volume VIII: The Close of the Middle Ages</i> to events that precede events recounted in <i>Volume II: Foundation of the Western Empire</i> thousands of pages earlier.</p><p>Now, the fact that Jesus Christ’s specific instructions to his twelve disciples are clearly not intended to be specific instructions to us does not mean that we can’t learn something useful from them.  But it does mean that we cannot <i>assume</i> that the message He was providing to them was also meant for us in precisely the same manner that it was meant for them.  And the fact that even at the end of the chapter, verse 40, Jesus is still making specific references to the mission of the twelve is indicative that the entire chapter is best understood through the context of that mission.</p><p>I note that when Jesus is speaking in general terms in this chapter, he does so.  Verse 32: “Whoever acknowledges me before others, I will also acknowledge before my Father in heaven”.  Verse 37: “Anyone who loves their father or mother more than me is not worthy of me.”  And yet, in the two verses immediately prior, he did not say: “Even the very hairs of everyone’s heads are all numbered. So don’t be afraid; everyone is worth more than many sparrows.”</p><p>The fact that Jesus uses specific terms in verses 30 and 31 then switches to general terms in the verses immediately following them strongly supports the interpretation that the earlier verses are not intended for general application, but apply to the individuals to whom he was speaking.</p></div>",
  "content_text": "Jamsco attempts a summary:\nOkay, I’m going to do what I did in Question AA and say what I think Vox is saying. Vox, again please correct what I have wrong.\nWe cannot apply Vs. 28-31 to all Christians, because it is in the context of vs.10-15, in which Jesus describes what the 12 should do in their first mission. This means we can’t apply Vs. 16-27 to all Christians either.\nAnd since the comparative passages in Luke are in Chapters 9 and 12, we can’t apply the verses in Luke 10 and 11 to all Christians either.\nThis includes the Parable of the Good Samaritan, The Lords Prayer and the instruction to Take up your Cross and follow Jesus.\nI have decided much of this in the last day or so, because I don’t like what it means if the Sparrows and Hairs passage applies to all Christians.\nSo what do I have wrong?\nMost of it.  But before I begin, I will note that this summary further supports my contention that Calvinism is primarily a consequence of a problem with reading comprehension.\nWe cannot reasonably apply Matthew 10 verses 28-31 to all Christians, because it is clearly in the context of verses 1-15, in which the twelve disciples are listed by name and Jesus describes what the twelve should do in their mission to the lost sheep of Israel. This means we can’t apply verses 16-31 to all Christians either.\nI decided this the first time I read this passage, because my reading comprehension abilities have been objectively determined to be superior and I tend to have very little difficulty correctly determining to whom a message is being addressed.\nBeing a Calvinist, Jamsco can’t possibly understand that I don’t dislike the Sparrows and Hairs passage because I have never thought, for even a moment, that it contradicted my opinion concerning the voliscience of God, as compared to the omniscience postulated by Calvinists and other Christians.  It’s not as if I hadn’t encountered the passage prior to the last day or so, after all.\nWith regards to Luke, it’s quite clear that because he was working from second-hand sources, he has certain events out of order.  The fact that there are passages related to the sending of the Twelve in both chapter 9 and chapter 12 says absolutely nothing about the contents of chapter 10 and chapter 11, which quite clearly refer to different events taking place at different times.  This is hardly remarkable; in the massive and magnificent\nThe Cambridge Medieval History\n, just to give one of many possible examples, there are references in\nVolume VIII: The Close of the Middle Ages\nto events that precede events recounted in\nVolume II: Foundation of the Western Empire\nthousands of pages earlier.\nNow, the fact that Jesus Christ’s specific instructions to his twelve disciples are clearly not intended to be specific instructions to us does not mean that we can’t learn something useful from them.  But it does mean that we cannot\nassume\nthat the message He was providing to them was also meant for us in precisely the same manner that it was meant for them.  And the fact that even at the end of the chapter, verse 40, Jesus is still making specific references to the mission of the twelve is indicative that the entire chapter is best understood through the context of that mission.\nI note that when Jesus is speaking in general terms in this chapter, he does so.  Verse 32: “Whoever acknowledges me before others, I will also acknowledge before my Father in heaven”.  Verse 37: “Anyone who loves their father or mother more than me is not worthy of me.”  And yet, in the two verses immediately prior, he did not say: “Even the very hairs of everyone’s heads are all numbered. So don’t be afraid; everyone is worth more than many sparrows.”\nThe fact that Jesus uses specific terms in verses 30 and 31 then switches to general terms in the verses immediately following them strongly supports the interpretation that the earlier verses are not intended for general application, but apply to the individuals to whom he was speaking.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-29T17:57:00+00:00"
}