{
  "url": "https://voxday.net/2012/02/28/team-calvin-question-two/",
  "scraped_at": "2025-12-14T04:48:25.630245",
  "title": "Team Calvin: Question Two",
  "date_display": "February 28, 2012",
  "date_iso": "2012-02-28T14:00:00+00:00",
  "date_from_url": "2012-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The second question devised by Team Calvin and my response to it:</p><blockquote><p>BB. Matthew 10:29-31</p><p><i>“Are not two sparrows sold for a penny? And not one of them will fall to the ground without your Father’s will. But even the hairs of your head are all numbered. Fear not, therefore; you are of more value than many sparrows.”</i></p><p>If God indeed didn’t know of Israel’s suffering in Egypt for 400 years, and if He indeed didn’t know how many righteous men were in Sodom, then what do these verses mean? If they are a metaphor or poetry, then a metaphor or poetry signifying what? Please write a paraphrase of the passage such that it helps the reader understand how it doesn’t actually say that God watches the earth to the detail of each hair of one of his own or one sparrow, since such detail would conflict with God not even knowing of the existence of the person in Sodom.</p></blockquote><p>It’s not exactly a surprise to see an appeal to this verse.  And while it might look initially persuasive, as is so often the case, the superficially convincing Calvinist reading becomes significantly less sustainable when it is viewed in the proper Scriptural context.  As I have remarked previously, the Calvinist case tends to be heavily based on verses taken out of their specific context and applied to a general case that was never intended and does not reasonably apply. I believe that is precisely the situation here, so let us consider what is the proper Scriptural context of Matthew 10:29-31. In order to correctly establish that context, I quote this excerpt from the preceding section:</p><p><i>These twelve Jesus sent out with the following instructions: “Do not go among the Gentiles or enter any town of the Samaritans. Go rather to the lost sheep of Israel. As you go, proclaim this message: ‘The kingdom of heaven has come near.’ Heal the sick, raise the dead, cleanse those who have leprosy, drive out demons. Freely you have received; freely give.  “Do not get any gold or silver or copper to take with you in your belts— no bag for the journey or extra shirt or sandals or a staff, for the worker is worth his keep. Whatever town or village you enter, search there for some worthy person and stay at their house until you leave. As you enter the home, give it your greeting. If the home is deserving, let your peace rest on it; if it is not, let your peace return to you. If anyone will not welcome you or listen to your words, leave that home or town and shake the dust off your feet. Truly I tell you, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town.</i> – Matthew 10:5-15</p><p>In other words, the context is the specific instructions to the twelve disciples named in the preceding verses with regards to an important mission to the Jews of Israel during Jesus Christ’s ministry.  It is clearly erroneous to argue that any of the verses in this section are intended to be applied broadly and literally to all Christians in all times, unless one is also willing to insist that Christians should avoid going among the Gentiles, refuse to utilize hotels, and anticipate being arrested and flogged in a synagogue one day.  So, now that it is clear that the context of this section consists of detailed historical instructions to a small group of specified people, let us examine the disputed section in its entirety, as it actually begins one verse before the citation provided.</p><p><i>Do not be afraid of those who kill the body but cannot kill the soul. Rather, be afraid of the One who can destroy both soul and body in hell. Are not two sparrows sold for a penny? Yet not one of them will fall to the ground outside your Father’s care.  And even the very hairs of your head are all numbered. So don’t be afraid; you are worth more than many sparrows.</i> – Matthew 10:28-31</p><p>Read in context, it is readily apparent that this is not any sort of theological revelation about the extent of God’s knowledge, it is simply a promise that the twelve disciples being sent out to the Jews, not to the Gentiles or the Samaritans, are under God’s particular protection during the course of their mission.  The reference to the sparrows are nothing more than a rhetorical means of establishing the relative importance of the disciples to God and the reference to the hairs of the head being numbered is simply a way of saying that God would not permit them to be harmed.  What the verse means, in my opinion, is that the twelve men were being told that they could go out among people that hated them and speak their message without fear that they would killed because God was protecting them.</p><p>I therefore paraphrase the requested section thusly: <i>“Nothing, no matter how small, is too trivial for God to concern Himself when He chooses.  You need not be afraid that you will be killed on your mission, because what I have told you to do is important and God will not permit anyone to harm so much as a hair on your head.”</i></p><p>There is obviously no conflict between this paraphrase and the idea that God did not know of the existence or the precise number of the righteous individuals in Sodom.  In fact, the entire section actually tends to support the concept of God’s attention to detail being variable, as there is the clear implication from the nature of the special and detailed assurances provided here that this is a very special task to which God intends to pay particularly close attention.  I find Team Calvin’s perspective to be a bizarrely literal one that transforms what are caring and perfectly clear instructions concerning a specific situation into an incoherent message inexplicably divided in half by an unrelated and tremendously important theological statement.  I assert that Team Calvin is reading the verses too literally because they are ignoring the clear and obvious Scriptural context and thereby leaping to unwarranted conclusions that violate other Biblical passages with contrary conclusions that are, unlike this one, entirely in line with their correct Scriptural context.</p><p>As I pointed out in TIA, based on the reasoning exhibited here, the Calvinist would be forced to argue that Hercule Poirot is omniscient on the basis of his direct claim to “know everything” at the end of pretty much every book. When contradicted, the Calvinist could then indulge in the customary Calvinist theatrics, wondering if I was calling Poirot a liar or if I was being dishonest due to my assertion that Poirot not only does not know everything, but is not even claiming to do so despite his direct statement to the apparent contrary.  My response, of course, would be that the book was a murder mystery, and therefore the context of “knowing everything” was clearly limited to “knowing who the murderer is and how he committed the murder.”  This conclusion would be conclusively supported by the fact that Poirot’s subsequent address to his audience dealt solely with those murder-related issues, and not the average airspeed velocity of an unladen African swallow in flight, the number of acorns shed by oak trees in the state of Minnesota in 1985, or the victor of the Sino-Turkish War of 2185.  This is not a case of <b>x = not x</b>, but rather, <b>x ⊂ X</b>.</p><p>In exactly the same way, the swallows and hairs references apply specifically and solely to a singular historical event rather than to the fundamental nature of God’s relationship with Man and Creation.  The strength of my conclusion is strongly supported by comparing the passage in Matthew, where “two sparrows sold for a penny”, to the related one in Luke, in which it is written that “five sparrows sold for two pennies”.  Now we can certainly take the Calvinist’s literal approach and conclude that although He is paying very close attention to every little detail, God’s mathematical abilities are limited in a manner similar to those of the rabbits of <i>Watership Down</i>, but I suggest that would be absurd.  Even a child is capable of recognizing that 0.5 does not equal 0.4 and a Doctrine of Divine Innumeracy would raise some very serious questions about the potential significance of unreliable hair-numbering, among other things.  What we should do instead is read the quoted verses in their correct historical context and realize that there is no special significance, theological or otherwise, to the comments about the sparrows except in that they illustrate God’s particular concern for Jesus’s disciples on their historic mission and His promises concerning their safety on it.</p><p>The trivial, but material difference concerning the reported price of sparrows is a reminder that the Bible is the Word of God <i>as revealed through the flawed and imperfectly reliable mechanism of human transmission</i>, and that attempting to read Scripture by means of detailed exegesis as if it were some sort of perfect divine code is not only doomed to failure, but will reliably produce misleading results that are contrary to the plain meaning of the passages examined.</p></div>",
  "content_text": "The second question devised by Team Calvin and my response to it:\nBB. Matthew 10:29-31\n“Are not two sparrows sold for a penny? And not one of them will fall to the ground without your Father’s will. But even the hairs of your head are all numbered. Fear not, therefore; you are of more value than many sparrows.”\nIf God indeed didn’t know of Israel’s suffering in Egypt for 400 years, and if He indeed didn’t know how many righteous men were in Sodom, then what do these verses mean? If they are a metaphor or poetry, then a metaphor or poetry signifying what? Please write a paraphrase of the passage such that it helps the reader understand how it doesn’t actually say that God watches the earth to the detail of each hair of one of his own or one sparrow, since such detail would conflict with God not even knowing of the existence of the person in Sodom.\nIt’s not exactly a surprise to see an appeal to this verse.  And while it might look initially persuasive, as is so often the case, the superficially convincing Calvinist reading becomes significantly less sustainable when it is viewed in the proper Scriptural context.  As I have remarked previously, the Calvinist case tends to be heavily based on verses taken out of their specific context and applied to a general case that was never intended and does not reasonably apply. I believe that is precisely the situation here, so let us consider what is the proper Scriptural context of Matthew 10:29-31. In order to correctly establish that context, I quote this excerpt from the preceding section:\nThese twelve Jesus sent out with the following instructions: “Do not go among the Gentiles or enter any town of the Samaritans. Go rather to the lost sheep of Israel. As you go, proclaim this message: ‘The kingdom of heaven has come near.’ Heal the sick, raise the dead, cleanse those who have leprosy, drive out demons. Freely you have received; freely give.  “Do not get any gold or silver or copper to take with you in your belts— no bag for the journey or extra shirt or sandals or a staff, for the worker is worth his keep. Whatever town or village you enter, search there for some worthy person and stay at their house until you leave. As you enter the home, give it your greeting. If the home is deserving, let your peace rest on it; if it is not, let your peace return to you. If anyone will not welcome you or listen to your words, leave that home or town and shake the dust off your feet. Truly I tell you, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town.\n– Matthew 10:5-15\nIn other words, the context is the specific instructions to the twelve disciples named in the preceding verses with regards to an important mission to the Jews of Israel during Jesus Christ’s ministry.  It is clearly erroneous to argue that any of the verses in this section are intended to be applied broadly and literally to all Christians in all times, unless one is also willing to insist that Christians should avoid going among the Gentiles, refuse to utilize hotels, and anticipate being arrested and flogged in a synagogue one day.  So, now that it is clear that the context of this section consists of detailed historical instructions to a small group of specified people, let us examine the disputed section in its entirety, as it actually begins one verse before the citation provided.\nDo not be afraid of those who kill the body but cannot kill the soul. Rather, be afraid of the One who can destroy both soul and body in hell. Are not two sparrows sold for a penny? Yet not one of them will fall to the ground outside your Father’s care.  And even the very hairs of your head are all numbered. So don’t be afraid; you are worth more than many sparrows.\n– Matthew 10:28-31\nRead in context, it is readily apparent that this is not any sort of theological revelation about the extent of God’s knowledge, it is simply a promise that the twelve disciples being sent out to the Jews, not to the Gentiles or the Samaritans, are under God’s particular protection during the course of their mission.  The reference to the sparrows are nothing more than a rhetorical means of establishing the relative importance of the disciples to God and the reference to the hairs of the head being numbered is simply a way of saying that God would not permit them to be harmed.  What the verse means, in my opinion, is that the twelve men were being told that they could go out among people that hated them and speak their message without fear that they would killed because God was protecting them.\nI therefore paraphrase the requested section thusly:\n“Nothing, no matter how small, is too trivial for God to concern Himself when He chooses.  You need not be afraid that you will be killed on your mission, because what I have told you to do is important and God will not permit anyone to harm so much as a hair on your head.”\nThere is obviously no conflict between this paraphrase and the idea that God did not know of the existence or the precise number of the righteous individuals in Sodom.  In fact, the entire section actually tends to support the concept of God’s attention to detail being variable, as there is the clear implication from the nature of the special and detailed assurances provided here that this is a very special task to which God intends to pay particularly close attention.  I find Team Calvin’s perspective to be a bizarrely literal one that transforms what are caring and perfectly clear instructions concerning a specific situation into an incoherent message inexplicably divided in half by an unrelated and tremendously important theological statement.  I assert that Team Calvin is reading the verses too literally because they are ignoring the clear and obvious Scriptural context and thereby leaping to unwarranted conclusions that violate other Biblical passages with contrary conclusions that are, unlike this one, entirely in line with their correct Scriptural context.\nAs I pointed out in TIA, based on the reasoning exhibited here, the Calvinist would be forced to argue that Hercule Poirot is omniscient on the basis of his direct claim to “know everything” at the end of pretty much every book. When contradicted, the Calvinist could then indulge in the customary Calvinist theatrics, wondering if I was calling Poirot a liar or if I was being dishonest due to my assertion that Poirot not only does not know everything, but is not even claiming to do so despite his direct statement to the apparent contrary.  My response, of course, would be that the book was a murder mystery, and therefore the context of “knowing everything” was clearly limited to “knowing who the murderer is and how he committed the murder.”  This conclusion would be conclusively supported by the fact that Poirot’s subsequent address to his audience dealt solely with those murder-related issues, and not the average airspeed velocity of an unladen African swallow in flight, the number of acorns shed by oak trees in the state of Minnesota in 1985, or the victor of the Sino-Turkish War of 2185.  This is not a case of\nx = not x\n, but rather,\nx ⊂ X\n.\nIn exactly the same way, the swallows and hairs references apply specifically and solely to a singular historical event rather than to the fundamental nature of God’s relationship with Man and Creation.  The strength of my conclusion is strongly supported by comparing the passage in Matthew, where “two sparrows sold for a penny”, to the related one in Luke, in which it is written that “five sparrows sold for two pennies”.  Now we can certainly take the Calvinist’s literal approach and conclude that although He is paying very close attention to every little detail, God’s mathematical abilities are limited in a manner similar to those of the rabbits of\nWatership Down\n, but I suggest that would be absurd.  Even a child is capable of recognizing that 0.5 does not equal 0.4 and a Doctrine of Divine Innumeracy would raise some very serious questions about the potential significance of unreliable hair-numbering, among other things.  What we should do instead is read the quoted verses in their correct historical context and realize that there is no special significance, theological or otherwise, to the comments about the sparrows except in that they illustrate God’s particular concern for Jesus’s disciples on their historic mission and His promises concerning their safety on it.\nThe trivial, but material difference concerning the reported price of sparrows is a reminder that the Bible is the Word of God\nas revealed through the flawed and imperfectly reliable mechanism of human transmission\n, and that attempting to read Scripture by means of detailed exegesis as if it were some sort of perfect divine code is not only doomed to failure, but will reliably produce misleading results that are contrary to the plain meaning of the passages examined.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-28T14:00:00+00:00"
}