{
  "url": "https://voxday.net/2012/02/09/there-is-still-no-global-warming/",
  "scraped_at": "2025-12-14T04:46:47.906784",
  "title": "There is still no global warming",
  "date_display": "February 9, 2012",
  "date_iso": "2012-02-09T09:29:00+00:00",
  "date_from_url": "2012-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I hope the readers here will never, ever forget <a href=\"http://www.guardian.co.uk/environment/2012/feb/08/glaciers-mountains?intcmp=122\">how the AGW/CC story has played out</a>, especially the next time that the usual suspects start babbling about another “scientific consensus”.</p><blockquote><p>The world’s greatest snow-capped peaks, which run in a chain from the Himalayas to Tian Shan on the border of China and Kyrgyzstan, have lost no ice over the last decade, new research shows.  The discovery has stunned scientists, who had believed that around 50bn tonnes of meltwater were being shed each year and not being replaced by new snowfall.</p><p>The study is the first to survey all the world’s icecaps and glaciers and was made possible by the use of satellite data. Overall, the contribution of melting ice outside the two largest caps – Greenland and Antarctica – is much less then previously estimated, with the lack of ice loss in the Himalayas and the other high peaks of Asia responsible for most of the discrepancy.</p></blockquote><p>I hope you will also remember this the next time that critics complain that I think I am smarter and more likely to be correct about a scientific matter than the scientists who actually specialize in the subject.  How can I possibly assert that I am correct when all the experts say otherwise?  Because, as has been chronicled in some detail, I was the last time.  And the time before that.  And the time before that….</p><p>What people often tend to forget is that scientists are people.  And while one may not have the wherewithal to examine the actual scientific experiments or assess the relevant facts, one always has the ability to observe the behavior of the individuals citing them as evidence.  There are a plethora of indications that an individual is not telling the straightforward truth, be it in person or in print.  An ability to read those signs is all that is required to recognize when scientists are attempting to skate on their perceived authority rather than on any actual science, in which case one can always safely conclude that their claims are false.  Observing the behavioral patterns was how I was able to correctly conclude that Man is not causing global warming because there is no global warming.</p><p>Scientists spend an awful lot of time being stunned because they are some of the most naive, credulous, and easily manipulated beings on the planet.  That’s why they tend to inordinately fall for every nonsensical philosophical and political ideology that crosses their paths.  The average reader of <i>The National Enquirer</i> probably has a better and more-developed sense of skepticism than the average scientist.</p><p>UPDATE – Even some of the former champions of global warming are now turning <a href=\"http://blogs.telegraph.co.uk/news/jamesdelingpole/100135592/germanys-george-monbiot-turns-climate-sceptic/\">against the fake science</a>.</p><blockquote><p>One of the fathers of Germany’s modern green movement, Professor Dr. Fritz Vahrenholt, a social democrat and green activist, decided to author a climate science skeptical book together with geologist/paleontologist Dr. Sebastian Lüning. Vahrenholt’s skepticism started when he was asked to review an IPCC report on renewable energy. He found hundreds of errors. When he pointed them out, IPCC officials simply brushed them aside. Stunned, he asked himself, “Is this the way they approached the climate assessment reports?”</p></blockquote></div>",
  "content_text": "I hope the readers here will never, ever forget\nhow the AGW/CC story has played out\n, especially the next time that the usual suspects start babbling about another “scientific consensus”.\nThe world’s greatest snow-capped peaks, which run in a chain from the Himalayas to Tian Shan on the border of China and Kyrgyzstan, have lost no ice over the last decade, new research shows.  The discovery has stunned scientists, who had believed that around 50bn tonnes of meltwater were being shed each year and not being replaced by new snowfall.\nThe study is the first to survey all the world’s icecaps and glaciers and was made possible by the use of satellite data. Overall, the contribution of melting ice outside the two largest caps – Greenland and Antarctica – is much less then previously estimated, with the lack of ice loss in the Himalayas and the other high peaks of Asia responsible for most of the discrepancy.\nI hope you will also remember this the next time that critics complain that I think I am smarter and more likely to be correct about a scientific matter than the scientists who actually specialize in the subject.  How can I possibly assert that I am correct when all the experts say otherwise?  Because, as has been chronicled in some detail, I was the last time.  And the time before that.  And the time before that….\nWhat people often tend to forget is that scientists are people.  And while one may not have the wherewithal to examine the actual scientific experiments or assess the relevant facts, one always has the ability to observe the behavior of the individuals citing them as evidence.  There are a plethora of indications that an individual is not telling the straightforward truth, be it in person or in print.  An ability to read those signs is all that is required to recognize when scientists are attempting to skate on their perceived authority rather than on any actual science, in which case one can always safely conclude that their claims are false.  Observing the behavioral patterns was how I was able to correctly conclude that Man is not causing global warming because there is no global warming.\nScientists spend an awful lot of time being stunned because they are some of the most naive, credulous, and easily manipulated beings on the planet.  That’s why they tend to inordinately fall for every nonsensical philosophical and political ideology that crosses their paths.  The average reader of\nThe National Enquirer\nprobably has a better and more-developed sense of skepticism than the average scientist.\nUPDATE – Even some of the former champions of global warming are now turning\nagainst the fake science\n.\nOne of the fathers of Germany’s modern green movement, Professor Dr. Fritz Vahrenholt, a social democrat and green activist, decided to author a climate science skeptical book together with geologist/paleontologist Dr. Sebastian Lüning. Vahrenholt’s skepticism started when he was asked to review an IPCC report on renewable energy. He found hundreds of errors. When he pointed them out, IPCC officials simply brushed them aside. Stunned, he asked himself, “Is this the way they approached the climate assessment reports?”",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-09T09:29:00+00:00"
}