{
  "url": "https://voxday.net/2012/02/18/why-do-you-believe/",
  "scraped_at": "2025-12-14T04:47:32.095067",
  "title": "Why do you believe?",
  "date_display": "February 18, 2012",
  "date_iso": "2012-02-18T21:26:00+00:00",
  "date_from_url": "2012-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Invictus <a href=\"http://www.inmalafide.com/blog/2012/02/18/why-do-you-believe/\">asks the question</a> at In Mala Fide:</p><blockquote><p>What beliefs do you have and why? Let’s start with religion. I think it’s safe to say that the majority of the world’s population was brought up in some form of religious community. If that’s you, do you still subscribe to those beliefs? If so, your reasoning should be more than just “That’s how I was raised.” As a man, able to reason and make decisions for yourself, you should have a deeper rationalization. If you’re Christian, why do you believe in God? Jesus as your savior? Is it because the Bible says so? Have you ever studied the origins of the Bible or how it was assembled by just a small group of men who basically picked what they thought should be included? What about Jesus? Is there any historical evidence that he actually existed? What about eyewitness accounts (the Gospels are hearsay at best)?<br> Advertisement</br></p><p>If these questions have you doubting your beliefs, you may have some soul-searching to do. Do some research. Find out the facts. If you’re still standing firm, you might just be stubborn and ignorant, or you might have other deeper reasons. Maybe you’ve experienced first-hand a powerful interaction with God or Jesus. Maybe you’ve witnessed a miracle or a prayer that was answered with no other explanation but God. If so, I both respect and envy you.</p></blockquote><p>Since I’ve answered this question concerning why I believe in the Lord Jesus Christ before, I’ll respond with <a href=\"http://www.milobookclub.com/2009/09/22/letter-to-common-sense-atheism-i/\">an excerpt from one of my letters</a> to Luke of Common Sense Atheism:</p><p>Why am I a Christian? Because I believe in evil. I believe in objective, material, tangible evil that insensibly envelops every single one of us sooner or later. I believe in the fallen nature of Man, and I am aware that there is no shortage of evidence, scientific, testimonial, documentary, and archeological, to demonstrate that no individual is perfect or even perfectible by the moral standards described in the Bible. I am a Christian because I believe that Jesus Christ is the only means of freeing Man from the grip of that evil. God may not be falsifiable, but Christianity definitely is, and it has never been falsified. The only philosophical problem of evil that could ever trouble the rational Christian is its absence; to the extent that evil can be said to exist, it proves not only the validity of Christianity but its necessity as well. The fact that we live in a world of pain, suffering, injustice, and cruelty is not evidence of God’s nonexistence or maleficence, it is exactly the worldview that is described in the Bible. In my own experience and observations, I find that worldview to be far more accurate than any other, including the shiny science fiction utopianism of the secular humanists.</p><p>I don’t concern myself much, if at all, with the conventional extra-Biblical dogma that you describe and in which many Christians believe. I am dubious about the concept of the Trinity as it is usually described, do not await an eschatological Rapture, have no problem admitting that the moral commandments of God are arbitrary, and readily agree that the distinction between the eternally saved from the eternally damned appears to be more than a little unfair from the human perspective. On the other hand, I know that evil exists. I have seen it, I have experienced it, I have committed it, and I have loved it. I also know the transforming power that Jesus Christ can exercise to free an individual from evils both large and small because I have seen it in the lives of others and I have felt it in my own life. Now, ever since St. Augustine wrote his Confessions, it has been customary for Christians to exaggerate their sinful pasts; Augustine was hardly the Caligula that he portrayed himself to be. I find dramatic personal histories to be tiresome in the extreme, so I won’t say more except to note that as an agnostic, I enjoyed a sufficient amount of the hedonistic best that the world has to offer across a broad range of interesting and pleasurable experiences, only to learn that none of it was ever enough. It may amuse you to learn that one girl who knew me only before I was a Christian happened to learn about <i>The Irrational Atheist</i> and wrote to me to express her shock: “The fact that you wrote this book proves there is a God.”</p><p>And one with a sense of humor, no less. Now, there’s no reason this would mean anything to you or anyone else who was not acquainted with me before. But it meant something to that woman, just as an observable transformation in one of my close friend’s lives made a distinct impression on me.</p><p>I certainly do not deny the experiences or revelations of those who subscribe to other religions. I merely question the specific interpretation ascribed to them by those who lived through or received them. After all, the Bible informs us that there are other gods and that those gods are capable of providing such things at their discretion. Among other things, I studied East Asia at university and have spent a fair amount of time reading the sacred texts of various religions, including a few fairly obscure ones. I have yet to encounter one expressing a religious perspective that can be legitimately confused with the Christian one, nor, in my opinion, do any of these alternative perspectives describe the observable material world as I have experienced it as well as the Christian one does. I think it is astonishing that an ancient Middle Eastern text is frequently a better guide to predicting human behavior than the very best models that the social sciences have produced despite having an advantage of two thousand more years of human experience upon which to draw.</p><p>I suspect that unless you can understand why the first book in C.S. Lewis’s Space Trilogy is called <i>Out of the Silent Planet</i>, unless you fully grasp the implications of the temptation of Jesus in the desert, you cannot possibly understand much about Christianity or the degree of difference between it and other religions. Fortunately for many Christians, intellectual understanding isn’t the metric upon which salvation is based.</p></div>",
  "content_text": "Invictus\nasks the question\nat In Mala Fide:\nWhat beliefs do you have and why? Let’s start with religion. I think it’s safe to say that the majority of the world’s population was brought up in some form of religious community. If that’s you, do you still subscribe to those beliefs? If so, your reasoning should be more than just “That’s how I was raised.” As a man, able to reason and make decisions for yourself, you should have a deeper rationalization. If you’re Christian, why do you believe in God? Jesus as your savior? Is it because the Bible says so? Have you ever studied the origins of the Bible or how it was assembled by just a small group of men who basically picked what they thought should be included? What about Jesus? Is there any historical evidence that he actually existed? What about eyewitness accounts (the Gospels are hearsay at best)?\nAdvertisement\nIf these questions have you doubting your beliefs, you may have some soul-searching to do. Do some research. Find out the facts. If you’re still standing firm, you might just be stubborn and ignorant, or you might have other deeper reasons. Maybe you’ve experienced first-hand a powerful interaction with God or Jesus. Maybe you’ve witnessed a miracle or a prayer that was answered with no other explanation but God. If so, I both respect and envy you.\nSince I’ve answered this question concerning why I believe in the Lord Jesus Christ before, I’ll respond with\nan excerpt from one of my letters\nto Luke of Common Sense Atheism:\nWhy am I a Christian? Because I believe in evil. I believe in objective, material, tangible evil that insensibly envelops every single one of us sooner or later. I believe in the fallen nature of Man, and I am aware that there is no shortage of evidence, scientific, testimonial, documentary, and archeological, to demonstrate that no individual is perfect or even perfectible by the moral standards described in the Bible. I am a Christian because I believe that Jesus Christ is the only means of freeing Man from the grip of that evil. God may not be falsifiable, but Christianity definitely is, and it has never been falsified. The only philosophical problem of evil that could ever trouble the rational Christian is its absence; to the extent that evil can be said to exist, it proves not only the validity of Christianity but its necessity as well. The fact that we live in a world of pain, suffering, injustice, and cruelty is not evidence of God’s nonexistence or maleficence, it is exactly the worldview that is described in the Bible. In my own experience and observations, I find that worldview to be far more accurate than any other, including the shiny science fiction utopianism of the secular humanists.\nI don’t concern myself much, if at all, with the conventional extra-Biblical dogma that you describe and in which many Christians believe. I am dubious about the concept of the Trinity as it is usually described, do not await an eschatological Rapture, have no problem admitting that the moral commandments of God are arbitrary, and readily agree that the distinction between the eternally saved from the eternally damned appears to be more than a little unfair from the human perspective. On the other hand, I know that evil exists. I have seen it, I have experienced it, I have committed it, and I have loved it. I also know the transforming power that Jesus Christ can exercise to free an individual from evils both large and small because I have seen it in the lives of others and I have felt it in my own life. Now, ever since St. Augustine wrote his Confessions, it has been customary for Christians to exaggerate their sinful pasts; Augustine was hardly the Caligula that he portrayed himself to be. I find dramatic personal histories to be tiresome in the extreme, so I won’t say more except to note that as an agnostic, I enjoyed a sufficient amount of the hedonistic best that the world has to offer across a broad range of interesting and pleasurable experiences, only to learn that none of it was ever enough. It may amuse you to learn that one girl who knew me only before I was a Christian happened to learn about\nThe Irrational Atheist\nand wrote to me to express her shock: “The fact that you wrote this book proves there is a God.”\nAnd one with a sense of humor, no less. Now, there’s no reason this would mean anything to you or anyone else who was not acquainted with me before. But it meant something to that woman, just as an observable transformation in one of my close friend’s lives made a distinct impression on me.\nI certainly do not deny the experiences or revelations of those who subscribe to other religions. I merely question the specific interpretation ascribed to them by those who lived through or received them. After all, the Bible informs us that there are other gods and that those gods are capable of providing such things at their discretion. Among other things, I studied East Asia at university and have spent a fair amount of time reading the sacred texts of various religions, including a few fairly obscure ones. I have yet to encounter one expressing a religious perspective that can be legitimately confused with the Christian one, nor, in my opinion, do any of these alternative perspectives describe the observable material world as I have experienced it as well as the Christian one does. I think it is astonishing that an ancient Middle Eastern text is frequently a better guide to predicting human behavior than the very best models that the social sciences have produced despite having an advantage of two thousand more years of human experience upon which to draw.\nI suspect that unless you can understand why the first book in C.S. Lewis’s Space Trilogy is called\nOut of the Silent Planet\n, unless you fully grasp the implications of the temptation of Jesus in the desert, you cannot possibly understand much about Christianity or the degree of difference between it and other religions. Fortunately for many Christians, intellectual understanding isn’t the metric upon which salvation is based.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-02-18T21:26:00+00:00"
}