{
  "url": "https://voxday.net/2018/12/09/12-real-rules-for-life/",
  "scraped_at": "2025-12-20T05:20:10.123337",
  "title": "12 REAL Rules for Life",
  "date_display": "December 9, 2018",
  "date_iso": "2018-12-09T14:26:15+00:00",
  "date_from_url": "2018-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Appendix C of <i><b><a href=\"https://www.amazon.com/Jordanetics-Journey-Humanitys-Greatest-Thinker-ebook/dp/B07JY9XV38/\">Jordanetics</a></b>.</i><br><i><br/></i><i>All is vanity. What is it that we must bestow our care and diligence upon? Even upon this only: that our minds and wills be just; that our actions be charitable; that our speech be never deceitful, and that our understanding be not subject to error; that our inclination be always set to embrace whatsoever shall happen unto us.</i><br>—Marcus Aurelius</br></br></p><p> After a modicum of reflection, these are my suggestions drawn from 50 years of various successes and failures.</p><ol><li><b>Embrace the iron.</b> Lifting weights will not only help you stand up straight, it will make you stronger, healthier, and more confident. The iron teaches the weak to be strong and it teaches the strong to be humble.</li><li><b>Take the wheel.</b> You are the ultimate architect of your own decisions and actions. Even if you were dealt a bad card by life, even if your genetics are inferior, your upbringing was terrible, and your instincts are suboptimal, you are the only one who can improve yourself. You are driving and only you can determine the destination.</li><li><b>Be the friend that you want to have. </b>Smiles are contagious. Loyalty inspires loyalty. Stand by those who stand by you. Give every friend who fails you a second chance. Only abandon those who have repeatedly proven they cannot be trusted and do not wish you well.</li><li><b>Envision perfection and pursue excellence.</b> You will never achieve perfection. But if you envision it and you strive for it, you may well achieve success, and perhaps even excellence.</li><li><b>Put a ring on it.</b> Marriage is the manifestation of love. Children are the manifestation of hope. Raising a family to serve as the foundation of future generations is how Man rebels against an uncaring universe, a fallen world, and the spirits of despair and destruction. Yes, there are real risks, especially in the current social and legal environment. But they are well worth taking nevertheless.</li><li><b>Set your face against evil.</b> You will encounter evil within and evil without on a daily basis. Stand against all of it, without fear, without hesitation, and without remorse. And when you fail, when you give into temptation, when you are defeated, regroup, repent, and rise again.</li><li><b>Do what is right.</b> Learn to listen to the still, small voice of conscience. Do what you know to be right, not what you can rationalize, justify, or excuse. If you have to talk yourself into something, then you probably already know in your heart of hearts that you are doing the wrong thing.</li><li><b>Tell the truth in kindness.</b> It is too hard and too exhausting to spend all your mental energies trying to keep track of an ever-growing multitude of exaggerations, false narratives, self-serving spins, and outright lies. Just tell the truth, as you best understand it, without taking pride in it or using it to hurt others.</li><li><b>Learn the easy way. </b>You will always encounter those who are stronger, smarter, and more successful than you are. Rather than envying them or attempting to tear them down to make yourself feel better, do your best to learn from them and apply those lessons to your own life. It is considerably easier and more efficient to learn from the mistakes of others than it is to make all of those same mistakes yourself.</li><li><b>Believe the mirror.</b> The most reliably self-destructive mistake you can make is to lie to yourself about who, what, and where you are, because doing so precludes any real self-improvement. Be ruthless with your self-assessments, without wallowing in self-pity or despair.</li><li><b>Get back on the horse.</b> Perseverance is one of the most important skills a man can develop. There is absolutely no substitute for the confidence and the courage that comes from the certain knowledge that you will get up again after an opponent, or life, knocks you down.</li><li><b>Find a best friend.</b> Dogs teach us many things, perhaps the most important of which is what unconditional love is. No matter how rich and successful a man may be, there is no life that the addition of a dog would not considerably improve. And yes, all dogs go to Heaven, obviously, because Heaven would not be paradise without them.</li></ol></div>",
  "content_text": "From Appendix C of\nJordanetics\n.\nAll is vanity. What is it that we must bestow our care and diligence upon? Even upon this only: that our minds and wills be just; that our actions be charitable; that our speech be never deceitful, and that our understanding be not subject to error; that our inclination be always set to embrace whatsoever shall happen unto us.\n—Marcus Aurelius\nAfter a modicum of reflection, these are my suggestions drawn from 50 years of various successes and failures.\nEmbrace the iron.\nLifting weights will not only help you stand up straight, it will make you stronger, healthier, and more confident. The iron teaches the weak to be strong and it teaches the strong to be humble.\nTake the wheel.\nYou are the ultimate architect of your own decisions and actions. Even if you were dealt a bad card by life, even if your genetics are inferior, your upbringing was terrible, and your instincts are suboptimal, you are the only one who can improve yourself. You are driving and only you can determine the destination.\nBe the friend that you want to have.\nSmiles are contagious. Loyalty inspires loyalty. Stand by those who stand by you. Give every friend who fails you a second chance. Only abandon those who have repeatedly proven they cannot be trusted and do not wish you well.\nEnvision perfection and pursue excellence.\nYou will never achieve perfection. But if you envision it and you strive for it, you may well achieve success, and perhaps even excellence.\nPut a ring on it.\nMarriage is the manifestation of love. Children are the manifestation of hope. Raising a family to serve as the foundation of future generations is how Man rebels against an uncaring universe, a fallen world, and the spirits of despair and destruction. Yes, there are real risks, especially in the current social and legal environment. But they are well worth taking nevertheless.\nSet your face against evil.\nYou will encounter evil within and evil without on a daily basis. Stand against all of it, without fear, without hesitation, and without remorse. And when you fail, when you give into temptation, when you are defeated, regroup, repent, and rise again.\nDo what is right.\nLearn to listen to the still, small voice of conscience. Do what you know to be right, not what you can rationalize, justify, or excuse. If you have to talk yourself into something, then you probably already know in your heart of hearts that you are doing the wrong thing.\nTell the truth in kindness.\nIt is too hard and too exhausting to spend all your mental energies trying to keep track of an ever-growing multitude of exaggerations, false narratives, self-serving spins, and outright lies. Just tell the truth, as you best understand it, without taking pride in it or using it to hurt others.\nLearn the easy way.\nYou will always encounter those who are stronger, smarter, and more successful than you are. Rather than envying them or attempting to tear them down to make yourself feel better, do your best to learn from them and apply those lessons to your own life. It is considerably easier and more efficient to learn from the mistakes of others than it is to make all of those same mistakes yourself.\nBelieve the mirror.\nThe most reliably self-destructive mistake you can make is to lie to yourself about who, what, and where you are, because doing so precludes any real self-improvement. Be ruthless with your self-assessments, without wallowing in self-pity or despair.\nGet back on the horse.\nPerseverance is one of the most important skills a man can develop. There is absolutely no substitute for the confidence and the courage that comes from the certain knowledge that you will get up again after an opponent, or life, knocks you down.\nFind a best friend.\nDogs teach us many things, perhaps the most important of which is what unconditional love is. No matter how rich and successful a man may be, there is no life that the addition of a dog would not considerably improve. And yes, all dogs go to Heaven, obviously, because Heaven would not be paradise without them.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-09T14:26:15+00:00"
}