{
  "url": "https://voxday.net/2018/12/17/a-justifiable-homicide/",
  "scraped_at": "2025-12-20T05:21:21.389853",
  "title": "A justifiable homicide",
  "date_display": "December 17, 2018",
  "date_iso": "2018-12-17T13:25:42+00:00",
  "date_from_url": "2018-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jon Podhoretz whines about <a href=\"https://www.commentarymagazine.com/politics-ideas/murder-weekly-standard/\">the long-overdue shuttering of a magazine</a> that no one wanted, no one bought, never made any money, and was dedicated to the destruction of traditional America and the oppression of American Posterity.</p><blockquote><p>The Weekly Standard will be no more. There is no real reason we are witnessing the magazine’s demise other than deep pettiness and a personal desire for bureaucratic revenge on the part of a penny-ante Machiavellian who works for its parent company.</p><p>There would at least be a larger meaning to the Standard’s end if it were being killed because it was hostile to Donald Trump. But I do not believe that is the case. Rather, I believe the fissures in the conservative movement and the Republican party that have opened up since Trump’s rise provided the company man with a convenient argument to make to the corporation’s owner, Philip Anschutz, that the company could perhaps harvest the Standard’s subscriber-base riches and then be done with it.</p><p>That this is an entirely hostile act is proved by the fact that he and Anschutz have refused to sell the Standard because they want to claim its circulation for another property of theirs. This is without precedent in my experience in publishing, and I’ve been a family observer of and active participant in the magazine business for half a century.</p><p>The creation of the Weekly Standard was my proudest professional moment. When Bill Kristol and I conceived the magazine at the end of 1994, our purpose was to create a publication that would help guide and keep honest the hard-charging Republican party that had scored its stunning lopsided victory over Bill Clinton’s Democrats. This putative magazine would not cheerlead for Newt Gingrich’s Republicans, but instead represent the best thinking about how to lead the country through a new conservative era. We were criticized for not being part of the team from the get-go. Indeed, after the first issue came out in September 1995, a wag at a weekly meeting in Washington chaired by Grover Norquist handed out a parody of the Standard based on the precept that we had already gone off the reservation and weren’t being properly supportive of the Gingrich era.</p></blockquote><p>Note in particular how their purpose from the very start “was to create a publication that would help guide and keep honest the hard-charging Republican party.”</p><p>In other words, <i>The Weekly Standard</i> had precisely the same goals as Jordan Peterson and Ben Shapiro, which is to gatekeep the American Right and prevent it from becoming too Christian, too nationalist, and too devoted to American interests.</p><p>Good riddance.</p></div>",
  "content_text": "Jon Podhoretz whines about\nthe long-overdue shuttering of a magazine\nthat no one wanted, no one bought, never made any money, and was dedicated to the destruction of traditional America and the oppression of American Posterity.\nThe Weekly Standard will be no more. There is no real reason we are witnessing the magazine’s demise other than deep pettiness and a personal desire for bureaucratic revenge on the part of a penny-ante Machiavellian who works for its parent company.\nThere would at least be a larger meaning to the Standard’s end if it were being killed because it was hostile to Donald Trump. But I do not believe that is the case. Rather, I believe the fissures in the conservative movement and the Republican party that have opened up since Trump’s rise provided the company man with a convenient argument to make to the corporation’s owner, Philip Anschutz, that the company could perhaps harvest the Standard’s subscriber-base riches and then be done with it.\nThat this is an entirely hostile act is proved by the fact that he and Anschutz have refused to sell the Standard because they want to claim its circulation for another property of theirs. This is without precedent in my experience in publishing, and I’ve been a family observer of and active participant in the magazine business for half a century.\nThe creation of the Weekly Standard was my proudest professional moment. When Bill Kristol and I conceived the magazine at the end of 1994, our purpose was to create a publication that would help guide and keep honest the hard-charging Republican party that had scored its stunning lopsided victory over Bill Clinton’s Democrats. This putative magazine would not cheerlead for Newt Gingrich’s Republicans, but instead represent the best thinking about how to lead the country through a new conservative era. We were criticized for not being part of the team from the get-go. Indeed, after the first issue came out in September 1995, a wag at a weekly meeting in Washington chaired by Grover Norquist handed out a parody of the Standard based on the precept that we had already gone off the reservation and weren’t being properly supportive of the Gingrich era.\nNote in particular how their purpose from the very start “was to create a publication that would help guide and keep honest the hard-charging Republican party.”\nIn other words,\nThe Weekly Standard\nhad precisely the same goals as Jordan Peterson and Ben Shapiro, which is to gatekeep the American Right and prevent it from becoming too Christian, too nationalist, and too devoted to American interests.\nGood riddance.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-17T13:25:42+00:00"
}