{
  "url": "https://voxday.net/2018/12/27/adventures-in-jordanetics/",
  "scraped_at": "2025-12-20T05:22:42.631203",
  "title": "Adventures in Jordanetics",
  "date_display": "December 27, 2018",
  "date_iso": "2018-12-27T01:36:50+00:00",
  "date_from_url": "2018-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fencing Bear is discovering that the only people more inclined to turn on badthinkers and thought criminals <a href=\"https://fencingbearatprayer.blogspot.com/2018/12/credo-ut-intelligam.html\">than academics</a> are Jordan Peterson cultists:</p><blockquote><p>It is difficult to describe the crisis I have been living through these past several weeks.</p><p>Short version: <i>Don’t call out the Devil if you aren’t ready to bout. </i></p><p>Alternate short version: <i>“Where is the wise? Where is the scribe? Where is the disputer of this world? Hath not God made foolish the wisdom of the world?”</i> —1 Corinthians 1:20</p><p>There has been much bitterness. There have been feelings of betrayal. There have been feelings of being lied to while watching people whom I thought were my supporters fall away.</p><p>Friends warn me about overreacting. At which I overreact.</p><p><i>“Academic freedom means nothing if the faculty do not stand up for it.”</i></p><p>I believed that. Someone whom I have trusted my entire academic career told me that. I still believe it—but do my colleagues?</p><p><i>“Any sufficiently advanced intelligence is indistinguishable from insanity.”</i></p><p>I heard someone say that recently on his livestream. Someone whom my friends tell me I should be wary of associating myself with because he has been called the same names I have over the past several years.</p><p>Three weeks ago I found this note tucked behind a drawing that I had posted up by my office door.</p><p><i>You are a white nationalist and a detriment to all forms of knowledge. Please resign, as your institution has and will continue to fail to condemn your actions.</i><br><i><br/></i><i>You are a violent and malicious threat to academia and to the future. Not only do you profess racist ideologies, you collude with all sorts of monstrous people who transform your otherwise out-dated and foolish forms of racism into something much worse.</i></br></p><p>I posted the letter on my social media and my friends got a good laugh out of it. I told my dean and chair about the letter, and the campus police sent an officer round that evening to take a statement from me. Colleagues from around the world wrote to me, expressing dismay that I should be receiving such missives.</p><p><i>And nothing happened.</i></p></blockquote><p>Sadly, she’s come under attack for her lack of faith in St. Jordan Peterson as well. On a not-entirely unrelated note, <a href=\"https://krauserpua.com/2018/12/23/126-jordanetics-vox-day-book-review/\">Nick Krauser reviews </a><i><a href=\"https://krauserpua.com/2018/12/23/126-jordanetics-vox-day-book-review/\">Jordanetics</a> </i>in his inimitable, hard-hitting style:</p><blockquote><p>How is it that Vox can achieve such a steady hit-rate and always be at the leading edge of the curve? His <i>Cuckservative </i>book came out before Trump won the Republican nomination. His take-down of Jordan Peterson came at the peak of his popularity when pretty much every right-winger I knew was riding the Canadian globalist’s nut-sack. Vox isn’t just outside the mainstream Overton Window, he’s perpetually outside the Alt-Right’s own Overton Window. So, how does he manage it?</p><p>Simple. He’s read history and philosophy. Modern retards raised on YouTube, Twitter and hyper-ventilating click-bait conservative bloggers have no sense of perspective. They think <i>Animal Farm</i> is a porno, Big Brother a TV show, and Franz Ferdinand an indie band. Those of you fortunate enough to get a real education are better able to spot the same old patterns reemerge.</p><p>There’s nothing new under the sun. It’s just old wine in new bottles.</p><p>The problem when first approaching Jordan Peterson is that he’s a muddled thinker, bullshitting speaker, and incompetent writer. That means to make sense of him you have to straighten out all the knots he himself has created. Reading <i>Jordanetics </i>reminded me of a philosophy lecture I took as a fresh-faced 18yr old scamp in a course called Rousseau and Marx. I asked the lecturer why he’d assigned the Past Masters summary books on those two black-hearted rogues rather than their original writings.</p><p><i>“Oh, they are terrible writers. It’ll take you forever to figure out what they are trying to say. Don’t bother. Just go to the summary books. Those are cleaned-up Rousseau and cleaned-up Marx.”</i></p><p>Cleaned-up? That’s how it feels reading <i>Jordanetics</i>. Vox has done JBP the favour of organising his muddled thoughts for him in order to get at the heart of his true meaning. Actually, it’s not doing JBP a favour at all because to explain what he says in clear terms is to expose him for the evil Satanic globalist fraud that he is. You see, JBP is a wannabe L. Ron Hubbard. He’s a mentally-ill, moral and physical coward, with a messiah complex. His role is to mislead you. There’s a fair chance that JBP was sexually molested by his own grandmother but that can’t be anything compared to the brutal rape Vox gives him in <i>Jordanetics</i>.</p><p>Vox’s parsing of JBP’s philosophy, as expressed in <i>Maps Of Meaning</i> and <i>12 Rules For Life</i>, is that JBP is preaching a post-Christian religion of Balance. JBP uses the terms Order and Chaos as proxies for Good and Evil, and his advice all leads towards a Jedi-like goal of achieving Balance between the two. The goal is not to fight and defeat Evil, but to assimilate it. Obviously that’s ridiculous.</p><p>Having read much of the Western canon, Vox is able to trace the intellectual inspiration of JBP to his roots which will surprise the average Peterson fanboy. Vox makes a strong case that JBP is knowingly drawing ideas from Carl Jung and…… Aleister Crowley. Yes, the bald-headed Satanist. He doesn’t just throw those names out as insults but rather draws the connection through exegesis of Peterson’s own written words and a comparison to the gnostics, pagans and Satanists who originated the ideas. Vox firmly believes JBP is <i>knowingly</i> evil, and I agree with him.</p></blockquote><p>There is more. Read the whole thing <a href=\"https://krauserpua.com/2018/12/23/126-jordanetics-vox-day-book-review/\">there</a>.</p></div>",
  "content_text": "Fencing Bear is discovering that the only people more inclined to turn on badthinkers and thought criminals\nthan academics\nare Jordan Peterson cultists:\nIt is difficult to describe the crisis I have been living through these past several weeks.\nShort version:\nDon’t call out the Devil if you aren’t ready to bout.\nAlternate short version:\n“Where is the wise? Where is the scribe? Where is the disputer of this world? Hath not God made foolish the wisdom of the world?”\n—1 Corinthians 1:20\nThere has been much bitterness. There have been feelings of betrayal. There have been feelings of being lied to while watching people whom I thought were my supporters fall away.\nFriends warn me about overreacting. At which I overreact.\n“Academic freedom means nothing if the faculty do not stand up for it.”\nI believed that. Someone whom I have trusted my entire academic career told me that. I still believe it—but do my colleagues?\n“Any sufficiently advanced intelligence is indistinguishable from insanity.”\nI heard someone say that recently on his livestream. Someone whom my friends tell me I should be wary of associating myself with because he has been called the same names I have over the past several years.\nThree weeks ago I found this note tucked behind a drawing that I had posted up by my office door.\nYou are a white nationalist and a detriment to all forms of knowledge. Please resign, as your institution has and will continue to fail to condemn your actions.\nYou are a violent and malicious threat to academia and to the future. Not only do you profess racist ideologies, you collude with all sorts of monstrous people who transform your otherwise out-dated and foolish forms of racism into something much worse.\nI posted the letter on my social media and my friends got a good laugh out of it. I told my dean and chair about the letter, and the campus police sent an officer round that evening to take a statement from me. Colleagues from around the world wrote to me, expressing dismay that I should be receiving such missives.\nAnd nothing happened.\nSadly, she’s come under attack for her lack of faith in St. Jordan Peterson as well. On a not-entirely unrelated note,\nNick Krauser reviews\nJordanetics\nin his inimitable, hard-hitting style:\nHow is it that Vox can achieve such a steady hit-rate and always be at the leading edge of the curve? His\nCuckservative\nbook came out before Trump won the Republican nomination. His take-down of Jordan Peterson came at the peak of his popularity when pretty much every right-winger I knew was riding the Canadian globalist’s nut-sack. Vox isn’t just outside the mainstream Overton Window, he’s perpetually outside the Alt-Right’s own Overton Window. So, how does he manage it?\nSimple. He’s read history and philosophy. Modern retards raised on YouTube, Twitter and hyper-ventilating click-bait conservative bloggers have no sense of perspective. They think\nAnimal Farm\nis a porno, Big Brother a TV show, and Franz Ferdinand an indie band. Those of you fortunate enough to get a real education are better able to spot the same old patterns reemerge.\nThere’s nothing new under the sun. It’s just old wine in new bottles.\nThe problem when first approaching Jordan Peterson is that he’s a muddled thinker, bullshitting speaker, and incompetent writer. That means to make sense of him you have to straighten out all the knots he himself has created. Reading\nJordanetics\nreminded me of a philosophy lecture I took as a fresh-faced 18yr old scamp in a course called Rousseau and Marx. I asked the lecturer why he’d assigned the Past Masters summary books on those two black-hearted rogues rather than their original writings.\n“Oh, they are terrible writers. It’ll take you forever to figure out what they are trying to say. Don’t bother. Just go to the summary books. Those are cleaned-up Rousseau and cleaned-up Marx.”\nCleaned-up? That’s how it feels reading\nJordanetics\n. Vox has done JBP the favour of organising his muddled thoughts for him in order to get at the heart of his true meaning. Actually, it’s not doing JBP a favour at all because to explain what he says in clear terms is to expose him for the evil Satanic globalist fraud that he is. You see, JBP is a wannabe L. Ron Hubbard. He’s a mentally-ill, moral and physical coward, with a messiah complex. His role is to mislead you. There’s a fair chance that JBP was sexually molested by his own grandmother but that can’t be anything compared to the brutal rape Vox gives him in\nJordanetics\n.\nVox’s parsing of JBP’s philosophy, as expressed in\nMaps Of Meaning\nand\n12 Rules For Life\n, is that JBP is preaching a post-Christian religion of Balance. JBP uses the terms Order and Chaos as proxies for Good and Evil, and his advice all leads towards a Jedi-like goal of achieving Balance between the two. The goal is not to fight and defeat Evil, but to assimilate it. Obviously that’s ridiculous.\nHaving read much of the Western canon, Vox is able to trace the intellectual inspiration of JBP to his roots which will surprise the average Peterson fanboy. Vox makes a strong case that JBP is knowingly drawing ideas from Carl Jung and…… Aleister Crowley. Yes, the bald-headed Satanist. He doesn’t just throw those names out as insults but rather draws the connection through exegesis of Peterson’s own written words and a comparison to the gnostics, pagans and Satanists who originated the ideas. Vox firmly believes JBP is\nknowingly\nevil, and I agree with him.\nThere is more. Read the whole thing\nthere\n.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-27T01:36:50+00:00"
}