{
  "url": "https://voxday.net/2018/12/18/amazon-devours-all/",
  "scraped_at": "2025-12-20T05:21:28.725111",
  "title": "Amazon devours all",
  "date_display": "December 18, 2018",
  "date_iso": "2018-12-18T12:47:00+00:00",
  "date_from_url": "2018-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A recent promotion within Amazon signals that <a href=\"https://www.recode.net/2018/11/29/18023132/amazon-brand-policy-changes-marketplace-control-one-vendor\">its Retail side has won out</a> over its erstwhile Marketplace mentality. An explanation of how that affects the bookselling world and Castalia House’s strategy for 2019 and beyond.</p><blockquote><p>Over the past few months, Amazon has applied intense pressure to consumer brands across different product categories — seizing more control over what, where and how they can sell their goods on the so-called everything store, these people say.</p><p>One apparent goal: To take more control over the price of goods on Amazon so the company can better compete with retailers. The power moves are also believed to be a prelude to a new internal system that Amazon has yet to launch called One Vendor. The new initiative will essentially funnel big brands and independent sellers alike through the same back-end system in a supposed effort to improve the uniformity of the shopping experience across Amazon on the public-facing side.</p><p>In the lead-up to that launch, this fall Amazon has been notifying brands that sell products in categories ranging from household consumables to fashion accessories that part of their business on Amazon would be shut down — with just 30 days notice.</p><p>“Amazon obsesses over the customer experience and your brand has opportunities for improvement that will be possible by transitioning your full business to Vendor Central,” read one email from Amazon to a brand. “As a result, we have made the decision to source your products for sale by Amazon only and your existing Seller Central account will be closed within 30 days of this email.”</p><p>Translation: Amazon is telling these brands that they can no longer sell directly to customers as an independent seller on the Amazon platform for third-party merchants known as the Amazon Marketplace. The advantages to selling on the Marketplace include the ability to control the sale price of the goods, run price promotions and get more data about how products are performing and who’s buying them.</p><p>Instead, the email is telling brands that they can only sell items to Amazon’s retail group at wholesale cost, and let Amazon act as the seller and determine the retail cost.</p><p>This policy is not completely new. For years, Amazon has had a policy that says if a brand sells its goods to retailers outside of Amazon and wants to also sell on Amazon, the company “expects” the brand “to give Amazon Retail the option to source those products at competitive terms for sale as Retail items only.” But it was not consistently followed — until now.</p><p>“The policy hasn’t changed but the enforcement is changing,” said Justin Leigh, a former Amazon product manager who for the last 10 years has run Ideoclick, a Seattle-based consultancy for brands that want to sell and advertise on Amazon.</p><p>An Amazon spokeswoman said the policy is intended to help reduce customer confusion.</p><p>But in addition to increased enforcement, an even bigger deal is a recent addition to the policy.</p><p>The new language not only bars some manufacturers and brands from selling their goods on the Amazon Marketplace if Amazon wants to sell the product itself — but also “their agents, licensees, and other representatives selling on their behalf.”</p></blockquote><p>What this means is that Amazon is increasingly seeking to control and sell its own content rather than serve as a middleman. That’s precisely why Kindle Select and Kindle Unlimited have been adopted, to change the structure of the ebook market as Amazon increasingly shifts the revenue split between Amazon and the author toward Amazon at the expense of the author.</p><p>In other words, now that Amazon has drained about as much of the revenue stream as it effectively can from the traditional publishers, it has no choice but to do the same to the independent publishers and the self-published authors if it is going to increase its sales. Because the overall market is not growing, the book market is a zero-sum game and Amazon cannot grow except at the expense of the ebook authors who in recent years have profited with Amazon at the expense of the traditional publishers.</p><p>This is why we are no longer participating in Kindle Select. And this is why it is going to be increasingly important for independent authors to either a) become part of the A9-favored Elect or b) find a way to succeed outside of Amazon. And while (a) is almost certainly the more profitable short-term move, it is not an option for most authors, and furthermore, requires the author to remain in the good graces of a moderately SJW-converged corporation, which is a dangerous place for anyone to be. While Amazon is considerably more professional and sane than Apple, Twitter, Patreon, and other more SJW-converged companies, it is very far from neutral.</p><p>How can I be so certain that the trend towards Retail and content control is inevitable? Because the individual who has driven the Retail side is now in charge of the whole shebang.</p><blockquote class=\"tr_bq\"><p>Earlier this year, Amazon made moves to consolidate much of the decision-making for its retail platform under a single leader, Senior Vice President Doug Herrington, who has spent nearly 14 years at the company. Herrington comes from the Amazon Retail side of the business, where Amazon sources products itself and acts as a seller. That, brand leaders and consultants say, has influenced recent moves.</p></blockquote><p>Now, there is nothing wrong with what Amazon is doing. This is just a business strategy and it can’t be compared to the deplatformings and civil wrongdoings of companies like Indiegogo. One can still work with Amazon, one simply can’t take the risk of working exclusively with them as we have for the past four years. That is why we will be selling all of our new audiobooks from the Arkhaven store and why we are removing almost all of our books from Kindle Select, including the comics. We expect to have all of them removed from the exclusive system by the end of February.</p><p>This is great news for those of you who prefer DRM-free epubs, as we now have <a href=\"https://arkhavencomics.com/product-tag/there-will-be-war/\">eight of the ten THERE WILL BE WAR books</a> available for sale on the Arkhaven store, including the newly available Volume II, Volume III, Volume VII, and Volume X. The books also come in Kindle-compatible MOBI format for those of you who prefer to read on your Kindle devices.</p><p>We hope Castalia ebook and audiobook fans will continue to migrate to our direct stores, as so many of our print book buyers have already. Even though we only began our print direct sales in March, and even though the direct sales will not be available in the UK, Europe, and Australia until sometime in 2019, ONE-THIRD of all our growing print sales now go through <a href=\"https://www.aerbook.com/store/castalia\">Castalia Books Direct</a>.  This is a tremendous strategic success. While Amazon is massively convenient and will always be an important retail outlet for us, it is vital for us to maintain our independence from it and it is those of you who buy our books that permit Castalia House, Arkhaven, and Dark Legion to do that.</p></div>",
  "content_text": "A recent promotion within Amazon signals that\nits Retail side has won out\nover its erstwhile Marketplace mentality. An explanation of how that affects the bookselling world and Castalia House’s strategy for 2019 and beyond.\nOver the past few months, Amazon has applied intense pressure to consumer brands across different product categories — seizing more control over what, where and how they can sell their goods on the so-called everything store, these people say.\nOne apparent goal: To take more control over the price of goods on Amazon so the company can better compete with retailers. The power moves are also believed to be a prelude to a new internal system that Amazon has yet to launch called One Vendor. The new initiative will essentially funnel big brands and independent sellers alike through the same back-end system in a supposed effort to improve the uniformity of the shopping experience across Amazon on the public-facing side.\nIn the lead-up to that launch, this fall Amazon has been notifying brands that sell products in categories ranging from household consumables to fashion accessories that part of their business on Amazon would be shut down — with just 30 days notice.\n“Amazon obsesses over the customer experience and your brand has opportunities for improvement that will be possible by transitioning your full business to Vendor Central,” read one email from Amazon to a brand. “As a result, we have made the decision to source your products for sale by Amazon only and your existing Seller Central account will be closed within 30 days of this email.”\nTranslation: Amazon is telling these brands that they can no longer sell directly to customers as an independent seller on the Amazon platform for third-party merchants known as the Amazon Marketplace. The advantages to selling on the Marketplace include the ability to control the sale price of the goods, run price promotions and get more data about how products are performing and who’s buying them.\nInstead, the email is telling brands that they can only sell items to Amazon’s retail group at wholesale cost, and let Amazon act as the seller and determine the retail cost.\nThis policy is not completely new. For years, Amazon has had a policy that says if a brand sells its goods to retailers outside of Amazon and wants to also sell on Amazon, the company “expects” the brand “to give Amazon Retail the option to source those products at competitive terms for sale as Retail items only.” But it was not consistently followed — until now.\n“The policy hasn’t changed but the enforcement is changing,” said Justin Leigh, a former Amazon product manager who for the last 10 years has run Ideoclick, a Seattle-based consultancy for brands that want to sell and advertise on Amazon.\nAn Amazon spokeswoman said the policy is intended to help reduce customer confusion.\nBut in addition to increased enforcement, an even bigger deal is a recent addition to the policy.\nThe new language not only bars some manufacturers and brands from selling their goods on the Amazon Marketplace if Amazon wants to sell the product itself — but also “their agents, licensees, and other representatives selling on their behalf.”\nWhat this means is that Amazon is increasingly seeking to control and sell its own content rather than serve as a middleman. That’s precisely why Kindle Select and Kindle Unlimited have been adopted, to change the structure of the ebook market as Amazon increasingly shifts the revenue split between Amazon and the author toward Amazon at the expense of the author.\nIn other words, now that Amazon has drained about as much of the revenue stream as it effectively can from the traditional publishers, it has no choice but to do the same to the independent publishers and the self-published authors if it is going to increase its sales. Because the overall market is not growing, the book market is a zero-sum game and Amazon cannot grow except at the expense of the ebook authors who in recent years have profited with Amazon at the expense of the traditional publishers.\nThis is why we are no longer participating in Kindle Select. And this is why it is going to be increasingly important for independent authors to either a) become part of the A9-favored Elect or b) find a way to succeed outside of Amazon. And while (a) is almost certainly the more profitable short-term move, it is not an option for most authors, and furthermore, requires the author to remain in the good graces of a moderately SJW-converged corporation, which is a dangerous place for anyone to be. While Amazon is considerably more professional and sane than Apple, Twitter, Patreon, and other more SJW-converged companies, it is very far from neutral.\nHow can I be so certain that the trend towards Retail and content control is inevitable? Because the individual who has driven the Retail side is now in charge of the whole shebang.\nEarlier this year, Amazon made moves to consolidate much of the decision-making for its retail platform under a single leader, Senior Vice President Doug Herrington, who has spent nearly 14 years at the company. Herrington comes from the Amazon Retail side of the business, where Amazon sources products itself and acts as a seller. That, brand leaders and consultants say, has influenced recent moves.\nNow, there is nothing wrong with what Amazon is doing. This is just a business strategy and it can’t be compared to the deplatformings and civil wrongdoings of companies like Indiegogo. One can still work with Amazon, one simply can’t take the risk of working exclusively with them as we have for the past four years. That is why we will be selling all of our new audiobooks from the Arkhaven store and why we are removing almost all of our books from Kindle Select, including the comics. We expect to have all of them removed from the exclusive system by the end of February.\nThis is great news for those of you who prefer DRM-free epubs, as we now have\neight of the ten THERE WILL BE WAR books\navailable for sale on the Arkhaven store, including the newly available Volume II, Volume III, Volume VII, and Volume X. The books also come in Kindle-compatible MOBI format for those of you who prefer to read on your Kindle devices.\nWe hope Castalia ebook and audiobook fans will continue to migrate to our direct stores, as so many of our print book buyers have already. Even though we only began our print direct sales in March, and even though the direct sales will not be available in the UK, Europe, and Australia until sometime in 2019, ONE-THIRD of all our growing print sales now go through\nCastalia Books Direct\n.  This is a tremendous strategic success. While Amazon is massively convenient and will always be an important retail outlet for us, it is vital for us to maintain our independence from it and it is those of you who buy our books that permit Castalia House, Arkhaven, and Dark Legion to do that.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-18T12:47:00+00:00"
}