{
  "url": "https://voxday.net/2018/12/01/as-gandalf-to-saruman/",
  "scraped_at": "2025-12-20T05:18:56.614016",
  "title": "As Gandalf to Saruman",
  "date_display": "December 1, 2018",
  "date_iso": "2018-12-01T16:00:05+00:00",
  "date_from_url": "2018-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I had always tended to think of Jordan Peterson as more of a Grima Wormtongue than anything, but <a href=\"https://www.amazon.co.uk/gp/customer-reviews/R7EB9XKL9G5JY/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B07JY9XV38\">this chilling quote from the Lord of the Rings</a> cited by an English reviewer of <i>Jordanetics </i>named Janet is weirdly prophetic concerning the way most of Peterson’s followers can’t even tell you what his teachings actually are, and how many of them react so furiously to even the most soundly-sourced criticism of their spiritual guru:</p><blockquote><p>I read voraciously but don’t normally leave reviews, mostly because I never know what to write. However, this book is too important to be neglected, it needs to be spread and read as widely as possible, so I wanted to leave a 5 star rating. I freely admit that I was fooled by Jordan Peterson to begin with. But after a while of following his videos, I began to feel firstly confused, then uneasy, then I was reminded of Tolkien’s description of Saruman:<br><i><br>“Suddenly another voice spoke, low and melodious, its very sound an enchantment. Those who listened unwarily to that voice could seldom report the words that they heard; and if they did, they wondered, for little power remained in them. Mostly they remembered only that it was a delight to hear the voice speaking, all that it said seemed wise and reasonable, and desire awoke in them by swift agreement to seem wise themselves. When others spoke they seemed harsh and uncouth by contrast, and if they gainsaid the voice, anger was kindled in the hearts of those under the spell. For some the spell lasted only while the voice spoke to them, and when it spoke to another they smiled, as men do who see through a juggler’s trick while others gape at it. For many the sound of the voice alone was enough to hold them enthralled; but for those whom it conquered the spell endured when they were far away, and ever they heard that soft voice whispering and urging them. But none were unmoved; none rejected its pleas and its commands without an effort of mind and will, so long as its master had control of it.”</br></i> (The Two Towers, Ch. 10)</br></p><p>If I tried to grasp what Peterson said and make proper sense of it, it was impossible. He uses words like Humpty Dumpty in <i>Alice Through the Looking Glass</i>; every meaning is fluid and a word can mean something different every day. And yet pointing out any contradiction or inconsistency, or even mild questioning, stirs up a frothing rage in his followers.</p><p>Vox Day is the Gandalf to Peterson’s Saruman, destroying the illusion and showing the man for what he truly is. No doubt he seems harsh and uncouth to those enthralled by Peterson. But in this book, with surgical precision he eviscerates Peterson’s writings, smokes out their incoherence and insanity, reveals the bones of their underlying malignancy, and displays the results like a neatly filleted kipper. Sadly, like the kipper – and Saruman’s malevolence – Peterson’s words may superficially taste good, but their oily stench is likely to linger for some time. That’s why this book needs to be spread far and wide, to counteract the spell.</p></blockquote><p>Help spread the book far and wide. Pick up a copy <a href=\"https://aerbook.com/maker/productcard-4283759-1875.html\">of the paperback</a>. And if you’re not in the USA, you can already order it from Amazon. They’ll have it in stock before the end of the week.</p></div>",
  "content_text": "I had always tended to think of Jordan Peterson as more of a Grima Wormtongue than anything, but\nthis chilling quote from the Lord of the Rings\ncited by an English reviewer of\nJordanetics\nnamed Janet is weirdly prophetic concerning the way most of Peterson’s followers can’t even tell you what his teachings actually are, and how many of them react so furiously to even the most soundly-sourced criticism of their spiritual guru:\nI read voraciously but don’t normally leave reviews, mostly because I never know what to write. However, this book is too important to be neglected, it needs to be spread and read as widely as possible, so I wanted to leave a 5 star rating. I freely admit that I was fooled by Jordan Peterson to begin with. But after a while of following his videos, I began to feel firstly confused, then uneasy, then I was reminded of Tolkien’s description of Saruman:\n“Suddenly another voice spoke, low and melodious, its very sound an enchantment. Those who listened unwarily to that voice could seldom report the words that they heard; and if they did, they wondered, for little power remained in them. Mostly they remembered only that it was a delight to hear the voice speaking, all that it said seemed wise and reasonable, and desire awoke in them by swift agreement to seem wise themselves. When others spoke they seemed harsh and uncouth by contrast, and if they gainsaid the voice, anger was kindled in the hearts of those under the spell. For some the spell lasted only while the voice spoke to them, and when it spoke to another they smiled, as men do who see through a juggler’s trick while others gape at it. For many the sound of the voice alone was enough to hold them enthralled; but for those whom it conquered the spell endured when they were far away, and ever they heard that soft voice whispering and urging them. But none were unmoved; none rejected its pleas and its commands without an effort of mind and will, so long as its master had control of it.”\n(The Two Towers, Ch. 10)\nIf I tried to grasp what Peterson said and make proper sense of it, it was impossible. He uses words like Humpty Dumpty in\nAlice Through the Looking Glass\n; every meaning is fluid and a word can mean something different every day. And yet pointing out any contradiction or inconsistency, or even mild questioning, stirs up a frothing rage in his followers.\nVox Day is the Gandalf to Peterson’s Saruman, destroying the illusion and showing the man for what he truly is. No doubt he seems harsh and uncouth to those enthralled by Peterson. But in this book, with surgical precision he eviscerates Peterson’s writings, smokes out their incoherence and insanity, reveals the bones of their underlying malignancy, and displays the results like a neatly filleted kipper. Sadly, like the kipper – and Saruman’s malevolence – Peterson’s words may superficially taste good, but their oily stench is likely to linger for some time. That’s why this book needs to be spread far and wide, to counteract the spell.\nHelp spread the book far and wide. Pick up a copy\nof the paperback\n. And if you’re not in the USA, you can already order it from Amazon. They’ll have it in stock before the end of the week.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-01T16:00:05+00:00"
}