{
  "url": "https://voxday.net/2018/12/27/darkstream-nn-taleb-and-the-importance-of-intelligence/",
  "scraped_at": "2025-12-20T05:22:44.448596",
  "title": "Darkstream: NN Taleb and the importance of intelligence",
  "date_display": "December 27, 2018",
  "date_iso": "2018-12-27T14:03:08+00:00",
  "date_from_url": "2018-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/l_nIMlzBOMA\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><p>From the transcript <a href=\"https://youtu.be/l_nIMlzBOMA\">of the Darkstream</a>: now 1 million views strong:</p><p>So, Taleb says IQ measures “an inferior form of intelligence stripped of second-order effects meant to select paper shufflers obedient intellectual yet idiots. This is a true statement followed by a falsehood, well, actually, it’s all false. IQ doesn’t actually measure intelligence at all, it is a <i>proxy </i>for intelligence, okay? Intelligence is not something that we know well enough to quantify how many one has. We know exactly what an inch is, so we can measure exactly how tall you are but we don’t know exactly what an IQ point is, and so to say it measures an inferior form of intelligence, no, I don’t think that’s correct.</p><p>Q- What do you think is the average and max IQ of your fan base is?<br>A- Well, I know that there are several dozen people with IQs in excess of 150, so if you simply do the math, I’ll have to work it out, but I would say that the average is probably around 110, which is actually extremely high if you work out the math. Maybe a little bit more.</br></p></div>",
  "content_text": "From the transcript\nof the Darkstream\n: now 1 million views strong:\nSo, Taleb says IQ measures “an inferior form of intelligence stripped of second-order effects meant to select paper shufflers obedient intellectual yet idiots. This is a true statement followed by a falsehood, well, actually, it’s all false. IQ doesn’t actually measure intelligence at all, it is a\nproxy\nfor intelligence, okay? Intelligence is not something that we know well enough to quantify how many one has. We know exactly what an inch is, so we can measure exactly how tall you are but we don’t know exactly what an IQ point is, and so to say it measures an inferior form of intelligence, no, I don’t think that’s correct.\nQ- What do you think is the average and max IQ of your fan base is?\nA- Well, I know that there are several dozen people with IQs in excess of 150, so if you simply do the math, I’ll have to work it out, but I would say that the average is probably around 110, which is actually extremely high if you work out the math. Maybe a little bit more.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-27T14:03:08+00:00"
}