{
  "url": "https://voxday.net/2018/12/28/darkstream-israels-wall-and-the-federal-shutdown/",
  "scraped_at": "2025-12-20T05:22:58.990546",
  "title": "Darkstream: Israel’s wall and the federal shutdown",
  "date_display": "December 28, 2018",
  "date_iso": "2018-12-28T21:48:33+00:00",
  "date_from_url": "2018-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/P8rsmlrfx68\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><div style=\"text-align: left;\">From the transcript <a href=\"https://youtu.be/P8rsmlrfx68\">of the Darkstream</a>:</div><div style=\"text-align: left;\"></div><p>When the president demands to know why Israel has a wall, if he needs to pull out that rhetorical weapon, then he has the ability to say, “how can you say that a wall is immoral for Americans but is moral for Israelis?” And if walls are immoral, if we cannot fund a wall for moral reasons, then how can we send any money at all to a immoral state, an immoral state maintaining an immoral wall? So what he’s doing by linking Israel’s wall to the big, beautiful wall that he’s going to build, that he intends to build, and that I believe that he will go ahead and leave the government shut down until he gets what he demands in order to build it, he’s set the stage rhetorically to put very, very intense pressure on the Democrats who of course are trying to put pressure on him through the shutdown.</p><p>And so as with all of these things it requires discipline and determination to see the matter through. If Trump backs down on this he is going to have very, very little credibility with his backers, with his supporters, with the people that he meets. Here’s an interesting fact from<i> Chicago Typewriter</i> author Brandon Fiadino, Israel had more than 10,000 crossings prior to 2013. The number of crossings went down to less than 200 when the wall first began going up, and there were next to none in 2017. So walls work.</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nWhen the president demands to know why Israel has a wall, if he needs to pull out that rhetorical weapon, then he has the ability to say, “how can you say that a wall is immoral for Americans but is moral for Israelis?” And if walls are immoral, if we cannot fund a wall for moral reasons, then how can we send any money at all to a immoral state, an immoral state maintaining an immoral wall? So what he’s doing by linking Israel’s wall to the big, beautiful wall that he’s going to build, that he intends to build, and that I believe that he will go ahead and leave the government shut down until he gets what he demands in order to build it, he’s set the stage rhetorically to put very, very intense pressure on the Democrats who of course are trying to put pressure on him through the shutdown.\nAnd so as with all of these things it requires discipline and determination to see the matter through. If Trump backs down on this he is going to have very, very little credibility with his backers, with his supporters, with the people that he meets. Here’s an interesting fact from\nChicago Typewriter\nauthor Brandon Fiadino, Israel had more than 10,000 crossings prior to 2013. The number of crossings went down to less than 200 when the wall first began going up, and there were next to none in 2017. So walls work.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-28T21:48:33+00:00"
}