{
  "url": "https://voxday.net/2018/12/08/darkstream-free-trade-is-evil/",
  "scraped_at": "2025-12-20T05:19:57.863907",
  "title": "Darkstream: Free Trade is Evil",
  "date_display": "December 8, 2018",
  "date_iso": "2018-12-08T02:29:38+00:00",
  "date_from_url": "2018-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This promises to be a pretty mind-blowing one, so you might want to consider <a href=\"https://www.youtube.com/watch?v=wpsv99B31nE\">watching this Darkstream</a> if you have any interest in economics or eschatology. I’m not merely making the case that free trade is bad for the economy, or that it is bad for America, I’m making the case that it is quite literally evil and integral to Satan’s master plan for the destruction of Man.</p><p>The relevant verses on which the case is founded.</p><p>Genesis 22:18 And in thy seed shall all the nations of the earth be blessed; because thou hast obeyed my voice. <i>(God wants to bless the nations.)</i></p><p>Psalm 22:28 For the kingdom is the Lord’s: and he is the governor among the nations. <i>(God governs the nations.)</i></p><p>Psalm 86:9 All nations whom thou hast made shall come and worship before thee, O Lord; and shall glorify thy name. <i>(God made at least some of the nations.)</i></p><p>Isaiah 14:12 How art thou fallen from heaven, O Lucifer, son of the morning! how art thou cut down to the ground, which didst weaken the nations! <i>(Lucifer’s fall from heaven weakened the nations.)</i></p><p>Matthew 25:32 And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats. <i>(The nations will survive to the end, despite all the efforts to destroy them, and God will set them straight again.)</i></p><p>Luke 21:25 And there shall be signs in the sun, and in the moon, and in the stars; and upon the earth distress of nations, with perplexity; the sea and the waves roaring. <i>(The nations will be distressed and perplexed towards the end.)</i></p><p>Revelation 13:7 And it was given unto him to make war with the saints, and to overcome them: and power was given him over all kindreds, and tongues, and nations.<i> (The Beast will be given power over the nations.)</i></p><p>Revelation 18:23 And the light of a candle shall shine no more at all in thee; and the voice of the bridegroom and of the bride shall be heard no more at all in thee: for thy merchants were the great men of the earth; for by thy sorceries were all nations deceived. <i>(The nations will be deceived by Babylon.)</i></p><p>Revelation 20:3 And cast him into the bottomless pit, and shut him up, and set a seal upon him, that he should deceive the nations no more. <i>(God will stop Lucifer from deceiving the nations.)</i></p><p><b>THE CORE SYLLOGISM</b></p><p><b>Major premise:</b> The prince of this world seeks to deceive and destroy the nations as part of his rebellion against God.<br><b>Minor premise:</b> The nations have been deceived into believing free trade benefits them, when in truth it will inevitably destroy them through the mobility of labor required to deliver the promised economic benefits.<br><b>Conclusion:</b> Free trade is an integral element of the prince of this world’s master plan to destroy Man.</br></br></p><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/wpsv99B31nE\" width=\"512\"></iframe></div></div>",
  "content_text": "This promises to be a pretty mind-blowing one, so you might want to consider\nwatching this Darkstream\nif you have any interest in economics or eschatology. I’m not merely making the case that free trade is bad for the economy, or that it is bad for America, I’m making the case that it is quite literally evil and integral to Satan’s master plan for the destruction of Man.\nThe relevant verses on which the case is founded.\nGenesis 22:18 And in thy seed shall all the nations of the earth be blessed; because thou hast obeyed my voice.\n(God wants to bless the nations.)\nPsalm 22:28 For the kingdom is the Lord’s: and he is the governor among the nations.\n(God governs the nations.)\nPsalm 86:9 All nations whom thou hast made shall come and worship before thee, O Lord; and shall glorify thy name.\n(God made at least some of the nations.)\nIsaiah 14:12 How art thou fallen from heaven, O Lucifer, son of the morning! how art thou cut down to the ground, which didst weaken the nations!\n(Lucifer’s fall from heaven weakened the nations.)\nMatthew 25:32 And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats.\n(The nations will survive to the end, despite all the efforts to destroy them, and God will set them straight again.)\nLuke 21:25 And there shall be signs in the sun, and in the moon, and in the stars; and upon the earth distress of nations, with perplexity; the sea and the waves roaring.\n(The nations will be distressed and perplexed towards the end.)\nRevelation 13:7 And it was given unto him to make war with the saints, and to overcome them: and power was given him over all kindreds, and tongues, and nations.\n(The Beast will be given power over the nations.)\nRevelation 18:23 And the light of a candle shall shine no more at all in thee; and the voice of the bridegroom and of the bride shall be heard no more at all in thee: for thy merchants were the great men of the earth; for by thy sorceries were all nations deceived.\n(The nations will be deceived by Babylon.)\nRevelation 20:3 And cast him into the bottomless pit, and shut him up, and set a seal upon him, that he should deceive the nations no more.\n(God will stop Lucifer from deceiving the nations.)\nTHE CORE SYLLOGISM\nMajor premise:\nThe prince of this world seeks to deceive and destroy the nations as part of his rebellion against God.\nMinor premise:\nThe nations have been deceived into believing free trade benefits them, when in truth it will inevitably destroy them through the mobility of labor required to deliver the promised economic benefits.\nConclusion:\nFree trade is an integral element of the prince of this world’s master plan to destroy Man.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-08T02:29:38+00:00"
}