{
  "url": "https://voxday.net/2018/12/06/everyone-is-over-bill-kristol-and-the-neocons/",
  "scraped_at": "2025-12-20T05:19:45.025641",
  "title": "Everyone is over Bill Kristol and the neocons",
  "date_display": "December 6, 2018",
  "date_iso": "2018-12-06T17:04:40+00:00",
  "date_from_url": "2018-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even civic nationalist immigrants like Dinesh D’Souza no longer have any use for “neoconservativism” or its evil defenders:</p><blockquote><p>Bill Kristol<br>A friend called my attention to this tweet, and distasteful though it is, I’m glad. It reinforces my determination, for what it’s worth, to try to save conservatism from the alt-right and to advance a conservatism that “gives to bigotry no sanction, to persecution no assistance.”</br></p><p>Dinesh D’Souza<br>Maybe the owners of the @weeklystandard should hire some Vietnamese guys to run the mag. This would fulfill @BillKristol ‘s own prophecy that when native-born Americans become stupid, lazy, decadent &amp; overpaid they can be replaced by more industrious immigrants.</br></p></blockquote><p>Trotsky was not a conservative. Neo-bolshevist world revolution is not conservatism. Bill Kristol’s Israel First neo-bolshevism is not only bigotry in itself, it is, quite literally, persecution. Notice that the neocons call for <i>government-imposed</i> international sanctions on Iran, but have successfully lobbied for the banning of the free speech of Americans who call for <i>private </i>boycotts of Israel.</p><p>If I was an Israeli government official, the first thing I would do is disown all of these corrupt, parasitical creatures. They are much more likely to eventually convince Americans to declare war on Israel than continue to financially and militarily support it. Everyone absolutely should hate Bill Kristol and the neocons, they are the most grotesquely dishonest, and evil people in the United States.</p><p>Notice that evil always, always, always reveals itself in its corruption of the truth, beginning with the perverse redefinition of words that already have a clear and coherent meaning.</p></div>",
  "content_text": "Even civic nationalist immigrants like Dinesh D’Souza no longer have any use for “neoconservativism” or its evil defenders:\nBill Kristol\nA friend called my attention to this tweet, and distasteful though it is, I’m glad. It reinforces my determination, for what it’s worth, to try to save conservatism from the alt-right and to advance a conservatism that “gives to bigotry no sanction, to persecution no assistance.”\nDinesh D’Souza\nMaybe the owners of the @weeklystandard should hire some Vietnamese guys to run the mag. This would fulfill @BillKristol ‘s own prophecy that when native-born Americans become stupid, lazy, decadent & overpaid they can be replaced by more industrious immigrants.\nTrotsky was not a conservative. Neo-bolshevist world revolution is not conservatism. Bill Kristol’s Israel First neo-bolshevism is not only bigotry in itself, it is, quite literally, persecution. Notice that the neocons call for\ngovernment-imposed\ninternational sanctions on Iran, but have successfully lobbied for the banning of the free speech of Americans who call for\nprivate\nboycotts of Israel.\nIf I was an Israeli government official, the first thing I would do is disown all of these corrupt, parasitical creatures. They are much more likely to eventually convince Americans to declare war on Israel than continue to financially and militarily support it. Everyone absolutely should hate Bill Kristol and the neocons, they are the most grotesquely dishonest, and evil people in the United States.\nNotice that evil always, always, always reveals itself in its corruption of the truth, beginning with the perverse redefinition of words that already have a clear and coherent meaning.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-06T17:04:40+00:00"
}