{
  "url": "https://voxday.net/2018/12/16/evil-hates-good/",
  "scraped_at": "2025-12-20T05:21:14.089183",
  "title": "Evil hates good",
  "date_display": "December 16, 2018",
  "date_iso": "2018-12-16T10:35:05+00:00",
  "date_from_url": "2018-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The failures hate the successful. And the gammas always, always, always hate the alphas.</p><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/b4tLcPwKfCw\" width=\"512\"></iframe></div><p>If you ever wonder why I am so “harsh” and “judgmental”, why I don’t hesitate to eject people from this blog, and why I am very fast to reject potential fans and followers, <a href=\"https://youtu.be/b4tLcPwKfCw\">watch this video</a>. Owen is a genuinely sweet man. He’s a fundamentally good person. He is a bright light who instinctively stands up for what he believes to be true. And that is why he trusts people, why he gets bitten by the broken people he tries to help, and why it genuinely hurts him when people return evil for good.</p><p>I am not as good, or as innocent, or as merciful, as Owen. To the contrary, I will literally hunt a cripple down in his grandmother’s home and have the police drag him down to the police station, then expose his activities to his entire real-life social circle. <i>And that’s when I’m playing nice.</i></p><p>So, I’m not disturbed or unsettled by evil. Its existence neither surprises nor demoralizes me. To the contrary, I am galvanized by the opportunity to exert myself against it from time to time. God gives us all different gifts, and one of mine happens to be the love of the fray and the joy of seizing up the enemy and searching for a way to defeat him.</p><p>Never forget that God hates the wicked and he loves his warriors. God punished David and refused to let him build the temple, but He never rejected him. Jesus rebuked Peter, but he also called him his rock.</p><p>Send Owen a note to encourage him, whether you believe Man walked on the Moon or not. And be of good cheer. This is the season when we celebrate the beginning of the victory, after all. Deus vult.</p></div>",
  "content_text": "The failures hate the successful. And the gammas always, always, always hate the alphas.\nIf you ever wonder why I am so “harsh” and “judgmental”, why I don’t hesitate to eject people from this blog, and why I am very fast to reject potential fans and followers,\nwatch this video\n. Owen is a genuinely sweet man. He’s a fundamentally good person. He is a bright light who instinctively stands up for what he believes to be true. And that is why he trusts people, why he gets bitten by the broken people he tries to help, and why it genuinely hurts him when people return evil for good.\nI am not as good, or as innocent, or as merciful, as Owen. To the contrary, I will literally hunt a cripple down in his grandmother’s home and have the police drag him down to the police station, then expose his activities to his entire real-life social circle.\nAnd that’s when I’m playing nice.\nSo, I’m not disturbed or unsettled by evil. Its existence neither surprises nor demoralizes me. To the contrary, I am galvanized by the opportunity to exert myself against it from time to time. God gives us all different gifts, and one of mine happens to be the love of the fray and the joy of seizing up the enemy and searching for a way to defeat him.\nNever forget that God hates the wicked and he loves his warriors. God punished David and refused to let him build the temple, but He never rejected him. Jesus rebuked Peter, but he also called him his rock.\nSend Owen a note to encourage him, whether you believe Man walked on the Moon or not. And be of good cheer. This is the season when we celebrate the beginning of the victory, after all. Deus vult.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-16T10:35:05+00:00"
}