{
  "url": "https://voxday.net/2018/12/09/happy-to-help/",
  "scraped_at": "2025-12-20T05:20:07.157894",
  "title": "Happy to help",
  "date_display": "December 9, 2018",
  "date_iso": "2018-12-09T10:54:14+00:00",
  "date_from_url": "2018-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s mildly amusing to observe <a href=\"https://www.businessinsider.in/f-you-leakers-a-former-senior-google-employee-says-a-frantic-quest-to-stop-internal-info-getting-out-is-now-managements-number-one-priority/articleshow/67000790.cms\">how freaked out Google’s executives and managers are</a> about the fact that everything they do is leaked out to various bloggers and reporters, considering how involved they are in tracking everything that everyone else does. I have to give Google a modicum of credit for self-discipline, though, as I’ve been expecting “rogue employees” to start trying to publicly embarrass critics by releasing emails and search histories for years.</p><blockquote><p>A senior former Google employee who quit over its controversial plans to launch a search engine in China painted a picture of a company whose upper echelons are obsessed with stopping leaks, to the exclusion of almost anything else.</p><p>Jack Poulson, a former researcher at the company, said that senior managers consider the prevention of leaks to be their “number one priority.”</p><p>In comments reported on Saturday by The Times of London, Poulson cited as an example of the anti-leak culture an an unnamed senior engineer taking the microphone at an all-hands meeting to yell “F— you leakers” at his colleagues.</p><p>He said that the campaign against leaking had become a way for Google to avoid tackling the reasons staff were leaking in the first place, including concerns over the Chinese search project, code-named Dragonfly, or work for the US military.</p><p>Poulson left Google in September over Dragonfly, and said he believed four other employees had done the same. Google declined to comment on his departure at the time.</p><p>He said, according to The Times: “The narrative is that leaking is bad and that the number one priority is to prevent any leaks.”</p></blockquote><p>Allow me to give you a little advice, Googlers. You will NEVER stop the leakers because a not-insignificant percentage of your colleagues are the very kind of people you have targeted for your ongoing anti-right hate campaign. They knew to keep their mouths shut, or in some cases, to present a convincing SJW front, so you think they are in accordance with your insane social justice program.</p><p>But they’re not. And they’re very, very motivated to make sure that the outside world knows exactly what you are up to. Because they think you are insane.</p><p>What we’re seeing here with Google and with Facebook is the beginning of the great Big Tech crackup that has been inevitable since they decided to publicly cast in their lots with the Left and try to thought police the Internet. That doomed them, because it sent a very clear signal to the rest of the world that they not only could not be trusted, they could not even be tolerated.</p></div>",
  "content_text": "It’s mildly amusing to observe\nhow freaked out Google’s executives and managers are\nabout the fact that everything they do is leaked out to various bloggers and reporters, considering how involved they are in tracking everything that everyone else does. I have to give Google a modicum of credit for self-discipline, though, as I’ve been expecting “rogue employees” to start trying to publicly embarrass critics by releasing emails and search histories for years.\nA senior former Google employee who quit over its controversial plans to launch a search engine in China painted a picture of a company whose upper echelons are obsessed with stopping leaks, to the exclusion of almost anything else.\nJack Poulson, a former researcher at the company, said that senior managers consider the prevention of leaks to be their “number one priority.”\nIn comments reported on Saturday by The Times of London, Poulson cited as an example of the anti-leak culture an an unnamed senior engineer taking the microphone at an all-hands meeting to yell “F— you leakers” at his colleagues.\nHe said that the campaign against leaking had become a way for Google to avoid tackling the reasons staff were leaking in the first place, including concerns over the Chinese search project, code-named Dragonfly, or work for the US military.\nPoulson left Google in September over Dragonfly, and said he believed four other employees had done the same. Google declined to comment on his departure at the time.\nHe said, according to The Times: “The narrative is that leaking is bad and that the number one priority is to prevent any leaks.”\nAllow me to give you a little advice, Googlers. You will NEVER stop the leakers because a not-insignificant percentage of your colleagues are the very kind of people you have targeted for your ongoing anti-right hate campaign. They knew to keep their mouths shut, or in some cases, to present a convincing SJW front, so you think they are in accordance with your insane social justice program.\nBut they’re not. And they’re very, very motivated to make sure that the outside world knows exactly what you are up to. Because they think you are insane.\nWhat we’re seeing here with Google and with Facebook is the beginning of the great Big Tech crackup that has been inevitable since they decided to publicly cast in their lots with the Left and try to thought police the Internet. That doomed them, because it sent a very clear signal to the rest of the world that they not only could not be trusted, they could not even be tolerated.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-09T10:54:14+00:00"
}