{
  "url": "https://voxday.net/2018/12/17/is-israel-the-real-enemy-of-america/",
  "scraped_at": "2025-12-20T05:21:25.049954",
  "title": "Is Israel the real enemy of America?",
  "date_display": "December 17, 2018",
  "date_iso": "2018-12-17T16:00:05+00:00",
  "date_from_url": "2018-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because I don’t see Russia or China or Iran actively attempting to interfere with and eliminate the Constitutional rights of U.S. citizens. And <a href=\"https://theintercept.com/2018/12/17/israel-texas-anti-bds-law/\">anti-BDS laws are intrinsically anti-American</a>.</p><blockquote><p>A CHILDREN’S SPEECH PATHOLOGIST who has worked for the last nine years with developmentally disabled, autistic, and speech-impaired elementary school students in Austin, Texas, has been told she can no longer work with the public school district after she refused to sign an oath vowing that she “does not” and “will not” engage in a boycott of Israel or “otherwise tak[e] any action that is intended to inflict economic harm” on that foreign nation. A lawsuit on her behalf was filed early Monday morning in a federal court in the Western District of Texas alleging a violation of her First Amendment right of free speech.</p><p>The child language specialist, Bahia Amawi, is a U.S. citizen who received a master’s degree in speech pathology in 1999 and, since then, has specialized in evaluations for young children with language difficulties (see video below). Amawi was born in Austria and has lived in the U.S. for the last 30 years, fluently speaks three languages (English, German, and Arabic), and has four U.S.-born American children of her own.</p><p>Amawi began working in 2009 on a contract basis with the Pflugerville Independent School District, which includes Austin, to provide assessments and support for school children from the county’s growing Arabic-speaking immigrant community. The children with whom she has worked span the ages of 3 to 11. Ever since her work for the school district began in 2009, her contract was renewed each year with no controversy or problem.</p><p>But this year, all of that changed. On August 13, the school district once again offered to extend her contract for another year by sending her essentially the same contract and set of certifications she has received and signed at the end of each year since 2009.</p><p>She was prepared to sign her contract renewal until she noticed one new, and extremely significant, addition: a certification she was required to sign pledging that she “does not currently boycott Israel,” that she “will not boycott Israel during the term of the contract,” and that she shall refrain from any action “that is intended to penalize, inflict economic harm on, or limit commercial relations with Israel, or with a person or entity doing business in Israel or in an Israel-controlled territory.”</p></blockquote><p>Regardless of what you may think of Israel, or any other country, a U.S. citizen absolutely has the right to personally boycott any business he wants for any reason at all. And a freaking SCHOOL DISTRICT has no right to act in this inquisitorial, conscience-violating manner on behalf of a foreign nation. This direct legal assault on the core Constitutional rights of Americans is an absolutely <i>insane </i>overreaction on the part of the Israel First fifth column in the United States to the growing anti-Israel BDS movement.</p><p>If I was Benjamin Netanyahu or any other Israeli leader with influence over AIPAC, the various Jewish organizations, or the media neocons, I would tell them to retreat <i>immediately </i>from this ludicrously self-destructive and obviously unconstitutional policy of attempting to ban the anti-BDS movement, or face being entirely disavowed by Israel. This attack on American rights will not only justify anti-semitism more than any quantity of blood libels or historical complaints about usurious money lenders ever have, it will render it almost mandatory for every single genuine American and U.S. citizen who respects the U.S. Constitution.</p><p>Now, I support Israel. I do not support the BDS movement. But I am 100 percent opposed to this insane, egregious, offensively stupid assault on the unalienable rights of Americans. And if these anti-American laws are not overturned for their blatant unconstitutionality, as I expect they will be, then every single US supporter of Israel will have to seriously consider endorsing the BDS movement on principle.</p><p>This anti-BDS legal campaign goes far beyond the concept of an own goal. In sports terms, this is Jim Marshall running with the ball towards his own end zone.</p></div>",
  "content_text": "Because I don’t see Russia or China or Iran actively attempting to interfere with and eliminate the Constitutional rights of U.S. citizens. And\nanti-BDS laws are intrinsically anti-American\n.\nA CHILDREN’S SPEECH PATHOLOGIST who has worked for the last nine years with developmentally disabled, autistic, and speech-impaired elementary school students in Austin, Texas, has been told she can no longer work with the public school district after she refused to sign an oath vowing that she “does not” and “will not” engage in a boycott of Israel or “otherwise tak[e] any action that is intended to inflict economic harm” on that foreign nation. A lawsuit on her behalf was filed early Monday morning in a federal court in the Western District of Texas alleging a violation of her First Amendment right of free speech.\nThe child language specialist, Bahia Amawi, is a U.S. citizen who received a master’s degree in speech pathology in 1999 and, since then, has specialized in evaluations for young children with language difficulties (see video below). Amawi was born in Austria and has lived in the U.S. for the last 30 years, fluently speaks three languages (English, German, and Arabic), and has four U.S.-born American children of her own.\nAmawi began working in 2009 on a contract basis with the Pflugerville Independent School District, which includes Austin, to provide assessments and support for school children from the county’s growing Arabic-speaking immigrant community. The children with whom she has worked span the ages of 3 to 11. Ever since her work for the school district began in 2009, her contract was renewed each year with no controversy or problem.\nBut this year, all of that changed. On August 13, the school district once again offered to extend her contract for another year by sending her essentially the same contract and set of certifications she has received and signed at the end of each year since 2009.\nShe was prepared to sign her contract renewal until she noticed one new, and extremely significant, addition: a certification she was required to sign pledging that she “does not currently boycott Israel,” that she “will not boycott Israel during the term of the contract,” and that she shall refrain from any action “that is intended to penalize, inflict economic harm on, or limit commercial relations with Israel, or with a person or entity doing business in Israel or in an Israel-controlled territory.”\nRegardless of what you may think of Israel, or any other country, a U.S. citizen absolutely has the right to personally boycott any business he wants for any reason at all. And a freaking SCHOOL DISTRICT has no right to act in this inquisitorial, conscience-violating manner on behalf of a foreign nation. This direct legal assault on the core Constitutional rights of Americans is an absolutely\ninsane\noverreaction on the part of the Israel First fifth column in the United States to the growing anti-Israel BDS movement.\nIf I was Benjamin Netanyahu or any other Israeli leader with influence over AIPAC, the various Jewish organizations, or the media neocons, I would tell them to retreat\nimmediately\nfrom this ludicrously self-destructive and obviously unconstitutional policy of attempting to ban the anti-BDS movement, or face being entirely disavowed by Israel. This attack on American rights will not only justify anti-semitism more than any quantity of blood libels or historical complaints about usurious money lenders ever have, it will render it almost mandatory for every single genuine American and U.S. citizen who respects the U.S. Constitution.\nNow, I support Israel. I do not support the BDS movement. But I am 100 percent opposed to this insane, egregious, offensively stupid assault on the unalienable rights of Americans. And if these anti-American laws are not overturned for their blatant unconstitutionality, as I expect they will be, then every single US supporter of Israel will have to seriously consider endorsing the BDS movement on principle.\nThis anti-BDS legal campaign goes far beyond the concept of an own goal. In sports terms, this is Jim Marshall running with the ball towards his own end zone.",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-17T16:00:05+00:00"
}