{
  "url": "https://voxday.net/2018/12/12/michael-knowles-is-a-neocon-fraud/",
  "scraped_at": "2025-12-20T05:20:41.153930",
  "title": "Michael Knowles is a neocon fraud",
  "date_display": "December 12, 2018",
  "date_iso": "2018-12-12T13:00:03+00:00",
  "date_from_url": "2018-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When are conservatives going to stop falling for the fraudulent figureheads appointed by those who hate the European nations, hate America, and hate Christianity? I was asked about someone named Michael Knowles <a href=\"https://www.youtube.com/watch?v=-EnKuPfXx7Y\">in last night’s Darkstream</a> on the fake leaders of the parade, and a cursory examination quickly revealed that <a href=\"https://www.youtube.com/watch?v=MHXL00wY3nY&amp;feature=youtu.be\">he is just another deceitful charlatan</a> in the same vein as Ben Shapiro, Matt Walsh, William F. Buckley, Jennifer Rubin, and every other cuckservative fraud.</p><blockquote><p>Other alt-right leaders include Sam Francis, the late syndicated columnist and forefather of the movement who famously called for a white racial consciousness. Theodore Beale, the blogger known as Vox Day, who in his manifesto what is the Alt Right cites the white nationalist motto “we must secure the existence of our people and a future for white children”, and Paul Ramsey, a white nationalist who produced and starred in a video entitled, “Is it wrong not to feel sad about the Holocaust.</p><p>Another area of agreement between the alt-right and the left is that both ultimately reject God. The Alt Right admires Christendom for uniting the European continent but rejects Christianity for its offer of salvation to all people irrespective of race. The movement’s favorite philosopher, just like the Nazis of yesteryear is Friedrich Nietzsche, who famously claimed God is dead.</p></blockquote><p>This is a pack of lies from start to finish. I don’t reject God, but Ben Shapiro most certainly rejects both Jesus Christ and his Father. I regard Nietzsche with complete contempt and pay him no heed at all, but neocon favorite Jordan Peterson lauds him and mentions him no less than 43 times in <i>12 Rules for Life</i> and 83 times in <i>Maps of Meaning</i>. And no one who deprecates Sam Francis can be considered a genuine conservative. So, in answer to those who asked me about Michael Knowles on the Darkstream, my answer is this: Knowles is a manufactured new media whore, he is a liar, and he is not on the side of truth, justice, or the American Way.</p><p><i>Woe to those who call evil good and good evil, who put darkness for light and light for darkness, who put bitter for sweet and sweet for bitter.</i><br>– Isaiah 5:20</br></p><p>Once you catch one of these media whores in a lie, you know who and what they are, and whom they serve. FFS, stop falling for the “but he’s such an effective critic of the Left” headfake. The world is not binary, there are an abundancy of rival evils, and absolutely none of them are good.</p></div>",
  "content_text": "When are conservatives going to stop falling for the fraudulent figureheads appointed by those who hate the European nations, hate America, and hate Christianity? I was asked about someone named Michael Knowles\nin last night’s Darkstream\non the fake leaders of the parade, and a cursory examination quickly revealed that\nhe is just another deceitful charlatan\nin the same vein as Ben Shapiro, Matt Walsh, William F. Buckley, Jennifer Rubin, and every other cuckservative fraud.\nOther alt-right leaders include Sam Francis, the late syndicated columnist and forefather of the movement who famously called for a white racial consciousness. Theodore Beale, the blogger known as Vox Day, who in his manifesto what is the Alt Right cites the white nationalist motto “we must secure the existence of our people and a future for white children”, and Paul Ramsey, a white nationalist who produced and starred in a video entitled, “Is it wrong not to feel sad about the Holocaust.\nAnother area of agreement between the alt-right and the left is that both ultimately reject God. The Alt Right admires Christendom for uniting the European continent but rejects Christianity for its offer of salvation to all people irrespective of race. The movement’s favorite philosopher, just like the Nazis of yesteryear is Friedrich Nietzsche, who famously claimed God is dead.\nThis is a pack of lies from start to finish. I don’t reject God, but Ben Shapiro most certainly rejects both Jesus Christ and his Father. I regard Nietzsche with complete contempt and pay him no heed at all, but neocon favorite Jordan Peterson lauds him and mentions him no less than 43 times in\n12 Rules for Life\nand 83 times in\nMaps of Meaning\n. And no one who deprecates Sam Francis can be considered a genuine conservative. So, in answer to those who asked me about Michael Knowles on the Darkstream, my answer is this: Knowles is a manufactured new media whore, he is a liar, and he is not on the side of truth, justice, or the American Way.\nWoe to those who call evil good and good evil, who put darkness for light and light for darkness, who put bitter for sweet and sweet for bitter.\n– Isaiah 5:20\nOnce you catch one of these media whores in a lie, you know who and what they are, and whom they serve. FFS, stop falling for the “but he’s such an effective critic of the Left” headfake. The world is not binary, there are an abundancy of rival evils, and absolutely none of them are good.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-12T13:00:03+00:00"
}