{
  "url": "https://voxday.net/2018/12/09/milo-sargon-banned-by-patreon/",
  "scraped_at": "2025-12-20T05:20:08.616370",
  "title": "Milo, Sargon banned by Patreon",
  "date_display": "December 9, 2018",
  "date_iso": "2018-12-09T11:57:47+00:00",
  "date_from_url": "2018-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They are just the latest. More will be coming soon.</p><blockquote><p>Crowdfunding site Patreon this week banned the accounts of several controversial public figures, part of a wider push by tech companies to de-platform users linked to the alt-right and far right.</p><p>The accounts of British conspiracy theorist YouTuber Carl Benjamin, better known as Sargon of Akkad, and U.S. far-right political commentator James Allsup, were removed Thursday.</p><p>The fresh bans came a day after far-right activist Milo Yiannopoulos saw his account killed — just 24 hours after he set it up to fund a “magnificent 2019 comeback” tour. The former Breitbart editor was cut off because of his association with the far-right group Proud Boys, Patreon said.</p></blockquote><p>On the plus side, <i>Jordanetics </i>has Jordan Peterson so worried about his collapsing right flank that he’s decided to summon the powerful occult forces of the Ineffectual Dork Web and hold a marketing focus group meeting to determine what would be the best received response to these latest deplatformings.</p><p><a href=\"https://twitter.com/jordanbpeterson\">Jordan B Peterson@jordanbpeterson</a><br>I’m doing everything I can to contact people in my circle and formulate a plan and response.</br></p><p>I don’t know. That sounds a little too pathological to me. I understand that the best thing one can do when deplatformed is not to resist, complain, or attempt to act in concert with anyone else, but to simply focus on living a stalwart, meaningful, and high-quality individual life.</p><p>I repeat: <i>build your own platforms</i>. That’s what we’re doing already. More are on the way in the new year. Also, stop using and supporting converged platforms such as Patreon, Kickstarter, and IndieGoGo, where they actually make money off your business.</p></div>",
  "content_text": "They are just the latest. More will be coming soon.\nCrowdfunding site Patreon this week banned the accounts of several controversial public figures, part of a wider push by tech companies to de-platform users linked to the alt-right and far right.\nThe accounts of British conspiracy theorist YouTuber Carl Benjamin, better known as Sargon of Akkad, and U.S. far-right political commentator James Allsup, were removed Thursday.\nThe fresh bans came a day after far-right activist Milo Yiannopoulos saw his account killed — just 24 hours after he set it up to fund a “magnificent 2019 comeback” tour. The former Breitbart editor was cut off because of his association with the far-right group Proud Boys, Patreon said.\nOn the plus side,\nJordanetics\nhas Jordan Peterson so worried about his collapsing right flank that he’s decided to summon the powerful occult forces of the Ineffectual Dork Web and hold a marketing focus group meeting to determine what would be the best received response to these latest deplatformings.\nJordan B Peterson@jordanbpeterson\nI’m doing everything I can to contact people in my circle and formulate a plan and response.\nI don’t know. That sounds a little too pathological to me. I understand that the best thing one can do when deplatformed is not to resist, complain, or attempt to act in concert with anyone else, but to simply focus on living a stalwart, meaningful, and high-quality individual life.\nI repeat:\nbuild your own platforms\n. That’s what we’re doing already. More are on the way in the new year. Also, stop using and supporting converged platforms such as Patreon, Kickstarter, and IndieGoGo, where they actually make money off your business.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-09T11:57:47+00:00"
}