{
  "url": "https://voxday.net/2018/12/21/next-year-in-jerusalem-julia/",
  "scraped_at": "2025-12-20T05:21:58.717132",
  "title": "Next year in Jerusalem, Julia",
  "date_display": "December 21, 2018",
  "date_iso": "2018-12-21T17:48:28+00:00",
  "date_from_url": "2018-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The President of The Herzl Institute and the author of <i>The Virtue of Nationalism</i> publicly spanks a deeply ungrateful Jewess living in America.</p><p>Yoram Hazony<br>@yhazony<br>·<br>20h<br>I sympathize. Christmas didn’t make me happy when I was in the US either.  But I choose to live in Israel where the holidays are from the torah. You *choose* to live in America. Why would you want to tell the Christian majority how “wearying and alienating” their holiday is?<br>Quote Tweet<br>Julia Ioffe<br>@juliaioffe<br>(For the record, I always say “Thank you. You, too.” But the omnipresence of Christmas for a whole month is deeply wearying and alienating to some of us who do not celebrate. If you want me respect you, please respect me, too.)<br>Show this thread<br>Yoram Hazony<br>Yoram Hazony<br>@yhazony<br>·<br>19h<br>Isn’t there some level of common decency that requires the respect of majority customs? Shouldn’t Jews want to avoid giving unnecessary insult? I just don’t get it.<br>Yoram Hazony<br>Yoram Hazony<br>@yhazony<br>·<br>19h<br>And I don’t buy the facile equivalence of “respect me if you want me to respect you.” Although most Christians I know try very hard to be sensitive in dealing with Jews, there is no chance that they will ever be sensitive enough to make Christmas an easy time for Jews.<br>Yoram Hazony<br>Yoram Hazony<br>@yhazony<br>·<br>19h<br>Partly that’s because of the  nature of the historic divisions between Jews and Christians. Partly it’s because there’s a limit to how far any majority can go in accommodating minority customs that are unfamiliar to them. That’s just what it’s like to be a Jew among gentiles.<br>Yoram Hazony<br>Yoram Hazony<br>@yhazony<br>·<br>19h<br>I think that before you go demanding more respect from Christians, you might consider whether telling them what you feel about their holidays in a public forum is a likely way of gaining that extra helping of respect you so crave.<br>Yoram Hazony<br>Yoram Hazony<br>@yhazony<br>My guess is that you would feel less weary if you focused less on how alienated you are as a Jew in a Christian country at Christmas time—and more on the generous offer of home that this American Christianity has extended to Jews for centuries.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "The President of The Herzl Institute and the author of\nThe Virtue of Nationalism\npublicly spanks a deeply ungrateful Jewess living in America.\nYoram Hazony\n@yhazony\n·\n20h\nI sympathize. Christmas didn’t make me happy when I was in the US either.  But I choose to live in Israel where the holidays are from the torah. You *choose* to live in America. Why would you want to tell the Christian majority how “wearying and alienating” their holiday is?\nQuote Tweet\nJulia Ioffe\n@juliaioffe\n(For the record, I always say “Thank you. You, too.” But the omnipresence of Christmas for a whole month is deeply wearying and alienating to some of us who do not celebrate. If you want me respect you, please respect me, too.)\nShow this thread\nYoram Hazony\nYoram Hazony\n@yhazony\n·\n19h\nIsn’t there some level of common decency that requires the respect of majority customs? Shouldn’t Jews want to avoid giving unnecessary insult? I just don’t get it.\nYoram Hazony\nYoram Hazony\n@yhazony\n·\n19h\nAnd I don’t buy the facile equivalence of “respect me if you want me to respect you.” Although most Christians I know try very hard to be sensitive in dealing with Jews, there is no chance that they will ever be sensitive enough to make Christmas an easy time for Jews.\nYoram Hazony\nYoram Hazony\n@yhazony\n·\n19h\nPartly that’s because of the  nature of the historic divisions between Jews and Christians. Partly it’s because there’s a limit to how far any majority can go in accommodating minority customs that are unfamiliar to them. That’s just what it’s like to be a Jew among gentiles.\nYoram Hazony\nYoram Hazony\n@yhazony\n·\n19h\nI think that before you go demanding more respect from Christians, you might consider whether telling them what you feel about their holidays in a public forum is a likely way of gaining that extra helping of respect you so crave.\nYoram Hazony\nYoram Hazony\n@yhazony\nMy guess is that you would feel less weary if you focused less on how alienated you are as a Jew in a Christian country at Christmas time—and more on the generous offer of home that this American Christianity has extended to Jews for centuries.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2018-12-21T17:48:28+00:00"
}