{
  "url": "https://voxday.net/2018/12/07/on-the-knowledge-of-god-part-i/",
  "scraped_at": "2025-12-20T05:19:52.417972",
  "title": "On the Knowledge of God, part I",
  "date_display": "December 7, 2018",
  "date_iso": "2018-12-07T15:29:36+00:00",
  "date_from_url": "2018-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The question of the nature of God’s knowledge came up in a recent Darkstream. So as not to repeat myself unnecessarily, I will simply post this selection from <i>The Irrational Atheist </i>which still represents my thoughts on the matter. I make no pretense of being a theologian, nor do I claim that I must be correct on the matter, they are simply my thoughts and conclusions concerning the concepts of divine omnipotence and divine omniscience.</p><p><b>MASTER OF PUPPETS OR GAME DESIGNER?</b><br>“She was an atheist, but she was a Lutheran atheist, so she knew exactly what God she didn’t believe in.”<br>– Garrison Keillor, <i>Wobegon Boy</i></br></br></p><p>Doubts about the existence of God, particularly the existence of a good and loving God, often stem from great emotional pain. While doubts are naturally bound to occur to any rational individual in moments of somber reflection, it is particularly hard to imagine that a loving God who loves us would choose to intentionally inflict pain upon us, especially if He is all-powerful. When one surveys the long list of horrors that have engulfed countless men, women and children throughout the course of history, the vast majority of them innocent and undeserving of such evil fates, one finds it easy to sympathize with the individual who concludes that God, if He exists and is paying attention to humanity, must be some sort of divine sadist.</p><p>Because doubts are reasonable, normal and inevitable, they should never be brushed aside, belittled or answered with a glib phrase, for not only does decency demand that they receive a sensitive hearing, but also because they can have powerful ramifications that resonate long after the doubter himself has had them resolved one way or another. Randal Keynes, a descendant and biographer of Charles Darwin, asserts that it was the death of Darwin’s beloved daughter Annie, at the age of ten after a long illness that convicted the great evolutionist of his dangerous idea that neither divine intervention nor morality had anything to do with the operation of the natural laws. And if this tragic loss was not the only element involved in Darwin’s transition from an accomplished student of theology to the inventor of what today is the primary driving force behind the anti-theist New Atheism, it is widely considered to have been the final step that pushed him over the edge.</p><p>One would not be human if one could not sympathize with Darwin’s anguished rejection of the notion that there was any justice or even a silver lining to be found in the death of his beautiful little girl. And perhaps there was some consolation, if any consolation was to be found, in viewing his terrible loss as taking place within the context of a mechanistic universe, wherein one was not subject to the ineffable caprice of an unpredictable deity, but to the predictable operation of natural laws which one could at least hope to understand and attempt to utilize.</p><p>But if God exists, it is a basic theological error to attempt to place the blame for earthly tragedies on Him. In fact, it is not only a theological error, but also a fundamental error of logic to conclude that God, even an all-powerful God, must be to blame for every evil, accident or tragedy that befalls us.</p><p><b>The Contradiction of Divine Characteristics</b><br>In a chapter considering the arguments for God’s existence, Richard Dawkins muses briefly upon what he considers to be a logical contradiction. He writes:</br></p><p><i>Incidentally, it has not escaped the notice of logicians that omniscience and omnipotence are mutually incompatible. If God is omniscient, he must already know how he is going to intervene to change the course of history using his omnipotence. But that means he can’t change his mind about his intervention, which means he is not omnipotent.</i></p><p>As Dawkins surely knows, this is a silly and superficial argument, indeed, he follows it up with a little piece of doggerel by Karen Owens before promptly abandoning the line of reasoning in favor of a return to his attack upon Thomas Aquinas. While the argument appears to make sense at first glance, it’s merely a variation on the deeply philosophical question that troubles so many children and atheists, of whether God can create a rock so heavy that He cannot lift it.</p><p>First, it is important to note that the Christian God, the god towards whom Dawkins directs the great majority of his attacks, makes no broad claims to omniscience. Although there are 87 references to the specific things that the Biblical God knows, only a single example could even potentially be interpreted as a universal claim to complete knowledge. Among the things that God claims to know are the following:<br><i><br/></i><i>He knows the way to wisdom and where it dwells, he knows the day of the wicked is coming, he knows the secrets of men’s hearts, he knows the thoughts of men and their futility. He knows the proud from afar, he knows what lies in darkness, and he knows what you need before you ask him. He knows the Son, he knows the day and the hour that the heavens and the earth shall pass away, he knows the mind of the Spirit and that the Apostle Paul loved the Corinthians. He knows who are his, he knows how to rescue godly men from trials, and perhaps most importantly, he knows that the thoughts of the wise are futile.</i></br></p><p>The only straightforward claim to omniscience is made on God’s behalf by the apostle John, who clearly states “he knows everything”. However, the context in which the statement is made also indicates that this particular “everything” is not intended to encompass Life and The Universe, but rather everything about human hearts. Not only does this interpretation make more sense in light of the verse than with an inexplicable revelation of a divine quality that appears nowhere else in the Bible, but it is also in keeping with many previous statements made about God’s knowledge.</p><p>After all, when Hercule Poirot confronts the murderer in an Agatha Christie novel and informs the killer that he knows everything, the educated reader does not usually interpret this as a statement that the Belgian detective is confessing that he is the physical manifestation of Hermes Trismegistus, but rather that he knows everything <i>about the crime</i> he has been detecting.</p><p>In keeping with this interpretation, Dr. Greg Boyd, the pastor at Woodland Hills Church and the author of <i>Letters to a Skeptic</i>, has written a book laying out a convincing case for the Open View of God, which among other things chronicles the many Biblical examples of God being surprised, changing His mind and even being thwarted. Moreover, it would be very, very strange for a presumably intelligent being such as Satan to place a bet with God if he believed that God knew with certainty what Job’s reaction to his torments would be.</p><p>But in addition to the fact that it is based on a false assumption, the problem with the Contradiction of Divine Characteristics, as we shall henceforth refer to the logical conundrum posed by Dawkins, is that omniscience, or the quality of knowing everything, is the description of a capacity, it is not an action. Likewise, omnipotence, being all-powerful, is a similar description, which is why these nouns are most often used in their adjectival forms modifying other nouns, for example, an omniscient god is a god who knows everything, i.e. possesses all knowledge. But capacity does not necessarily indicate full utilization and possession does not dictate use; for example, by this point it should be clear that an intelligent scientist is nevertheless perfectly capable of writing something that is not intelligent at all.</p><p>Lest you think that this distinction between capacity and action is somehow tantamount to avoiding the question, note that Dawkins himself refers to God “using his omnipotence” in constructing the supposed contradiction.</p><p>Now, as I write this sentence, I am holding the book entitled <i>The God Delusion</i> in my hand. I paid cash for it at the bookstore prior to reading it through in its entirety, so I now possess the book in a very real and legally binding sense, and I feel sure that the reader will readily acknowledge that I therefore possess all of the knowledge contained within it in every relevant meaning of the term. But can I tell you the precise wording of the first sentence on the seventh page? Well, no, not without taking the action required to actually look at it.</p><p>This illustrates the difference between capacity and action, and the distinction is a vital one. Possession may be nine-tenths of the law, but it is not synonymous with use. Unless one clings stubbornly to an overly pedantic definition of both omniscience and omnipotence, an inherent incompatibility simply doesn’t exist between the two concepts. Indeed, if Daniel Dennett is correct and “knowledge really is power”, then logic not only dictates the compatibility of all-knowledge with all-power, but requires that the two superficially distinct concepts are actually one and the same. In this case, there not only is no contradiction between God’s omniscience and omnipotence, there is not even the theoretical possibility of a contradiction.</p><p>Regardless, a God who stands outside of space and time and who possesses all knowledge as well as all power is not bound to make use of his full capacities, indeed, who is going to shake their finger at him for failing to live up to his potential? Only the likes of Dawkins and Owens, one presumes, as their ability to logically disprove God’s existence by this method depends upon His abiding by their rigid definitions of His qualities… at least one of which He does not even claim in His Word.</p><p>When considered in this light, the Contradiction of Divine Characteristics can’t help but bring to mind a scene from the novel <i>Catch-22</i>, in which Joseph Heller wrote of an aptly named atheist called Frau Scheisskopf.</p><p><i>“’I don’t believe, ‘ she sobbed, bursting violently into tears. ‘But the God I don’t believe in is a good God, a just God, a merciful God. He’s not the mean and stupid God you make him out to be.’”</i></p><p>Furthermore, there is no theological significance whatsoever to a reduced form of omniscience and omnipotence that would satisfy even the most pedantic critical application of the logic. If one accepts the hypothesis that God is bound by logic and thereby imagines a God possessing qualities of tantiscience and tantipotence equating to omniscience and omnipotence minus the amount of knowledge and power required to avoid conflicting with the logical incompatibility, one is still left with a God whose theoretical capabilities are sufficient to fulfill all of the various claims about His knowledge and power made in His Word. Morever, from the human perspective, this logically acceptable tantiscient God would be completely indistinguishable from the omniscient one.</p><p>When it’s time to feed my Viszla, I don’t magically summon food from the mysterious bag of plenty. But my dog doesn’t know that. From his perspective, there’s no difference between my buying it at the store or my summoning it into material existence by the magic force of my divine will. Likewise, we are incapable of perceiving the difference between a god who knows everything and a god who merely knows a whole lot more than we do, moreover, the latter is the god that more closely fits the description of the Biblical God.</p><p>Dawkins, of course, knows that it is as pointless to logically consider the potential contradiction between two arbitrarily defined concepts as it is to argue over the score of the 1994 World Series; would that his acolytes understood as much themselves.</p><p><b>Omniderigence</b><br>DERIGO -rigere -rexi -rectum [to set straight, direct]; of placing [to order, dispose]; milit. [to draw up]; Transf., [to direct, aim, guide]<br>– <i>Latin Dictionary and Grammar Aid</i>, The University of Notre Dame.</br></br></p><p>Though it may at first seem to be a waste of time to analyze an argument that Dawkins himself doesn’t assign much value, it is important to remember that all things, even specious and superficial arguments for His nonexistence, may prove useful in serving the greater glory of God. That’s true in this case, for in considering the Contradiction of Divine Characteristics argument, we were forced to draw a distinct line between capacity and action, the confusion of which is also the root of a much more serious theological error. Interestingly, this theological error is committed by Christians as readily as atheists, perhaps even more often, as they trust in God’s plan for their lives instead of making use of their God-given intelligence and free will.</p><p>There are a variety of phrases which contain the same inherent implication about a certain view of God. Many evangelical Christians often refer to “God’s perfect plan” for their lives. This concept is reinforced with children’s songs such as “He’s got the whole world in his hands” and echoed by sports stars who compete in the assurance that their victory has been divinely secured ahead of time. It is held by American Exceptionalists who believe that God has uniquely blessed the United States of America and has authored a Manifest Destiny for it, and by Christian Zionists who see a divine hand in every violent twist and turn of the Mideast Peace Process.</p><p>These various evangelicals have an unexpected ally in Sam Harris, who declares it to be an obvious truth that “if God exists, he is the most prolific abortionist of all” due to the fact that 20 percent of all known pregnancies miscarry, and then asserts that those who believe in God should be obliged to present evidence for his existence in light of “the relentless destruction of innocent human beings that we witness in the world each day.”</p><p>What the evangelical and the atheist have in common here is a belief that because God is omnipotent, omniscient and compassionate, he is somehow responsible for these events, although Harris would qualify that with the necessary “if he exists”. And in fairness, it must be pointed out that when Harris cites Hurricane Katrina and the 2004 Asian tsunami as God’s failure to protect humanity, he is really doing rather better than the “perfect plan” evangelical who would assert that these tragedies were sent by God for some ineffable higher purpose intended to benefit humanity.</p><p>This belief in an all-acting God, who not only guides the grand course of events but actually micromanages them, is the result of the same confusion between capacity and action that we saw in the Contradiction of Divine Characteristics. When God asserts that He cares about the sparrows and knows when one falls from its branch, this is very different from an assertion that He only happens to know about it because He personally struck the sparrow down. An omniscient God knows the numbers of hairs on your head and an omnipotent God is capable of changing their color, but it requires an active Master Puppeteer to personally pluck them, one by one, from your balding head, in the desired order.</p><p>Sadly, the English language appears to lack a word describing such a god, even though this is the way that many individuals, even those who do not believe in Him, believe God behaves. So, as Richard Dawkins coined the very useful word “meme”, it appears to have fallen to me to invent a word that is, despite its undeniable utility, rather less likely to be dropped into conversations at coffeehouses for sheer effect.</p><p>Hence the term “omniderigence”, which I define as: ‘making infinite use of unlimited or universal power, authority, or force; all-controlling; all-dictating.” Less formally, one can think of it as uber control-freakdom or ultimate puppet-mastery.</p><p>In <i>Letter to a Christian Nation</i>, Sam Harris shows how this mistaken belief in God’s omniderigence is part and parcel of the atheist case against God.</p></div>",
  "content_text": "The question of the nature of God’s knowledge came up in a recent Darkstream. So as not to repeat myself unnecessarily, I will simply post this selection from\nThe Irrational Atheist\nwhich still represents my thoughts on the matter. I make no pretense of being a theologian, nor do I claim that I must be correct on the matter, they are simply my thoughts and conclusions concerning the concepts of divine omnipotence and divine omniscience.\nMASTER OF PUPPETS OR GAME DESIGNER?\n“She was an atheist, but she was a Lutheran atheist, so she knew exactly what God she didn’t believe in.”\n– Garrison Keillor,\nWobegon Boy\nDoubts about the existence of God, particularly the existence of a good and loving God, often stem from great emotional pain. While doubts are naturally bound to occur to any rational individual in moments of somber reflection, it is particularly hard to imagine that a loving God who loves us would choose to intentionally inflict pain upon us, especially if He is all-powerful. When one surveys the long list of horrors that have engulfed countless men, women and children throughout the course of history, the vast majority of them innocent and undeserving of such evil fates, one finds it easy to sympathize with the individual who concludes that God, if He exists and is paying attention to humanity, must be some sort of divine sadist.\nBecause doubts are reasonable, normal and inevitable, they should never be brushed aside, belittled or answered with a glib phrase, for not only does decency demand that they receive a sensitive hearing, but also because they can have powerful ramifications that resonate long after the doubter himself has had them resolved one way or another. Randal Keynes, a descendant and biographer of Charles Darwin, asserts that it was the death of Darwin’s beloved daughter Annie, at the age of ten after a long illness that convicted the great evolutionist of his dangerous idea that neither divine intervention nor morality had anything to do with the operation of the natural laws. And if this tragic loss was not the only element involved in Darwin’s transition from an accomplished student of theology to the inventor of what today is the primary driving force behind the anti-theist New Atheism, it is widely considered to have been the final step that pushed him over the edge.\nOne would not be human if one could not sympathize with Darwin’s anguished rejection of the notion that there was any justice or even a silver lining to be found in the death of his beautiful little girl. And perhaps there was some consolation, if any consolation was to be found, in viewing his terrible loss as taking place within the context of a mechanistic universe, wherein one was not subject to the ineffable caprice of an unpredictable deity, but to the predictable operation of natural laws which one could at least hope to understand and attempt to utilize.\nBut if God exists, it is a basic theological error to attempt to place the blame for earthly tragedies on Him. In fact, it is not only a theological error, but also a fundamental error of logic to conclude that God, even an all-powerful God, must be to blame for every evil, accident or tragedy that befalls us.\nThe Contradiction of Divine Characteristics\nIn a chapter considering the arguments for God’s existence, Richard Dawkins muses briefly upon what he considers to be a logical contradiction. He writes:\nIncidentally, it has not escaped the notice of logicians that omniscience and omnipotence are mutually incompatible. If God is omniscient, he must already know how he is going to intervene to change the course of history using his omnipotence. But that means he can’t change his mind about his intervention, which means he is not omnipotent.\nAs Dawkins surely knows, this is a silly and superficial argument, indeed, he follows it up with a little piece of doggerel by Karen Owens before promptly abandoning the line of reasoning in favor of a return to his attack upon Thomas Aquinas. While the argument appears to make sense at first glance, it’s merely a variation on the deeply philosophical question that troubles so many children and atheists, of whether God can create a rock so heavy that He cannot lift it.\nFirst, it is important to note that the Christian God, the god towards whom Dawkins directs the great majority of his attacks, makes no broad claims to omniscience. Although there are 87 references to the specific things that the Biblical God knows, only a single example could even potentially be interpreted as a universal claim to complete knowledge. Among the things that God claims to know are the following:\nHe knows the way to wisdom and where it dwells, he knows the day of the wicked is coming, he knows the secrets of men’s hearts, he knows the thoughts of men and their futility. He knows the proud from afar, he knows what lies in darkness, and he knows what you need before you ask him. He knows the Son, he knows the day and the hour that the heavens and the earth shall pass away, he knows the mind of the Spirit and that the Apostle Paul loved the Corinthians. He knows who are his, he knows how to rescue godly men from trials, and perhaps most importantly, he knows that the thoughts of the wise are futile.\nThe only straightforward claim to omniscience is made on God’s behalf by the apostle John, who clearly states “he knows everything”. However, the context in which the statement is made also indicates that this particular “everything” is not intended to encompass Life and The Universe, but rather everything about human hearts. Not only does this interpretation make more sense in light of the verse than with an inexplicable revelation of a divine quality that appears nowhere else in the Bible, but it is also in keeping with many previous statements made about God’s knowledge.\nAfter all, when Hercule Poirot confronts the murderer in an Agatha Christie novel and informs the killer that he knows everything, the educated reader does not usually interpret this as a statement that the Belgian detective is confessing that he is the physical manifestation of Hermes Trismegistus, but rather that he knows everything\nabout the crime\nhe has been detecting.\nIn keeping with this interpretation, Dr. Greg Boyd, the pastor at Woodland Hills Church and the author of\nLetters to a Skeptic\n, has written a book laying out a convincing case for the Open View of God, which among other things chronicles the many Biblical examples of God being surprised, changing His mind and even being thwarted. Moreover, it would be very, very strange for a presumably intelligent being such as Satan to place a bet with God if he believed that God knew with certainty what Job’s reaction to his torments would be.\nBut in addition to the fact that it is based on a false assumption, the problem with the Contradiction of Divine Characteristics, as we shall henceforth refer to the logical conundrum posed by Dawkins, is that omniscience, or the quality of knowing everything, is the description of a capacity, it is not an action. Likewise, omnipotence, being all-powerful, is a similar description, which is why these nouns are most often used in their adjectival forms modifying other nouns, for example, an omniscient god is a god who knows everything, i.e. possesses all knowledge. But capacity does not necessarily indicate full utilization and possession does not dictate use; for example, by this point it should be clear that an intelligent scientist is nevertheless perfectly capable of writing something that is not intelligent at all.\nLest you think that this distinction between capacity and action is somehow tantamount to avoiding the question, note that Dawkins himself refers to God “using his omnipotence” in constructing the supposed contradiction.\nNow, as I write this sentence, I am holding the book entitled\nThe God Delusion\nin my hand. I paid cash for it at the bookstore prior to reading it through in its entirety, so I now possess the book in a very real and legally binding sense, and I feel sure that the reader will readily acknowledge that I therefore possess all of the knowledge contained within it in every relevant meaning of the term. But can I tell you the precise wording of the first sentence on the seventh page? Well, no, not without taking the action required to actually look at it.\nThis illustrates the difference between capacity and action, and the distinction is a vital one. Possession may be nine-tenths of the law, but it is not synonymous with use. Unless one clings stubbornly to an overly pedantic definition of both omniscience and omnipotence, an inherent incompatibility simply doesn’t exist between the two concepts. Indeed, if Daniel Dennett is correct and “knowledge really is power”, then logic not only dictates the compatibility of all-knowledge with all-power, but requires that the two superficially distinct concepts are actually one and the same. In this case, there not only is no contradiction between God’s omniscience and omnipotence, there is not even the theoretical possibility of a contradiction.\nRegardless, a God who stands outside of space and time and who possesses all knowledge as well as all power is not bound to make use of his full capacities, indeed, who is going to shake their finger at him for failing to live up to his potential? Only the likes of Dawkins and Owens, one presumes, as their ability to logically disprove God’s existence by this method depends upon His abiding by their rigid definitions of His qualities… at least one of which He does not even claim in His Word.\nWhen considered in this light, the Contradiction of Divine Characteristics can’t help but bring to mind a scene from the novel\nCatch-22\n, in which Joseph Heller wrote of an aptly named atheist called Frau Scheisskopf.\n“’I don’t believe, ‘ she sobbed, bursting violently into tears. ‘But the God I don’t believe in is a good God, a just God, a merciful God. He’s not the mean and stupid God you make him out to be.’”\nFurthermore, there is no theological significance whatsoever to a reduced form of omniscience and omnipotence that would satisfy even the most pedantic critical application of the logic. If one accepts the hypothesis that God is bound by logic and thereby imagines a God possessing qualities of tantiscience and tantipotence equating to omniscience and omnipotence minus the amount of knowledge and power required to avoid conflicting with the logical incompatibility, one is still left with a God whose theoretical capabilities are sufficient to fulfill all of the various claims about His knowledge and power made in His Word. Morever, from the human perspective, this logically acceptable tantiscient God would be completely indistinguishable from the omniscient one.\nWhen it’s time to feed my Viszla, I don’t magically summon food from the mysterious bag of plenty. But my dog doesn’t know that. From his perspective, there’s no difference between my buying it at the store or my summoning it into material existence by the magic force of my divine will. Likewise, we are incapable of perceiving the difference between a god who knows everything and a god who merely knows a whole lot more than we do, moreover, the latter is the god that more closely fits the description of the Biblical God.\nDawkins, of course, knows that it is as pointless to logically consider the potential contradiction between two arbitrarily defined concepts as it is to argue over the score of the 1994 World Series; would that his acolytes understood as much themselves.\nOmniderigence\nDERIGO -rigere -rexi -rectum [to set straight, direct]; of placing [to order, dispose]; milit. [to draw up]; Transf., [to direct, aim, guide]\n–\nLatin Dictionary and Grammar Aid\n, The University of Notre Dame.\nThough it may at first seem to be a waste of time to analyze an argument that Dawkins himself doesn’t assign much value, it is important to remember that all things, even specious and superficial arguments for His nonexistence, may prove useful in serving the greater glory of God. That’s true in this case, for in considering the Contradiction of Divine Characteristics argument, we were forced to draw a distinct line between capacity and action, the confusion of which is also the root of a much more serious theological error. Interestingly, this theological error is committed by Christians as readily as atheists, perhaps even more often, as they trust in God’s plan for their lives instead of making use of their God-given intelligence and free will.\nThere are a variety of phrases which contain the same inherent implication about a certain view of God. Many evangelical Christians often refer to “God’s perfect plan” for their lives. This concept is reinforced with children’s songs such as “He’s got the whole world in his hands” and echoed by sports stars who compete in the assurance that their victory has been divinely secured ahead of time. It is held by American Exceptionalists who believe that God has uniquely blessed the United States of America and has authored a Manifest Destiny for it, and by Christian Zionists who see a divine hand in every violent twist and turn of the Mideast Peace Process.\nThese various evangelicals have an unexpected ally in Sam Harris, who declares it to be an obvious truth that “if God exists, he is the most prolific abortionist of all” due to the fact that 20 percent of all known pregnancies miscarry, and then asserts that those who believe in God should be obliged to present evidence for his existence in light of “the relentless destruction of innocent human beings that we witness in the world each day.”\nWhat the evangelical and the atheist have in common here is a belief that because God is omnipotent, omniscient and compassionate, he is somehow responsible for these events, although Harris would qualify that with the necessary “if he exists”. And in fairness, it must be pointed out that when Harris cites Hurricane Katrina and the 2004 Asian tsunami as God’s failure to protect humanity, he is really doing rather better than the “perfect plan” evangelical who would assert that these tragedies were sent by God for some ineffable higher purpose intended to benefit humanity.\nThis belief in an all-acting God, who not only guides the grand course of events but actually micromanages them, is the result of the same confusion between capacity and action that we saw in the Contradiction of Divine Characteristics. When God asserts that He cares about the sparrows and knows when one falls from its branch, this is very different from an assertion that He only happens to know about it because He personally struck the sparrow down. An omniscient God knows the numbers of hairs on your head and an omnipotent God is capable of changing their color, but it requires an active Master Puppeteer to personally pluck them, one by one, from your balding head, in the desired order.\nSadly, the English language appears to lack a word describing such a god, even though this is the way that many individuals, even those who do not believe in Him, believe God behaves. So, as Richard Dawkins coined the very useful word “meme”, it appears to have fallen to me to invent a word that is, despite its undeniable utility, rather less likely to be dropped into conversations at coffeehouses for sheer effect.\nHence the term “omniderigence”, which I define as: ‘making infinite use of unlimited or universal power, authority, or force; all-controlling; all-dictating.” Less formally, one can think of it as uber control-freakdom or ultimate puppet-mastery.\nIn\nLetter to a Christian Nation\n, Sam Harris shows how this mistaken belief in God’s omniderigence is part and parcel of the atheist case against God.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-07T15:29:36+00:00"
}