{
  "url": "https://voxday.net/2018/12/14/skepticism-required-here/",
  "scraped_at": "2025-12-20T05:20:57.637608",
  "title": "Skepticism required here",
  "date_display": "December 14, 2018",
  "date_iso": "2018-12-14T09:50:58+00:00",
  "date_from_url": "2018-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As usual, expressing anything but perfect and unshakeable faith in the total accuracy of the U.S. government’s Official Story concerning the Apollo Program and the Moon landings has the Moonies out in full frothing force. I find this more than a little amusing, as many of the Moonies believe that the U.S. government lies about absolutely everything else, <i>but not this</i>, dammit!</p><p>Seriously, what are the chances that despite the various anomalies and falsehoods that have been exposed and uncovered concerning these events over the years, that what remains is the pure, unvarnished truth? That is simply ludicrous. It is theoretically possible, but given what we know about the vagaries of human nature, it is extremely improbable. Some of the responses to my post yesterday and <a href=\"https://www.youtube.com/watch?v=4lONnYsxpXo\">the subsequent Darkstream</a> connecting the false narrative being pushed concerning the Yellow Vest Protests and the Moon landing narrative were informative.</p><blockquote class=\"tr_bq\"><p>You are now Unfollowed from my Feedly. There will never be enough time to follow nutjobs, even if I live to 1,000,000.</p></blockquote><p>Fine by me. I have no desire to be followed by unquestioning, credulous individuals who unquestioningly swallow everything they are told by an Authority. Jordan Peterson will doubtless be more your style.</p><blockquote class=\"tr_bq\"><p>Come on Vox, if anyone else but Owen Benjamin was proposing this you would dismiss him as a crank. If the moon landing was a hoax, you’d think there would have been something about it in the Soviet archives. </p></blockquote><p>Totally false. I wrote <a href=\"http://voxday.blogspot.com/2006/08/fortuitous-loss.html\">about my skepticism concerning the Official Story of the Moon landings</a> 12 years ago. Now, I have not said that the Moon landings were a hoax, I have only observed that I do not believe the Official Story concerning them. I don’t know what people are lying about or the full extent of their lies and deception, I only know that the Official Story is not entirely true. That does not mean it is entirely false.</p><blockquote class=\"tr_bq\"><p>Great. We send people here, people on the cusp of some important realizations and recognitions. We tell them “read, critically of course, but with an open mind.” And they come back and look at us pityingly and say “you mean read the guy who says the moon landings were faked?” As a strategy of separation, this is not going to yield the group you want.</p></blockquote><p>This is written by someone who is clearly new here. If these people on the cusp of some important realizations are such inept readers as to somehow conclude that I am a guy “who says the moon landings are faked”, I definitely don’t want them here. Because that simply is not true. Agnosticism is not skepticism is not denial.</p><blockquote class=\"tr_bq\"><p>Damnit, Vox. Dread Ilk. You assholes. You’re going to drag out this topic. You’re going to question the fucking moon landing. I can’t believe this.  I love astronomy. Love space. Love space news. The Pluto flyby was awesome. The GAIA data is incredible. I can’t wait for the resulting image from the Event Horizon Telescope project. And now…you assholes are going to tell me the moon landing wasn’t real. But…I…I know. I can see how it is a lie. After seeing the government lie about monumental things throughout my life, I can see the pattern. I cannot deny this possibility. </p></blockquote><p>A lot of things can be faked, for one reason or another. But being surprised at habitual liars lying, well, that’s like being surprised every time you drop a ball and it hits the ground.</p><blockquote class=\"tr_bq\"><p>This is all HORRIBLE rhetoric for VD and Owen. I don’t know what the hell these guys are thinking. Not only does it make them look crazy to the normies AND the people with a science/engineering background, but it also shits all over the greatest achievement of European man, the one achievement that we know will have monuments lasting a million years. </p></blockquote><p>It’s not rhetoric, at least, not in my case. As usual, Vox’s First Law applies: <i>any sufficiently advanced intelligence is indistinguishable from insanity.</i> It would be impossible to exaggerate my lack of concern about how people with one-half to two-thirds of my IQ happen to regard me. That’s like being concerned about being informed that my son’s dog has doubts about my thoughts on free trade.</p><blockquote class=\"tr_bq\"><p>It’s also worth noting that VD didn’t say the landing didn’t happen. He said there are enough indicators to know that some aspect of the official narrative isn’t true which could or could not include the landing.</p></blockquote><p>Exactly. It’s always intriguing to see people who literally can’t read or understand what I wrote puffing out their chests and loftily offering to explain to me how every single aspect of the Official Story of the Apollo program and the Moon landings is not only absolutely true, but utterly beyond the possibility of any questioning whatsoever.</p><p>With that in mind, watch this and listen to the unusual, carefully chosen language about “participating in an adventure… on and about the Moon.”</p><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/-RcKLAo62Ro\" width=\"512\"></iframe></div><p>Now, I don’t know why three of the greatest heroes of humanity are behaving in such a deceptive and shady manner after accomplishing one of the greatest, if not the greatest feats in the recorded history of Man. I don’t know what they are hiding, or what it is that they are so obviously attempting to avoid saying. Owen Benjamin has proposed one potential explanation, others have provided a wide variety of other possibilities. I don’t even pretend to know which is correct; I am genuinely agnostic on the subject. But one thing I have observed through my studies of history is that the objective truth that holds up over time very often diverges from both the Official Story as well as the primary alternative theories posited by the skeptics.</p><p>And since I don’t believe the GDP figures that are released by the U.S. government on a regular basis, and I don’t accept any of the various justifications that are offered for its various foreign adventures, why would you ever expect me to believe everything the U.S. government says about its historical accomplishments?</p></div>",
  "content_text": "As usual, expressing anything but perfect and unshakeable faith in the total accuracy of the U.S. government’s Official Story concerning the Apollo Program and the Moon landings has the Moonies out in full frothing force. I find this more than a little amusing, as many of the Moonies believe that the U.S. government lies about absolutely everything else,\nbut not this\n, dammit!\nSeriously, what are the chances that despite the various anomalies and falsehoods that have been exposed and uncovered concerning these events over the years, that what remains is the pure, unvarnished truth? That is simply ludicrous. It is theoretically possible, but given what we know about the vagaries of human nature, it is extremely improbable. Some of the responses to my post yesterday and\nthe subsequent Darkstream\nconnecting the false narrative being pushed concerning the Yellow Vest Protests and the Moon landing narrative were informative.\nYou are now Unfollowed from my Feedly. There will never be enough time to follow nutjobs, even if I live to 1,000,000.\nFine by me. I have no desire to be followed by unquestioning, credulous individuals who unquestioningly swallow everything they are told by an Authority. Jordan Peterson will doubtless be more your style.\nCome on Vox, if anyone else but Owen Benjamin was proposing this you would dismiss him as a crank. If the moon landing was a hoax, you’d think there would have been something about it in the Soviet archives.\nTotally false. I wrote\nabout my skepticism concerning the Official Story of the Moon landings\n12 years ago. Now, I have not said that the Moon landings were a hoax, I have only observed that I do not believe the Official Story concerning them. I don’t know what people are lying about or the full extent of their lies and deception, I only know that the Official Story is not entirely true. That does not mean it is entirely false.\nGreat. We send people here, people on the cusp of some important realizations and recognitions. We tell them “read, critically of course, but with an open mind.” And they come back and look at us pityingly and say “you mean read the guy who says the moon landings were faked?” As a strategy of separation, this is not going to yield the group you want.\nThis is written by someone who is clearly new here. If these people on the cusp of some important realizations are such inept readers as to somehow conclude that I am a guy “who says the moon landings are faked”, I definitely don’t want them here. Because that simply is not true. Agnosticism is not skepticism is not denial.\nDamnit, Vox. Dread Ilk. You assholes. You’re going to drag out this topic. You’re going to question the fucking moon landing. I can’t believe this.  I love astronomy. Love space. Love space news. The Pluto flyby was awesome. The GAIA data is incredible. I can’t wait for the resulting image from the Event Horizon Telescope project. And now…you assholes are going to tell me the moon landing wasn’t real. But…I…I know. I can see how it is a lie. After seeing the government lie about monumental things throughout my life, I can see the pattern. I cannot deny this possibility.\nA lot of things can be faked, for one reason or another. But being surprised at habitual liars lying, well, that’s like being surprised every time you drop a ball and it hits the ground.\nThis is all HORRIBLE rhetoric for VD and Owen. I don’t know what the hell these guys are thinking. Not only does it make them look crazy to the normies AND the people with a science/engineering background, but it also shits all over the greatest achievement of European man, the one achievement that we know will have monuments lasting a million years.\nIt’s not rhetoric, at least, not in my case. As usual, Vox’s First Law applies:\nany sufficiently advanced intelligence is indistinguishable from insanity.\nIt would be impossible to exaggerate my lack of concern about how people with one-half to two-thirds of my IQ happen to regard me. That’s like being concerned about being informed that my son’s dog has doubts about my thoughts on free trade.\nIt’s also worth noting that VD didn’t say the landing didn’t happen. He said there are enough indicators to know that some aspect of the official narrative isn’t true which could or could not include the landing.\nExactly. It’s always intriguing to see people who literally can’t read or understand what I wrote puffing out their chests and loftily offering to explain to me how every single aspect of the Official Story of the Apollo program and the Moon landings is not only absolutely true, but utterly beyond the possibility of any questioning whatsoever.\nWith that in mind, watch this and listen to the unusual, carefully chosen language about “participating in an adventure… on and about the Moon.”\nNow, I don’t know why three of the greatest heroes of humanity are behaving in such a deceptive and shady manner after accomplishing one of the greatest, if not the greatest feats in the recorded history of Man. I don’t know what they are hiding, or what it is that they are so obviously attempting to avoid saying. Owen Benjamin has proposed one potential explanation, others have provided a wide variety of other possibilities. I don’t even pretend to know which is correct; I am genuinely agnostic on the subject. But one thing I have observed through my studies of history is that the objective truth that holds up over time very often diverges from both the Official Story as well as the primary alternative theories posited by the skeptics.\nAnd since I don’t believe the GDP figures that are released by the U.S. government on a regular basis, and I don’t accept any of the various justifications that are offered for its various foreign adventures, why would you ever expect me to believe everything the U.S. government says about its historical accomplishments?",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-14T09:50:58+00:00"
}