{
  "url": "https://voxday.net/2018/12/12/that-answers-that-question-2/",
  "scraped_at": "2025-12-20T05:20:37.502252",
  "title": "That answers that question",
  "date_display": "December 12, 2018",
  "date_iso": "2018-12-12T06:04:32+00:00",
  "date_from_url": "2018-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In last night’s Darkstream, I was asked repeatedly about someone called “Michael Knowles”. I’ve never heard of the man, but I was immediately dubious because he was being praised because he “owns the libs”. It would appear my instincts <a href=\"https://www.vanityfair.com/news/2018/12/how-hollywood-invented-ben-shapiro\">were entirely correct</a>:</p><blockquote><p>The Daily Wire headquarters in Los Angeles, located on the second floor of a vaguely art deco building in Sherman Oaks, is more reminiscent of a high-end television studio than a dingy online start-up. The lobby is lined with monitors advertising Daily Wire shows, millennials chug La Croix in a well-appointed kitchen, and a full-time makeup artist is always on call. Each of the meticulously designed and personalized sets are stuffed with enough high-end cameras, soundproofing, and lighting equipment to rival the best cable-news studios—a significant investment for online shows. Currently, the site has four personalities that are promoted regularly: Andrew Klavan, an old crank they brought over from Truth Revolt; Michael Knowles, a dapper, lib-triggering troll; Matt Walsh, a dour, self-described “extremist” Christian raging against the crassness of pop-culture; and Shapiro himself. Once a month, Boreing hosts a live show in his office—an elegant man cave featuring studio lighting, a massive cigar humidor, and several overstuffed leather armchairs—where he, the crew, and a special guest smoke cigars and shoot the shit. Though the studios are Hollywood, the content is decidedly not: in one recent Daily Wire Backstage show, for instance, the hosts discussed Judeo-Christian theology, religious history, and the pathology of the sort of perpetually aggrieved liberal who thinks Rudolph the Red-Nosed Reindeer is politically incorrect. (The War on Christmas is apparently alive and well in the San Fernando Valley.)</p></blockquote><p>These guys are all well-funded frauds. Think about this: why do these nobodies and non-entities keep popping up? Who is funding their Facebook and YouTube placement? Who is buying their Twitter followers. Why do they inevitably oppose nationalism and Donald Trump? Why do they constantly lie about “Judeo-Christianity”.</p><p>None of it – literally none of it – is organic or natural. Ben Shapiro is still trying to act as if he’s all about ideas, well, read his columns or his books! They are qualitatively little different from the Republican talking point columns he used to write at WND when he was a teenage political prodigy. There are no new ideas there, to the contrary, it’s been the same boilerplate for nearly 20 years.</p><p>What <i>Vanity Fair </i>is trying to do here is the same thing that the <i>New York Times</i> tried to do with the “Intellectual Dark Web”. They’re attempting to anoint their approved opposition, they are trying to choose the roster of the Washington Generals.</p></div>",
  "content_text": "In last night’s Darkstream, I was asked repeatedly about someone called “Michael Knowles”. I’ve never heard of the man, but I was immediately dubious because he was being praised because he “owns the libs”. It would appear my instincts\nwere entirely correct\n:\nThe Daily Wire headquarters in Los Angeles, located on the second floor of a vaguely art deco building in Sherman Oaks, is more reminiscent of a high-end television studio than a dingy online start-up. The lobby is lined with monitors advertising Daily Wire shows, millennials chug La Croix in a well-appointed kitchen, and a full-time makeup artist is always on call. Each of the meticulously designed and personalized sets are stuffed with enough high-end cameras, soundproofing, and lighting equipment to rival the best cable-news studios—a significant investment for online shows. Currently, the site has four personalities that are promoted regularly: Andrew Klavan, an old crank they brought over from Truth Revolt; Michael Knowles, a dapper, lib-triggering troll; Matt Walsh, a dour, self-described “extremist” Christian raging against the crassness of pop-culture; and Shapiro himself. Once a month, Boreing hosts a live show in his office—an elegant man cave featuring studio lighting, a massive cigar humidor, and several overstuffed leather armchairs—where he, the crew, and a special guest smoke cigars and shoot the shit. Though the studios are Hollywood, the content is decidedly not: in one recent Daily Wire Backstage show, for instance, the hosts discussed Judeo-Christian theology, religious history, and the pathology of the sort of perpetually aggrieved liberal who thinks Rudolph the Red-Nosed Reindeer is politically incorrect. (The War on Christmas is apparently alive and well in the San Fernando Valley.)\nThese guys are all well-funded frauds. Think about this: why do these nobodies and non-entities keep popping up? Who is funding their Facebook and YouTube placement? Who is buying their Twitter followers. Why do they inevitably oppose nationalism and Donald Trump? Why do they constantly lie about “Judeo-Christianity”.\nNone of it – literally none of it – is organic or natural. Ben Shapiro is still trying to act as if he’s all about ideas, well, read his columns or his books! They are qualitatively little different from the Republican talking point columns he used to write at WND when he was a teenage political prodigy. There are no new ideas there, to the contrary, it’s been the same boilerplate for nearly 20 years.\nWhat\nVanity Fair\nis trying to do here is the same thing that the\nNew York Times\ntried to do with the “Intellectual Dark Web”. They’re attempting to anoint their approved opposition, they are trying to choose the roster of the Washington Generals.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-12T06:04:32+00:00"
}