{
  "url": "https://voxday.net/2018/12/07/the-best-blogger/",
  "scraped_at": "2025-12-20T05:19:56.054790",
  "title": "“The best blogger”",
  "date_display": "December 7, 2018",
  "date_iso": "2018-12-07T21:00:06+00:00",
  "date_from_url": "2018-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://charltonteaching.blogspot.com/2018/12/who-is-best-blogger.html\">This is very flattering</a>, particularly as the designation comes from an intellectual for whom I have a considerable amount of respect, and to whom I really should link more often:</p><blockquote><p>Blogs are clearly on the way out, and many of the best bloggers have gone – but let’s just express our opinion on who is – overall – the best blogger… Leaving-out myself (!) and also my co-bloggers at Albion Awakening and Junior Ganymede (because we are really the best ? – then who do you think is the best?</p><p>My vote goes to Vox Day (Theodore Beale) – whose blog is quite remarkable in terms of posting very frequently, across a wide range, and with great ‘originality’ – in the sense that he is so inventive and so good at discovering, elaborating and refining ideas.</p></blockquote><p>Read the rest of it there. And also read <a href=\"https://charltonteaching.blogspot.com/2018/12/what-makes-modern-people-naturally.html\">this post</a>, which should demonstrate why I have a high opinion of Prof. Charlton’s perspicacity beyond his excellent taste in bloggers.</p><blockquote><p>What makes modern people ‘naturally’ disbelieve in God?</p><p>(My answer; speaking from the experience of several decades of living as an atheist…)</p><p>The fact that all modern public discourse excludes the divine.</p><p>As a modern child grows up, he becomes socialised, he becomes trained in modern public discourse of many kinds: school work, everything to do with the mass media, sports, pastimes, hobbies… and all of these exclude the divine.</p><p>It Just Isn’t There. The lexicon of objects that function in the system  exclude the divine; the causality of the system excludes the divine.</p><p>As the child reaches adolescence – these modes of thought become more dominant, and they become habitual to the extent of being simply taken for granted; and eventually they become so habitual as to be extremely difficult to break out from.</p></blockquote><p>Culture matters and the globos know it. That’s why they have been <i>relentlessly</i> campaigning to force Christianity out of the public spaces, by hook, crook, and Christmas carol, for generations.</p></div>",
  "content_text": "This is very flattering\n, particularly as the designation comes from an intellectual for whom I have a considerable amount of respect, and to whom I really should link more often:\nBlogs are clearly on the way out, and many of the best bloggers have gone – but let’s just express our opinion on who is – overall – the best blogger… Leaving-out myself (!) and also my co-bloggers at Albion Awakening and Junior Ganymede (because we are really the best ? – then who do you think is the best?\nMy vote goes to Vox Day (Theodore Beale) – whose blog is quite remarkable in terms of posting very frequently, across a wide range, and with great ‘originality’ – in the sense that he is so inventive and so good at discovering, elaborating and refining ideas.\nRead the rest of it there. And also read\nthis post\n, which should demonstrate why I have a high opinion of Prof. Charlton’s perspicacity beyond his excellent taste in bloggers.\nWhat makes modern people ‘naturally’ disbelieve in God?\n(My answer; speaking from the experience of several decades of living as an atheist…)\nThe fact that all modern public discourse excludes the divine.\nAs a modern child grows up, he becomes socialised, he becomes trained in modern public discourse of many kinds: school work, everything to do with the mass media, sports, pastimes, hobbies… and all of these exclude the divine.\nIt Just Isn’t There. The lexicon of objects that function in the system  exclude the divine; the causality of the system excludes the divine.\nAs the child reaches adolescence – these modes of thought become more dominant, and they become habitual to the extent of being simply taken for granted; and eventually they become so habitual as to be extremely difficult to break out from.\nCulture matters and the globos know it. That’s why they have been\nrelentlessly\ncampaigning to force Christianity out of the public spaces, by hook, crook, and Christmas carol, for generations.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-07T21:00:06+00:00"
}