{
  "url": "https://voxday.net/2018/12/02/the-cult-of-the-secret-king/",
  "scraped_at": "2025-12-20T05:19:06.821168",
  "title": "The Cult of the Secret King",
  "date_display": "December 2, 2018",
  "date_iso": "2018-12-02T16:00:02+00:00",
  "date_from_url": "2018-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now there’s a turn of phrase I wish I had thought of myself. But full credit to Adam Piggott, Gentleman Adventurer, who coined it while writing <a href=\"https://pushingrubberdownhill.com/2018/12/02/book-review-jordanetics-a-journey-into-the-mind-of-humanitys-greatest-thinker/\">his review of Jordanetics</a>:</p><blockquote><p>Vox Day quotes Peterson regularly throughout the book, and nothing damns a charlatan so much as the act of exposing his lies to the direct sunlight of truth. What struck me every time I read a passage attributed to Peterson was the complete absence of clarity in his written word. In contrast to the plain language that Day uses, Peterson’s sentences are convoluted labyrinths of madness. But his skill lies in spreading just enough recognizable symbolism throughout his screed that an intelligent reader will both identify with the text while simultaneously refusing to admit that he has not actually understood it.</p><p>In other words, Peterson preys on people’s inherent narcissism and their tendency to project…. Peterson’s entire goal is to subvert those men who are on the cusp of acting on their questioning of the prevailing prog orthodoxy by rejecting globalism for nationalism. He does this by sucking them in with seemingly helpful platitudes to clean their room and take their pills but which themselves actually mask his true intentions. He desires a world-wide collective of mediocre automatons who will keep their mouths closed and will not act. In other words, they won’t get in the way. Far from building better men, his aim is to keep men in the nightmare of the gamma by ostensibly shielding them from the hell of the physical world with rules that perversely condemn them to circle a drain while under the delusion that they’re moving forward.</p><p>Peterson is a coward and like all cowards he can only better himself by attempting to bring everyone else down to his own level. He inhabits a world of lies and exploitation and he encourages his followers to get into a metaphorical bed with him while promising to reveal to them his secrets of power and success. Peterson is the self anointed special one and he makes the following demands of his acolytes: are you worthy enough to walk in my footsteps, and how high can you climb on my imaginary dominance hierarchy?</p><p>It was beyond my powers to penetrate the layers of concealment that Peterson employs to mask his true nature, but Vox Day is the man for the task. His book brilliantly exposes the evil intentions of this false prophet and while doing so reveals the utter worthlessness of the subject himself. How anyone could possibly take Peterson seriously after reading this book let alone follow him is beyond me.</p></blockquote><p>Help the low-status lobsters in your life escape the cowardly Cult of the Secret King by giving them a copy of <i><a href=\"https://www.amazon.com/Jordanetics-Journey-Humanitys-Greatest-Thinker-ebook/dp/B07JY9XV38/\">Jordanetics</a></i>, still the #1 bestseller in Political Philosophy. Amazon isn’t shipping the paperback yet, but Castalia Direct <a href=\"https://aerbook.com/maker/productcard-4283759-1875.html\">has it in stock</a>.</p><p>This review is particularly interesting because Peterson has previously whined on Twitter about being criticized by Adam Piggott. It should be amusing to see how much longer he will persist in trying to respond indirectly to <i>Jordanetics </i>without actually mentioning it by name or addressing any of its highly specific contentions. Perhaps he should try a leaf out of Janet Reno’s playbook. Dance party makes the bad book go away!</p></div>",
  "content_text": "Now there’s a turn of phrase I wish I had thought of myself. But full credit to Adam Piggott, Gentleman Adventurer, who coined it while writing\nhis review of Jordanetics\n:\nVox Day quotes Peterson regularly throughout the book, and nothing damns a charlatan so much as the act of exposing his lies to the direct sunlight of truth. What struck me every time I read a passage attributed to Peterson was the complete absence of clarity in his written word. In contrast to the plain language that Day uses, Peterson’s sentences are convoluted labyrinths of madness. But his skill lies in spreading just enough recognizable symbolism throughout his screed that an intelligent reader will both identify with the text while simultaneously refusing to admit that he has not actually understood it.\nIn other words, Peterson preys on people’s inherent narcissism and their tendency to project…. Peterson’s entire goal is to subvert those men who are on the cusp of acting on their questioning of the prevailing prog orthodoxy by rejecting globalism for nationalism. He does this by sucking them in with seemingly helpful platitudes to clean their room and take their pills but which themselves actually mask his true intentions. He desires a world-wide collective of mediocre automatons who will keep their mouths closed and will not act. In other words, they won’t get in the way. Far from building better men, his aim is to keep men in the nightmare of the gamma by ostensibly shielding them from the hell of the physical world with rules that perversely condemn them to circle a drain while under the delusion that they’re moving forward.\nPeterson is a coward and like all cowards he can only better himself by attempting to bring everyone else down to his own level. He inhabits a world of lies and exploitation and he encourages his followers to get into a metaphorical bed with him while promising to reveal to them his secrets of power and success. Peterson is the self anointed special one and he makes the following demands of his acolytes: are you worthy enough to walk in my footsteps, and how high can you climb on my imaginary dominance hierarchy?\nIt was beyond my powers to penetrate the layers of concealment that Peterson employs to mask his true nature, but Vox Day is the man for the task. His book brilliantly exposes the evil intentions of this false prophet and while doing so reveals the utter worthlessness of the subject himself. How anyone could possibly take Peterson seriously after reading this book let alone follow him is beyond me.\nHelp the low-status lobsters in your life escape the cowardly Cult of the Secret King by giving them a copy of\nJordanetics\n, still the #1 bestseller in Political Philosophy. Amazon isn’t shipping the paperback yet, but Castalia Direct\nhas it in stock\n.\nThis review is particularly interesting because Peterson has previously whined on Twitter about being criticized by Adam Piggott. It should be amusing to see how much longer he will persist in trying to respond indirectly to\nJordanetics\nwithout actually mentioning it by name or addressing any of its highly specific contentions. Perhaps he should try a leaf out of Janet Reno’s playbook. Dance party makes the bad book go away!",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-02T16:00:02+00:00"
}