{
  "url": "https://voxday.net/2018/12/02/the-guilt-of-the-gamma/",
  "scraped_at": "2025-12-20T05:19:05.362612",
  "title": "The guilt of the Gamma",
  "date_display": "December 2, 2018",
  "date_iso": "2018-12-02T13:20:54+00:00",
  "date_from_url": "2018-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neal DeGrasse Tyson is, at the very least, <a href=\"https://www.facebook.com/notes/neil-degrasse-tyson/on-being-accused/10156870826326613/\">guilty of disappointing women</a> with his unexpected Gammatude:</p><blockquote><p>While filming this past summer, I had a (female) Production Assistant assigned to me, to ensure, among her countless tasks, that every ounce of my energy was efficiently allocated to the production needs of the show.  As part of this, she was also my driver, to and from the studio, ensuring that I arrive on time. In the car we would review details of the shoot and she would help me anticipate parts of the shoot to come. Across the many weeks of shooting she and I spent upwards of a hundred hours in one-on-one conversation.  We became so friendly that we talked about all manner of subjects, even social-personal ones, like the care of aging parents, sibling relationships, life in high school and college, hometown hobbies, race, gender, and so forth.  We also discussed less-personal topics in abundance, like rock lyrics, favorite songs in various musical genres, concert experiences, etc.  And we also talked about food – I’m kind of a foodie, and her fiancé was a chef. In short, we had a fun, talkative friendship.</p><p>She is a talented, warm and friendly person — excellent traits for morale on a high pressure production. Practically everyone she knows on set gets a daily welcome-hug from her. I expressly rejected each hug offered frequently during the Production. But in its place I offered a handshake, and on a few occasions, clumsily declared, “If I hug you I might just want more.”  My intent was to express restrained but genuine affection.</p><p>In the final week of shooting, with just a few days left, as a capstone of our friendship, I invited her to wine &amp; cheese at my place upon dropping me off from work.  No pressure. I serve wine &amp; cheese often to visitors. And I even alerted her that others from the production were gathering elsewhere that evening, so she could just drop me off and head straight there or anywhere elsewhere. She freely chose to come by for wine &amp; cheese and I was delighted.  In the car, we had started a long conversation that could continue unabated.  Production days are long. We arrived late, but she was on her way home two hours later.</p><p>Afterwards, she came into my office to told me she was creeped out by the wine &amp; cheese evening.  She viewed the invite as an attempt to seduce her, even though she sat across the wine &amp; cheese table from me, and all conversation had been in the same vein as all other conversations we ever had.</p><p>Further, I never touched her until I shook her hand upon departure.  On that occasion, I had offered a special handshake, one I learned from a Native elder on reservation land at the edge of the Grand Canyon.  You extend your thumb forward during the handshake to feel the other person’s vital spirit energy — the pulse.  I’ve never forgotten that handshake, and I save it in appreciation of people with whom I’ve developed new friendships.</p><p>At that last meeting in my office, I apologized profusely. She accepted the apology.  And I assured her that had I known she was uncomfortable, I would have apologized on the spot, ended the evening, and possibly reminded her of the other social gathering that she could attend. She nonetheless declared it her last day, with only a few days left of production.</p><p>I note that her final gesture to me was the offer of a hug, which I accepted as a parting friend.</p></blockquote><p>This is like reading an account of an easily avoided car crash. I actually tend to believe that the nerdling Tyson didn’t genuinely hit on these women, but he quite clearly wanted to do so, and worse, behaved in a manner that let them know the door was open if they wanted to initiate anything with him. All the talk about “friendship” and “restrained but genuine affection” and “special handshakes” is just dishonest Gamma speak for “I wanted to pursue her but was afraid to do so.”</p><p>Never forget that women get far more creeped out by the guys who want to hit on them, but are afraid to, than by the men who openly pursue them. They react very negatively to male incongruity, and as a black man and media celebrity, Tyson’s behavior would have struck them as bizarrely incongruous. Where is that confrontation-seeking boldness that was portrayed on the <i>Big Bang Theory</i>? It never existed, of course, it was a fictitious portrayal that probably owed part of its humor to being so unlike the real persona.</p><p>Don’t think that you’re fooling anyone, including yourself, when you strike up a respectful friendship with a young female assistant or colleague. If you’re going to be a dog, then be a shameless dog. If you’re not, then don’t flirt with the danger and humiliation that is all-too-likely to result from playing with socio-sexual fire. My approach to women is very simple: keep your damn distance. No hugs, no special handshakes, no wine-and-cheese evenings.</p><p>All that being said, Neal DeGrasse Tyson doesn’t get a pass. The new rules of sexual harassment are perfectly clear. He violated them and he’s not on our side, so let him burn.</p></div>",
  "content_text": "Neal DeGrasse Tyson is, at the very least,\nguilty of disappointing women\nwith his unexpected Gammatude:\nWhile filming this past summer, I had a (female) Production Assistant assigned to me, to ensure, among her countless tasks, that every ounce of my energy was efficiently allocated to the production needs of the show.  As part of this, she was also my driver, to and from the studio, ensuring that I arrive on time. In the car we would review details of the shoot and she would help me anticipate parts of the shoot to come. Across the many weeks of shooting she and I spent upwards of a hundred hours in one-on-one conversation.  We became so friendly that we talked about all manner of subjects, even social-personal ones, like the care of aging parents, sibling relationships, life in high school and college, hometown hobbies, race, gender, and so forth.  We also discussed less-personal topics in abundance, like rock lyrics, favorite songs in various musical genres, concert experiences, etc.  And we also talked about food – I’m kind of a foodie, and her fiancé was a chef. In short, we had a fun, talkative friendship.\nShe is a talented, warm and friendly person — excellent traits for morale on a high pressure production. Practically everyone she knows on set gets a daily welcome-hug from her. I expressly rejected each hug offered frequently during the Production. But in its place I offered a handshake, and on a few occasions, clumsily declared, “If I hug you I might just want more.”  My intent was to express restrained but genuine affection.\nIn the final week of shooting, with just a few days left, as a capstone of our friendship, I invited her to wine & cheese at my place upon dropping me off from work.  No pressure. I serve wine & cheese often to visitors. And I even alerted her that others from the production were gathering elsewhere that evening, so she could just drop me off and head straight there or anywhere elsewhere. She freely chose to come by for wine & cheese and I was delighted.  In the car, we had started a long conversation that could continue unabated.  Production days are long. We arrived late, but she was on her way home two hours later.\nAfterwards, she came into my office to told me she was creeped out by the wine & cheese evening.  She viewed the invite as an attempt to seduce her, even though she sat across the wine & cheese table from me, and all conversation had been in the same vein as all other conversations we ever had.\nFurther, I never touched her until I shook her hand upon departure.  On that occasion, I had offered a special handshake, one I learned from a Native elder on reservation land at the edge of the Grand Canyon.  You extend your thumb forward during the handshake to feel the other person’s vital spirit energy — the pulse.  I’ve never forgotten that handshake, and I save it in appreciation of people with whom I’ve developed new friendships.\nAt that last meeting in my office, I apologized profusely. She accepted the apology.  And I assured her that had I known she was uncomfortable, I would have apologized on the spot, ended the evening, and possibly reminded her of the other social gathering that she could attend. She nonetheless declared it her last day, with only a few days left of production.\nI note that her final gesture to me was the offer of a hug, which I accepted as a parting friend.\nThis is like reading an account of an easily avoided car crash. I actually tend to believe that the nerdling Tyson didn’t genuinely hit on these women, but he quite clearly wanted to do so, and worse, behaved in a manner that let them know the door was open if they wanted to initiate anything with him. All the talk about “friendship” and “restrained but genuine affection” and “special handshakes” is just dishonest Gamma speak for “I wanted to pursue her but was afraid to do so.”\nNever forget that women get far more creeped out by the guys who want to hit on them, but are afraid to, than by the men who openly pursue them. They react very negatively to male incongruity, and as a black man and media celebrity, Tyson’s behavior would have struck them as bizarrely incongruous. Where is that confrontation-seeking boldness that was portrayed on the\nBig Bang Theory\n? It never existed, of course, it was a fictitious portrayal that probably owed part of its humor to being so unlike the real persona.\nDon’t think that you’re fooling anyone, including yourself, when you strike up a respectful friendship with a young female assistant or colleague. If you’re going to be a dog, then be a shameless dog. If you’re not, then don’t flirt with the danger and humiliation that is all-too-likely to result from playing with socio-sexual fire. My approach to women is very simple: keep your damn distance. No hugs, no special handshakes, no wine-and-cheese evenings.\nAll that being said, Neal DeGrasse Tyson doesn’t get a pass. The new rules of sexual harassment are perfectly clear. He violated them and he’s not on our side, so let him burn.",
  "tags": [
    "AlphaGame"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-02T13:20:54+00:00"
}