{
  "url": "https://voxday.net/2018/12/10/the-lobster-cult-is-shook/",
  "scraped_at": "2025-12-20T05:20:24.794485",
  "title": "The Lobster Cult is shook",
  "date_display": "December 10, 2018",
  "date_iso": "2018-12-10T21:59:31+00:00",
  "date_from_url": "2018-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/mLrE2D7RAuE\" width=\"512\"></iframe></div><p>It’s rather like watching little children being told that their beloved father is leaving their mother to go live as a drag queen in Las Vegas with his boyfriend.</p><p>“No, it’s not true! IT’S NOT TRUE! IT CAN’T BE TRUE! YOU’RE LYING!”</p><p>I didn’t watch the whole thing, but my favorite was the hapless guy with the weird teeth who doesn’t want to debate the subject or dignify any of the many charges with an answer. These losers couldn’t argue or debate their way out of a paper bag with a hole in the bottom. They can’t even accept the obvious fact that their Lobster Pope is a hard-core globalist and UN sherpa.</p><p>I’m particularly amused at the notion that QUOTING A MAN DIRECTLY is “borderline slanderous,” meanwhile they’re defending a mentally ill man who claims that group identity is pathological before blatantly lying about entire groups of people. Forget imputations of slander, forget what I wrote in the book, I suspect that the man is <i>considerably </i>worse than even those who were convinced by the case presented in <i>Jordanetics </i>imagine.</p><p>Anyhow, the reason people like this are starting to try to criticize the book is that it is convincing more and more Peterson fans that the man is evil and anti-Christian every day. And they will fail, because they follow a man who is habitual, if not pathological, liar as well as a servant of evil.</p></div>",
  "content_text": "It’s rather like watching little children being told that their beloved father is leaving their mother to go live as a drag queen in Las Vegas with his boyfriend.\n“No, it’s not true! IT’S NOT TRUE! IT CAN’T BE TRUE! YOU’RE LYING!”\nI didn’t watch the whole thing, but my favorite was the hapless guy with the weird teeth who doesn’t want to debate the subject or dignify any of the many charges with an answer. These losers couldn’t argue or debate their way out of a paper bag with a hole in the bottom. They can’t even accept the obvious fact that their Lobster Pope is a hard-core globalist and UN sherpa.\nI’m particularly amused at the notion that QUOTING A MAN DIRECTLY is “borderline slanderous,” meanwhile they’re defending a mentally ill man who claims that group identity is pathological before blatantly lying about entire groups of people. Forget imputations of slander, forget what I wrote in the book, I suspect that the man is\nconsiderably\nworse than even those who were convinced by the case presented in\nJordanetics\nimagine.\nAnyhow, the reason people like this are starting to try to criticize the book is that it is convincing more and more Peterson fans that the man is evil and anti-Christian every day. And they will fail, because they follow a man who is habitual, if not pathological, liar as well as a servant of evil.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-10T21:59:31+00:00"
}