{
  "url": "https://voxday.net/2018/12/01/the-virtue-of-nationalism/",
  "scraped_at": "2025-12-20T05:18:54.794182",
  "title": "The virtue of nationalism",
  "date_display": "December 1, 2018",
  "date_iso": "2018-12-01T12:48:45+00:00",
  "date_from_url": "2018-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Contrary to the heretical and deceptive universalist teachings of Churchians and globalist gnostics alike, the entire Bible points to <a href=\"http://thefederalist.com/2018/10/31/bible-undermined-concept-global-empires-favor-nation-states/?utm_source=The+Federalist+List&amp;utm_campaign=325c1e5fdd-RSS_The_Federalist_Daily_Updates_w_Transom&amp;utm_medium=email&amp;utm_term=0_cfcb868ceb-325c1e5fdd-83795033\">the Christian virtue of nationalism</a>:</p><blockquote><p>Was there a viable alternative to universal empire? The ancient Near East had much experience with localized political power in the form of city-states. But for the most part, these were helpless before imperial armies and the ideology of universal empire that motivated them. It is in the Bible that we find the first sustained presentation of a different possibility: a political order based on the independence of a nation living within limited borders alongside other independent nations.</p><p>By nation, I mean a number of tribes with a common cultural inheritance, especially a language or religion, and a past history of acting as a body for the common defense and other large-scale enterprises. The Bible systematically promotes the idea that the members of a nation should regard one another as “brothers,” and Mosaic law offered the Israelites a constitution that would bring them together in what would today be called a national state.</p><p>The king of such a state would be drawn “from among your brothers.” Its prophets, too, would be “from among you, from among your brothers.” And so would its priests, appointed to guard the traditional laws of the nation and teach them to the king “so that his thoughts should not be lifted above his brothers.” Moreover, Moses sets boundaries for Israel, instructing his people to keep their hands off the lands of neighboring kingdoms like Moav, Edom, and Ammon, which deserve their own independence. As he tells them in God’s name:</p><p><i>Take good heed of yourselves therefore. Meddle not with [the children of Esau], for I will not give you of their land. No, not so much a foot’s breadth. Because I have given Mt. Seir to Esau for a possession. . . . Do not harass Moav, nor contend with them in battle, for I will not give you of their land for a possession, because I have given Ar to the children of Lot for a possession. . . . And when you come near, opposite the children of Ammon, harass them not, nor contend with them, for I will not give you of the land of the children of Ammon any possession, for I have given it to the children of Lot for a possession.</i></p><p>Nor are these passages unique. Throughout the Bible, we find that the political aspiration of the prophets of Israel is not empire but a free and unified nation living in justice and peace amid other free nations.</p><p>The Bible thus puts a new political conception on the table: a state of a single nation that is united, self-governing, and uninterested in bringing its neighbors under its rule. This state is governed not by foreigners responsible to a ruler in a distant land but by kings and governors, priests and prophets drawn from the ranks of the nation itself—individuals who are, for just this reason, thought to be better able to stay in touch with the needs of their own people, their “brothers,” including the less fortunate among them.</p></blockquote><p>As one Christian theologian has observed, the Bible mentions all the nations of the world coming together in unity precisely three times. And on each of those three occasions, they are coming together in united opposition to God.</p><p>On his recent appearance on Dave Rubin’s show, Jordan Peterson signaled that the globalists are going to attempt to rebrand themselves as <i>universalists</i>. But whether the forces of Babel see their rule over Man as being planetary, galactic, or universal in nature, the important thing is that it is instrinsically opposed to the Will of God as expressed in the Bible, and therefore inherently evil.</p><p>Remember, the Kingdom of God is not of the fallen world. Any political ideology that is universalist or imperialist cannot be compatible with that divine Kingdom.</p></div>",
  "content_text": "Contrary to the heretical and deceptive universalist teachings of Churchians and globalist gnostics alike, the entire Bible points to\nthe Christian virtue of nationalism\n:\nWas there a viable alternative to universal empire? The ancient Near East had much experience with localized political power in the form of city-states. But for the most part, these were helpless before imperial armies and the ideology of universal empire that motivated them. It is in the Bible that we find the first sustained presentation of a different possibility: a political order based on the independence of a nation living within limited borders alongside other independent nations.\nBy nation, I mean a number of tribes with a common cultural inheritance, especially a language or religion, and a past history of acting as a body for the common defense and other large-scale enterprises. The Bible systematically promotes the idea that the members of a nation should regard one another as “brothers,” and Mosaic law offered the Israelites a constitution that would bring them together in what would today be called a national state.\nThe king of such a state would be drawn “from among your brothers.” Its prophets, too, would be “from among you, from among your brothers.” And so would its priests, appointed to guard the traditional laws of the nation and teach them to the king “so that his thoughts should not be lifted above his brothers.” Moreover, Moses sets boundaries for Israel, instructing his people to keep their hands off the lands of neighboring kingdoms like Moav, Edom, and Ammon, which deserve their own independence. As he tells them in God’s name:\nTake good heed of yourselves therefore. Meddle not with [the children of Esau], for I will not give you of their land. No, not so much a foot’s breadth. Because I have given Mt. Seir to Esau for a possession. . . . Do not harass Moav, nor contend with them in battle, for I will not give you of their land for a possession, because I have given Ar to the children of Lot for a possession. . . . And when you come near, opposite the children of Ammon, harass them not, nor contend with them, for I will not give you of the land of the children of Ammon any possession, for I have given it to the children of Lot for a possession.\nNor are these passages unique. Throughout the Bible, we find that the political aspiration of the prophets of Israel is not empire but a free and unified nation living in justice and peace amid other free nations.\nThe Bible thus puts a new political conception on the table: a state of a single nation that is united, self-governing, and uninterested in bringing its neighbors under its rule. This state is governed not by foreigners responsible to a ruler in a distant land but by kings and governors, priests and prophets drawn from the ranks of the nation itself—individuals who are, for just this reason, thought to be better able to stay in touch with the needs of their own people, their “brothers,” including the less fortunate among them.\nAs one Christian theologian has observed, the Bible mentions all the nations of the world coming together in unity precisely three times. And on each of those three occasions, they are coming together in united opposition to God.\nOn his recent appearance on Dave Rubin’s show, Jordan Peterson signaled that the globalists are going to attempt to rebrand themselves as\nuniversalists\n. But whether the forces of Babel see their rule over Man as being planetary, galactic, or universal in nature, the important thing is that it is instrinsically opposed to the Will of God as expressed in the Bible, and therefore inherently evil.\nRemember, the Kingdom of God is not of the fallen world. Any political ideology that is universalist or imperialist cannot be compatible with that divine Kingdom.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-01T12:48:45+00:00"
}