{
  "url": "https://voxday.net/2018/12/04/the-truth-is-spreading/",
  "scraped_at": "2025-12-20T05:19:21.463659",
  "title": "The truth is spreading",
  "date_display": "December 4, 2018",
  "date_iso": "2018-12-04T11:25:17+00:00",
  "date_from_url": "2018-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And it’s not going to help Jordan Peterson’s career survive. An article in <i>Demokracija </i>openly <a href=\"http://demokracija.eu/columnists/jordan-peterson-false-prophet.html\">calls him a false prophet</a>.</p><blockquote><p>First problem with Peterson that woke me out of my trance and forced me to reevaluate what this professor of psychology is even talking about, was his stance on the usage of personal pronouns. If in the past, he claimed that the problem were the many pronouns people were making up, he now claimed he doesn’t have any problem with the individuals and their pronouns, only with the law which would compel him to use them. That was the same Peterson who not long ago insisted he was ready to go to prison because of his refusal to use preferred personal pronouns.</p><p>Every video of his I saw, every tweet I read, every lecture I listened to only confirmed what I already knew at this point. Still, I kept convincing myself that it cannot be so. After all, the progressive left hates him, after all, Peterson says in his <i>12 Rules for Life</i> to stand up straight, after all, Peterson advocated for the truth.</p><p>It turned out all of that was just a big lie. To stop fooling myself, two other events were needed. The first was a debate Peterson had with the youngest of the so-called four horsemen of atheism, philosopher and neuroscientist Sam Harris. The problems started right at the beginning of the debate when they couldn’t settle on the definition of truth. Harris claimed there is objective truth while Peterson tried by all means to defend the claim which was one of the craziest things I have ever heard. He claimed that truth is, according to evolution, something which helps the individual survive. When you think of it, Peterson’s definition allows that even a lie is truth as long as it helps you in pursuit of your own interests. How do you believe someone who claims that truth can be anything?</p></blockquote><p>Meanwhile, the Lobster Cultists are desperately trying to prevent people from reading <i>Jordanetics</i>.</p><p>James E Moore, <a href=\"https://www.amazon.com/gp/customer-reviews/R1C5LR0EBG71DO/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B07JY9XV38\">December 3 2018</a><br><b>Vox Day about as accurate as Vox News</b><br>For all the hoopla he claims his book is of little substance.</br></br></p><p>Folke Hermansen, <a href=\"https://www.amazon.com/gp/customer-reviews/R2Y5YU66QLP1YO/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B07JY9XV38\">December 3, 2018</a><br><b>Badly written and intellectually dishonest</b><br>As someone who has a genuine understanding of Peterson’s work, this book is filled with misrepresentations and false conclusions.</br></br></p><p>I guess it just depends upon what you mean by “genuine”, “misrepresentations”, and “false”. But it can hardly surprise anyone who has actually read <i>Jordanetics </i>that Jordan Peterson fans would lie about the book. After all, they are following the example of a man who habitually speaks with a forked tongue.</p><p>When you read this, keep in mind that <a href=\"https://www.americanthinker.com/articles/2018/12/jordanetics_understanding_vox_days_problem.html\">this article in the <i>American Thinker</i></a> is actually supposed to be a defense of Jordan Peterson against <i>Jordanetics</i>:</p><blockquote><p>The whole point of the revolution begun by Kant is that we can’t know “objective truth.”</p><p>For Kant everything we know comes through our senses and then gets processed by our brains and gussied up into a theory of the world. Thus, we cannot know things-in-themselves, prior to our sense impressions.</p><p>But the loss of “objective truth” is not the end of everything, it is just the beginning.</p><p>For one thing, it allows Carl Jung to experience the history of religion as the history of mankind trying to make sense of the world — the meaning of life, the universe, and everything — given the state of human knowledge about life, the universe, and everything at the time.</p><p>In his book Jordan Peterson tries to make sense of the world with everything from Biblical exegesis to Nietzschean aphorisms and Jungian analysis, with Dostoyevsky and Solzhenitsyn thrown in for good measure. And, of course, his Biblical analysis compares God the Father and Christ the Son with Osiris and Horus, the Egyptian father-son duo. He would, because he’s a Jungian, and Jungians believe that you can bring together the religious beliefs of all ages to discover the truth.</p></blockquote><p>And the only thing you need to know about Kant is that he was wrong, completely and utterly wrong. His entire life’s work was an unnecessary attempt to square a philosophical circle. The objective truth exists regardless of our ability to correctly perceive it at any given point in time. And the Jungians are not merely wrong, they are mad. That’s not you make sense of the world. That’s not how you make sense of <i>anything</i>. And more importantly, that’s not how you “discover the truth,” that’s how you end up molesting children, drinking blood, and chanting nonsense in fake languages in order to magickally exert your will upon the world.</p><p>I wonder how many Jordan Peterson fans understand that in following the 12-Rule Path they are quite literally rejecting the core philosophical basis for the science they think they love?</p><p>How can anyone who is sane possibly defend a man who “advocates for the truth” when, by his own account and according to his defenders, he does not believe in the existence of “the objective truth”?</p></div>",
  "content_text": "And it’s not going to help Jordan Peterson’s career survive. An article in\nDemokracija\nopenly\ncalls him a false prophet\n.\nFirst problem with Peterson that woke me out of my trance and forced me to reevaluate what this professor of psychology is even talking about, was his stance on the usage of personal pronouns. If in the past, he claimed that the problem were the many pronouns people were making up, he now claimed he doesn’t have any problem with the individuals and their pronouns, only with the law which would compel him to use them. That was the same Peterson who not long ago insisted he was ready to go to prison because of his refusal to use preferred personal pronouns.\nEvery video of his I saw, every tweet I read, every lecture I listened to only confirmed what I already knew at this point. Still, I kept convincing myself that it cannot be so. After all, the progressive left hates him, after all, Peterson says in his\n12 Rules for Life\nto stand up straight, after all, Peterson advocated for the truth.\nIt turned out all of that was just a big lie. To stop fooling myself, two other events were needed. The first was a debate Peterson had with the youngest of the so-called four horsemen of atheism, philosopher and neuroscientist Sam Harris. The problems started right at the beginning of the debate when they couldn’t settle on the definition of truth. Harris claimed there is objective truth while Peterson tried by all means to defend the claim which was one of the craziest things I have ever heard. He claimed that truth is, according to evolution, something which helps the individual survive. When you think of it, Peterson’s definition allows that even a lie is truth as long as it helps you in pursuit of your own interests. How do you believe someone who claims that truth can be anything?\nMeanwhile, the Lobster Cultists are desperately trying to prevent people from reading\nJordanetics\n.\nJames E Moore,\nDecember 3 2018\nVox Day about as accurate as Vox News\nFor all the hoopla he claims his book is of little substance.\nFolke Hermansen,\nDecember 3, 2018\nBadly written and intellectually dishonest\nAs someone who has a genuine understanding of Peterson’s work, this book is filled with misrepresentations and false conclusions.\nI guess it just depends upon what you mean by “genuine”, “misrepresentations”, and “false”. But it can hardly surprise anyone who has actually read\nJordanetics\nthat Jordan Peterson fans would lie about the book. After all, they are following the example of a man who habitually speaks with a forked tongue.\nWhen you read this, keep in mind that\nthis article in the\nAmerican Thinker\nis actually supposed to be a defense of Jordan Peterson against\nJordanetics\n:\nThe whole point of the revolution begun by Kant is that we can’t know “objective truth.”\nFor Kant everything we know comes through our senses and then gets processed by our brains and gussied up into a theory of the world. Thus, we cannot know things-in-themselves, prior to our sense impressions.\nBut the loss of “objective truth” is not the end of everything, it is just the beginning.\nFor one thing, it allows Carl Jung to experience the history of religion as the history of mankind trying to make sense of the world — the meaning of life, the universe, and everything — given the state of human knowledge about life, the universe, and everything at the time.\nIn his book Jordan Peterson tries to make sense of the world with everything from Biblical exegesis to Nietzschean aphorisms and Jungian analysis, with Dostoyevsky and Solzhenitsyn thrown in for good measure. And, of course, his Biblical analysis compares God the Father and Christ the Son with Osiris and Horus, the Egyptian father-son duo. He would, because he’s a Jungian, and Jungians believe that you can bring together the religious beliefs of all ages to discover the truth.\nAnd the only thing you need to know about Kant is that he was wrong, completely and utterly wrong. His entire life’s work was an unnecessary attempt to square a philosophical circle. The objective truth exists regardless of our ability to correctly perceive it at any given point in time. And the Jungians are not merely wrong, they are mad. That’s not you make sense of the world. That’s not how you make sense of\nanything\n. And more importantly, that’s not how you “discover the truth,” that’s how you end up molesting children, drinking blood, and chanting nonsense in fake languages in order to magickally exert your will upon the world.\nI wonder how many Jordan Peterson fans understand that in following the 12-Rule Path they are quite literally rejecting the core philosophical basis for the science they think they love?\nHow can anyone who is sane possibly defend a man who “advocates for the truth” when, by his own account and according to his defenders, he does not believe in the existence of “the objective truth”?",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-04T11:25:17+00:00"
}