{
  "url": "https://voxday.net/2018/12/27/they-simply-failed-to-recognize-the-full-horror/",
  "scraped_at": "2025-12-20T05:22:48.112645",
  "title": "“They simply failed to recognize the full horror”",
  "date_display": "December 27, 2018",
  "date_iso": "2018-12-27T19:49:47+00:00",
  "date_from_url": "2018-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The near-total inability of the American people, and the U.S. government, to recognize the full horror of their situation is not exactly new. For Christmas, Spacebunny hunted down a complete first edition set of <i>A History of the Peninsular War</i> by Charles Oman, which she somehow managed to obtain for less than five percent of the going rate. When it comes to things used and garage sales, she is without question an Apex Predator; she is the party primarily responsible for my beautiful collection of books.</p><p>Naturally, I immediately awarded the seven-volume set pride of place in my library. In addition to being one of the most thorough and well-sourced accounts of a war in recorded human history, Oman’s history of the Peninsular War is remarkable for its keen observations of human nature. Prior to encountering Martin van Creveld, Oman was my favorite military historian, and <i>A History of the Peninsular War</i> is indubitably his magnum opus.</p><p>The attitude of the people of Northwest Spain during the French invasion can’t help but strike the observer of the current US situation as one that is all-too-familiar:</p><blockquote><p>Leon and Old Castile had, as we have already had occasion to remark, been far less energetic than other parts of the Peninsula in raising new troops and coming forward with contributions to the national exchequer. They had done no more than furnish the 10,000 men of Cuesta’s disorderly ‘Army of Castile,’ a contingent utterly out of proportion with their population and resources. Nor did they seem to realize the scandal of their own sloth and procrastination. Moore had expected to see every town full of new levies undergoing drill before marching to the Ebro, to discover magazines accumulated in important places like Ciudad Rodrigo and Salamanca, to find the military and civil officials working busily for the armies at the front. Instead he found an unaccountable apathy. Even after the reports of Espinosa and Gamonal had come to hand, the people and the authorities alike seemed to be living in a sort of fools’ paradise, disbelieving the gloomy news that arrived, or at least refusing to recognize that the war was now at their own doors. Moore feared that this came from want of patriotism or of courage.</p><p>As a matter of fact, the people’s hearts were sound enough, but they had still got ‘Baylen on the brain’: they simply failed to recognize the full horror of the situation. That their armies were not merely beaten but dispersed, that the way to Madrid was open to Bonaparte, escaped them. This attitude of mind enraged Moore. ‘In these provinces,’ he wrote, ‘no armed force whatever exists, either for immediate protection or to reinforce the armies. The French cavalry from Burgos, in small detachments, are overrunning the province of Leon, and raising contributions to which the inhabitants submit without the least resistance: the enthusiasm of which we heard so much nowhere appears. Whatever good-will there is (and among the lower orders I believe there is a good deal) is taken no advantage of. I am at this moment in no communication with any of their generals. I am ignorant of their plans, or those of their government.’</p></blockquote><p>At least the Spanish people of the 19th century realized that they had been invaded and they were at war. Today, despite having been invaded by a force 250x larger than the Napoleonic army that invaded Spain, the American people still completely fail to understand that their country, their culture, their government, and their traditions are being fundamentally altered without their will or their consent.</p></div>",
  "content_text": "The near-total inability of the American people, and the U.S. government, to recognize the full horror of their situation is not exactly new. For Christmas, Spacebunny hunted down a complete first edition set of\nA History of the Peninsular War\nby Charles Oman, which she somehow managed to obtain for less than five percent of the going rate. When it comes to things used and garage sales, she is without question an Apex Predator; she is the party primarily responsible for my beautiful collection of books.\nNaturally, I immediately awarded the seven-volume set pride of place in my library. In addition to being one of the most thorough and well-sourced accounts of a war in recorded human history, Oman’s history of the Peninsular War is remarkable for its keen observations of human nature. Prior to encountering Martin van Creveld, Oman was my favorite military historian, and\nA History of the Peninsular War\nis indubitably his magnum opus.\nThe attitude of the people of Northwest Spain during the French invasion can’t help but strike the observer of the current US situation as one that is all-too-familiar:\nLeon and Old Castile had, as we have already had occasion to remark, been far less energetic than other parts of the Peninsula in raising new troops and coming forward with contributions to the national exchequer. They had done no more than furnish the 10,000 men of Cuesta’s disorderly ‘Army of Castile,’ a contingent utterly out of proportion with their population and resources. Nor did they seem to realize the scandal of their own sloth and procrastination. Moore had expected to see every town full of new levies undergoing drill before marching to the Ebro, to discover magazines accumulated in important places like Ciudad Rodrigo and Salamanca, to find the military and civil officials working busily for the armies at the front. Instead he found an unaccountable apathy. Even after the reports of Espinosa and Gamonal had come to hand, the people and the authorities alike seemed to be living in a sort of fools’ paradise, disbelieving the gloomy news that arrived, or at least refusing to recognize that the war was now at their own doors. Moore feared that this came from want of patriotism or of courage.\nAs a matter of fact, the people’s hearts were sound enough, but they had still got ‘Baylen on the brain’: they simply failed to recognize the full horror of the situation. That their armies were not merely beaten but dispersed, that the way to Madrid was open to Bonaparte, escaped them. This attitude of mind enraged Moore. ‘In these provinces,’ he wrote, ‘no armed force whatever exists, either for immediate protection or to reinforce the armies. The French cavalry from Burgos, in small detachments, are overrunning the province of Leon, and raising contributions to which the inhabitants submit without the least resistance: the enthusiasm of which we heard so much nowhere appears. Whatever good-will there is (and among the lower orders I believe there is a good deal) is taken no advantage of. I am at this moment in no communication with any of their generals. I am ignorant of their plans, or those of their government.’\nAt least the Spanish people of the 19th century realized that they had been invaded and they were at war. Today, despite having been invaded by a force 250x larger than the Napoleonic army that invaded Spain, the American people still completely fail to understand that their country, their culture, their government, and their traditions are being fundamentally altered without their will or their consent.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-27T19:49:47+00:00"
}