{
  "url": "https://voxday.net/2018/12/07/trust-no-one/",
  "scraped_at": "2025-12-20T05:19:54.227293",
  "title": "Trust no one",
  "date_display": "December 7, 2018",
  "date_iso": "2018-12-07T18:50:52+00:00",
  "date_from_url": "2018-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, at the behest of a trainer at the gym who used to play professional soccer, I tried a new high-intensity circuit class today. While I don’t <i>think </i>he was actually trying to do me in, I can’t rule the possibility out entirely. I seriously thought I was going to vomit after the first circuit of 15 stations, but after a dire 30 seconds or so during the first break, I held it together and managed to get through the second circuit without incident. I was a little distressed to discover that we were doing a third circuit, but it only consisted of 12 stations since three of the other 14 participants had dropped out by then.</p><p>My satisfaction in completing all three circuits was mildly tempered by the fact that there were several girls in their teens and twenties who did as well, and who, Spacebunny cheerfully informed me later, didn’t require several minutes lying flat on their back to recover afterwards. I had no idea, of course, because I was lying flat on my back with my eyes closed.</p><p>Anyhow, it turns out that high-intensity training is a great exercise for the offseason, since running, walking, biking, and lifting simply don’t serve as adequate substitutes for the explosive burst-and-coast endurance that one requires for soccer. The trainer even complimented my form, and I was sufficiently high on flattery and post-exercise endorphins that I agreed to show up for the next class. Apparently there are two… fabulous.</p></div>",
  "content_text": "So, at the behest of a trainer at the gym who used to play professional soccer, I tried a new high-intensity circuit class today. While I don’t\nthink\nhe was actually trying to do me in, I can’t rule the possibility out entirely. I seriously thought I was going to vomit after the first circuit of 15 stations, but after a dire 30 seconds or so during the first break, I held it together and managed to get through the second circuit without incident. I was a little distressed to discover that we were doing a third circuit, but it only consisted of 12 stations since three of the other 14 participants had dropped out by then.\nMy satisfaction in completing all three circuits was mildly tempered by the fact that there were several girls in their teens and twenties who did as well, and who, Spacebunny cheerfully informed me later, didn’t require several minutes lying flat on their back to recover afterwards. I had no idea, of course, because I was lying flat on my back with my eyes closed.\nAnyhow, it turns out that high-intensity training is a great exercise for the offseason, since running, walking, biking, and lifting simply don’t serve as adequate substitutes for the explosive burst-and-coast endurance that one requires for soccer. The trainer even complimented my form, and I was sufficiently high on flattery and post-exercise endorphins that I agreed to show up for the next class. Apparently there are two… fabulous.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-07T18:50:52+00:00"
}