{
  "url": "https://voxday.net/2018/12/15/we-all-knew-it-would-be-cancelled/",
  "scraped_at": "2025-12-20T05:21:12.281163",
  "title": "We all knew it would be cancelled",
  "date_display": "December 15, 2018",
  "date_iso": "2018-12-15T22:35:47+00:00",
  "date_from_url": "2018-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s just that we thought it would be because DC/Vertigo’s <i>BORDER TOWN</i> comic was converged and reprehensibly stupid. But surprise! It turns out that SJWs in the comic industry <a href=\"https://boundingintocomics.com/2018/12/11/vertigo-comics-creator-accused-of-abuse-and-sexual-misconduct/\">are total creeps… again.</a></p><blockquote><p>On Sunday, a woman by the name of Cynthia Naugle sought to come forward with a story of abuse and sexual misconduct she had received in the past from an unnamed comic book creator. Naugle tweeted out a link to her personal blogspot page, wherein she recounted her story for the public. Naugle details many instances of mental abuse, sexual coercion, and sexual harassment she received from the individual in question…. While Naugle did not directly name her abuser, it was not long before members of the public were able to parse through the few identifying traits Naugle had discussed in her post to discover the identity of her alleged abuser: Eric M. Esquivel, current writer of <i>Border Town</i> for DC Comics.</p></blockquote><p>It’s rather remarkable to observe that Arkhaven is targeted for media hit pieces and deplatforming while our competitors are literally running around sexually assaulting people without facing any similar treatment. This isn’t exactly the first contributor to DC Comics who has been accused of this sort of behavior.</p><p>Perhaps we should start advertising our comics as being “rape-free” and add a sticker noting “no women were sexually assaulted during the production of this comic book”.</p></div>",
  "content_text": "It’s just that we thought it would be because DC/Vertigo’s\nBORDER TOWN\ncomic was converged and reprehensibly stupid. But surprise! It turns out that SJWs in the comic industry\nare total creeps… again.\nOn Sunday, a woman by the name of Cynthia Naugle sought to come forward with a story of abuse and sexual misconduct she had received in the past from an unnamed comic book creator. Naugle tweeted out a link to her personal blogspot page, wherein she recounted her story for the public. Naugle details many instances of mental abuse, sexual coercion, and sexual harassment she received from the individual in question…. While Naugle did not directly name her abuser, it was not long before members of the public were able to parse through the few identifying traits Naugle had discussed in her post to discover the identity of her alleged abuser: Eric M. Esquivel, current writer of\nBorder Town\nfor DC Comics.\nIt’s rather remarkable to observe that Arkhaven is targeted for media hit pieces and deplatforming while our competitors are literally running around sexually assaulting people without facing any similar treatment. This isn’t exactly the first contributor to DC Comics who has been accused of this sort of behavior.\nPerhaps we should start advertising our comics as being “rape-free” and add a sticker noting “no women were sexually assaulted during the production of this comic book”.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-15T22:35:47+00:00"
}