{
  "url": "https://voxday.net/2018/12/10/yes-conspiracy-get-it/",
  "scraped_at": "2025-12-20T05:20:21.141220",
  "title": "Yes conspiracy. Get it?",
  "date_display": "December 10, 2018",
  "date_iso": "2018-12-10T14:46:12+00:00",
  "date_from_url": "2018-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Unz and Israel Shamir join forces <a href=\"http://www.unz.com/ishamir/unz-goes-nuclear/\">to further beat the dead horse</a> that was Jordan Peterson’s <a href=\"http://voxday.blogspot.com/2018/04/the-myth-of-jordan-petersons-integrity.html\">pathetically dishonest attempt</a> to explain away the overrepresentation of Ashkenazi “in any occupations/interests for reasons other than intelligence and the associated effects of intelligence on personality and political belief.”</p><blockquote><p>[Ron Unz] discovered and proved with hard data that Jews discriminate against you to a degree you could not even guess. While you queue at the front door of the Elites, they enter freely by the back door. Chances of a smart non-Jewish “white” American kid getting there are ten-fold lower than that of a Jew. There are ten times more smart non-Jewish white American kids than smart Jewish kids, but there are more Jewish students in the Ivy League than white non-Jews. The system is biased, and not in your favour.</p><p>Once you could work your way up to success, like Henry Ford did. That was the American Dream. Not anymore. Now the only way to the best jobs, into the American elites leads through a few top colleges of the Ivy League. You can’t bypass this funnel of opportunity. “A greater and greater proportion of our financial, media, business, and political elites being drawn from a relatively small number of our leading universities” (all unattributed quotes are from the Unz essay). Unless you get the imprimatur of Harvard or Yale, your future is dim. Well-paid middle class jobs in the manufacturing sector for those lacking college degrees are scarce, and workers are being paid less now than forty years ago. When America’s richest 1 per cent has as much wealth as the bottom 95 per cent, it is winner takes all, and this winner is probably a Jew.</p><p>The elites have duties, too. The elite universities are supposed to pick the best boys and girls to lead America to its glory and greatness. By your own experience you already know that it does not happen; that the new US elites lead themselves to prosperity, while pushing you to poverty and perdition. The new elites failed you, failed your country, failed the world (always excepting the Jewish state). This failure is the main reason to explore how the elites produce their new generation.</p><p>The great surprise is that WASPs, the legendary descendants of the Founding Fathers, have lost their privilege, or even their fair chance to success. Unz proves that a smart Christian American boy of English or German parentage has ten times less chance to get into these crème-de-la-crème universities than an average Jewish boy. This very unfair way of forming tomorrow’s elites has been made possible by the sheer nepotistic networking of the universities’ admission offices. Clannishness, the Jews were (justifiably) accused of.</p><p>In actual words of Ron Unz, “Jews are enrolled at Harvard and other elite colleges at a rate some 1,000{51060298616648a432127aa487592f15c981010bc8b0ce296b7f79f7f5f50574} greater than white Gentiles of similar academic performance”. One thousand per cent, OMG! Provided that these Ivy League colleges are the only sure-fire way into American elites, into best jobs and into good and important positions, this biased enrolment guarantees the Jews their position of the top dog well into next generation.</p><p>In 1920s, Jews accused the WASPs of discriminating them at university admission. The WASPs kept them under 15{51060298616648a432127aa487592f15c981010bc8b0ce296b7f79f7f5f50574} of admissions. Now with Jews at the top they show what real discrimination is all about. However, there is one major difference. Then, the Jews volubly complained, now the Christians do not even dare to complain….</p><p>Unz is very meticulous, very cautious in his approach. He asks an almost-insulting question: perhaps the Jews are so smart (after all, that is the kin of Einstein and Freud) that their share in the Ivy League is a result of meritocratic selection? And he provides an almost-insulting answer: no, they aren’t. There are some universities that admit strictly by merit; in these universities Jews do not exactly star. Caltech, the California Institute of Technology is one of them. The Jewish presence there is quite small; Hillel, the Jewish students’ body, gives it as zero. In reality, it is about 6 per cent, like in other merit-based competitions.</p></blockquote><p>Even when I simply accepted the assertion at face value for lack of any direct evidence to the contrary, I always found the myth of Jewish superintelligence a little dubious, which was probably due to the fact that, besides the very hard-working Blacks, the only group of students at my Ivy League-reject school observably less intelligent than the average were the Jews. Literally none of the top students in any of my classes or in the economics department were Jewish, which was likely because, as with the Black students, most of the Jews capable of succeeding there were in well over their heads at more prestigious universities thanks to affirmative action and the Ivy League admissions conspiracy.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://www.unzcloud.com/wp-content/uploads/2013/09/f4-large-600x343.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"343\" data-original-width=\"600\" decoding=\"async\" src=\"https://www.unzcloud.com/wp-content/uploads/2013/09/f4-large-600x343.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"343\" data-original-width=\"600\" data-src=\"https://www.unzcloud.com/wp-content/uploads/2013/09/f4-large-600x343.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20600%20343%22%3E%3C/svg%3E\"/></a></div><p>Now, this sort of distribution does not happen by accident. The truly damning thing about the Unz report is that the more objectively meritocratic the measure, the worse Jews observably perform. The more political and easily obscured the measure, the better they manage to perform; just look at the massive difference between Harvard and Caltech. Jews are more intelligent on average than the U.S. mean and they are demonstrably smart enough to BS their way past the midwits, especially naive white midwits who are easily manipulated by crying “racist” or “anti-Semite” or through appeals to a nonexistent “Judeo-Christian heritage”. But even the smartest con artist finds it much more difficult to deceive those who genuinely possess very high intelligence, first, because we recognize it when we see it, and second, because we can also also see through those who are utilizing their verbal skills to strike false poses.</p><p>Here is another thing to keep in mind. I happen to be a member in good standing of Jordan Peterson’s vaunted 3SD+ set. I have also met a number of people smarter than me, people with higher IQs and more significant intellectual accomplishments, up to and including the Fields Medal. After college, I lived in a house where four of the five residents were in that high-IQ set. And virtually none of the VHIQ and UHIQ people I have met over the last 35 years, in the USA, in Japan, or in Europe, have been Jews of any persuasion. To say this observation is statistically <i>improbable </i>if Peterson’s claim concerning the makeup of the 145+ set was correct would be putting it mildly.</p><p>If you want to know why neither Jordan Peterson, Ben Shapiro, or Sargon of Akkad will ever dare to debate me on this subject, <a href=\"http://voxday.blogspot.com/2017/08/iq-exaggeration-and-overrepresentation.html\">this Twitter exchange from 2017</a> may help you understand why they always run.</p><blockquote><p>Sargon‏ @Sargon_of_Akkad<br>Has the alt right come to terms with the fact the Jews are just better than they are?</br></p><p>Greg Matusow @gregmatusow<br>sounds like something a jew would say</br></p><p>Sargon‏ @Sargon_of_Akkad<br>Sounds like something a race realist who depends on IQ scores to say, you mean.</br></p><p>Supreme Dark Lord‏ @voxday<br>Your metric is incorrect, Sargon. First, there are 48 high-IQ Han, 11 high-IQ Europeans, and 5 high-IQ Japanese for every high-IQ Jew.</br></p><p>Sargon‏ @Sargon_of_Akkad<br>Of course, but that’s only because of population size.</br></p><p>Supreme Dark Lord‏ @voxday<br>Obviously. But you cannot claim they are not overrepresented in X because intelligent when there are 64 more intelligent non-Jews per Jew.</br></p></blockquote><p>Notice how Sargon blithely contradicted his own position without even realizing it in response to my appeal to population statistics. He’s not merely overmatched, he’s completely inept. Both Ben Shapiro and Sargon are good examples of midwits who attempt to present themselves to their low-IQ followers as highly intelligent thinkers. Shapiro is perhaps a little more successful than Sargon in this regard, but mostly because he speaks quickly enough to prevent the average individual from following what he is actually saying, which is seldom original or insightful even when it isn’t dishonest or deceptive.</p><p>The fact that the Ivy League admissions offices are now desperately defining Jewish identity downward in order to try to conceal the level of their corruption and conspiratorial bias proves that they have been ruthlessly practicing anti-European and anti-Asian discrimination for decades. This also explains why white Americans have no choice about accepting the challenge of identity politics, because their rivals have been aggressively playing identity politics at their expense since the 1920s.</p></div>",
  "content_text": "Ron Unz and Israel Shamir join forces\nto further beat the dead horse\nthat was Jordan Peterson’s\npathetically dishonest attempt\nto explain away the overrepresentation of Ashkenazi “in any occupations/interests for reasons other than intelligence and the associated effects of intelligence on personality and political belief.”\n[Ron Unz] discovered and proved with hard data that Jews discriminate against you to a degree you could not even guess. While you queue at the front door of the Elites, they enter freely by the back door. Chances of a smart non-Jewish “white” American kid getting there are ten-fold lower than that of a Jew. There are ten times more smart non-Jewish white American kids than smart Jewish kids, but there are more Jewish students in the Ivy League than white non-Jews. The system is biased, and not in your favour.\nOnce you could work your way up to success, like Henry Ford did. That was the American Dream. Not anymore. Now the only way to the best jobs, into the American elites leads through a few top colleges of the Ivy League. You can’t bypass this funnel of opportunity. “A greater and greater proportion of our financial, media, business, and political elites being drawn from a relatively small number of our leading universities” (all unattributed quotes are from the Unz essay). Unless you get the imprimatur of Harvard or Yale, your future is dim. Well-paid middle class jobs in the manufacturing sector for those lacking college degrees are scarce, and workers are being paid less now than forty years ago. When America’s richest 1 per cent has as much wealth as the bottom 95 per cent, it is winner takes all, and this winner is probably a Jew.\nThe elites have duties, too. The elite universities are supposed to pick the best boys and girls to lead America to its glory and greatness. By your own experience you already know that it does not happen; that the new US elites lead themselves to prosperity, while pushing you to poverty and perdition. The new elites failed you, failed your country, failed the world (always excepting the Jewish state). This failure is the main reason to explore how the elites produce their new generation.\nThe great surprise is that WASPs, the legendary descendants of the Founding Fathers, have lost their privilege, or even their fair chance to success. Unz proves that a smart Christian American boy of English or German parentage has ten times less chance to get into these crème-de-la-crème universities than an average Jewish boy. This very unfair way of forming tomorrow’s elites has been made possible by the sheer nepotistic networking of the universities’ admission offices. Clannishness, the Jews were (justifiably) accused of.\nIn actual words of Ron Unz, “Jews are enrolled at Harvard and other elite colleges at a rate some 1,000{51060298616648a432127aa487592f15c981010bc8b0ce296b7f79f7f5f50574} greater than white Gentiles of similar academic performance”. One thousand per cent, OMG! Provided that these Ivy League colleges are the only sure-fire way into American elites, into best jobs and into good and important positions, this biased enrolment guarantees the Jews their position of the top dog well into next generation.\nIn 1920s, Jews accused the WASPs of discriminating them at university admission. The WASPs kept them under 15{51060298616648a432127aa487592f15c981010bc8b0ce296b7f79f7f5f50574} of admissions. Now with Jews at the top they show what real discrimination is all about. However, there is one major difference. Then, the Jews volubly complained, now the Christians do not even dare to complain….\nUnz is very meticulous, very cautious in his approach. He asks an almost-insulting question: perhaps the Jews are so smart (after all, that is the kin of Einstein and Freud) that their share in the Ivy League is a result of meritocratic selection? And he provides an almost-insulting answer: no, they aren’t. There are some universities that admit strictly by merit; in these universities Jews do not exactly star. Caltech, the California Institute of Technology is one of them. The Jewish presence there is quite small; Hillel, the Jewish students’ body, gives it as zero. In reality, it is about 6 per cent, like in other merit-based competitions.\nEven when I simply accepted the assertion at face value for lack of any direct evidence to the contrary, I always found the myth of Jewish superintelligence a little dubious, which was probably due to the fact that, besides the very hard-working Blacks, the only group of students at my Ivy League-reject school observably less intelligent than the average were the Jews. Literally none of the top students in any of my classes or in the economics department were Jewish, which was likely because, as with the Black students, most of the Jews capable of succeeding there were in well over their heads at more prestigious universities thanks to affirmative action and the Ivy League admissions conspiracy.\nNow, this sort of distribution does not happen by accident. The truly damning thing about the Unz report is that the more objectively meritocratic the measure, the worse Jews observably perform. The more political and easily obscured the measure, the better they manage to perform; just look at the massive difference between Harvard and Caltech. Jews are more intelligent on average than the U.S. mean and they are demonstrably smart enough to BS their way past the midwits, especially naive white midwits who are easily manipulated by crying “racist” or “anti-Semite” or through appeals to a nonexistent “Judeo-Christian heritage”. But even the smartest con artist finds it much more difficult to deceive those who genuinely possess very high intelligence, first, because we recognize it when we see it, and second, because we can also also see through those who are utilizing their verbal skills to strike false poses.\nHere is another thing to keep in mind. I happen to be a member in good standing of Jordan Peterson’s vaunted 3SD+ set. I have also met a number of people smarter than me, people with higher IQs and more significant intellectual accomplishments, up to and including the Fields Medal. After college, I lived in a house where four of the five residents were in that high-IQ set. And virtually none of the VHIQ and UHIQ people I have met over the last 35 years, in the USA, in Japan, or in Europe, have been Jews of any persuasion. To say this observation is statistically\nimprobable\nif Peterson’s claim concerning the makeup of the 145+ set was correct would be putting it mildly.\nIf you want to know why neither Jordan Peterson, Ben Shapiro, or Sargon of Akkad will ever dare to debate me on this subject,\nthis Twitter exchange from 2017\nmay help you understand why they always run.\nSargon‏ @Sargon_of_Akkad\nHas the alt right come to terms with the fact the Jews are just better than they are?\nGreg Matusow @gregmatusow\nsounds like something a jew would say\nSargon‏ @Sargon_of_Akkad\nSounds like something a race realist who depends on IQ scores to say, you mean.\nSupreme Dark Lord‏ @voxday\nYour metric is incorrect, Sargon. First, there are 48 high-IQ Han, 11 high-IQ Europeans, and 5 high-IQ Japanese for every high-IQ Jew.\nSargon‏ @Sargon_of_Akkad\nOf course, but that’s only because of population size.\nSupreme Dark Lord‏ @voxday\nObviously. But you cannot claim they are not overrepresented in X because intelligent when there are 64 more intelligent non-Jews per Jew.\nNotice how Sargon blithely contradicted his own position without even realizing it in response to my appeal to population statistics. He’s not merely overmatched, he’s completely inept. Both Ben Shapiro and Sargon are good examples of midwits who attempt to present themselves to their low-IQ followers as highly intelligent thinkers. Shapiro is perhaps a little more successful than Sargon in this regard, but mostly because he speaks quickly enough to prevent the average individual from following what he is actually saying, which is seldom original or insightful even when it isn’t dishonest or deceptive.\nThe fact that the Ivy League admissions offices are now desperately defining Jewish identity downward in order to try to conceal the level of their corruption and conspiratorial bias proves that they have been ruthlessly practicing anti-European and anti-Asian discrimination for decades. This also explains why white Americans have no choice about accepting the challenge of identity politics, because their rivals have been aggressively playing identity politics at their expense since the 1920s.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-12-10T14:46:12+00:00"
}