{
  "url": "https://voxday.net/2007/06/12/apparently-i-produce-ny/",
  "scraped_at": "2026-01-08T21:44:25.461717",
  "title": "Figments of my imagination",
  "date_display": "June 12, 2007",
  "date_iso": "2007-06-12T08:49:00+00:00",
  "date_from_url": "2007-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Argville thinks I’m <a href=\"http://argville.com/2007/06/idiot-of-day-vox-popoli.html\">just making up the idea</a> that Democrats believe they are smarter than Republicans, and that the Republican tendency to reject evolution is a popular justification for this belief:</p><blockquote><p>This person doesn’t offers a single example of anyone, evolutionist or otherwise, calling Independents or Democrats smarter because of this one issue, but that doesn’t stop this idiot from saying it. He simply made it up.</p></blockquote><p>Yes, because everyone knows that unless you provide ten footnoted citations, each written in blood and sworn on the Book of Mormon before being peer reviewed in a prestigious scientific journal, it cannot be true….  The fact that I didn’t bother to provide an example of something fairly commonly expressed around the Internet doesn’t make it untrue or indicate that I made it up, it merely means I have not proved the assertion should anyone choose to doubt it.  But, since apparently Argville has so little experience of blogs such as <a href=\"http://pharyngula.org/index/weblog/comments/breaking_news_republicans_are_idiots/\">the one belonging to my good friend and fellow scientist, Dr. PZ Myers</a>, who loyally <a href=\"http://scienceblogs.com/pharyngula/2007/06/religionour_maelstrom_of_ignor.php\">has my back again</a> today, I’ll give him this example:</p><p><em><a href=\"http://nanovirus.blogspot.com/2004/11/democrats-dominate-academia-because.html\">Democrats dominate academia because they are smarter than Republicans</a></em></p><p>I want to point out a couple of choice excerpts from letters to the editor of today’s New York Times. These letters are responding to an article from November 18th, “Republicans Outnumbered in Academia:”</p><p> [A] national survey of more than 1,000 academics, shows that Democratic professors outnumber Republicans by at least seven to one in the humanities and social sciences. That ratio is more than twice as lopsided as it was three decades ago, and it seems quite likely to keep increasing…</p><p>Here they are:</p><p> “Academics are trained to reason using logic, to question evidence and to consider and evaluate several possible interpretations of events. All these activities are discouraged and indeed ridiculed by the present Republican leadership.”</p><p>Similarly,</p><p> “A successful career in academia, after all, requires willingness to be critical of yourself and to learn from experience, along with a lack of interest in material incentives. All these are antithetical to Republicanism as it has recently come to be.”</p><p>I think these writers are onto something. Other evidence, albeit circumstantial, abounds. Take a look at the aggregate IQ scores of the Blue states vs Red states. Blue states have a dramatically higher IQ. Or to put it more eloquently:</p><p> “[Republicans] are stupid. They believe that Saddam Hussein was directly responsible for September 11, 2001. They think corn syrup is food. They believe that there’s no such thing as stateless terrorism. They believe that “the left” is responsible for the revolting cesspool of popular culture. They don’t believe in evolution.”</p><blockquote><p>And his “Republicans live longer” statement is totally absurd. He draws this conclusion from the life expectancy by state! Can you believe that? OK, that’s dumb enough but even playing that game, the state with the highest life expectancy in the USA is Hawaii, a blue state. So where does the Republican live longer bullshit come from? Again, the idiot made it up.</p></blockquote><p>Actually, I very much agree that <a href=\"http://chrisevans3d.com/files/iq.htm\">arguments by state population</a> are absurd.  Of course, Argville probably isn’t aware that I was mocking Sam Harris and Richard Dawkins by “proving” that Republicans live longer using state data, perhaps he’s not aware of Harris’s famously silly “Red State Immorality” argument, which Dawkins quotes in its entirety in “The God Delusion”.</p><p><em>While political party affiliation in the United States is not a perfect indicator of religiosity, it is no secret that the “red states” are primarily red because of the overwhelming political influence of conservative Christians. If there were a strong correlation between Christian conservatism and social health, we might expect to see some sign of it in red-state America. We don’t. Of the 25 cities with the lowest rates of violent crime, 62 percent are in “blue” states and 38 percent are in “red” states. … Of the 22 states with the highest rates of murder, 17 are red.</em></p><p>The “bullshit” comes from the fact that the most Democratic “state”, Washington DC, has the lowest life expectancy, while the most Republican state has the second-highest.  But this proves nothing conclusively, Argville is right to be dubious of those who try to prove anything about individuals through the use of statewide, let alone nationwide, data.</p><p>I wonder if he will conclude that Sam Harris and Richard Dawkins, in their habitual reliance on such arguments, are actually the sort of idiot he believes me to be?</p><p>I do thank Argville for the award, however, and I shall certainly cherish my Argie for “Idiot of the Day”.  I intend to put it on the mantle in between my much-prized “Godidiot of the Week” and “Pointy Stick” awards.</p></div>",
  "content_text": "Argville thinks I’m\njust making up the idea\nthat Democrats believe they are smarter than Republicans, and that the Republican tendency to reject evolution is a popular justification for this belief:\nThis person doesn’t offers a single example of anyone, evolutionist or otherwise, calling Independents or Democrats smarter because of this one issue, but that doesn’t stop this idiot from saying it. He simply made it up.\nYes, because everyone knows that unless you provide ten footnoted citations, each written in blood and sworn on the Book of Mormon before being peer reviewed in a prestigious scientific journal, it cannot be true….  The fact that I didn’t bother to provide an example of something fairly commonly expressed around the Internet doesn’t make it untrue or indicate that I made it up, it merely means I have not proved the assertion should anyone choose to doubt it.  But, since apparently Argville has so little experience of blogs such as\nthe one belonging to my good friend and fellow scientist, Dr. PZ Myers\n, who loyally\nhas my back again\ntoday, I’ll give him this example:\nDemocrats dominate academia because they are smarter than Republicans\nI want to point out a couple of choice excerpts from letters to the editor of today’s New York Times. These letters are responding to an article from November 18th, “Republicans Outnumbered in Academia:”\n[A] national survey of more than 1,000 academics, shows that Democratic professors outnumber Republicans by at least seven to one in the humanities and social sciences. That ratio is more than twice as lopsided as it was three decades ago, and it seems quite likely to keep increasing…\nHere they are:\n“Academics are trained to reason using logic, to question evidence and to consider and evaluate several possible interpretations of events. All these activities are discouraged and indeed ridiculed by the present Republican leadership.”\nSimilarly,\n“A successful career in academia, after all, requires willingness to be critical of yourself and to learn from experience, along with a lack of interest in material incentives. All these are antithetical to Republicanism as it has recently come to be.”\nI think these writers are onto something. Other evidence, albeit circumstantial, abounds. Take a look at the aggregate IQ scores of the Blue states vs Red states. Blue states have a dramatically higher IQ. Or to put it more eloquently:\n“[Republicans] are stupid. They believe that Saddam Hussein was directly responsible for September 11, 2001. They think corn syrup is food. They believe that there’s no such thing as stateless terrorism. They believe that “the left” is responsible for the revolting cesspool of popular culture. They don’t believe in evolution.”\nAnd his “Republicans live longer” statement is totally absurd. He draws this conclusion from the life expectancy by state! Can you believe that? OK, that’s dumb enough but even playing that game, the state with the highest life expectancy in the USA is Hawaii, a blue state. So where does the Republican live longer bullshit come from? Again, the idiot made it up.\nActually, I very much agree that\narguments by state population\nare absurd.  Of course, Argville probably isn’t aware that I was mocking Sam Harris and Richard Dawkins by “proving” that Republicans live longer using state data, perhaps he’s not aware of Harris’s famously silly “Red State Immorality” argument, which Dawkins quotes in its entirety in “The God Delusion”.\nWhile political party affiliation in the United States is not a perfect indicator of religiosity, it is no secret that the “red states” are primarily red because of the overwhelming political influence of conservative Christians. If there were a strong correlation between Christian conservatism and social health, we might expect to see some sign of it in red-state America. We don’t. Of the 25 cities with the lowest rates of violent crime, 62 percent are in “blue” states and 38 percent are in “red” states. … Of the 22 states with the highest rates of murder, 17 are red.\nThe “bullshit” comes from the fact that the most Democratic “state”, Washington DC, has the lowest life expectancy, while the most Republican state has the second-highest.  But this proves nothing conclusively, Argville is right to be dubious of those who try to prove anything about individuals through the use of statewide, let alone nationwide, data.\nI wonder if he will conclude that Sam Harris and Richard Dawkins, in their habitual reliance on such arguments, are actually the sort of idiot he believes me to be?\nI do thank Argville for the award, however, and I shall certainly cherish my Argie for “Idiot of the Day”.  I intend to put it on the mantle in between my much-prized “Godidiot of the Week” and “Pointy Stick” awards.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-12T07:49:00+00:00"
}