{
  "url": "https://voxday.net/2007/06/21/battle-for-britain-part-ii/",
  "scraped_at": "2026-01-08T21:45:35.023983",
  "title": "The Battle for Britain, part II",
  "date_display": "June 21, 2007",
  "date_iso": "2007-06-21T09:45:00+00:00",
  "date_from_url": "2007-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ambrose Evans-Pritchard finally realizes that <a href=\"http://www.telegraph.co.uk/money/main.jhtml?xml=/money/2007/06/18/ccview118.xml\">Britain must leave the European Union</a>:</p><blockquote><p>If Europe’s political leaders succeed in ramming through a barely disguised remake of the same European constitution rejected by the French and Dutch people, I for one will come off the fence after years of hesitation and join the fight for total British withdrawal from the Union….</p><p>I was at the Laeken “razor-wire” summit in December 2001 when Europe’s bruised leaders chewed over Ireland’s “No” to Nice, and Denmark’s “No” to the euro, and vowed henceforth to listen to the people.</p><p>There would be an end to the “creeping expansion of the competences of the Union”. Power would flow back to the nations.  I lived and breathed every moment of the betrayal thereafter: the hijacking of Laeken by Franco-Belgian diplomats to rush through an EU constitution before the Poles, Czechs, and Balts arrived; the charade of a Philadelphia “Convention” of parliamentarians, when the real drafting was done by Commission lawyers answering to a Euro-imperialist.</p><p>Gisela Stuart, Britain’s sole voice on the Presidium, called the process a stitch-up from start to end, moulded by an “unaccountable political elite”.  Dissent was ignored. Documents were slipped through in French late at night. “Not once did representatives question whether deeper integration is what the people of Europe want,” she said.</p></blockquote><p>Pritchard explains <a href=\"http://blogs.telegraph.co.uk/business/ambrosevanspritchard/june07/eustayorgo.htm\">his 15-year hesitation</a> to come out and directly oppose the Fourth Reich on his blog.  They’re all reasonable and understandable, and as events have proven, ultimately irrelevant.  One must oppose the centralization of power for its own sake, because those who seek it are usually intelligent enough to provide a half-way reasonable case to delay the potential opposition.  And as Pritchard has learned, they are always lying in order to buy enough time to advance the process to the point of no return.</p><p>UPDATE: Lest you think I’m <a href=\"http://www.eternalwarriors.com/TBmedal.html\">indulging in science fiction</a> by identifying the EU as the Fourth Reich, this comment from a Europhile sort of gives the game away:</p><blockquote><p>If the EU can complete the process of continental integration that wars failed to complete in 1914 and 1939, then that would be a very good thing. An EU of continental countries would be able to create a European consciousness as well as a European economy.</p></blockquote><p>The EU is simply an attempt to do what Hitler did, using banks instead of tanks.  And the Brussels bureaucrats are not much fonder of Jews than their predecessors in Berlin were.</p></div>",
  "content_text": "Ambrose Evans-Pritchard finally realizes that\nBritain must leave the European Union\n:\nIf Europe’s political leaders succeed in ramming through a barely disguised remake of the same European constitution rejected by the French and Dutch people, I for one will come off the fence after years of hesitation and join the fight for total British withdrawal from the Union….\nI was at the Laeken “razor-wire” summit in December 2001 when Europe’s bruised leaders chewed over Ireland’s “No” to Nice, and Denmark’s “No” to the euro, and vowed henceforth to listen to the people.\nThere would be an end to the “creeping expansion of the competences of the Union”. Power would flow back to the nations.  I lived and breathed every moment of the betrayal thereafter: the hijacking of Laeken by Franco-Belgian diplomats to rush through an EU constitution before the Poles, Czechs, and Balts arrived; the charade of a Philadelphia “Convention” of parliamentarians, when the real drafting was done by Commission lawyers answering to a Euro-imperialist.\nGisela Stuart, Britain’s sole voice on the Presidium, called the process a stitch-up from start to end, moulded by an “unaccountable political elite”.  Dissent was ignored. Documents were slipped through in French late at night. “Not once did representatives question whether deeper integration is what the people of Europe want,” she said.\nPritchard explains\nhis 15-year hesitation\nto come out and directly oppose the Fourth Reich on his blog.  They’re all reasonable and understandable, and as events have proven, ultimately irrelevant.  One must oppose the centralization of power for its own sake, because those who seek it are usually intelligent enough to provide a half-way reasonable case to delay the potential opposition.  And as Pritchard has learned, they are always lying in order to buy enough time to advance the process to the point of no return.\nUPDATE: Lest you think I’m\nindulging in science fiction\nby identifying the EU as the Fourth Reich, this comment from a Europhile sort of gives the game away:\nIf the EU can complete the process of continental integration that wars failed to complete in 1914 and 1939, then that would be a very good thing. An EU of continental countries would be able to create a European consciousness as well as a European economy.\nThe EU is simply an attempt to do what Hitler did, using banks instead of tanks.  And the Brussels bureaucrats are not much fonder of Jews than their predecessors in Berlin were.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-21T08:45:00+00:00"
}