{
  "url": "https://voxday.net/2007/06/14/but-are-they-still-selfis/",
  "scraped_at": "2026-01-08T21:44:48.917675",
  "title": "But are they still selfish?",
  "date_display": "June 14, 2007",
  "date_iso": "2007-06-14T11:03:00+00:00",
  "date_from_url": "2007-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>In <a href=\"http://www.scienceblog.com/cms/findings-challenge-basic-views-human-genome-13465.html\">a group paper published</a> in the June 14 issue of Nature and in 28 companion papers published in the June issue of Genome Research, the ENCyclopedia Of DNA Elements (ENCODE) consortium, which is organized by the National Human Genome Research Institute (NHGRI), part of the National Institutes of Health (NIH), reported results of its exhaustive, four-year effort to build a parts list of all biologically functional elements in 1 percent of the human genome. Carried out by 35 groups from 80 organizations around the world, the research served as a pilot to test the feasibility of a full-scale initiative to produce a comprehensive catalog of all components of the human genome crucial for biological function.</p><p>“This impressive effort has uncovered many exciting surprises and blazed the way for future efforts to explore the functional landscape of the entire human genome,” said NHGRI Director Francis S. Collins, M.D., Ph.D. “Because of the hard work and keen insights of the ENCODE consortium, the scientific community will need to rethink some long-held views about what genes are and what they do, as well as how the genome’s functional elements have evolved. This could have significant implications for efforts to identify the DNA sequences involved in many human diseases.”</p></blockquote><p>One of the ironic things about the attacks of Richard Dawkins and Sam Harris on Francis Collins and his religious faith is that unlike Dawkins and Harris, Collins is still actually doing science.  Dawkins doesn’t do science anymore, he’s merely a third-rate propagandist now, and Harris never has.</p><p>I just find it amusing, especially since even the humble applied science which I do on a regular basis involves more use of the scientific method than anything Dawkins or Harris are doing.  I suspect that Dawkins has a fundamentally unscientific mind; not only does he make no effort to provide any empirical evidence for his arguments in  “Unweaving the Rainbow” and “The God Delusion”, but his most famous invention, the meme, is more literary device than science, it’s a metaphor that too many people have made the mistake of taking literally.</p><p>I haven’t been paying enough attention to the ENCODE consortium to have any idea what’s going on there, but in the event that Collins and his associates should discover something that renders untenable the selfish gene theory which Dawkins has made popular, I will laugh myself sick.</p><p>By the way, no one answered my question yesterday.  If genes are the active component of evolution, how do morals evolve?</p><p>I note that the concept of ongoing moral evolution beyond historic theistic moralities directly contradicts the concept of natural selection, as theists subscribing to those moralities are replicating at rates far beyond those of an atheistic persuasion who subscribe to a purportedly more highly evolved morality.</p></div>",
  "content_text": "In\na group paper published\nin the June 14 issue of Nature and in 28 companion papers published in the June issue of Genome Research, the ENCyclopedia Of DNA Elements (ENCODE) consortium, which is organized by the National Human Genome Research Institute (NHGRI), part of the National Institutes of Health (NIH), reported results of its exhaustive, four-year effort to build a parts list of all biologically functional elements in 1 percent of the human genome. Carried out by 35 groups from 80 organizations around the world, the research served as a pilot to test the feasibility of a full-scale initiative to produce a comprehensive catalog of all components of the human genome crucial for biological function.\n“This impressive effort has uncovered many exciting surprises and blazed the way for future efforts to explore the functional landscape of the entire human genome,” said NHGRI Director Francis S. Collins, M.D., Ph.D. “Because of the hard work and keen insights of the ENCODE consortium, the scientific community will need to rethink some long-held views about what genes are and what they do, as well as how the genome’s functional elements have evolved. This could have significant implications for efforts to identify the DNA sequences involved in many human diseases.”\nOne of the ironic things about the attacks of Richard Dawkins and Sam Harris on Francis Collins and his religious faith is that unlike Dawkins and Harris, Collins is still actually doing science.  Dawkins doesn’t do science anymore, he’s merely a third-rate propagandist now, and Harris never has.\nI just find it amusing, especially since even the humble applied science which I do on a regular basis involves more use of the scientific method than anything Dawkins or Harris are doing.  I suspect that Dawkins has a fundamentally unscientific mind; not only does he make no effort to provide any empirical evidence for his arguments in  “Unweaving the Rainbow” and “The God Delusion”, but his most famous invention, the meme, is more literary device than science, it’s a metaphor that too many people have made the mistake of taking literally.\nI haven’t been paying enough attention to the ENCODE consortium to have any idea what’s going on there, but in the event that Collins and his associates should discover something that renders untenable the selfish gene theory which Dawkins has made popular, I will laugh myself sick.\nBy the way, no one answered my question yesterday.  If genes are the active component of evolution, how do morals evolve?\nI note that the concept of ongoing moral evolution beyond historic theistic moralities directly contradicts the concept of natural selection, as theists subscribing to those moralities are replicating at rates far beyond those of an atheistic persuasion who subscribe to a purportedly more highly evolved morality.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-14T10:03:00+00:00"
}