{
  "url": "https://voxday.net/2007/06/20/creating-sexists/",
  "scraped_at": "2026-01-08T21:45:29.526759",
  "title": "Creating sexists through literature",
  "date_display": "June 20, 2007",
  "date_iso": "2007-06-20T19:48:00+00:00",
  "date_from_url": "2007-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cathy Young worries about the terrible problem that <em>The Dangerous Book for Boys</em> <a href=\"http://www.reason.com/news/show/120879.html\">might not suit every child on the planet</a>:</p><blockquote><p>“I would have loved this book as a kid, and it really bugs me how people are saying ‘this is such a great book for boys, and it’s so wonderful that it’s aimed at boys,'” she says. “Where is the book for girls who did stuff like make their own chain mail as kids, or cracked rocks with sledgehammers in the driveway both to see what was inside them and to see if you could get sparks?”</p><p>Less attention has been paid to the boys who are not particularly into “boy things,” who may be more interested in reading than in catching snails and may prefer art to stories of battles. The fact is that for both girls and boys, biologically based gender differences—which some feminists have been far too dogmatic in denying—are considerably attenuated by individual differences.</p></blockquote><p>Obviously, there will be a third book in the series, <em>The Sensitive Book for Sissies</em>, followed by <em>The Transgendered Book for Tomboys</em>.  Why doesn’t the finger-waving feminist bitch worry about all those poor boys in China who don’t read English and are therefore similarly deprived of attention from the book? And what about those poor illiterate boys who can’t read in the first place?  Don’t they need a book too?</p><p>Why can’t idiot fucking women keep their insatiably nagging noses out of any-fucking-thing?  It’s a boy’s book, for boys.  There’s not only thousands of books marketed for girls, but there’s absolutely nothing that has stopped anyone from publishing a dangerous book for girls since Gutenberg invented the bloody printing press 557 years ago.  But two guys write one successful book for boys, and suddenly we have the ritual tearing of the clothes and donning of the sackcloth and heaping of the ashes because, oh no, the girls, the nancy-boys and the tom-dykes of tomorrow haven’t been included for once.</p><p>And what about the cover?  Was it inclusive enough, did we have the requisite white kid, black kid, Asian kid and Hispanic kid all smiling in multiracial harmony?  Oh no, we forgot the damn Eskimo!  Break out the sackcloth!</p><p>In the immortal words of The Sports Guy: “Women ruin everything.”</p></div>",
  "content_text": "Cathy Young worries about the terrible problem that\nThe Dangerous Book for Boys\nmight not suit every child on the planet\n:\n“I would have loved this book as a kid, and it really bugs me how people are saying ‘this is such a great book for boys, and it’s so wonderful that it’s aimed at boys,'” she says. “Where is the book for girls who did stuff like make their own chain mail as kids, or cracked rocks with sledgehammers in the driveway both to see what was inside them and to see if you could get sparks?”\nLess attention has been paid to the boys who are not particularly into “boy things,” who may be more interested in reading than in catching snails and may prefer art to stories of battles. The fact is that for both girls and boys, biologically based gender differences—which some feminists have been far too dogmatic in denying—are considerably attenuated by individual differences.\nObviously, there will be a third book in the series,\nThe Sensitive Book for Sissies\n, followed by\nThe Transgendered Book for Tomboys\n.  Why doesn’t the finger-waving feminist bitch worry about all those poor boys in China who don’t read English and are therefore similarly deprived of attention from the book? And what about those poor illiterate boys who can’t read in the first place?  Don’t they need a book too?\nWhy can’t idiot fucking women keep their insatiably nagging noses out of any-fucking-thing?  It’s a boy’s book, for boys.  There’s not only thousands of books marketed for girls, but there’s absolutely nothing that has stopped anyone from publishing a dangerous book for girls since Gutenberg invented the bloody printing press 557 years ago.  But two guys write one successful book for boys, and suddenly we have the ritual tearing of the clothes and donning of the sackcloth and heaping of the ashes because, oh no, the girls, the nancy-boys and the tom-dykes of tomorrow haven’t been included for once.\nAnd what about the cover?  Was it inclusive enough, did we have the requisite white kid, black kid, Asian kid and Hispanic kid all smiling in multiracial harmony?  Oh no, we forgot the damn Eskimo!  Break out the sackcloth!\nIn the immortal words of The Sports Guy: “Women ruin everything.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-20T18:48:00+00:00"
}