{
  "url": "https://voxday.net/2007/06/08/dawkins-nemesis/",
  "scraped_at": "2026-01-08T21:44:11.023917",
  "title": "Dawkins’ Nemesis",
  "date_display": "June 8, 2007",
  "date_iso": "2007-06-08T18:56:00+00:00",
  "date_from_url": "2007-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>I heard a story yesterday which made my blood boil.  To repeat the details would be to risk identifying an innocent child, so I will give no more than a bare outline.</p><p>It happened at an apparently happy and tolerably well run primary school.  Two boys, both six years old, were playing merrily together during morning break.  They are the best of pals.  One is white, the other is black.  In the course of the game the white boy, giggling all the while, said his friend was a “little monkey”.  The black boy giggled just as heartily.  All would have been well, but a teacher overhead the awful words. <a href=\"http://my.telegraph.co.uk/slightly_grumpy/june_2007/the_nastiness_of_political_correctness.htm\">The white boy was in big trouble.</a></p></blockquote><p>Dawkins has described a touching picture of a long transtemporal line of women, each holding hands with their daughters, stretching all the way back from modern women to genuine apes or quasi-chimpanzees of some sort or another, I can’t recall.  But I noticed that he never quite got around to describing what color the hands were as they were getting increasingly more furry.</p><p>I understand that evolutionary biologists believe human variance to be very slight and that there is only the one species.  But obviously someone, somewhere, has to be in possession of genes that are more evolutionarily advanced than the next individual.  Who might that be?  Dawkins is very passionate about the need for humanity to take control over our Darwinian destiny, and yet, he never seems to have much to say about exactly what that control might be, how we are to go about taking it or what we should do with it.</p><p>I wonder why that might be?</p></div>",
  "content_text": "I heard a story yesterday which made my blood boil.  To repeat the details would be to risk identifying an innocent child, so I will give no more than a bare outline.\nIt happened at an apparently happy and tolerably well run primary school.  Two boys, both six years old, were playing merrily together during morning break.  They are the best of pals.  One is white, the other is black.  In the course of the game the white boy, giggling all the while, said his friend was a “little monkey”.  The black boy giggled just as heartily.  All would have been well, but a teacher overhead the awful words.\nThe white boy was in big trouble.\nDawkins has described a touching picture of a long transtemporal line of women, each holding hands with their daughters, stretching all the way back from modern women to genuine apes or quasi-chimpanzees of some sort or another, I can’t recall.  But I noticed that he never quite got around to describing what color the hands were as they were getting increasingly more furry.\nI understand that evolutionary biologists believe human variance to be very slight and that there is only the one species.  But obviously someone, somewhere, has to be in possession of genes that are more evolutionarily advanced than the next individual.  Who might that be?  Dawkins is very passionate about the need for humanity to take control over our Darwinian destiny, and yet, he never seems to have much to say about exactly what that control might be, how we are to go about taking it or what we should do with it.\nI wonder why that might be?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-08T17:56:00+00:00"
}