{
  "url": "https://voxday.net/2007/06/12/lies-of-science/",
  "scraped_at": "2026-01-08T21:44:30.977020",
  "title": "The lies of science",
  "date_display": "June 12, 2007",
  "date_iso": "2007-06-12T11:10:00+00:00",
  "date_from_url": "2007-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scientists and their blindly adoring cheerleaders are blatantly and habitually misleading about the way in which the scientific method produces technological breakthroughs as well as the noble dedication of science to nothing but material truth derived from empirical evidence.  Consider, for example, how often penicillin is cited as one of the reasons we must be humbly grateful for science and then consider <a href=\"http://www.answers.com/topic/ernest-duchesne\">the truth of how it was “discovered”</a>:</p><blockquote><p>Ernest Duchesne was a French physician who noted that certain moulds kill bacteria. He made this discovery thirty-two years before Alexander Fleming discovered the antibiotic properties of penicillin, a substance derived from those moulds, but his research went unnoticed….</p><p>Duchesne had made his breakthrough by observing how the Arab stable boys at the army hospital kept their saddles in a dark and damp room to encourage mould to grow on them. When he asked why, they told him that the mould helped to heal the saddle sores on the horses.</p></blockquote><p>1.  Duchesne didn’t discover penicillin, the Arabs did.  Duchesne simply deepened human understanding of it and expanded its range of applications.</p><p>2.  Duchesne was completely ignored by the scientific community. Which should be unsurprising, as we are often assured by scientists today that if an individual hasn’t been published in a recognized, peer-reviewed publication, he can’t possibly be committing science or saying anything worthwhile.  How seriously would a 23 year-old med student submitting a paper upending evolution be taken today, even if he had iron-clad proof of rabbit fossiles in the pre-Cambrian?</p><p>3.  Duchesne wasn’t a scientist, he was a military doctor.</p><p>Science deserves no significant credit for the manifold benefits of penicillin.  It was not discovered by scientody, it was not discovered by scientists, the idiosyncracies of scientistry delayed the realization of its benefits by decades, and scientists do not provide it or any of its derivatives to those who are in need of them.</p><p>Of the most important human inventions, relatively few have been produced by scientists or by the scientific method.  Science didn’t produce the wheel, writing, the printing press, the personal computer or penicillin.  It didn’t produce anesthesia, the toilet or the airplane.  And while science has provided humanity with an effective means of exploiting its non-scientific discoveries, on the other hand, professional scientists have done an even more impressive job of developing the weapons that currently imperil our continued existence on the planet.</p><p>Science isn’t inherently bad, but it is far from the unbiased, unmitigated good that its adherents believe it to be.  And it is far more dangerous to humanity than religion has ever been or ever will be.</p></div>",
  "content_text": "Scientists and their blindly adoring cheerleaders are blatantly and habitually misleading about the way in which the scientific method produces technological breakthroughs as well as the noble dedication of science to nothing but material truth derived from empirical evidence.  Consider, for example, how often penicillin is cited as one of the reasons we must be humbly grateful for science and then consider\nthe truth of how it was “discovered”\n:\nErnest Duchesne was a French physician who noted that certain moulds kill bacteria. He made this discovery thirty-two years before Alexander Fleming discovered the antibiotic properties of penicillin, a substance derived from those moulds, but his research went unnoticed….\nDuchesne had made his breakthrough by observing how the Arab stable boys at the army hospital kept their saddles in a dark and damp room to encourage mould to grow on them. When he asked why, they told him that the mould helped to heal the saddle sores on the horses.\n1.  Duchesne didn’t discover penicillin, the Arabs did.  Duchesne simply deepened human understanding of it and expanded its range of applications.\n2.  Duchesne was completely ignored by the scientific community. Which should be unsurprising, as we are often assured by scientists today that if an individual hasn’t been published in a recognized, peer-reviewed publication, he can’t possibly be committing science or saying anything worthwhile.  How seriously would a 23 year-old med student submitting a paper upending evolution be taken today, even if he had iron-clad proof of rabbit fossiles in the pre-Cambrian?\n3.  Duchesne wasn’t a scientist, he was a military doctor.\nScience deserves no significant credit for the manifold benefits of penicillin.  It was not discovered by scientody, it was not discovered by scientists, the idiosyncracies of scientistry delayed the realization of its benefits by decades, and scientists do not provide it or any of its derivatives to those who are in need of them.\nOf the most important human inventions, relatively few have been produced by scientists or by the scientific method.  Science didn’t produce the wheel, writing, the printing press, the personal computer or penicillin.  It didn’t produce anesthesia, the toilet or the airplane.  And while science has provided humanity with an effective means of exploiting its non-scientific discoveries, on the other hand, professional scientists have done an even more impressive job of developing the weapons that currently imperil our continued existence on the planet.\nScience isn’t inherently bad, but it is far from the unbiased, unmitigated good that its adherents believe it to be.  And it is far more dangerous to humanity than religion has ever been or ever will be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-12T10:10:00+00:00"
}