{
  "url": "https://voxday.net/2007/06/18/missing-marke/",
  "scraped_at": "2026-01-08T21:45:11.086983",
  "title": "Missing the market",
  "date_display": "June 18, 2007",
  "date_iso": "2007-06-18T10:00:00+00:00",
  "date_from_url": "2007-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s all grins and giggles until <a href=\"http://www.brentrasmussen.com/log/node/1380#comments\">the imitator eats your lunch</a>:</p><blockquote><p>Ah, yes, imitation is the highest form of lameness, at least when it comes to GodTube – a Christian YouTube wanna-be….</p><p>A commenter adds:  And isn’t it funny how, as with so many things, this type of site wasn’t created by Christians, but only copied — much later — in a lame, hopeful effort to borrow some of the Cool of the original creative idea?</p></blockquote><p>I’m pretty sure CNN stockholders don’t find <a href=\"http://insidecable.blogsome.com/category/ratings/\">the ratings rape</a> they now regularly endure at the hands of Fox News to be particularly funny.  Certainly neither the mainstream media nor the Washington establishment is laughing at talk radio these days, and if there are no shortage of those who find WND to be laughable, no one in the media is laughing at the fact that it has 250,000 daily readers, enough to rank it in the top 50 national newspapers if it were a traditional publication.</p><p>The existence of Conservapedia and GodTube isn’t because conservatives and Christians are lame.  They may well be, but that’s irrelevant.  The reason the imitators exist is because Wikipedia and YouTube have made exactly the same mistake that their predecessors in the mainstream media did by attempting to control the flow of information on behalf of their political biases at the expense of the larger part of their potential market.</p><p>And if history is a reliable guide, due to this mistake, there is a good chance they will eventually be surpassed by their lame and hopeful imitators.</p></div>",
  "content_text": "It’s all grins and giggles until\nthe imitator eats your lunch\n:\nAh, yes, imitation is the highest form of lameness, at least when it comes to GodTube – a Christian YouTube wanna-be….\nA commenter adds:  And isn’t it funny how, as with so many things, this type of site wasn’t created by Christians, but only copied — much later — in a lame, hopeful effort to borrow some of the Cool of the original creative idea?\nI’m pretty sure CNN stockholders don’t find\nthe ratings rape\nthey now regularly endure at the hands of Fox News to be particularly funny.  Certainly neither the mainstream media nor the Washington establishment is laughing at talk radio these days, and if there are no shortage of those who find WND to be laughable, no one in the media is laughing at the fact that it has 250,000 daily readers, enough to rank it in the top 50 national newspapers if it were a traditional publication.\nThe existence of Conservapedia and GodTube isn’t because conservatives and Christians are lame.  They may well be, but that’s irrelevant.  The reason the imitators exist is because Wikipedia and YouTube have made exactly the same mistake that their predecessors in the mainstream media did by attempting to control the flow of information on behalf of their political biases at the expense of the larger part of their potential market.\nAnd if history is a reliable guide, due to this mistake, there is a good chance they will eventually be surpassed by their lame and hopeful imitators.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-18T09:00:00+00:00"
}