{
  "url": "https://voxday.net/2007/06/15/moral-abomination-of-abortion/",
  "scraped_at": "2026-01-08T21:44:54.451701",
  "title": "The moral abomination of abortion",
  "date_display": "June 15, 2007",
  "date_iso": "2007-06-15T11:06:00+00:00",
  "date_from_url": "2007-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have long argued that calling a feminist a feminazi is an insult to the German National Socialist Workers Party.  And I have no doubt that in 100 years, <a href=\"http://www.timesonline.co.uk/tol/comment/columnists/gerard_baker/article1934760.ece\">feminists and abortionettes will be regarded with the same disgust</a> that we currently harbor for Nazis, slave-traders and slave-holders:</p><blockquote><p>After years of wondering whether we’ll ever change society’s permissive attitude towards abortion, I’m convinced that we will some day come to view it in the way we now view slavery, a moral abomination that generations simply became inured to by usage and practice.</p><p>The big difference, of course, is that abortion is worse than slavery. Not just in the obvious sense that it involves the taking of life rather than liberty. But because our current debate suggests that deep down most of us really know there’s something quite wrong with abortion.</p><p>Say what you will about the slaveowners, I doubt many of them sat around agonising about their decision to keep Uncle Tom and his family chained to the shack at the end of the drive. I doubt they justified it, after much soul-searching, by saying they were only painfully exercising their “choice” to own slaves so they wouldn’t have to sacrifice their standard of living.</p></blockquote><p>Abortionettes should be no more tolerated than Nazis, Fascists or Communists.  They are a blight on the planet, an example of the very worst sort of failed humans that humanity has yet produced.</p><p>Fortunately, now that <a href=\"http://feministing.com/archives/007187.html\">a judicial precedent has not only been created, but endorsed by feminists</a>, we can significantly reduce abortion by prohibiting women who have had abortions from ever dating again.  We need merely take the names and pictures of those women who murder their unborn children and place them on a national Do-Not-Date registry which can be readily accessed via the Internet, email and SMS.</p><p>This would not only prevent any recurrences, but would arguably have a significant deterrent effect.</p></div>",
  "content_text": "I have long argued that calling a feminist a feminazi is an insult to the German National Socialist Workers Party.  And I have no doubt that in 100 years,\nfeminists and abortionettes will be regarded with the same disgust\nthat we currently harbor for Nazis, slave-traders and slave-holders:\nAfter years of wondering whether we’ll ever change society’s permissive attitude towards abortion, I’m convinced that we will some day come to view it in the way we now view slavery, a moral abomination that generations simply became inured to by usage and practice.\nThe big difference, of course, is that abortion is worse than slavery. Not just in the obvious sense that it involves the taking of life rather than liberty. But because our current debate suggests that deep down most of us really know there’s something quite wrong with abortion.\nSay what you will about the slaveowners, I doubt many of them sat around agonising about their decision to keep Uncle Tom and his family chained to the shack at the end of the drive. I doubt they justified it, after much soul-searching, by saying they were only painfully exercising their “choice” to own slaves so they wouldn’t have to sacrifice their standard of living.\nAbortionettes should be no more tolerated than Nazis, Fascists or Communists.  They are a blight on the planet, an example of the very worst sort of failed humans that humanity has yet produced.\nFortunately, now that\na judicial precedent has not only been created, but endorsed by feminists\n, we can significantly reduce abortion by prohibiting women who have had abortions from ever dating again.  We need merely take the names and pictures of those women who murder their unborn children and place them on a national Do-Not-Date registry which can be readily accessed via the Internet, email and SMS.\nThis would not only prevent any recurrences, but would arguably have a significant deterrent effect.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-15T10:06:00+00:00"
}