{
  "url": "https://voxday.net/2007/06/07/most-violent-group/",
  "scraped_at": "2026-01-08T21:44:03.697934",
  "title": "The most dangerous worldview",
  "date_display": "June 7, 2007",
  "date_iso": "2007-06-07T23:31:00+00:00",
  "date_from_url": "2007-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Adams asks a question regarding <a href=\"http://dilbertblog.typepad.com/the_dilbert_blog/2007/06/the_great_debat.html\">which of three worldviews is the most dangerous</a>:</p><blockquote><p>Whenever I bring up the topic of Iraq or terrorism, it always sparks a sidebar debate about whether Islam is a violent religion. Let’s have that debate.</p><p>First, we have to agree that everything is relative. So the fun question is which of these worldviews are more dangerous:</p><p>1. Islam<br>2. Christianity<br>3. Atheism</br></br></p><p>To keep things simple and interesting, we’ll leave the Buddhists and Hindus and smaller religions out of it.</p></blockquote><p>I find it amusing that so many atheists, who are presumably rational materalists dedicated to the concept of truth determined by empirical evidence, immediately turn to making logic-based philosophical arguments as if they were medieval theologians in answer to this question instead of simply examining the relevant and readily available historical evidence.  Aren’t atheists were all about science, not ontological assertions?</p><p>Here’s the evidence: Christians have held positions of government power for 1,700 years. The religious wars they have waged account for just under 3 percent of the wars in recorded human history. Muslims have been in power for around 1300 years and are similarly responsible for about 4 percent of the wars in human history. Atheists have been in power for around 100 years and are responsible for around 2 percent of the wars in history.</p><p>Thus Christians have a war/year ratio of 0.176, Muslims a 0.307 ratio and atheists a 2.0 ratio, which does not factor in their predilection for mass internal slaughter of the sort committed in France, Spain, the Soviet Union, China, Kampuchea, Vietnam, North Korea, Ethiopia, etc.</p><p>Therefore, based on the empirical evidence, atheism is far and away the most dangerous worldview despite the absence of an atheist creed or god that explicitly demands wars and slaughter. This should be obvious, as given their small percentage of the world’s population, one should not be able to more easily cite examples of atheist violence than violence committed by the more numerous Hindus or Buddhists.  Fortunately, there are only five nations governed by atheist worldviews remaining in the world today, of which three are presently occupied with murdering a portion of their citizenry with the explicit goal of exterminating religion, North Korea, China and Laos.  Cuba and Vietnam appear to be laying off the persecutions, at least for the time being.</p><p>If you are interested in the precise numbers and sources, you’ll have to wait until <a href=\"http://www.amazon.com/Irrational-Atheist-Dissecting-Trinity-Dawkins/dp/1933771364\">THE IRRATIONAL ATHEIST</a> comes out. But if you want to verify my assertions with a rough estimate right away, you can start with categorizing the 489+ wars listed on Wikipedia and work out the percentages of which wars had a religious or aggressively atheist basis.  That will get you close, although since the list has a European bias it will somewhat overestimate the Christian wars.</p><p>Furthermore, atheists are more of a danger to themselves than either Muslims or Christians, as they are 37 percent more likely to attempt suicide, and, if first-degree relatives are a reliable indicator of religious faith or lack thereof, 230 percent more likely to successfully kill themselves.  (It’s obviously difficult to ask a successful suicide about his religious beliefs.)  It turns out that Catholics are the least likely to off themselves.</p><p>In light of the empirical evidence, I recommend that atheists stop attempting to defend atheism with increasingly absurd theoretical arguments and instead take a very hard look at why there is such a reliable correlation between their worldview and the commission of various forms of violence.  Correlation is not causation, but when the correlation approaches 90 percent, one cannot simply dismiss the relationship as a coincidental one.</p><p>This does not mean that all atheists are murderous butchers, but it strongly suggests that the small subset of atheists who pursue political power almost always are.  History suggests that Americans would be wise to keep a skeptical eye on <a href=\"http://en.wikipedia.org/wiki/Image:Pete_Stark.jpg\">that Pete Stark fellow</a>.  He does look rather like he’s slavering after what Christopher Hitchens tells us is the porcine savor of human flesh, doesn’t he.</p><p>UPDATE: due to some of the irrational atheists who believe that the absence of a citation is somehow synonymous with making things up, <a href=\"http://www.amazon.com/Encyclopedia-Wars-Library-World-History/dp/0816028516/ref=pd_bbs_2/104-1730309-3117525?ie=UTF8&amp;s=books&amp;qid=1181259328&amp;sr=8-2\">this is the source</a>.  I didn’t bother providing it because I assume that most of you aren’t going to drop $300 just to verify a blog post.  That’s why I suggested going through the 489 wars on Wikipedia to verify the numbers, which is precisely what I did before I picked up the encyclopedia.</p><p>It seems some of these intelligent, highly educated atheists can’t be bothered to actually do any research or original thinking for themselves; it’s so much easier to simply decide that something is inaccurate on the basis of no information whatsoever.</p><p>In answer to the question: percent of wars is calculated by the number of wars waged divided by the total 1,763 wars recorded.</p></div>",
  "content_text": "Scott Adams asks a question regarding\nwhich of three worldviews is the most dangerous\n:\nWhenever I bring up the topic of Iraq or terrorism, it always sparks a sidebar debate about whether Islam is a violent religion. Let’s have that debate.\nFirst, we have to agree that everything is relative. So the fun question is which of these worldviews are more dangerous:\n1. Islam\n2. Christianity\n3. Atheism\nTo keep things simple and interesting, we’ll leave the Buddhists and Hindus and smaller religions out of it.\nI find it amusing that so many atheists, who are presumably rational materalists dedicated to the concept of truth determined by empirical evidence, immediately turn to making logic-based philosophical arguments as if they were medieval theologians in answer to this question instead of simply examining the relevant and readily available historical evidence.  Aren’t atheists were all about science, not ontological assertions?\nHere’s the evidence: Christians have held positions of government power for 1,700 years. The religious wars they have waged account for just under 3 percent of the wars in recorded human history. Muslims have been in power for around 1300 years and are similarly responsible for about 4 percent of the wars in human history. Atheists have been in power for around 100 years and are responsible for around 2 percent of the wars in history.\nThus Christians have a war/year ratio of 0.176, Muslims a 0.307 ratio and atheists a 2.0 ratio, which does not factor in their predilection for mass internal slaughter of the sort committed in France, Spain, the Soviet Union, China, Kampuchea, Vietnam, North Korea, Ethiopia, etc.\nTherefore, based on the empirical evidence, atheism is far and away the most dangerous worldview despite the absence of an atheist creed or god that explicitly demands wars and slaughter. This should be obvious, as given their small percentage of the world’s population, one should not be able to more easily cite examples of atheist violence than violence committed by the more numerous Hindus or Buddhists.  Fortunately, there are only five nations governed by atheist worldviews remaining in the world today, of which three are presently occupied with murdering a portion of their citizenry with the explicit goal of exterminating religion, North Korea, China and Laos.  Cuba and Vietnam appear to be laying off the persecutions, at least for the time being.\nIf you are interested in the precise numbers and sources, you’ll have to wait until\nTHE IRRATIONAL ATHEIST\ncomes out. But if you want to verify my assertions with a rough estimate right away, you can start with categorizing the 489+ wars listed on Wikipedia and work out the percentages of which wars had a religious or aggressively atheist basis.  That will get you close, although since the list has a European bias it will somewhat overestimate the Christian wars.\nFurthermore, atheists are more of a danger to themselves than either Muslims or Christians, as they are 37 percent more likely to attempt suicide, and, if first-degree relatives are a reliable indicator of religious faith or lack thereof, 230 percent more likely to successfully kill themselves.  (It’s obviously difficult to ask a successful suicide about his religious beliefs.)  It turns out that Catholics are the least likely to off themselves.\nIn light of the empirical evidence, I recommend that atheists stop attempting to defend atheism with increasingly absurd theoretical arguments and instead take a very hard look at why there is such a reliable correlation between their worldview and the commission of various forms of violence.  Correlation is not causation, but when the correlation approaches 90 percent, one cannot simply dismiss the relationship as a coincidental one.\nThis does not mean that all atheists are murderous butchers, but it strongly suggests that the small subset of atheists who pursue political power almost always are.  History suggests that Americans would be wise to keep a skeptical eye on\nthat Pete Stark fellow\n.  He does look rather like he’s slavering after what Christopher Hitchens tells us is the porcine savor of human flesh, doesn’t he.\nUPDATE: due to some of the irrational atheists who believe that the absence of a citation is somehow synonymous with making things up,\nthis is the source\n.  I didn’t bother providing it because I assume that most of you aren’t going to drop $300 just to verify a blog post.  That’s why I suggested going through the 489 wars on Wikipedia to verify the numbers, which is precisely what I did before I picked up the encyclopedia.\nIt seems some of these intelligent, highly educated atheists can’t be bothered to actually do any research or original thinking for themselves; it’s so much easier to simply decide that something is inaccurate on the basis of no information whatsoever.\nIn answer to the question: percent of wars is calculated by the number of wars waged divided by the total 1,763 wars recorded.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-07T22:31:00+00:00"
}