{
  "url": "https://voxday.net/2007/06/12/oh-sweet-darwin/",
  "scraped_at": "2026-01-08T21:44:32.821941",
  "title": "Oh, sweet Darwin!",
  "date_display": "June 12, 2007",
  "date_iso": "2007-06-12T18:23:00+00:00",
  "date_from_url": "2007-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now do keep in mind that this is the guy <a href=\"http://argville.com/2007/06/idiot-of-day-vox-popoli.html\">calling me an idiot</a>:</p><blockquote><p>Oh yes, the “i was just making fun” defense…. And the Dawkins’ argument in God Delusion was just pointing out what Vox admits in this Argville post: that using ‘red state / blue state” arguments is dumb. Dawkins was just mocking the people who use that argument.</p></blockquote><p>While I recognize that there are those who attempt to hide their blunders under an “i was just making fun” defense, I think my track record of making fun of arguments from statewide statistics is <a href=\"http://www.google.com/search?hl=en&amp;q=red+state+sam+harris+vox+day&amp;btnG=Search\">reasonably supported by the evidence</a>.  But there’s no reason Argville should have known that, so we’ll let that slide.</p><p>However, Argville has no similar excuse for his apparent reading-comprehension problem.  Unfortunately for his reputation, Dawkins does not quote the Red State Crime argument in its entirety because he is mocking the individual who uses that argument – that’s my deal – for you see, Dawkins has written of the very book from which that example hails that “Harris never misses, not with a single sentence”.</p><p>In “The God Delusion”, Dawkins describes Harris’s state-based argument thusly: “Such research evidence as there is certainly doesn’t support the common view that religiosity is positively correlated with morality.  Correlational evidence is never conclusive, but the following data, described by Sam Harris in his <em>Letter to a Christian Nation</em>, are nevertheless striking.”</p><p>That’s just <em>vicious</em> mocking, it’s really uncalled for, isn’t it?  So, Argville, based on your definition of an idiot as someone who believes in evidence derived on a state-wide basis, who is the idiot?</p><p>A) Sam Harris<br>B) Richard Dawkins<br>C) The Caucasian Shaft Equation, aka Vox Day</br></br></p></div>",
  "content_text": "Now do keep in mind that this is the guy\ncalling me an idiot\n:\nOh yes, the “i was just making fun” defense…. And the Dawkins’ argument in God Delusion was just pointing out what Vox admits in this Argville post: that using ‘red state / blue state” arguments is dumb. Dawkins was just mocking the people who use that argument.\nWhile I recognize that there are those who attempt to hide their blunders under an “i was just making fun” defense, I think my track record of making fun of arguments from statewide statistics is\nreasonably supported by the evidence\n.  But there’s no reason Argville should have known that, so we’ll let that slide.\nHowever, Argville has no similar excuse for his apparent reading-comprehension problem.  Unfortunately for his reputation, Dawkins does not quote the Red State Crime argument in its entirety because he is mocking the individual who uses that argument – that’s my deal – for you see, Dawkins has written of the very book from which that example hails that “Harris never misses, not with a single sentence”.\nIn “The God Delusion”, Dawkins describes Harris’s state-based argument thusly: “Such research evidence as there is certainly doesn’t support the common view that religiosity is positively correlated with morality.  Correlational evidence is never conclusive, but the following data, described by Sam Harris in his\nLetter to a Christian Nation\n, are nevertheless striking.”\nThat’s just\nvicious\nmocking, it’s really uncalled for, isn’t it?  So, Argville, based on your definition of an idiot as someone who believes in evidence derived on a state-wide basis, who is the idiot?\nA) Sam Harris\nB) Richard Dawkins\nC) The Caucasian Shaft Equation, aka Vox Day",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-12T17:23:00+00:00"
}