{
  "url": "https://voxday.net/2007/06/05/whiny-little-bitc/",
  "scraped_at": "2026-01-08T21:43:41.465918",
  "title": "Whiny little bitch",
  "date_display": "June 5, 2007",
  "date_iso": "2007-06-05T17:59:00+00:00",
  "date_from_url": "2007-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Harris is just a poor, misunderstood soul.  Or he would be if he had one, anyhow:</p><p>Exhibit 1:<br><em>As I mentioned briefly during the live event, <a href=\"http://richarddawkins.net/article,1199,Sam-Harris-Strikes-Back,Sam-Harris-TruthDig\">Hedges misrepresented my views</a> on several topics in his opening remarks. Rather than do a little fact-checking after the debate, he chose to make these distortions indelible in his essay, “I Don’t Believe in Atheists.”</em></br></p><p>Exhibit 2:<br><em>Before I address your central argument, I’d like to point out that <a href=\"http://www.beliefnet.com/story/209/story_20904_1.html\">you continue to misunderstand me</a> in small ways that make me seem (even) more boorish than I am….  While you admit to being “a little evasive” about the details of your Christianity, I think this has been less of an issue than your not addressing many of the points I’ve raised which are (in my view) quite damaging to the case you have made for faith.</em></br></p><p>Exhibit 3:<br><em>I should clear up <a href=\"http://www.jewcy.com/dialogue/monday_why_are_atheists_so_angry_sam_harris\">a couple misconceptions you have about me</a>….  This debate is fast drawing to a close, Dennis, and you have neither addressed my arguments nor presented any substantive arguments of your own…. I trust that attentive readers will notice where you have misconstrued me (or rendered a tortured interpretation of Collins, polling data, etc.).</em></br></p><p>It’s amazing how utterly shameless Harris is.  For example, I looked at the section preceding his claim that Sullivan hasn’t addressed his points; in a meandering rant of 2,000 words, he only asks Sullivan one question that isn’t a rhetorical one he answers himself.  And the question was a minor one that Sullivan was right to ignore.</p><p>You know, if Sam Harris is so often and easily misunderstood by every interlocutor with whom he engages, one would reasonably assume that the fault must lie with him and his inability to express himself in a clear and coherent manner.  Regardless, anyone debating Sam Harris should be sure to arrange for a moderator, since trollish buffoonery is a major element of his debating style.</p></div>",
  "content_text": "Sam Harris is just a poor, misunderstood soul.  Or he would be if he had one, anyhow:\nExhibit 1:\nAs I mentioned briefly during the live event,\nHedges misrepresented my views\non several topics in his opening remarks. Rather than do a little fact-checking after the debate, he chose to make these distortions indelible in his essay, “I Don’t Believe in Atheists.”\nExhibit 2:\nBefore I address your central argument, I’d like to point out that\nyou continue to misunderstand me\nin small ways that make me seem (even) more boorish than I am….  While you admit to being “a little evasive” about the details of your Christianity, I think this has been less of an issue than your not addressing many of the points I’ve raised which are (in my view) quite damaging to the case you have made for faith.\nExhibit 3:\nI should clear up\na couple misconceptions you have about me\n….  This debate is fast drawing to a close, Dennis, and you have neither addressed my arguments nor presented any substantive arguments of your own…. I trust that attentive readers will notice where you have misconstrued me (or rendered a tortured interpretation of Collins, polling data, etc.).\nIt’s amazing how utterly shameless Harris is.  For example, I looked at the section preceding his claim that Sullivan hasn’t addressed his points; in a meandering rant of 2,000 words, he only asks Sullivan one question that isn’t a rhetorical one he answers himself.  And the question was a minor one that Sullivan was right to ignore.\nYou know, if Sam Harris is so often and easily misunderstood by every interlocutor with whom he engages, one would reasonably assume that the fault must lie with him and his inability to express himself in a clear and coherent manner.  Regardless, anyone debating Sam Harris should be sure to arrange for a moderator, since trollish buffoonery is a major element of his debating style.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-05T16:59:00+00:00"
}