{
  "url": "https://voxday.net/2007/06/10/women-are-not-selfis/",
  "scraped_at": "2026-01-08T21:44:16.548936",
  "title": "Women are not selfish",
  "date_display": "June 10, 2007",
  "date_iso": "2007-06-10T14:02:00+00:00",
  "date_from_url": "2007-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"http://pandagon.net/2007/06/09/defending-selfishness/#comments\">they’re all super nice totally smart sex goddesses</a> who only want world peace and universal applause for every expressed opinion and personal decision, however momentary:</p><blockquote><p>The guilt over sex and food that women feel shows how deeply misogynist the notion of female “selfishness” is. Most of the time, the word “selfish” marks a behavior that is indulged for self at the expense of someone else, but when women are accused of selfishness for <s>creating $51 billion in health care costs</s> eating or <s>spreading venereal diseases</s> fucking, the behavior in question doesn’t actually hurt anyone else.</p></blockquote><p>And you can see what a vicious cycle it is.  Men hate women, which makes women feel bad, which makes women eat, which makes them fat, which makes men not want to have sex with them, which makes women feel bad, which makes women eat more… except for those women who deal with the pain of suffering mysogyny by attempting to win men’s approval through promiscuous sex, which makes men want to have sex with more than one of them, which makes women feel bad, which makes women seek male approval through more sex….</p><p>Women are not selfish, you see, they’re just sad and suffering.  Except they’re not and they don’t need your contemptible patriarchal pity, they’re strong independent woman who don’t need a man, just a box of Krispy Kremes and a were-seal romance novel.</p><p>Still, speaking as a proud, pro-sex member of the Patriarchy, I’m delighted to learn that I have feminist sanction for having sex with anyone I want any time I like secure in the knowledge that I am not being selfish or hurting anyone.</p><p>You go, grrl!</p></div>",
  "content_text": "And\nthey’re all super nice totally smart sex goddesses\nwho only want world peace and universal applause for every expressed opinion and personal decision, however momentary:\nThe guilt over sex and food that women feel shows how deeply misogynist the notion of female “selfishness” is. Most of the time, the word “selfish” marks a behavior that is indulged for self at the expense of someone else, but when women are accused of selfishness for\ncreating $51 billion in health care costs\neating or\nspreading venereal diseases\nfucking, the behavior in question doesn’t actually hurt anyone else.\nAnd you can see what a vicious cycle it is.  Men hate women, which makes women feel bad, which makes women eat, which makes them fat, which makes men not want to have sex with them, which makes women feel bad, which makes women eat more… except for those women who deal with the pain of suffering mysogyny by attempting to win men’s approval through promiscuous sex, which makes men want to have sex with more than one of them, which makes women feel bad, which makes women seek male approval through more sex….\nWomen are not selfish, you see, they’re just sad and suffering.  Except they’re not and they don’t need your contemptible patriarchal pity, they’re strong independent woman who don’t need a man, just a box of Krispy Kremes and a were-seal romance novel.\nStill, speaking as a proud, pro-sex member of the Patriarchy, I’m delighted to learn that I have feminist sanction for having sex with anyone I want any time I like secure in the knowledge that I am not being selfish or hurting anyone.\nYou go, grrl!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2007-06-10T13:02:00+00:00"
}