{
  "url": "https://voxday.net/2009/03/19/90-percent-tax-is-back/",
  "scraped_at": "2026-01-08T22:51:12.251223",
  "title": "The 90-percent tax is back!",
  "date_display": "March 19, 2009",
  "date_iso": "2009-03-19T19:13:00+00:00",
  "date_from_url": "2009-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The amazing thing is that the ever-retarded Republicans are actually opposing <a href=\"http://www.breitbart.com/article.php?id=D971964O1&amp;show_article=1\">this eminently reasonable – and extraordinarily popular – action</a>.</p><blockquote><p>U.S. House Votes 328-93 to slap a 90-percent tax rate on bonuses paid on or after 1/1/09 to persons with family incomes above $250,000 if said persons are employees of a company that received more than $5B in federal bailout money in 2008.</p></blockquote><p>I have no problem with this.  No problem at all.  The principle of retroactive taxation was well-established under Clinton, so I’m completely for it.  And any conservative pundit who wants to lament the idea that the government is getting involved in petty matters beyond its ken is a moron, <i>especially</i> if they supported the bailouts in the first place.</p><p>What else did they possibly think was going to happen once the <i>the federal fricking government</i> started picking and choosing who would or would not be permitted to fail?  A political circus?  Of course it’s a political circus, it’s been a political circus since Paulson predicted economic apocalypse if his buddies weren’t given billions of dollars <i>immediately</i>!  What the hell else did anyone expect?  Americans weren’t able to get Congress to pay attention to them when they shouted down the first round of bailouts, now that we’re on round five or so it should come as no surprise that they are starting to feel like putting the heads of bonus bankers on pikes.</p><p>The floodgates are open!  Pump away madly, Federal Reserve.  Jack every taxpayer’s taxes up to 90 percent, Congress, and hand out vast sums to those who pay nothing.  The system broke some time ago, these are just the thrashings of a mortally wounded beast.  I recommend sitting back and watching the fountains of spurting blood as if they were fireworks.</p><p>Print a trillion… oooooh!  Bail out another bank… ahhhh!</p><p>And never forget.  This isn’t just the fault of the idiot liberals.  This is the fault of the conservatives and moderates who were being pragmatic and sacrificing their priniciples because it was a “crisis”, because it was “necessary”.  It’s far too late to raise limited government objections now, Republicans.  You can’t dance with the devil and complain when he steps on your toes.  Please be sure to buckle the straps on your handbasket, the descent may be a bumpy one!</p></div>",
  "content_text": "The amazing thing is that the ever-retarded Republicans are actually opposing\nthis eminently reasonable – and extraordinarily popular – action\n.\nU.S. House Votes 328-93 to slap a 90-percent tax rate on bonuses paid on or after 1/1/09 to persons with family incomes above $250,000 if said persons are employees of a company that received more than $5B in federal bailout money in 2008.\nI have no problem with this.  No problem at all.  The principle of retroactive taxation was well-established under Clinton, so I’m completely for it.  And any conservative pundit who wants to lament the idea that the government is getting involved in petty matters beyond its ken is a moron,\nespecially\nif they supported the bailouts in the first place.\nWhat else did they possibly think was going to happen once the\nthe federal fricking government\nstarted picking and choosing who would or would not be permitted to fail?  A political circus?  Of course it’s a political circus, it’s been a political circus since Paulson predicted economic apocalypse if his buddies weren’t given billions of dollars\nimmediately\n!  What the hell else did anyone expect?  Americans weren’t able to get Congress to pay attention to them when they shouted down the first round of bailouts, now that we’re on round five or so it should come as no surprise that they are starting to feel like putting the heads of bonus bankers on pikes.\nThe floodgates are open!  Pump away madly, Federal Reserve.  Jack every taxpayer’s taxes up to 90 percent, Congress, and hand out vast sums to those who pay nothing.  The system broke some time ago, these are just the thrashings of a mortally wounded beast.  I recommend sitting back and watching the fountains of spurting blood as if they were fireworks.\nPrint a trillion… oooooh!  Bail out another bank… ahhhh!\nAnd never forget.  This isn’t just the fault of the idiot liberals.  This is the fault of the conservatives and moderates who were being pragmatic and sacrificing their priniciples because it was a “crisis”, because it was “necessary”.  It’s far too late to raise limited government objections now, Republicans.  You can’t dance with the devil and complain when he steps on your toes.  Please be sure to buckle the straps on your handbasket, the descent may be a bumpy one!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-19T19:13:00+00:00"
}