{
  "url": "https://voxday.net/2009/03/22/a-word/",
  "scraped_at": "2026-01-08T22:51:25.172310",
  "title": "The A word",
  "date_display": "March 22, 2009",
  "date_iso": "2009-03-22T20:30:00+00:00",
  "date_from_url": "2009-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://msnbcmedia2.msn.com/j/MSNBC/Components/Photo/_new/090322-oakland-hmed-3p.h2.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" src=\"http://msnbcmedia2.msn.com/j/MSNBC/Components/Photo/_new/090322-oakland-hmed-3p.h2.jpg\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 366px; height: 275px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://msnbcmedia2.msn.com/j/MSNBC/Components/Photo/_new/090322-oakland-hmed-3p.h2.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 366px; height: 275px;\"/></a><br>I found <a href=\"http://apnews.myway.com/article/20090322/D9731VAO0.html\">this article to be interesting</a> for three reasons.  Updated for further clarification and edification:</br></p><blockquote><p>A police officer was battling for his life and three more were dead after a parolee with an “extensive criminal history” opened fire at a routine traffic stop and hours later gunned down members of a SWAT team searching for him.</p></blockquote><p>First, notice how the parolee was armed with an “assault” rifle, whatever that’s supposed to mean.  I somehow doubt he was armed with an M-16 on full-auto.  Second, the SWAT teams aren’t anywhere nearly as invulnerable as they’d like Americans to believe they are; it’s a little tougher taking down an armed criminal who knows you’re after him than killing an elderly woman in her sleep during a no-knock raid in the middle of the night.</p><p>And third, there simply aren’t many Americans who have any sympathy for officers getting killed on the job any more.  The police have made it very clear over the years that they’re not on my side, your side, or anyone’s side but the politicians.  It was just over 20 years ago when NWA first declared “Fuck Tha Police” and now Americans are openly jeering dead police officers.  As the picture above indicates, the vast outpouring of public grief over the recently deceased doesn’t exactly rival <a href=\"http://www.theamblerfamily.com/Diana%20Flowers%20Web.jpg\">the death of Diana</a>.</p><p>The police have two choices.  They can do what they’ve been doing for the last two decades, react angrily, and continue to become more and more militarized and more and more hated by the American people.  That’s how the police in the Third World roll, or at least, how they did it before the drug cartels handed them their heads. <a href=\"http://www.laht.com/article.asp?CategoryId=14091&amp;ArticleId=325996\">Literally</a>, in some cases.  Or, they can listen to what more and more Americans have been trying to tell them for 20 years and go back to keeping the peace rather than trying to enforce the law.  The one thing every policeman has to understand is that hiding their actions behind “the Law” is not and has not ever been acceptable, especially not when law and lawmakers alike <a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=92277\">have become increasingly corrupt</a>.  That excuse didn’t absolve the SS-TV and it won’t absolve American police.  The old aphorism is an apt one; you can’t have a police state without police.</p><p>It’s pretty simple.  If we’re not robbing or murdering anyone, leave us the fuck alone and stay the hell out of our houses, cars, and lives!  That’s the American way.  And if you can’t manage to do that, then yeah, we probably will smile with a certain amount of grim satisfaction when another member of the Badge Mafia bites the dust.</p><p>I understand that most police are simply “doing their job”.  But what few policemen understand is that how their job is defined for them by their superiors has radically changed over the last fifty years and has drastically altered the way in which they are regarded by those who would have been considered, fifty years ago, a law-abiding populace.</p></div>",
  "content_text": "I found\nthis article to be interesting\nfor three reasons.  Updated for further clarification and edification:\nA police officer was battling for his life and three more were dead after a parolee with an “extensive criminal history” opened fire at a routine traffic stop and hours later gunned down members of a SWAT team searching for him.\nFirst, notice how the parolee was armed with an “assault” rifle, whatever that’s supposed to mean.  I somehow doubt he was armed with an M-16 on full-auto.  Second, the SWAT teams aren’t anywhere nearly as invulnerable as they’d like Americans to believe they are; it’s a little tougher taking down an armed criminal who knows you’re after him than killing an elderly woman in her sleep during a no-knock raid in the middle of the night.\nAnd third, there simply aren’t many Americans who have any sympathy for officers getting killed on the job any more.  The police have made it very clear over the years that they’re not on my side, your side, or anyone’s side but the politicians.  It was just over 20 years ago when NWA first declared “Fuck Tha Police” and now Americans are openly jeering dead police officers.  As the picture above indicates, the vast outpouring of public grief over the recently deceased doesn’t exactly rival\nthe death of Diana\n.\nThe police have two choices.  They can do what they’ve been doing for the last two decades, react angrily, and continue to become more and more militarized and more and more hated by the American people.  That’s how the police in the Third World roll, or at least, how they did it before the drug cartels handed them their heads.\nLiterally\n, in some cases.  Or, they can listen to what more and more Americans have been trying to tell them for 20 years and go back to keeping the peace rather than trying to enforce the law.  The one thing every policeman has to understand is that hiding their actions behind “the Law” is not and has not ever been acceptable, especially not when law and lawmakers alike\nhave become increasingly corrupt\n.  That excuse didn’t absolve the SS-TV and it won’t absolve American police.  The old aphorism is an apt one; you can’t have a police state without police.\nIt’s pretty simple.  If we’re not robbing or murdering anyone, leave us the fuck alone and stay the hell out of our houses, cars, and lives!  That’s the American way.  And if you can’t manage to do that, then yeah, we probably will smile with a certain amount of grim satisfaction when another member of the Badge Mafia bites the dust.\nI understand that most police are simply “doing their job”.  But what few policemen understand is that how their job is defined for them by their superiors has radically changed over the last fifty years and has drastically altered the way in which they are regarded by those who would have been considered, fifty years ago, a law-abiding populace.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-22T20:30:00+00:00"
}