{
  "url": "https://voxday.net/2009/03/01/battlestar-castratica/",
  "scraped_at": "2026-01-08T22:49:29.953816",
  "title": "Battlestar Castratica",
  "date_display": "March 1, 2009",
  "date_iso": "2009-03-01T21:30:00+00:00",
  "date_from_url": "2009-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Starbuck <a href=\"http://bighollywood.breitbart.com/dbenedict/2009/01/19/lt-starbuck-lost-in-castration/\">goes off</a> on the new “Battlestar Galactica” in a 2004 essay that looks increasingly on target as the current series fades away.  Also, a spoiler alert may or may not be necessary here, as I don’t watch the show and so have no idea what has or has not been revealed:</p><blockquote><p>“Re-imagining”, they call it. “Un-imagining” is more accurate. To take what once was and twist it into what never was intended. So that a television show based on hope, spiritual faith and family is un-imagined and regurgitated as a show of despair, sexual violence and family dysfunction. To better reflect the times of ambiguous morality in which we live, one would assume. A show in which the aliens (Cylons) are justified in their desire to destroy human civilization, one would assume. Indeed, let us not say who the good guys are and who the bad are. That is being “judgmental,” taking sides, and that kind of (simplistic) thinking went out with Margaret Thatcher and Ronald Reagan and Kathryn Hepburn and John Wayne and, well, the original “Battlestar Galactica.”</p><p>In the bleak and miserable “re-imagined” world of “Battlestar Galactica,” things are never that simple. Maybe the Cylons are not evil and alien but in fact enlightened and evolved? Let us not judge them so harshly. Maybe it is they who deserve to live and Adama and his human ilk who deserve to die? And what a way to go! For the re-imagined terrorists (Cylons) are not mechanical robots void of soul, of sexuality, but rather humanoid six foot tall former lingerie models who f**k you to death. (Poor old Starbuck, you were imagined too early. Think of the fun you could have had ‘fighting’ with these thong-clad aliens!) In the spirit of such soft-core, sci-fi porn I think a more re-imaginative title would have been “F**cked by A Cylon.” (Apologies to “Touched by an Angel.”)</p><p>One thing is certain. In the new un-imagined, re-imagined world of “Battlestar Galactica” everything is female driven. The male characters, from Adama on down, are confused, weak and wracked with indecision, while the female characters are decisive, bold, angry as hell, puffing cigars (gasp!) and not about to take it any more….</p><p>They will tell you it is (still) about story and character, but all it is really about is efficiency. About the Formula. Because Harvard Business School Technocrats run Hollywood and what Technocrats know is what must be removed from all business is Risk. And I tell you, life, real life, is all about risk. I tell you that without risk you have no creativity, no art. I tell you that without risk you have Remakes.</p></blockquote><p>Remakes… no thanks.  I quite liked the cheesy original show, but only watched about three minutes of the “re-imagined” version; that was all it took for me to know I had zero interest in it.  In that three minutes, the blonde Cylon chick murdered an infant in its stroller, then had sex with someone as her metal backbone glowed red.  First, not only was the baby-killing a totally egregious attempt to “shock”, it was amazingly stupid for a being supposed to be more or less undercover.  Second, the underlying premise was simply too silly for words; how hard can it be to hunt down Cylons when all you have to do is have sex with them and see if their backbones glow?  Or, you know, slap a magnet on their back and see if it sticks.  Whatever modicum of vague interest remained after that was destroyed when I heard that Starbuck had been given a sex change.</p><p>I always find it amusing when people talk about how different and intelligent shows like Battlestar Galactica and 24 are.  They’re not very different, they’re not at all intelligent, and they’re every bit as predictable as the average 70’s sitcom.  The only people who can seriously try to argue that they’re thought-provoking are the sort of people who find John Grisham novels to be a little too highbrow; television is a medium for the lowest-common denominator, after all.  But of all the arguments in favor of modern television shows, it’s the “realism” argument that is the most ridiculous.  Until one of the never-ending stream of cop shows dedicates itself to policemen who never, ever fire their guns and spend as much time filling out paperwork as they do on patrol, there isn’t even a pretense at realism.</p><p>UPDATE – After reading the comments, apparently it’s even worse than I thought: <i>Two seasons ago, I would have told Mr. Benedict he’s crazy. I fell hook line and sinker into the series. Upon further review, he hits the nail on the head. The series is drowning in its own moral ambiguity and ardent political correctness. Once the shock and awe story telling became the norm, the show was exposed. I’m all for strong women, but I also don’t want my intelligence insulted. Watching Kara Thrace knock out guys in the boxing ring and stand toe-to-toe with men twice her size, I realized its nothing but PC schlock.</i></p><p>You know, given that a woman has never been known to knock out a man in several thousand years of pugilistic combat, the boxing ring should have been a dead giveaway that “she” was a robot.  Of course, the viewers of this kind of show wouldn’t have picked up on that because they’ve been indoctrinated into thinking that sort of thing is entirely possible.</p><p>UPDATE II – I haven’t read it quite some time, but it’s rather comforting to know that the mental midgets at Pandagon haven’t changed at all.  There’s nothing that shows off your stunning female intellect like <a href=\"http://pandagon.net/index.php/site/comments/why_advertise_it_when_youre_such_a_weenie/\">failing to grasp an obvious metaphor</a>.  And the absurd tuff-girl-beats-up-men theme doesn’t bother me any more than do flying unicorns, it’s just demonstrably bad and unrealistic writing. <i>Especially</i> if she is a robot, in which case you have to ask why none of the men boxing with her happened to notice that she can do things no woman in the entire history of the human race has ever been able to do… at a time when killer robots trying to kill them all are infiltrating.</p></div>",
  "content_text": "Starbuck\ngoes off\non the new “Battlestar Galactica” in a 2004 essay that looks increasingly on target as the current series fades away.  Also, a spoiler alert may or may not be necessary here, as I don’t watch the show and so have no idea what has or has not been revealed:\n“Re-imagining”, they call it. “Un-imagining” is more accurate. To take what once was and twist it into what never was intended. So that a television show based on hope, spiritual faith and family is un-imagined and regurgitated as a show of despair, sexual violence and family dysfunction. To better reflect the times of ambiguous morality in which we live, one would assume. A show in which the aliens (Cylons) are justified in their desire to destroy human civilization, one would assume. Indeed, let us not say who the good guys are and who the bad are. That is being “judgmental,” taking sides, and that kind of (simplistic) thinking went out with Margaret Thatcher and Ronald Reagan and Kathryn Hepburn and John Wayne and, well, the original “Battlestar Galactica.”\nIn the bleak and miserable “re-imagined” world of “Battlestar Galactica,” things are never that simple. Maybe the Cylons are not evil and alien but in fact enlightened and evolved? Let us not judge them so harshly. Maybe it is they who deserve to live and Adama and his human ilk who deserve to die? And what a way to go! For the re-imagined terrorists (Cylons) are not mechanical robots void of soul, of sexuality, but rather humanoid six foot tall former lingerie models who f**k you to death. (Poor old Starbuck, you were imagined too early. Think of the fun you could have had ‘fighting’ with these thong-clad aliens!) In the spirit of such soft-core, sci-fi porn I think a more re-imaginative title would have been “F**cked by A Cylon.” (Apologies to “Touched by an Angel.”)\nOne thing is certain. In the new un-imagined, re-imagined world of “Battlestar Galactica” everything is female driven. The male characters, from Adama on down, are confused, weak and wracked with indecision, while the female characters are decisive, bold, angry as hell, puffing cigars (gasp!) and not about to take it any more….\nThey will tell you it is (still) about story and character, but all it is really about is efficiency. About the Formula. Because Harvard Business School Technocrats run Hollywood and what Technocrats know is what must be removed from all business is Risk. And I tell you, life, real life, is all about risk. I tell you that without risk you have no creativity, no art. I tell you that without risk you have Remakes.\nRemakes… no thanks.  I quite liked the cheesy original show, but only watched about three minutes of the “re-imagined” version; that was all it took for me to know I had zero interest in it.  In that three minutes, the blonde Cylon chick murdered an infant in its stroller, then had sex with someone as her metal backbone glowed red.  First, not only was the baby-killing a totally egregious attempt to “shock”, it was amazingly stupid for a being supposed to be more or less undercover.  Second, the underlying premise was simply too silly for words; how hard can it be to hunt down Cylons when all you have to do is have sex with them and see if their backbones glow?  Or, you know, slap a magnet on their back and see if it sticks.  Whatever modicum of vague interest remained after that was destroyed when I heard that Starbuck had been given a sex change.\nI always find it amusing when people talk about how different and intelligent shows like Battlestar Galactica and 24 are.  They’re not very different, they’re not at all intelligent, and they’re every bit as predictable as the average 70’s sitcom.  The only people who can seriously try to argue that they’re thought-provoking are the sort of people who find John Grisham novels to be a little too highbrow; television is a medium for the lowest-common denominator, after all.  But of all the arguments in favor of modern television shows, it’s the “realism” argument that is the most ridiculous.  Until one of the never-ending stream of cop shows dedicates itself to policemen who never, ever fire their guns and spend as much time filling out paperwork as they do on patrol, there isn’t even a pretense at realism.\nUPDATE – After reading the comments, apparently it’s even worse than I thought:\nTwo seasons ago, I would have told Mr. Benedict he’s crazy. I fell hook line and sinker into the series. Upon further review, he hits the nail on the head. The series is drowning in its own moral ambiguity and ardent political correctness. Once the shock and awe story telling became the norm, the show was exposed. I’m all for strong women, but I also don’t want my intelligence insulted. Watching Kara Thrace knock out guys in the boxing ring and stand toe-to-toe with men twice her size, I realized its nothing but PC schlock.\nYou know, given that a woman has never been known to knock out a man in several thousand years of pugilistic combat, the boxing ring should have been a dead giveaway that “she” was a robot.  Of course, the viewers of this kind of show wouldn’t have picked up on that because they’ve been indoctrinated into thinking that sort of thing is entirely possible.\nUPDATE II – I haven’t read it quite some time, but it’s rather comforting to know that the mental midgets at Pandagon haven’t changed at all.  There’s nothing that shows off your stunning female intellect like\nfailing to grasp an obvious metaphor\n.  And the absurd tuff-girl-beats-up-men theme doesn’t bother me any more than do flying unicorns, it’s just demonstrably bad and unrealistic writing.\nEspecially\nif she is a robot, in which case you have to ask why none of the men boxing with her happened to notice that she can do things no woman in the entire history of the human race has ever been able to do… at a time when killer robots trying to kill them all are infiltrating.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-01T21:30:00+00:00"
}