{
  "url": "https://voxday.net/2009/03/12/charles-murray-on-european-mode/",
  "scraped_at": "2026-01-08T22:50:35.676568",
  "title": "Charles Murray on the future",
  "date_display": "March 12, 2009",
  "date_iso": "2009-03-12T21:46:00+00:00",
  "date_from_url": "2009-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An <a href=\"http://www.aei.org/publications/pubID.29531/pub_detail.asp\">interesting speech</a>, worth perusing:</p><blockquote><p>Seen in this light, the goal of social policy is to ensure that those institutions are robust and vital. And that’s what’s wrong with the European model. It doesn’t do that. It enfeebles every single one of them….</p><p>The problem is this: Every time the government takes some of the trouble out of performing the functions of family, community, vocation, and faith, it also strips those institutions of some of their vitality–it drains some of the life from them. It’s inevitable. Families are not vital because the day-to-day tasks of raising children and being a good spouse are so much fun, but because the family has responsibility for doing important things that won’t get done unless the family does them. Communities are not vital because it’s so much fun to respond to our neighbors’ needs, but because the community has the responsibility for doing important things that won’t get done unless the community does them. Once that imperative has been met–family and community really do have the action–then an elaborate web of social norms, expectations, rewards, and punishments evolves over time that supports families and communities in performing their functions. When the government says it will take some of the trouble out of doing the things that families and communities evolved to do, it inevitably takes some of the action away from families and communities, and the web frays, and eventually disintegrates.</p></blockquote><p>Being a longtime resident of Europe, I think the one thing that Murray misses is that, like most American intellectuals, the only Europe he has ever seen are the urban centers. That’s not to say that his impressions are incorrect, only that they are incomplete.  But one can no more hope to get an accurate sense of Switzerland from the twenty-somethings of downtown Zurich than one can expect to get an accurate impression of America in the nightclubs of Manhattan.</p><p>Still, this is a very minor quibble, and some of his statements will seem strikingly familiar to readers of this blog: <i>“Within a decade, no one will try to defend the equality premise….  The second tendency of the new findings of biology will be to show that the New Man premise is nonsense. Human nature tightly constrains what is politically or culturally possible.”</i></p></div>",
  "content_text": "An\ninteresting speech\n, worth perusing:\nSeen in this light, the goal of social policy is to ensure that those institutions are robust and vital. And that’s what’s wrong with the European model. It doesn’t do that. It enfeebles every single one of them….\nThe problem is this: Every time the government takes some of the trouble out of performing the functions of family, community, vocation, and faith, it also strips those institutions of some of their vitality–it drains some of the life from them. It’s inevitable. Families are not vital because the day-to-day tasks of raising children and being a good spouse are so much fun, but because the family has responsibility for doing important things that won’t get done unless the family does them. Communities are not vital because it’s so much fun to respond to our neighbors’ needs, but because the community has the responsibility for doing important things that won’t get done unless the community does them. Once that imperative has been met–family and community really do have the action–then an elaborate web of social norms, expectations, rewards, and punishments evolves over time that supports families and communities in performing their functions. When the government says it will take some of the trouble out of doing the things that families and communities evolved to do, it inevitably takes some of the action away from families and communities, and the web frays, and eventually disintegrates.\nBeing a longtime resident of Europe, I think the one thing that Murray misses is that, like most American intellectuals, the only Europe he has ever seen are the urban centers. That’s not to say that his impressions are incorrect, only that they are incomplete.  But one can no more hope to get an accurate sense of Switzerland from the twenty-somethings of downtown Zurich than one can expect to get an accurate impression of America in the nightclubs of Manhattan.\nStill, this is a very minor quibble, and some of his statements will seem strikingly familiar to readers of this blog:\n“Within a decade, no one will try to defend the equality premise….  The second tendency of the new findings of biology will be to show that the New Man premise is nonsense. Human nature tightly constrains what is politically or culturally possible.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-12T21:46:00+00:00"
}