{
  "url": "https://voxday.net/2009/03/04/cracks-in-eu/",
  "scraped_at": "2026-01-08T22:49:46.208800",
  "title": "Cracks in the EU",
  "date_display": "March 4, 2009",
  "date_iso": "2009-03-04T09:59:00+00:00",
  "date_from_url": "2009-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The <a href=\"http://www.iht.com/articles/2009/03/01/europe/union.php\">collapse of the Eurofascist dream</a> would be a very good thing indeed:</p><blockquote><p><b>Economic crisis threatens the idea of one Europe</b><br>The leaders of the European Union gathered Sunday in Brussels for an emergency summit meeting designed to tamp down the centrifugal forces unleashed by the global economic crisis that threaten to spin the bloc – and its single currency – apart.</br></p></blockquote><p>Score one for the socionomists, who have been saying for years that globalization and European unification are merely artifacts of the economic boom.  No wonder the globalists are so desperate to revive the corpse of their debt-inflation boom.  There may be opportunities for the ongoing economic crises to further their campaign of One Bureaucracy to rule them all, but the crises have also quite clearly upset the notion of an easy, gentle decline into global fascism.</p><p>Simon Heffer of the Telegraph is <a href=\"http://www.telegraph.co.uk/comment/columnists/simonheffer/4934431/Its-the-Europhiles-versus-reality-and-reality-is-going-to-win.html\">of like mind</a>:</p><blockquote><p>The truth is that Europe has never had so dire a crisis since the Treaty of Rome was signed in 1957. Sauve qui peut is the watchword. President Sarkozy has entered a familiarly Gaullist phase, ignoring EU competition policy and pushing through a €6 billion support for the French car industry; other manufacturers, notably in eastern Europe, have protested to no avail.  Mr Sarkozy’s assertion that he is not a protectionist is purely rhetorical. When a German minister says that “now is not the time” to let workers from the EU’s former eastern bloc countries have full immigration rights in Germany, he is saying the same thing. Gordon Brown may not be able to ensure British jobs for British workers, but the Germans are determined to keep their jobs for German ones.</p><p>This bending of the rules – or rather this wholesale disregard of them – is the surest sign of a currency, and quite possibly an empire, in terminal decline.</p></blockquote><p>I find it very difficult to imagine that the Eurofascists are going to find any utility in forcing a second Irish vote on the <s>European Constitution</s>Lisbon Treaty.  In the current environment, one would expect the Irish to vote even more vociferously against surrendering to the bureaucrats in Brussels.  And I, for one, would be delighted to see a return to the lira, as the Euro has made <i>la dolce vita</i> significantly more expensive.  80 percent of Greeks want to return to the drachma, and I don’t think that Italian sentiment is far south of that.</p><p>UPDATE – It’s increasingly clear that the financial crises are unlikely to improve the European public’s <a href=\"http://blogs.telegraph.co.uk/daniel_hannan/blog/2009/03/04/iceland_turns_against_the_eu\">opinion of the European Union</a>: <i>“My friend Hjörtur in Reykjavík sends me a couple of opinion polls, suggesting that there is now a majority against even applying for EU membership. Four months ago, at the height of the financial crisis, 80 per cent of Icelanders were for joining the EU and the euro. Now, that number has halved.”</i></p></div>",
  "content_text": "The\ncollapse of the Eurofascist dream\nwould be a very good thing indeed:\nEconomic crisis threatens the idea of one Europe\nThe leaders of the European Union gathered Sunday in Brussels for an emergency summit meeting designed to tamp down the centrifugal forces unleashed by the global economic crisis that threaten to spin the bloc – and its single currency – apart.\nScore one for the socionomists, who have been saying for years that globalization and European unification are merely artifacts of the economic boom.  No wonder the globalists are so desperate to revive the corpse of their debt-inflation boom.  There may be opportunities for the ongoing economic crises to further their campaign of One Bureaucracy to rule them all, but the crises have also quite clearly upset the notion of an easy, gentle decline into global fascism.\nSimon Heffer of the Telegraph is\nof like mind\n:\nThe truth is that Europe has never had so dire a crisis since the Treaty of Rome was signed in 1957. Sauve qui peut is the watchword. President Sarkozy has entered a familiarly Gaullist phase, ignoring EU competition policy and pushing through a €6 billion support for the French car industry; other manufacturers, notably in eastern Europe, have protested to no avail.  Mr Sarkozy’s assertion that he is not a protectionist is purely rhetorical. When a German minister says that “now is not the time” to let workers from the EU’s former eastern bloc countries have full immigration rights in Germany, he is saying the same thing. Gordon Brown may not be able to ensure British jobs for British workers, but the Germans are determined to keep their jobs for German ones.\nThis bending of the rules – or rather this wholesale disregard of them – is the surest sign of a currency, and quite possibly an empire, in terminal decline.\nI find it very difficult to imagine that the Eurofascists are going to find any utility in forcing a second Irish vote on the\nEuropean Constitution\nLisbon Treaty.  In the current environment, one would expect the Irish to vote even more vociferously against surrendering to the bureaucrats in Brussels.  And I, for one, would be delighted to see a return to the lira, as the Euro has made\nla dolce vita\nsignificantly more expensive.  80 percent of Greeks want to return to the drachma, and I don’t think that Italian sentiment is far south of that.\nUPDATE – It’s increasingly clear that the financial crises are unlikely to improve the European public’s\nopinion of the European Union\n:\n“My friend Hjörtur in Reykjavík sends me a couple of opinion polls, suggesting that there is now a majority against even applying for EU membership. Four months ago, at the height of the financial crisis, 80 per cent of Icelanders were for joining the EU and the euro. Now, that number has halved.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-04T09:59:00+00:00"
}