{
  "url": "https://voxday.net/2009/03/29/dogs-are-property-not-people/",
  "scraped_at": "2026-01-08T22:52:00.783310",
  "title": "Dogs are property, not people",
  "date_display": "March 29, 2009",
  "date_iso": "2009-03-29T16:08:00+00:00",
  "date_from_url": "2009-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Florio demonstrates what happens <a href=\"http://www.profootballtalk.com/2009/03/28/lovie-smith-supports-vicks-return/\">when mindless emotion replaces reason</a>:</p><blockquote><p>Mike Vick didn’t make a mistake.  He engaged in a lifestyle for a period of years and changed that lifestyle only because he got caught.  A “mistake” is adhering so literally to the commands of a navigation system that you drive your car into a lake.  Vick lived a life that revolved around an abomination — raising dogs for the purposes of pitting them against each other for sport and for money, and killing the dogs that weren’t deemed fit to die while fighting other dogs.</p><p>He felt so strongly about this lifestyle that he bought a house and surrounding land at which the lifestyle unfolded.</p><p>Though some readers have suggested that the conduct of men like Leonard Little (who killed a woman while driving drunk) and Donte’ Stallworth (who might have been drunk while driving a car that killed a man) is more despicable than Vick’s behavior, we disagree.  Little (and possibly Stallworth) engaged in criminally reckless actions.  They didn’t intend to harm anyone.  Little’s crime (and possibly Stallworth’s) was to drink to excess under circumstances that did not prevent him from exercising impaired judgment by getting behind the wheel of a 2,000-pound sculpted block of rolling steel.</p><p>Vick intentionally, deliberately, and soberly embarked on a hobby that violated multiple federal and state laws, and that was premised on the cold-blooded torture and killing of dogs.  And then he lied about his conduct, to anyone who wanted to know the truth.  He even tried to deceive about the killing of underperforming dogs after pleading guilty, and while strapped to a polygraph.</p><p>If it were up to us, Vick wouldn’t play for the Bears or any other NFL team.  Ever.</p></blockquote><p>I have never been a fan of Michael Vick.  Long before news of his dog-fighting pursuit broke, I was openly critical of the idea that he was a competent quarterback, much less a superstar in the process of reinventing the position as many sportswriting experts had it.  So, I’m not inclined to defend him.  I am also a life-long dog enthusiast.  I grew up with dogs in the house, I have had my viszla for nearly 15 years now, and one reason that Spacebunny and I hit it off right away was because we are both dog people.  I don’t like to see dogs mistreated or even left alone; there is a sweet little pit bull down the street who gets left outside for long periods of time and I always make sure to give her a treat and some ear scratches when I’m walking around the neighborhood.</p><p>Nevertheless, dogs are property, not people, and how a man treats his property is his concern, not mine, so long as he isn’t doing it in a manner that will offend the neighbors or disturb the community.  Vick went well out of his way to avoid disturbing anyone else, and while his treatment of unwanted dogs that would not fight is both savage and disturbing, it’s little different in the end than the fate of most dogs at the humane society or destined for the table in Asia.  The reality is that dog-fighting laws exist primarily because Americans love dogs; there would be absolutely no outrage whatsoever if Vick had been running a cockroach-fighting ring.  And to call dog-fighting barbaric, as some have, is deeply ironic, given that one of the greatest civilizations in the history of Man is known, among other things, for its massive gladitorial games pitting animal against animal and man against man.  Clinical slaughter may be more fastidious and less offensive to the modern psyche than impromptu killing, but it is not morally distinct.  Indirection is not absolution, and we do not praise the National Socialists because they killed impersonally, with bureaucratic efficiency, and folded the clothes neatly afterwards.</p><p>Regardless of how one feels about such things, emotions are neither a wise nor reasonable basis for law.  You may feel that Vick is a monster in human form.  You may even, for all I know, be correct.  But that doesn’t make the law a good one, it merely means it is in accordance with your feelings.  If one form of property is violate, then <i>all forms of property</i> are violate, and history shows that an absence of property rights is not a formula for societal wealth or stability.</p><p>All that being said, dog-related laws clearly exist regardless of what one might think of them, and Vick just as clearly violated them.  I take no exception to his conviction or his punishment.  But the legal considerations lead to another problem here.  Grandstanding individuals like Florio wanted to stand on the process of the law in seeing Vick punished, which is reasonable, and abandon it now that Vick has paid an extremely substantial cost, which is not.  To attempt to prevent the man from working for a living is outrageous, and I’m sure Vick’s debtors, who committed no anti-canine crimes, don’t appreciate Florio’s efforts to prevent their repayment.</p><p>The NFL should not be subject to behavioral standards outside of those upheld by the individual team owners.  Florio would be outraged if the NFL Commissioner banned players known to have had premarital sex, drink alcohol, or attend church; the only difference between these hypothetical bans and the retroactive ban he is advocating is the specific moral standard applied.  And his expression of the idea that purposefully killing dogs is worse than accidentally killing men and women only goes to show how substituting emotion for reason rapidly leads one into untenable positions.</p><p>Michael Vick is a thug.  I would not want him to dog-sit my dogs… I wouldn’t want him quarterbacking my team, for that matter.  But, if there is an NFL coach wanting to roll the dice with a strong-armed quarterback who is less accurate than a Keynesian economist analyzing the latest stimulus plan, he should be free to do so.</p></div>",
  "content_text": "Mike Florio demonstrates what happens\nwhen mindless emotion replaces reason\n:\nMike Vick didn’t make a mistake.  He engaged in a lifestyle for a period of years and changed that lifestyle only because he got caught.  A “mistake” is adhering so literally to the commands of a navigation system that you drive your car into a lake.  Vick lived a life that revolved around an abomination — raising dogs for the purposes of pitting them against each other for sport and for money, and killing the dogs that weren’t deemed fit to die while fighting other dogs.\nHe felt so strongly about this lifestyle that he bought a house and surrounding land at which the lifestyle unfolded.\nThough some readers have suggested that the conduct of men like Leonard Little (who killed a woman while driving drunk) and Donte’ Stallworth (who might have been drunk while driving a car that killed a man) is more despicable than Vick’s behavior, we disagree.  Little (and possibly Stallworth) engaged in criminally reckless actions.  They didn’t intend to harm anyone.  Little’s crime (and possibly Stallworth’s) was to drink to excess under circumstances that did not prevent him from exercising impaired judgment by getting behind the wheel of a 2,000-pound sculpted block of rolling steel.\nVick intentionally, deliberately, and soberly embarked on a hobby that violated multiple federal and state laws, and that was premised on the cold-blooded torture and killing of dogs.  And then he lied about his conduct, to anyone who wanted to know the truth.  He even tried to deceive about the killing of underperforming dogs after pleading guilty, and while strapped to a polygraph.\nIf it were up to us, Vick wouldn’t play for the Bears or any other NFL team.  Ever.\nI have never been a fan of Michael Vick.  Long before news of his dog-fighting pursuit broke, I was openly critical of the idea that he was a competent quarterback, much less a superstar in the process of reinventing the position as many sportswriting experts had it.  So, I’m not inclined to defend him.  I am also a life-long dog enthusiast.  I grew up with dogs in the house, I have had my viszla for nearly 15 years now, and one reason that Spacebunny and I hit it off right away was because we are both dog people.  I don’t like to see dogs mistreated or even left alone; there is a sweet little pit bull down the street who gets left outside for long periods of time and I always make sure to give her a treat and some ear scratches when I’m walking around the neighborhood.\nNevertheless, dogs are property, not people, and how a man treats his property is his concern, not mine, so long as he isn’t doing it in a manner that will offend the neighbors or disturb the community.  Vick went well out of his way to avoid disturbing anyone else, and while his treatment of unwanted dogs that would not fight is both savage and disturbing, it’s little different in the end than the fate of most dogs at the humane society or destined for the table in Asia.  The reality is that dog-fighting laws exist primarily because Americans love dogs; there would be absolutely no outrage whatsoever if Vick had been running a cockroach-fighting ring.  And to call dog-fighting barbaric, as some have, is deeply ironic, given that one of the greatest civilizations in the history of Man is known, among other things, for its massive gladitorial games pitting animal against animal and man against man.  Clinical slaughter may be more fastidious and less offensive to the modern psyche than impromptu killing, but it is not morally distinct.  Indirection is not absolution, and we do not praise the National Socialists because they killed impersonally, with bureaucratic efficiency, and folded the clothes neatly afterwards.\nRegardless of how one feels about such things, emotions are neither a wise nor reasonable basis for law.  You may feel that Vick is a monster in human form.  You may even, for all I know, be correct.  But that doesn’t make the law a good one, it merely means it is in accordance with your feelings.  If one form of property is violate, then\nall forms of property\nare violate, and history shows that an absence of property rights is not a formula for societal wealth or stability.\nAll that being said, dog-related laws clearly exist regardless of what one might think of them, and Vick just as clearly violated them.  I take no exception to his conviction or his punishment.  But the legal considerations lead to another problem here.  Grandstanding individuals like Florio wanted to stand on the process of the law in seeing Vick punished, which is reasonable, and abandon it now that Vick has paid an extremely substantial cost, which is not.  To attempt to prevent the man from working for a living is outrageous, and I’m sure Vick’s debtors, who committed no anti-canine crimes, don’t appreciate Florio’s efforts to prevent their repayment.\nThe NFL should not be subject to behavioral standards outside of those upheld by the individual team owners.  Florio would be outraged if the NFL Commissioner banned players known to have had premarital sex, drink alcohol, or attend church; the only difference between these hypothetical bans and the retroactive ban he is advocating is the specific moral standard applied.  And his expression of the idea that purposefully killing dogs is worse than accidentally killing men and women only goes to show how substituting emotion for reason rapidly leads one into untenable positions.\nMichael Vick is a thug.  I would not want him to dog-sit my dogs… I wouldn’t want him quarterbacking my team, for that matter.  But, if there is an NFL coach wanting to roll the dice with a strong-armed quarterback who is less accurate than a Keynesian economist analyzing the latest stimulus plan, he should be free to do so.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-29T15:08:00+00:00"
}