{
  "url": "https://voxday.net/2009/03/05/faux-literate-liars/",
  "scraped_at": "2026-01-08T22:49:53.640695",
  "title": "Faux-literate liars",
  "date_display": "March 5, 2009",
  "date_iso": "2009-03-05T09:33:00+00:00",
  "date_from_url": "2009-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As one who actually reads books, <a href=\"http://www.telegraph.co.uk/culture/books/booknews/4938155/Two-thirds-lie-about-reading-a-book.html\">this report appears to confirm something</a> I have long suspected:</p><blockquote><p><b>Two-thirds lie about reading a book</b><br>It is the dirty little literary secret of which most are guilty but few openly admit: pretending to have read highbrow books like War and Peace to make ourselves appear more intelligent and sexy than we actually are.</br></p></blockquote><p>I will confess to not understanding how having read <i>War and Peace</i> or <i>Madame Bovary</i> is supposed to make one any more sexy, but otherwise, this common practice of deceit doesn’t surprise me at all.  I’ve often noted that at parties and other social gatherings, people who don’t even appear to have a library will bring up certain haut literary classics and claim to adore them.  At such times, it’s always amusing to ask them about some element of the plot, or a specific scene, and see how they attempt to murmur some generality before swiftly changing the subject.  As for the mentioned Great Books:</p><p><i>War and Peace</i>: Read it, loved it, and very much admired Tolstoy’s demonstration of how the great waves which affect human events cannot be explained by the Great Man school of historical thought.  I tend to like the Russian classics, but must admit that I haven’t been able to make it through <i>The Brothers Karamazov</i> in two attempts despite it coming very highly recommended by someone I admired.</p><p><i>Ulysses</i>: Read part of it before getting side-tracked in the Wandering Rocks section and never got back to it.  The literary achievement is notable and had an influence on how I ended up structuring <i>Summa Elvetica</i>, but I found the story itself to be on the tedious side.  Still haven’t read <i>Finnegan’s Wake</i> either.</p><p><i>The Bible</i>:  Of course.  Regardless of your religious faith, you’re simply not an educated man of the West if you haven’t.  I’ve also read the Mahabharata and other Upanashids as well as about half the Koran.  I tried reading the Book of Mormon, but couldn’t abide it.  You can’t fully appreciate the textual excellence of most of the Bible until you’ve read other purportedly sacred texts.</p><p><i>1984</i>: Of course.</p><p><i>Madame Bovary</i>:  I really like Flaubert, although it’s the work of his protégé, Guy de Maupassant, that I really love.  Flaubert’s short stories are particularly good and should not be missed.</p><p><i>A Brief History of Time</i>:  Skimmed it, was unimpressed.  It’s not a classic, and like Sagan, Dawkins, and other science popularizing writers, Hawking will be quickly forgotten as science moves on.  Without the circus freak aspect of his act, <i>A Brief History of Time</i> never would have cracked the bestseller lists in the first place.</p><p><i>A Remembrance of Things Past</i>: I’ve only read part of <i>Swann’s Way</i>.  It is, however, the source of an ongoing joke between one of my mentors in the game industry and me.  We like to pitch publishers on what has to be the worst game concept in the history of electronic gaming: <i>Swann’s Way 3D: The Hunt for the Cooler Side of the Pillow</i>.</p><p><i>The Selfish Gene</i>:  I couldn’t have written TIA without doing so.  It’s a very good pop science book and Dawkins is an engaging science writer.  The problem is that he’s a bad logician, an even more incompetent philosopher, and a close-minded ideologue rather than a true intellectual.</p><p><i>Midnight’s Children</i>:  It was good, although I remember suspecting at the time that there would have been a lot less fuss if it hadn’t been written by someone named Salman Rushdie, but Sam Richards.</p><p>Jane Austen: I generally like her stuff and have read all of it except <i>Northanger Abbey</i>, which I’ve never been able to finish.  Actually, I haven’t read <i>Persuasion</i> either.</p><p>Charles Dickens: I’ve read about a third of his works.  I like them and quite appreciate his particular style, but the overly precious characters do get a bit tiresome after a while. <i>A Christmas Carol</i> and <i>A Tale of Two Cities</i> are my two favorites, although Uriah Heep has to be considered one of the great villains of literature.  I think my complete abhorrence of obsequious individuals owes a lot to Dickens.</p><p>The Brontë sisters:  I can never remember which is which. <i>Jane Eyre</i> and <i>Wuthering Heights</i> are the only two I’ve read.  I seem to recall liking the former, while viewing the latter with somewhat of a jaundiced eye.  It was all a bit too overwrought, in my opinion.</p><p>Ironically, I genuinely liked six of the 10 books on the Pretend list, (and rather liked a seventh, Proust, of which I’ve only read part), while Dick Francis is the only author on the 10 Most-Liked list whom I enjoy.</p></div>",
  "content_text": "As one who actually reads books,\nthis report appears to confirm something\nI have long suspected:\nTwo-thirds lie about reading a book\nIt is the dirty little literary secret of which most are guilty but few openly admit: pretending to have read highbrow books like War and Peace to make ourselves appear more intelligent and sexy than we actually are.\nI will confess to not understanding how having read\nWar and Peace\nor\nMadame Bovary\nis supposed to make one any more sexy, but otherwise, this common practice of deceit doesn’t surprise me at all.  I’ve often noted that at parties and other social gatherings, people who don’t even appear to have a library will bring up certain haut literary classics and claim to adore them.  At such times, it’s always amusing to ask them about some element of the plot, or a specific scene, and see how they attempt to murmur some generality before swiftly changing the subject.  As for the mentioned Great Books:\nWar and Peace\n: Read it, loved it, and very much admired Tolstoy’s demonstration of how the great waves which affect human events cannot be explained by the Great Man school of historical thought.  I tend to like the Russian classics, but must admit that I haven’t been able to make it through\nThe Brothers Karamazov\nin two attempts despite it coming very highly recommended by someone I admired.\nUlysses\n: Read part of it before getting side-tracked in the Wandering Rocks section and never got back to it.  The literary achievement is notable and had an influence on how I ended up structuring\nSumma Elvetica\n, but I found the story itself to be on the tedious side.  Still haven’t read\nFinnegan’s Wake\neither.\nThe Bible\n:  Of course.  Regardless of your religious faith, you’re simply not an educated man of the West if you haven’t.  I’ve also read the Mahabharata and other Upanashids as well as about half the Koran.  I tried reading the Book of Mormon, but couldn’t abide it.  You can’t fully appreciate the textual excellence of most of the Bible until you’ve read other purportedly sacred texts.\n1984\n: Of course.\nMadame Bovary\n:  I really like Flaubert, although it’s the work of his protégé, Guy de Maupassant, that I really love.  Flaubert’s short stories are particularly good and should not be missed.\nA Brief History of Time\n:  Skimmed it, was unimpressed.  It’s not a classic, and like Sagan, Dawkins, and other science popularizing writers, Hawking will be quickly forgotten as science moves on.  Without the circus freak aspect of his act,\nA Brief History of Time\nnever would have cracked the bestseller lists in the first place.\nA Remembrance of Things Past\n: I’ve only read part of\nSwann’s Way\n.  It is, however, the source of an ongoing joke between one of my mentors in the game industry and me.  We like to pitch publishers on what has to be the worst game concept in the history of electronic gaming:\nSwann’s Way 3D: The Hunt for the Cooler Side of the Pillow\n.\nThe Selfish Gene\n:  I couldn’t have written TIA without doing so.  It’s a very good pop science book and Dawkins is an engaging science writer.  The problem is that he’s a bad logician, an even more incompetent philosopher, and a close-minded ideologue rather than a true intellectual.\nMidnight’s Children\n:  It was good, although I remember suspecting at the time that there would have been a lot less fuss if it hadn’t been written by someone named Salman Rushdie, but Sam Richards.\nJane Austen: I generally like her stuff and have read all of it except\nNorthanger Abbey\n, which I’ve never been able to finish.  Actually, I haven’t read\nPersuasion\neither.\nCharles Dickens: I’ve read about a third of his works.  I like them and quite appreciate his particular style, but the overly precious characters do get a bit tiresome after a while.\nA Christmas Carol\nand\nA Tale of Two Cities\nare my two favorites, although Uriah Heep has to be considered one of the great villains of literature.  I think my complete abhorrence of obsequious individuals owes a lot to Dickens.\nThe Brontë sisters:  I can never remember which is which.\nJane Eyre\nand\nWuthering Heights\nare the only two I’ve read.  I seem to recall liking the former, while viewing the latter with somewhat of a jaundiced eye.  It was all a bit too overwrought, in my opinion.\nIronically, I genuinely liked six of the 10 books on the Pretend list, (and rather liked a seventh, Proust, of which I’ve only read part), while Dick Francis is the only author on the 10 Most-Liked list whom I enjoy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-05T09:33:00+00:00"
}