{
  "url": "https://voxday.net/2009/03/15/hey-snow-white/",
  "scraped_at": "2026-01-08T22:50:44.800665",
  "title": "Hey Snow White",
  "date_display": "March 15, 2009",
  "date_iso": "2009-03-15T11:11:00+00:00",
  "date_from_url": "2009-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not a big fan of popular Italian music since it tends to be too saccharine and show-biz, but every now and then you hear a song on the radio that reminds you that opera, with all its violence and passion, was an Italian invention.  And while I absolutely love Rammstein’s <a href=\"http://www.youtube.com/watch?v=mfHlA3fmJG0\">sadistic spin on the Snow White fairy tale</a>, only Italians would take it and turn it into <a href=\"http://www.youtube.com/watch?v=zruLd71KivU\">a smoldering, darkly sensual pop duet</a> with a great hook.</p><p><i>Without you, without you, without you<br>Where shall I go, my love?<br>I swear you will never regret<br>The paradise I am…<br>I am the real witch that you want,<br>The wonderful witch that you want.</br></br></br></br></br></i></p><p>It may not rock as much as Rammstein – what does – but it’s a great pop song… and I really like the woman’s voice.  Every now and then you hear a song, and before it even gets to the second chorus, you find yourself thinking, wow, they sure hit that one out of the park.  I’d be shocked if it doesn’t hit the top of the Italian charts.</p></div>",
  "content_text": "I’m not a big fan of popular Italian music since it tends to be too saccharine and show-biz, but every now and then you hear a song on the radio that reminds you that opera, with all its violence and passion, was an Italian invention.  And while I absolutely love Rammstein’s\nsadistic spin on the Snow White fairy tale\n, only Italians would take it and turn it into\na smoldering, darkly sensual pop duet\nwith a great hook.\nWithout you, without you, without you\nWhere shall I go, my love?\nI swear you will never regret\nThe paradise I am…\nI am the real witch that you want,\nThe wonderful witch that you want.\nIt may not rock as much as Rammstein – what does – but it’s a great pop song… and I really like the woman’s voice.  Every now and then you hear a song, and before it even gets to the second chorus, you find yourself thinking, wow, they sure hit that one out of the park.  I’d be shocked if it doesn’t hit the top of the Italian charts.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-15T11:11:00+00:00"
}