{
  "url": "https://voxday.net/2009/03/26/how-to-think/",
  "scraped_at": "2026-01-08T22:51:47.891037",
  "title": "How to think",
  "date_display": "March 26, 2009",
  "date_iso": "2009-03-26T12:25:00+00:00",
  "date_from_url": "2009-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Forget what the experts say, you’re better off <a href=\"http://www.nytimes.com/2009/03/26/opinion/26Kristof.html\">thinking for yourself</a>:</p><blockquote><p>One explanation is that so-called experts turn out to be, in many situations, a stunningly poor source of expertise. There’s evidence that what matters in making a sound forecast or decision isn’t so much knowledge or experience as good judgment — or, to be more precise, the way a person’s mind works.</p></blockquote><p>This is the sort of thing that would-be experts like Orac, who despise being questioned by non-experts, never seem to understand.  They refuse to grasp that their degrees and experience are often far less significant than an ability to properly assess the situation and its variables, and to then use that assessment to find familiar patterns upon which a judgment can be made.  (Anyhow, how much trust could you reasonably place in an expert whose reaction to being shown to have been repeatedly in error is <a href=\"http://scienceblogs.com/insolence/2009/03/if_you_hand_me_some_stupid_yes_in_fact_i.php#comment-1502592\">this sort of silly posturing</a>.)  An expert is only as good as his track record and past success is no guarantee of future performance.  As Passport has taught me, there are enough random variables at play in the success equation, most notably the fact that it occurs at a unique moment in time and marketplace, that one should never get caught up in thinking one’s own efforts or abilities are solely responsible for success, even if one was the only individual directly acting on the matter.  Blindly attempting to repeat what led to success in the past is a fairly reliable means of ensuring future failure.</p><p>Kristof happens to mention an idea I’d had a while ago myself, which is setting up a system to track pundit predictions.  I think this would be a valuable tool to keep track of who said what and whether they were correct or not, as I’m already building a massive database tracking a very different subject.  I even already have a scoring system in mind.  I don’t know if anyone here would be interested in helping with a pundit-tracker, but if you are, let me know.</p><p>On an entirely unrelated note, let me just say that I think a lot of you are really going to enjoy the column next week….</p></div>",
  "content_text": "Forget what the experts say, you’re better off\nthinking for yourself\n:\nOne explanation is that so-called experts turn out to be, in many situations, a stunningly poor source of expertise. There’s evidence that what matters in making a sound forecast or decision isn’t so much knowledge or experience as good judgment — or, to be more precise, the way a person’s mind works.\nThis is the sort of thing that would-be experts like Orac, who despise being questioned by non-experts, never seem to understand.  They refuse to grasp that their degrees and experience are often far less significant than an ability to properly assess the situation and its variables, and to then use that assessment to find familiar patterns upon which a judgment can be made.  (Anyhow, how much trust could you reasonably place in an expert whose reaction to being shown to have been repeatedly in error is\nthis sort of silly posturing\n.)  An expert is only as good as his track record and past success is no guarantee of future performance.  As Passport has taught me, there are enough random variables at play in the success equation, most notably the fact that it occurs at a unique moment in time and marketplace, that one should never get caught up in thinking one’s own efforts or abilities are solely responsible for success, even if one was the only individual directly acting on the matter.  Blindly attempting to repeat what led to success in the past is a fairly reliable means of ensuring future failure.\nKristof happens to mention an idea I’d had a while ago myself, which is setting up a system to track pundit predictions.  I think this would be a valuable tool to keep track of who said what and whether they were correct or not, as I’m already building a massive database tracking a very different subject.  I even already have a scoring system in mind.  I don’t know if anyone here would be interested in helping with a pundit-tracker, but if you are, let me know.\nOn an entirely unrelated note, let me just say that I think a lot of you are really going to enjoy the column next week….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-26T12:25:00+00:00"
}