{
  "url": "https://voxday.net/2009/03/06/i-love-smell-of-catastrophe-in-morning/",
  "scraped_at": "2026-01-08T22:49:59.201810",
  "title": "I love the smell of catastrophe in the morning",
  "date_display": "March 6, 2009",
  "date_iso": "2009-03-06T11:41:00+00:00",
  "date_from_url": "2009-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s amazing in its near-complete detachment from observable reality, but <a href=\"http://egan.blogs.nytimes.com/2009/03/04/fears-of-a-clown/?em\">this is the way</a> a typical Obama supporter views the economic situation:</p><blockquote><p>We are witnessing the worst debacle of unfettered capitalism in our lifetime brought on by — you got it, capitalism at its worst. It cannibalized itself. Government, sad to say, had nothing to do with it — except for criminal neglect of oversight.</p></blockquote><p>Let’s see.  The root problem is that government-established corporations borrowed too much government-backed fiat currency, the price of which was set too low for too long by the monopoly established by the government.  What, one wonders does this actually have to do with the capitalism described by the classical, socialist and Austrian economists, much less “unfettered” capitalism?  Needless to say, the clueless New York Times opinionator is, much like the administration he supports, far less interested in the ongoing collapse of the house of paper cards that is the global financial system than he is in… Rush Limbaugh.  “Doomed” doesn’t even begin to describe a country cursed with such media and political “leadership”.  Lest you think I exaggerate, note that even one-time Obama cheerleader Paul Krugman <a href=\"http://www.nytimes.com/2009/03/06/opinion/06krugman.html\">is getting concerned</a>:</p><p>“<i>Here’s how the pattern works: first, administration officials, usually speaking off the record, float a plan for rescuing the banks in the press. This trial balloon is quickly shot down by informed commentators.  Then, a few weeks later, the administration floats a new plan. This plan is, however, just a thinly disguised version of the previous plan, a fact quickly realized by all concerned. And the cycle starts again.</i></p><p>Why do officials keep offering plans that nobody else finds credible? Because somehow, top officials in the Obama administration and at the Federal Reserve have convinced themselves that troubled assets, often referred to these days as “toxic waste,” are really worth much more than anyone is actually willing to pay for them — and that if these assets were properly priced, all our troubles would go away.”</p><p>It’s interesting, is it not, to see a high-profile left-leaning economist implicitly accept the concept of subjective value… but despite these correct observations, Krugman still has the solution precisely backward.  The administration may be dithering, but one cannot rationally describe its lunatic spending or frantic central planning as “inaction” in any sense of the word, however incompetent it might be.  And it’s not genuine inaction that will cause the depression to last a decade or more, it’s the very sort of action in which the fiscal and monetary authorities are presently engaging, repeatedly transfusing more blood into the twitching corpses of the zombie organizations, that will do so.</p></div>",
  "content_text": "It’s amazing in its near-complete detachment from observable reality, but\nthis is the way\na typical Obama supporter views the economic situation:\nWe are witnessing the worst debacle of unfettered capitalism in our lifetime brought on by — you got it, capitalism at its worst. It cannibalized itself. Government, sad to say, had nothing to do with it — except for criminal neglect of oversight.\nLet’s see.  The root problem is that government-established corporations borrowed too much government-backed fiat currency, the price of which was set too low for too long by the monopoly established by the government.  What, one wonders does this actually have to do with the capitalism described by the classical, socialist and Austrian economists, much less “unfettered” capitalism?  Needless to say, the clueless New York Times opinionator is, much like the administration he supports, far less interested in the ongoing collapse of the house of paper cards that is the global financial system than he is in… Rush Limbaugh.  “Doomed” doesn’t even begin to describe a country cursed with such media and political “leadership”.  Lest you think I exaggerate, note that even one-time Obama cheerleader Paul Krugman\nis getting concerned\n:\n“\nHere’s how the pattern works: first, administration officials, usually speaking off the record, float a plan for rescuing the banks in the press. This trial balloon is quickly shot down by informed commentators.  Then, a few weeks later, the administration floats a new plan. This plan is, however, just a thinly disguised version of the previous plan, a fact quickly realized by all concerned. And the cycle starts again.\nWhy do officials keep offering plans that nobody else finds credible? Because somehow, top officials in the Obama administration and at the Federal Reserve have convinced themselves that troubled assets, often referred to these days as “toxic waste,” are really worth much more than anyone is actually willing to pay for them — and that if these assets were properly priced, all our troubles would go away.”\nIt’s interesting, is it not, to see a high-profile left-leaning economist implicitly accept the concept of subjective value… but despite these correct observations, Krugman still has the solution precisely backward.  The administration may be dithering, but one cannot rationally describe its lunatic spending or frantic central planning as “inaction” in any sense of the word, however incompetent it might be.  And it’s not genuine inaction that will cause the depression to last a decade or more, it’s the very sort of action in which the fiscal and monetary authorities are presently engaging, repeatedly transfusing more blood into the twitching corpses of the zombie organizations, that will do so.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-06T11:41:00+00:00"
}