{
  "url": "https://voxday.net/2009/03/06/i-totally-want-one-of-these/",
  "scraped_at": "2026-01-08T22:50:01.015295",
  "title": "I totally want one of these",
  "date_display": "March 6, 2009",
  "date_iso": "2009-03-06T15:15:00+00:00",
  "date_from_url": "2009-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.mises.org/store/LvMI-Cap-Black-P562.aspx\">In black</a>.  Let’s face it, casual fashion just doesn’t get much more incomprehensible to the masses.  And it makes me wonder, in light of <a href=\"http://www.fstdt.com/fundies/top100.aspx?archive=1\">my ever-growing fan club</a>, if we should think about offering VD-related gear some day.  Unfortunately, most of my better aphorisms tend to be too verbose to fit easily on a short, single line, and I’m not at all keen on the generic Cafe Press kitsch.</p><p>I always find it amusing that feminist-oriented Americans inevitably get their panties in a bunch over individuals like me who point out the obvious while simultaneously supporting the very multiculturalism that sees <a href=\"http://www.hudsonny.org/2009/03/sharias-inroads-in-europe-italian-court-beaten-up-for-her-own-good.php\">European women beaten legally</a> for their own good.  There is no such thing as equality, and the current choice facing most of the West is which form of “Patriarchy” is to be preferred, Christian or Sharia.  Secular equalitarianism isn’t on the table; it’s already proven itself to be a self-negating demographic non-starter with more internal contradictions than Communism.</p></div>",
  "content_text": "In black\n.  Let’s face it, casual fashion just doesn’t get much more incomprehensible to the masses.  And it makes me wonder, in light of\nmy ever-growing fan club\n, if we should think about offering VD-related gear some day.  Unfortunately, most of my better aphorisms tend to be too verbose to fit easily on a short, single line, and I’m not at all keen on the generic Cafe Press kitsch.\nI always find it amusing that feminist-oriented Americans inevitably get their panties in a bunch over individuals like me who point out the obvious while simultaneously supporting the very multiculturalism that sees\nEuropean women beaten legally\nfor their own good.  There is no such thing as equality, and the current choice facing most of the West is which form of “Patriarchy” is to be preferred, Christian or Sharia.  Secular equalitarianism isn’t on the table; it’s already proven itself to be a self-negating demographic non-starter with more internal contradictions than Communism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-06T15:15:00+00:00"
}