{
  "url": "https://voxday.net/2009/03/19/if-you-hand-us-hammer/",
  "scraped_at": "2026-01-08T22:51:08.626163",
  "title": "If you hand us a hammer",
  "date_display": "March 19, 2009",
  "date_iso": "2009-03-19T11:00:00+00:00",
  "date_from_url": "2009-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yes, in fact, we are going to <a href=\"http://scienceblogs.com/insolence/2009/03/the_most_massive_scientific_fraud_ever.php\">hit you over the head with it</a>.  Because you absolutely deserve it.  To his credit, Orac admits that there is something rotten in the current state of “science”, mostly in the area of so-called peer review, but he also worries that the public will draw the correct conclusion from learning of yet another major scientific fraud:</p><blockquote><p>It’s hard to overstate how serious this revelation of scientific fraud is for the field of anesthesiology and medicine. Dr. Reuben was considered a pioneer in his field, and his work is not only widely cited, but serves as the basis for an amount of anesthesia practice that few academic anesthesiologists can lay claim to. The twenty-one papers now retracted represent a body of work that appeared on its surface to be quite impressive….</p><p>What most angers me about this case is the massive betrayal of trust. The public expects that its scientists, at the very least, will be honest about their results. Too much depends on it, especially in medical science, where it is people’s health that is at stake. Even worse, much of Dr. Reuben’s work was underwritten by the pharmaceutical companies that manufacture the the very nonsteroidal anti-inflammatory drugs combinations of which he studied. What that means for those of us who defend science- and evidence-based medicine is that every crank alt-med site and blog on the Internet is going to be harping on this incident as The Proof That Conventional Medicine Is Hopelessly Corrupt and their favorite woo is being kept down by The Big Bad Pharma Man. Look for Age of Autism and NaturalNews.com to go crazy about this story as proof that they were right all along and The Big Bad Pharma Man has suppressed The Real Proof that vaccines cause autism. Not only has he put a stain on scientific medicine that will be very hard to erase, if it’s even possible at all, but that bastard Reuben has made my work here harder, as well as that of every advocate of of science- and evidence-based medicine, as Whale.to, NaturalNews.com, and Age of Autism, not to mention every crank blog and website spread the story far and wide as some form of “vindication.”</p></blockquote><p>Actually, Orac is decades out of date with regards to the public’s view of scientists.  Scientists no longer occupy any special place in the public’s regard.  After more than 30 years of being told to “question authority”, the average non-scientist doesn’t automatically believe a scientific authority any more than he believes any other authority.  Scientists aren’t lumped in with completely untrustworthy types such as politicans, used-car salesmen, lawyers, and journalists, but they’re no longer viewed as standing on some sort of objective pedestal and they haven’t been for quite some time.  Orac should understand this, after all, is his blog not entitled “Respectful Insolence”?</p><p>The reality is that <a href=\"http://www.harrisinteractive.com/harris_poll/index.asp?PID=688\">scientists aren’t considered much more trustworthy than the clergy, the military, or the police</a>, and are less trusted than doctors and teachers.   This is striking when one considers the fact that unlike the other professions, scientists supposedly have the benefit of relying upon what is supposed to be a completely objective system, which means that their constant tendency to play bait-and-switch, wherein they substitute appeals to scientific authority, peer review, and statistical reviews for actual science, has had a more detrimental effect than the otherwise high credibility ratings would appear to suggest.</p><p>Just as the televangelist and pedophile priest scandals drove down the trustworthiness of the clergy from 90 percent in 2001 to 64 percent in 2002, the credibility of scientists will likely fall below their 2002 low of 68 percent as the AGW fraud – to which I note Orac himself subscribes – becomes ever more apparent to all and sundry, as more scientific charlatans such as Scott Reuben and Hwang Woo-suk are unmasked, and as scientists constantly flip-flop over quotidian matters such as whether red wine is good for you and if it’s a high-fat diet or a high-carbohydrate diet that causes weight gain.</p><p>Like the increasingly discredited news media, (journalists are near the bottom at 39 percent), scientists often seem to assume that the public has no memory.  This is understandable; most people are short-sighted idiots with little recall.  But, even a complete idiot will notice when he gains 20 pounds on a low-fat diet, when a blizzard shuts down the roads for the tenth time that winter, or when an infant screams and slumps unconscious right after being injected by a “perfectly safe” vaccine.  Scientists have relied far too long on their reputation rather than their method, and the public has finally begun to take note.</p><p>Orac and other science fetishists will naturally be tempted to dismiss my words, to take them out of context, and to claim that I am too stupid to understand the miraculous wonders of science.  But this will only further undermine their credibility; since I have the benefit of a demonstrably higher IQ than most as well as a seven-year archive containing a high percentage of correct calls on everything from market collapses to housing and gold prices, (yes, there were of course some misses – Hillary! –  too), avoiding the subject by calling me names is not going to convince anyone who isn’t already a mindless science groupie.  Science isn’t some sort of grand mystery approachable only by the elect, it’s merely a process.  It’s not difficult to understand; those who claim that it is are merely advertising their own intellectual limitations.  If Orac is genuinely concerned about the public’s willingness to trust scientists, he should spend a lot less time worrying about what he calls woo and a lot more time encouraging scientists to get back to the scientific method that established their reputation in the first place.  He should encourage them to stop trying to take credit for things that rightly belong to other fields – as one of his commenters pointed out, it wasn’t scientific self-correction that uncovered Reuben’s fraud, but a bureaucrat at the hospital – and to stop abusing legitimate scientific authority by calling upon it in areas clearly outside their areas of expertise.  Some scientific self-congratulation is downright insane; being caught by the auditors doesn’t prove the self-correcting nature of embezzlement.</p><p>As for vaccines, if he truly wishes to change even a single parent’s mind, Orac and other vaccine champions simply have to stop attempting to wave the increasingly tattered flag of “but science says” in the face of the growing number of science skeptics and think very seriously about why so many people are rejecting the modern American vaccine schedule despite constant pressure from their doctors, schools, and the science fetishists in the media.  More pounding the table isn’t going to work, because the parties pounding the table are already considered completely biased and untrustworthy.  As I wrote yesterday, show the science!  The real science, where the damn hypothesis is actually tested!  No more BS “no statistical correlation has been found”, no more “no peer reviewed study has proven”, no more dancing and ducking and evading the obvious solution of actually putting the scientific method to work.  Interpolation and extrapolation aren’t sufficient.  Statistical analysis isn’t enough.  Peer reviewed metastudies are of zero value.  Pump 1,000 kids full of <s>toxins</s>vaccines according to the complete schedule and leave a control group of 1,000 completely unvaccinated.  Then report on how they’re doing every six months.  There’s no excuse not to do it, it’s eminently doable.</p><p>That, and that alone, will suffice to convince parents that science proves the vaccine schedule is sufficiently safe.  And if scientists can’t be bothered to actually do the relevant science and sh<br> ow their work to the public, they shouldn’t be surprised when the public tells them to stick their fraudulent, faux-scientific propaganda up their collective posteriors.</br></p><p>Note – I tend to doubt that political demonstration, peaceful or otherwise, <a href=\"http://www.guardian.co.uk/science/2009/mar/18/nasa-climate-change-james-hansen\">is likely to prove an effective substitute</a> for the scientific method either.</p></div>",
  "content_text": "Yes, in fact, we are going to\nhit you over the head with it\n.  Because you absolutely deserve it.  To his credit, Orac admits that there is something rotten in the current state of “science”, mostly in the area of so-called peer review, but he also worries that the public will draw the correct conclusion from learning of yet another major scientific fraud:\nIt’s hard to overstate how serious this revelation of scientific fraud is for the field of anesthesiology and medicine. Dr. Reuben was considered a pioneer in his field, and his work is not only widely cited, but serves as the basis for an amount of anesthesia practice that few academic anesthesiologists can lay claim to. The twenty-one papers now retracted represent a body of work that appeared on its surface to be quite impressive….\nWhat most angers me about this case is the massive betrayal of trust. The public expects that its scientists, at the very least, will be honest about their results. Too much depends on it, especially in medical science, where it is people’s health that is at stake. Even worse, much of Dr. Reuben’s work was underwritten by the pharmaceutical companies that manufacture the the very nonsteroidal anti-inflammatory drugs combinations of which he studied. What that means for those of us who defend science- and evidence-based medicine is that every crank alt-med site and blog on the Internet is going to be harping on this incident as The Proof That Conventional Medicine Is Hopelessly Corrupt and their favorite woo is being kept down by The Big Bad Pharma Man. Look for Age of Autism and NaturalNews.com to go crazy about this story as proof that they were right all along and The Big Bad Pharma Man has suppressed The Real Proof that vaccines cause autism. Not only has he put a stain on scientific medicine that will be very hard to erase, if it’s even possible at all, but that bastard Reuben has made my work here harder, as well as that of every advocate of of science- and evidence-based medicine, as Whale.to, NaturalNews.com, and Age of Autism, not to mention every crank blog and website spread the story far and wide as some form of “vindication.”\nActually, Orac is decades out of date with regards to the public’s view of scientists.  Scientists no longer occupy any special place in the public’s regard.  After more than 30 years of being told to “question authority”, the average non-scientist doesn’t automatically believe a scientific authority any more than he believes any other authority.  Scientists aren’t lumped in with completely untrustworthy types such as politicans, used-car salesmen, lawyers, and journalists, but they’re no longer viewed as standing on some sort of objective pedestal and they haven’t been for quite some time.  Orac should understand this, after all, is his blog not entitled “Respectful Insolence”?\nThe reality is that\nscientists aren’t considered much more trustworthy than the clergy, the military, or the police\n, and are less trusted than doctors and teachers.   This is striking when one considers the fact that unlike the other professions, scientists supposedly have the benefit of relying upon what is supposed to be a completely objective system, which means that their constant tendency to play bait-and-switch, wherein they substitute appeals to scientific authority, peer review, and statistical reviews for actual science, has had a more detrimental effect than the otherwise high credibility ratings would appear to suggest.\nJust as the televangelist and pedophile priest scandals drove down the trustworthiness of the clergy from 90 percent in 2001 to 64 percent in 2002, the credibility of scientists will likely fall below their 2002 low of 68 percent as the AGW fraud – to which I note Orac himself subscribes – becomes ever more apparent to all and sundry, as more scientific charlatans such as Scott Reuben and Hwang Woo-suk are unmasked, and as scientists constantly flip-flop over quotidian matters such as whether red wine is good for you and if it’s a high-fat diet or a high-carbohydrate diet that causes weight gain.\nLike the increasingly discredited news media, (journalists are near the bottom at 39 percent), scientists often seem to assume that the public has no memory.  This is understandable; most people are short-sighted idiots with little recall.  But, even a complete idiot will notice when he gains 20 pounds on a low-fat diet, when a blizzard shuts down the roads for the tenth time that winter, or when an infant screams and slumps unconscious right after being injected by a “perfectly safe” vaccine.  Scientists have relied far too long on their reputation rather than their method, and the public has finally begun to take note.\nOrac and other science fetishists will naturally be tempted to dismiss my words, to take them out of context, and to claim that I am too stupid to understand the miraculous wonders of science.  But this will only further undermine their credibility; since I have the benefit of a demonstrably higher IQ than most as well as a seven-year archive containing a high percentage of correct calls on everything from market collapses to housing and gold prices, (yes, there were of course some misses – Hillary! –  too), avoiding the subject by calling me names is not going to convince anyone who isn’t already a mindless science groupie.  Science isn’t some sort of grand mystery approachable only by the elect, it’s merely a process.  It’s not difficult to understand; those who claim that it is are merely advertising their own intellectual limitations.  If Orac is genuinely concerned about the public’s willingness to trust scientists, he should spend a lot less time worrying about what he calls woo and a lot more time encouraging scientists to get back to the scientific method that established their reputation in the first place.  He should encourage them to stop trying to take credit for things that rightly belong to other fields – as one of his commenters pointed out, it wasn’t scientific self-correction that uncovered Reuben’s fraud, but a bureaucrat at the hospital – and to stop abusing legitimate scientific authority by calling upon it in areas clearly outside their areas of expertise.  Some scientific self-congratulation is downright insane; being caught by the auditors doesn’t prove the self-correcting nature of embezzlement.\nAs for vaccines, if he truly wishes to change even a single parent’s mind, Orac and other vaccine champions simply have to stop attempting to wave the increasingly tattered flag of “but science says” in the face of the growing number of science skeptics and think very seriously about why so many people are rejecting the modern American vaccine schedule despite constant pressure from their doctors, schools, and the science fetishists in the media.  More pounding the table isn’t going to work, because the parties pounding the table are already considered completely biased and untrustworthy.  As I wrote yesterday, show the science!  The real science, where the damn hypothesis is actually tested!  No more BS “no statistical correlation has been found”, no more “no peer reviewed study has proven”, no more dancing and ducking and evading the obvious solution of actually putting the scientific method to work.  Interpolation and extrapolation aren’t sufficient.  Statistical analysis isn’t enough.  Peer reviewed metastudies are of zero value.  Pump 1,000 kids full of\ntoxins\nvaccines according to the complete schedule and leave a control group of 1,000 completely unvaccinated.  Then report on how they’re doing every six months.  There’s no excuse not to do it, it’s eminently doable.\nThat, and that alone, will suffice to convince parents that science proves the vaccine schedule is sufficiently safe.  And if scientists can’t be bothered to actually do the relevant science and sh\now their work to the public, they shouldn’t be surprised when the public tells them to stick their fraudulent, faux-scientific propaganda up their collective posteriors.\nNote – I tend to doubt that political demonstration, peaceful or otherwise,\nis likely to prove an effective substitute\nfor the scientific method either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-19T11:00:00+00:00"
}