{
  "url": "https://voxday.net/2009/03/30/interview-with-daniel-hannan/",
  "scraped_at": "2026-01-08T22:52:04.430482",
  "title": "Interview with Daniel Hannan",
  "date_display": "March 30, 2009",
  "date_iso": "2009-03-30T04:15:00+00:00",
  "date_from_url": "2009-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Daniel Hannan’s <a href=\"http://www.youtube.com/watch?v=94lW6Y4tBXs\">fiery speech addressing Gordon Brown at the European Parliament</a> electrified the Internet when it was broadcast on YouTube last week.  Vox Day interviewed the iconoclastic author, journalist, and European parliamentarian about Brown, Britain, and the global economic crisis on March 26, 2009.</i></p><p>VD: <b>Your speech criticizing Gordon Brown’s incompetent stewardship of the UK economy was extraordinarily well-received, not just in Britain, but around the world. Meanwhile, the leader of the opposition party, David Cameron, has been rather quiet on that front.  Why has Mr. Cameron been so reluctant to say the things you said to Mr. Brown? </b></p><p>DH: Because in the British system, there’s this great thing about the loyal opposition.  And when you get a crisis like this, that comes out of a clear blue sky, nobody wants to risk looking unpatriotic, so you have to be measured and tempered in how you respond, which is completely understandable.  The result of it, unfortunately, is that a lot of people are left with saying, wait a minute, hang on, nobody is saying what I would like them to say.  All the politicians seem to be in this together.  A lot of people felt that a cartel of politicians and bankers were setting policy in defiance of public opinion. Those were the people I was trying to speak for.</p><p><b>It’s interesting to hear you say “coming out of a blue sky,” because at least in the States, there was definitely a group of contrarians, including Roubini and me, who were on record as far back as 2002 saying that the housing crash was going to affect the financial system.  Did no one in England see that?</b></p><p>There were a few people who saw it, but not anywhere in the mainstream.  Certainly none of the three big parties were warning about this except in very general terms about house prices being a bit too much and that sort of thing.  Nobody was expecting a run on the banks; we haven’t had one of those since the early 19th century.  Certainly no one was expecting nationalizing our banks.  Even at their most socialist, the Labour Party barely dreamed of doing that.</p><p><b>The European Union is described as everything from a free trade union to the EUSSR. How do you, as a European Member of Parliament, see the EU today?</b></p><p>The EU is a racket: a mechanism for taking money from the taxpayer and handing it to Eurocrats.  But you’ve got to be careful about the Soviet analogy, as you don’t want to sound hysterical on this.  The EU, which God knows I’m no defender of, doesn’t take people’s passports away, doesn’t put people in gulags, doesn’t run show trials.  If you want to push the Soviet parallel, I think you’re on safer grounds looking at the fag end of the Soviet era in Eastern Europe.  Dissidents were not being arrested or tried, in fact, the scary thing is that they weren’t being tried.  If you were thought to be a critic of the regime in the 70’s and 80’s, in Poland or Czechoslovakia, your life would be made difficult.  Your children wouldn’t go to university, your driving license would mysteriously not be renewed, that kind of thing.  That’s the better parallel for this reason.  Up until 1968, there were lots of people in socialist Europe who still believed that it would be possible one day to move to a phased restoration of parliamentary democracy.  In other words, they saw the dictatorship of the proletariat as a contingent, provisional thing.  After the Prague Spring, nobody thought that anymore.  It became obvious that it was just a means of keeping some people in power at the expense of everybody else.</p><p>The EU’s equivalent of the Prague Spring was the “No” votes of 2004 and 2005.  Nobody believes anymore that if only the question could be fairly put, then all the people would come around to it.  They’ve lost whatever ideological impetus they had, but they understand that their position in society depends upon their maintaining the status quo.  Since the “No” votes across the EU, Eurocrats have given up on the idea that their system will ever win approval. That’s what makes them so tetchy.</p><p><b>Given the authoritarian behavior of the EU bureaucracy, why has the Tory party been so reluctant to embrace popular euroskepticism? </b></p><p>Like everyone in politics, I like to imagine that eventually I’ll convince everybody.  We haven’t got there yet, and the reason, I suspect, is because there is a small-c conservativism in the  big-C Conservative Party.  It’s not that they actually believe in a European superstate. It’s that they have this Burkeian instinct to try to work with the status quo, to prefer evolution to revolution.  And it’s very deep in their DNA, that.  It’s what they’ve been thinking ever since they went into politics.  No one would have wanted to start from where we are now.  No one would have gone from first principles into this ridiculous racket where we’re run by an unelected bureaucracy that passes 84 percent of our laws.  But, they don’t want to break the whole thing up.  They haven’t yet gotten into the mindset that the whole thing is beyond reform and that you need to just cut loose.  But I think we’ll get there in the end.</p><p><b>Do you think an ongoing period of economic contraction will see the British people demand to leave the European Union?</b></p><p>They already do!  The latest opinion poll was conducted by the BBC a week ago, and showed that 55 per cent of voters want to leave the EU. It’s true that this position isn’t yet shared by any major political party, but that moment will come: politicians cannot swim forever against the current of public opinion.  If you offered a Swiss or Norwegian-style free trade deal, people would go for that with a large majority.</p><p><b>Which do you believe will be the first nation to attempt to leave the European Union? And will they be successful?</b></p><p>I think it will be us.  Because we have a different political system, because we, like you, have a majoritarian system rather than a party list system, which means that politicians cannot so easily disregard their voters as happens under a proportional system.  It could happen really suddenly without anyone really planning for it.  To go back for a moment to your Soviet parallel, everyone used to say, how is this going to end?  Is there going to be some tremendous crisis, some earthquake that’s going to shake it down?  You remember what it was that brought it down in 1989?  It was the decision of the Hungarian government no longer to require exit visas from East Germans wanting to travel to Hungaria.  And before anybody knew where they were, the Wall was down and there was democracy.  It can happen very, very suddenly.  My guess is that it will probably happen in Britain first and we will go for some kind of EFTA-type deal, some kind of associate membership where we’re in a free market but outside all the rest of it.  And I think once we do that, once we set that precedent, a whole bunch of countries will be queuing up to copy.</p><p><b>One thing I have been paying attention to is the socionomics.  The Elliott Wave people always said that economic contraction tends to split things up, and I’ve been paying close attention to the EU because of that.</b></p><p>Yeah, it may well be that the Euro will fracture.  Really quite mainstream, serious people are now saying that it’s when rather than if a country leaves the single currency.</p><p><b>In your speech, you mentioned that one cannot spend one’s way out of a recession. This would appear to contradict the neo-Keynesian approach of Alastair Darling and the U.S. fiscal authorities. Do you subscribe to a different economic model?</b></p><p>Yes, certainly!  We saw where the Keynesian model led!  We pursued it from the 30s to the 70s.  And it ended up in recession, stagnation, inflation, and debt.  It’s much easier to begin a government program under the guise of counter-cyclical spending than it is to terminate it, so you end up with the st<br> ate becoming more and more bloated.  It’s a measure of how panicked people are, that they’ve forgotten all of the lessons of that unhappy period.  We can see where it ends up.  You don’t need to be an economist to understand that if you’re spending and borrowing too much, you should cut down rather than doing even more of it.  Sadly, it seems every nation has to learn these lessons for itself.</br></p><p><b>Who are your intellectual influences with regards to economics?  Do you go all the way back to Smith?</b></p><p>Absolutely, I’m a very traditional Brit like this.  I’ve got two busts in my office.  One is Adam Smith, the other is Thomas Jefferson.</p><p><b>One thing that tends to confuse Americans is that the British National Party is not very popular despite holding what appear to be populist views on immigration and the European Union.  Why do they enjoy so little support compared to the three major parties?</b></p><p>Because they are, contrary to the way they are described in the BBC, a party of the far left.  They’re in favor of nationalization, they’re in favor of protectionism, they want workers’ councils to run industry, they want a massive state program of rebuilding manufacture.  Like Hayek said about the socialist roots of Nazism, they are a national socialist party and the socialist bit is very important to them.  Plus, there is a line, a very important line in politics, between being anti-immigration and anti-immigrant.  And they’ve crossed that line.</p><p><b>In a certain respect, they really are fascists, but in the Italian Fascist sense.</b></p><p>Yeah.  I think most of these so-called “far right” parties are on the left by any normal definition.  It’s a brilliant media trick in Europe to always refer to them as “the far right”.  The target of that is the mainstream right.  Every time you read about the BNP in the press, it’s always prefaced with “the far right BNP”, as though they were like us, but more so, which is the opposite of the case.  When somebody reads that, it doesn’t make them think any worse of the BNP, it makes them think worse of the right.  Which, of course, is why they do it.</p><p><b>The US president recently gave the Prime Minister a gift that consisted of 25 region-one DVDs that don’t work in Britain. How was this regarded there?</b></p><p>Badly.  The guy is a complete idiot, Brown.  But he’s our complete idiot, and we don’t like to see him being slapped around like this.  That’s for us to do.</p><p><b>(Laughs)  I have to admit, that sounds really funny coming from you!</b></p><p>In the same way, you can be ruder about your president than I would be.  The thing that really stuck in my craw was afterwards, when the White House said that he was just really tired because he was dealing with this financial crisis.  In November, I was in Afghanistan, in Helmand, where nobody else is touching this war, aside from us, and you, and a couple of Danes.  All the others are in the safe places.  And I guess the guys from Four and Five Commando and their forward operating bases are pretty tired as well.  It’s not an excuse.</p><p><b>To say nothing of the way that answer seems to ignore that Britain is experiencing its own economic difficulties.</b></p><p>Yeah, although it’s definitely the case that the two of them are using each other as cover on the economy, which makes it all the weirder that Obama didn’t bother to conceal his impatience when he had the meeting with Brown.</p><p> <b>Speaking of Obama, you’ve expressed some sympathies for President Obama on your blog in the past. What is your perception of his performance to date? How has his stewardship of the economy been any different than Gordon Brown’s?</b></p><p>I think his stewardship of the economy has been bad.  I think the Republican Party had been pretty bad in the run-up to this.  One of  the reasons why I had gone off the GOP, which I’m normally very loyal to, is because I could see them losing touch with all the things that used to make them so successful.  They had become the party of steel tariffs, and the party of trampling over states rights, particularly with the marriage amendment, they’d become the party of big spending and federal deficits, and in the end they became the party of bailouts and nationalizations.  One of the reasons I was in favor of Obama winning – without any great enthusiasm, I might add – is that I thought the Republicans would benefit from a period out of office where they could go back and remember what used to make them successful.  And so far, so good!  It is striking that an immediate consequence of the Obama presidency is that a lot of Republican congressmen who voted for the first spraying-around of money under Bush unanimously voted against the second one.  He’s already succeeded in uniting the GOP around a correct position.</p><p><b>You’re not just a journalist and author, but a politician as well. Have you given any thought to eventually running for Parliament in the UK?</b></p><p>No, not for the moment, anyway.  I’ll tell you why.  It’s not out of false modesty or anything.  We have a very, very weak parliament.  We have a much weaker legislature than you have, and it’s weaker than it’s ever been.  A measure of how weak it is is that we didn’t even have a vote on our bailouts, on our stimulus package.  It was just decreed by the executive.  You know, at least you guys got to talk about it, and the politicians who have to go back to face their voters got to decide.  Having fought a civil war in the UK to establish the principle that Parliament should be the only people who can raise tax, we’ve abandoned that principle and we’ve given the executive extraordinary powers to raise money as they choose.   One of the beauties of your system is that you have a proper separation of powers, so a legislator can make an honourable career for himself without wanting to join the executive. As things stand, that can’t happen in the British system. I’m very keen to import the most successful elements of your system – open primaries, elected sheriffs, a local sales tax, local referendums, the direct election of public officials – and I’ve written a book about how to do it called <a href=\"http://stores.lulu.com/renewbritain\">The Plan: Twelve Months to Renew Britain</a>.</p><p>In Britain, we are run by a massive bureaucracy, and the position of the elected person is incredibly weak and is getting weaker every day.  One of the reasons we are in this financial mess is that the budgets are set by members of the executive who are personal beneficiaries of state spending, rather than by the members of the legislature who are champions of the taxpayer.</p><p><i>For more from Daniel Hannan, check out <a href=\"http://blogs.telegraph.co.uk/Daniel_Hannan\">his Daily Telegraph blog</a>.</i></p></div>",
  "content_text": "Daniel Hannan’s\nfiery speech addressing Gordon Brown at the European Parliament\nelectrified the Internet when it was broadcast on YouTube last week.  Vox Day interviewed the iconoclastic author, journalist, and European parliamentarian about Brown, Britain, and the global economic crisis on March 26, 2009.\nVD:\nYour speech criticizing Gordon Brown’s incompetent stewardship of the UK economy was extraordinarily well-received, not just in Britain, but around the world. Meanwhile, the leader of the opposition party, David Cameron, has been rather quiet on that front.  Why has Mr. Cameron been so reluctant to say the things you said to Mr. Brown?\nDH: Because in the British system, there’s this great thing about the loyal opposition.  And when you get a crisis like this, that comes out of a clear blue sky, nobody wants to risk looking unpatriotic, so you have to be measured and tempered in how you respond, which is completely understandable.  The result of it, unfortunately, is that a lot of people are left with saying, wait a minute, hang on, nobody is saying what I would like them to say.  All the politicians seem to be in this together.  A lot of people felt that a cartel of politicians and bankers were setting policy in defiance of public opinion. Those were the people I was trying to speak for.\nIt’s interesting to hear you say “coming out of a blue sky,” because at least in the States, there was definitely a group of contrarians, including Roubini and me, who were on record as far back as 2002 saying that the housing crash was going to affect the financial system.  Did no one in England see that?\nThere were a few people who saw it, but not anywhere in the mainstream.  Certainly none of the three big parties were warning about this except in very general terms about house prices being a bit too much and that sort of thing.  Nobody was expecting a run on the banks; we haven’t had one of those since the early 19th century.  Certainly no one was expecting nationalizing our banks.  Even at their most socialist, the Labour Party barely dreamed of doing that.\nThe European Union is described as everything from a free trade union to the EUSSR. How do you, as a European Member of Parliament, see the EU today?\nThe EU is a racket: a mechanism for taking money from the taxpayer and handing it to Eurocrats.  But you’ve got to be careful about the Soviet analogy, as you don’t want to sound hysterical on this.  The EU, which God knows I’m no defender of, doesn’t take people’s passports away, doesn’t put people in gulags, doesn’t run show trials.  If you want to push the Soviet parallel, I think you’re on safer grounds looking at the fag end of the Soviet era in Eastern Europe.  Dissidents were not being arrested or tried, in fact, the scary thing is that they weren’t being tried.  If you were thought to be a critic of the regime in the 70’s and 80’s, in Poland or Czechoslovakia, your life would be made difficult.  Your children wouldn’t go to university, your driving license would mysteriously not be renewed, that kind of thing.  That’s the better parallel for this reason.  Up until 1968, there were lots of people in socialist Europe who still believed that it would be possible one day to move to a phased restoration of parliamentary democracy.  In other words, they saw the dictatorship of the proletariat as a contingent, provisional thing.  After the Prague Spring, nobody thought that anymore.  It became obvious that it was just a means of keeping some people in power at the expense of everybody else.\nThe EU’s equivalent of the Prague Spring was the “No” votes of 2004 and 2005.  Nobody believes anymore that if only the question could be fairly put, then all the people would come around to it.  They’ve lost whatever ideological impetus they had, but they understand that their position in society depends upon their maintaining the status quo.  Since the “No” votes across the EU, Eurocrats have given up on the idea that their system will ever win approval. That’s what makes them so tetchy.\nGiven the authoritarian behavior of the EU bureaucracy, why has the Tory party been so reluctant to embrace popular euroskepticism?\nLike everyone in politics, I like to imagine that eventually I’ll convince everybody.  We haven’t got there yet, and the reason, I suspect, is because there is a small-c conservativism in the  big-C Conservative Party.  It’s not that they actually believe in a European superstate. It’s that they have this Burkeian instinct to try to work with the status quo, to prefer evolution to revolution.  And it’s very deep in their DNA, that.  It’s what they’ve been thinking ever since they went into politics.  No one would have wanted to start from where we are now.  No one would have gone from first principles into this ridiculous racket where we’re run by an unelected bureaucracy that passes 84 percent of our laws.  But, they don’t want to break the whole thing up.  They haven’t yet gotten into the mindset that the whole thing is beyond reform and that you need to just cut loose.  But I think we’ll get there in the end.\nDo you think an ongoing period of economic contraction will see the British people demand to leave the European Union?\nThey already do!  The latest opinion poll was conducted by the BBC a week ago, and showed that 55 per cent of voters want to leave the EU. It’s true that this position isn’t yet shared by any major political party, but that moment will come: politicians cannot swim forever against the current of public opinion.  If you offered a Swiss or Norwegian-style free trade deal, people would go for that with a large majority.\nWhich do you believe will be the first nation to attempt to leave the European Union? And will they be successful?\nI think it will be us.  Because we have a different political system, because we, like you, have a majoritarian system rather than a party list system, which means that politicians cannot so easily disregard their voters as happens under a proportional system.  It could happen really suddenly without anyone really planning for it.  To go back for a moment to your Soviet parallel, everyone used to say, how is this going to end?  Is there going to be some tremendous crisis, some earthquake that’s going to shake it down?  You remember what it was that brought it down in 1989?  It was the decision of the Hungarian government no longer to require exit visas from East Germans wanting to travel to Hungaria.  And before anybody knew where they were, the Wall was down and there was democracy.  It can happen very, very suddenly.  My guess is that it will probably happen in Britain first and we will go for some kind of EFTA-type deal, some kind of associate membership where we’re in a free market but outside all the rest of it.  And I think once we do that, once we set that precedent, a whole bunch of countries will be queuing up to copy.\nOne thing I have been paying attention to is the socionomics.  The Elliott Wave people always said that economic contraction tends to split things up, and I’ve been paying close attention to the EU because of that.\nYeah, it may well be that the Euro will fracture.  Really quite mainstream, serious people are now saying that it’s when rather than if a country leaves the single currency.\nIn your speech, you mentioned that one cannot spend one’s way out of a recession. This would appear to contradict the neo-Keynesian approach of Alastair Darling and the U.S. fiscal authorities. Do you subscribe to a different economic model?\nYes, certainly!  We saw where the Keynesian model led!  We pursued it from the 30s to the 70s.  And it ended up in recession, stagnation, inflation, and debt.  It’s much easier to begin a government program under the guise of counter-cyclical spending than it is to terminate it, so you end up with the st\nate becoming more and more bloated.  It’s a measure of how panicked people are, that they’ve forgotten all of the lessons of that unhappy period.  We can see where it ends up.  You don’t need to be an economist to understand that if you’re spending and borrowing too much, you should cut down rather than doing even more of it.  Sadly, it seems every nation has to learn these lessons for itself.\nWho are your intellectual influences with regards to economics?  Do you go all the way back to Smith?\nAbsolutely, I’m a very traditional Brit like this.  I’ve got two busts in my office.  One is Adam Smith, the other is Thomas Jefferson.\nOne thing that tends to confuse Americans is that the British National Party is not very popular despite holding what appear to be populist views on immigration and the European Union.  Why do they enjoy so little support compared to the three major parties?\nBecause they are, contrary to the way they are described in the BBC, a party of the far left.  They’re in favor of nationalization, they’re in favor of protectionism, they want workers’ councils to run industry, they want a massive state program of rebuilding manufacture.  Like Hayek said about the socialist roots of Nazism, they are a national socialist party and the socialist bit is very important to them.  Plus, there is a line, a very important line in politics, between being anti-immigration and anti-immigrant.  And they’ve crossed that line.\nIn a certain respect, they really are fascists, but in the Italian Fascist sense.\nYeah.  I think most of these so-called “far right” parties are on the left by any normal definition.  It’s a brilliant media trick in Europe to always refer to them as “the far right”.  The target of that is the mainstream right.  Every time you read about the BNP in the press, it’s always prefaced with “the far right BNP”, as though they were like us, but more so, which is the opposite of the case.  When somebody reads that, it doesn’t make them think any worse of the BNP, it makes them think worse of the right.  Which, of course, is why they do it.\nThe US president recently gave the Prime Minister a gift that consisted of 25 region-one DVDs that don’t work in Britain. How was this regarded there?\nBadly.  The guy is a complete idiot, Brown.  But he’s our complete idiot, and we don’t like to see him being slapped around like this.  That’s for us to do.\n(Laughs)  I have to admit, that sounds really funny coming from you!\nIn the same way, you can be ruder about your president than I would be.  The thing that really stuck in my craw was afterwards, when the White House said that he was just really tired because he was dealing with this financial crisis.  In November, I was in Afghanistan, in Helmand, where nobody else is touching this war, aside from us, and you, and a couple of Danes.  All the others are in the safe places.  And I guess the guys from Four and Five Commando and their forward operating bases are pretty tired as well.  It’s not an excuse.\nTo say nothing of the way that answer seems to ignore that Britain is experiencing its own economic difficulties.\nYeah, although it’s definitely the case that the two of them are using each other as cover on the economy, which makes it all the weirder that Obama didn’t bother to conceal his impatience when he had the meeting with Brown.\nSpeaking of Obama, you’ve expressed some sympathies for President Obama on your blog in the past. What is your perception of his performance to date? How has his stewardship of the economy been any different than Gordon Brown’s?\nI think his stewardship of the economy has been bad.  I think the Republican Party had been pretty bad in the run-up to this.  One of  the reasons why I had gone off the GOP, which I’m normally very loyal to, is because I could see them losing touch with all the things that used to make them so successful.  They had become the party of steel tariffs, and the party of trampling over states rights, particularly with the marriage amendment, they’d become the party of big spending and federal deficits, and in the end they became the party of bailouts and nationalizations.  One of the reasons I was in favor of Obama winning – without any great enthusiasm, I might add – is that I thought the Republicans would benefit from a period out of office where they could go back and remember what used to make them successful.  And so far, so good!  It is striking that an immediate consequence of the Obama presidency is that a lot of Republican congressmen who voted for the first spraying-around of money under Bush unanimously voted against the second one.  He’s already succeeded in uniting the GOP around a correct position.\nYou’re not just a journalist and author, but a politician as well. Have you given any thought to eventually running for Parliament in the UK?\nNo, not for the moment, anyway.  I’ll tell you why.  It’s not out of false modesty or anything.  We have a very, very weak parliament.  We have a much weaker legislature than you have, and it’s weaker than it’s ever been.  A measure of how weak it is is that we didn’t even have a vote on our bailouts, on our stimulus package.  It was just decreed by the executive.  You know, at least you guys got to talk about it, and the politicians who have to go back to face their voters got to decide.  Having fought a civil war in the UK to establish the principle that Parliament should be the only people who can raise tax, we’ve abandoned that principle and we’ve given the executive extraordinary powers to raise money as they choose.   One of the beauties of your system is that you have a proper separation of powers, so a legislator can make an honourable career for himself without wanting to join the executive. As things stand, that can’t happen in the British system. I’m very keen to import the most successful elements of your system – open primaries, elected sheriffs, a local sales tax, local referendums, the direct election of public officials – and I’ve written a book about how to do it called\nThe Plan: Twelve Months to Renew Britain\n.\nIn Britain, we are run by a massive bureaucracy, and the position of the elected person is incredibly weak and is getting weaker every day.  One of the reasons we are in this financial mess is that the budgets are set by members of the executive who are personal beneficiaries of state spending, rather than by the members of the legislature who are champions of the taxpayer.\nFor more from Daniel Hannan, check out\nhis Daily Telegraph blog\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-30T03:15:00+00:00"
}