{
  "url": "https://voxday.net/2009/03/02/interview-with-thomas-woods_02/",
  "scraped_at": "2026-01-08T22:49:31.602940",
  "title": "Interview with Thomas Woods",
  "date_display": "March 2, 2009",
  "date_iso": "2009-03-02T06:00:00+00:00",
  "date_from_url": "2009-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Vox Day interviewed Thomas Woods, the New York Times best-selling author of <i><a href=\"http://www.amazon.com/Meltdown-Free-Market-Collapsed-Government-Bailouts/dp/1596985879/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1235814729&amp;sr=8-1\">Meltdown: A Free-Market Look at Why the Stock Market Collapsed, the Economy Tanked, and Government Bailouts Will Make Things Worse</a></i>, on February 25th.</i></p><p><b>Congratulations on <i>Meltdown</i> hitting the bestseller lists.  Being the first to get this book out so soon after the September crash tends to indicate that you anticipated it.  You’re an Austrian economist, so did you find that Austrian theory helped you put the crises in context?</b></p><p>The book is in itself an Austrian analysis from start to finish.  For anyone who doesn’t know, the Austrian School of Economics is a free market school of economics that includes luminaries such as Ludwig von Mises and Friedrich von Hayek, the latter of whom won the Nobel Prize in 1974.  I would say the bulk of the economists who saw the crisis coming were Austrians.  There is no economic school of thought of which a higher proportion of economists were warning that the housing market was indeed experiencing a bubble, that it was going to burst, and that the rate of home price increases was unsustainable.  That was an Austrian warning.  So, I wrote the book because I could not stand listening to the conventional wisdom, day in and day out, telling me that this was all the fault of the free market so now we need the geniuses in Washington to fix everything for us.  That is just an obscenity.  It’s not even remotely close to what happened, and I assumed there would be a great many books coming out on the crisis that would misdiagnose the problem and  give us solutions that are worse than the problem itself, where the cure would be worse than the disease.  So, I wanted to take Austrian tools and tell the story first, be the first one out of the gates telling the story, before the avalanche of bad advice comes.</p><p><b>Some of the inevitable Keynesian books should be howlers.  Especially Paul Krugman’s.</b></p><p>Well, Krugman has a book out that purports to be up-to-date and address the current situation, but it’s  just a rehash of his old columns with a present-sounding title.  It’s just a gimmick.  Meltdown is actually about current events and was written as these events were taking place.</p><p><b>Yeah, I have the 1999 edition of <i>The Return of Depression Economics</i>.  I wonder if he took out the part where he declares that a global depression is unlikely in the future.  Now, when you say that the government created the housing bubble, are you also including the Federal Reserve?</b></p><p>In my chapter on the subject, I show there are a half-dozen contributing factors, and some of them are clearly government factors.  For example, Fannie Mae and Freddy Mac, which were quasi-public, quasi-private agencies whose exact status was not altogether clear to people.  But it was more or less taken for granted that they would be bailed out by taxpayers if it should come to that and they did get special privileges such as tax and regulatory breaks not available to anyone else in the housing market.  All of this added up to the incentive to take greater risks than a truly free market actor would take.  There’s been a lot of talk among conservatives about the Community Reinvestment Act, which was a Carter-era law that required banks to make loans against their best interests so as not to be sued for so-called discrimination.  On the Left, there’s been a lot of frustration that this act has been targeted [for helping cause the housing bubble].  They argue that since it dates back to Carter and the late 70s, how can it be blamed for this bubble 30 years later.  The answer is that the act didn’t really have enforcement teeth until the mid-1990s under Clinton.  It’s not like we’re just desperately looking around to blame the most irrelevant thing.</p><p>There are other factors too.  But as for the Fed, although it’s technically true that it is not a government agency, at the same time, I think it would be wrong to argue that it’s a purely private thing.  Again, we’re dealing with a weird amalgam of public and private.  The Fed was created by an act of Congress, its board is appointed by the U.S. government, and it enjoys monopoly privileges that are granted to it by the U.S. government.  So, it’s not a purely government agency but it’s dramatically different than any free market actor and would not have spontaneously come into existence under a free market system.   If it could have, Congress would not have needed to create it.</p><p><b>How long do you expect the current contraction to run and how big do you expect the decline to be in terms of GDP?</b></p><p>I know this will sound like a cop-out, but I don’t put much stock in economic forecasting.  It would be one thing if we had we a genuinely free market with no government involvement at all.  Then you might be able to make some kind of ballpark estimates.  But I have no idea what the Federal government is going to try!  It’s at least within the realm of possibility that the general public could become so angry that the Federal government changes course, tries something different, or stop continuing to attack the economy with a 2×4.  But I think it’s more likely that they’ll keep trying unprecedented things and that makes it very, very hard to predict how long this will go on.  I think the more they do that, the longer it will go on.  It spoke volumes when the Treasury Secretary said the other day that they are trying a lot of unprecedented things and that they hope these things work.  Because normally, Washington officials like to portray themselves as the great saviors of Mankind, that there’s nothing they can’t do.  For them to say they hope these things will work means they don’t know what they’re doing, and that doesn’t fill me with confidence.</p><p>So as not to avoid the question altogether, I think it is at least possible that we could have a stagnation as long as Japan’s, which was well over a decade.  Japan still had a little bit of anemic growth, but they also had a substantial pool of domestic savings to draw from and we don’t.  As some of my friends have said, we should be so lucky as to experience what happened to Japan.  And, of course, the U.S. government is following very closely all the policy prescriptions that were so disastrous for Japan.  In terms of GDP, I am critical of GDP as a metric to measure the economy, and I explain this in <i>Meltdown</i>.  The stimulus package could very well have a noticeable effect on GDP because all that government spending will be added to the sum total of goods and services.  It could very well lead to an uptick of GDP or at least mask the true situation by making the downturn look less severe.  If the government spends $100 on a $20 item, that increases the GDP by $100, so I think these figures mislead us, as they did in the 1940s.  They’ve misled generations of historians and economists into thinking the economy was booming during WWII, while the same set of statistics would force you to conclude that in 1946, the US had a terrible depression.  But as I show in the book, neither of these statements are true, and more scholars are finally figuring out that the alleged prosperity of the war years is really just an artifact of the statistical measures used, every one of which is completely unreliable.  There was no depression in 1946.</p><p><b>What are some of the other myths about the Great Depression?</b></p><p>We’re hearing almost every single one of them repeated.  We’re hearing myths that no reputable historian, regardless of his political allegiances, would repeat.  I cannot believe there are still people who believe that Herbert Hoover was a supporter of the free market who just sat back and allowed the depression to unfold before his eyes.  That’s just flatly false.  There’s no support for that whatsoever.  All throughout the 1920s, as Commerce Secretary, h<br> e was calling for all kinds of interventions into the economy.  In another of my books, I compile a number of his statements, including when he called the <i>laissez-faire</i> model a thing of the past and how everyone supported some kind of managed economy with public-private partnerships.  That was the way he spoke, that was the way he acted, and in <i>Meltdown</i> I give some examples of the things he did.   Another big myth is the idea that FDR lifted the country out of the Great Depression.  A third myth would be that the depression was caused by the free market and the lesson that should be learned from that is that we can’t allow that again.  In fact, we now have the same Federal Reserve activity and expansion of the money supply that leads to the Austrian boom-bust cycle.</br></p><p><b>The equity boom ended in 2000.  The housing boom ended in 2005.  Which sector do you expect to recover first?</b></p><p>I really don’t know.  Maybe a better economist than I am might know that.  Unfortunately, the collapse in housing affects practically everything, and not just because of all the securitized mortgage debts that are held by so many investors and institutions, but also because of everything that goes into a house.  The appliances, the raw materials, the building supplies, and the trucking and shipping services required to move those things across the country; all those things are affected.  So, I honestly don’t know, but here’s my suspicion:  Retail outlets that cater to basic consumer needs will do relatively well.  Starbucks will suffer.  No one wants to pay five bucks for a cup of coffee anymore.  But a more no-frills type of outfit will tend to do better.  Full-service hair salons will suffer more than a chain like Great Clips.  If you’re supplying something that people need, in a no-frills, no-luxury manner, then you might come out relatively okay here.  Anybody who is producing a product that relies on an unending stream of consumer credit is going to be disproportionately hurt.  Those sectors whose business models take those things into account should be relatively healthy.  I know that may seem obvious, but perhaps some people don’t see that.</p><p><b>It’s conventional wisdom that the Smoot-Hawley tariff contributed greatly to the Great Depression, but how does that make sense given that imports were only 5.1 percent of the US economy and the balance of trade’s contribution to GDP was a negative 1.1 percent in 1929?</b></p><p>I don’t think it did play a big role.  I think those who think of themselves as free market economists have exaggerated the importance of Smoot-Hawley.  It didn’t help; anything that shrinks the extent of the division of labor is going to have an impoverishing effect, so it didn’t help.  Part of the reason so much emphasis has been placed on Smoot-Hawley is that there are some free market economists who are operating without the benefit of Austrian trade cycle theory.  At the same time, they know they don’t want to blame the free market but they don’t have a coherent explanation for what happened.  So, they flounder around, looking for this or that form of government intervention to explain why this downturn occurred.  For example, I was very much an admirer of the late Jude Wanniski, who had a lot of important things to say on a lot of important matters, but his view of the depression was that it was taxes and tariffs that caused it.  I think because he was not an Austrian, he had no other explanation so he had to revert to blaming the Smoot-Hawley tariff.  But I think you’re right, it alone couldn’t possibly have account for the depths of what people witnessed.</p><p><b>International free trade is an Austrian hallmark, but how is comparative advantage which, as Ricardo demonstrated, has the benefit of raising the overall level of global wealth, desirable for the very small subset of the global population which lives in the United States, especially since there will be a significant amount of economic harm meted out to the even smaller subset of the US population that will lose their jobs to global competition? </b></p><p>I’m afraid I’m going to give an unsatisfactory answer here, because this is something I want to think through at greater length.  You’re right, the developing countries have a lot farther to go in terms of material well-being, and they stand, in effect, to gain the most by their contacts with the West.  Whereas we’re at a relatively high level of economic development; how much higher can these interactions with these countries make us go?  Now, I know people speak almost contemptuously about inexpensive consumer goods coming from China, and there is something funny going on with exchange rate there, but still, China can produce an awful lot of goods very inexpensively.  Because Americans can now acquire a lot of these necessary goods inexpensively, it means they now have the financial wherewithal to purchase additional goods they couldn’t have purchased otherwise.  I don’t know what these additional goods are going to turn out to be, but somebody is going to produce them.  In other words, by increasing Americans’ purchasing power, they open up the prospect of more employment and more lines of production.  We get a lot of whining and moaning from the textile industry, but I happen to think it’s a good thing that poor people can get inexpensive clothing for their kids and they also have money left over for food.  I have this feeling that I’m not really getting to the heart of your question, but that’s how I normally think about the mutual benefit that comes about as a result of international trade.</p></div>",
  "content_text": "Vox Day interviewed Thomas Woods, the New York Times best-selling author of\nMeltdown: A Free-Market Look at Why the Stock Market Collapsed, the Economy Tanked, and Government Bailouts Will Make Things Worse\n, on February 25th.\nCongratulations on\nMeltdown\nhitting the bestseller lists.  Being the first to get this book out so soon after the September crash tends to indicate that you anticipated it.  You’re an Austrian economist, so did you find that Austrian theory helped you put the crises in context?\nThe book is in itself an Austrian analysis from start to finish.  For anyone who doesn’t know, the Austrian School of Economics is a free market school of economics that includes luminaries such as Ludwig von Mises and Friedrich von Hayek, the latter of whom won the Nobel Prize in 1974.  I would say the bulk of the economists who saw the crisis coming were Austrians.  There is no economic school of thought of which a higher proportion of economists were warning that the housing market was indeed experiencing a bubble, that it was going to burst, and that the rate of home price increases was unsustainable.  That was an Austrian warning.  So, I wrote the book because I could not stand listening to the conventional wisdom, day in and day out, telling me that this was all the fault of the free market so now we need the geniuses in Washington to fix everything for us.  That is just an obscenity.  It’s not even remotely close to what happened, and I assumed there would be a great many books coming out on the crisis that would misdiagnose the problem and  give us solutions that are worse than the problem itself, where the cure would be worse than the disease.  So, I wanted to take Austrian tools and tell the story first, be the first one out of the gates telling the story, before the avalanche of bad advice comes.\nSome of the inevitable Keynesian books should be howlers.  Especially Paul Krugman’s.\nWell, Krugman has a book out that purports to be up-to-date and address the current situation, but it’s  just a rehash of his old columns with a present-sounding title.  It’s just a gimmick.  Meltdown is actually about current events and was written as these events were taking place.\nYeah, I have the 1999 edition of\nThe Return of Depression Economics\n.  I wonder if he took out the part where he declares that a global depression is unlikely in the future.  Now, when you say that the government created the housing bubble, are you also including the Federal Reserve?\nIn my chapter on the subject, I show there are a half-dozen contributing factors, and some of them are clearly government factors.  For example, Fannie Mae and Freddy Mac, which were quasi-public, quasi-private agencies whose exact status was not altogether clear to people.  But it was more or less taken for granted that they would be bailed out by taxpayers if it should come to that and they did get special privileges such as tax and regulatory breaks not available to anyone else in the housing market.  All of this added up to the incentive to take greater risks than a truly free market actor would take.  There’s been a lot of talk among conservatives about the Community Reinvestment Act, which was a Carter-era law that required banks to make loans against their best interests so as not to be sued for so-called discrimination.  On the Left, there’s been a lot of frustration that this act has been targeted [for helping cause the housing bubble].  They argue that since it dates back to Carter and the late 70s, how can it be blamed for this bubble 30 years later.  The answer is that the act didn’t really have enforcement teeth until the mid-1990s under Clinton.  It’s not like we’re just desperately looking around to blame the most irrelevant thing.\nThere are other factors too.  But as for the Fed, although it’s technically true that it is not a government agency, at the same time, I think it would be wrong to argue that it’s a purely private thing.  Again, we’re dealing with a weird amalgam of public and private.  The Fed was created by an act of Congress, its board is appointed by the U.S. government, and it enjoys monopoly privileges that are granted to it by the U.S. government.  So, it’s not a purely government agency but it’s dramatically different than any free market actor and would not have spontaneously come into existence under a free market system.   If it could have, Congress would not have needed to create it.\nHow long do you expect the current contraction to run and how big do you expect the decline to be in terms of GDP?\nI know this will sound like a cop-out, but I don’t put much stock in economic forecasting.  It would be one thing if we had we a genuinely free market with no government involvement at all.  Then you might be able to make some kind of ballpark estimates.  But I have no idea what the Federal government is going to try!  It’s at least within the realm of possibility that the general public could become so angry that the Federal government changes course, tries something different, or stop continuing to attack the economy with a 2×4.  But I think it’s more likely that they’ll keep trying unprecedented things and that makes it very, very hard to predict how long this will go on.  I think the more they do that, the longer it will go on.  It spoke volumes when the Treasury Secretary said the other day that they are trying a lot of unprecedented things and that they hope these things work.  Because normally, Washington officials like to portray themselves as the great saviors of Mankind, that there’s nothing they can’t do.  For them to say they hope these things will work means they don’t know what they’re doing, and that doesn’t fill me with confidence.\nSo as not to avoid the question altogether, I think it is at least possible that we could have a stagnation as long as Japan’s, which was well over a decade.  Japan still had a little bit of anemic growth, but they also had a substantial pool of domestic savings to draw from and we don’t.  As some of my friends have said, we should be so lucky as to experience what happened to Japan.  And, of course, the U.S. government is following very closely all the policy prescriptions that were so disastrous for Japan.  In terms of GDP, I am critical of GDP as a metric to measure the economy, and I explain this in\nMeltdown\n.  The stimulus package could very well have a noticeable effect on GDP because all that government spending will be added to the sum total of goods and services.  It could very well lead to an uptick of GDP or at least mask the true situation by making the downturn look less severe.  If the government spends $100 on a $20 item, that increases the GDP by $100, so I think these figures mislead us, as they did in the 1940s.  They’ve misled generations of historians and economists into thinking the economy was booming during WWII, while the same set of statistics would force you to conclude that in 1946, the US had a terrible depression.  But as I show in the book, neither of these statements are true, and more scholars are finally figuring out that the alleged prosperity of the war years is really just an artifact of the statistical measures used, every one of which is completely unreliable.  There was no depression in 1946.\nWhat are some of the other myths about the Great Depression?\nWe’re hearing almost every single one of them repeated.  We’re hearing myths that no reputable historian, regardless of his political allegiances, would repeat.  I cannot believe there are still people who believe that Herbert Hoover was a supporter of the free market who just sat back and allowed the depression to unfold before his eyes.  That’s just flatly false.  There’s no support for that whatsoever.  All throughout the 1920s, as Commerce Secretary, h\ne was calling for all kinds of interventions into the economy.  In another of my books, I compile a number of his statements, including when he called the\nlaissez-faire\nmodel a thing of the past and how everyone supported some kind of managed economy with public-private partnerships.  That was the way he spoke, that was the way he acted, and in\nMeltdown\nI give some examples of the things he did.   Another big myth is the idea that FDR lifted the country out of the Great Depression.  A third myth would be that the depression was caused by the free market and the lesson that should be learned from that is that we can’t allow that again.  In fact, we now have the same Federal Reserve activity and expansion of the money supply that leads to the Austrian boom-bust cycle.\nThe equity boom ended in 2000.  The housing boom ended in 2005.  Which sector do you expect to recover first?\nI really don’t know.  Maybe a better economist than I am might know that.  Unfortunately, the collapse in housing affects practically everything, and not just because of all the securitized mortgage debts that are held by so many investors and institutions, but also because of everything that goes into a house.  The appliances, the raw materials, the building supplies, and the trucking and shipping services required to move those things across the country; all those things are affected.  So, I honestly don’t know, but here’s my suspicion:  Retail outlets that cater to basic consumer needs will do relatively well.  Starbucks will suffer.  No one wants to pay five bucks for a cup of coffee anymore.  But a more no-frills type of outfit will tend to do better.  Full-service hair salons will suffer more than a chain like Great Clips.  If you’re supplying something that people need, in a no-frills, no-luxury manner, then you might come out relatively okay here.  Anybody who is producing a product that relies on an unending stream of consumer credit is going to be disproportionately hurt.  Those sectors whose business models take those things into account should be relatively healthy.  I know that may seem obvious, but perhaps some people don’t see that.\nIt’s conventional wisdom that the Smoot-Hawley tariff contributed greatly to the Great Depression, but how does that make sense given that imports were only 5.1 percent of the US economy and the balance of trade’s contribution to GDP was a negative 1.1 percent in 1929?\nI don’t think it did play a big role.  I think those who think of themselves as free market economists have exaggerated the importance of Smoot-Hawley.  It didn’t help; anything that shrinks the extent of the division of labor is going to have an impoverishing effect, so it didn’t help.  Part of the reason so much emphasis has been placed on Smoot-Hawley is that there are some free market economists who are operating without the benefit of Austrian trade cycle theory.  At the same time, they know they don’t want to blame the free market but they don’t have a coherent explanation for what happened.  So, they flounder around, looking for this or that form of government intervention to explain why this downturn occurred.  For example, I was very much an admirer of the late Jude Wanniski, who had a lot of important things to say on a lot of important matters, but his view of the depression was that it was taxes and tariffs that caused it.  I think because he was not an Austrian, he had no other explanation so he had to revert to blaming the Smoot-Hawley tariff.  But I think you’re right, it alone couldn’t possibly have account for the depths of what people witnessed.\nInternational free trade is an Austrian hallmark, but how is comparative advantage which, as Ricardo demonstrated, has the benefit of raising the overall level of global wealth, desirable for the very small subset of the global population which lives in the United States, especially since there will be a significant amount of economic harm meted out to the even smaller subset of the US population that will lose their jobs to global competition?\nI’m afraid I’m going to give an unsatisfactory answer here, because this is something I want to think through at greater length.  You’re right, the developing countries have a lot farther to go in terms of material well-being, and they stand, in effect, to gain the most by their contacts with the West.  Whereas we’re at a relatively high level of economic development; how much higher can these interactions with these countries make us go?  Now, I know people speak almost contemptuously about inexpensive consumer goods coming from China, and there is something funny going on with exchange rate there, but still, China can produce an awful lot of goods very inexpensively.  Because Americans can now acquire a lot of these necessary goods inexpensively, it means they now have the financial wherewithal to purchase additional goods they couldn’t have purchased otherwise.  I don’t know what these additional goods are going to turn out to be, but somebody is going to produce them.  In other words, by increasing Americans’ purchasing power, they open up the prospect of more employment and more lines of production.  We get a lot of whining and moaning from the textile industry, but I happen to think it’s a good thing that poor people can get inexpensive clothing for their kids and they also have money left over for food.  I have this feeling that I’m not really getting to the heart of your question, but that’s how I normally think about the mutual benefit that comes about as a result of international trade.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-02T06:00:00+00:00"
}