{
  "url": "https://voxday.net/2009/03/07/irrational-you-say/",
  "scraped_at": "2026-01-08T22:50:09.830173",
  "title": "Irrational, you say?",
  "date_display": "March 7, 2009",
  "date_iso": "2009-03-07T21:30:00+00:00",
  "date_from_url": "2009-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those who have read TIA already know my position on the matter.  However, I tend to doubt those who attempted to belittle the notion when they encountered it in TIA will understand how it is intimately connected to my skeptical view of <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/02/06/AR2009020602742.html?sub=AR\">rational man theory</a>:</p><blockquote><p>“The rational man theory of economics has not worked,” Roubini said last month at a session of the World Economic Forum at Davos. That’s why he and other prominent economists are paying more attention to behavioral economics, which starts from the premise that economic decisions, like other aspects of human behavior, are influenced by irrational psychological factors.</p><p>The most compelling rebuttal of the rational model, paradoxically, was delivered by the ultimate rationalist, Alan Greenspan. “I made a mistake in presuming that the self-interests of organizations, specifically banks and others, were such that they were best capable of protecting their own shareholders,” the former Fed chairman told Congress last October.</p><p>That’s why Greenspan didn’t see it coming, argues Daniel Kahneman, a Princeton professor who is often described as the father of behavioral economics. His rational-actor model wouldn’t let him.</p></blockquote><p>The huge chasm between the rational actors required for so many economic models and the actual behavior of acting individuals has long bothered me.  But I don’t see how John Maynard Keynes can be reasonably described as the father of behavioral economics, as a few vague references to animals spirits and and liquidity preferences are not integral to his economic model in the way Ludwig von Mises’s conceptions laid out in <i>Human Action</i> are.</p><p>But regardless of whether one turns to praxeology or empirical evidence, it’s not difficult to determine that the rational man theory of economics is deeply flawed to the point of irrelevance.</p><p>Mises, however, will somewhat confuse journalists as he argues that it is a fallacy to describe objectively sub-optimal decisions as “irrational”, because an acting man’s decision may well be perfectly rational from his perspective and in light of his objectives.  But it’s encouraging to see that the mainstream is finally beginning to cast a skeptical eye on the idea that economic actors are absolutely rational in the conventional sense of the word.</p></div>",
  "content_text": "Those who have read TIA already know my position on the matter.  However, I tend to doubt those who attempted to belittle the notion when they encountered it in TIA will understand how it is intimately connected to my skeptical view of\nrational man theory\n:\n“The rational man theory of economics has not worked,” Roubini said last month at a session of the World Economic Forum at Davos. That’s why he and other prominent economists are paying more attention to behavioral economics, which starts from the premise that economic decisions, like other aspects of human behavior, are influenced by irrational psychological factors.\nThe most compelling rebuttal of the rational model, paradoxically, was delivered by the ultimate rationalist, Alan Greenspan. “I made a mistake in presuming that the self-interests of organizations, specifically banks and others, were such that they were best capable of protecting their own shareholders,” the former Fed chairman told Congress last October.\nThat’s why Greenspan didn’t see it coming, argues Daniel Kahneman, a Princeton professor who is often described as the father of behavioral economics. His rational-actor model wouldn’t let him.\nThe huge chasm between the rational actors required for so many economic models and the actual behavior of acting individuals has long bothered me.  But I don’t see how John Maynard Keynes can be reasonably described as the father of behavioral economics, as a few vague references to animals spirits and and liquidity preferences are not integral to his economic model in the way Ludwig von Mises’s conceptions laid out in\nHuman Action\nare.\nBut regardless of whether one turns to praxeology or empirical evidence, it’s not difficult to determine that the rational man theory of economics is deeply flawed to the point of irrelevance.\nMises, however, will somewhat confuse journalists as he argues that it is a fallacy to describe objectively sub-optimal decisions as “irrational”, because an acting man’s decision may well be perfectly rational from his perspective and in light of his objectives.  But it’s encouraging to see that the mainstream is finally beginning to cast a skeptical eye on the idea that economic actors are absolutely rational in the conventional sense of the word.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-07T21:30:00+00:00"
}