{
  "url": "https://voxday.net/2009/03/03/its-not-just-policymakers/",
  "scraped_at": "2026-01-08T22:49:38.859742",
  "title": "It’s not just the policymakers",
  "date_display": "March 3, 2009",
  "date_iso": "2009-03-03T10:32:00+00:00",
  "date_from_url": "2009-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Our favorite Nobel Prize-winning neokeyn avoids <a href=\"http://krugman.blogs.nytimes.com/2009/03/02/failing-the-test/#more-1483\">looking in the mirror</a>:</p><blockquote><p>The sickening feeling of drift — the sense that policymakers are refusing to face hard facts, and are dithering while the world economy burns — just keeps getting stronger.</p></blockquote><p>The amusing thing is that by Krugman’s latest reckoning – it’s <a href=\"http://www.nytimes.com/2009/03/02/opinion/02krugman.html?_r=1\">the dirty little yellow people’s fault</a> – there’s nothing that the US authorities can really do anyhow, except convince Asian governments to spend money on… something besides the US Treasuries that the US authorities are currently begging them to buy.  This makes absolutely no sense, of course, nor does it have much, if anything, to do with Krugman’s previous theories of the crisis, but then, what can an economist do when his economic model is broken.  Again.</p><p>It’s worth noting in passing that <a href=\"http://norris.blogs.nytimes.com/2009/03/02/the-return-to-irrational-exuberance/?hp\">the Age of Irrational Exuberance is officially over</a>.  The S&amp;P 500 closed at 700.82 yesterday, well below the 744.38 that inspired Alan Greenspan’s famously feeble admonition of December 5, 1996.</p></div>",
  "content_text": "Our favorite Nobel Prize-winning neokeyn avoids\nlooking in the mirror\n:\nThe sickening feeling of drift — the sense that policymakers are refusing to face hard facts, and are dithering while the world economy burns — just keeps getting stronger.\nThe amusing thing is that by Krugman’s latest reckoning – it’s\nthe dirty little yellow people’s fault\n– there’s nothing that the US authorities can really do anyhow, except convince Asian governments to spend money on… something besides the US Treasuries that the US authorities are currently begging them to buy.  This makes absolutely no sense, of course, nor does it have much, if anything, to do with Krugman’s previous theories of the crisis, but then, what can an economist do when his economic model is broken.  Again.\nIt’s worth noting in passing that\nthe Age of Irrational Exuberance is officially over\n.  The S&P 500 closed at 700.82 yesterday, well below the 744.38 that inspired Alan Greenspan’s famously feeble admonition of December 5, 1996.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-03T10:32:00+00:00"
}