{
  "url": "https://voxday.net/2009/03/27/journolist-insects-scuttle/",
  "scraped_at": "2026-01-08T22:51:51.593968",
  "title": "JournoList: the insects scuttle",
  "date_display": "March 27, 2009",
  "date_iso": "2009-03-27T08:23:00+00:00",
  "date_from_url": "2009-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mickey Kaus <a href=\"http://www.slate.com/blogs/blogs/kausfiles/archive/2009/03/26/journolist-revealed-inside-the-liberal-media-email-cabal.aspx\">sheds a little light</a> on the secret Internet media clubhouse:</p><blockquote><p>From: Jonathan Chait  Date: Tue, 24 Mar 2009 11:27:59 -0700 (PDT) Local: Tues, Mar 24 2009 2:27 pm Subject: Re: BREAKING: Marty Peretz is a Crazy-Ass Racist</p><p>Perhaps, if his work is going to be brought up here  2 or 3 times a week, he should be invited on the list. Or is the point of this to create a forum where certain people can be criticized (or, more precisely, called names) without the criticizer having to fear a response? I do recall Eric Alterman going after Eve Fairbanks, and then — when Eve mounted a defense — confessing that he didn’t know<br>she was on the list, and only criticized her because he thought he was speaking behind her back…  There seems to be a junior high quality to this list with regard to TNR, where if you’re not on it you get sniped at constantly, but if you are on it you’re mostly safe.</br></p></blockquote><p>What I find particularly amusing is the way Chait’s response highlights something that we have seen time and time again at left-leaning sites.  It’s increasingly clear that very few individuals of a left-liberal persuasion have any ability to distinguish between <i>criticism</i> and <i>name-calling</i>.  This explains why I can write a detailed critique ennumerating the specific flaws in Richard Dawkins’s central argument and his defenders will describe it as nothing but an <i>ad hominem</i> attack.  It also explains how diatribes directed at my posts and columns which consist of little more than “LOL… so stupid… pwned!” and don’t address any of the relevant points are genuinely regarded as comprehensive and effective rebuttals.</p></div>",
  "content_text": "Mickey Kaus\nsheds a little light\non the secret Internet media clubhouse:\nFrom: Jonathan Chait  Date: Tue, 24 Mar 2009 11:27:59 -0700 (PDT) Local: Tues, Mar 24 2009 2:27 pm Subject: Re: BREAKING: Marty Peretz is a Crazy-Ass Racist\nPerhaps, if his work is going to be brought up here  2 or 3 times a week, he should be invited on the list. Or is the point of this to create a forum where certain people can be criticized (or, more precisely, called names) without the criticizer having to fear a response? I do recall Eric Alterman going after Eve Fairbanks, and then — when Eve mounted a defense — confessing that he didn’t know\nshe was on the list, and only criticized her because he thought he was speaking behind her back…  There seems to be a junior high quality to this list with regard to TNR, where if you’re not on it you get sniped at constantly, but if you are on it you’re mostly safe.\nWhat I find particularly amusing is the way Chait’s response highlights something that we have seen time and time again at left-leaning sites.  It’s increasingly clear that very few individuals of a left-liberal persuasion have any ability to distinguish between\ncriticism\nand\nname-calling\n.  This explains why I can write a detailed critique ennumerating the specific flaws in Richard Dawkins’s central argument and his defenders will describe it as nothing but an\nad hominem\nattack.  It also explains how diatribes directed at my posts and columns which consist of little more than “LOL… so stupid… pwned!” and don’t address any of the relevant points are genuinely regarded as comprehensive and effective rebuttals.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-27T08:23:00+00:00"
}