{
  "url": "https://voxday.net/2009/03/13/mailvox-dystropia/",
  "scraped_at": "2026-01-08T22:50:39.306323",
  "title": "Mailvox: Dystropia",
  "date_display": "March 13, 2009",
  "date_iso": "2009-03-13T16:03:00+00:00",
  "date_from_url": "2009-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NW inquires:</p><blockquote><p>[W]as wondering how much economics in fiction snap your suspension of disbelief? (like we were talking about women warriors) Does <a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/YouFailEconomicsForever\">You Fail Economics Forever</a> cover it or are there some economic fails that really bother you?  What are some of the best econs in fiction you’ve seen/read and what are some of the worst?  One more thing:  What ruins your enjoyment most about a story?  Economics?  Computers?  Combat?  What?  Example: I can just go along with almost anything but a major, MAJOR basic biology blunder or Christian theology research failure really take me out of the story.</p></blockquote><p>That’s an interesting question.  I think, for the most part, my expectation of authors possessing even a modicum of economics knowledge is so low that their general ignorance of it doesn’t bother me.  On the rare occasions that an author bothers to at least explain why he is violating the basic principles of the science – as Charles Stross with his explicit positing of a society that is post-scarcity in <i>Accelerando</i>, for example – I find myself merely nodding in appreciation.  The two best takes on economics that I have ever read in genre novels are Terry Pratchett in <i>Making Money</i> and <i>Going Postal</i>.  His understanding of money, in particular, is entirely conventional, i.e. incorrect, but it is an educated perspective.  And his take on the dot com boom is really well done.  However, there’s no question that far and away the best economics reference in fiction is an obscure short story by Charles Stross, entitled “Bear Trap”.  It’s found in <i>Toast</i>, in case you’re interested, and it’s a remarkable achievement.</p><p>There are two things I find peculiar about religion in genre literature.  The first is the very common, and historically inept, attempt to assign a religious cause to their fictional wars.  The fact that irreligious writers are seldom able to write convincingly about religion or religious characters only makes this ineptitude all the more noticeable.  The second thing is the amusingly stupid way irreligious writers often like to assume that religious individuals don’t know the first thing about their own religion.  For example, rather early on in his <i>Old Man’s War</i>, John Scalzi features the irreligious protagonist publicly schooling a <s>cardboard cutout</s>religious bigot courtesy of his superior knowledge of the Bible.  As with the movies, where the guy with the six-shot pistol always trumps the guy with the full-auto machine gun, the bazooka, and the flamethrower, in science fiction and fantasy, it’s always the non-believer who knows the tenets of a religion better than the individual who actually takes them seriously and attempts to put them into practice.  Amusingly, the section of the Bible that is usually supposed to be completely unknown to the believer is the stoning of the adulterous woman… and the authors inevitably leave off the rather important bit about “go forth and sin no more.”</p><p>It makes one wonder what these secular authors believe is being studied in all those weekly Bible studies across the country… it’s rather like reading Dawkins where he expects the reader to be shocked by the savagery in the Old Testament, when every kid who’s ever been to Sunday School knows all about Passover, the Red Sea, and the walls of Jericho.</p><p>But I find those things more amusing than annoying.  Why would one take offense at someone else’s cluelessness?  What I actually find extremely irritating is the way that very few writers these days appears to be capable of grasping basic human sexual relations.  In the real world, men pursue and women allow themselves to be caught if they are amenable.  In the vast majority of fictional worlds, men are wide-eyed innocents who wouldn’t even think to be attracted to a super-hot woman and are dumbfounded when she is inexplicably overcome with immediate lust for them… after which encounter, a long-term relationship immediately ensues.  I think this is because most male writers are overweight wallflowers who have never successfully pursued a woman, so they simply don’t have any experience of normal human sexual patterns.  Even those who are married often appear to be relationship betas who proposed to the first woman to show interest in them; although I often make fun of wereseal fiction – and with good reason – at least the women who write it appear to be capable of grasping the very simple matter of which sex is chiefly responsible for pursuing the other.</p></div>",
  "content_text": "NW inquires:\n[W]as wondering how much economics in fiction snap your suspension of disbelief? (like we were talking about women warriors) Does\nYou Fail Economics Forever\ncover it or are there some economic fails that really bother you?  What are some of the best econs in fiction you’ve seen/read and what are some of the worst?  One more thing:  What ruins your enjoyment most about a story?  Economics?  Computers?  Combat?  What?  Example: I can just go along with almost anything but a major, MAJOR basic biology blunder or Christian theology research failure really take me out of the story.\nThat’s an interesting question.  I think, for the most part, my expectation of authors possessing even a modicum of economics knowledge is so low that their general ignorance of it doesn’t bother me.  On the rare occasions that an author bothers to at least explain why he is violating the basic principles of the science – as Charles Stross with his explicit positing of a society that is post-scarcity in\nAccelerando\n, for example – I find myself merely nodding in appreciation.  The two best takes on economics that I have ever read in genre novels are Terry Pratchett in\nMaking Money\nand\nGoing Postal\n.  His understanding of money, in particular, is entirely conventional, i.e. incorrect, but it is an educated perspective.  And his take on the dot com boom is really well done.  However, there’s no question that far and away the best economics reference in fiction is an obscure short story by Charles Stross, entitled “Bear Trap”.  It’s found in\nToast\n, in case you’re interested, and it’s a remarkable achievement.\nThere are two things I find peculiar about religion in genre literature.  The first is the very common, and historically inept, attempt to assign a religious cause to their fictional wars.  The fact that irreligious writers are seldom able to write convincingly about religion or religious characters only makes this ineptitude all the more noticeable.  The second thing is the amusingly stupid way irreligious writers often like to assume that religious individuals don’t know the first thing about their own religion.  For example, rather early on in his\nOld Man’s War\n, John Scalzi features the irreligious protagonist publicly schooling a\ncardboard cutout\nreligious bigot courtesy of his superior knowledge of the Bible.  As with the movies, where the guy with the six-shot pistol always trumps the guy with the full-auto machine gun, the bazooka, and the flamethrower, in science fiction and fantasy, it’s always the non-believer who knows the tenets of a religion better than the individual who actually takes them seriously and attempts to put them into practice.  Amusingly, the section of the Bible that is usually supposed to be completely unknown to the believer is the stoning of the adulterous woman… and the authors inevitably leave off the rather important bit about “go forth and sin no more.”\nIt makes one wonder what these secular authors believe is being studied in all those weekly Bible studies across the country… it’s rather like reading Dawkins where he expects the reader to be shocked by the savagery in the Old Testament, when every kid who’s ever been to Sunday School knows all about Passover, the Red Sea, and the walls of Jericho.\nBut I find those things more amusing than annoying.  Why would one take offense at someone else’s cluelessness?  What I actually find extremely irritating is the way that very few writers these days appears to be capable of grasping basic human sexual relations.  In the real world, men pursue and women allow themselves to be caught if they are amenable.  In the vast majority of fictional worlds, men are wide-eyed innocents who wouldn’t even think to be attracted to a super-hot woman and are dumbfounded when she is inexplicably overcome with immediate lust for them… after which encounter, a long-term relationship immediately ensues.  I think this is because most male writers are overweight wallflowers who have never successfully pursued a woman, so they simply don’t have any experience of normal human sexual patterns.  Even those who are married often appear to be relationship betas who proposed to the first woman to show interest in them; although I often make fun of wereseal fiction – and with good reason – at least the women who write it appear to be capable of grasping the very simple matter of which sex is chiefly responsible for pursuing the other.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-13T16:03:00+00:00"
}