{
  "url": "https://voxday.net/2009/03/18/mailvox-try-not-to-behead-anyone/",
  "scraped_at": "2026-01-08T22:51:01.222275",
  "title": "Mailvox: try not to behead anyone",
  "date_display": "March 18, 2009",
  "date_iso": "2009-03-18T08:49:00+00:00",
  "date_from_url": "2009-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always find it quite funny when an atheist declares that he just couldn’t manage to read <i><a href=\"http://irrationalatheist.com/downloads.html\">The Irrational Atheist</a></i>, as if this is some sort of meaningful criticism.  Do they really not realize that this says absolutely nothing about the book, that it is simply an open admission of their own incapacity?  GP emails:</p><blockquote><p>i was unable to read beyond page 6 because it became obvious that you have only one agenda and that is to push and promote your christian views. you are saying that your book is not a religious book but you are lying. you have no interest in any scientific discussion. therefore, i will say with disgust: ” take your christian god (all three of them) and shove it up your ass” maybe islam can offer me more.</p></blockquote><p>Six pages into <i>The God Delusion</i>, Richard Dawkins is still rambling about Albert Einstein.  Six pages into <i>The End of Faith</i>, Sam Harris is pontificating about a continuum of faith and laying the foundation for his illogical argument that the moderates of one religion are somehow responsible for the behavior of another religion’s extremists.  Six pages into <i>god is Not Great</i> Christopher Hitchens is declaring that he doesn’t need anyone policing his behavior, something his recent companions in Syria would probably dispute.  Just as no one could possibly respect the opinion of the Christian who blew off the New Atheist books after six pages due to this nonsense, to say nothing of their obvious agenda to push and promote their atheist views, no one can possibly respect the opinion of the atheist who does likewise with regard to my book, or, for that matter, any other book.</p><p>Needless to say, GP is not only godless, he’s also clueless.  I never claimed TIA did not have a religious theme or that I have no agenda, I merely stated, correctly, that the book is not a theological work and contains no arguments for God’s existence.  Or arguments for intelligent design, Young Earth Creationism, or any of the many things that most atheists would much rather discuss than the many obvious logical and factual flaws in the New Atheists’ arguments.  As for my supposed non-interest in scientific discussion, GP would be hard-pressed to explain chapters two and three, Defining Science and The Case Against Science.</p><p>Of course, he wouldn’t know about them, having only read to page six.  And while I wish GP good fortune in his future religious endeavors, I’d be very surprised if he made it through The Cow.</p></div>",
  "content_text": "I always find it quite funny when an atheist declares that he just couldn’t manage to read\nThe Irrational Atheist\n, as if this is some sort of meaningful criticism.  Do they really not realize that this says absolutely nothing about the book, that it is simply an open admission of their own incapacity?  GP emails:\ni was unable to read beyond page 6 because it became obvious that you have only one agenda and that is to push and promote your christian views. you are saying that your book is not a religious book but you are lying. you have no interest in any scientific discussion. therefore, i will say with disgust: ” take your christian god (all three of them) and shove it up your ass” maybe islam can offer me more.\nSix pages into\nThe God Delusion\n, Richard Dawkins is still rambling about Albert Einstein.  Six pages into\nThe End of Faith\n, Sam Harris is pontificating about a continuum of faith and laying the foundation for his illogical argument that the moderates of one religion are somehow responsible for the behavior of another religion’s extremists.  Six pages into\ngod is Not Great\nChristopher Hitchens is declaring that he doesn’t need anyone policing his behavior, something his recent companions in Syria would probably dispute.  Just as no one could possibly respect the opinion of the Christian who blew off the New Atheist books after six pages due to this nonsense, to say nothing of their obvious agenda to push and promote their atheist views, no one can possibly respect the opinion of the atheist who does likewise with regard to my book, or, for that matter, any other book.\nNeedless to say, GP is not only godless, he’s also clueless.  I never claimed TIA did not have a religious theme or that I have no agenda, I merely stated, correctly, that the book is not a theological work and contains no arguments for God’s existence.  Or arguments for intelligent design, Young Earth Creationism, or any of the many things that most atheists would much rather discuss than the many obvious logical and factual flaws in the New Atheists’ arguments.  As for my supposed non-interest in scientific discussion, GP would be hard-pressed to explain chapters two and three, Defining Science and The Case Against Science.\nOf course, he wouldn’t know about them, having only read to page six.  And while I wish GP good fortune in his future religious endeavors, I’d be very surprised if he made it through The Cow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-18T08:49:00+00:00"
}