{
  "url": "https://voxday.net/2009/03/18/myth-squared/",
  "scraped_at": "2026-01-08T22:51:03.066466",
  "title": "Myth squared",
  "date_display": "March 18, 2009",
  "date_iso": "2009-03-18T13:30:00+00:00",
  "date_from_url": "2009-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://2.bp.blogspot.com/_3UXl0oMYPLs/ScDJuHX3B4I/AAAAAAAAAG8/WOzeHbSZ5pw/s1600-h/AIGad.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5314469354387474306\" src=\"http://www.milobookclub.com/wp-content/uploads/2009/03/AIGad.jpg\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 400px; height: 272px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2009/03/AIGad.jpg\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5314469354387474306\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 400px; height: 272px;\"/></a>As DG, who emailed this image from a 2007 AIG ad notes, gravity has seldom been so comprehensively defied.  AIG’s commitment to reality is obviously on the tenuous side, as their outrageous decision to give bailout money to European banks and ex-employees clearly demonstrates.  That little girl isn’t going to be a rocket scientist; even if she manages to obtain an astrophysics degree she’s more likely <a href=\"http://cla.umn.edu/news/clatoday/fallwinter2003-04/desai.php\">to end up teaching queer theory in Indian film</a>.</p><p>I have no problem with Sen. Grassley’s comment encouraging AIG executives to commit seppeku, as it would save Americans the trouble of having to hang the banking executives by their own entrails.  And isn’t it interesting to see Obama and the Democrats in Congress are demonstrating what wholly-owned Wall Street slaves they are and have always been?  While most people are idiots, they really can’t expect to be able to shovel money to the banks one day, then shake their fists in feigned anger over <a href=\"http://www.foxnews.com/politics/first100days/2009/03/17/lawmakers-turn-obama-administration-aig-bonuses/\">what the bankers have done with that money</a> the next.  Especially when the Magic Negro <a href=\"http://www.examiner.com/x-268-Right-Side-Politics-Examiner~y2009m3d17-Obama-Received-a-101332-Bonus-from-AIG\">received more than one hundred thousand dollars from AIG</a> in 2008.  Is Obama going to demand that he return his own little bonus from the bankers?</p><p>Everyone knows the assertion that there’s nothing the administration, Congress, or any federal administration can do about the bonuses, or the bailout money, is total nonsense.  The feds have no trouble emptying out bank accounts anytime they feel like it, regardless of what the law or any corporate contract says.  And the argument that the bonuses are necessary in order to retain “the best and brightest” – you know, the very individuals who ran AIG into the ground – have already been shown to be false by the fact that a number of them have already left the company.</p><p>So, no more bailouts.  No more bonuses.  No more corrupt government “fixes”.  Americans must demand that all the bailout money be returned immediately and all the insolvent institutions liquidated.  That’s capitalism.  That’s the free market.  And that’s the way out of the mess.</p></div>",
  "content_text": "As DG, who emailed this image from a 2007 AIG ad notes, gravity has seldom been so comprehensively defied.  AIG’s commitment to reality is obviously on the tenuous side, as their outrageous decision to give bailout money to European banks and ex-employees clearly demonstrates.  That little girl isn’t going to be a rocket scientist; even if she manages to obtain an astrophysics degree she’s more likely\nto end up teaching queer theory in Indian film\n.\nI have no problem with Sen. Grassley’s comment encouraging AIG executives to commit seppeku, as it would save Americans the trouble of having to hang the banking executives by their own entrails.  And isn’t it interesting to see Obama and the Democrats in Congress are demonstrating what wholly-owned Wall Street slaves they are and have always been?  While most people are idiots, they really can’t expect to be able to shovel money to the banks one day, then shake their fists in feigned anger over\nwhat the bankers have done with that money\nthe next.  Especially when the Magic Negro\nreceived more than one hundred thousand dollars from AIG\nin 2008.  Is Obama going to demand that he return his own little bonus from the bankers?\nEveryone knows the assertion that there’s nothing the administration, Congress, or any federal administration can do about the bonuses, or the bailout money, is total nonsense.  The feds have no trouble emptying out bank accounts anytime they feel like it, regardless of what the law or any corporate contract says.  And the argument that the bonuses are necessary in order to retain “the best and brightest” – you know, the very individuals who ran AIG into the ground – have already been shown to be false by the fact that a number of them have already left the company.\nSo, no more bailouts.  No more bonuses.  No more corrupt government “fixes”.  Americans must demand that all the bailout money be returned immediately and all the insolvent institutions liquidated.  That’s capitalism.  That’s the free market.  And that’s the way out of the mess.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-18T13:30:00+00:00"
}