{
  "url": "https://voxday.net/2009/03/24/not-my-vengeance-but-thine/",
  "scraped_at": "2026-01-08T22:51:36.839448",
  "title": "Not my vengeance, but Thine",
  "date_display": "March 24, 2009",
  "date_iso": "2009-03-24T19:01:00+00:00",
  "date_from_url": "2009-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I am a peaceful gentleman, I have been known to wax wroth on occasion when sufficiently provoked.  As longtime readers know, I am largely impervious to words, but I am rather less inclined to suffer physical assaults with equanimity.  And I have been subjected to more than most over the years, largely as a result of my speed and my position on the soccer team.</p><p>For an individual who spent most of his life playing soccer, I am an exceptionally unskilled individual.  What I do possess – or rather, did possess – was exceptional speed.  Since the number of people in the state capable of beating me could be counted on one hand, there was never a defender on the soccer field who could hope to keep up with me.  Their one hope of staying with me was to foul every time I started to move, so at times the sport seemed more like wrestling than anything else, and one can understand if the idea that soccer was supposed to be a non-contact sport never made much sense to me.</p><p>Since I was always perceived as the most dangerous attacker – which was actually seldom true – I was inevitably man-marked and often double-teamed.  Over the years, I eventually developed a catalog of various tricks and maneuvers designed to keep defenders away from me, ranging from adroitly timed elbows to smacking their locked elbow with my forearm when they grabbed my jersey.  When intentionally tripped, I would get up and blatantly kick both feet out from under them as the ref followed the action upfield… this led to more than a few yellow cards for the other team when defenders would get enraged at my doing openly what they were doing surreptitiously.  Most seasons, I collected nearly as many red and yellow cards as I scored goals.</p><p>When I returned to the soccer field after spending four years at college and six years doing martial arts, I had forty pounds more muscle and a much larger arsenal of tricks at my disposal.  Suddenly, I discovered that defenders were unable to force me off the ball, which was a pleasant surprise.  I became a more effective striker and managed to average a goal per game the last year I played in the States.  Playing in Europe was a very different experience, however, as the skill level of the players was so much higher that I felt like a chimpanzee trying to play chess with Russian programmers.  While the defenders still clutched and grabbed, the level of general violence was much lower, with one very notable exception.</p><p>Most teams in the elite veterans league with which I played had a lot of very good players.  There were a number of retired professionals, and one team even boasted a former national team member, which was rather intimidating although I did have what turned out to be my best game ever against them.  But there was one team that was easily the dirtiest collection of cheating, nasty, sour-tempered losers I have ever encountered, and I’ve played everywhere from the US to Europe and Japan.  The year we took the championship and won promotion, we were beating them three-nothing, which seemed to enrage their keeper and their sweeper.  The two of them started trying to commit fouls every time one of our strikers got near them.  It was getting increasingly chippy, and after I nearly scored a fourth goal, the sweeper sidled up to me, <i>grabbed my testicles</i>, and squeezed as hard as he could.</p><p>Now, as I’ve mentioned in the past, I very seldom feel any pain when my adrenaline is up.  So, it didn’t hurt in the slightest.  In fact, the only thing I thought was “uppercut”, as with his left hand down doing the dirty work, I had a perfectly clear shot to his chin.  But then I thought, is it really worth it?  On the one hand, if I power the uppercut with a hip twist I can definitely break his jaw and quite possibly knock him out as he eminently deserves.  On the other hand, what purpose is that actually going to solve?  Is it really right to seriously injure him when, despite his best efforts, he’s not actually hurting me?  He looked a little confused when I didn’t react by doubling over, but merely forced him to release his grip by shoving him away and breaking out wide to receive a pass from our left midfielder.  Then, not five minutes later, there was an open ball in front of goal, the goalie went after my knee instead of the ball, and ripped it open with the toe of his shoe.  Again, I didn’t feel anything thanks to the adrenaline rush, but a few minutes later, one of my teammates brought it to my attention that a flap of skin was hanging out over my knee and I was bleeding like a well-stuck pig.  I thought about confronting the goalie over what was clearly malice aforethought, but again, decided to let things slide and tried not to bleed on the interior of my friend’s Maserati as he thoughtfully drove me to the hospital to get stitched up.</p><p>When we played them again about two months later, I was wondering how I should repay the two ill-mannered brutes for their indelicate assaults.  But, as it turned out, any action on my part was rendered moot before I even got into the game.  Not five minutes after the game started, there was an open ball in the goal area for which the dirty defender was fighting our best striker.  The dirty goalie came out, and as we’d learned was his wont, went for our striker’s leg rather than the ball.  However, the defender chose just that moment to foul our striker by pushing him out of the way with both hands, and for his efforts he received a full-force kick to the side of his head that knocked him out instantly.  It was absolutely brutal and I almost laughed myself sick at the horrified expression on the idiot keeper’s face.  It was just PERFECT!  After waking up, the defender had to be helped off the field and taken to the hospital; I have little doubt that he received a nice little concussion.</p><p>The referee and the opposing coach were a little offended at the enthusiasm with which my team applauded the incident, until our coach pointed to my knee, which still looked ghastly, and explained that justice had been swiftly served from on high.  It was a beautifully satisfactory result, although my coach did tell me at the end of the season: “Next time, just go ahead and hit them.  I will do the explaining.”</p></div>",
  "content_text": "While I am a peaceful gentleman, I have been known to wax wroth on occasion when sufficiently provoked.  As longtime readers know, I am largely impervious to words, but I am rather less inclined to suffer physical assaults with equanimity.  And I have been subjected to more than most over the years, largely as a result of my speed and my position on the soccer team.\nFor an individual who spent most of his life playing soccer, I am an exceptionally unskilled individual.  What I do possess – or rather, did possess – was exceptional speed.  Since the number of people in the state capable of beating me could be counted on one hand, there was never a defender on the soccer field who could hope to keep up with me.  Their one hope of staying with me was to foul every time I started to move, so at times the sport seemed more like wrestling than anything else, and one can understand if the idea that soccer was supposed to be a non-contact sport never made much sense to me.\nSince I was always perceived as the most dangerous attacker – which was actually seldom true – I was inevitably man-marked and often double-teamed.  Over the years, I eventually developed a catalog of various tricks and maneuvers designed to keep defenders away from me, ranging from adroitly timed elbows to smacking their locked elbow with my forearm when they grabbed my jersey.  When intentionally tripped, I would get up and blatantly kick both feet out from under them as the ref followed the action upfield… this led to more than a few yellow cards for the other team when defenders would get enraged at my doing openly what they were doing surreptitiously.  Most seasons, I collected nearly as many red and yellow cards as I scored goals.\nWhen I returned to the soccer field after spending four years at college and six years doing martial arts, I had forty pounds more muscle and a much larger arsenal of tricks at my disposal.  Suddenly, I discovered that defenders were unable to force me off the ball, which was a pleasant surprise.  I became a more effective striker and managed to average a goal per game the last year I played in the States.  Playing in Europe was a very different experience, however, as the skill level of the players was so much higher that I felt like a chimpanzee trying to play chess with Russian programmers.  While the defenders still clutched and grabbed, the level of general violence was much lower, with one very notable exception.\nMost teams in the elite veterans league with which I played had a lot of very good players.  There were a number of retired professionals, and one team even boasted a former national team member, which was rather intimidating although I did have what turned out to be my best game ever against them.  But there was one team that was easily the dirtiest collection of cheating, nasty, sour-tempered losers I have ever encountered, and I’ve played everywhere from the US to Europe and Japan.  The year we took the championship and won promotion, we were beating them three-nothing, which seemed to enrage their keeper and their sweeper.  The two of them started trying to commit fouls every time one of our strikers got near them.  It was getting increasingly chippy, and after I nearly scored a fourth goal, the sweeper sidled up to me,\ngrabbed my testicles\n, and squeezed as hard as he could.\nNow, as I’ve mentioned in the past, I very seldom feel any pain when my adrenaline is up.  So, it didn’t hurt in the slightest.  In fact, the only thing I thought was “uppercut”, as with his left hand down doing the dirty work, I had a perfectly clear shot to his chin.  But then I thought, is it really worth it?  On the one hand, if I power the uppercut with a hip twist I can definitely break his jaw and quite possibly knock him out as he eminently deserves.  On the other hand, what purpose is that actually going to solve?  Is it really right to seriously injure him when, despite his best efforts, he’s not actually hurting me?  He looked a little confused when I didn’t react by doubling over, but merely forced him to release his grip by shoving him away and breaking out wide to receive a pass from our left midfielder.  Then, not five minutes later, there was an open ball in front of goal, the goalie went after my knee instead of the ball, and ripped it open with the toe of his shoe.  Again, I didn’t feel anything thanks to the adrenaline rush, but a few minutes later, one of my teammates brought it to my attention that a flap of skin was hanging out over my knee and I was bleeding like a well-stuck pig.  I thought about confronting the goalie over what was clearly malice aforethought, but again, decided to let things slide and tried not to bleed on the interior of my friend’s Maserati as he thoughtfully drove me to the hospital to get stitched up.\nWhen we played them again about two months later, I was wondering how I should repay the two ill-mannered brutes for their indelicate assaults.  But, as it turned out, any action on my part was rendered moot before I even got into the game.  Not five minutes after the game started, there was an open ball in the goal area for which the dirty defender was fighting our best striker.  The dirty goalie came out, and as we’d learned was his wont, went for our striker’s leg rather than the ball.  However, the defender chose just that moment to foul our striker by pushing him out of the way with both hands, and for his efforts he received a full-force kick to the side of his head that knocked him out instantly.  It was absolutely brutal and I almost laughed myself sick at the horrified expression on the idiot keeper’s face.  It was just PERFECT!  After waking up, the defender had to be helped off the field and taken to the hospital; I have little doubt that he received a nice little concussion.\nThe referee and the opposing coach were a little offended at the enthusiasm with which my team applauded the incident, until our coach pointed to my knee, which still looked ghastly, and explained that justice had been swiftly served from on high.  It was a beautifully satisfactory result, although my coach did tell me at the end of the season: “Next time, just go ahead and hit them.  I will do the explaining.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-24T19:01:00+00:00"
}