{
  "url": "https://voxday.net/2009/03/21/prostitutes-protest-in-vain/",
  "scraped_at": "2026-01-08T22:51:20.618623",
  "title": "The prostitutes protest in vain",
  "date_display": "March 21, 2009",
  "date_iso": "2009-03-21T11:42:00+00:00",
  "date_from_url": "2009-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Powerline’s John Hindraker finally sees fit to take exception to an unconstitutional action by the Congress.  And, as you’d expect of a staunchly tone-deaf Republican, <a href=\"http://www.powerlineblog.com/archives/2009/03/023129.php\">he’s outraged by the Congressional attack on the bailout bonuses</a>:</p><blockquote><p>I’m stupefied to find that some people are defending the constitutionality of Nancy Pelosi’s discriminatory, confiscatory and retroactive tax on people who receive bonus income from companies that got TARP money. I would have considered it a bright line rule that the government can’t identify a class of unpopular people and impose a special tax on them. What’s next? A 100% income tax on registered Republicans, retroactive to last year? If Pelosi’s bill passes muster, why not?</p></blockquote><p>Spare me.  Hindraker and his fellow Republicans defended one abuse of the Constitution after another when it was George Bush and the Republican-led Congress spying on Americans and invading countries without declaring war.  They ridiculed Ron Paul when he pointed out those and other massively unconstitutional issues such as the paper dollar, foreign aid, and the various military occupations around the world.  They worked hard to elect the Senate’s champion of the unconstitutional banking bailouts, John McCain, and many of them, including Hindraker, publicly supported the bailouts.</p><p>Now he’s trying expressing outrage over one more Congressional unconstitutionality that might take a bonus away from a high-income banker?  This isn’t just hypocrisy, it’s utter political idiocy.  Good luck getting the pitchfork-bearing masses worked up about the theoretical plight of a banking employee married to a wealthy lawyer.  (That was a remarkably explicit example, by the way, does his wife work for Wells Fargo or something?)  Regardless, the lawyer Hindraker clearly doesn’t understand that most Americans would vastly prefer to see this theoretical lawyer garrotted with piano wire than to see his wife take home a $10,000 bonus from a bailout bank if given a choice between the two.  Hindraker may consider a mere $10k bonus to be a paltry sum, but it is 18 percent of the 2007 median Minnesota <i>household</i> <a href=\"http://minnesota.publicradio.org/display/web/2008/08/26/census_poverty_stable/\">income</a>.</p><p>And Wells Fargo wasn’t “forced” to take the bailout money.  (Hindraker omits to mention that it was the Republican Bush administration, not the Democratic Congress or the Obama administration that “forced” them to take it.)  Wells Fargo could have refused it.  They didn’t.</p><p>The United States entered the lawless territory of a banana republic a long time ago.  It’s a pity that it took influential Republicans like the Powerline guys so long to notice it, but that’s what happens when you prefer to defend the people in power and ignore the abuses they are committing. <a href=\"http://www.powerlineblog.com/archives/2008/09/021644.php\">Back in September</a>, when it still mattered, Hindraker said his “<i>instinct has been to support the bailout proposal</i>“.  Now his instincts tell him that “<i>there is nothing wrong with the AIG bonuses</i>“.</p><p>With all due respect, Mr. Hindraker, your instincts suck.  You were on the wrong side then and you’re on the wrong side now.  Once you have embraced the expansion of federal power, you don’t get to complain that you don’t like the particular direction in which it is now expanding.  If, under heavy pressure from the Republican White House, Congress hadn’t handed over billions to the banks, the bonus tax that so outrages Hindraker wouldn’t exist.  But if you’re going to hook for a living, you’d better understand that every now and then, your pimp is going to bitch-slap you.</p></div>",
  "content_text": "Powerline’s John Hindraker finally sees fit to take exception to an unconstitutional action by the Congress.  And, as you’d expect of a staunchly tone-deaf Republican,\nhe’s outraged by the Congressional attack on the bailout bonuses\n:\nI’m stupefied to find that some people are defending the constitutionality of Nancy Pelosi’s discriminatory, confiscatory and retroactive tax on people who receive bonus income from companies that got TARP money. I would have considered it a bright line rule that the government can’t identify a class of unpopular people and impose a special tax on them. What’s next? A 100% income tax on registered Republicans, retroactive to last year? If Pelosi’s bill passes muster, why not?\nSpare me.  Hindraker and his fellow Republicans defended one abuse of the Constitution after another when it was George Bush and the Republican-led Congress spying on Americans and invading countries without declaring war.  They ridiculed Ron Paul when he pointed out those and other massively unconstitutional issues such as the paper dollar, foreign aid, and the various military occupations around the world.  They worked hard to elect the Senate’s champion of the unconstitutional banking bailouts, John McCain, and many of them, including Hindraker, publicly supported the bailouts.\nNow he’s trying expressing outrage over one more Congressional unconstitutionality that might take a bonus away from a high-income banker?  This isn’t just hypocrisy, it’s utter political idiocy.  Good luck getting the pitchfork-bearing masses worked up about the theoretical plight of a banking employee married to a wealthy lawyer.  (That was a remarkably explicit example, by the way, does his wife work for Wells Fargo or something?)  Regardless, the lawyer Hindraker clearly doesn’t understand that most Americans would vastly prefer to see this theoretical lawyer garrotted with piano wire than to see his wife take home a $10,000 bonus from a bailout bank if given a choice between the two.  Hindraker may consider a mere $10k bonus to be a paltry sum, but it is 18 percent of the 2007 median Minnesota\nhousehold\nincome\n.\nAnd Wells Fargo wasn’t “forced” to take the bailout money.  (Hindraker omits to mention that it was the Republican Bush administration, not the Democratic Congress or the Obama administration that “forced” them to take it.)  Wells Fargo could have refused it.  They didn’t.\nThe United States entered the lawless territory of a banana republic a long time ago.  It’s a pity that it took influential Republicans like the Powerline guys so long to notice it, but that’s what happens when you prefer to defend the people in power and ignore the abuses they are committing.\nBack in September\n, when it still mattered, Hindraker said his “\ninstinct has been to support the bailout proposal\n“.  Now his instincts tell him that “\nthere is nothing wrong with the AIG bonuses\n“.\nWith all due respect, Mr. Hindraker, your instincts suck.  You were on the wrong side then and you’re on the wrong side now.  Once you have embraced the expansion of federal power, you don’t get to complain that you don’t like the particular direction in which it is now expanding.  If, under heavy pressure from the Republican White House, Congress hadn’t handed over billions to the banks, the bonus tax that so outrages Hindraker wouldn’t exist.  But if you’re going to hook for a living, you’d better understand that every now and then, your pimp is going to bitch-slap you.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-21T11:42:00+00:00"
}