{
  "url": "https://voxday.net/2009/03/08/science-supply-exceeds-demand/",
  "scraped_at": "2026-01-08T22:50:13.543529",
  "title": "Science: supply exceeds demand",
  "date_display": "March 8, 2009",
  "date_iso": "2009-03-08T17:30:00+00:00",
  "date_from_url": "2009-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>How smart can one regard science majors to be when they aren’t intelligent enough to pay any attention to the law of supply and demand?  Or when they can’t be bothered to pay attention when a science professor warns them <a href=\"http://wuphys.wustl.edu/~katz/scientist.html?dupe=with_honor\">not to waste their time</a> by pursuing a science career.</p><blockquote><p>Science is fun and exciting. The thrill of discovery is unique. If you are smart, ambitious and hard working you should major in science as an undergraduate. But that is as far as you should take it. After graduation, you will have to deal with the real world. That means that you should not even consider going to graduate school in science. Do something else instead: medical school, law school, computers or engineering, or something else which appeals to you.</p><p>Why am I (a tenured professor of physics) trying to discourage you from following a career path which was successful for me? Because times have changed (I received my Ph.D. in 1973, and tenure in 1976). American science no longer offers a reasonable career path. If you go to graduate school in science it is in the expectation of spending your working life doing scientific research, using your ingenuity and curiosity to solve important and interesting problems. You will almost certainly be disappointed, probably when it is too late to choose another career.</p><p>American universities train roughly twice as many Ph.D.s as there are jobs for them. When something, or someone, is a glut on the market, the price drops. In the case of Ph.D. scientists, the reduction in price takes the form of many years spent in “holding pattern” postdoctoral jobs.</p></blockquote><p>No wonder the Pharyngulan crowd tends to be so bitter and nasty.  Over-degreed, unemployable, and angry is no way to go through life.  And it’s not exactly hard to figure out why they so often bang on about the desperate need for more government funding for <s>scientists</s> science.  The truth is that very few scientists produce anything of value and the university degree bubble means there are far more science-credentialed individuals than are required by the American economy.</p><p>Before a science fetishist leaps in to confuse science and technology, it’s worth noting this timely quote from historians Will and Ariel Durant, sent in by EJ last week:</p><p><i>“The influence of science, strange to say, was least and last upon technology. Man’s ways of sowing and reaping, mining and manufacturing, building and transporting, had been formed through centuries of trial and error, and traditions and inertia only reluctantly accepted improvement suggested by laboratory experiments; not till the end of this era did science accelerate the Industrial Revolution.”</i><br> – The Age of Voltaire, p.584</br></p></div>",
  "content_text": "How smart can one regard science majors to be when they aren’t intelligent enough to pay any attention to the law of supply and demand?  Or when they can’t be bothered to pay attention when a science professor warns them\nnot to waste their time\nby pursuing a science career.\nScience is fun and exciting. The thrill of discovery is unique. If you are smart, ambitious and hard working you should major in science as an undergraduate. But that is as far as you should take it. After graduation, you will have to deal with the real world. That means that you should not even consider going to graduate school in science. Do something else instead: medical school, law school, computers or engineering, or something else which appeals to you.\nWhy am I (a tenured professor of physics) trying to discourage you from following a career path which was successful for me? Because times have changed (I received my Ph.D. in 1973, and tenure in 1976). American science no longer offers a reasonable career path. If you go to graduate school in science it is in the expectation of spending your working life doing scientific research, using your ingenuity and curiosity to solve important and interesting problems. You will almost certainly be disappointed, probably when it is too late to choose another career.\nAmerican universities train roughly twice as many Ph.D.s as there are jobs for them. When something, or someone, is a glut on the market, the price drops. In the case of Ph.D. scientists, the reduction in price takes the form of many years spent in “holding pattern” postdoctoral jobs.\nNo wonder the Pharyngulan crowd tends to be so bitter and nasty.  Over-degreed, unemployable, and angry is no way to go through life.  And it’s not exactly hard to figure out why they so often bang on about the desperate need for more government funding for\nscientists\nscience.  The truth is that very few scientists produce anything of value and the university degree bubble means there are far more science-credentialed individuals than are required by the American economy.\nBefore a science fetishist leaps in to confuse science and technology, it’s worth noting this timely quote from historians Will and Ariel Durant, sent in by EJ last week:\n“The influence of science, strange to say, was least and last upon technology. Man’s ways of sowing and reaping, mining and manufacturing, building and transporting, had been formed through centuries of trial and error, and traditions and inertia only reluctantly accepted improvement suggested by laboratory experiments; not till the end of this era did science accelerate the Industrial Revolution.”\n– The Age of Voltaire, p.584",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-08T17:30:00+00:00"
}