{
  "url": "https://voxday.net/2009/03/25/voxs-first-law-at-work-2/",
  "scraped_at": "2026-01-08T22:51:40.508829",
  "title": "Vox’s First Law at work",
  "date_display": "March 25, 2009",
  "date_iso": "2009-03-25T09:57:00+00:00",
  "date_from_url": "2009-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Except <a href=\"http://scienceblogs.com/insolence/2009/03/if_you_hand_me_some_stupid_yes_in_fact_i.php#more\">in Orac’s case</a>, it should apparently read as follows: <i>Any sufficiently advanced intelligence is indistinguishable from stupid.</i> Like most individuals who are more intelligent than the norm, Orac simply doesn’t know what to do when he’s in over his head and doesn’t understand something, so he throws his usual hissy fit and declares that everything is stupid because he isn’t capable of grasping it.</p><p>Amusingly, he’s still hung up on the erroneous notion that if one merely REFERENCES National Socialist Germany’s undisputed TRANSPORTATION of millions of people, this is somehow synonymous with ADVOCATING the MURDER of millions of people.  It’s certainly true that WND did edit the phrase out – although I have never and will never retract what was a simple statement of historical fact – but they only did so because they didn’t wish to waste their time dealing with the misplaced hysterics of logically handicapable individuals such as Orac and Michael Medved.  Now there’s a pair of towering intellects for you!</p><p>Orac responds to <a href=\"http://www.milobookclub.com/2009/03/19/if-you-hand-us-hammer/\">my recent post on his reference of a recent scientific scandal</a> in exactly the same overwrought and dishonest manner we’ve come to expect of him.  He ignores the central points and instead tries to nibble away at the edges in an attempt to justify an <i>ad hominem</i> dismissal of my arguments.  Consider, for example, his attempt to evade the fact that scientists are less trusted than one would expect given their ability to appeal to the supposedly unbiased and objective method of science.  Orac weirdly asserts: “We scientists do not claim to rely on a “completely objective system.”  Well, that’s certainly a surprise to anyone who has spent more than five minutes reading practically anything on scienceblogs.  And It would seem strange, too, that as far back as 1983, Nature published a report called “Just how objective is science”.  Of course, Orac is merely playing word games by saying that while the system isn’t “completely” objective, it just “tries very hard to minimize human biases as much as possible”.  Ah, well, that <i>completely</i> eviscerates the point that scientists aren’t considered significantly more credible than a number of other professions despite their bias-minimizing method, doesn’t it… nothing like the old adverbial distraction.</p><p>The usual pattern applies throughout the post.  Orac is quite willing to say whatever will permit him to falsely impute stupidity to someone else regardless of any basis in fact; does anyone seriously believe he’s likely to accept an argument based upon the inherent subjectivity and bias of science when he’s arguing about vaccines or religion?</p><p>That’s how Orac rolls.  His arguments are almost always dependent upon assigning a false interpretation to something I’ve written, then attacking that false interpretation while avoiding what is actually there.  He writes: “Vox is also full of crap when he claims that scientists rely on arguments from authority–as if that’s all we rely on.”</p><p>Of course, I neither wrote nor implied that.  Scientists present a wide variety of arguments based on a various foundations, and I was specifically pointing out that when scientists SUBSTITUTE appeals to scientific authority, or peer review, or democratic consensus, or statistical review, for actual science, they jeopardize their credibility.  Since appeal to authority was only one of three things I mentioned in that very sentence, it’s quite clear that the only one full of crap here is, again, Orac.</p><p>I don’t demand that anyone respect my authority, nor do I make arguments that rely upon this fictional authority.  And I certainly have no need or desire for Orac’s respect.  My reliable track record vis-a-vis the experts merely serves as a powerful basis with which to combat illogical appeals to various <i>legitimate</i> authorities.  Orac is flat-out wrong when he writes: <i>“arguments from authority are not in and of themselves a logical fallacy if the authority is legitimate. It’s arguments from dubious or false authority that are logical fallacies.”</i> The inherent logical fallacy has nothing to do with the legitimacy or illegitimacy of the authority.</p><p>Just yesterday, in fact, the new housing report had the median price at $165,400, which tends to fit the “175k or below” zone I predicted a year ago rather better than “flat at 218,100 in 2008 and increasing in 2009 as the housing experts had it.  Man is a pattern recognition machine and I just happen to be a particularly good one.  Science, like every other human endeavor, is subject to discernible patterns and foolish scientists ignore that, not only to their detriment, but to science’s as well.  Still, to his credit, Orac admits that the scientific method is not hard to understand, which refutes approximately 45 percent of all arguments ever made by a Pharyngulan.  However, he doesn’t grasp that it really is not necessary – although it could certainly be helpful – to know the background behind the scientific work in order to detect a familiar pattern of deception, unreliable assumption, or simple error.  It doesn’t take a genius to recognize familiar patterns at work among the scientists who subscribe to various beliefs in ideas such as TENS, AGW, or the inherent safety of vaccines.  I’ve seen it before in the adherents of the Labor Theory of Value and we’re seeing it again in the second coming of the Keynesians.</p><p>As for extended blather about ethics and the Helsinki Declaration, obviously I’m aware of the issue or I wouldn’t have been able to correctly predict that vaccine defenders will hide behind it in order to justify their refusal to further examine the issue.  Personally, I think a non-blind study would be better than nothing and there are obviously no shortage of parents quite willing to forgo vaccinating their children, but then, as others here have pointed out, there would be more room to explain away any indication one way or the other.  In the meantime, I see no reason why researchers can’t shoot up infant chimpanzees with the full U.S. vaccine schedule and see if it harms them at all.  Perhaps this has already been done; if so, I haven’t heard about it.</p><p>Orac never gets around to addressing the main point, which is that scientists are losing the public opinion battle and more chest-thumping about how wonderful science and scientists are is not going to serve the vaccine defenders’ objectives in the slightest.  The public doesn’t depend on science or scientists, science and scientists depend on the public.  If scientists wish to continue arrogantly flouting public opinion, lampooning very real parental fears, and advocating idiotic ideologies that insult both the intelligence and the experience of the observant public, they’ll richly deserve the reduced funding priority that will likely be their eventual reward in a globally contracting economy.</p><p>In closing, I note that there’s a beautiful comment from one of Orac’s readers that serves as a perfectly apt summary of the relationship, such as it is, between critics like Orac and me.  The usual pattern is this: an individual with an above-average intelligence and a reasonably expensive education sees something from outside their knowledge base that doesn’t fit their assumptions, fail to understand what I am saying, and therefore conclude that <i>because they don’t get it</i>, I must be incorrect and/or stupid.</p><p><i>“VD’s blog title “Vox Popoli” shows that he can’t even quote properly a well known Latin phrase: it’s “Vox populi”, with one “o” and one “u”.”</i></p><p>While it’s true that “populi” is Latin, it is also true that “popoli” is Italian.  “Vox Popoli” is a mix of two languages rather like, well, “Vox Day”.</p><p>UPDATE – It occurs to me that I forgot to mention that the poll Orac cites, in which scientists were asked if they had committed<br> scientific fraud or not, is not exactly the most convincing evidence that scientists are not committing fraud.  In related news, a similar poll found that 100 percent of the convicted felons questioned anonymously in Stillwater State Prison did not commit the crimes for which they are presently serving time.</br></p></div>",
  "content_text": "Except\nin Orac’s case\n, it should apparently read as follows:\nAny sufficiently advanced intelligence is indistinguishable from stupid.\nLike most individuals who are more intelligent than the norm, Orac simply doesn’t know what to do when he’s in over his head and doesn’t understand something, so he throws his usual hissy fit and declares that everything is stupid because he isn’t capable of grasping it.\nAmusingly, he’s still hung up on the erroneous notion that if one merely REFERENCES National Socialist Germany’s undisputed TRANSPORTATION of millions of people, this is somehow synonymous with ADVOCATING the MURDER of millions of people.  It’s certainly true that WND did edit the phrase out – although I have never and will never retract what was a simple statement of historical fact – but they only did so because they didn’t wish to waste their time dealing with the misplaced hysterics of logically handicapable individuals such as Orac and Michael Medved.  Now there’s a pair of towering intellects for you!\nOrac responds to\nmy recent post on his reference of a recent scientific scandal\nin exactly the same overwrought and dishonest manner we’ve come to expect of him.  He ignores the central points and instead tries to nibble away at the edges in an attempt to justify an\nad hominem\ndismissal of my arguments.  Consider, for example, his attempt to evade the fact that scientists are less trusted than one would expect given their ability to appeal to the supposedly unbiased and objective method of science.  Orac weirdly asserts: “We scientists do not claim to rely on a “completely objective system.”  Well, that’s certainly a surprise to anyone who has spent more than five minutes reading practically anything on scienceblogs.  And It would seem strange, too, that as far back as 1983, Nature published a report called “Just how objective is science”.  Of course, Orac is merely playing word games by saying that while the system isn’t “completely” objective, it just “tries very hard to minimize human biases as much as possible”.  Ah, well, that\ncompletely\neviscerates the point that scientists aren’t considered significantly more credible than a number of other professions despite their bias-minimizing method, doesn’t it… nothing like the old adverbial distraction.\nThe usual pattern applies throughout the post.  Orac is quite willing to say whatever will permit him to falsely impute stupidity to someone else regardless of any basis in fact; does anyone seriously believe he’s likely to accept an argument based upon the inherent subjectivity and bias of science when he’s arguing about vaccines or religion?\nThat’s how Orac rolls.  His arguments are almost always dependent upon assigning a false interpretation to something I’ve written, then attacking that false interpretation while avoiding what is actually there.  He writes: “Vox is also full of crap when he claims that scientists rely on arguments from authority–as if that’s all we rely on.”\nOf course, I neither wrote nor implied that.  Scientists present a wide variety of arguments based on a various foundations, and I was specifically pointing out that when scientists SUBSTITUTE appeals to scientific authority, or peer review, or democratic consensus, or statistical review, for actual science, they jeopardize their credibility.  Since appeal to authority was only one of three things I mentioned in that very sentence, it’s quite clear that the only one full of crap here is, again, Orac.\nI don’t demand that anyone respect my authority, nor do I make arguments that rely upon this fictional authority.  And I certainly have no need or desire for Orac’s respect.  My reliable track record vis-a-vis the experts merely serves as a powerful basis with which to combat illogical appeals to various\nlegitimate\nauthorities.  Orac is flat-out wrong when he writes:\n“arguments from authority are not in and of themselves a logical fallacy if the authority is legitimate. It’s arguments from dubious or false authority that are logical fallacies.”\nThe inherent logical fallacy has nothing to do with the legitimacy or illegitimacy of the authority.\nJust yesterday, in fact, the new housing report had the median price at $165,400, which tends to fit the “175k or below” zone I predicted a year ago rather better than “flat at 218,100 in 2008 and increasing in 2009 as the housing experts had it.  Man is a pattern recognition machine and I just happen to be a particularly good one.  Science, like every other human endeavor, is subject to discernible patterns and foolish scientists ignore that, not only to their detriment, but to science’s as well.  Still, to his credit, Orac admits that the scientific method is not hard to understand, which refutes approximately 45 percent of all arguments ever made by a Pharyngulan.  However, he doesn’t grasp that it really is not necessary – although it could certainly be helpful – to know the background behind the scientific work in order to detect a familiar pattern of deception, unreliable assumption, or simple error.  It doesn’t take a genius to recognize familiar patterns at work among the scientists who subscribe to various beliefs in ideas such as TENS, AGW, or the inherent safety of vaccines.  I’ve seen it before in the adherents of the Labor Theory of Value and we’re seeing it again in the second coming of the Keynesians.\nAs for extended blather about ethics and the Helsinki Declaration, obviously I’m aware of the issue or I wouldn’t have been able to correctly predict that vaccine defenders will hide behind it in order to justify their refusal to further examine the issue.  Personally, I think a non-blind study would be better than nothing and there are obviously no shortage of parents quite willing to forgo vaccinating their children, but then, as others here have pointed out, there would be more room to explain away any indication one way or the other.  In the meantime, I see no reason why researchers can’t shoot up infant chimpanzees with the full U.S. vaccine schedule and see if it harms them at all.  Perhaps this has already been done; if so, I haven’t heard about it.\nOrac never gets around to addressing the main point, which is that scientists are losing the public opinion battle and more chest-thumping about how wonderful science and scientists are is not going to serve the vaccine defenders’ objectives in the slightest.  The public doesn’t depend on science or scientists, science and scientists depend on the public.  If scientists wish to continue arrogantly flouting public opinion, lampooning very real parental fears, and advocating idiotic ideologies that insult both the intelligence and the experience of the observant public, they’ll richly deserve the reduced funding priority that will likely be their eventual reward in a globally contracting economy.\nIn closing, I note that there’s a beautiful comment from one of Orac’s readers that serves as a perfectly apt summary of the relationship, such as it is, between critics like Orac and me.  The usual pattern is this: an individual with an above-average intelligence and a reasonably expensive education sees something from outside their knowledge base that doesn’t fit their assumptions, fail to understand what I am saying, and therefore conclude that\nbecause they don’t get it\n, I must be incorrect and/or stupid.\n“VD’s blog title “Vox Popoli” shows that he can’t even quote properly a well known Latin phrase: it’s “Vox populi”, with one “o” and one “u”.”\nWhile it’s true that “populi” is Latin, it is also true that “popoli” is Italian.  “Vox Popoli” is a mix of two languages rather like, well, “Vox Day”.\nUPDATE – It occurs to me that I forgot to mention that the poll Orac cites, in which scientists were asked if they had committed\nscientific fraud or not, is not exactly the most convincing evidence that scientists are not committing fraud.  In related news, a similar poll found that 100 percent of the convicted felons questioned anonymously in Stillwater State Prison did not commit the crimes for which they are presently serving time.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-25T09:57:00+00:00"
}