{
  "url": "https://voxday.net/2009/03/23/what-feminism-hath-wrought-indeed/",
  "scraped_at": "2026-01-08T22:51:31.342205",
  "title": "What feminism hath wrought indeed",
  "date_display": "March 23, 2009",
  "date_iso": "2009-03-23T17:30:00+00:00",
  "date_from_url": "2009-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mary Kathryn <s>Gallagher</s> Lopez is a poster girl for what happens <a href=\"http://article.nationalreview.com/?q=ZjkwMGRhY2NmNDFjZDhhMWFlZGQyZmI5NTMxMmRkNzk=\">when you send a woman to do William F. Buckley’s job</a>:</p><blockquote><p>I appreciate the kids’ wanting Rihanna to take some responsibility for her situation. She’s an adult, after all, as is Brown. And if she gets beaten, she should get the heck away from the person responsible. And as a best-selling artist, she has the financial freedom to extricate herself from her trouble. But where’s the outrage over what Brown is accused of doing? There’s something off when so many people blame the victim, not the aggressor.</p></blockquote><p>Or, perhaps, you know, they’re blaming the actual aggressor for the situation, you clueless twit!  I pay far less attention to American celebrity nonsense than the NRO gang does, and even I know that it’s been in the news for weeks that the black girl singer probably hit the black guy singer first.  It’s only <a href=\"http://gawker.com/5166432/report-rihanna-hit-first-so-chris-brown-wants-a-misdemeanor\">the entire basis of the guy’s legal defense</a>, after all.  It was fairly obvious from the start anyhow, since the most logical reason that Brown would have bitten Rihanna’s fingers was that his hands weren’t free when she went after his face.  If – if – she was going for his eyes, that also might explain what otherwise looks like an extreme reaction.</p><p><i>“Sources say Rihanna was the first one to strike — slapping and striking Brown “numerous times” while he was driving, after seeing the text message from another woman. Supposedly, this version of events is reflected in the official police report.”</i></p><p>While I never had the need to use more than a single backhand to deal with a violent woman even before I became a Christian, I have no problem whatsoever with a man beating the absolute hell out of a woman who attacked him first.  In like manner, I also have no problem with a bigger man beating the absolute hell out of a little man who attacks him.  It’s simply not that hard to refrain from physically attacking another individual, the vast majority of men and women throughout history have demonstrated that humans beings are perfectly capable of living their entire lives without initiating violence.  And from the materialistic perspective, removing violence-initiators from the gene pool should be regarded as a positive action on behalf of human evolution in a positive direction, regardless of the sex of the evolutionary dead-ender.</p><p>It’s really not that difficult.  Either women are children and should be treated accordingly, or they are adults and should be treated accordingly.  There is no reasonable middle ground here.  While one may elect not to retaliate for Christian reasons – and I can testify that I have seen God claiming the vengeance that is His in a vastly amusing manner – there is no legal, moral, or social rationale for granting women carte blanche to initiate violence.  If you choose to attack an individual who is more physically capable than you and get the smack beaten out of you, you’re not a victim.  You’re just stupid.</p></div>",
  "content_text": "Mary Kathryn\nGallagher\nLopez is a poster girl for what happens\nwhen you send a woman to do William F. Buckley’s job\n:\nI appreciate the kids’ wanting Rihanna to take some responsibility for her situation. She’s an adult, after all, as is Brown. And if she gets beaten, she should get the heck away from the person responsible. And as a best-selling artist, she has the financial freedom to extricate herself from her trouble. But where’s the outrage over what Brown is accused of doing? There’s something off when so many people blame the victim, not the aggressor.\nOr, perhaps, you know, they’re blaming the actual aggressor for the situation, you clueless twit!  I pay far less attention to American celebrity nonsense than the NRO gang does, and even I know that it’s been in the news for weeks that the black girl singer probably hit the black guy singer first.  It’s only\nthe entire basis of the guy’s legal defense\n, after all.  It was fairly obvious from the start anyhow, since the most logical reason that Brown would have bitten Rihanna’s fingers was that his hands weren’t free when she went after his face.  If – if – she was going for his eyes, that also might explain what otherwise looks like an extreme reaction.\n“Sources say Rihanna was the first one to strike — slapping and striking Brown “numerous times” while he was driving, after seeing the text message from another woman. Supposedly, this version of events is reflected in the official police report.”\nWhile I never had the need to use more than a single backhand to deal with a violent woman even before I became a Christian, I have no problem whatsoever with a man beating the absolute hell out of a woman who attacked him first.  In like manner, I also have no problem with a bigger man beating the absolute hell out of a little man who attacks him.  It’s simply not that hard to refrain from physically attacking another individual, the vast majority of men and women throughout history have demonstrated that humans beings are perfectly capable of living their entire lives without initiating violence.  And from the materialistic perspective, removing violence-initiators from the gene pool should be regarded as a positive action on behalf of human evolution in a positive direction, regardless of the sex of the evolutionary dead-ender.\nIt’s really not that difficult.  Either women are children and should be treated accordingly, or they are adults and should be treated accordingly.  There is no reasonable middle ground here.  While one may elect not to retaliate for Christian reasons – and I can testify that I have seen God claiming the vengeance that is His in a vastly amusing manner – there is no legal, moral, or social rationale for granting women carte blanche to initiate violence.  If you choose to attack an individual who is more physically capable than you and get the smack beaten out of you, you’re not a victim.  You’re just stupid.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-23T17:30:00+00:00"
}