{
  "url": "https://voxday.net/2009/03/10/wnd-column-46/",
  "scraped_at": "2026-01-08T22:50:17.327693",
  "title": "WND column",
  "date_display": "March 10, 2009",
  "date_iso": "2009-03-10T01:30:00+00:00",
  "date_from_url": "2009-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.worldnetdaily.com/index.php?pageId=91102\">Surrender Drug Warriors!</a></b></p><p>Conservatives tend to assume that, unlike dirty, treasonous liberals, they are on the side of truth, justice, liberty and the American way. This is not without reason, as most of the time, they are. However, for nearly 30 years, conservatives have been guilty of one of the greatest abuses of American liberties in American history, and have actively abetted the growth of central government by their thoughtless support for the war on drugs….</p><p>NB adds: <i>“The sainted William F. Buckley, Jr. made the identical point in National Review, years ago.  Glad to see Buchanan has come around to his point of view.  But it’d be nice if you’d give credit where credit is due.  The Old Man of the movement was preaching the truth decades before people started listening.”</i></p></div>",
  "content_text": "Surrender Drug Warriors!\nConservatives tend to assume that, unlike dirty, treasonous liberals, they are on the side of truth, justice, liberty and the American way. This is not without reason, as most of the time, they are. However, for nearly 30 years, conservatives have been guilty of one of the greatest abuses of American liberties in American history, and have actively abetted the growth of central government by their thoughtless support for the war on drugs….\nNB adds:\n“The sainted William F. Buckley, Jr. made the identical point in National Review, years ago.  Glad to see Buchanan has come around to his point of view.  But it’d be nice if you’d give credit where credit is due.  The Old Man of the movement was preaching the truth decades before people started listening.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-03-10T01:30:00+00:00"
}