{
  "url": "https://voxday.net/2020/05/08/alt%e2%98%85hero-episode-5-fear-inspires/",
  "scraped_at": "2025-12-21T12:53:29.158716",
  "title": "Alt★Hero: Episode 5 Fear Inspires",
  "date_display": "May 8, 2020",
  "date_iso": "2020-05-08T10:04:30+00:00",
  "date_from_url": "2020-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It being Friday, it is time for the latest episode of <i>Alt★Hero Crackdown</i>, <a href=\"https://www.webtoons.com/en/challenge/althero/crackdown-fear-inspires/viewer?title_no=413189&amp;episode_no=5\">Episode 5: Fear Inspires</a>, in which our intrepid band of European superheroes round up those terrible nationalists in Berlin. After cracking the top 10 in the Superhero category, <i>Alt★Hero</i> is the first Arkhaven comic to begin taking off on the new platform, although <i>Hypergamouse</i> is showing signs of being on the verge of breaking out too after only two episodes.</p><p>Thanks to the Arkhaven subscribers – for whom we’ll have some monthly announcements early next week – we’re going to be adding not one, but TWO new Webtoons to the existing four, one created by The Legend Chuck Dixon and the other by yours truly. We also hope to get <i>Quantum Mortis</i> rolling this month.</p><p>By the way, this looks likely to be the <i>schwerpunkt </i>of the next media assault on us, based on the media inquiries I’ve been receiving. And yes, of course we are fully prepared for it: see Section 17. While there is no need for Replatfomers to get on board yet, it would be wise for everyone to do so if and when the media offensive begins.</p></div>",
  "content_text": "It being Friday, it is time for the latest episode of\nAlt★Hero Crackdown\n,\nEpisode 5: Fear Inspires\n, in which our intrepid band of European superheroes round up those terrible nationalists in Berlin. After cracking the top 10 in the Superhero category,\nAlt★Hero\nis the first Arkhaven comic to begin taking off on the new platform, although\nHypergamouse\nis showing signs of being on the verge of breaking out too after only two episodes.\nThanks to the Arkhaven subscribers – for whom we’ll have some monthly announcements early next week – we’re going to be adding not one, but TWO new Webtoons to the existing four, one created by The Legend Chuck Dixon and the other by yours truly. We also hope to get\nQuantum Mortis\nrolling this month.\nBy the way, this looks likely to be the\nschwerpunkt\nof the next media assault on us, based on the media inquiries I’ve been receiving. And yes, of course we are fully prepared for it: see Section 17. While there is no need for Replatfomers to get on board yet, it would be wise for everyone to do so if and when the media offensive begins.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-08T09:04:30+00:00"
}