{
  "url": "https://voxday.net/2020/05/25/filled-out-and-authorized/",
  "scraped_at": "2025-12-21T12:55:23.959249",
  "title": "Filled out and authorized",
  "date_display": "May 25, 2020",
  "date_iso": "2020-05-25T15:32:15+00:00",
  "date_from_url": "2020-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Chuck Dixon’s Avalon</i> Episode 8, <a href=\"https://www.webtoons.com/en/challenge/chuck-dixons-avalon/rulebreaker-hand-it-over/viewer?title_no=412218&amp;episode_no=8\">HAND IT OVER</a>, is now live on Webtoons. I think we can safely expect a second brigading from the SJWs, so remember that the ride never ends.</p><p>Also, Brandon Fiadino has entered <i>Chicago Typewriter</i> into the short story competition. The second episode, <a href=\"https://www.webtoons.com/en/challenge/chicago-typewriter-h/the-magic-shop-25/viewer?title_no=438083&amp;episode_no=2\">THE MAGIC SHOP</a>, is also live on Webtoons now.</p><p>And in UATV news, the server passed its most serious traffic test with flying colors. Despite more than doubling its previous peak traffic upon news of the release of the Big Bear’s documentary of his <i>You’re Doing Great, Kid</i> tour on Unauthorized, the server never even blinked momentarily. In fact, if the statistics can be trusted, it should be able to handle nearly 20 times more traffic with ease.</p><p>Which will be very important once we start using it to live-stream. Also, if you’re just signing up now, please note that you’ll need to wait until the weekend to receive your invites. We have to create new invitations for you due to the server being on an entirely different system.</p></div>",
  "content_text": "Chuck Dixon’s Avalon\nEpisode 8,\nHAND IT OVER\n, is now live on Webtoons. I think we can safely expect a second brigading from the SJWs, so remember that the ride never ends.\nAlso, Brandon Fiadino has entered\nChicago Typewriter\ninto the short story competition. The second episode,\nTHE MAGIC SHOP\n, is also live on Webtoons now.\nAnd in UATV news, the server passed its most serious traffic test with flying colors. Despite more than doubling its previous peak traffic upon news of the release of the Big Bear’s documentary of his\nYou’re Doing Great, Kid\ntour on Unauthorized, the server never even blinked momentarily. In fact, if the statistics can be trusted, it should be able to handle nearly 20 times more traffic with ease.\nWhich will be very important once we start using it to live-stream. Also, if you’re just signing up now, please note that you’ll need to wait until the weekend to receive your invites. We have to create new invitations for you due to the server being on an entirely different system.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-25T14:32:15+00:00"
}