{
  "url": "https://voxday.net/2020/05/26/finance-vs-business/",
  "scraped_at": "2025-12-21T12:55:31.510716",
  "title": "Finance vs business",
  "date_display": "May 26, 2020",
  "date_iso": "2020-05-26T18:04:11+00:00",
  "date_from_url": "2020-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The late, great Umberto Eco understood the difference. From <i>Numero Zero</i>, his final novel.</p><p><i>Don’t be naive. We’re talking about finance, not business. First buy, then wait and see where the money to pay for it comes from.</i><br><i><br/></i><i>Numero Zero</i> is a short, but excellent novel, a clever, more accessible <i>Foucault’s Pendulum</i> combined with a dash of nostalgia for the forgotten backways of Milano and Eco’s academic ideas about the nebulous nature of history and text.</br></p><p>I was hesitant to read this one after the relative disappointments of <i>The Prague Cemetery </i>and <i>The Mysterious Flame of the Queen of Loanna</i>. And I took my time with it, reading it first in Italian, then in English. It was both a pleasure and relief to discover that Dr. Eco closed out his literary career on a high note.</p></div>",
  "content_text": "The late, great Umberto Eco understood the difference. From\nNumero Zero\n, his final novel.\nDon’t be naive. We’re talking about finance, not business. First buy, then wait and see where the money to pay for it comes from.\nNumero Zero\nis a short, but excellent novel, a clever, more accessible\nFoucault’s Pendulum\ncombined with a dash of nostalgia for the forgotten backways of Milano and Eco’s academic ideas about the nebulous nature of history and text.\nI was hesitant to read this one after the relative disappointments of\nThe Prague Cemetery\nand\nThe Mysterious Flame of the Queen of Loanna\n. And I took my time with it, reading it first in Italian, then in English. It was both a pleasure and relief to discover that Dr. Eco closed out his literary career on a high note.",
  "tags": [
    "BookReview"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-26T17:04:11+00:00"
}