{
  "url": "https://voxday.net/2020/05/15/fma/",
  "scraped_at": "2025-12-21T12:54:18.458496",
  "title": "F=MA",
  "date_display": "May 15, 2020",
  "date_iso": "2020-05-15T14:22:19+00:00",
  "date_from_url": "2020-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The cultural offensive in the comics world continues! <a href=\"https://www.webtoons.com/en/challenge/althero/crackdown-fma/viewer?title_no=413189&amp;episode_no=6\">Episode 6 of Alt★Hero</a> is live on Webtoons with <i>F=MA</i>. The number three position on the Superhero chart is now within reach! It’s very easy to support, just download the app on your device and subscribe to the comic.</p><p>And in Unauthorized news, Medieval History episodes I – VII are now live on the new UATV site, as are three extended audiobook samples from <i>Corporate Cancer</i>, <i>Corrosion</i>, and <i>A Throne of Bones</i>. We also expect to extend invites to all of the Feed the Bear subscribers, as well as to subscribers to David the Good, the Legend, and Wranglerstar later today.</p><p>We now have 163 videos/MP3s on the new site, with more being uploaded every day. Once all the subscribers have access to the new site, we will begin the process of transferring the domain name and the Google and Roku apps to it.</p><p><b>UPDATE: </b>All the Bears and Legend subscribers have been invited.</p><p>For the benefit of those who don’t understand that this is an entirely new web site that has nothing to do with mobile or device apps of any kind yet, please try to grasp that YOU CANNOT USE THE GOOGLE AND ROKU APPS. They are linked to an entirely different site that has nothing to do with this one yet.</p><p><b>UPDATE: </b>Login bug alert.<b> </b>There was a hash error that is keeping some new accounts from logging in. FFS… I’ll post here when it’s fixed and you can try again.</p><p><b>UPDATE:</b> All right, the login bug has been fixed. If you had the login failure where the two fields just clear after you hit enter and you’re not logged in, try it again now. And if you’re technical, there is no need to state the obvious. We know and will deal with it soon. One thing at a time.</p></div>",
  "content_text": "The cultural offensive in the comics world continues!\nEpisode 6 of Alt★Hero\nis live on Webtoons with\nF=MA\n. The number three position on the Superhero chart is now within reach! It’s very easy to support, just download the app on your device and subscribe to the comic.\nAnd in Unauthorized news, Medieval History episodes I – VII are now live on the new UATV site, as are three extended audiobook samples from\nCorporate Cancer\n,\nCorrosion\n, and\nA Throne of Bones\n. We also expect to extend invites to all of the Feed the Bear subscribers, as well as to subscribers to David the Good, the Legend, and Wranglerstar later today.\nWe now have 163 videos/MP3s on the new site, with more being uploaded every day. Once all the subscribers have access to the new site, we will begin the process of transferring the domain name and the Google and Roku apps to it.\nUPDATE:\nAll the Bears and Legend subscribers have been invited.\nFor the benefit of those who don’t understand that this is an entirely new web site that has nothing to do with mobile or device apps of any kind yet, please try to grasp that YOU CANNOT USE THE GOOGLE AND ROKU APPS. They are linked to an entirely different site that has nothing to do with this one yet.\nUPDATE:\nLogin bug alert.\nThere was a hash error that is keeping some new accounts from logging in. FFS… I’ll post here when it’s fixed and you can try again.\nUPDATE:\nAll right, the login bug has been fixed. If you had the login failure where the two fields just clear after you hit enter and you’re not logged in, try it again now. And if you’re technical, there is no need to state the obvious. We know and will deal with it soon. One thing at a time.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-15T13:22:19+00:00"
}