{
  "url": "https://voxday.net/2020/05/06/impossible-part-ii/",
  "scraped_at": "2025-12-21T12:53:14.373117",
  "title": "Impossible? Part II",
  "date_display": "May 6, 2020",
  "date_iso": "2020-05-06T12:49:11+00:00",
  "date_from_url": "2020-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>II. The Road to Herland</b></p><p>Starting around 1890 and continuing thereafter, the greatest single victory feminists have ever gained was that of the suffragettes. Today in every country where men are allowed to vote, women enjoy the same right. By the ordinary rules of social life, it should never have happened. Why? Because, at the time, men occupied all positions and held all the cards. So in the executive. So in the legislature, and so in the judiciary. So in the military and so in the police. So in the universities. And so in the media, of course. Not to mention the financial world. As late as 1999, when eleven countries formally inaugurated the Euro, the assembled ministers of finance did not include a single woman; it was only in 2018 that a woman became head of the NYSE for the first time. It happened because, women being women, men did not have it in their hearts to fight them. Least of all in the way they often fight each other.</p><p>The fact that men are so reluctant to fight women/feminists as ruthlessly and as brutally as they do each other has been taken for granted much more often than it has been investigated. Perhaps it is because they well know that, had they done so, the human race would have come to a quick and inglorious end; after all, they themselves started life inside women’s wombs and almost all of them sucked at women’s breasts. Or because it took them far too long to open their eyes and take women seriously. Or because, bemused by the ocean of accusations aimed at them by modern feminists, they could not believe it had anything to do with them. After all, almost every one of them thought, he had never done women any harm. On the contrary, wishing to attract them and please them and keep them he had done them all the good he could. Perhaps, as Aristophanes’ Lysistrate put it, it was because, when everything is said and done, a man’s pleasure is in a woman’s hand. Or because, since most men are considerably stronger than most women, when a man fights a woman and loses, he loses; when he wins, he also loses.</p><p>A century later, the tables have been turned. Feminist bloodhounds and their weak-kneed, self-hating male supporters have constructed a monstrous propaganda machine, trained it straight at men, and made them pay heavily for the gratuitous concessions their great-grandfathers made. Day by day, tens and perhaps hundreds of thousands of them are being penalized for offenses they did not commit and which, even a few years ago, not even the victims themselves would have considered offenses at all. They are prosecuted, put on trial, convicted, and incarcerated and/or fined. So much so that, as used to be the case and sometimes remains the case in Muslim societies, even looking at a woman in the “wrong” way can be considered sexual harassment. And so much so that defending the accused in court has almost become a crime in itself; which is one reason why so many lawyers who specialize in doing so are themselves female. As to the alleged victims, so mentally retarded are some of them that they take years, decades even, to understand that whatever was done to them; or which they thought was done to them; or which (in at least one famous case) they dreamt had been done to them; or which others told them had been done to them; did indeed constitute rape, or abuse, or harassment, or whatever.</p><p>Though there was no trial, a perfect example of the way this kind of retroactive accusations work is provided by Ilona Staller, AKA Cicciolina. Born in Budapest in 1951, no sooner had she reached adulthood than she started <i>épater la bourgeoisie</i>. Publicly exposing her every orifice, sleeping with more men than she could remember, and loudly proclaiming her “free-thinking” woman’s right to (ab)use her body just as much as she wanted to. To do her bit for peace, and presumably gain some publicity a well, she proposed sleeping first with Saddam Hussein and then with Osama Bin Laden. On the way she wed a well-known artist, Jeff Koon, had a son with him, and was twice divorced. Looking back at her career, much of it as a pornographer and performer of bawdy songs (“Il Cazzo,” <i>The Prick</i>), she says it has all been a mistake; how much better to be married for thirty years and look after grandchildren. Now that she is a lonely old woman—her own words—whom does she blame? Men, of course. None of whom had understood her sensitive nature and truly loved her; and all of whom were out only to bed her and make money out of her.</p><p>President Clinton at one point engaged in some consensual, repeat consensual, sexual games with a woman, Monica Lewinsky. She actively pursued him—as he later said, the reason why he did it was because he could. Not only that, but she refused to give up even after he told her it was over. For this he came very close to being impeached and removed from office. Why? Because he should have known better. If a woman says no, then “it” is clearly rape. If she says yes, modern feminists claim, then “it” is also rape. This time because she considered, or looking back considers herself to have been, too weak or too much of a ninny to tell him so.</p><p>Among the latest examples is Harvey Weinstein. His alleged crime? Sleeping with two young women. Hoping for advancement and money they, along with any number of others like them, followed him literally to the end of the world with the express intention of getting him to do just that. The evidence that he used force on them or abused them in any way? These are one-on-one situations. Hence, none whatsoever; except for what the women themselves said. That is why a third woman had to be enlisted so she could testify about something that, so she claimed, Weinstein had done to her decades ago. So long, in fact, that the statute of limitations should have been applied (but was not). Why was she brought in? To establish a “pattern” of sexual behavior on the accused’s part. All this, at a time when looking into <i>a woman’s</i> past in order to establish a similar pattern is specifically prohibited by law. Incidentally, so “courageous” and “intrepid” was this particular women that, even as the trial went on, she refused to be identified; this, while half the world’s journalists, always more than ready to cast the first stone, were doing his name harm that is in some ways worse than the 27-year prison term to which he has been sentenced.</p><p>A woman who has been raped or otherwise abused might be expected to be afraid of the perpetrator and keep her distance from him. This is a point many courts have recognized by allowing such a woman to testify without having to confront the accused face to face; so delicate are women’s souls said to be that any defense attorney who dares to cross-examine a female “victim” of abuse in earnest will <i>ipso facto</i> find himself at a disadvantage. Not so in this case as well as many others. Claiming to have been raped, the two continued to see Weinstein and sleep with him. From this, the prosecution argued, it was clear, not that the alleged abuse was not abuse at all, which is the logical conclusion, but that they were “in thrall” to him. A mysterious kind of thrall, previously seen only in witches, which he was somehow able to project over time and right across the globe.</p><p>Going further still, some states will refuse either to prosecute a woman for coming up with false accusations or allow the victim to sue her for defamation. At this point the entire system of justice, supposed to be fair and free and open to all, starts to totter. Any man is at the mercy of any woman as well as any man who, for reasons of his own, chooses to back her up. All such a man can do is keep saying that whatever he did, if he did it, was consensual. To no avail; as Woody Allen and many others found out, once an accusation, however unfounded, has been made nothing can prevent a man from being hounded half to death. By now even boys as young as ten learn that girls are capricious, perfidious, and potentially very, very dangerous creatures. Always capable of returning the slightest sign of affection by stabbing their authors in the back and raising accusations against them, whether true or false.</p><p>But nothing lasts forever. Long ago, I had the honor of studying Hegel, Marx and Engels with one of the world’s greatest experts on those thinkers. As well as Lenin, the man who lit the fuse and turned his predecessors’ vision into a gigantic bloodbath. From them I learnt that history, unlike physical and chemical processes, does not move in a straight line as a bullet does. Instead, it is a question of action/reaction. X comes up with an idea. A new force (such as feminism) appears out of nowhere, as it seems, and starts spreading across the historical stage. Hardly has it done so than a countertheory or counterforce emerges. As the two grow they recognize each other as opponents and wrestle. Out of this struggle a synthesis is born. That synthesis in turn forms a new force or argument, provoking a reaction. And so on, in a process broadly known as dialectics.</p><p>Having gained momentum, feminism now forms as powerful a social force as may be found in the contemporary world. For good or ill, a reaction is bound to happen. In Brazil (Jair Messias Bolsonaro), in Italy (Matteo Salvini), and in the U.S (Donald Trump) it had already begun. The number of anti-feminist organizations is growing. So, according to Google Ngram, is the use of expressions such as “Feminazis.” As well as statements like “feminism is cancer” (14,400,000 hits on Google, most by men but some by women too). Much to the loss of both sexes, probably never in history have so many men hated women as much as do so today. And the other way around.<br>And this is only the beginning. Being 74 years old, I consider myself lucky in that I am unlikely to live long enough to see the movement unfold in its full fury. I am, however, afraid that, unless something drastic happens, my children and grandchildren, both male and female, very likely will. What might such a reaction look like? I am a historian, not a novelist. That is why, looking for an answer, I turn to Margaret Atwood’s 1984 masterpiece, <i>The Handmaid’s Tale</i>, as well as its 2019 sequel, <i>The Testaments</i>.</br></p><p>I. <a href=\"http://voxday.blogspot.com/2020/05/impossible.html\">Introduction</a><br>II. <i>The Road to Herland</i><br>III. Into the Breach<br>IV. Brave New World<br>V. Conclusion</br></br></br></br></p></div>",
  "content_text": "II. The Road to Herland\nStarting around 1890 and continuing thereafter, the greatest single victory feminists have ever gained was that of the suffragettes. Today in every country where men are allowed to vote, women enjoy the same right. By the ordinary rules of social life, it should never have happened. Why? Because, at the time, men occupied all positions and held all the cards. So in the executive. So in the legislature, and so in the judiciary. So in the military and so in the police. So in the universities. And so in the media, of course. Not to mention the financial world. As late as 1999, when eleven countries formally inaugurated the Euro, the assembled ministers of finance did not include a single woman; it was only in 2018 that a woman became head of the NYSE for the first time. It happened because, women being women, men did not have it in their hearts to fight them. Least of all in the way they often fight each other.\nThe fact that men are so reluctant to fight women/feminists as ruthlessly and as brutally as they do each other has been taken for granted much more often than it has been investigated. Perhaps it is because they well know that, had they done so, the human race would have come to a quick and inglorious end; after all, they themselves started life inside women’s wombs and almost all of them sucked at women’s breasts. Or because it took them far too long to open their eyes and take women seriously. Or because, bemused by the ocean of accusations aimed at them by modern feminists, they could not believe it had anything to do with them. After all, almost every one of them thought, he had never done women any harm. On the contrary, wishing to attract them and please them and keep them he had done them all the good he could. Perhaps, as Aristophanes’ Lysistrate put it, it was because, when everything is said and done, a man’s pleasure is in a woman’s hand. Or because, since most men are considerably stronger than most women, when a man fights a woman and loses, he loses; when he wins, he also loses.\nA century later, the tables have been turned. Feminist bloodhounds and their weak-kneed, self-hating male supporters have constructed a monstrous propaganda machine, trained it straight at men, and made them pay heavily for the gratuitous concessions their great-grandfathers made. Day by day, tens and perhaps hundreds of thousands of them are being penalized for offenses they did not commit and which, even a few years ago, not even the victims themselves would have considered offenses at all. They are prosecuted, put on trial, convicted, and incarcerated and/or fined. So much so that, as used to be the case and sometimes remains the case in Muslim societies, even looking at a woman in the “wrong” way can be considered sexual harassment. And so much so that defending the accused in court has almost become a crime in itself; which is one reason why so many lawyers who specialize in doing so are themselves female. As to the alleged victims, so mentally retarded are some of them that they take years, decades even, to understand that whatever was done to them; or which they thought was done to them; or which (in at least one famous case) they dreamt had been done to them; or which others told them had been done to them; did indeed constitute rape, or abuse, or harassment, or whatever.\nThough there was no trial, a perfect example of the way this kind of retroactive accusations work is provided by Ilona Staller, AKA Cicciolina. Born in Budapest in 1951, no sooner had she reached adulthood than she started\népater la bourgeoisie\n. Publicly exposing her every orifice, sleeping with more men than she could remember, and loudly proclaiming her “free-thinking” woman’s right to (ab)use her body just as much as she wanted to. To do her bit for peace, and presumably gain some publicity a well, she proposed sleeping first with Saddam Hussein and then with Osama Bin Laden. On the way she wed a well-known artist, Jeff Koon, had a son with him, and was twice divorced. Looking back at her career, much of it as a pornographer and performer of bawdy songs (“Il Cazzo,”\nThe Prick\n), she says it has all been a mistake; how much better to be married for thirty years and look after grandchildren. Now that she is a lonely old woman—her own words—whom does she blame? Men, of course. None of whom had understood her sensitive nature and truly loved her; and all of whom were out only to bed her and make money out of her.\nPresident Clinton at one point engaged in some consensual, repeat consensual, sexual games with a woman, Monica Lewinsky. She actively pursued him—as he later said, the reason why he did it was because he could. Not only that, but she refused to give up even after he told her it was over. For this he came very close to being impeached and removed from office. Why? Because he should have known better. If a woman says no, then “it” is clearly rape. If she says yes, modern feminists claim, then “it” is also rape. This time because she considered, or looking back considers herself to have been, too weak or too much of a ninny to tell him so.\nAmong the latest examples is Harvey Weinstein. His alleged crime? Sleeping with two young women. Hoping for advancement and money they, along with any number of others like them, followed him literally to the end of the world with the express intention of getting him to do just that. The evidence that he used force on them or abused them in any way? These are one-on-one situations. Hence, none whatsoever; except for what the women themselves said. That is why a third woman had to be enlisted so she could testify about something that, so she claimed, Weinstein had done to her decades ago. So long, in fact, that the statute of limitations should have been applied (but was not). Why was she brought in? To establish a “pattern” of sexual behavior on the accused’s part. All this, at a time when looking into\na woman’s\npast in order to establish a similar pattern is specifically prohibited by law. Incidentally, so “courageous” and “intrepid” was this particular women that, even as the trial went on, she refused to be identified; this, while half the world’s journalists, always more than ready to cast the first stone, were doing his name harm that is in some ways worse than the 27-year prison term to which he has been sentenced.\nA woman who has been raped or otherwise abused might be expected to be afraid of the perpetrator and keep her distance from him. This is a point many courts have recognized by allowing such a woman to testify without having to confront the accused face to face; so delicate are women’s souls said to be that any defense attorney who dares to cross-examine a female “victim” of abuse in earnest will\nipso facto\nfind himself at a disadvantage. Not so in this case as well as many others. Claiming to have been raped, the two continued to see Weinstein and sleep with him. From this, the prosecution argued, it was clear, not that the alleged abuse was not abuse at all, which is the logical conclusion, but that they were “in thrall” to him. A mysterious kind of thrall, previously seen only in witches, which he was somehow able to project over time and right across the globe.\nGoing further still, some states will refuse either to prosecute a woman for coming up with false accusations or allow the victim to sue her for defamation. At this point the entire system of justice, supposed to be fair and free and open to all, starts to totter. Any man is at the mercy of any woman as well as any man who, for reasons of his own, chooses to back her up. All such a man can do is keep saying that whatever he did, if he did it, was consensual. To no avail; as Woody Allen and many others found out, once an accusation, however unfounded, has been made nothing can prevent a man from being hounded half to death. By now even boys as young as ten learn that girls are capricious, perfidious, and potentially very, very dangerous creatures. Always capable of returning the slightest sign of affection by stabbing their authors in the back and raising accusations against them, whether true or false.\nBut nothing lasts forever. Long ago, I had the honor of studying Hegel, Marx and Engels with one of the world’s greatest experts on those thinkers. As well as Lenin, the man who lit the fuse and turned his predecessors’ vision into a gigantic bloodbath. From them I learnt that history, unlike physical and chemical processes, does not move in a straight line as a bullet does. Instead, it is a question of action/reaction. X comes up with an idea. A new force (such as feminism) appears out of nowhere, as it seems, and starts spreading across the historical stage. Hardly has it done so than a countertheory or counterforce emerges. As the two grow they recognize each other as opponents and wrestle. Out of this struggle a synthesis is born. That synthesis in turn forms a new force or argument, provoking a reaction. And so on, in a process broadly known as dialectics.\nHaving gained momentum, feminism now forms as powerful a social force as may be found in the contemporary world. For good or ill, a reaction is bound to happen. In Brazil (Jair Messias Bolsonaro), in Italy (Matteo Salvini), and in the U.S (Donald Trump) it had already begun. The number of anti-feminist organizations is growing. So, according to Google Ngram, is the use of expressions such as “Feminazis.” As well as statements like “feminism is cancer” (14,400,000 hits on Google, most by men but some by women too). Much to the loss of both sexes, probably never in history have so many men hated women as much as do so today. And the other way around.\nAnd this is only the beginning. Being 74 years old, I consider myself lucky in that I am unlikely to live long enough to see the movement unfold in its full fury. I am, however, afraid that, unless something drastic happens, my children and grandchildren, both male and female, very likely will. What might such a reaction look like? I am a historian, not a novelist. That is why, looking for an answer, I turn to Margaret Atwood’s 1984 masterpiece,\nThe Handmaid’s Tale\n, as well as its 2019 sequel,\nThe Testaments\n.\nI.\nIntroduction\nII.\nThe Road to Herland\nIII. Into the Breach\nIV. Brave New World\nV. Conclusion",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-06T11:49:11+00:00"
}