{
  "url": "https://voxday.net/2020/05/06/impossible-part-iii-2/",
  "scraped_at": "2025-12-21T12:53:12.515502",
  "title": "Impossible? Part III",
  "date_display": "May 6, 2020",
  "date_iso": "2020-05-06T12:42:35+00:00",
  "date_from_url": "2020-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>III. Into the Breach</b><br><b><br/></b>Should it occur to anyone to start curbing the excesses of feminism in earnest, then obviously the most important step will be to deprive women of the right to vote. In itself, doing so ought not to be too difficult. In most modern countries, feeding in the right computer program and pressing a few buttons would suffice to do the job. No longer will my wife and I receive our Israeli, blue and white, voting cards in tandem. Instead of pinning two cards to the fridge as, in the past year, we have done no fewer than three times, I shall do so only with one. To prevent disenfranchised women from disrupting the voting process, as some of them regularly did at the turn of the twentieth century, perhaps a few of the noisiest ones should be placed under protective custody for a couple of days. Having each polling station watched by a policeman or two would not present a problem either.</br></p><p>The real problem is a different one. In ancient Greece women’s rights and democracy were entirely separate. Neither in Athens nor in any other city were women allowed either to vote or to hold public office. To the extent that it was democratic, as in some respects it was, the same applied to republican Rome. Not so in the modern world. In it, right from the beginning the demand for women’s enfranchisement has been riding piggyback on democracy. When Congress issued the Declaration of Independence Abigail Adams, wife of president to-be John Adams, complained that it mentioned men but not women. As the French Revolution broke out more than one woman insisted that the newly-adopted rights of men should be extended to women too. The best-known one was the abovementioned Mary Wollstonecraft. Another, Olympe de Gouges, was actually executed; though less for denouncing the “despotic” rule of men over women than for advocating the return of the monarchy. Not accidentally did John Stuart Mill, the most ardent male feminist of all time, publish <i>The Subjection of Women</i> in 1869, the year that marked a vast extension of the British electorate. To this day it is almost exclusively democratic countries that pay attention to women’s rights. Neither Putin, nor Xi, nor Khamenei, nor Kim Jong-un seems to be very interested in them. Nor, since they do not put great store on attracting female voters, or any voters for that matter, is there any reason why they should.</p><p>The long and the short of it is, if women are to be disenfranchised democracy will have to be abolished as well. Given its deep roots in Western civilization, that is a much harder proposition. Who could make the attempt? For Ms. Atwood the answer is clear: the armed forces which, throughout history and until very recently, used to be the bastions of masculinity. Or, more specifically, some secret group active within them and ready to take the bit between its teeth. Perhaps we might add elements of the police, the intelligence services, and various private security organizations. Here it is important to realize that many of those organizations’ CEOs are themselves former generals and senior police officers, making it easier for them to communicate and cooperate.</p><p>Whatever their precise nature, what makes these organizations potentially dangerous is not just the fact that they are authorized to carry weapons and, in certain cases, use them. It is their members’ detailed grasp of the way the state security organs work and, therefore, how they can be subverted and/or harnessed to the conspirators’ purpose. Who is in charge of what? Whom does he report to? What channels does he use, and how to ensure that those channels either remain open or are blocked?</p><p>Mounting a coup is not cheap. In this case the money may come from the kind of billionaire worried about being made to share Harvey Weinstein’s fate—and, given the brave new judiciary climate as well as the growing menace of #MeToo, what billionaire shouldn’t be? In the novels, all we really know about the conspirators is that they call themselves the Sons of Jacob. The reference is to the patriarch of that name. Tricked into marrying two sisters, he discovered that the younger one was unable to have children. Jealous of her sister, she nagged him (“give me children, or else I die”) until he gave way and slept with her handmaid. Now it was the turn of the older one to become jealous, so he impregnated her handmaids as well. Not exactly my idea of fun, but what was the poor man to do?</p><p>Here it is worth recalling that, whatever feminists have said and done, all the above-mentioned forces, agencies, firms, etc. remain almost as male-dominated as they were five or six decades ago. Not only is the number of their female members fairly limited, but few of them occupy key positions.</p><p>As one top Pentagon official in a position to know told me years ago when it was still relatively safe to do so, basically they cause little but trouble. Not simply by complaining; that is something women have no monopoly on. But because their complaints are so often self-contradictory. If female soldiers are not treated on an equal basis with men, e.g in respect to pay, promotion, and conditions of service, they complain about discrimination. If they are treated on an equal basis with men, e.g in respect to training and deployment, they also complain; this time because their femininity, meaning weaker physiques, greater susceptibility to certain diseases, pregnancy and motherhood is not given due consideration and does not lead to the privileges, such as shorter hours and better conditions, to which they feel entitled.</p><p>As anyone who has ever watched men and women engaged in co-ed training knows, there simply is no way out. If the same exercises are prescribed for people of both sexes, far more women will be injured and far fewer will graduate whereas the men, being stronger, will get hardly any training at all. If, to the contrary, trainees of each sex are made to perform to different standards, then the men will complain that, to gain credit, they must work harder than women. As, for example, by running longer distances, carrying heavier loads, and the like. The worst thing those responsible can do is to put men and women trainees into a situation where they have to physically touch each other. As, for example, in the now world-famous Israeli form of hand-to-hand combat known as krav maga (literally, “body-to-body battle”). Under such circumstances serious training becomes impossible. All that is left is a something more like Tai Chi or a ballet.</p><p>In some armies, these problems and others like them have long brought about a situation where male personnel are more afraid of their female colleagues than of the enemy. And no wonder: the U.S military e.g has more sexual assault response coordinators (SARCs) than it does recruiters. In my experience this fear has even spread to retired male officers; they are worried that walls may have ears. Responses to the problem vary. With Vice President Mike Pence providing the example, in- and out of the military a growing number of men refuse to be alone with any woman other than their wives, thus opening the door to complaints about discrimination. Many others will not meet with female co-workers unless a third person is present, thereby opening the door to even more complaints, this time about the violation of privacy.</p><p>Through all this, one thing remains clear. Should those in charge gird their loins and decide that enough is enough, then both in the military and in the civilian world a great many working women could be dispensed with fairly quickly and sent home. The place they occupied until 1965 or so; and which, to the mind of many men and such women as consider their children too precious to be raised by strangers, they should never have left to begin with.</p><p>I. <a href=\"http://voxday.blogspot.com/2020/05/impossible.html\">Introduction</a><br>II. <a href=\"http://voxday.blogspot.com/2020/05/impossible-part-ii.html\">The Road to Herland</a><br>III. <i>Into the Breach</i><br>IV. Brave New World<br>V. Conclusion</br></br></br></br></p></div>",
  "content_text": "III. Into the Breach\nShould it occur to anyone to start curbing the excesses of feminism in earnest, then obviously the most important step will be to deprive women of the right to vote. In itself, doing so ought not to be too difficult. In most modern countries, feeding in the right computer program and pressing a few buttons would suffice to do the job. No longer will my wife and I receive our Israeli, blue and white, voting cards in tandem. Instead of pinning two cards to the fridge as, in the past year, we have done no fewer than three times, I shall do so only with one. To prevent disenfranchised women from disrupting the voting process, as some of them regularly did at the turn of the twentieth century, perhaps a few of the noisiest ones should be placed under protective custody for a couple of days. Having each polling station watched by a policeman or two would not present a problem either.\nThe real problem is a different one. In ancient Greece women’s rights and democracy were entirely separate. Neither in Athens nor in any other city were women allowed either to vote or to hold public office. To the extent that it was democratic, as in some respects it was, the same applied to republican Rome. Not so in the modern world. In it, right from the beginning the demand for women’s enfranchisement has been riding piggyback on democracy. When Congress issued the Declaration of Independence Abigail Adams, wife of president to-be John Adams, complained that it mentioned men but not women. As the French Revolution broke out more than one woman insisted that the newly-adopted rights of men should be extended to women too. The best-known one was the abovementioned Mary Wollstonecraft. Another, Olympe de Gouges, was actually executed; though less for denouncing the “despotic” rule of men over women than for advocating the return of the monarchy. Not accidentally did John Stuart Mill, the most ardent male feminist of all time, publish\nThe Subjection of Women\nin 1869, the year that marked a vast extension of the British electorate. To this day it is almost exclusively democratic countries that pay attention to women’s rights. Neither Putin, nor Xi, nor Khamenei, nor Kim Jong-un seems to be very interested in them. Nor, since they do not put great store on attracting female voters, or any voters for that matter, is there any reason why they should.\nThe long and the short of it is, if women are to be disenfranchised democracy will have to be abolished as well. Given its deep roots in Western civilization, that is a much harder proposition. Who could make the attempt? For Ms. Atwood the answer is clear: the armed forces which, throughout history and until very recently, used to be the bastions of masculinity. Or, more specifically, some secret group active within them and ready to take the bit between its teeth. Perhaps we might add elements of the police, the intelligence services, and various private security organizations. Here it is important to realize that many of those organizations’ CEOs are themselves former generals and senior police officers, making it easier for them to communicate and cooperate.\nWhatever their precise nature, what makes these organizations potentially dangerous is not just the fact that they are authorized to carry weapons and, in certain cases, use them. It is their members’ detailed grasp of the way the state security organs work and, therefore, how they can be subverted and/or harnessed to the conspirators’ purpose. Who is in charge of what? Whom does he report to? What channels does he use, and how to ensure that those channels either remain open or are blocked?\nMounting a coup is not cheap. In this case the money may come from the kind of billionaire worried about being made to share Harvey Weinstein’s fate—and, given the brave new judiciary climate as well as the growing menace of #MeToo, what billionaire shouldn’t be? In the novels, all we really know about the conspirators is that they call themselves the Sons of Jacob. The reference is to the patriarch of that name. Tricked into marrying two sisters, he discovered that the younger one was unable to have children. Jealous of her sister, she nagged him (“give me children, or else I die”) until he gave way and slept with her handmaid. Now it was the turn of the older one to become jealous, so he impregnated her handmaids as well. Not exactly my idea of fun, but what was the poor man to do?\nHere it is worth recalling that, whatever feminists have said and done, all the above-mentioned forces, agencies, firms, etc. remain almost as male-dominated as they were five or six decades ago. Not only is the number of their female members fairly limited, but few of them occupy key positions.\nAs one top Pentagon official in a position to know told me years ago when it was still relatively safe to do so, basically they cause little but trouble. Not simply by complaining; that is something women have no monopoly on. But because their complaints are so often self-contradictory. If female soldiers are not treated on an equal basis with men, e.g in respect to pay, promotion, and conditions of service, they complain about discrimination. If they are treated on an equal basis with men, e.g in respect to training and deployment, they also complain; this time because their femininity, meaning weaker physiques, greater susceptibility to certain diseases, pregnancy and motherhood is not given due consideration and does not lead to the privileges, such as shorter hours and better conditions, to which they feel entitled.\nAs anyone who has ever watched men and women engaged in co-ed training knows, there simply is no way out. If the same exercises are prescribed for people of both sexes, far more women will be injured and far fewer will graduate whereas the men, being stronger, will get hardly any training at all. If, to the contrary, trainees of each sex are made to perform to different standards, then the men will complain that, to gain credit, they must work harder than women. As, for example, by running longer distances, carrying heavier loads, and the like. The worst thing those responsible can do is to put men and women trainees into a situation where they have to physically touch each other. As, for example, in the now world-famous Israeli form of hand-to-hand combat known as krav maga (literally, “body-to-body battle”). Under such circumstances serious training becomes impossible. All that is left is a something more like Tai Chi or a ballet.\nIn some armies, these problems and others like them have long brought about a situation where male personnel are more afraid of their female colleagues than of the enemy. And no wonder: the U.S military e.g has more sexual assault response coordinators (SARCs) than it does recruiters. In my experience this fear has even spread to retired male officers; they are worried that walls may have ears. Responses to the problem vary. With Vice President Mike Pence providing the example, in- and out of the military a growing number of men refuse to be alone with any woman other than their wives, thus opening the door to complaints about discrimination. Many others will not meet with female co-workers unless a third person is present, thereby opening the door to even more complaints, this time about the violation of privacy.\nThrough all this, one thing remains clear. Should those in charge gird their loins and decide that enough is enough, then both in the military and in the civilian world a great many working women could be dispensed with fairly quickly and sent home. The place they occupied until 1965 or so; and which, to the mind of many men and such women as consider their children too precious to be raised by strangers, they should never have left to begin with.\nI.\nIntroduction\nII.\nThe Road to Herland\nIII.\nInto the Breach\nIV. Brave New World\nV. Conclusion",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-06T11:42:35+00:00"
}