{
  "url": "https://voxday.net/2020/05/03/impossible/",
  "scraped_at": "2025-12-21T12:52:59.646169",
  "title": "Impossible?",
  "date_display": "May 3, 2020",
  "date_iso": "2020-05-03T13:01:24+00:00",
  "date_from_url": "2020-05-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Martin van Creveld, the author of <i><a href=\"https://www.amazon.com/Equality-Impossible-Martin-van-Creveld-ebook/dp/B00UVLE20W/\">Equality: The Impossible Quest</a></i>, has written a five-part essay on modern feminism and what he sees as its inevitable consequences.</p><p><b>I. Introduction</b></p><p>Want to know what the strangest thing about modern feminism is? Not the derogatory things many feminists say about other women (“only anxious to inspire love, when they ought to cherish a nobler ambition:” Mary Wollstonecraft, the mother of modern feminism and author of <i>A Vindication of the Rights of Women</i>). Not the foolishness of many of the claims its proponents keep on making, e.g that men designed the famous qwerty keyboard specifically to make the lives of female secretaries hard. Nor the fact that it often comes at the cost of women’s health and welfare, as when they try to compete with men in fields where the latter’s greater physical force and resistance to dirt gives them a clear advantage; thereby inviting injury and shortening their own lives. Nor the truly nauseating combination of aggression and self-pity which has become its trademark. But the fact that so many men tolerate it, abet it, and even help push it forward.</p><p>Consider. When men demonstrate for their rights, which is something they have done many, many times throughout history, they are often shot dead. In the words of a nineteenth-century German proverb, <i>gegen Demokraten helfen nur Soldaten</i> (against democrats, the only remedy is soldiers). When women do the same as, <i>qua </i>women, some of them started doing during the last decades of the nineteenth century, normally the very worst they can expect is a short and relatively comfortable prison sentence. Even the Nazis, notorious for ruthlessness, did not treat their German male and female opponents equally.</p><p>It was only in 1938, five years after “the seizure of power,” that the first female victim of National Socialist “justice” was put to death (along with two male comrades with whom she had been passing state secrets to the Russians). It was only in the same year that the first concentration camp for women, Moehringen, opened its gates. Later Ravensbrueck, the most important camp for women, was distinguished by its relatively low mortality rate. So much better did the Nazis treat lesbians than male homosexuals that, come 1942-43, some ministry of justice officials asked their superiors to please explain why the former should be left off the hook. To that request, they never received an answer.</p><p><i>Part II. The Road to Herland, will appear tomorrow.</i></p></div>",
  "content_text": "Martin van Creveld, the author of\nEquality: The Impossible Quest\n, has written a five-part essay on modern feminism and what he sees as its inevitable consequences.\nI. Introduction\nWant to know what the strangest thing about modern feminism is? Not the derogatory things many feminists say about other women (“only anxious to inspire love, when they ought to cherish a nobler ambition:” Mary Wollstonecraft, the mother of modern feminism and author of\nA Vindication of the Rights of Women\n). Not the foolishness of many of the claims its proponents keep on making, e.g that men designed the famous qwerty keyboard specifically to make the lives of female secretaries hard. Nor the fact that it often comes at the cost of women’s health and welfare, as when they try to compete with men in fields where the latter’s greater physical force and resistance to dirt gives them a clear advantage; thereby inviting injury and shortening their own lives. Nor the truly nauseating combination of aggression and self-pity which has become its trademark. But the fact that so many men tolerate it, abet it, and even help push it forward.\nConsider. When men demonstrate for their rights, which is something they have done many, many times throughout history, they are often shot dead. In the words of a nineteenth-century German proverb,\ngegen Demokraten helfen nur Soldaten\n(against democrats, the only remedy is soldiers). When women do the same as,\nqua\nwomen, some of them started doing during the last decades of the nineteenth century, normally the very worst they can expect is a short and relatively comfortable prison sentence. Even the Nazis, notorious for ruthlessness, did not treat their German male and female opponents equally.\nIt was only in 1938, five years after “the seizure of power,” that the first female victim of National Socialist “justice” was put to death (along with two male comrades with whom she had been passing state secrets to the Russians). It was only in the same year that the first concentration camp for women, Moehringen, opened its gates. Later Ravensbrueck, the most important camp for women, was distinguished by its relatively low mortality rate. So much better did the Nazis treat lesbians than male homosexuals that, come 1942-43, some ministry of justice officials asked their superiors to please explain why the former should be left off the hook. To that request, they never received an answer.\nPart II. The Road to Herland, will appear tomorrow.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-03T12:01:24+00:00"
}