{
  "url": "https://voxday.net/2020/05/28/mailvox-invading-academia/",
  "scraped_at": "2025-12-21T12:55:42.437215",
  "title": "Mailvox: invading academia",
  "date_display": "May 28, 2020",
  "date_iso": "2020-05-28T11:37:27+00:00",
  "date_from_url": "2020-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A grad student writes concerning a recent economics paper:</p><blockquote><p>I forgot to thank you for your analysis on the deflation argument. I started a graduate program in economics last fall, and your deflation argument served as a critical point in a paper I wrote during the fall semester for a finance class. I received an A on the paper and am very grateful for your blog and Darkstream channel. The professor has an MBA in finance from University of Chicago and has worked in corporate banking since the 70s, so what you have been saying for decades is starting to resonate with economics professionals. He  wrote that the argument was very thought-provoking. I cited your sources rather than you directly because of how far you are out of the economics academic hierarchy.</p></blockquote><p>A wise decision. It might bother some people to know that they will never receive public credit for their ideas, but it doesn’t bother me in the slightest. The more that you understand that the public laudation of intellectual celebrities is nothing but Promethean PR and ethnic propaganda, the less that sort of thing appeals to you. If, at this point, the media suddenly started talking me up as an important public intellectual and handing me awards, I’d be wondering where on Earth I’d gone wrong.</p><p>For me, the most interesting thing about the reader’s email is the fact that his professor, with an MBA in finance and 40+ years of banking experience, considers the concept of credit deflation to be “thought-provoking”. That underlines how completely inept, how completely <i>ignorant</i>, the greater part of the so-called intellectual elite are, even in their areas of credentialed expertese.</p><p>In any event, the reader is quite welcome. It’s good to know that someone, somewhere, is getting something out of this <i>pensaverie</i>.</p></div>",
  "content_text": "A grad student writes concerning a recent economics paper:\nI forgot to thank you for your analysis on the deflation argument. I started a graduate program in economics last fall, and your deflation argument served as a critical point in a paper I wrote during the fall semester for a finance class. I received an A on the paper and am very grateful for your blog and Darkstream channel. The professor has an MBA in finance from University of Chicago and has worked in corporate banking since the 70s, so what you have been saying for decades is starting to resonate with economics professionals. He  wrote that the argument was very thought-provoking. I cited your sources rather than you directly because of how far you are out of the economics academic hierarchy.\nA wise decision. It might bother some people to know that they will never receive public credit for their ideas, but it doesn’t bother me in the slightest. The more that you understand that the public laudation of intellectual celebrities is nothing but Promethean PR and ethnic propaganda, the less that sort of thing appeals to you. If, at this point, the media suddenly started talking me up as an important public intellectual and handing me awards, I’d be wondering where on Earth I’d gone wrong.\nFor me, the most interesting thing about the reader’s email is the fact that his professor, with an MBA in finance and 40+ years of banking experience, considers the concept of credit deflation to be “thought-provoking”. That underlines how completely inept, how completely\nignorant\n, the greater part of the so-called intellectual elite are, even in their areas of credentialed expertese.\nIn any event, the reader is quite welcome. It’s good to know that someone, somewhere, is getting something out of this\npensaverie\n.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-28T10:37:27+00:00"
}