{
  "url": "https://voxday.net/2020/05/15/mailvox-debt-deflation-confirmed/",
  "scraped_at": "2025-12-21T12:54:20.284430",
  "title": "Mailvox: debt deflation confirmed",
  "date_display": "May 15, 2020",
  "date_iso": "2020-05-15T15:58:23+00:00",
  "date_from_url": "2020-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reader writes to observe that the concept of debt deflation is gradually leaking out into the mainstream discourse:</p><blockquote><p>I found <a href=\"https://old.reddit.com/r/wallstreetbets/comments/gjxkam/what_will_undoubtedly_happen_from_a_macroeconomic/\">a little snippet</a> that NeonRevolt posted from Reddit’s Wallstreetbets concerning Debt Deflation. I will reproduce the two pertinent paragraphs below, and while I am unsure of the veracity of some of the other points, I find his conclusions in the second paragraph, which I have bolded for emphasis very interesting.</p><p><i>OKAY. So demand has been reduced dramatically around the world, our $21 trillion GDP has basically been paused for 2 months, so to keep it afloat (rough math), the government had to add $3.5 trillion to keep the economy running somewhat smoothly. That’s a lot of printing, you idiots probably expect inflation. Wrong, step away from the US and look at what other countries are doing, the ECB (European Central Bank) and BOJ (Bank of Japan) are having to print trillions of dollars worth of EURO and YEN to keep their economies going, along with every other country getting pounded. Not only that, but since the US dollar makes up 70{105b5945f2a7891a3dd860d3a09046b26c32f8a07d097b566642738deee8841e} of global transactions, in liquidity terms, trillions worth of euro and yen is MUCH MUCH more than any amount Jpow feels like printing, there’s no way our printing could offset what the rest of the world is doing, so inflation isn’t coming. If you want proof, just look at the euro/usd (going lower) and literally ANY emerging market currency is getting absolutely clapped vs the dollar.</i><br><i><br/></i><i>Furthermore, not only is US corporate debt at an all time high, but emerging markets, the eurozone, and asia has borrowed more dollars than ever before at any point in history, basically everyone around the world’s debt is denominated in US DOLLARS. So what’s about to happen? It’s already happening, demand for US dollars is going up because everyone around the world wants to borrow more to offset cash flow concerns and pay off existing debts, which will cause the dollar to increase in value. What happens when the whole world has debt in dollars and the dollar goes up in value? <b>DEBT BECOMES MORE EXPENSIVE. This is DEFLATION, and in particular and even more terrifying DEBT DEFLATION</b>, a phrase that would make Jpow absolutely shit himself (and he knows its coming). This has already started before the whole beervirus nonsense, look at Venezuela and Zimbabwe, they had too much dollar debt, no one wanted to lend to them anymore and whoops, their currency is worthless now. It’s going to be like a game of musical chairs for people trying to get access to dollars, starting with emerging markets and eventually moving into the more developed economies. The result: massive corporate bankruptcies, countries defaulting on debt (devaluing their currencies) and eventually a deleveraging of massive proportions. This WILL occur and no amount of printing can stop it, it’s already too far gone.</i></br></p><p>The reason I am sending you this is that I have been following your posts/darkstreams concerning debt, deflation and how money is created ex nihilo, with great interest. I am also aware of your stance versus inflation versus deflation, and while your arguments already convinced me completely that deflation is in order, this is further proof of your predictions.</p><p>In other words, think this is another example of:</p><p><i>Of all the words of screen and pen</i><br><i>The saddest are these:</i><br><i>Vox was right again.</i></br></br></p></blockquote><p>Deflation is inevitable. It doesn’t take any great mind or vast understanding of economics to grasp that. In fact, it has taken decades of intentional deceit and maleducation to convince the economic mainstream otherwise.</p></div>",
  "content_text": "A reader writes to observe that the concept of debt deflation is gradually leaking out into the mainstream discourse:\nI found\na little snippet\nthat NeonRevolt posted from Reddit’s Wallstreetbets concerning Debt Deflation. I will reproduce the two pertinent paragraphs below, and while I am unsure of the veracity of some of the other points, I find his conclusions in the second paragraph, which I have bolded for emphasis very interesting.\nOKAY. So demand has been reduced dramatically around the world, our $21 trillion GDP has basically been paused for 2 months, so to keep it afloat (rough math), the government had to add $3.5 trillion to keep the economy running somewhat smoothly. That’s a lot of printing, you idiots probably expect inflation. Wrong, step away from the US and look at what other countries are doing, the ECB (European Central Bank) and BOJ (Bank of Japan) are having to print trillions of dollars worth of EURO and YEN to keep their economies going, along with every other country getting pounded. Not only that, but since the US dollar makes up 70{105b5945f2a7891a3dd860d3a09046b26c32f8a07d097b566642738deee8841e} of global transactions, in liquidity terms, trillions worth of euro and yen is MUCH MUCH more than any amount Jpow feels like printing, there’s no way our printing could offset what the rest of the world is doing, so inflation isn’t coming. If you want proof, just look at the euro/usd (going lower) and literally ANY emerging market currency is getting absolutely clapped vs the dollar.\nFurthermore, not only is US corporate debt at an all time high, but emerging markets, the eurozone, and asia has borrowed more dollars than ever before at any point in history, basically everyone around the world’s debt is denominated in US DOLLARS. So what’s about to happen? It’s already happening, demand for US dollars is going up because everyone around the world wants to borrow more to offset cash flow concerns and pay off existing debts, which will cause the dollar to increase in value. What happens when the whole world has debt in dollars and the dollar goes up in value?\nDEBT BECOMES MORE EXPENSIVE. This is DEFLATION, and in particular and even more terrifying DEBT DEFLATION\n, a phrase that would make Jpow absolutely shit himself (and he knows its coming). This has already started before the whole beervirus nonsense, look at Venezuela and Zimbabwe, they had too much dollar debt, no one wanted to lend to them anymore and whoops, their currency is worthless now. It’s going to be like a game of musical chairs for people trying to get access to dollars, starting with emerging markets and eventually moving into the more developed economies. The result: massive corporate bankruptcies, countries defaulting on debt (devaluing their currencies) and eventually a deleveraging of massive proportions. This WILL occur and no amount of printing can stop it, it’s already too far gone.\nThe reason I am sending you this is that I have been following your posts/darkstreams concerning debt, deflation and how money is created ex nihilo, with great interest. I am also aware of your stance versus inflation versus deflation, and while your arguments already convinced me completely that deflation is in order, this is further proof of your predictions.\nIn other words, think this is another example of:\nOf all the words of screen and pen\nThe saddest are these:\nVox was right again.\nDeflation is inevitable. It doesn’t take any great mind or vast understanding of economics to grasp that. In fact, it has taken decades of intentional deceit and maleducation to convince the economic mainstream otherwise.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-15T14:58:23+00:00"
}