{
  "url": "https://voxday.net/2020/05/06/the-good-guys-2/",
  "scraped_at": "2025-12-21T12:53:16.234854",
  "title": "The good guys",
  "date_display": "May 6, 2020",
  "date_iso": "2020-05-06T14:33:02+00:00",
  "date_from_url": "2020-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, I really don’t quite know where to start with the <i>“hurr durr Vox thinks China are the good guys”</i> crowd.</p><p>Let’s start with observing that the very formulation contains a category error. Nations and governments are not people. Therefore, they do not have friends, only interests. Nations and governments are also not moral agents. Therefore, they cannot be “good guys”, or, for that matter, “bad guys”.</p><p>This is why I detest the inevitably disastrous attempts of my intellectual inferiors to summarize my thinking.</p><p>Let me be perfectly clear: I do not think China are “the good guys”. I am aware that it is a nation ruled by the Communist Party. I am familiar with Chinese history and I am cognizant of the fact that its current rulers are persecuting Christians.</p><p>You may recall, that I picked up an East Asian Studies major to go with my Economics degree while I was at university.</p><p>However, unlike my critics, I am also aware that the Chinese governments persecutes Christians with considerably less vigor than it persecutes Tibetans, Uighurs, and corrupt government officials. In fact, it is only ranked 23rd on the list of religious persecution, and is not known to have executed a single Christian in 2020. This hardly ranks with Diocletian or North Korea.</p><p>Furthermore, who could honestly condemn a nationalist government that persecutes Christians, at least so-called Christians of the sort who are actively aiding and abetting the ongoing invasion of the West? I’d very much like to see a dedicated persecution of those Churchians myself.</p><p>Finally, I invite my critics to contemplate this conundrum: a socialist system based upon a planned economy does not work because it is unable to allocate resources effectively due to the lack of price signals, as per Mises and <i>The Contradictions of Socialist Economie</i>s. The Chinese economy features both price signals and effective resource allocation, as well as considerable economic growth.</p><p>Discuss amongst yourselves.</p></div>",
  "content_text": "I have to admit, I really don’t quite know where to start with the\n“hurr durr Vox thinks China are the good guys”\ncrowd.\nLet’s start with observing that the very formulation contains a category error. Nations and governments are not people. Therefore, they do not have friends, only interests. Nations and governments are also not moral agents. Therefore, they cannot be “good guys”, or, for that matter, “bad guys”.\nThis is why I detest the inevitably disastrous attempts of my intellectual inferiors to summarize my thinking.\nLet me be perfectly clear: I do not think China are “the good guys”. I am aware that it is a nation ruled by the Communist Party. I am familiar with Chinese history and I am cognizant of the fact that its current rulers are persecuting Christians.\nYou may recall, that I picked up an East Asian Studies major to go with my Economics degree while I was at university.\nHowever, unlike my critics, I am also aware that the Chinese governments persecutes Christians with considerably less vigor than it persecutes Tibetans, Uighurs, and corrupt government officials. In fact, it is only ranked 23rd on the list of religious persecution, and is not known to have executed a single Christian in 2020. This hardly ranks with Diocletian or North Korea.\nFurthermore, who could honestly condemn a nationalist government that persecutes Christians, at least so-called Christians of the sort who are actively aiding and abetting the ongoing invasion of the West? I’d very much like to see a dedicated persecution of those Churchians myself.\nFinally, I invite my critics to contemplate this conundrum: a socialist system based upon a planned economy does not work because it is unable to allocate resources effectively due to the lack of price signals, as per Mises and\nThe Contradictions of Socialist Economie\ns. The Chinese economy features both price signals and effective resource allocation, as well as considerable economic growth.\nDiscuss amongst yourselves.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-06T13:33:02+00:00"
}