{
  "url": "https://voxday.net/2020/05/28/the-cloud-police/",
  "scraped_at": "2025-12-21T12:55:46.080684",
  "title": "The Cloud Police",
  "date_display": "May 28, 2020",
  "date_iso": "2020-05-28T15:00:05+00:00",
  "date_from_url": "2020-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not content with eradicating thought crime from the social media platforms, the media is now teaming up with the technology companies <a href=\"https://www.zerohedge.com/technology/google-drive-takes-down-personal-copy-plandemic\">to eradicate it from personal accounts</a> in the Cloud:</p><blockquote class=\"tr_bq\"><p><i>The Washington Post</i>’s Silicon Valley Correspondent Elizabeth Dwoskin complained that after the coronavirus documentary <i>Plandemic </i>was censored on social media, some YouTube clips were telling users how to access “banned footage” from the documentary via Google Drive. She then notes that after <i>The Washington Post</i> contacted Google, Google Drive took down a file featuring the trailer for the <i>Plandemic </i>documentary.</p></blockquote><p>This is why you need to get off the Cloud, get off the social media platforms, and support the independent alternatives. Even if you are certain that you are not a crimethinker today, you cannot be certain that you will not be deemed a crimethinker tomorrow.</p></div>",
  "content_text": "Not content with eradicating thought crime from the social media platforms, the media is now teaming up with the technology companies\nto eradicate it from personal accounts\nin the Cloud:\nThe Washington Post\n’s Silicon Valley Correspondent Elizabeth Dwoskin complained that after the coronavirus documentary\nPlandemic\nwas censored on social media, some YouTube clips were telling users how to access “banned footage” from the documentary via Google Drive. She then notes that after\nThe Washington Post\ncontacted Google, Google Drive took down a file featuring the trailer for the\nPlandemic\ndocumentary.\nThis is why you need to get off the Cloud, get off the social media platforms, and support the independent alternatives. Even if you are certain that you are not a crimethinker today, you cannot be certain that you will not be deemed a crimethinker tomorrow.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-28T14:00:05+00:00"
}