{
  "url": "https://voxday.net/2020/05/20/then-they-came-for-chuck-dixon/",
  "scraped_at": "2025-12-21T12:54:51.261253",
  "title": "Then they came for Chuck Dixon",
  "date_display": "May 20, 2020",
  "date_iso": "2020-05-20T10:50:24+00:00",
  "date_from_url": "2020-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reddit SJWs are attempting, with limited success, <a href=\"https://www.webtoons.com/en/challenge/chuck-dixons-avalon/rulebreaker-hero-of-avalon/viewer?title_no=412218&amp;episode_no=7\">to brigade the latest episode of Chuck Dixon’s Avalon</a> by leaving negative comments and driving the rating down. They have managed to drive it down to about 7.6 from the 9.6 it was before. There are only about 20 of them, but that’s been enough, apparently.  <b>UPDATE:</b> they’ve actually driven it below 7.0 now. As if that will accomplish anything. Gammas….</p><p>And in other Arkhaven news, Hypergamouse Episode 4, <a href=\"https://www.webtoons.com/en/challenge/hypergamouse/evolution-in-action/viewer?title_no=423082&amp;episode_no=4\">EVOLUTION IN ACTION</a>, is now live.</p><p>For UATV subscribers, there is a new episode of Barcelona Life up on the new UATV site, featuring what I can testify is an excellent Kung Pao Chicken recipe.</p></div>",
  "content_text": "Reddit SJWs are attempting, with limited success,\nto brigade the latest episode of Chuck Dixon’s Avalon\nby leaving negative comments and driving the rating down. They have managed to drive it down to about 7.6 from the 9.6 it was before. There are only about 20 of them, but that’s been enough, apparently.\nUPDATE:\nthey’ve actually driven it below 7.0 now. As if that will accomplish anything. Gammas….\nAnd in other Arkhaven news, Hypergamouse Episode 4,\nEVOLUTION IN ACTION\n, is now live.\nFor UATV subscribers, there is a new episode of Barcelona Life up on the new UATV site, featuring what I can testify is an excellent Kung Pao Chicken recipe.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-20T09:50:24+00:00"
}