{
  "url": "https://voxday.net/2020/05/31/verpunkt/",
  "scraped_at": "2025-12-21T12:56:09.804250",
  "title": "Verpunkt",
  "date_display": "May 31, 2020",
  "date_iso": "2020-05-31T11:38:54+00:00",
  "date_from_url": "2020-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://uatv.infogalactic.com/watch/wizardry-101-how-words-become-spells-spells-14ae69/\">Owen’s Livestream 849</a>, which explains psychological spells, how to identify and break them, and how they are connected to rhetoric and dialectic, is arguably one of his most important streams to date. What he’s doing here is extending one of the more important elements of Aristotle’s <i>Rhetoric</i>, in which the great Greek philosopher observed that despite there being no information content in rhetoric, it is most effective when it is based on the truth.</p><p>The best rhetoric is true. And the most convincing dialectic sounds like rhetoric. Which is why it is fascinating to observe that despite 2,400 years of <a href=\"https://plato.stanford.edu/entries/aristotle-rhetoric/#dialectic\">comprehensive, in-depth analyses</a> of Aristotle’s philosophy by some of history’s finest minds, we still have no word to identify a useful, important, tremendously effective intellectual concept.</p><p><b>verpunkt </b>= <i>the intersection where Aristotelian rhetoric and dialectic meet and become one.</i><br><i><br/></i>Lest you think I exaggerate the general failure to utilize the important concepts Aristotle explicates, or happen to be ignorant of any relevant analyses, contemplate the Stanford Encyclopedia of Philosophy’s summary of Aristotle’s<i> Rhetoric:</i></br></p><blockquote class=\"tr_bq\"><p>Aristotle’s <i>Rhetoric </i>has had an enormous influence on the development of the art of rhetoric. Not only authors writing in the peripatetic tradition, but also the famous Roman teachers of rhetoric, such as Cicero and Quintilian, frequently used elements stemming from the Aristotelian doctrine. Nevertheless, these authors were interested neither in an authentic interpretation of the Aristotelian works nor in the philosophical sources and backgrounds of the vocabulary that Aristotle had introduced to rhetorical theory. Thus, for two millennia the interpretation of Aristotelian rhetoric has become a matter of the history of rhetoric, not of philosophy. In the most influential manuscripts and editions, Aristotle’s <i>Rhetoric </i>was surrounded by rhetorical works and even written speeches of other Greek and Latin authors, and was seldom interpreted in the context of the whole <i>Corpus Aristotelicum</i>. It was not until the last few decades that the philosophically salient features of the Aristotelian rhetoric were rediscovered: in construing a general theory of the persuasive, Aristotle applies numerous concepts and arguments that are also treated in his logical, ethical, and psychological writings.</p></blockquote></div>",
  "content_text": "Owen’s Livestream 849\n, which explains psychological spells, how to identify and break them, and how they are connected to rhetoric and dialectic, is arguably one of his most important streams to date. What he’s doing here is extending one of the more important elements of Aristotle’s\nRhetoric\n, in which the great Greek philosopher observed that despite there being no information content in rhetoric, it is most effective when it is based on the truth.\nThe best rhetoric is true. And the most convincing dialectic sounds like rhetoric. Which is why it is fascinating to observe that despite 2,400 years of\ncomprehensive, in-depth analyses\nof Aristotle’s philosophy by some of history’s finest minds, we still have no word to identify a useful, important, tremendously effective intellectual concept.\nverpunkt\n=\nthe intersection where Aristotelian rhetoric and dialectic meet and become one.\nLest you think I exaggerate the general failure to utilize the important concepts Aristotle explicates, or happen to be ignorant of any relevant analyses, contemplate the Stanford Encyclopedia of Philosophy’s summary of Aristotle’s\nRhetoric:\nAristotle’s\nRhetoric\nhas had an enormous influence on the development of the art of rhetoric. Not only authors writing in the peripatetic tradition, but also the famous Roman teachers of rhetoric, such as Cicero and Quintilian, frequently used elements stemming from the Aristotelian doctrine. Nevertheless, these authors were interested neither in an authentic interpretation of the Aristotelian works nor in the philosophical sources and backgrounds of the vocabulary that Aristotle had introduced to rhetorical theory. Thus, for two millennia the interpretation of Aristotelian rhetoric has become a matter of the history of rhetoric, not of philosophy. In the most influential manuscripts and editions, Aristotle’s\nRhetoric\nwas surrounded by rhetorical works and even written speeches of other Greek and Latin authors, and was seldom interpreted in the context of the whole\nCorpus Aristotelicum\n. It was not until the last few decades that the philosophically salient features of the Aristotelian rhetoric were rediscovered: in construing a general theory of the persuasive, Aristotle applies numerous concepts and arguments that are also treated in his logical, ethical, and psychological writings.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-05-31T10:38:54+00:00"
}