{
  "url": "https://voxday.net/2013/12/10/a-scientist-admits-science-corruption/",
  "scraped_at": "2025-12-15T16:39:38.903454",
  "title": "A scientist admits science corruption",
  "date_display": "December 10, 2013",
  "date_iso": "2013-12-10T22:30:00+00:00",
  "date_from_url": "2013-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"http://www.theguardian.com/commentisfree/2013/dec/09/how-journals-nature-science-cell-damage-science\">attacks the major science publications</a>, or what he calls the “luxury journals”:</p><blockquote class=\"tr_bq\"><p> I am a scientist. Mine is a professional world that achieves great<br> things for humanity. But it is disfigured by inappropriate incentives.<br> The prevailing structures of personal reputation and career advancement<br> mean the biggest rewards often follow the flashiest work, not the best.<br> Those of us who follow these incentives are being entirely rational – I<br> have followed them myself – but we do not always best serve our<br> profession’s interests, let alone those of humanity and society.</br></br></br></br></br></br></p><p>We<br> all know what distorting incentives have done to finance and banking.<br> The incentives my colleagues face are not huge bonuses, but the<br> professional rewards that accompany publication in prestigious journals –<br> chiefly <a href=\"http://www.nature.com/nature/index.html\" title=\"\">Nature</a>, <a href=\"http://www.cell.com/\" title=\"\">Cell</a> and <a href=\"https://www.sciencemag.org/\" title=\"\">Science</a>….</br></br></br></br></p><p>It is the quality of the science, not the journal’s brand, that<br> matters. Most importantly of all, we scientists need to take action.<br> Like many successful researchers, I have published in the big brands,<br> including the papers that won me the Nobel prize for medicine, which I<br> will be honoured to collect tomorrow.. But no longer. I have now<br> committed my lab to avoiding luxury journals, and I encourage others to<br> do likewise.</br></br></br></br></br></br></p></blockquote><p>It should be interesting to see if the science fetishists who attack me for being “anti-science” when I point out the many problems with the science industry will do the same to this Nobel prize-winner.</p><p>This is one aspect of the problems I have been pointing out. One doesn’t have to know ANYTHING about science to know that the incentive system will lead to major problems, one only has to know about the existence of the incentives and been in contact with the occasional human being.</p></div>",
  "content_text": "And\nattacks the major science publications\n, or what he calls the “luxury journals”:\nI am a scientist. Mine is a professional world that achieves great\nthings for humanity. But it is disfigured by inappropriate incentives.\nThe prevailing structures of personal reputation and career advancement\nmean the biggest rewards often follow the flashiest work, not the best.\nThose of us who follow these incentives are being entirely rational – I\nhave followed them myself – but we do not always best serve our\nprofession’s interests, let alone those of humanity and society.\nWe\nall know what distorting incentives have done to finance and banking.\nThe incentives my colleagues face are not huge bonuses, but the\nprofessional rewards that accompany publication in prestigious journals –\nchiefly\nNature\n,\nCell\nand\nScience\n….\nIt is the quality of the science, not the journal’s brand, that\nmatters. Most importantly of all, we scientists need to take action.\nLike many successful researchers, I have published in the big brands,\nincluding the papers that won me the Nobel prize for medicine, which I\nwill be honoured to collect tomorrow.. But no longer. I have now\ncommitted my lab to avoiding luxury journals, and I encourage others to\ndo likewise.\nIt should be interesting to see if the science fetishists who attack me for being “anti-science” when I point out the many problems with the science industry will do the same to this Nobel prize-winner.\nThis is one aspect of the problems I have been pointing out. One doesn’t have to know ANYTHING about science to know that the incentive system will lead to major problems, one only has to know about the existence of the incentives and been in contact with the occasional human being.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-10T22:30:00+00:00"
}