{
  "url": "https://voxday.net/2013/12/06/a-surreal-presidency/",
  "scraped_at": "2025-12-15T16:39:12.472293",
  "title": "A surreal presidency",
  "date_display": "December 6, 2013",
  "date_iso": "2013-12-06T21:17:00+00:00",
  "date_from_url": "2013-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While the Obama presidency has proven to be an even more amusing comedy of errors than I expected it to be, it’s starting to get a little weird. Mr. Obama has fallen from being the Lightbringer capable of commanding the oceans to lying about crashing at his uncle’s pad in college. And now, we’re informed that he is beyond criticism <a href=\"http://isteve.blogspot.ch/2013/12/chait-how-dare-anyone-criticize-obama.html\">because movie</a>.</p><blockquote class=\"tr_bq\"><p> With “12 Years a Slave” petering out at the box office after a decent<br> but unspectacular run (currently $34 million and losing screens),<br> liberals are increasingly angry that the <a href=\"http://takimag.com/article/new_movie_same_old_skin_game_steve_sailer/print#axzz2mjNuJcQ0\">well-filmed, erratically-acted, and poorly-scripted biopic remake</a> has failed to shut down criticism of President Obama. </br></br></p></blockquote><p>Pity George W. Bush never thought of that. How can you criticize me?  Did you not see “Lord of the Rings’? The problem most people have with Obama isn’t that he’s an uppity Negro. They simply dislike that he’s a narcissistic fraud of modest intelligence.</p></div>",
  "content_text": "While the Obama presidency has proven to be an even more amusing comedy of errors than I expected it to be, it’s starting to get a little weird. Mr. Obama has fallen from being the Lightbringer capable of commanding the oceans to lying about crashing at his uncle’s pad in college. And now, we’re informed that he is beyond criticism\nbecause movie\n.\nWith “12 Years a Slave” petering out at the box office after a decent\nbut unspectacular run (currently $34 million and losing screens),\nliberals are increasingly angry that the\nwell-filmed, erratically-acted, and poorly-scripted biopic remake\nhas failed to shut down criticism of President Obama.\nPity George W. Bush never thought of that. How can you criticize me?  Did you not see “Lord of the Rings’? The problem most people have with Obama isn’t that he’s an uppity Negro. They simply dislike that he’s a narcissistic fraud of modest intelligence.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-06T21:17:00+00:00"
}