{
  "url": "https://voxday.net/2013/12/06/absolute-summary/",
  "scraped_at": "2025-12-15T16:39:07.670720",
  "title": "Absolute summary",
  "date_display": "December 6, 2013",
  "date_iso": "2013-12-06T09:15:00+00:00",
  "date_from_url": "2013-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.absoluterights.com/the-new-american-aristocracy/\">The New American Aristocracy</a><br> Perhaps as a result of the Italian and German experiences, dictatorships<br> have been the great fear of democracies for the last six decades.<br> Aristocracy sounds like something out of the 18th century; a legally<br> privileged class of people sounds positively medieval to the modern ear.<br> And yet, increasingly, that is exactly what we are seeing develop in<br> 21st century America.</br></br></br></br></br></br></p><p> <a href=\"http://www.absoluterights.com/the-scientists-who-cried-wolf/\"> The Scientists Who Cried Wolf</a><br> It’s freezing outside. Hundreds of historic low temperatures have been<br> set in recent weeks around the country. Every single computer model<br> that predicted the globe would be warmer over the last decade has been<br> shown to be wrong. And now this.</br></br></br></br></p><p>“<i>Antarctic sea ice has grown to a record large extent for a second<br> straight year, baffling scientists seeking to understand why this ice<br> is expanding rather than shrinking in a warming world. On Saturday, the<br> ice extent reached 19.51 million square kilometers, according to data<br> posted on the National Snow and Ice Data Center Web site. That number<br> bested record high levels set earlier this month and in 2012 (of 19.48<br> million square kilometers). Records date back to October 1978.”</br></br></br></br></br></br></i></p><p>At this rate, instead of mourning the drowning polar bears, we’re<br> going to find ourselves fleeing for our lives from rampaging packs of<br> them.</br></br></p><p> <a href=\"http://www.absoluterights.com/lies-damned-lies-and-the-left/\">Lies, Damned Lies, and the Left</a><br>  If you happen to notice a no-guns sticker at a place of business, be<br> sure to ask if it is actually the policy of the business or not before<br> assuming it is there legitimately. Because it is entirely possible that<br> the business’s owner didn’t put it there.</br></br></br></br></p><p> <a href=\"http://www.absoluterights.com/racism-in-a-post-racial-society/\">Racism in a Post-Racial Society</a><br> One of the interesting things about living in Europe is the vast gulf<br> between the way Europeans actually behave and the way most Americans<br> believe they do. As a general rule, Americans tend to think of Europe as a little more than a continental socialist camp, which either inspires their admiration or their<br> pity depending upon whether they are liberal or conservative. Liberals,<br> in particular, seem to regard Europe as some sort of New York City on<br> steroids where all the things for which they labor so passionately, like<br> gun control, abortion, racial equality and gay marriage, are embraced<br> as a matter of course.</br></br></br></br></br></br></br></br></p><p>These assumptions tend to be vastly amusing to anyone who has actually spent time living among Europeans.</p></div>",
  "content_text": "The New American Aristocracy\nPerhaps as a result of the Italian and German experiences, dictatorships\nhave been the great fear of democracies for the last six decades.\nAristocracy sounds like something out of the 18th century; a legally\nprivileged class of people sounds positively medieval to the modern ear.\nAnd yet, increasingly, that is exactly what we are seeing develop in\n21st century America.\nThe Scientists Who Cried Wolf\nIt’s freezing outside. Hundreds of historic low temperatures have been\nset in recent weeks around the country. Every single computer model\nthat predicted the globe would be warmer over the last decade has been\nshown to be wrong. And now this.\n“\nAntarctic sea ice has grown to a record large extent for a second\nstraight year, baffling scientists seeking to understand why this ice\nis expanding rather than shrinking in a warming world. On Saturday, the\nice extent reached 19.51 million square kilometers, according to data\nposted on the National Snow and Ice Data Center Web site. That number\nbested record high levels set earlier this month and in 2012 (of 19.48\nmillion square kilometers). Records date back to October 1978.”\nAt this rate, instead of mourning the drowning polar bears, we’re\ngoing to find ourselves fleeing for our lives from rampaging packs of\nthem.\nLies, Damned Lies, and the Left\nIf you happen to notice a no-guns sticker at a place of business, be\nsure to ask if it is actually the policy of the business or not before\nassuming it is there legitimately. Because it is entirely possible that\nthe business’s owner didn’t put it there.\nRacism in a Post-Racial Society\nOne of the interesting things about living in Europe is the vast gulf\nbetween the way Europeans actually behave and the way most Americans\nbelieve they do. As a general rule, Americans tend to think of Europe as a little more than a continental socialist camp, which either inspires their admiration or their\npity depending upon whether they are liberal or conservative. Liberals,\nin particular, seem to regard Europe as some sort of New York City on\nsteroids where all the things for which they labor so passionately, like\ngun control, abortion, racial equality and gay marriage, are embraced\nas a matter of course.\nThese assumptions tend to be vastly amusing to anyone who has actually spent time living among Europeans.",
  "tags": [
    "Absolute Rights"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-06T09:15:00+00:00"
}