{
  "url": "https://voxday.net/2013/12/24/an-encouraging-star/",
  "scraped_at": "2025-12-15T16:40:59.695341",
  "title": "An encouraging start",
  "date_display": "December 24, 2013",
  "date_iso": "2013-12-24T10:41:00+00:00",
  "date_from_url": "2013-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was pleased to observe this morning that Quantum Mortis has officially gotten off to a better start than Selenoth. In the first month ATOB and AMB were available, they sold 957 copies. As of December 24th, 1,002 copies of QM:AMD and QM:GK have been sold. Thanks very much for all your support; I appreciate it and it is encouraging to hear that so many of you have enjoyed the books. While these numbers may sound trivial, (and indeed, they are trivial in comparison with the Kings and Rowlings of the world), keep in mind that the average midlist SF book published by a major publisher has a print run of 5,000 and <a href=\"http://zebulum.hubpages.com/hub/MFA-Programs-for-Genre-Writers\">sells around 3,300 copies.</a></p><p>So, I’m pleased to inform you that QM:2 will definitely be out this summer, most likely in company with a second novella since Steve and I are considerably ahead of schedule. Selenoth fans need not worry, however, as TAODAL Book Two is still on target for a December 2014 release.</p><p>Much to my surprise, the first translation has already been completed. The Bahasa Indonesian translation of <i>A Magic Broken</i> is entitled<i> Mantra yang Rusak </i>and I expect to release it early in the new year. If you happen to speak Indonesian and would be willing to proofread it, please let me know.</p></div>",
  "content_text": "I was pleased to observe this morning that Quantum Mortis has officially gotten off to a better start than Selenoth. In the first month ATOB and AMB were available, they sold 957 copies. As of December 24th, 1,002 copies of QM:AMD and QM:GK have been sold. Thanks very much for all your support; I appreciate it and it is encouraging to hear that so many of you have enjoyed the books. While these numbers may sound trivial, (and indeed, they are trivial in comparison with the Kings and Rowlings of the world), keep in mind that the average midlist SF book published by a major publisher has a print run of 5,000 and\nsells around 3,300 copies.\nSo, I’m pleased to inform you that QM:2 will definitely be out this summer, most likely in company with a second novella since Steve and I are considerably ahead of schedule. Selenoth fans need not worry, however, as TAODAL Book Two is still on target for a December 2014 release.\nMuch to my surprise, the first translation has already been completed. The Bahasa Indonesian translation of\nA Magic Broken\nis entitled\nMantra yang Rusak\nand I expect to release it early in the new year. If you happen to speak Indonesian and would be willing to proofread it, please let me know.",
  "tags": [
    "Quantum Mortis"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-24T10:41:00+00:00"
}