{
  "url": "https://voxday.net/2013/12/16/big-predators-devouring-little-ones/",
  "scraped_at": "2025-12-15T16:40:13.348013",
  "title": "Big predators devouring the little ones",
  "date_display": "December 16, 2013",
  "date_iso": "2013-12-16T08:55:00+00:00",
  "date_from_url": "2013-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I simply can’t find it in my heart to feel any sympathy for the larval lawyers who are belatedly discovering that they, and not the common people upon whom they thought to feed parasitically, <a href=\"http://www.businessinsider.com/is-law-school-worth-the-money-2013-12\">are the prey</a>:</p><blockquote class=\"tr_bq\"><p> Law schools will lie to you. Do not believe a word that comes from law schools, law deans, or law professors. They are salesmen and they want you to hand them $200,000 in non-dischargeable law school loans. That’s all they are interested in. They will tell you about a glorious career that awaits you. They will tell you lawyers are in demand and new technology will open the gates for prosperous new practice areas (3d printing, drones, etc.).</p><p>It’s all a bunch of hogwash. They will tell you that society needs lawyers and tell you stories about saving the poor and doing public interest work. This is also hogwash. Because public interest jobs are eligible for a 10-year government repayment plan, the jobs have become intensely competitive – as have JAG jobs [jobs in the Army]. You will compete against students from top 5 schools for these jobs and unless you go to a top 5 school, it’s going to be difficult to land these jobs. The main point to take away is to appreciate the reality that law schools are trying to sell you a product (the law degree). Law degrees are not in demand in the market so they’re trying new tricks to lure in more consumers….</p><p>I think most people are hapless fools to attend law school today, except in extremely narrow circumstances…. If you go to law school, it’s not a remote possibility that you’ll end up<br> back with your parents, in huge debt, desperately searching for work,<br> and angry at yourself for wearing horse blinders and ignoring this<br> information.</br></br></br></p></blockquote><p>Then again, this is merely a window into the much larger college education scam, as <a href=\"http://market-ticker.org/akcs-www?post=226789\">Karl Denninger notes a recent report</a> from the St. Louis Fed:</p><blockquote class=\"tr_bq\"><p> If you elect to go to college there is only a one in four chance that (1) you will finish and (2) you will work in a job that actually renumerates you for having done so. In other words there is a three in four chance that you’d be better off not having gone to college at all, because (1) your earnings power is not enhanced by having attended and (2) you wouldn’t have the debt — or spent the funds — to go.</p><p>What this paper actually appears to argue is that a huge percentage — three in four — of people who go to college shouldn’t, because they don’t get economic benefit from doing so.  That the outcome for someone who doesn’t have a college degree is on-balance worse than for someone who does isn’t the question.  We know that to be true and it’s always been true.  The question is what are the money odds of going to school in improvement of your life.  That’s all that matters; potential outcome is immaterial if you don’t achieve it just as is the fact that you can win the lottery does not mean that, on a money odds basis, you should buy a ticket!</p><p>As such if you’re contemplating as a young person whether or not to go to college the decision point isn’t whether you will earn more money with a degree than not.  You will; that is a known factor.</p><p>Instead you need to make an honest personal assessment of both the odds you will complete the course of study you undertake and the odds of finding employment that uses that course of study and degree to enhance your earnings power.</p></blockquote><p>Everyone thinks that they can beat the odds. Because Most People Are Idiots. The other problem is that even for the winners, college can come at a tremendous opportunity cost. Suppose Bill Gates had finished his degree at Harvard instead of starting Microsoft? That’s essentially the mistake I made; I went back to school for three semesters instead of selling my working stereo 16-channel 44Khz sound board at a time when Ad Lib was the dominant technology. By the time I finished, the engineer was gone and the VP of engineering wouldn’t give me any of the layout engineer’s time required to put it into production. But hey, they managed to crank out one trivial modification to their existing graphics cards after another instead! So I started a band….</p><p>Now, there are no guarantees. Maybe my sound board would have flopped. And even if it hadn’t, the sound board company that exploded onto the scene two years later with a board inferior to the one I’d had built managed to collapse entirely by 1995. On the other hand, it’s hard to argue that my expensive degrees were worth it. After all, my BS in Economics and BA in East Asian Studies don’t even permit me to win Internet arguments because bachelor’s degree in Philosophy of Language.</p></div>",
  "content_text": "I simply can’t find it in my heart to feel any sympathy for the larval lawyers who are belatedly discovering that they, and not the common people upon whom they thought to feed parasitically,\nare the prey\n:\nLaw schools will lie to you. Do not believe a word that comes from law schools, law deans, or law professors. They are salesmen and they want you to hand them $200,000 in non-dischargeable law school loans. That’s all they are interested in. They will tell you about a glorious career that awaits you. They will tell you lawyers are in demand and new technology will open the gates for prosperous new practice areas (3d printing, drones, etc.).\nIt’s all a bunch of hogwash. They will tell you that society needs lawyers and tell you stories about saving the poor and doing public interest work. This is also hogwash. Because public interest jobs are eligible for a 10-year government repayment plan, the jobs have become intensely competitive – as have JAG jobs [jobs in the Army]. You will compete against students from top 5 schools for these jobs and unless you go to a top 5 school, it’s going to be difficult to land these jobs. The main point to take away is to appreciate the reality that law schools are trying to sell you a product (the law degree). Law degrees are not in demand in the market so they’re trying new tricks to lure in more consumers….\nI think most people are hapless fools to attend law school today, except in extremely narrow circumstances…. If you go to law school, it’s not a remote possibility that you’ll end up\nback with your parents, in huge debt, desperately searching for work,\nand angry at yourself for wearing horse blinders and ignoring this\ninformation.\nThen again, this is merely a window into the much larger college education scam, as\nKarl Denninger notes a recent report\nfrom the St. Louis Fed:\nIf you elect to go to college there is only a one in four chance that (1) you will finish and (2) you will work in a job that actually renumerates you for having done so. In other words there is a three in four chance that you’d be better off not having gone to college at all, because (1) your earnings power is not enhanced by having attended and (2) you wouldn’t have the debt — or spent the funds — to go.\nWhat this paper actually appears to argue is that a huge percentage — three in four — of people who go to college shouldn’t, because they don’t get economic benefit from doing so.  That the outcome for someone who doesn’t have a college degree is on-balance worse than for someone who does isn’t the question.  We know that to be true and it’s always been true.  The question is what are the money odds of going to school in improvement of your life.  That’s all that matters; potential outcome is immaterial if you don’t achieve it just as is the fact that you can win the lottery does not mean that, on a money odds basis, you should buy a ticket!\nAs such if you’re contemplating as a young person whether or not to go to college the decision point isn’t whether you will earn more money with a degree than not.  You will; that is a known factor.\nInstead you need to make an honest personal assessment of both the odds you will complete the course of study you undertake and the odds of finding employment that uses that course of study and degree to enhance your earnings power.\nEveryone thinks that they can beat the odds. Because Most People Are Idiots. The other problem is that even for the winners, college can come at a tremendous opportunity cost. Suppose Bill Gates had finished his degree at Harvard instead of starting Microsoft? That’s essentially the mistake I made; I went back to school for three semesters instead of selling my working stereo 16-channel 44Khz sound board at a time when Ad Lib was the dominant technology. By the time I finished, the engineer was gone and the VP of engineering wouldn’t give me any of the layout engineer’s time required to put it into production. But hey, they managed to crank out one trivial modification to their existing graphics cards after another instead! So I started a band….\nNow, there are no guarantees. Maybe my sound board would have flopped. And even if it hadn’t, the sound board company that exploded onto the scene two years later with a board inferior to the one I’d had built managed to collapse entirely by 1995. On the other hand, it’s hard to argue that my expensive degrees were worth it. After all, my BS in Economics and BA in East Asian Studies don’t even permit me to win Internet arguments because bachelor’s degree in Philosophy of Language.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-16T08:55:00+00:00"
}