{
  "url": "https://voxday.net/2013/12/03/book-review-escape-from-tekmar-i/",
  "scraped_at": "2025-12-15T16:38:45.269986",
  "title": "Book Review: Escape from Tekmar I",
  "date_display": "December 3, 2013",
  "date_iso": "2013-12-03T08:44:00+00:00",
  "date_from_url": "2013-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>HC provides the first review of Kiti Lappi’s <b><a href=\"http://www.amazon.com/Escape-Tekmar-Kiti-Lappi-ebook/dp/B00GV4YO2O/ref=sr_1_3?s=books&amp;ie=UTF8&amp;qid=1385214150&amp;sr=1-3&amp;keywords=kiti+lappi\">Escape from Tekmar</a></b>, the seventh book to be presented <a href=\"http://www.milobookclub.com/2013/11/24/lions-den-vii-kiti-lappi/\">in the Lions Den</a> series.</i></p><p>Rahan and Ryn are partners on assignment for an interstellar agency that monitors the health of ecosystems on terraformed planets. In any other circumstance, one might consider Rahan a badass. Unfortunately, his superior officer, Ryn, is one of the genetically engineered Shemasharra. He’s stronger, faster, smarter, and better looking. He’s also a near mind-reading Boy Scout: honest, fair, ready to help old ladies and inferior men alike to cross dangerous intersections, neither asking nor accepting any reward. Little wonder Rahan finds him so irritating.</p><p>The two men are forced to make an unscheduled stop for repairs on Tekmar, a financially and technologically poor world with a paranoid police state and a xenophobic populace. To minimize the potential for conflict, Ryn remains on board the ship, while Rahan deals with the locals. While absorbing a little local culture, he meets a girl named Lida, and they spend several days together sight-seeing. Of course, Lida has an ulterior motive: she’s a member of a revolutionary group that wants to destroy Tekmar’s rigid feudalism. The organization is in desperate need of cash, and there are people who will pay a high price for a live Shemasharra. Rahan and Ryn are kidnapped by a faction of the revolutionaries led by a man named Kerrin who intends to sell them to a mysterious group of off-worlders. Fisticuffs, cyborgs, shootouts, dogfights, and races against time follow.</p><p><b>The Good:</b> Escape from Tekmar is a good adventure story with a suspenseful plot and several secondaries involving the relationships of Rahan with Ryn, Rahan with Lida, and Lida with Kerrin. Lappi portrayed some aspects of those relationships well. For example, Rahan resents Ryn for being superior and for being patient and patronizing. Rahan comes across like a spoiled teenager acting out in passive aggressive rebellion, and I think that’s precisely what Lappi intended the reader to see.</p><p>There are several exciting and suspenseful sequences. One of the best scenes is a fight between Rahan and Kerrin, whose cybernetically enhanced skeleton and musculature can’t quite make up for his lack of imagination. Later, Rahan pilots an aged sports flyer and has to outwit surveillance drones and police cruisers.</p><p>On the more cerebral side, the author indulges in some interesting speculation on space travel and colonization, genetic engineering, terraforming, politics, and more. Most of that is interesting and worth discussing over a few beers.</p><p><b>The Bad: </b>Tekmar is a good concept piece and rough first draft, but it’s a long way from publication readiness. Almost all of the flaws can be traced to two insufficiencies with which I’m reasonably sure the author will agree:</p><p><i>Lack of depth in the English language</i></p><p>Before I say anything else, Lappi’s native language is Finnish, and I have nothing but respect for someone who attempts to write fiction in a foreign language. Especially in English, the linguistic Borg. I once possessed a familiarity with conversational Russian, but I couldn’t keep up with her alcohol consumption. She left me for a more attentive linguist. I’ve also picked up bits and pieces of half a dozen other languages over the years. Here’s what I finally learned: Effective communication in a foreign tongue is very difficult. Ms. Lappi has that down. Artistic communication, on the other hand, is virtually impossible for most people as they can’t even hope to accomplish it in their own language.</p><p>Ms. Lappi’s vocabulary is very simple, but that is only a problem if her target audience is adults. It’s spot on for a mid-grade audience. If she wants to write for adults, I recommend she starts reading Ursula LeGuin, Walter Miller Jr., or Dan Simmons with a dictionary at her side, looking up every interesting or unfamiliar word. (A related word of advice for all writers: Ignore readability tests. Any test that tells you Ray Bradbury wrote at a fifth grade level is worthless.)</p><p>Tekmar also has a significant number of punctuation errors, run-on sentences, double words, and awkward constructions, probably cultural and linguistic artifacts. (Let me know if you want specific examples.) Another odd thing: every instance of the character string “aining”, such as in “training” and “raining,” seems to have been replaced by “Amarng,” which looks oddly like a problem with optical character recognition software. On the plus side, there are very few spelling errors compared to most self-published work.<br> <i><br/></i><br> <i>Lack of discipline in storytelling. </i></br></br></p><p>The greatest flaw in Tekmar is excessive exposition. The opening scene is fatally interrupted by pages of rambling history, disrupting the flow and dramatic tension. Many readers won’t get past the third or fourth page. Throughout the story, Ms. Lappi commits the cardinal literary sin of “telling, not showing” with abandon.</p><p>The characters are shallow. It seemed to me that Rahan and Ryn behave more like women in the secretarial pool than masculine adventurers. The Shemasharra are too perfect. That helped me sympathize with Rahan at the start, but before long I found myself hoping Ms. Lappi would kill Ryn off early. On the other hand, Kerrin was too despicable. Every bad guy needs to be admirable in some way, but he was just a low-IQ strong man with a jealous, vindictive streak. His only positive quality was surgically implanted and admittedly third rate technology. I kept looking for the mysterious slave traders to take over his role.</p><p>Finally, I was mildly annoyed with some of the technological anachronisms. For example, how can an organization that possesses artificial intelligence capable of infiltrating an entire planet’s police and military networks not have the data processing capacity to handle the incoming data from its scattered survey missions? They can build FTL starships, but they can’t make a hideable security camera? I can believe this is possible, but I’d like some kind of explanation. (But show me. Don’t tell me.) This is a very common problem in science fiction, and only the best writers are able to overcome it in a way that satisfies me.</p><p>Kiti Lappi has written a fun, middle-grade adventure story, but it needs to be tightened up. If she chooses to rework it, the next draft will likely take much more time and effort than she has spent to date. The challenges aren’t insurmountable, but they are significant.</p></div>",
  "content_text": "HC provides the first review of Kiti Lappi’s\nEscape from Tekmar\n, the seventh book to be presented\nin the Lions Den\nseries.\nRahan and Ryn are partners on assignment for an interstellar agency that monitors the health of ecosystems on terraformed planets. In any other circumstance, one might consider Rahan a badass. Unfortunately, his superior officer, Ryn, is one of the genetically engineered Shemasharra. He’s stronger, faster, smarter, and better looking. He’s also a near mind-reading Boy Scout: honest, fair, ready to help old ladies and inferior men alike to cross dangerous intersections, neither asking nor accepting any reward. Little wonder Rahan finds him so irritating.\nThe two men are forced to make an unscheduled stop for repairs on Tekmar, a financially and technologically poor world with a paranoid police state and a xenophobic populace. To minimize the potential for conflict, Ryn remains on board the ship, while Rahan deals with the locals. While absorbing a little local culture, he meets a girl named Lida, and they spend several days together sight-seeing. Of course, Lida has an ulterior motive: she’s a member of a revolutionary group that wants to destroy Tekmar’s rigid feudalism. The organization is in desperate need of cash, and there are people who will pay a high price for a live Shemasharra. Rahan and Ryn are kidnapped by a faction of the revolutionaries led by a man named Kerrin who intends to sell them to a mysterious group of off-worlders. Fisticuffs, cyborgs, shootouts, dogfights, and races against time follow.\nThe Good:\nEscape from Tekmar is a good adventure story with a suspenseful plot and several secondaries involving the relationships of Rahan with Ryn, Rahan with Lida, and Lida with Kerrin. Lappi portrayed some aspects of those relationships well. For example, Rahan resents Ryn for being superior and for being patient and patronizing. Rahan comes across like a spoiled teenager acting out in passive aggressive rebellion, and I think that’s precisely what Lappi intended the reader to see.\nThere are several exciting and suspenseful sequences. One of the best scenes is a fight between Rahan and Kerrin, whose cybernetically enhanced skeleton and musculature can’t quite make up for his lack of imagination. Later, Rahan pilots an aged sports flyer and has to outwit surveillance drones and police cruisers.\nOn the more cerebral side, the author indulges in some interesting speculation on space travel and colonization, genetic engineering, terraforming, politics, and more. Most of that is interesting and worth discussing over a few beers.\nThe Bad:\nTekmar is a good concept piece and rough first draft, but it’s a long way from publication readiness. Almost all of the flaws can be traced to two insufficiencies with which I’m reasonably sure the author will agree:\nLack of depth in the English language\nBefore I say anything else, Lappi’s native language is Finnish, and I have nothing but respect for someone who attempts to write fiction in a foreign language. Especially in English, the linguistic Borg. I once possessed a familiarity with conversational Russian, but I couldn’t keep up with her alcohol consumption. She left me for a more attentive linguist. I’ve also picked up bits and pieces of half a dozen other languages over the years. Here’s what I finally learned: Effective communication in a foreign tongue is very difficult. Ms. Lappi has that down. Artistic communication, on the other hand, is virtually impossible for most people as they can’t even hope to accomplish it in their own language.\nMs. Lappi’s vocabulary is very simple, but that is only a problem if her target audience is adults. It’s spot on for a mid-grade audience. If she wants to write for adults, I recommend she starts reading Ursula LeGuin, Walter Miller Jr., or Dan Simmons with a dictionary at her side, looking up every interesting or unfamiliar word. (A related word of advice for all writers: Ignore readability tests. Any test that tells you Ray Bradbury wrote at a fifth grade level is worthless.)\nTekmar also has a significant number of punctuation errors, run-on sentences, double words, and awkward constructions, probably cultural and linguistic artifacts. (Let me know if you want specific examples.) Another odd thing: every instance of the character string “aining”, such as in “training” and “raining,” seems to have been replaced by “Amarng,” which looks oddly like a problem with optical character recognition software. On the plus side, there are very few spelling errors compared to most self-published work.\nLack of discipline in storytelling.\nThe greatest flaw in Tekmar is excessive exposition. The opening scene is fatally interrupted by pages of rambling history, disrupting the flow and dramatic tension. Many readers won’t get past the third or fourth page. Throughout the story, Ms. Lappi commits the cardinal literary sin of “telling, not showing” with abandon.\nThe characters are shallow. It seemed to me that Rahan and Ryn behave more like women in the secretarial pool than masculine adventurers. The Shemasharra are too perfect. That helped me sympathize with Rahan at the start, but before long I found myself hoping Ms. Lappi would kill Ryn off early. On the other hand, Kerrin was too despicable. Every bad guy needs to be admirable in some way, but he was just a low-IQ strong man with a jealous, vindictive streak. His only positive quality was surgically implanted and admittedly third rate technology. I kept looking for the mysterious slave traders to take over his role.\nFinally, I was mildly annoyed with some of the technological anachronisms. For example, how can an organization that possesses artificial intelligence capable of infiltrating an entire planet’s police and military networks not have the data processing capacity to handle the incoming data from its scattered survey missions? They can build FTL starships, but they can’t make a hideable security camera? I can believe this is possible, but I’d like some kind of explanation. (But show me. Don’t tell me.) This is a very common problem in science fiction, and only the best writers are able to overcome it in a way that satisfies me.\nKiti Lappi has written a fun, middle-grade adventure story, but it needs to be tightened up. If she chooses to rework it, the next draft will likely take much more time and effort than she has spent to date. The challenges aren’t insurmountable, but they are significant.",
  "tags": [
    "Book Review",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-03T08:44:00+00:00"
}