{
  "url": "https://voxday.net/2013/12/17/boycotting-israe/",
  "scraped_at": "2025-12-15T16:40:24.739934",
  "title": "Boycotting Israel",
  "date_display": "December 17, 2013",
  "date_iso": "2013-12-17T21:00:00+00:00",
  "date_from_url": "2013-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, I’m of two minds concerning the various academic and corporate <a href=\"http://www.nytimes.com/2013/12/17/education/scholars-group-endorses-an-academic-boycott-of-israel.html?hpw&amp;rref=education\">boycotts of Israel</a>.</p><blockquote class=\"tr_bq\"><p> An American organization of professors on Monday announced a boycott of<br> Israeli academic institutions to protest Israel’s treatment of<br> Palestinians, signaling that a movement to isolate and pressure Israel<br> that is gaining ground in Europe has begun to make strides in the United<br> States.</br></br></br></br></p></blockquote><p>On the one hand, it is egregiously unfair to single out Israel for its unfair treatment of the Palestinians. Israel does not treat its non-Jewish citizens as equals, but the Palestinians still have it better than many people in many other countries. I have absolutely no problem with Jews possessing a Jewish state and practicing an Israeli form of apartheid in order to maintain it.</p><p>On the other hand, it is fitting to see those who were anti-South African apartheid getting a taste of their own medicine. Despite the ties between the two so-called pariah countries, many Israelis were vociferously supportive of the South African boycotts and even of the ANC’s terrorist activities. For example, <a href=\"http://forward.com/articles/143231/south-african-jews-struggle-with-legacy-of-aparthe/\">Arthur Goldreich was the head of the ANC’s logistics committee</a> and provided weapons to the terrorist arm of the ANC. Since so many Jews have actively worked to undermine white apartheid, to deny the Boers a Boer state, and to end American segregation over the years, it’s hard to feel any pity for them when observing that the anti-apartheid machinery they helped create has now turned on them.</p><p>In war or in politics, the challenge is that the other side always learns from the successes of the other. And the effective strategist should never lose sight of the fact that he will eventually have to face whatever weapon he first directs against the opposition.</p></div>",
  "content_text": "I have to admit, I’m of two minds concerning the various academic and corporate\nboycotts of Israel\n.\nAn American organization of professors on Monday announced a boycott of\nIsraeli academic institutions to protest Israel’s treatment of\nPalestinians, signaling that a movement to isolate and pressure Israel\nthat is gaining ground in Europe has begun to make strides in the United\nStates.\nOn the one hand, it is egregiously unfair to single out Israel for its unfair treatment of the Palestinians. Israel does not treat its non-Jewish citizens as equals, but the Palestinians still have it better than many people in many other countries. I have absolutely no problem with Jews possessing a Jewish state and practicing an Israeli form of apartheid in order to maintain it.\nOn the other hand, it is fitting to see those who were anti-South African apartheid getting a taste of their own medicine. Despite the ties between the two so-called pariah countries, many Israelis were vociferously supportive of the South African boycotts and even of the ANC’s terrorist activities. For example,\nArthur Goldreich was the head of the ANC’s logistics committee\nand provided weapons to the terrorist arm of the ANC. Since so many Jews have actively worked to undermine white apartheid, to deny the Boers a Boer state, and to end American segregation over the years, it’s hard to feel any pity for them when observing that the anti-apartheid machinery they helped create has now turned on them.\nIn war or in politics, the challenge is that the other side always learns from the successes of the other. And the effective strategist should never lose sight of the fact that he will eventually have to face whatever weapon he first directs against the opposition.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-17T21:00:00+00:00"
}