{
  "url": "https://voxday.net/2013/12/16/camille-paglia-on-importance-of-men/",
  "scraped_at": "2025-12-15T16:40:16.655214",
  "title": "Camille Paglia on the importance of men",
  "date_display": "December 16, 2013",
  "date_iso": "2013-12-16T18:10:00+00:00",
  "date_from_url": "2013-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>La Paglia has little confidence <a href=\"http://ideas.time.com/2013/12/16/its-a-mans-world-and-it-always-will-be/print/\">in feminist civilization</a>. Assuming, of course, that one can reasonably even call it that.</p><blockquote class=\"tr_bq\"><p> A peevish, grudging rancor against men has been one of the most unpalatable and unjust features of second- and third-wave feminism. Men’s faults, failings and foibles have been seized on and magnified into gruesome bills of indictment. Ideologue professors at our leading universities indoctrinate impressionable undergraduates with carelessly fact-free theories alleging that gender is an arbitrary, oppressive fiction with no basis in biology.</p><p>Is it any wonder that so many high-achieving young women, despite all the happy talk about their academic success, find themselves in the early stages of their careers in chronic uncertainty or anxiety about their prospects for an emotionally fulfilled private life? When an educated culture routinely denigrates masculinity and manhood, then women will be perpetually stuck with boys, who have no incentive to mature or to honor their commitments. And without strong men as models to either embrace or (for dissident lesbians) to resist, women will never attain a centered and profound sense of themselves as women….</p><p>After the next inevitable apocalypse, men will be desperately needed<br> again! Oh, sure, there will be the odd gun-toting Amazonian survivalist<br> gal, who can rustle game out of the bush and feed her flock, but most<br> women and children will be expecting men to scrounge for food and water<br> and to defend the home turf. Indeed, men are absolutely indispensable<br> right now, invisible as it is to most feminists, who seem blind to the<br> infrastructure that makes their own work lives possible.</br></br></br></br></br></br></p></blockquote><p>TL;DR: viva la difference!</p></div>",
  "content_text": "La Paglia has little confidence\nin feminist civilization\n. Assuming, of course, that one can reasonably even call it that.\nA peevish, grudging rancor against men has been one of the most unpalatable and unjust features of second- and third-wave feminism. Men’s faults, failings and foibles have been seized on and magnified into gruesome bills of indictment. Ideologue professors at our leading universities indoctrinate impressionable undergraduates with carelessly fact-free theories alleging that gender is an arbitrary, oppressive fiction with no basis in biology.\nIs it any wonder that so many high-achieving young women, despite all the happy talk about their academic success, find themselves in the early stages of their careers in chronic uncertainty or anxiety about their prospects for an emotionally fulfilled private life? When an educated culture routinely denigrates masculinity and manhood, then women will be perpetually stuck with boys, who have no incentive to mature or to honor their commitments. And without strong men as models to either embrace or (for dissident lesbians) to resist, women will never attain a centered and profound sense of themselves as women….\nAfter the next inevitable apocalypse, men will be desperately needed\nagain! Oh, sure, there will be the odd gun-toting Amazonian survivalist\ngal, who can rustle game out of the bush and feed her flock, but most\nwomen and children will be expecting men to scrounge for food and water\nand to defend the home turf. Indeed, men are absolutely indispensable\nright now, invisible as it is to most feminists, who seem blind to the\ninfrastructure that makes their own work lives possible.\nTL;DR: viva la difference!",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-16T18:10:00+00:00"
}