{
  "url": "https://voxday.net/2013/12/19/correcting-ny/",
  "scraped_at": "2025-12-15T16:40:35.354789",
  "title": "Correcting the NYT",
  "date_display": "December 19, 2013",
  "date_iso": "2013-12-19T14:00:00+00:00",
  "date_from_url": "2013-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times <a href=\"http://www.nytimes.com/2013/12/19/opinion/is-fascism-returning-to-europe.html?pagewanted=2&amp;_r=0&amp;hp&amp;rref=opinion\">has Europe precisely backwards</a> as falsely equates fascism with populism. In Europe, it is the anti-immigrant populist parties that are pro-democracy and anti-fascism; some of them are openly left-wing. Fascism is not returning to Europe, it is already there in the form of the openly anti-democratic and corporatist European Union.</p><blockquote class=\"tr_bq\"><p> Across the Atlantic, however, populism is resurgent. Indeed, many fear that the European Parliament may be at risk of a right-wing populist takeover following elections in May 2014. In France, Marine Le Pen’s far-right National Front has, for the first time in that country’s history, pulled ahead in polls for the European Union election. Ahead of the elections to the European Parliament, Ms. Le Pen recently announced her intention to form a “Eurosceptic” alliance with the Dutch politician Geert Wilders , whose right-wing Party for Freedom demonizes Islam and attacks immigration.</p><p>In Italy, former Prime Minister Silvio Berlusconi, who controlled politics in that country for decades, peppered his Thatcherite free-market nationalism with spectacular doses of scandal, shady dealings and corruption. In his wake, “populism from above” has given way to a staunchly anti-political populism from below. Beppe Grillo, a comedian turned activist, sent shock waves through the establishment in February when his Five Star Movement won 25 percent of the vote. Mr. Grillo, who in the run-up to the election called for a referendum on whether to keep Italy in the euro zone, stressed the need to wrest power from the oligarchic elite and return it to the people. Prime Minister Enrico Letta, who took office in April, recently warned that populism posed a threat to European Union stability.</p><p>While they may seek the breakup of the European Union, most of these new European populist movements don’t aim to eliminate democracy altogether. In Greece, however, the emergence of a strand of populism deeply rooted in the fascist past is particularly troubling. The country’s crippling financial ills, and Brussels’ insistence on austerity measures, have generated populist responses that evoke the worst of interwar European fascism. The neo-fascist Golden Dawn party, which won 7 percent of the vote in Greece’s 2012 parliamentary elections, openly uses a logo resembling a swastika. Its supporters have perpetrated violent physical attacks on immigrants and political opponents (including murder); its party line includes anti-Semitism and Holocaust denial. Similar sentiments are also on the rise in Hungary, where the nationalistic, anti-immigration, anti-Semitic Jobbik party is in line to become the second-largest in Parliament.</p><p>With their radical stance against pluralism and minority rights, Greece’s right-wing populists and their Hungarian counterparts — along with dozens of anti-European Union parties poised to win seats in next year’s parliamentary elections — make today’s burgeoning European brands of populism much more frightening than their Latin American counterparts.</p></blockquote><p>There is nothing at all frightening about the much-needed resurgence of nationalism in Europe. The European people have turned aggressively against multiculturalism and mass immigration, and because the European media is dominated by social democrats rather than the rabid immigrationists that run the US media, the reporting is considerably more even-handed there. The article fails to note that there are twice as many Golden Dawn members murdered by its political opponents than there are Golden Dawn-affiliated murders or to point out that its anti-democratic political opponents have actually tried outlaw the party.</p><p>Europe isn’t religious in the same sense that America is, but on the other hand, their sense of belonging to an identifiably Christian nationalist culture tends to runs more deeply and is firmly entrenched in many of the most secular Europeans. They have seen the consequences of multiculturalism and most of them hate it. And unlike Americans, even the most famously tolerant Europeans, the Swiss, have a history of practicing rigid ethnic, religious, and linguistic cleansing.</p><p>In a comment on a previous post that is relevant here, Steve notes that<br> everything we used to believe concerning the positive aspects of both the European Union and American<br> left-liberalism were based on lies: <i>“The same people who used to skate by on “commitment to scientific<br> truth, democracy, and tolerance” are increasingly discarding the velvet<br> glove in favor of the iron fist now that science is strongly suggesting<br> they are wrong, the popular will is moving against democracy, and their<br> “tolerance” is now proven to go only one way –  towards tolerating<br> sexual perversion,anti-Christian religious persecution, and anti-white<br> racism.”</br></br></br></br></br></br></i></br></br></p></div>",
  "content_text": "The New York Times\nhas Europe precisely backwards\nas falsely equates fascism with populism. In Europe, it is the anti-immigrant populist parties that are pro-democracy and anti-fascism; some of them are openly left-wing. Fascism is not returning to Europe, it is already there in the form of the openly anti-democratic and corporatist European Union.\nAcross the Atlantic, however, populism is resurgent. Indeed, many fear that the European Parliament may be at risk of a right-wing populist takeover following elections in May 2014. In France, Marine Le Pen’s far-right National Front has, for the first time in that country’s history, pulled ahead in polls for the European Union election. Ahead of the elections to the European Parliament, Ms. Le Pen recently announced her intention to form a “Eurosceptic” alliance with the Dutch politician Geert Wilders , whose right-wing Party for Freedom demonizes Islam and attacks immigration.\nIn Italy, former Prime Minister Silvio Berlusconi, who controlled politics in that country for decades, peppered his Thatcherite free-market nationalism with spectacular doses of scandal, shady dealings and corruption. In his wake, “populism from above” has given way to a staunchly anti-political populism from below. Beppe Grillo, a comedian turned activist, sent shock waves through the establishment in February when his Five Star Movement won 25 percent of the vote. Mr. Grillo, who in the run-up to the election called for a referendum on whether to keep Italy in the euro zone, stressed the need to wrest power from the oligarchic elite and return it to the people. Prime Minister Enrico Letta, who took office in April, recently warned that populism posed a threat to European Union stability.\nWhile they may seek the breakup of the European Union, most of these new European populist movements don’t aim to eliminate democracy altogether. In Greece, however, the emergence of a strand of populism deeply rooted in the fascist past is particularly troubling. The country’s crippling financial ills, and Brussels’ insistence on austerity measures, have generated populist responses that evoke the worst of interwar European fascism. The neo-fascist Golden Dawn party, which won 7 percent of the vote in Greece’s 2012 parliamentary elections, openly uses a logo resembling a swastika. Its supporters have perpetrated violent physical attacks on immigrants and political opponents (including murder); its party line includes anti-Semitism and Holocaust denial. Similar sentiments are also on the rise in Hungary, where the nationalistic, anti-immigration, anti-Semitic Jobbik party is in line to become the second-largest in Parliament.\nWith their radical stance against pluralism and minority rights, Greece’s right-wing populists and their Hungarian counterparts — along with dozens of anti-European Union parties poised to win seats in next year’s parliamentary elections — make today’s burgeoning European brands of populism much more frightening than their Latin American counterparts.\nThere is nothing at all frightening about the much-needed resurgence of nationalism in Europe. The European people have turned aggressively against multiculturalism and mass immigration, and because the European media is dominated by social democrats rather than the rabid immigrationists that run the US media, the reporting is considerably more even-handed there. The article fails to note that there are twice as many Golden Dawn members murdered by its political opponents than there are Golden Dawn-affiliated murders or to point out that its anti-democratic political opponents have actually tried outlaw the party.\nEurope isn’t religious in the same sense that America is, but on the other hand, their sense of belonging to an identifiably Christian nationalist culture tends to runs more deeply and is firmly entrenched in many of the most secular Europeans. They have seen the consequences of multiculturalism and most of them hate it. And unlike Americans, even the most famously tolerant Europeans, the Swiss, have a history of practicing rigid ethnic, religious, and linguistic cleansing.\nIn a comment on a previous post that is relevant here, Steve notes that\neverything we used to believe concerning the positive aspects of both the European Union and American\nleft-liberalism were based on lies:\n“The same people who used to skate by on “commitment to scientific\ntruth, democracy, and tolerance” are increasingly discarding the velvet\nglove in favor of the iron fist now that science is strongly suggesting\nthey are wrong, the popular will is moving against democracy, and their\n“tolerance” is now proven to go only one way –  towards tolerating\nsexual perversion,anti-Christian religious persecution, and anti-white\nracism.”",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-19T14:00:00+00:00"
}