{
  "url": "https://voxday.net/2013/12/18/cracks-in-wall-of-debt-delusion/",
  "scraped_at": "2025-12-15T16:40:28.390744",
  "title": "Cracks in the wall of debt-delusion",
  "date_display": "December 18, 2013",
  "date_iso": "2013-12-18T14:00:00+00:00",
  "date_from_url": "2013-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or in other words, <a href=\"http://www.businessspectator.com.au/article/2013/12/16/economy/oh-my-paul-krugman-edition\">Paul Krugman discovers debt</a>. On May 12 of 2012, Paul Krugman confessed that he had no idea what Steve Keen was talking about with regards to how debt deflation reduces demand:</p><blockquote class=\"tr_bq\"><p> “Keen then goes on to assert that lending is, by definition (at least as I understand it), an addition to aggregate demand. I guess I don’t get that at all. If I decide to cut back on my spending and stash the funds in a bank, which lends them out to someone else, this doesn’t have to represent a net increase in demand. Yes, in some (many) cases lending is associated with higher demand, because resources are being transferred to people with a higher propensity to spend; but Keen seems to be saying something else, and I’m not sure what. I think it has something to do with the notion that creating money = creating demand, but again that isn’t right in any model I understand.” (Minsky and Methodology (Wonkish), March 27, 2012)</p></blockquote><p>However, it has become so obvious that without growing debt, people cannot afford to pay for things, (thereby reducing demand), that even Paul Krugman has finally noticed, Neo-Keynesian models of exogenous debt be damned. But, as is his wont, Krugman pretends to have known this all along:</p><blockquote class=\"tr_bq\"><p> “Start with the point I’ve raised several times, and others have raised as well: underneath the apparent stability of the Great Moderation lurked a rapid rise in debt that is now being unwound … Debt was rising by around 2 per cent of GDP annually; that’s not going to happen in future, which a naïve calculation suggests means a reduction in demand, other things equal, of around 2 percent of GDP.” (Secular Stagnation Arithmetic, December 7, 2013)</p></blockquote><p>And notice his comment about debt rising by around two percent of GDP annually; is he finally paying attention to L1 only 11 years after I first warned about it? This is an astonishing development and may represent the first big cracks in the epic Keynesian wall of delusion concerning the exogenous, and therefore innocuous, nature of domestic debt.</p><p>In RGD, I demonstrated that debt not only effects demand, but prices as well. That’s why we can be certain that housing prices will not recover anytime soon and college tuitions cannot continue to rise, as their elevated price levels are almost entirely the result of the post-2001 explosion of easy credit. In fact, I even explained the connection between debt and demand in my proposed modification of the core mechanism of the Austrian Business Cycle on a post entitled <a href=\"http://www.milobookclub.com/2009/06/18/limits-of-demand/\">The Limits of Demand</a> back in June 2009:</p><p><i>“I suggest the cycle can be better understood if we broaden our<br> perspective when looking at the middle phase of the cycle and consider<br> how the expansion of bank credit will also lead to malinvestment for<br> reasons that are not dependent upon the shifting production ratio<br> between capital goods and consumer goods by utilizing a price-based<br> variant of the Keynesian acceleration principle.  This begins with<br> recognizing the obvious causal connection between increased bank<br> credit and price distortions, since cheap credit permits consumers to<br> purchase goods at prices they could not otherwise have afforded; this is<br> what cheap credit is expected to do and is the reason loan<br> consolidations and other forms of consumer credit are advertised on<br> television.  The easy availability of cheap credit permits the purchase<br> of houses, college tuitions, and cars by a much broader range of buyers<br> than would otherwise be the case, so as the law of supply and demand<br> dictates, <b>an increase in the availability of debt will lead to an<br> increase in demand</br></b> which will necessarily drive the price of those goods<br> being purchased by debt higher relative to the price of goods not being<br> purchased by debt.” </br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></i></p><p>The converse of the bolded text is of course also true, hence my expectation of economic contraction following the debt-deflation as well as my observation of economic stagnation as a result of the current debt-disinflation. But then, I don’t have a Nobel Prize or anything.</p></div>",
  "content_text": "Or in other words,\nPaul Krugman discovers debt\n. On May 12 of 2012, Paul Krugman confessed that he had no idea what Steve Keen was talking about with regards to how debt deflation reduces demand:\n“Keen then goes on to assert that lending is, by definition (at least as I understand it), an addition to aggregate demand. I guess I don’t get that at all. If I decide to cut back on my spending and stash the funds in a bank, which lends them out to someone else, this doesn’t have to represent a net increase in demand. Yes, in some (many) cases lending is associated with higher demand, because resources are being transferred to people with a higher propensity to spend; but Keen seems to be saying something else, and I’m not sure what. I think it has something to do with the notion that creating money = creating demand, but again that isn’t right in any model I understand.” (Minsky and Methodology (Wonkish), March 27, 2012)\nHowever, it has become so obvious that without growing debt, people cannot afford to pay for things, (thereby reducing demand), that even Paul Krugman has finally noticed, Neo-Keynesian models of exogenous debt be damned. But, as is his wont, Krugman pretends to have known this all along:\n“Start with the point I’ve raised several times, and others have raised as well: underneath the apparent stability of the Great Moderation lurked a rapid rise in debt that is now being unwound … Debt was rising by around 2 per cent of GDP annually; that’s not going to happen in future, which a naïve calculation suggests means a reduction in demand, other things equal, of around 2 percent of GDP.” (Secular Stagnation Arithmetic, December 7, 2013)\nAnd notice his comment about debt rising by around two percent of GDP annually; is he finally paying attention to L1 only 11 years after I first warned about it? This is an astonishing development and may represent the first big cracks in the epic Keynesian wall of delusion concerning the exogenous, and therefore innocuous, nature of domestic debt.\nIn RGD, I demonstrated that debt not only effects demand, but prices as well. That’s why we can be certain that housing prices will not recover anytime soon and college tuitions cannot continue to rise, as their elevated price levels are almost entirely the result of the post-2001 explosion of easy credit. In fact, I even explained the connection between debt and demand in my proposed modification of the core mechanism of the Austrian Business Cycle on a post entitled\nThe Limits of Demand\nback in June 2009:\n“I suggest the cycle can be better understood if we broaden our\nperspective when looking at the middle phase of the cycle and consider\nhow the expansion of bank credit will also lead to malinvestment for\nreasons that are not dependent upon the shifting production ratio\nbetween capital goods and consumer goods by utilizing a price-based\nvariant of the Keynesian acceleration principle.  This begins with\nrecognizing the obvious causal connection between increased bank\ncredit and price distortions, since cheap credit permits consumers to\npurchase goods at prices they could not otherwise have afforded; this is\nwhat cheap credit is expected to do and is the reason loan\nconsolidations and other forms of consumer credit are advertised on\ntelevision.  The easy availability of cheap credit permits the purchase\nof houses, college tuitions, and cars by a much broader range of buyers\nthan would otherwise be the case, so as the law of supply and demand\ndictates,\nan increase in the availability of debt will lead to an\nincrease in demand\nwhich will necessarily drive the price of those goods\nbeing purchased by debt higher relative to the price of goods not being\npurchased by debt.”\nThe converse of the bolded text is of course also true, hence my expectation of economic contraction following the debt-deflation as well as my observation of economic stagnation as a result of the current debt-disinflation. But then, I don’t have a Nobel Prize or anything.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-18T14:00:00+00:00"
}