{
  "url": "https://voxday.net/2013/12/08/eco-on-death-of-william-weaver/",
  "scraped_at": "2025-12-15T16:39:23.454641",
  "title": "Umberto Eco on the death of William Weaver",
  "date_display": "December 8, 2013",
  "date_iso": "2013-12-08T14:00:00+00:00",
  "date_from_url": "2013-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"margin-bottom: 0in;\"> Umberto Eco eulogized his translator and friend, William Weaver, in an article that was published on 3 December, 2013 in L’Espresso.</div><blockquote class=\"tr_bq\"><div style=\"margin-bottom: 0in;\"> <a href=\"http://espresso.repubblica.it/opinioni/la-bustina-di-minerva/2013/11/28/news/ciao-bill-1.143220\">Ciao, Bill </a></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> After ninety years, the last ten of them reduced to a quasi-vegetable state, William Weaver is no more. He was<br> a great translator, and one could say that it was primarily through his merits<br> that our contemporary literature is known and loved in the<br> Anglo-Saxon countries. Born in Virginia, a conscientious objector but<br> unable to ignore the grand conflict that was underway, he enlisted in the Second<br> World War as an ambulance driver. He served with the<br> English forces throughout the entire Italian campaign, facing danger without ever holding a rifle in his hands. From Naples to Rome, he<br> made friends with many Italian writers of the era, and from then on,<br> he never left our country.</br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Thus it was that he came to translate Pirandello (<i>One, No One, and One Hundred Thousand</i> and<i> The<br> Late Mattia Pascal</br></i>), <i>Zeno’s Conscience</i> by Svevo, <i>That<br> Awful Mess</br></i> and <i>Acquainted with Grief</i><br> by Gadda, two-thirds of<br> Calvino’s works, <i>The Monkey’s Wrench</i><br> and <i>If Not Now, When?</i><br> by Primo Levi, <i>The Sunday Woman</i><br> by Fruttero and Lucentini,<br> <i>History</i> and <i>Aracoeli</i><br> by Elsa Morante, <i>Incubus</i><br> by Berto, <i>A Violent Life</i><br> by Pasolini, as well as Cassola, Calasso, De Carlo, Malerba, La<br> Capria, Parise, Soldati, Alba de Cespedes, Festa Campanile. He also<br> translated <i>A Man</i> and<br> <i>Inshallah</i> by Oriana<br> Fallaci.<p>In addition, from 1981 to 2003 he translated<br> four of my novels and many of my essays. For twenty intense years, it<br> was a splendid collaboration, in which we could spend afternoons, or<br> exchange two or three letters, on a single word. If the culture has<br> lost a great writer, I have lost a friend. Weaver was a great<br> translator, not only because he sought to accurately render the<br> fluidity, the rhythm, the lexical richness, and the sound of the text. (From my<br> perspective, he sometimes improved upon my original.) He was a great<br> translator because he also knew that to translate the meaning, one must<br> dare to reject the literal translation in order to conserve the<br> effect or the deeper sense of the text. For reasons of space, I am<br> limited to relating one amusing memory, of a time in which we tore the text apart in order to render a simple play on words, a wordplay that was already<br> difficult for Italian readers.</br></br></br></br></br></br></br></br></br></br></br></br></p></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"> Bill was translating my <i>Foucault’s<br> Pendulum. </br></i>He arrived at a<br> point in which two protagonists, obsessed with the world of the<br> occult, found a mysterious symbol tied to the transmission system in<br> automobiles. To demonstrate, in an ironic manner, their propensity to<br> think that every aspect of the world, every word written or spoken,<br> does not have the sense it appears, an allusion to the axle  of<br> the Sephirot of the Kabbalah was made.</br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> For<br> the English translator<br> this allusion presented difficulties from the start, because in English<br> there is a difference between a “tree” (vegetable and<br> cabalistic), and the axle (automobile), but after foraging through<br> the dictionary, Weaver discovered that the expression “axle-tree”<br> was legitimate. Nevertheless,<br> he found himself in a predicament when the two characters then<br> engaged in a certain word play that involved<br> the gnostic pneumatics, (the spirits opposite the somatics, that are<br> immaterial), and the pneumatics of a car. It was a joke, but the<br> protagonists were simply making jokes.</br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> However, in English, the rubber upon<br> which an automobile’s wheels roll are not “pneumatics”, but<br> rather, “tires”. What to do? Weaver, as he recounts in his<br> translation diary, <i>Pendulum Diary</i>, was struck by a brilliant notion when he remembered the name of a celebrated brand of tires: Firestone. It occurred to him that one might draw an association<br> between that name and the English expression “philosopher’s stone”<br> of alchemic lore. The solution was found and the English text therefore<br> describes how the sightless occultists did not succeed in finding the<br> true connection between the philosopher’s stone and Firestone.</br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> As one can see, he turned the gag into<br> something different than the original. The translator must render<br> the deeper sense of the text, one that is not “the protagonists<br> speak of tires”, but rather, “the protagonists are students who<br> play foolishly with the universal knowledge”.</br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> As the Prince of Laughter once said,<br> translators are born. And Bill was a born translator.</br></div></blockquote><p>This is not only an affectionate tribute to a great translator, but wonderful advice that I hope everyone who is translating one of my books into another language will keep in mind. It is always <i>il senso profondo del testo</i> that comes first, not <i>il testo literale</i>.</p><p>Speaking of translations, I’ve translated eleven or twelve of Eco’s online articles that aren’t otherwise available in English. If you are a fan of his, you can <a href=\"http://voxday.blogspot.com/search/label/Eco\">find them here</a>.</p></div>",
  "content_text": "Umberto Eco eulogized his translator and friend, William Weaver, in an article that was published on 3 December, 2013 in L’Espresso.\nCiao, Bill\nAfter ninety years, the last ten of them reduced to a quasi-vegetable state, William Weaver is no more. He was\na great translator, and one could say that it was primarily through his merits\nthat our contemporary literature is known and loved in the\nAnglo-Saxon countries. Born in Virginia, a conscientious objector but\nunable to ignore the grand conflict that was underway, he enlisted in the Second\nWorld War as an ambulance driver. He served with the\nEnglish forces throughout the entire Italian campaign, facing danger without ever holding a rifle in his hands. From Naples to Rome, he\nmade friends with many Italian writers of the era, and from then on,\nhe never left our country.\nThus it was that he came to translate Pirandello (\nOne, No One, and One Hundred Thousand\nand\nThe\nLate Mattia Pascal\n),\nZeno’s Conscience\nby Svevo,\nThat\nAwful Mess\nand\nAcquainted with Grief\nby Gadda, two-thirds of\nCalvino’s works,\nThe Monkey’s Wrench\nand\nIf Not Now, When?\nby Primo Levi,\nThe Sunday Woman\nby Fruttero and Lucentini,\nHistory\nand\nAracoeli\nby Elsa Morante,\nIncubus\nby Berto,\nA Violent Life\nby Pasolini, as well as Cassola, Calasso, De Carlo, Malerba, La\nCapria, Parise, Soldati, Alba de Cespedes, Festa Campanile. He also\ntranslated\nA Man\nand\nInshallah\nby Oriana\nFallaci.\nIn addition, from 1981 to 2003 he translated\nfour of my novels and many of my essays. For twenty intense years, it\nwas a splendid collaboration, in which we could spend afternoons, or\nexchange two or three letters, on a single word. If the culture has\nlost a great writer, I have lost a friend. Weaver was a great\ntranslator, not only because he sought to accurately render the\nfluidity, the rhythm, the lexical richness, and the sound of the text. (From my\nperspective, he sometimes improved upon my original.) He was a great\ntranslator because he also knew that to translate the meaning, one must\ndare to reject the literal translation in order to conserve the\neffect or the deeper sense of the text. For reasons of space, I am\nlimited to relating one amusing memory, of a time in which we tore the text apart in order to render a simple play on words, a wordplay that was already\ndifficult for Italian readers.\nBill was translating my\nFoucault’s\nPendulum.\nHe arrived at a\npoint in which two protagonists, obsessed with the world of the\noccult, found a mysterious symbol tied to the transmission system in\nautomobiles. To demonstrate, in an ironic manner, their propensity to\nthink that every aspect of the world, every word written or spoken,\ndoes not have the sense it appears, an allusion to the axle  of\nthe Sephirot of the Kabbalah was made.\nFor\nthe English translator\nthis allusion presented difficulties from the start, because in English\nthere is a difference between a “tree” (vegetable and\ncabalistic), and the axle (automobile), but after foraging through\nthe dictionary, Weaver discovered that the expression “axle-tree”\nwas legitimate. Nevertheless,\nhe found himself in a predicament when the two characters then\nengaged in a certain word play that involved\nthe gnostic pneumatics, (the spirits opposite the somatics, that are\nimmaterial), and the pneumatics of a car. It was a joke, but the\nprotagonists were simply making jokes.\nHowever, in English, the rubber upon\nwhich an automobile’s wheels roll are not “pneumatics”, but\nrather, “tires”. What to do? Weaver, as he recounts in his\ntranslation diary,\nPendulum Diary\n, was struck by a brilliant notion when he remembered the name of a celebrated brand of tires: Firestone. It occurred to him that one might draw an association\nbetween that name and the English expression “philosopher’s stone”\nof alchemic lore. The solution was found and the English text therefore\ndescribes how the sightless occultists did not succeed in finding the\ntrue connection between the philosopher’s stone and Firestone.\nAs one can see, he turned the gag into\nsomething different than the original. The translator must render\nthe deeper sense of the text, one that is not “the protagonists\nspeak of tires”, but rather, “the protagonists are students who\nplay foolishly with the universal knowledge”.\nAs the Prince of Laughter once said,\ntranslators are born. And Bill was a born translator.\nThis is not only an affectionate tribute to a great translator, but wonderful advice that I hope everyone who is translating one of my books into another language will keep in mind. It is always\nil senso profondo del testo\nthat comes first, not\nil testo literale\n.\nSpeaking of translations, I’ve translated eleven or twelve of Eco’s online articles that aren’t otherwise available in English. If you are a fan of his, you can\nfind them here\n.",
  "tags": [
    "Eco",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-08T14:00:00+00:00"
}