{
  "url": "https://voxday.net/2013/12/18/eco-on-end-of-prin/",
  "scraped_at": "2025-12-15T16:40:26.551459",
  "title": "Eco on the disappearance of the book",
  "date_display": "December 18, 2013",
  "date_iso": "2013-12-18T08:30:00+00:00",
  "date_from_url": "2013-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"margin-bottom: 0in;\"> Umberto Eco considered a failed prophecy of Marshall McLuhan in light of recent developments in e-publishing in an article published on October 30, 2013 in L’Espresso.</div><blockquote class=\"tr_bq\"><div style=\"margin-bottom: 0in;\"> <b><a href=\"http://espresso.repubblica.it/opinioni/la-bustina-di-minerva/2013/10/30/news/chi-ha-paura-delle-tigri-di-carta-1.139535\">Who is afraid of the paper tiger?</a></b></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> At the start of the Seventies, Marshall<br> McLuhan announced some profound changes in our ways of thinking and<br> communication. One of his intuitions was that we were entering into a<br> global village, and in the universe of the Internet we have certainly<br> seen the verification of his vision. However, after analyzing the<br> influence of the printing press on the evolution of the culture and<br> our individual sensibilities in <i>The Gutenberg Galaxy</i>, McLuhan<br> announced, in <i>Understanding Media</i> and other works, the sunset<br> of alphabetic linearity and the newly arisen dominance of images. To<br> hypersimplify this, he anticipated that the masses “will no longer<br> read anymore, they will watch TV, (or the strobing lights of the<br> disco).”</br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> <a href=\"http://www.blogger.com/null\" name=\"result_box\"></a>McLuhan died<br> in 1980, just as we were entering the daily world of the personal<br> computer. (There appeared models that were more or less toys and<br> experimental objects at the end of the Seventies, but the mass market<br> began in 1981 with the IBM PC.) If McLuhan had lived<br> a few more years, he would<br> have had to admit that<br> even in a world apparently<br> dominated by images,<br> the personal computer was establishing a<br> new alphabetical civilization.<br> It may be true that the preschoolers of today use iPads, but all the<br> information we receive from the Internet, email, and SMS are based on<br> our knowledge of the<br> alphabet. Computers perfect the situation imagined in Hugo’s <i>The<br> Hunchback of Notre Dame</br></i>, in which the<br> archdeacon Frollo, indicating first a book, and then the cathedral<br> seen from the window, rich with images and other visual symbols,<br> says: “this will kill that”. With all its<br> multimedia links, the computer certainly<br> possesses the characteristics of being the instrument of the global<br> village, and it has the capacity to revive again the “that” of<br> the Gothic cathedral, but it still<br> fundamentally rests upon neo-gutenbergian<br> principles.<p>To return to the alphabet, the invention of<br> the ebook has provided the possibility to read alphabetic texts on<br> screens instead of paper. And on these screens one can expect to read<br> yet another series of auguries predicting the disappearance of the<br> book and of the newspaper, (in part suggested by some declines in<br> sales.) One of the favorite sports of every unimaginative journalist<br> over the years is to ask the men of letters how they see the coming<br> demise of the world of print. It is not enough to argue that the book<br> remains of fundamental importance to the transmission and<br> conservation of information, or that we have scientific proof that<br> books printed 500 years ago have survived wonderfully while we cannot<br> scientifically demonstrate that the magnetized storage systems<br> presently in use can survive for more than ten years. (Nor can we<br> verify this, since computers today cannot read a floppy disk from the<br> Eighties.)</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Now, however, there are some<br> disconcerting occurrences that have caught the attention of<br> journalists, although we have not yet grasped their significance and<br> their eventual consequences. In August, Jeff Bezos of Amazon bought<br> the <i>Washington Post</i>, and while announcing the decline of the daily<br> newspaper, Warren Buffet recently acquired some 63 local newpapers. As<br> Federico Rampini observed in <i>Repubblica</i> the other day, Buffet is a giant<br> of the Old Economy and he is not an innovator, but he has a rare<br> acuity for discerning investment opportunities. And I suspect<br> that other sharks of Silicon Valley are also moving against the<br> newspapers.</br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Rampini asked if the final blow will<br> not be Bill Gates or Mark Zuckerberg purchasing the <i>New York Times</i>.<br> Even if this doesn’t happen, it is clear that the digital world is<br> overtaking print. What about commercial calculations, political<br> speculations, and the desire to preserve the press as a democratic<br> watchdog? I don’t feel that I have a sufficient grasp on the situation to<br> interpret these various facts correctly. However, I think it is interesting to<br/> consider the possibility of the reversal of another famous prophecy. Perhaps<br/> Mao had it wrong and one must take the paper tiger seriously.</br></br></br></br></br></br></div></blockquote></div>",
  "content_text": "Umberto Eco considered a failed prophecy of Marshall McLuhan in light of recent developments in e-publishing in an article published on October 30, 2013 in L’Espresso.\nWho is afraid of the paper tiger?\nAt the start of the Seventies, Marshall\nMcLuhan announced some profound changes in our ways of thinking and\ncommunication. One of his intuitions was that we were entering into a\nglobal village, and in the universe of the Internet we have certainly\nseen the verification of his vision. However, after analyzing the\ninfluence of the printing press on the evolution of the culture and\nour individual sensibilities in\nThe Gutenberg Galaxy\n, McLuhan\nannounced, in\nUnderstanding Media\nand other works, the sunset\nof alphabetic linearity and the newly arisen dominance of images. To\nhypersimplify this, he anticipated that the masses “will no longer\nread anymore, they will watch TV, (or the strobing lights of the\ndisco).”\nMcLuhan died\nin 1980, just as we were entering the daily world of the personal\ncomputer. (There appeared models that were more or less toys and\nexperimental objects at the end of the Seventies, but the mass market\nbegan in 1981 with the IBM PC.) If McLuhan had lived\na few more years, he would\nhave had to admit that\neven in a world apparently\ndominated by images,\nthe personal computer was establishing a\nnew alphabetical civilization.\nIt may be true that the preschoolers of today use iPads, but all the\ninformation we receive from the Internet, email, and SMS are based on\nour knowledge of the\nalphabet. Computers perfect the situation imagined in Hugo’s\nThe\nHunchback of Notre Dame\n, in which the\narchdeacon Frollo, indicating first a book, and then the cathedral\nseen from the window, rich with images and other visual symbols,\nsays: “this will kill that”. With all its\nmultimedia links, the computer certainly\npossesses the characteristics of being the instrument of the global\nvillage, and it has the capacity to revive again the “that” of\nthe Gothic cathedral, but it still\nfundamentally rests upon neo-gutenbergian\nprinciples.\nTo return to the alphabet, the invention of\nthe ebook has provided the possibility to read alphabetic texts on\nscreens instead of paper. And on these screens one can expect to read\nyet another series of auguries predicting the disappearance of the\nbook and of the newspaper, (in part suggested by some declines in\nsales.) One of the favorite sports of every unimaginative journalist\nover the years is to ask the men of letters how they see the coming\ndemise of the world of print. It is not enough to argue that the book\nremains of fundamental importance to the transmission and\nconservation of information, or that we have scientific proof that\nbooks printed 500 years ago have survived wonderfully while we cannot\nscientifically demonstrate that the magnetized storage systems\npresently in use can survive for more than ten years. (Nor can we\nverify this, since computers today cannot read a floppy disk from the\nEighties.)\nNow, however, there are some\ndisconcerting occurrences that have caught the attention of\njournalists, although we have not yet grasped their significance and\ntheir eventual consequences. In August, Jeff Bezos of Amazon bought\nthe\nWashington Post\n, and while announcing the decline of the daily\nnewspaper, Warren Buffet recently acquired some 63 local newpapers. As\nFederico Rampini observed in\nRepubblica\nthe other day, Buffet is a giant\nof the Old Economy and he is not an innovator, but he has a rare\nacuity for discerning investment opportunities. And I suspect\nthat other sharks of Silicon Valley are also moving against the\nnewspapers.\nRampini asked if the final blow will\nnot be Bill Gates or Mark Zuckerberg purchasing the\nNew York Times\n.\nEven if this doesn’t happen, it is clear that the digital world is\novertaking print. What about commercial calculations, political\nspeculations, and the desire to preserve the press as a democratic\nwatchdog? I don’t feel that I have a sufficient grasp on the situation to\ninterpret these various facts correctly. However, I think it is interesting to\nconsider the possibility of the reversal of another famous prophecy. Perhaps\nMao had it wrong and one must take the paper tiger seriously.",
  "tags": [
    "Eco",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-18T08:30:00+00:00"
}