{
  "url": "https://voxday.net/2013/12/21/fixing-insufficient-privileges-in/",
  "scraped_at": "2025-12-15T16:40:47.201050",
  "title": "Fix insufficient permissions in Windows 7",
  "date_display": "December 21, 2013",
  "date_iso": "2013-12-21T10:24:00+00:00",
  "date_from_url": "2013-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s been a long time since I’ve written anything about Linux. This is mostly because I haven’t been using it. Due to some development projects over the past few years, I’ve been stuck using Windows, so I’ve been using XP and resolutely ignoring every new operating system introduced by Microsoft in the meantime. Everything works fine, although I have not been able to update Skype since not long after Microsoft bought them.</p><p>This has actually been a material benefit to me, not an irritation. It works fine, and in addition to reasons that shall presently be made clear, I still enjoy all the old functionality of certain third-party programs that Microsoft has intentionally broken with its helpful newer releases. The lesson, as always: never, ever, trust Microsoft to do the sensible thing.</p><p>Apple pens in its users, domesticates them, and milks them, but at least it treats them nicely and makes them feel good about themselves. Microsoft is like a big, fat ex-boyfriend who shows up at his former girlfriend’s apartment drunk and unannounced, insists on having sex, then throws up in her bed after passing out. It’s more than just the regret one feels after being forced to deal with Windows, it’s the time one has to spend to clean everything up afterwards.</p><p>Now, Spacebunny runs Windows 7, and in the course of daily events she made the rookie mistake of allowing Skype to update itself. Naturally, the update immediately caused Skype to stop working on her machine. She tried a few things and then turned the matter over to me because I so enjoy trying to work around Microsoft’s idea of making the interface easier. The problem is a fairly common one and is described here by one of the many people who have run into this problem:</p><p><i>“Every time I try to download the newest version of Flash Player, I get<br> an error message stating that I have insufficient user permissions.  I<br> am using Windows 7, it’s my home computer, I am the administrator (I<br> know because I checked) and no one else uses my computer.  I’ve done<br> everything I can (including creating a new Admin account – still didn’t<br> work).”</br></br></br></br></br></i></p><p>None of the suggested fixes worked. So, I went through all the various suggestions I could find online, including those on the Microsoft Forum. Most of them were entirely worthless. Seriously, I want to punch the fat, self-satisfied power users who that telling people how to click through the relevant dialogue boxes is a legitimate answer. But the problem obviously isn’t people not knowing how to use the operating system, since many of the messages clearly indicate we’re dealing with people who know what administrator status is, the problem is that clicking through the obvious dialogue boxes <i>doesn’t freaking work!</i></p><p>I did all the obvious things. I even downloaded a special program to unlock the folder, which unlocked the folder but still didn’t grant whatever privileges were deemed necessary to simply delete the damned file. Logging in as an administrator didn’t work, creating a new administrator didn’t work, running the installer as an administrator didn’t work, unlocking the folder didn’t work, absolutely nothing worked. Even Markku couldn’t figure out how to fix the problem within a Microsoft paradigm short of reinstalling Windows. That being said, he did come up with the ultimate answer from the start, which is often apt when one is dealing with a Microsoft product: the first step is to tell Microsoft to fuck off.</p><p>Let me explain. The core problem is that the newer Microsoft operating systems do something incredibly stupid. In order to navigate all the complex crap that now surrounds diverse aspects of the increasingly crufty operating system, many installation programs now create a virtual administrator that has control over the various files and directories being used during the installation process. This virtual administrator does not exist, and by virtue of not existing, is not synonymous with any of the actual human administrators who actually use the computer.</p><p>Perhaps you already see the intrinsic problem there. If something goes wrong during the installation or update process, the real administrators do not have access to the files that were under the control of this nonexistent administrator. The real admin can see what’s there, but he can’t do anything about it. He doesn’t have access and he can’t give himself access. And if that protected file or folder is one that is required by an application installer that has somehow gone haywire, the user is screwed and will not be able to reinstall or use that application without either restoring a previous OS state or completely reinstalling Windows.</p><p>Nice work, Microsoft. Very helpful. It’s just a brilliant system. Honestly, it’s enough to make me want to go back to DOS and stay there. Sure, point-and-click is nice, but it’s just not worth putting up with this sort of insane and totally unnecessary crap. The First Rule of Operating Systems should be this: stay the fuck out of the advanced user’s way!</p><p>Fortunately, as Markku pointed out, Linux doesn’t give a damn about all of Microsoft’s increasingly lunatic complexities. And thanks to the Ubuntu Live option, it is possible to boot the machine into Linux <a href=\"http://www.ubuntu.com/download/desktop/create-a-usb-stick-on-windows\">off a USB stick</a>, then delete the directory reserved to the nonexistent administrator without otherwise affecting the machine or the operating system. The entire process was very easy:</p><ol><li>Download an <a href=\"http://www.ubuntu.com/download/desktop\">Ubuntu desktop ISO</a> onto your hard drive. 13.10 is current.</li><li>Download <a href=\"http://www.pendrivelinux.com/universal-usb-installer-easy-as-1-2-3/#button\">Pen Drive Linux USB Installer</a></li><li>Insert USB stick with at least 2GB free</li><li>Run Pen Drive</li><li>Select the downloaded Ubuntu ISO. Click start.</li><li>Wait 6 mins for Pen Drive to set up the bootable Ubuntu on your USB stick</li><li>Turn off computer</li><li>Boot into Linux (may be necessary to hit F12 to choose boot option)</li><li>Find your Windows hard drive</li><li>Find the problematic file or folder and delete it</li><li>Remove USB stick</li><li>Reboot into Windows</li><li>Run application installer again</li><li>Run the application.</li><li>Bask in the momentary techno joy.</li></ol><p>The whole process took about 15 minutes, most of which involved downloading the Ubuntu ISO and installing it on the USB stick. I’m posting this here because I haven’t seen this solution anywhere on the Internet, and despite involving a second operating system, it is the cleanest, fastest, and most effective way I’ve seen to completely resolve an extraordinarily annoying situation.</p><p>Of course, you won’t find this solution on any Microsoft forum. Why not? It appears that they would rather force their users to reinstall their operating system than let them know about a fast and easy fix for a common problem they created.</p></div>",
  "content_text": "It’s been a long time since I’ve written anything about Linux. This is mostly because I haven’t been using it. Due to some development projects over the past few years, I’ve been stuck using Windows, so I’ve been using XP and resolutely ignoring every new operating system introduced by Microsoft in the meantime. Everything works fine, although I have not been able to update Skype since not long after Microsoft bought them.\nThis has actually been a material benefit to me, not an irritation. It works fine, and in addition to reasons that shall presently be made clear, I still enjoy all the old functionality of certain third-party programs that Microsoft has intentionally broken with its helpful newer releases. The lesson, as always: never, ever, trust Microsoft to do the sensible thing.\nApple pens in its users, domesticates them, and milks them, but at least it treats them nicely and makes them feel good about themselves. Microsoft is like a big, fat ex-boyfriend who shows up at his former girlfriend’s apartment drunk and unannounced, insists on having sex, then throws up in her bed after passing out. It’s more than just the regret one feels after being forced to deal with Windows, it’s the time one has to spend to clean everything up afterwards.\nNow, Spacebunny runs Windows 7, and in the course of daily events she made the rookie mistake of allowing Skype to update itself. Naturally, the update immediately caused Skype to stop working on her machine. She tried a few things and then turned the matter over to me because I so enjoy trying to work around Microsoft’s idea of making the interface easier. The problem is a fairly common one and is described here by one of the many people who have run into this problem:\n“Every time I try to download the newest version of Flash Player, I get\nan error message stating that I have insufficient user permissions.  I\nam using Windows 7, it’s my home computer, I am the administrator (I\nknow because I checked) and no one else uses my computer.  I’ve done\neverything I can (including creating a new Admin account – still didn’t\nwork).”\nNone of the suggested fixes worked. So, I went through all the various suggestions I could find online, including those on the Microsoft Forum. Most of them were entirely worthless. Seriously, I want to punch the fat, self-satisfied power users who that telling people how to click through the relevant dialogue boxes is a legitimate answer. But the problem obviously isn’t people not knowing how to use the operating system, since many of the messages clearly indicate we’re dealing with people who know what administrator status is, the problem is that clicking through the obvious dialogue boxes\ndoesn’t freaking work!\nI did all the obvious things. I even downloaded a special program to unlock the folder, which unlocked the folder but still didn’t grant whatever privileges were deemed necessary to simply delete the damned file. Logging in as an administrator didn’t work, creating a new administrator didn’t work, running the installer as an administrator didn’t work, unlocking the folder didn’t work, absolutely nothing worked. Even Markku couldn’t figure out how to fix the problem within a Microsoft paradigm short of reinstalling Windows. That being said, he did come up with the ultimate answer from the start, which is often apt when one is dealing with a Microsoft product: the first step is to tell Microsoft to fuck off.\nLet me explain. The core problem is that the newer Microsoft operating systems do something incredibly stupid. In order to navigate all the complex crap that now surrounds diverse aspects of the increasingly crufty operating system, many installation programs now create a virtual administrator that has control over the various files and directories being used during the installation process. This virtual administrator does not exist, and by virtue of not existing, is not synonymous with any of the actual human administrators who actually use the computer.\nPerhaps you already see the intrinsic problem there. If something goes wrong during the installation or update process, the real administrators do not have access to the files that were under the control of this nonexistent administrator. The real admin can see what’s there, but he can’t do anything about it. He doesn’t have access and he can’t give himself access. And if that protected file or folder is one that is required by an application installer that has somehow gone haywire, the user is screwed and will not be able to reinstall or use that application without either restoring a previous OS state or completely reinstalling Windows.\nNice work, Microsoft. Very helpful. It’s just a brilliant system. Honestly, it’s enough to make me want to go back to DOS and stay there. Sure, point-and-click is nice, but it’s just not worth putting up with this sort of insane and totally unnecessary crap. The First Rule of Operating Systems should be this: stay the fuck out of the advanced user’s way!\nFortunately, as Markku pointed out, Linux doesn’t give a damn about all of Microsoft’s increasingly lunatic complexities. And thanks to the Ubuntu Live option, it is possible to boot the machine into Linux\noff a USB stick\n, then delete the directory reserved to the nonexistent administrator without otherwise affecting the machine or the operating system. The entire process was very easy:\nDownload an\nUbuntu desktop ISO\nonto your hard drive. 13.10 is current.\nDownload\nPen Drive Linux USB Installer\nInsert USB stick with at least 2GB free\nRun Pen Drive\nSelect the downloaded Ubuntu ISO. Click start.\nWait 6 mins for Pen Drive to set up the bootable Ubuntu on your USB stick\nTurn off computer\nBoot into Linux (may be necessary to hit F12 to choose boot option)\nFind your Windows hard drive\nFind the problematic file or folder and delete it\nRemove USB stick\nReboot into Windows\nRun application installer again\nRun the application.\nBask in the momentary techno joy.\nThe whole process took about 15 minutes, most of which involved downloading the Ubuntu ISO and installing it on the USB stick. I’m posting this here because I haven’t seen this solution anywhere on the Internet, and despite involving a second operating system, it is the cleanest, fastest, and most effective way I’ve seen to completely resolve an extraordinarily annoying situation.\nOf course, you won’t find this solution on any Microsoft forum. Why not? It appears that they would rather force their users to reinstall their operating system than let them know about a fast and easy fix for a common problem they created.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-21T10:24:00+00:00"
}