{
  "url": "https://voxday.net/2013/12/04/he-who-shows-up-wins/",
  "scraped_at": "2025-12-15T16:38:54.119546",
  "title": "He who shows up, wins",
  "date_display": "December 4, 2013",
  "date_iso": "2013-12-04T15:08:00+00:00",
  "date_from_url": "2013-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Catholic priest <a href=\"http://www.lifesitenews.com/news/priest-youve-contracepted-our-parochial-school-out-of-existence\">mourns the corruption and decline of the Catholic family</a> in reflecting how his parishioners have contracepted their parochial school out of existence:</p><blockquote class=\"tr_bq\"><p> A stranger came into the sacristy after Sunday Mass. In an incriminating huff he said, “I have been away from the area for fifteen years; where are the people? And now you are tearing down the school? I went there as a kid.”</p><p>I put my hands up to quiet him from further talking and I calmly said, “Let me ask you a question: How many kids did you have?” He said, “Two.” Then I said, “So did everyone else. When you only have two kids per family there is no growth.” His demeanor changed, and then he dropped his head and said, “And they aren’t even going to Mass anymore.”</p><p>I never thought I would be asking that question, but since I had to close our parish school, I’ve grown bolder and I started to ask that question more often. When I came to my parish five years ago, the school was on its proverbial “last legs.” In its last two years we did everything we could to recruit more students, but eventually I had to face the fact that after 103 years of education the school was no longer viable.</p><p>In one of the pre-closure brain-storming sessions with teachers, I was asked what to do to get more students. I replied, “Well, I know what to do, but it takes seven years.” The older teachers laughed, but the others needed me to state the obvious to the oblivious, viz. we need more babies….</p><p> I have modestly preached against contraception and sterilization, but<br> for many of my parishioners it is too late. Most of them are done with<br> raising more children. They have had their two kids twenty, thirty,<br> forty years ago and some women don’t want to hear about the Culture of<br> Death. They decide to go to other parishes where the pastor doesn’t<br> prick their consciences.</br></br></br></br></br></p><p> I am reminded of a diocesan official in his talk to us young pro-life,<br> pro-family priests twenty years ago. He said, “Yes, you can preach<br> against abortion and contraception, but remember, you have to put a roof<br> over your churches.” Now, our diocese is closing and merging these same<br> parishes, but you know what—they all have good roofs.</br></br></br></br></p><p> Pastors, if the demographic winter or bomb seems someone else’s<br> problem, try this at your parish as I recently did at mine. I took the<br> last ten burials and printed out their obituaries. At Sts. Peter and<br> Paul Cemetery we had six men and four women with an average age of 80<br> years. With the ten, I counted the number of siblings for a total of 45<br> and divided by 10 which came to 4.5 children per family. Then I counted<br> the ten’s children and divided by ten. The next generation had 28 kids<br> which I divided by ten and came to 2.8 per family. I then moved on to<br> the third generation, the grandchildren. These ten deceased had 48<br> grandchildren from their 28 children. When dividing these numbers, I<br> came to a figure of 1.714 per family. The <a href=\"http://www.census.gov/hhes/families/files/cps2012/tabAVG3.xls\">national average</a> number of children per household is 1.91; while the replacement level is 2.1 children per family.</br></br></br></br></br></br></br></br></br></br></p><p> I don’t claim to have answers on how to turn around a dying parish or<br> diocese. In fact, I am more at a loss as to what to say than ever<br> before. To defend the Church’s teaching against contraception and<br> sterilization is like going back to ancient Rome and warning them about<br> the dangers of indoor lead plumbing. No matter what you would say their<br> only response back would come in various levels of volume, “But it’s<br> indoor plumbing!” In other words, no matter the real threat to one’s<br> physical health from contraception and sterilization, the immediate<br> perceived benefits outweigh the moral and physical downside.</br></br></br></br></br></br></br></br></p></blockquote><p>I’m not anti-contraception myself, but I am against the short-sightedness of small families.The Jews have it right and three is the bare minimum that any Christian couple should have, assuming they can have children. I understand that it is sometimes hard to see past the cost and the challenges that come with raising children, but I don’t know a single family with children who regrets the youngest. And most of the families I know, regardless of size, speak a little wistfully about how it would have been nice to have just one more.</p><p>If we’re going to win the future, our children have to show up for it.</p></div>",
  "content_text": "A Catholic priest\nmourns the corruption and decline of the Catholic family\nin reflecting how his parishioners have contracepted their parochial school out of existence:\nA stranger came into the sacristy after Sunday Mass. In an incriminating huff he said, “I have been away from the area for fifteen years; where are the people? And now you are tearing down the school? I went there as a kid.”\nI put my hands up to quiet him from further talking and I calmly said, “Let me ask you a question: How many kids did you have?” He said, “Two.” Then I said, “So did everyone else. When you only have two kids per family there is no growth.” His demeanor changed, and then he dropped his head and said, “And they aren’t even going to Mass anymore.”\nI never thought I would be asking that question, but since I had to close our parish school, I’ve grown bolder and I started to ask that question more often. When I came to my parish five years ago, the school was on its proverbial “last legs.” In its last two years we did everything we could to recruit more students, but eventually I had to face the fact that after 103 years of education the school was no longer viable.\nIn one of the pre-closure brain-storming sessions with teachers, I was asked what to do to get more students. I replied, “Well, I know what to do, but it takes seven years.” The older teachers laughed, but the others needed me to state the obvious to the oblivious, viz. we need more babies….\nI have modestly preached against contraception and sterilization, but\nfor many of my parishioners it is too late. Most of them are done with\nraising more children. They have had their two kids twenty, thirty,\nforty years ago and some women don’t want to hear about the Culture of\nDeath. They decide to go to other parishes where the pastor doesn’t\nprick their consciences.\nI am reminded of a diocesan official in his talk to us young pro-life,\npro-family priests twenty years ago. He said, “Yes, you can preach\nagainst abortion and contraception, but remember, you have to put a roof\nover your churches.” Now, our diocese is closing and merging these same\nparishes, but you know what—they all have good roofs.\nPastors, if the demographic winter or bomb seems someone else’s\nproblem, try this at your parish as I recently did at mine. I took the\nlast ten burials and printed out their obituaries. At Sts. Peter and\nPaul Cemetery we had six men and four women with an average age of 80\nyears. With the ten, I counted the number of siblings for a total of 45\nand divided by 10 which came to 4.5 children per family. Then I counted\nthe ten’s children and divided by ten. The next generation had 28 kids\nwhich I divided by ten and came to 2.8 per family. I then moved on to\nthe third generation, the grandchildren. These ten deceased had 48\ngrandchildren from their 28 children. When dividing these numbers, I\ncame to a figure of 1.714 per family. The\nnational average\nnumber of children per household is 1.91; while the replacement level is 2.1 children per family.\nI don’t claim to have answers on how to turn around a dying parish or\ndiocese. In fact, I am more at a loss as to what to say than ever\nbefore. To defend the Church’s teaching against contraception and\nsterilization is like going back to ancient Rome and warning them about\nthe dangers of indoor lead plumbing. No matter what you would say their\nonly response back would come in various levels of volume, “But it’s\nindoor plumbing!” In other words, no matter the real threat to one’s\nphysical health from contraception and sterilization, the immediate\nperceived benefits outweigh the moral and physical downside.\nI’m not anti-contraception myself, but I am against the short-sightedness of small families.The Jews have it right and three is the bare minimum that any Christian couple should have, assuming they can have children. I understand that it is sometimes hard to see past the cost and the challenges that come with raising children, but I don’t know a single family with children who regrets the youngest. And most of the families I know, regardless of size, speak a little wistfully about how it would have been nice to have just one more.\nIf we’re going to win the future, our children have to show up for it.",
  "tags": [
    "Christianity",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-04T15:08:00+00:00"
}