{
  "url": "https://voxday.net/2013/12/24/holiday-survival-guide/",
  "scraped_at": "2025-12-15T16:41:01.511179",
  "title": "Holiday survival guide",
  "date_display": "December 24, 2013",
  "date_iso": "2013-12-24T13:52:00+00:00",
  "date_from_url": "2013-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s Christmas Eve. The round of parties are reaching their climax and<br> the gift-giving is about to begin in earnest. It may be helpful,<br> therefore, to consider the how to approach the social aspects of the<br> celebrations from a socio-sexual perspective.</br></br></br></p><p>If you are a man:</p><ol><li>Remember that the women are putting in a lot of work and are feeling<br> a lot of stress. This is not the time to remember things at the last<br> minute or lament how things were done differently when you were a child.<br> Avoid throwing curve balls.</br></br></br></li><li>Don’t tell her to relax. She’s not going to do so anymore than you<br> are during a hard fought basketball game. Holiday-hosting can perhaps be best understood as a<br> competitive sport for women, even if the only competitors are in her<br> mind.</br></br></br></li><li>Ask her if there is anything you can do twice per day, once in the<br> morning and once in the afternoon. Simply having someone willing to run<br> out to the store for her once or twice, if necessary, can save considerable time and reduce any tensions.</br></br></li><li>Pour yourself a glass of wine as soon as it gets dark. Offer her one. She’ll probably need it.</li><li>Don’t let her get away with snapping at you or anyone else. The objective is to be helpful and considerate, not a doormat.</li></ol><p>Read the rest <a href=\"http://www.milobookclub.com/2013/12/24/holiday-survival-guide/\">at Alpha Game</a>.</p><p>And with regards to #7 for the women, the most gracious response to a present I’ve ever seen was when a little child unwrapped a present and discovered a box that said it contained a potato ricer. This was not because the present was, in fact, a potato ricer, but because European retailers are considerably stingier with boxes than their American counterparts and the toy was inside the potato ricer box.</p><p><i>“A potato weisso? I’ve always wanted a potato weisso! What’s a potato weisso?” </i></p></div>",
  "content_text": "It’s Christmas Eve. The round of parties are reaching their climax and\nthe gift-giving is about to begin in earnest. It may be helpful,\ntherefore, to consider the how to approach the social aspects of the\ncelebrations from a socio-sexual perspective.\nIf you are a man:\nRemember that the women are putting in a lot of work and are feeling\na lot of stress. This is not the time to remember things at the last\nminute or lament how things were done differently when you were a child.\nAvoid throwing curve balls.\nDon’t tell her to relax. She’s not going to do so anymore than you\nare during a hard fought basketball game. Holiday-hosting can perhaps be best understood as a\ncompetitive sport for women, even if the only competitors are in her\nmind.\nAsk her if there is anything you can do twice per day, once in the\nmorning and once in the afternoon. Simply having someone willing to run\nout to the store for her once or twice, if necessary, can save considerable time and reduce any tensions.\nPour yourself a glass of wine as soon as it gets dark. Offer her one. She’ll probably need it.\nDon’t let her get away with snapping at you or anyone else. The objective is to be helpful and considerate, not a doormat.\nRead the rest\nat Alpha Game\n.\nAnd with regards to #7 for the women, the most gracious response to a present I’ve ever seen was when a little child unwrapped a present and discovered a box that said it contained a potato ricer. This was not because the present was, in fact, a potato ricer, but because European retailers are considerably stingier with boxes than their American counterparts and the toy was inside the potato ricer box.\n“A potato weisso? I’ve always wanted a potato weisso! What’s a potato weisso?”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2013-12-24T13:52:00+00:00"
}