{
  "url": "https://voxday.net/2013/12/28/kids-and-classics/",
  "scraped_at": "2025-12-15T16:41:23.798957",
  "title": "Kids and the classics",
  "date_display": "December 28, 2013",
  "date_iso": "2013-12-28T10:14:00+00:00",
  "date_from_url": "2013-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Perhaps one day I will write a book entitled <i>Why I Play the Classics</i>. But Calvino aside, one plays classic games for much the same reason that one reads classic books. From Slashdot:</p><blockquote class=\"tr_bq\"><p> An article at The Verge got me thinking. Parents and those of you who plan to become parents: will you introduce your kids to the games you played when you were younger? Those of us who grew up playing Pong, Space Invaders, and Pac-Man have had a chance to see gaming software evolve into the enormously complex and graphically realistic beast it is today. I’ve begun to understand why my grandparents tried to get me to watch old movies. I’m also curious how you folks plan to teach your kids about computers and software in general.</p></blockquote><p>I find it pretty simple. If you begin playing older boardgames with them when they are young, they begin to develop an appreciation for games as a general concept rather than viewing them as something that primarily exists on a screen. I started playing <i>War at Sea</i> with Ender when he was six; this year he was delighted to get a 36 year-old copy of <i>Victory in the Pacific</i> for Christmas.</p><p>Ender likes playing modern shooters and sports games, but he also enjoys older games through the use of DosBox.  Right now, he’s particularly into <i>Wizardry </i>and before that he was playing <i>Fantasy General</i> after we were both checking out the recently released <i>Fantasy Kommander</i> from Matrix. He recognizes that graphics do not make the game, which unfortunately is more than I can say for a lot of people in the industry.</p><p>Not that graphics aren’t important in the symbolic sense. In fact, some of us were having a discussion on the subject just last night, which leads to a question for the gamers in our midst. Can a blue heart represent morale? If that is too easily confused with the red cross that represents health, then what is a better symbol for morale?</p><p>Any ASLers who answer “boxcars” will be summarily shot.</p></div>",
  "content_text": "Perhaps one day I will write a book entitled\nWhy I Play the Classics\n. But Calvino aside, one plays classic games for much the same reason that one reads classic books. From Slashdot:\nAn article at The Verge got me thinking. Parents and those of you who plan to become parents: will you introduce your kids to the games you played when you were younger? Those of us who grew up playing Pong, Space Invaders, and Pac-Man have had a chance to see gaming software evolve into the enormously complex and graphically realistic beast it is today. I’ve begun to understand why my grandparents tried to get me to watch old movies. I’m also curious how you folks plan to teach your kids about computers and software in general.\nI find it pretty simple. If you begin playing older boardgames with them when they are young, they begin to develop an appreciation for games as a general concept rather than viewing them as something that primarily exists on a screen. I started playing\nWar at Sea\nwith Ender when he was six; this year he was delighted to get a 36 year-old copy of\nVictory in the Pacific\nfor Christmas.\nEnder likes playing modern shooters and sports games, but he also enjoys older games through the use of DosBox.  Right now, he’s particularly into\nWizardry\nand before that he was playing\nFantasy General\nafter we were both checking out the recently released\nFantasy Kommander\nfrom Matrix. He recognizes that graphics do not make the game, which unfortunately is more than I can say for a lot of people in the industry.\nNot that graphics aren’t important in the symbolic sense. In fact, some of us were having a discussion on the subject just last night, which leads to a question for the gamers in our midst. Can a blue heart represent morale? If that is too easily confused with the red cross that represents health, then what is a better symbol for morale?\nAny ASLers who answer “boxcars” will be summarily shot.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-28T10:14:00+00:00"
}