{
  "url": "https://voxday.net/2013/12/12/lions-den-viii-jonathan-moeller/",
  "scraped_at": "2025-12-15T16:39:48.794119",
  "title": "Lions Den VIII: Jonathan Moeller",
  "date_display": "December 12, 2013",
  "date_iso": "2013-12-12T14:00:00+00:00",
  "date_from_url": "2013-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The Pulp Writer throws <a href=\"http://www.amazon.com/Frostborn-First-Quest-Jonathan-Moeller-ebook/dp/B00GCICU02\"><b>Frostborn: The First Quest</b></a> into the Den and takes a decidedly different approach in introducing it to everyone here. If you’re interested in being one of the book’s three reviewers, shoot me an email. You may also be interested in noting that both his <a href=\"http://www.amazon.com/Demonsouled-Jonathan-Moeller/dp/1481298763/ref=la_B001K8GDHU_1_1?s=books&amp;ie=UTF8&amp;qid=1386859527&amp;sr=1-1\">Demonsouled </a>and <a href=\"http://www.amazon.com/Child-Ghosts-Jonathan-Moeller/dp/1481918109/ref=la_B001K8GDHU_1_2?s=books&amp;ie=UTF8&amp;qid=1386859527&amp;sr=1-2\">Child of the Ghosts</a> are free downloads today.</i></p><p>Today I am going to tell you a story about the dangers of opening doors.</p><p><a href=\"http://www.amazon.com/Frostborn-First-Quest-Jonathan-Moeller-ebook/dp/B00GCICU02\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.jonathanmoeller.com/writer/wp-content/uploads/2013/10/WebFirstQuest.jpg\" width=\"212\"/></a>Long ago, before humans ever came to my world,<br> before humans even existed, the high elves ruled this world. We<br> believed that God had put us here to care and maintain this world, for<br> God had indeed created it for a purpose. A great darkness had been<br> imprisoned within the skin of the world, inside a place the humans would<br> one day call the Black Mountain. Our responsibility was to guard the<br> prison and serve as the world’s caretakers.</br></br></br></br></br></br></p><p>And so we did.</p><p>For spans of<br> time so vast that no human tongue has the vocabulary to describe them,<br> the high elves kept watch over this world, dwelling in great bliss and<br> splendor as they went about their task.</br></br></br></p><p>But for some of us, that was not enough.</p><p>Those<br> of us with wisdom and courage, those of us with the strength to cast<br> aside old ideas and grow beyond our purpose, used our spells to examine<br> the Black Mountain, to consider the darkness sealed within as a bored<br> child might pick at a scab. In time the darkness spoke to us. At first<br> we spurned it, but we came to see that it spoke wisdom, words of<br> strength and power.</br></br></br></br></br></br></p><p>And the darkness reached out and possessed one of<br> us, and we fell to our knees and worshipped him as our new god, the<br> bearer of shadow, the teacher of new ways.</br></br></p><p>The<br> high elves turned against us, the shortsighted fools. They called us the<br> dark elves, but we were the true elves, the stronger elves, for we<br> alone had been brave enough to cast off our shackles and make ourselves<br> more.</br></br></br></br></p><p>They made war upon us for millennia, and we laid the<br> world waste. Spells beyond the capacity of the human mind to understand<br> shattered the land, and mountains crumbled and deserts froze and<br> forests burned. Yet for all our power, the high elves had the mastery,<br> and drove us back mile by mile.</br></br></br></br></p><p>But the bearer of shadow walked among us, whispering<br> his secrets into our ears. He taught us spells of necromancy, of<br> shaping flesh and bone into weapons of death. And he taught us the<br> secret of opening doors between the worlds. For there are as many worlds<br> as there are stars in the night skies, and as many kindreds that live<br> upon them. Our wizards opened the doors between the worlds, and brought<br> forth new kindreds to serve us as slaves and soldiers.</br></br></br></br></br></br></p><p>The orcs were the first. They made superb slave<br> soldiers for our armies, and we brought hundreds of thousands of them<br> through the gates. Then came the beastmen and the manetaurs. They were<br> harder to control, but served well as shock troops. Halflings were too<br> weak for battle, but made useful slaves. The dwarves proved impossible<br> to control, and soon rebelled and sided against us, but they were a rare<br> error</br></br></br></br></br></br></p><p>And one day, we found the urdmordar.</p><p>We<br> had never seen anything like them. They wore the form of spiders, yet<br> wielded great dark magic. They disdained the use of tools and weapons,<br> yet had intellects of genius, and dominated lesser creatures with ease.<br> They feasted upon living flesh like any rude predator, but were so<br> cunning and so clever that they remained hidden and their victims rarely<br> knew their true foes.</br></br></br></br></br></br></p><p>What slaves they would make! With their power, we could at last crush the high elves.</p><p>And so we opened the door to their world and brought the urdmordar to ours.</p><p>Fools, fools, fools.</p><p>For the urdmordar were too powerful to control.</p><p>They<br> swarmed the gate, and devoured the wizards that sought to bind them. We<br> were the rightful masters of this world, mighty in sorcery and wisdom<br> without peer, but the urdmordar saw us as only one thing.</br></br></br></p><p>Food.</p><p>Within five years<br> the dark elven kingdoms had been enslaved and forced to serve the<br> urdmordar. Our armies of slaves transferred their allegiance readily<br> enough. The high elves briefly rejoiced, thinking they had found an<br> ally, but the hunger of the urdmordar was insatiable.</br></br></br></br></p><p>One by one the high elven kingdoms fell, until only Cathair Solas remained.</p><p>And then the urdmordar met a new kindred coming up from the south.</p><p>The<br> humans, the exiles of Old Earth, the heirs of Arthur Pendragon, fleeing<br> through a magical gate from the fall of their realm. Heedless of the<br> ancient conflicts of their new world, they blundered into the path of<br> the urdmordar.</br></br></br></br></p><p>There is danger in opening doors…but there is also opportunity.</p><p>For in the humans, after long millennia, I see the key to my freedom.</p><p>– <i>The Warden of Urd Morlemoch</i></p></div>",
  "content_text": "The Pulp Writer throws\nFrostborn: The First Quest\ninto the Den and takes a decidedly different approach in introducing it to everyone here. If you’re interested in being one of the book’s three reviewers, shoot me an email. You may also be interested in noting that both his\nDemonsouled\nand\nChild of the Ghosts\nare free downloads today.\nToday I am going to tell you a story about the dangers of opening doors.\nLong ago, before humans ever came to my world,\nbefore humans even existed, the high elves ruled this world. We\nbelieved that God had put us here to care and maintain this world, for\nGod had indeed created it for a purpose. A great darkness had been\nimprisoned within the skin of the world, inside a place the humans would\none day call the Black Mountain. Our responsibility was to guard the\nprison and serve as the world’s caretakers.\nAnd so we did.\nFor spans of\ntime so vast that no human tongue has the vocabulary to describe them,\nthe high elves kept watch over this world, dwelling in great bliss and\nsplendor as they went about their task.\nBut for some of us, that was not enough.\nThose\nof us with wisdom and courage, those of us with the strength to cast\naside old ideas and grow beyond our purpose, used our spells to examine\nthe Black Mountain, to consider the darkness sealed within as a bored\nchild might pick at a scab. In time the darkness spoke to us. At first\nwe spurned it, but we came to see that it spoke wisdom, words of\nstrength and power.\nAnd the darkness reached out and possessed one of\nus, and we fell to our knees and worshipped him as our new god, the\nbearer of shadow, the teacher of new ways.\nThe\nhigh elves turned against us, the shortsighted fools. They called us the\ndark elves, but we were the true elves, the stronger elves, for we\nalone had been brave enough to cast off our shackles and make ourselves\nmore.\nThey made war upon us for millennia, and we laid the\nworld waste. Spells beyond the capacity of the human mind to understand\nshattered the land, and mountains crumbled and deserts froze and\nforests burned. Yet for all our power, the high elves had the mastery,\nand drove us back mile by mile.\nBut the bearer of shadow walked among us, whispering\nhis secrets into our ears. He taught us spells of necromancy, of\nshaping flesh and bone into weapons of death. And he taught us the\nsecret of opening doors between the worlds. For there are as many worlds\nas there are stars in the night skies, and as many kindreds that live\nupon them. Our wizards opened the doors between the worlds, and brought\nforth new kindreds to serve us as slaves and soldiers.\nThe orcs were the first. They made superb slave\nsoldiers for our armies, and we brought hundreds of thousands of them\nthrough the gates. Then came the beastmen and the manetaurs. They were\nharder to control, but served well as shock troops. Halflings were too\nweak for battle, but made useful slaves. The dwarves proved impossible\nto control, and soon rebelled and sided against us, but they were a rare\nerror\nAnd one day, we found the urdmordar.\nWe\nhad never seen anything like them. They wore the form of spiders, yet\nwielded great dark magic. They disdained the use of tools and weapons,\nyet had intellects of genius, and dominated lesser creatures with ease.\nThey feasted upon living flesh like any rude predator, but were so\ncunning and so clever that they remained hidden and their victims rarely\nknew their true foes.\nWhat slaves they would make! With their power, we could at last crush the high elves.\nAnd so we opened the door to their world and brought the urdmordar to ours.\nFools, fools, fools.\nFor the urdmordar were too powerful to control.\nThey\nswarmed the gate, and devoured the wizards that sought to bind them. We\nwere the rightful masters of this world, mighty in sorcery and wisdom\nwithout peer, but the urdmordar saw us as only one thing.\nFood.\nWithin five years\nthe dark elven kingdoms had been enslaved and forced to serve the\nurdmordar. Our armies of slaves transferred their allegiance readily\nenough. The high elves briefly rejoiced, thinking they had found an\nally, but the hunger of the urdmordar was insatiable.\nOne by one the high elven kingdoms fell, until only Cathair Solas remained.\nAnd then the urdmordar met a new kindred coming up from the south.\nThe\nhumans, the exiles of Old Earth, the heirs of Arthur Pendragon, fleeing\nthrough a magical gate from the fall of their realm. Heedless of the\nancient conflicts of their new world, they blundered into the path of\nthe urdmordar.\nThere is danger in opening doors…but there is also opportunity.\nFor in the humans, after long millennia, I see the key to my freedom.\n–\nThe Warden of Urd Morlemoch",
  "tags": [
    "books",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-12T14:00:00+00:00"
}