{
  "url": "https://voxday.net/2013/12/19/loyalty/",
  "scraped_at": "2025-12-15T16:40:36.828968",
  "title": "Loyalty",
  "date_display": "December 19, 2013",
  "date_iso": "2013-12-19T18:00:00+00:00",
  "date_from_url": "2013-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dogs <a href=\"http://nypost.com/2013/12/18/blind-man-and-loyal-dog-can-stay-together-thanks-to-new-yorkers/\">are the best</a>:</p><blockquote class=\"tr_bq\"><p> A blind man who nearly died after falling onto subway train tracks<br> will get to keep the loyal dog who tried to save him — thanks to New<br> Yorkers who whipped out their checkbooks to help the duo stay together. Cecil Williams, 61 — whose 11-year-old pooch, Orlando, leaped onto<br> the tracks after his master fainted on Tuesday — said the lovable lab<br> will retire as a seeing-eye dog and become a pet with the help of<br> donation money.</br></br></br></br></br></p><p>Williams fell on to the tracks after he grew faint and lost footing<br> on the platform of the 125th Street station at 9:30 am on Wednesday.<br> Orlando jumped onto the tracks after him and began licking his face. A quick-thinking subway conductor then hit brakes of the train, which passed over both of them. Transit officials pulled Orlando out from under the train and<br> Williams was rushed to St. Luke’s Hospital while wearing a neck brace.</br></br></br></p></blockquote><p>I tend to doubt my viszla would have had the courage to leap on the tracks in a similar situation. His usual method of confronting other dogs that represented a potential threat was to run behind me, peek out around one leg and growl. But if curling up in a blanket in front of a roaring fire would have saved me, he’d have been all over it.</p></div>",
  "content_text": "Dogs\nare the best\n:\nA blind man who nearly died after falling onto subway train tracks\nwill get to keep the loyal dog who tried to save him — thanks to New\nYorkers who whipped out their checkbooks to help the duo stay together. Cecil Williams, 61 — whose 11-year-old pooch, Orlando, leaped onto\nthe tracks after his master fainted on Tuesday — said the lovable lab\nwill retire as a seeing-eye dog and become a pet with the help of\ndonation money.\nWilliams fell on to the tracks after he grew faint and lost footing\non the platform of the 125th Street station at 9:30 am on Wednesday.\nOrlando jumped onto the tracks after him and began licking his face. A quick-thinking subway conductor then hit brakes of the train, which passed over both of them. Transit officials pulled Orlando out from under the train and\nWilliams was rushed to St. Luke’s Hospital while wearing a neck brace.\nI tend to doubt my viszla would have had the courage to leap on the tracks in a similar situation. His usual method of confronting other dogs that represented a potential threat was to run behind me, peek out around one leg and growl. But if curling up in a blanket in front of a roaring fire would have saved me, he’d have been all over it.",
  "tags": [
    "open"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-19T18:00:00+00:00"
}