{
  "url": "https://voxday.net/2013/12/22/mailvox-improving-dialectic/",
  "scraped_at": "2025-12-15T16:40:50.143738",
  "title": "Mailvox: improving dialectic",
  "date_display": "December 22, 2013",
  "date_iso": "2013-12-22T09:46:00+00:00",
  "date_from_url": "2013-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB asks how he can improve his ability to debate:</p><blockquote class=\"tr_bq\"><p> Do you have any recommendations on reading material for improving one’s debate skills? I am aware of the most basic premise being the ability to reason, followed by a willingness to suffer defeat in repeated efforts. I am good at debating, but studying what you have posted, as well as other’s responses shows me that there is room for considerable improvement on my part. I am passably familiar with Socrates, Plato, Cicero, and Aristotle; the last of whom is cited considerably often on Vox Populi but I am interested in learning more. What do you feel are the best books to study on this? Can it even be learned through books or does one have to simply fight it out personally and learn by doing?</p><p>Given Scalzi’s inept appeals to his degree in alleged rhetoric; possibly this cannot be learned other than by doing. However if there are recommendations that you have for books on rhetoric and debate, I would be interested to hear them. After all, my default setting whenever I am interested in learning more about a subject is to buy multiple books on it; so I am hopeful that you might have some suggestions for reading material.</p></blockquote><p>It’s important to distinguish between learning about something and actually doing it. Although not a basketball fan, I know a fair amount about basketball courtesy of Bill Simmons, a lifelong basketball fanatic. But nothing that I have ever read about basketball has improved my three-point shot.</p><p>As Michael Jordan once said after one of his returns from retirement, the best way to get in shape for playing basketball is to play basketball. I run twice per week in the soccer offseason in order to stay in shape, but no matter how good I am about my off-season routine, the first practice of the season is always the most painful.</p><p>Reading Cicero and Plato may provide you with some rhetorical and dialectical tools, but having those tools is not the same thing as knowing how and when to use them effectively. Indeed, reading about them while not putting them into actual practice may actually be detrimental to one’s ability to debate; as JB has seen with Mr. Scalzi, it can even contribute to a powerful sense of self-delusion in that regard.</p><p>I am a little concerned by JB’s assertion of being “passably familiar” with the four classic figures mentioned. One of the great intellectual diseases of our time is the idea that having heard of something, or knowing a little bit about it, is practically akin to having mastered the subject. So, my first suggestion is that JB actually read the Socratic dialogues, read Aristotle’s Rhetoric and Cicero’s De Inventione. Then read something more modern; here is a nice online guide to <a href=\"http://www.artofmanliness.com/2011/01/26/classical-rhetoric-101-the-five-canons-of-rhetoric-invention/\">The Five Canons of Rhetoric</a>.</p><p>This leads to one important guideline: don’t ever claim to know something that you do not, in fact, know better than your opponent expects. A skilled opponent will unmask you faster than you think possible; read my exchange with the atheist Luke for a particularly brutal example of that. On the flip side, I was amused when an online conversation between two evolutionists was brought to my attention, as one was warning the other not to be fooled by my claim to be relatively ignorant about TENS. But I wasn’t playing dumb, the simple fact is that I don’t know biology the way I know economics or the history of video games, so I have to approach the subjects differently.</p><p>In my opinion, the best way one can develop one’s debating skills is to practice by regularly taking on the most knowledgeable opponents one can find. Consider, for example, the qualitative difference between my exchanges with Nate, with Dominic, and even with Delavagus with my various run-ins with PZ Myers, McRapey, and Luke. I still disagree with all six of them on the subjects we discussed, but the former three knew what they were talking about while the latter three manifestly did not.</p><p>Here is my response to being asked a similar question about 18 months ago, which led to the <a href=\"http://www.milobookclub.com/2012/04/26/dissecting-sceptics-i/\">“Dissecting the Sceptics”</a> series of posts. If JB hasn’t read through it, I would recommend doing so.</p><p><i>“The first question I always ask myself is if the argument is primarily<br> factual, logical, or rhetorical in nature.  The second question I ask<br> myself is if the author is likely to have any idea what he’s talking<br> about or not.  And the third question is if I regard the author as being<br> trustworthy or not, or rather, if I believe him to be fundamentally<br> intellectually honest or not.  These three questions determine how<br> carefully I read through an argument and whether I presume the author is<br> more likely to make a simple mistake or whether any apparent mistakes<br> are actually intentional attempts to sneak something past the<br> insufficiently careful reader in order to make a flawed argument look<br> convincing.</br></br></br></br></br></br></br></br></br></br></i></p><p>“The fourth question is what is the author trying to prove?  This<br> question often can’t be answered initially, but I keep it in the back of<br> my mind for future reference.  Once I identify the specific point that<br> the author is trying to prove, I can track back from it to see if a) his<br> logic is correct, and b) if that logic is soundly supported.  It’s<br> important to keep in mind that the actual point that the author is<br> trying to prove is not necessarily the one that he appears to be trying<br> to prove in the title or introduction.”  </br></br></br></br></br></br></br></p><p>And for those who find McRapey’s argument by appeal to BA in Philosophy of Language from the University of Chicago convincing, it might be educational to read through <a href=\"http://www.milobookclub.com/2012/04/26/dissecting-sceptics-i/\">“Dissecting the Sceptics”</a> andsee what I do to “a Ph.D. student in philosophy at the University of Chicago”.</p></div>",
  "content_text": "JB asks how he can improve his ability to debate:\nDo you have any recommendations on reading material for improving one’s debate skills? I am aware of the most basic premise being the ability to reason, followed by a willingness to suffer defeat in repeated efforts. I am good at debating, but studying what you have posted, as well as other’s responses shows me that there is room for considerable improvement on my part. I am passably familiar with Socrates, Plato, Cicero, and Aristotle; the last of whom is cited considerably often on Vox Populi but I am interested in learning more. What do you feel are the best books to study on this? Can it even be learned through books or does one have to simply fight it out personally and learn by doing?\nGiven Scalzi’s inept appeals to his degree in alleged rhetoric; possibly this cannot be learned other than by doing. However if there are recommendations that you have for books on rhetoric and debate, I would be interested to hear them. After all, my default setting whenever I am interested in learning more about a subject is to buy multiple books on it; so I am hopeful that you might have some suggestions for reading material.\nIt’s important to distinguish between learning about something and actually doing it. Although not a basketball fan, I know a fair amount about basketball courtesy of Bill Simmons, a lifelong basketball fanatic. But nothing that I have ever read about basketball has improved my three-point shot.\nAs Michael Jordan once said after one of his returns from retirement, the best way to get in shape for playing basketball is to play basketball. I run twice per week in the soccer offseason in order to stay in shape, but no matter how good I am about my off-season routine, the first practice of the season is always the most painful.\nReading Cicero and Plato may provide you with some rhetorical and dialectical tools, but having those tools is not the same thing as knowing how and when to use them effectively. Indeed, reading about them while not putting them into actual practice may actually be detrimental to one’s ability to debate; as JB has seen with Mr. Scalzi, it can even contribute to a powerful sense of self-delusion in that regard.\nI am a little concerned by JB’s assertion of being “passably familiar” with the four classic figures mentioned. One of the great intellectual diseases of our time is the idea that having heard of something, or knowing a little bit about it, is practically akin to having mastered the subject. So, my first suggestion is that JB actually read the Socratic dialogues, read Aristotle’s Rhetoric and Cicero’s De Inventione. Then read something more modern; here is a nice online guide to\nThe Five Canons of Rhetoric\n.\nThis leads to one important guideline: don’t ever claim to know something that you do not, in fact, know better than your opponent expects. A skilled opponent will unmask you faster than you think possible; read my exchange with the atheist Luke for a particularly brutal example of that. On the flip side, I was amused when an online conversation between two evolutionists was brought to my attention, as one was warning the other not to be fooled by my claim to be relatively ignorant about TENS. But I wasn’t playing dumb, the simple fact is that I don’t know biology the way I know economics or the history of video games, so I have to approach the subjects differently.\nIn my opinion, the best way one can develop one’s debating skills is to practice by regularly taking on the most knowledgeable opponents one can find. Consider, for example, the qualitative difference between my exchanges with Nate, with Dominic, and even with Delavagus with my various run-ins with PZ Myers, McRapey, and Luke. I still disagree with all six of them on the subjects we discussed, but the former three knew what they were talking about while the latter three manifestly did not.\nHere is my response to being asked a similar question about 18 months ago, which led to the\n“Dissecting the Sceptics”\nseries of posts. If JB hasn’t read through it, I would recommend doing so.\n“The first question I always ask myself is if the argument is primarily\nfactual, logical, or rhetorical in nature.  The second question I ask\nmyself is if the author is likely to have any idea what he’s talking\nabout or not.  And the third question is if I regard the author as being\ntrustworthy or not, or rather, if I believe him to be fundamentally\nintellectually honest or not.  These three questions determine how\ncarefully I read through an argument and whether I presume the author is\nmore likely to make a simple mistake or whether any apparent mistakes\nare actually intentional attempts to sneak something past the\ninsufficiently careful reader in order to make a flawed argument look\nconvincing.\n“The fourth question is what is the author trying to prove?  This\nquestion often can’t be answered initially, but I keep it in the back of\nmy mind for future reference.  Once I identify the specific point that\nthe author is trying to prove, I can track back from it to see if a) his\nlogic is correct, and b) if that logic is soundly supported.  It’s\nimportant to keep in mind that the actual point that the author is\ntrying to prove is not necessarily the one that he appears to be trying\nto prove in the title or introduction.”\nAnd for those who find McRapey’s argument by appeal to BA in Philosophy of Language from the University of Chicago convincing, it might be educational to read through\n“Dissecting the Sceptics”\nandsee what I do to “a Ph.D. student in philosophy at the University of Chicago”.",
  "tags": [
    "debate",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-22T09:46:00+00:00"
}