{
  "url": "https://voxday.net/2013/12/27/mailvox-starting-out-in-sf/",
  "scraped_at": "2025-12-15T16:41:17.185248",
  "title": "Mailvox: starting out in SF",
  "date_display": "December 27, 2013",
  "date_iso": "2013-12-27T14:00:00+00:00",
  "date_from_url": "2013-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CR asks for some advice concerning science fiction:</p><blockquote class=\"tr_bq\"><p> Hey man… so I’ve never been a fan of science fiction involving elves and dragons and all that so I’ve never given a science fiction book a try. The only scifi movies I’ve watched are the ones that could conceivably be true at some point, such as Oblivion, Europa Report, Moon, etc…</p><p>You’re probably one of the most intelligent people I know of and you certainly seem to be a fan of this genre… since I have some free time on my hands over the holidays, can you recommend a starter list of sci fi books? That whole Quantum Mortis series looks interesting… what’s the correct order to read them in?</p></blockquote><p>With regards to Quantum Mortis, I recommend reading <i>A Man Disrupted</i> first, then <i>Gravity Kills</i>. As for elves, dragons, and science fiction, I should first point out that elves and dragons are typically indicative of fantasy, whereas rocket ships, scientist progagonists, space empires, and future technologies are indicative of science fiction.</p><p>The distinction is an important one, even if all the major science fiction organizations and awards refuse to recognize it. The fact is that <i>Fifty Shades of Grey</i> is every bit as legitimately science fiction as <i>A Game of Thrones</i>; it is certainly pure fantasy.</p><p>In answer to the question, this would be my SF starter list, listed in order of recommended reading.</p><ol><li><a href=\"http://www.astro.sunysb.edu/fwalter/AST389/TEXTS/Nightfall.htm\"><i>Nightfall</i> </a>(short story) by Isaac Asimov</li><li><i>Ender’s Game</i> by Orson Scott Card</li><li><i>Tunnel in the Sky</i> by Robert Heinlein</li><li><i><a href=\"http://dorinta19.bizland.ro/FLOWERS%20FOR%20ALGERNON%20.htm\">Flowers for Algernon</a></i> (short story) by Daniel Keys</li><li><i>Foundation </i>by Isaac Asimov</li><li><i>Inherit the Stars</i> by James P. Hogan</li><li><i>Neuromancer </i>by William Gibson</li><li><i>Dune </i>by Frank Herbert</li><li><i>A Canticle for Leibowitz</i> by Walter M. Miller</li><li><i>Lord of Light</i> by Roger Zelazny</li></ol><p>If you can read through the first five books on the list and find yourself to be largely indifferent, then science fiction is simply not for you. Upon re-reading three of the best-regarded SF series, however, I have to conclude that it may actually be the underrated Giants trilogy by James P. Hogan that is the height of science fiction achievement to date, combining as it does physics, evolution, creation mythology, and the great secular dream of a united Man take his first steps out into the wider universe.</p><p>It was fascinating to discover how much better I liked <i>Dune Messiah</i> and <i>Children of Dune</i> as an adult. They’re not epic like Dune was; Herbert literally turns the usual “show, don’t tell” mantra on its head by refusing to show anything at all of Muad’Dib’s jihad. But I think some of the two books’ subtleties are lost on a teenager, as well as the full scope of Herbert’s incisive commentary on failure and human tragedy.</p></div>",
  "content_text": "CR asks for some advice concerning science fiction:\nHey man… so I’ve never been a fan of science fiction involving elves and dragons and all that so I’ve never given a science fiction book a try. The only scifi movies I’ve watched are the ones that could conceivably be true at some point, such as Oblivion, Europa Report, Moon, etc…\nYou’re probably one of the most intelligent people I know of and you certainly seem to be a fan of this genre… since I have some free time on my hands over the holidays, can you recommend a starter list of sci fi books? That whole Quantum Mortis series looks interesting… what’s the correct order to read them in?\nWith regards to Quantum Mortis, I recommend reading\nA Man Disrupted\nfirst, then\nGravity Kills\n. As for elves, dragons, and science fiction, I should first point out that elves and dragons are typically indicative of fantasy, whereas rocket ships, scientist progagonists, space empires, and future technologies are indicative of science fiction.\nThe distinction is an important one, even if all the major science fiction organizations and awards refuse to recognize it. The fact is that\nFifty Shades of Grey\nis every bit as legitimately science fiction as\nA Game of Thrones\n; it is certainly pure fantasy.\nIn answer to the question, this would be my SF starter list, listed in order of recommended reading.\nNightfall\n(short story) by Isaac Asimov\nEnder’s Game\nby Orson Scott Card\nTunnel in the Sky\nby Robert Heinlein\nFlowers for Algernon\n(short story) by Daniel Keys\nFoundation\nby Isaac Asimov\nInherit the Stars\nby James P. Hogan\nNeuromancer\nby William Gibson\nDune\nby Frank Herbert\nA Canticle for Leibowitz\nby Walter M. Miller\nLord of Light\nby Roger Zelazny\nIf you can read through the first five books on the list and find yourself to be largely indifferent, then science fiction is simply not for you. Upon re-reading three of the best-regarded SF series, however, I have to conclude that it may actually be the underrated Giants trilogy by James P. Hogan that is the height of science fiction achievement to date, combining as it does physics, evolution, creation mythology, and the great secular dream of a united Man take his first steps out into the wider universe.\nIt was fascinating to discover how much better I liked\nDune Messiah\nand\nChildren of Dune\nas an adult. They’re not epic like Dune was; Herbert literally turns the usual “show, don’t tell” mantra on its head by refusing to show anything at all of Muad’Dib’s jihad. But I think some of the two books’ subtleties are lost on a teenager, as well as the full scope of Herbert’s incisive commentary on failure and human tragedy.",
  "tags": [
    "books",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-27T14:00:00+00:00"
}