{
  "url": "https://voxday.net/2013/12/30/mailvox-flat-gene-society/",
  "scraped_at": "2025-12-15T16:41:35.231696",
  "title": "Mailvox: the Flat Gene Society",
  "date_display": "December 30, 2013",
  "date_iso": "2013-12-30T11:29:00+00:00",
  "date_from_url": "2013-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Physphilmusic inadvertently reveals the inner fascist that lurks within most cultural liberals:</p><blockquote class=\"tr_bq\"><p> I guess that is the root of our disagreement. It’s not that I don’t think genetics plays a significant role (although concerning exactly how much I probably disagree with you), it’s that if I adopted your strategy, I see no reason to stop at merely discriminating against blacks. Why not eugenics altogether? Your concern about genetics logically leads to this. You advocate measures which are effectively indirect, long-term forms of eugenics. But if you have no qualms about hurting a few people’s feelings, why stop there? Why not support the sterilization of people below certain IQ levels?</p></blockquote><p>A focus on feelings is a reliable hallmark of those with no moral core at their center. The idea that opposing forced desegregation is necessarily indicative of hatred, much less a secret desire for genocide, is not only irrational, but exposes the ravenous, immoral beast at the heart of modern left-liberalism.</p><p>Observe the twisted left-liberal logic. First, there is the determination to deny reality. The genetic differences between the various human population groups either exist or not. The intellectual and behavioral limits imposed by those genetic differences either exist or not. And while for the last 50 years it has been de rigueur to claim that there are no genetic differences between various population groups, or that any differences are meaningless, advances in human genetics mean that is now the genetic equivalent of belonging to the Flat Earth Society.</p><p>Second, there is the illogical claim that recognizing those genetically imposed limits between various groups must <i>necessarily </i>lead to eugenics. This can only be true if one is operating from an immoral assumption of the right of some central authority to impose minimum capability requirements on the population. Needless to say, I completely reject this notion. The fact that some people are observably incapable of living in an advanced civilization does not justify harming them or treating them as sub-human. There is no reason they should not be able to live in the sort of society in which their predecessors have successfully lived for thousands of years.</p><p>Why stop with mere feelbad? Because human beings do not have the right to not experience hurt feelings. It is not possible to construct a legal system, much less maintain a society, on the basis of the avoidance of hurt feelings. However, humans of every genetic melange and intellectual capacity have the right to life, the right to self-defense, and the right to procreate. Segregation may advantage some and disadvantage others, it may cause many to feel hurt and rejected, but it does not intrinsically cause material harm to anyone; billions of people of every creed and color would not have historically self-segregated if it did. Sterilization and eugenics, on the other hand, obviously do inflict a considerable amount of direct and material harm on the individual.</p><p>Moreover, segregation is a natural and organic process. To fight it is to literally fight nature. Consider that despite its overall population being swollen by an alien invasion and relentless propaganda cheering the manifold blessings of diversity, London has seen its white-British population fall by 620,000 in only ten years, much faster than any of the experts expected. After fifty years of “civil rights” America is still unofficially segregated by neighborhood, by city, by suburb, and even by state.</p><p>Leo Tolstoy wrote about the great tides of human events that are totally beyond any human capacity to control. He used the example of Napoleon at Waterloo and showed conclusively how Napoleon didn’t know what was happening during the battle or even what units were involved in its most critical phases. In like manner, the precise way in which the inevitable reaction to the imposition of mass immigration and cultural invasion is impossible to predict, but no one with any sense of history can reasonably deny it is going to take place.</p><p>My opinion is that it would be much better for the governments of the West to align their actions with that inevitable reaction than to oppose it, but I have little hope that will be the case. Many will argue that because the reaction has not taken place yet, it will never happen, but one could have accurately said that prior to every large-scale event in human history.</p><p>Cry raciss all you like. It will change nothing. Deny the existence and the significance of human genetics until you turn blue. It will change nothing. Profess your undying allegiance to the religion of human equality with all the fervor of an early Christian martyr. It will change nothing. For as the white liberal aid worker raped in Haiti came to discover, there is no magical incantation that will save you from being out-group when the in-group turns against the outsiders.</p><p>The Flat Gene Society is even more ridiculous than the Flat Earth Society. At least those who belonged to the latter had the excuse of correctly observing what they saw with their own eyes. The Flat Gene Society requires ignoring science and history as well as the evidence of one’s own eyes.</p></div>",
  "content_text": "Physphilmusic inadvertently reveals the inner fascist that lurks within most cultural liberals:\nI guess that is the root of our disagreement. It’s not that I don’t think genetics plays a significant role (although concerning exactly how much I probably disagree with you), it’s that if I adopted your strategy, I see no reason to stop at merely discriminating against blacks. Why not eugenics altogether? Your concern about genetics logically leads to this. You advocate measures which are effectively indirect, long-term forms of eugenics. But if you have no qualms about hurting a few people’s feelings, why stop there? Why not support the sterilization of people below certain IQ levels?\nA focus on feelings is a reliable hallmark of those with no moral core at their center. The idea that opposing forced desegregation is necessarily indicative of hatred, much less a secret desire for genocide, is not only irrational, but exposes the ravenous, immoral beast at the heart of modern left-liberalism.\nObserve the twisted left-liberal logic. First, there is the determination to deny reality. The genetic differences between the various human population groups either exist or not. The intellectual and behavioral limits imposed by those genetic differences either exist or not. And while for the last 50 years it has been de rigueur to claim that there are no genetic differences between various population groups, or that any differences are meaningless, advances in human genetics mean that is now the genetic equivalent of belonging to the Flat Earth Society.\nSecond, there is the illogical claim that recognizing those genetically imposed limits between various groups must\nnecessarily\nlead to eugenics. This can only be true if one is operating from an immoral assumption of the right of some central authority to impose minimum capability requirements on the population. Needless to say, I completely reject this notion. The fact that some people are observably incapable of living in an advanced civilization does not justify harming them or treating them as sub-human. There is no reason they should not be able to live in the sort of society in which their predecessors have successfully lived for thousands of years.\nWhy stop with mere feelbad? Because human beings do not have the right to not experience hurt feelings. It is not possible to construct a legal system, much less maintain a society, on the basis of the avoidance of hurt feelings. However, humans of every genetic melange and intellectual capacity have the right to life, the right to self-defense, and the right to procreate. Segregation may advantage some and disadvantage others, it may cause many to feel hurt and rejected, but it does not intrinsically cause material harm to anyone; billions of people of every creed and color would not have historically self-segregated if it did. Sterilization and eugenics, on the other hand, obviously do inflict a considerable amount of direct and material harm on the individual.\nMoreover, segregation is a natural and organic process. To fight it is to literally fight nature. Consider that despite its overall population being swollen by an alien invasion and relentless propaganda cheering the manifold blessings of diversity, London has seen its white-British population fall by 620,000 in only ten years, much faster than any of the experts expected. After fifty years of “civil rights” America is still unofficially segregated by neighborhood, by city, by suburb, and even by state.\nLeo Tolstoy wrote about the great tides of human events that are totally beyond any human capacity to control. He used the example of Napoleon at Waterloo and showed conclusively how Napoleon didn’t know what was happening during the battle or even what units were involved in its most critical phases. In like manner, the precise way in which the inevitable reaction to the imposition of mass immigration and cultural invasion is impossible to predict, but no one with any sense of history can reasonably deny it is going to take place.\nMy opinion is that it would be much better for the governments of the West to align their actions with that inevitable reaction than to oppose it, but I have little hope that will be the case. Many will argue that because the reaction has not taken place yet, it will never happen, but one could have accurately said that prior to every large-scale event in human history.\nCry raciss all you like. It will change nothing. Deny the existence and the significance of human genetics until you turn blue. It will change nothing. Profess your undying allegiance to the religion of human equality with all the fervor of an early Christian martyr. It will change nothing. For as the white liberal aid worker raped in Haiti came to discover, there is no magical incantation that will save you from being out-group when the in-group turns against the outsiders.\nThe Flat Gene Society is even more ridiculous than the Flat Earth Society. At least those who belonged to the latter had the excuse of correctly observing what they saw with their own eyes. The Flat Gene Society requires ignoring science and history as well as the evidence of one’s own eyes.",
  "tags": [
    "mailvox",
    "science",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-30T11:29:00+00:00"
}