{
  "url": "https://voxday.net/2013/12/11/mcrapey-on-rhetoric/",
  "scraped_at": "2025-12-15T16:39:40.745672",
  "title": "McRapey on rhetoric",
  "date_display": "December 11, 2013",
  "date_iso": "2013-12-11T08:40:00+00:00",
  "date_from_url": "2013-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s as if Aristotle were walking among us! John Scalzi instructs one of his commenters on rhetoric:</p><blockquote class=\"tr_bq\"><p> <b>Riccola: </b><i>Mr. Scalzi, while you have certainly drawn your own conclusions regarding Mr. Beale, I would say you are incorrect in stating that he is a case example of the Dunning Kruger effect. He is often humble about his ability to design games, write articles, and write books. He has never stated he considers himself great or even good at any of these things. If you are referring to rhetoric I have seen no evidence to indicate he is not skilled. All those who have fully engaged him, a good example would be the ArizonaAtheist, have actually found him to be proficient at rhetoric. From what I have observed only those who do not engage him in discussion believe he is deficient in this area.</i></p><p>I also struggle to see how he has failed to recognize genuine skill in others. There are a plethora of examples of him praising both those he ideologically agrees with and those who despise him. He often praises your ability to market yourself. To me, that does not sound like someone incapable of recognizing genuine skill in others.</p><p>On the third plank of the Dunning Kruger effect, fail to recognize the extremity of their inadequacy, I would not contest as it depends entirely on your metric and perspective.</p><p>The fourth part of the effect, recognize and acknowledge their own previous lack of skill if they are exposed to training for that skill, there is no evidence as to this to be applicable to him. I am not aware of him being trained for anything, or his reflections on being trained.</p><p>With only one part of the Dunning Kruger effect possibly applying to Mr. Beale I would hazard that you are completely unfounded in saying that he is their favourite son. I can only guess your own contempt for the man has inhibited your ability to describe him.</p><p> <b>McRapey:</b>  <i>“If you are referring to rhetoric I have seen no evidence to indicate he is not skilled.”</i></p><p>Speaking as someone whose degree is Philosophy of language (ie, rhetoric), I see lots of evidence to the contrary, I’m afraid. He’s not bad at sounding like he knows what he’s talking about as long as you don’t know what he’s talking about, but that’s not the same thing as being rhetorically skilled, except to the limited extent that “rhetoric” means “ability to spew bullshit.”</p><p>It’s certainly true I don’t think much of him (both in that I don’t think much of him when I don’t have to, and don’t think much of him when I do have to), but in both cases, based on my experience of having to deal with him, I’m very comfortable with my assessment. And in any event it’s not a checklist; one does not need to fulfill all possible conditions to be fully in the grips of Dunning Kruger.</p><p> <b>Riccola:  </b><i>Mr. Scalzi, I do not see why you would consider possessing a bachelors degree in Philosophy of Language would given you any indication that you are proficient or familiar with rhetoric. All it means is twenty years ago you sat in at a desk, someone taught at you, and you received a piece of paper. A degree does not make you, or anyone else, an authority on a subject. Do you think there has never been a bad engineer?</i></p><p> <b>McRapey: </b>And? As I don’t know you or know your capacity to make any sort of assessment of anything (except to the extent that you’ve asserted Mr. Beale is not unskilled, which is an assertion I find dubious for several reasons and does not put you in good stead regarding my assessment of your own evaluative skills), I would say that you not seeing why it matters really is your problem and not mine. Likewise, perhaps your school gives out bachelor degrees as if they were issued from a gumball machine. Mine doesn’t, and in particular did not in my case.</p></blockquote><p>What I found so amusing about this is that McRapey clearly hasn’t changed his debating technique since at least 2005.</p><ol><li>Make an obviously questionable assertion.</li><li>When the assertion is questioned, appeal to bachelor’s degree.</li><li>When the appeal to the bachelor’s degree is questioned, question the questioner’s intellect and/or good will.</li><li>Avoid further questions.</li><li>Posture as if one has thoroughly proved one’s point.</li></ol><p>Riccola isn’t the first to discover John Scalzi’s rhetorical limitations. In addition to <a href=\"http://nielsenhayden.com/electrolite/archives/006122.html\">my first encounter</a> with them in 2005, Agathis <a href=\"http://www.milobookclub.com/2013/09/12/mailvox-run-in-with-mcrapey/\">had much the same experience</a>. Not only does McRapey have no observable capacity for dialectic, his rhetoric is almost entirely limited to name-calling, argumentum ad hominem, inept satire, and the sophistic technique known as “ambiguity”. The irony of Scalzi’s position should be readily apparent when one compares his observed lack of rhetorical skill with the Dunning-Kruger effect checklist.</p><p>Dunning and Kruger proposed that, for a given skill, incompetent people will:</p><ol><li>tend to overestimate their own level of skill; (check)</li><li>fail to recognize genuine skill in others; (check)</li><li>fail to recognize the extremity of their inadequacy; (check)</li><li>recognize and acknowledge their own previous lack of skill, <i>if</i> they are exposed to training for that skill. (NA)</li></ol><p>McRapey not only hits squarely on three of the four checkboxes, but his exhibited behavior is even worse than Dunning and Kruger conceived. He claims to have had rhetorical training, and yet he STILL doesn’t acknowledge his near-complete lack of rhetorical skill. Now, I tend to suspect this is because he genuinely doesn’t realize that he’s had no real rhetorical training, but is rather operating on the false assumption that Riccola already noted.</p><p>McRapey went on to dig himself in deeper by revealing that despite his BACHELOR’S DEGREE IN THE PHILOSOPHY OF LANGUAGE, he was incapable of following the Latin into Greek:</p><blockquote class=\"tr_bq\"><p> You’d have to ask him; he came up with the “Vox Day” name. Note that it’s a play off of “Vox Dei,” i.e., “The Voice of God,” which is amusing for several reasons.</p><p>As for besting me in argument, well, no, not at any point I can remember. Bear in mind I haven’t engaged him in discussion for years now, so this claim is not based on anything recent. With respect to me, I am aware of him not being able to understand what satire is until it was pointed out to him and then compensating for his error by calling me “McRapey” as salve for his ego; I’m also aware that because he doesn’t appear to understand what “up to” means, that he likes to say I lie about my readership numbers here. I’m not entirely sure either of those qualify as excellent arguments, based as they are on weak foundations.</p><p>This is not to say Mr. Beale is absolutely incapable of creating a sound logical argument. But in my experience in looking at his arguments, he does it rarely, in no small part because his ground level assumptions are complete shit. If you build your arguments on shit, they’re going to topple over regardless of how you construct your edifice. It’s not his arguments’ only problem, but it’s their first problem, to be sure.</p><p>Let’s just say I am not greatly impressed by his ability to argue. Again, you are free to disagree.</p></blockquote><p>Since “theos” in Greek is god, well, unlike Mr. Philosophy of Language, I suspect most of you should be able to figure out the secret etymological chain that has been lost upon so many would-be outers over the years. He’s very nearly correct about my not besting him in argument, because beyond that first encounter he has resolutely run away from debate with me, even when it was publicly proposed by third parties.</p><p>I’ve already proven beyond any shadow of doubt that John Scalzi lies about his blog traffic, which is now less than two-thirds of my own. I not only understand what “up to” means, (and “~” as well), and how it can be used to mislead people, but I also caught him <a href=\"http://www.milobookclub.com/2013/08/12/a-minor-margin-of-error/\">when he tried to drop the “up to”</a> on at least two occasions earlier this year. As for his claims about my inability to recognize satire, I am content to respond by pointing to the second item on the Dunning Kruger effect checklist in combination with this quote: “I’m very comfortable with my assessment.”</p><p>No doubt he is.</p><p>It is hardly surprising that McRapey doesn’t try to critique any of my arguments or show a single example of one that is incorrect, but merely waves his hand and provides a naked assertion that my “ground level assumptions are complete shit”. If called on this, no doubt he will point out that he has a BACHELOR’S DEGREE….</p></div>",
  "content_text": "It’s as if Aristotle were walking among us! John Scalzi instructs one of his commenters on rhetoric:\nRiccola:\nMr. Scalzi, while you have certainly drawn your own conclusions regarding Mr. Beale, I would say you are incorrect in stating that he is a case example of the Dunning Kruger effect. He is often humble about his ability to design games, write articles, and write books. He has never stated he considers himself great or even good at any of these things. If you are referring to rhetoric I have seen no evidence to indicate he is not skilled. All those who have fully engaged him, a good example would be the ArizonaAtheist, have actually found him to be proficient at rhetoric. From what I have observed only those who do not engage him in discussion believe he is deficient in this area.\nI also struggle to see how he has failed to recognize genuine skill in others. There are a plethora of examples of him praising both those he ideologically agrees with and those who despise him. He often praises your ability to market yourself. To me, that does not sound like someone incapable of recognizing genuine skill in others.\nOn the third plank of the Dunning Kruger effect, fail to recognize the extremity of their inadequacy, I would not contest as it depends entirely on your metric and perspective.\nThe fourth part of the effect, recognize and acknowledge their own previous lack of skill if they are exposed to training for that skill, there is no evidence as to this to be applicable to him. I am not aware of him being trained for anything, or his reflections on being trained.\nWith only one part of the Dunning Kruger effect possibly applying to Mr. Beale I would hazard that you are completely unfounded in saying that he is their favourite son. I can only guess your own contempt for the man has inhibited your ability to describe him.\nMcRapey:\n“If you are referring to rhetoric I have seen no evidence to indicate he is not skilled.”\nSpeaking as someone whose degree is Philosophy of language (ie, rhetoric), I see lots of evidence to the contrary, I’m afraid. He’s not bad at sounding like he knows what he’s talking about as long as you don’t know what he’s talking about, but that’s not the same thing as being rhetorically skilled, except to the limited extent that “rhetoric” means “ability to spew bullshit.”\nIt’s certainly true I don’t think much of him (both in that I don’t think much of him when I don’t have to, and don’t think much of him when I do have to), but in both cases, based on my experience of having to deal with him, I’m very comfortable with my assessment. And in any event it’s not a checklist; one does not need to fulfill all possible conditions to be fully in the grips of Dunning Kruger.\nRiccola:\nMr. Scalzi, I do not see why you would consider possessing a bachelors degree in Philosophy of Language would given you any indication that you are proficient or familiar with rhetoric. All it means is twenty years ago you sat in at a desk, someone taught at you, and you received a piece of paper. A degree does not make you, or anyone else, an authority on a subject. Do you think there has never been a bad engineer?\nMcRapey:\nAnd? As I don’t know you or know your capacity to make any sort of assessment of anything (except to the extent that you’ve asserted Mr. Beale is not unskilled, which is an assertion I find dubious for several reasons and does not put you in good stead regarding my assessment of your own evaluative skills), I would say that you not seeing why it matters really is your problem and not mine. Likewise, perhaps your school gives out bachelor degrees as if they were issued from a gumball machine. Mine doesn’t, and in particular did not in my case.\nWhat I found so amusing about this is that McRapey clearly hasn’t changed his debating technique since at least 2005.\nMake an obviously questionable assertion.\nWhen the assertion is questioned, appeal to bachelor’s degree.\nWhen the appeal to the bachelor’s degree is questioned, question the questioner’s intellect and/or good will.\nAvoid further questions.\nPosture as if one has thoroughly proved one’s point.\nRiccola isn’t the first to discover John Scalzi’s rhetorical limitations. In addition to\nmy first encounter\nwith them in 2005, Agathis\nhad much the same experience\n. Not only does McRapey have no observable capacity for dialectic, his rhetoric is almost entirely limited to name-calling, argumentum ad hominem, inept satire, and the sophistic technique known as “ambiguity”. The irony of Scalzi’s position should be readily apparent when one compares his observed lack of rhetorical skill with the Dunning-Kruger effect checklist.\nDunning and Kruger proposed that, for a given skill, incompetent people will:\ntend to overestimate their own level of skill; (check)\nfail to recognize genuine skill in others; (check)\nfail to recognize the extremity of their inadequacy; (check)\nrecognize and acknowledge their own previous lack of skill,\nif\nthey are exposed to training for that skill. (NA)\nMcRapey not only hits squarely on three of the four checkboxes, but his exhibited behavior is even worse than Dunning and Kruger conceived. He claims to have had rhetorical training, and yet he STILL doesn’t acknowledge his near-complete lack of rhetorical skill. Now, I tend to suspect this is because he genuinely doesn’t realize that he’s had no real rhetorical training, but is rather operating on the false assumption that Riccola already noted.\nMcRapey went on to dig himself in deeper by revealing that despite his BACHELOR’S DEGREE IN THE PHILOSOPHY OF LANGUAGE, he was incapable of following the Latin into Greek:\nYou’d have to ask him; he came up with the “Vox Day” name. Note that it’s a play off of “Vox Dei,” i.e., “The Voice of God,” which is amusing for several reasons.\nAs for besting me in argument, well, no, not at any point I can remember. Bear in mind I haven’t engaged him in discussion for years now, so this claim is not based on anything recent. With respect to me, I am aware of him not being able to understand what satire is until it was pointed out to him and then compensating for his error by calling me “McRapey” as salve for his ego; I’m also aware that because he doesn’t appear to understand what “up to” means, that he likes to say I lie about my readership numbers here. I’m not entirely sure either of those qualify as excellent arguments, based as they are on weak foundations.\nThis is not to say Mr. Beale is absolutely incapable of creating a sound logical argument. But in my experience in looking at his arguments, he does it rarely, in no small part because his ground level assumptions are complete shit. If you build your arguments on shit, they’re going to topple over regardless of how you construct your edifice. It’s not his arguments’ only problem, but it’s their first problem, to be sure.\nLet’s just say I am not greatly impressed by his ability to argue. Again, you are free to disagree.\nSince “theos” in Greek is god, well, unlike Mr. Philosophy of Language, I suspect most of you should be able to figure out the secret etymological chain that has been lost upon so many would-be outers over the years. He’s very nearly correct about my not besting him in argument, because beyond that first encounter he has resolutely run away from debate with me, even when it was publicly proposed by third parties.\nI’ve already proven beyond any shadow of doubt that John Scalzi lies about his blog traffic, which is now less than two-thirds of my own. I not only understand what “up to” means, (and “~” as well), and how it can be used to mislead people, but I also caught him\nwhen he tried to drop the “up to”\non at least two occasions earlier this year. As for his claims about my inability to recognize satire, I am content to respond by pointing to the second item on the Dunning Kruger effect checklist in combination with this quote: “I’m very comfortable with my assessment.”\nNo doubt he is.\nIt is hardly surprising that McRapey doesn’t try to critique any of my arguments or show a single example of one that is incorrect, but merely waves his hand and provides a naked assertion that my “ground level assumptions are complete shit”. If called on this, no doubt he will point out that he has a BACHELOR’S DEGREE….",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-11T08:40:00+00:00"
}