{
  "url": "https://voxday.net/2013/12/05/more-and-more-diversity/",
  "scraped_at": "2025-12-15T16:39:00.701237",
  "title": "More and more diversity",
  "date_display": "December 5, 2013",
  "date_iso": "2013-12-05T14:00:00+00:00",
  "date_from_url": "2013-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If 50 million Mexican immigrants are good for the economy, imagine how much better <a href=\"http://www.foxnews.com/politics/2013/12/04/massive-china-themed-city-proposed-in-new-yorks-catskills/\">100 million Chinese immigrants</a> would be. We’ll all live like kings!</p><blockquote class=\"tr_bq\"><p> U.S. immigration officials are considering a proposal from Chinese<br> investors to create a multibillion-dollar development in New York’s<br> Catskills called “China City” — raising concerns among critics about<br> the potential cost to U.S. taxpayers and, according to one analyst, the<br> possibility it could be a “stalking horse” for the Beijing government.</br></br></br></br></p><p>A spokesman from the U.S. Citizenship and Immigration Services told<br> FoxNews.com that the proposal for Thompson, N.Y., has not been approved<br> but is under consideration.</br></br></p><p>The mysterious proposed development appears to be a step beyond the<br> types of ethnic enclaves scattered throughout U.S. cities, like the<br> Chinatown sections of New York City or San Francisco. The 600-acre<br> “China City of America” is located far outside New York City in upstate<br> New York’s wetlands and is a meticulously planned project, calling for<br> family housing, a college and student residences, among other<br> structures.</br></br></br></br></br></br></p></blockquote><p>I have a better idea. Let’s just give them New York City along with all of its residents, most of whom are avid supporters of mass immigration. Then move all the post-1965 immigrants into New York state.  All of the promised economic benefits with none of the social costs.</p><p>How can those who have repeatedly claimed that the magic of geographical relocation transforms serfs and savages into true blue Constitution-loving Americans possibly object to establishing large Chinese cities in their midst? And how could anyone suspect that the new Chinese-Americans would harbor any loyalties to Beijing? They’re here for the opportunity, after all!  They love America!</p></div>",
  "content_text": "If 50 million Mexican immigrants are good for the economy, imagine how much better\n100 million Chinese immigrants\nwould be. We’ll all live like kings!\nU.S. immigration officials are considering a proposal from Chinese\ninvestors to create a multibillion-dollar development in New York’s\nCatskills called “China City” — raising concerns among critics about\nthe potential cost to U.S. taxpayers and, according to one analyst, the\npossibility it could be a “stalking horse” for the Beijing government.\nA spokesman from the U.S. Citizenship and Immigration Services told\nFoxNews.com that the proposal for Thompson, N.Y., has not been approved\nbut is under consideration.\nThe mysterious proposed development appears to be a step beyond the\ntypes of ethnic enclaves scattered throughout U.S. cities, like the\nChinatown sections of New York City or San Francisco. The 600-acre\n“China City of America” is located far outside New York City in upstate\nNew York’s wetlands and is a meticulously planned project, calling for\nfamily housing, a college and student residences, among other\nstructures.\nI have a better idea. Let’s just give them New York City along with all of its residents, most of whom are avid supporters of mass immigration. Then move all the post-1965 immigrants into New York state.  All of the promised economic benefits with none of the social costs.\nHow can those who have repeatedly claimed that the magic of geographical relocation transforms serfs and savages into true blue Constitution-loving Americans possibly object to establishing large Chinese cities in their midst? And how could anyone suspect that the new Chinese-Americans would harbor any loyalties to Beijing? They’re here for the opportunity, after all!  They love America!",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-05T14:00:00+00:00"
}