{
  "url": "https://voxday.net/2013/12/31/nsa-backdoors-tech-world/",
  "scraped_at": "2025-12-15T16:41:42.983538",
  "title": "NSA backdoors the tech world",
  "date_display": "December 31, 2013",
  "date_iso": "2013-12-31T13:00:00+00:00",
  "date_from_url": "2013-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The NSA appears to have been bent on <a href=\"http://www.spiegel.de/international/world/catalog-reveals-nsa-has-back-doors-for-numerous-devices-a-940994.html#spRedirectedFrom=www&amp;referrrer=\">destroying the ability of American companies to export hardware</a> as well as sell software services internationally:</p><blockquote class=\"tr_bq\"><p> They claim the performance of the company’s special computers is “unmatched” and their firewalls are the “best-in-class.” Despite these assurances, though, there is one attacker none of these products can fend off — the United States’ National Security Agency.</p><p>Specialists at the intelligence organization succeeded years ago in penetrating the company’s digital firewalls. A document viewed by SPIEGEL resembling a product catalog reveals that an NSA division called ANT has burrowed its way into nearly all the security architecture made by the major players in the industry — including American global market leader Cisco and its Chinese competitor Huawei, but also producers of mass-market goods, such as US computer-maker Dell.</p><p>These NSA agents, who specialize in secret back doors, are able to keep an eye on all levels of our digital lives — from computing centers to individual computers, and from laptops to mobile phones. For nearly every lock, ANT seems to have a key in its toolbox. And no matter what walls companies erect, the NSA’s specialists seem already to have gotten past them….</p><p>The ANT division doesn’t just manufacture surveillance hardware. It<br> also develops software for special tasks. The ANT developers have a<br> clear preference for planting their malicious code in so-called BIOS,<br> software located on a computer’s motherboard that is the first thing to<br> load when a computer is turned on. This has a number of valuable advantages: an infected PC or server<br> appears to be functioning normally, so the infection remains invisible<br> to virus protection and other security programs. And even if the hard<br> drive of an infected computer has been completely erased and a new<br> operating system is installed, the ANT malware can continue to function<br> and ensures that new spyware can once again be loaded onto what is<br> presumed to be a clean computer. The ANT developers call this<br> “Persistence” and believe this approach has provided them with the<br> possibility of permanent access.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Another program attacks the firmware in hard drives manufactured by<br> Western Digital, Seagate, Maxtor and Samsung, all of which, with the<br> exception of the latter, are American companies. Here, too, it appears<br> the US intelligence agency is compromising the technology and products<br> of American companies.</br></br></br></br></p></blockquote><p>At this point, why would any European or Asian company buy products from an American company? The NSA is totally out of control and it has to be dismantled as soon as possible before the American tech sector is devastated.</p><p>And what are they doing with all this access? Stopping terrorists? Interdicting drug smugglers? Preventing bank fraud? No, <a href=\"http://abcnews.go.com/Blotter/exclusive-inside-account-us-eavesdropping-americans/story?id=5987804\">they’re listening to American soldiers</a> have phone sex with their wives back home.</p><p>The NSA has zero credibility at this point. Zero.</p></div>",
  "content_text": "The NSA appears to have been bent on\ndestroying the ability of American companies to export hardware\nas well as sell software services internationally:\nThey claim the performance of the company’s special computers is “unmatched” and their firewalls are the “best-in-class.” Despite these assurances, though, there is one attacker none of these products can fend off — the United States’ National Security Agency.\nSpecialists at the intelligence organization succeeded years ago in penetrating the company’s digital firewalls. A document viewed by SPIEGEL resembling a product catalog reveals that an NSA division called ANT has burrowed its way into nearly all the security architecture made by the major players in the industry — including American global market leader Cisco and its Chinese competitor Huawei, but also producers of mass-market goods, such as US computer-maker Dell.\nThese NSA agents, who specialize in secret back doors, are able to keep an eye on all levels of our digital lives — from computing centers to individual computers, and from laptops to mobile phones. For nearly every lock, ANT seems to have a key in its toolbox. And no matter what walls companies erect, the NSA’s specialists seem already to have gotten past them….\nThe ANT division doesn’t just manufacture surveillance hardware. It\nalso develops software for special tasks. The ANT developers have a\nclear preference for planting their malicious code in so-called BIOS,\nsoftware located on a computer’s motherboard that is the first thing to\nload when a computer is turned on. This has a number of valuable advantages: an infected PC or server\nappears to be functioning normally, so the infection remains invisible\nto virus protection and other security programs. And even if the hard\ndrive of an infected computer has been completely erased and a new\noperating system is installed, the ANT malware can continue to function\nand ensures that new spyware can once again be loaded onto what is\npresumed to be a clean computer. The ANT developers call this\n“Persistence” and believe this approach has provided them with the\npossibility of permanent access.\nAnother program attacks the firmware in hard drives manufactured by\nWestern Digital, Seagate, Maxtor and Samsung, all of which, with the\nexception of the latter, are American companies. Here, too, it appears\nthe US intelligence agency is compromising the technology and products\nof American companies.\nAt this point, why would any European or Asian company buy products from an American company? The NSA is totally out of control and it has to be dismantled as soon as possible before the American tech sector is devastated.\nAnd what are they doing with all this access? Stopping terrorists? Interdicting drug smugglers? Preventing bank fraud? No,\nthey’re listening to American soldiers\nhave phone sex with their wives back home.\nThe NSA has zero credibility at this point. Zero.",
  "tags": [
    "conspiracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-31T13:00:00+00:00"
}