{
  "url": "https://voxday.net/2013/12/13/observations-and-societal-implications/",
  "scraped_at": "2025-12-15T16:39:55.746344",
  "title": "Observations and societal implications",
  "date_display": "December 13, 2013",
  "date_iso": "2013-12-13T14:00:00+00:00",
  "date_from_url": "2013-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This long essay on <a href=\"http://whitelocust.wordpress.com/morality-and-abstract-thinking-how-africans-may-differ-from-westerners/\">African difficulties with abstract thought</a> and how this effects everything from basic morality to building maintenance is not unrelated to my own concept of time-to-civilization and how that relates to a population group that has been in regular contact with advanced civilization for less than 400 years. If you are an American reading this, please keep in mind that the African-Americans of your acquaintance are not fully African, but are on average <a href=\"http://www.isteve.com/2002_how_white_are_blacks.htm\">17-18 percent European</a>.</p><blockquote class=\"tr_bq\"><p> I am an American who taught philosophy in several African<br> universities from 1976 to 1988, and have lived since that time in South<br> Africa. When I first came to Africa, I knew virtually nothing about the<br> continent or its people, but I began learning quickly. I noticed, for<br> example, that Africans rarely kept promises and saw no need to apologize<br> when they broke them. It was as if they were unaware they had done<br> anything that called for an apology.</br></br></br></br></br></br></p><p>It took many years for me to understand why Africans behaved this way<br> but I think I can now explain this and other behavior that<br> characterizes Africa. I believe that morality requires abstract<br> thinking—as does planning for the future—and that a relative deficiency<br> in abstract thinking may explain many things that are typically African.</br></br></br></br></p><p>What follow are not scientific findings. There could be alternative<br> explanations for what I have observed, but my conclusions are drawn from<br> more than 30 years of living among Africans….</br></br></p><p>I quote from an article in the South African press about the problems blacks have with mathematics:</p><blockquote><p> “[Xhosa] is a language where polygon and plane have the<br> same definition … where concepts like triangle, quadrilateral, pentagon,<br> hexagon are defined by only one word.” (“Finding New Languages for<br> Maths and Science,” <i>Star</i> [Johannesburg], July 24, 2002, p. 8.)</br></br></br></p></blockquote><p>More accurately, these concepts simply do not exist in Xhosa, which,<br> along with Zulu, is one of the two most widely spoken languages in South<br> Africa. In America, blacks are said to have a “tendency to approximate<br> space, numbers and time instead of aiming for complete accuracy.” (<i>Star,</i><br> June 8, 1988, p.10.) In other words, they are also poor at math. Notice<br> the identical triumvirate—space, numbers, and time. Is it just a<br> coincidence that these three highly abstract concepts are the ones with<br> which blacks — everywhere — seem to have such difficulties?</br></br></br></br></br></br></br></p><p>The entry in the Zulu dictionary for “number,” by the way — <i>ningi </i>—<br> means “numerous,” which is not at all the same as the concept of<br> number. It is clear, therefore, that there is no concept of number in<br> Zulu.</br></br></br></p><p>White rule in South Africa ended in 1994. It was about ten years<br> later that power outages began, which eventually reached crisis<br> proportions. The principle reason for this is simply lack of maintenance<br> on the generating equipment. Maintenance is future-oriented, and the<br> Zulu entry in the dictionary for it is <i>ondla,</i> which means: “1.<br> Nourish, rear; bring up; 2. Keep an eye on; watch (your crop).”</br></br></br></br></br></p><p>In<br> short, there is no such thing as maintenance in Zulu thought, and it<br> would be hard to argue that this is wholly unrelated to the fact that<br> when people throughout Africa say “nothing works,” it is only an<br> exaggeration.</br></br></br></br></p></blockquote><p>Now, it would be surprising if the average American, who has never met an actual African and has absolutely no experience with them, did not blithely attempt to dismiss the detailed observations of someone who has spent more than 30 years living in Africa. After all, most Americans blithely ignore the lessons learned by inner city American schoolteachers. It is considerably harder for those of us who are in occasional contact with Africans and have witnessed them being completely stumped by the abstract concept of “you must first go right in order to go left” to do so.</p><p>For those equalitarians who are horrified by the terrible racissness intrinsic in the observation that most Africans lack the capacity for abstract thinking, I invite you to consider this thought experiment: how successful would you be in a society where you were required to perform complex calculus calculations just to turn on your car? How easy would it be for you to live your daily life if you had to solve a single higher mathematics problem every time you sat down at your desk to do your job?</p><p>That is very similar to the position your equalitarianism places hundreds of millions of people by expecting them to constructively participate in a technologically advanced society that is observably beyond their cognitive capacity. Even in the miraculous event you manage to teach the poor bastards how to puzzle out these metaphorical calculus problems, how successful are they going to be if it usually takes them an hour to work out what the other members of society do without even thinking about it?</p><p>What the equalitarian dogma inevitably leads to is this: a professional signer <a href=\"http://www.youtube.com/watch?feature=player_embedded&amp;v=6fzRSE_p1Ys\">who doesn’t know sign language</a>.  Now that’s pretty damn funny. But it’s not so funny when you’re talking about engineers at power stations, airplane mechanics, and transportation technicians responsible for keeping the food supply chain flowing smoothly.</p><p>Thowing an entire people into the civilizational deep end to either sink or swim is an intrinsically ugly and inhumane action. And it’s even worse to go on and permit them to drag down the very institutions that are capable of raising them up over time. It also has some ominous implications for racially diverse places such as South Africa and various American cities, as there is considerable evidence very thing that the equalitarians are counting on to prevent widespread racial conflict, a sense of future self-interest on the part of the African community, does not exist at all.</p><p>Now, one can certainly argue that I’m incorrect. One can certainly argue that the gentleman’s observations over the last 30 years are mistaken for one reason or another. But doing so will require the presentation of contrasting evidence and running away angrily crying raciss is a retreat from reality; it is not a response. It should also be kept in mind that divergent capacity for abstract thought in various human population groups has no more to do with my personal preferences than the score of the upcoming Vikings game depends upon which team I want to win.</p><p>While the idea that I am some sort of reality-defining god is flattering, I can assure you, it simply isn’t the case.</p></div>",
  "content_text": "This long essay on\nAfrican difficulties with abstract thought\nand how this effects everything from basic morality to building maintenance is not unrelated to my own concept of time-to-civilization and how that relates to a population group that has been in regular contact with advanced civilization for less than 400 years. If you are an American reading this, please keep in mind that the African-Americans of your acquaintance are not fully African, but are on average\n17-18 percent European\n.\nI am an American who taught philosophy in several African\nuniversities from 1976 to 1988, and have lived since that time in South\nAfrica. When I first came to Africa, I knew virtually nothing about the\ncontinent or its people, but I began learning quickly. I noticed, for\nexample, that Africans rarely kept promises and saw no need to apologize\nwhen they broke them. It was as if they were unaware they had done\nanything that called for an apology.\nIt took many years for me to understand why Africans behaved this way\nbut I think I can now explain this and other behavior that\ncharacterizes Africa. I believe that morality requires abstract\nthinking—as does planning for the future—and that a relative deficiency\nin abstract thinking may explain many things that are typically African.\nWhat follow are not scientific findings. There could be alternative\nexplanations for what I have observed, but my conclusions are drawn from\nmore than 30 years of living among Africans….\nI quote from an article in the South African press about the problems blacks have with mathematics:\n“[Xhosa] is a language where polygon and plane have the\nsame definition … where concepts like triangle, quadrilateral, pentagon,\nhexagon are defined by only one word.” (“Finding New Languages for\nMaths and Science,”\nStar\n[Johannesburg], July 24, 2002, p. 8.)\nMore accurately, these concepts simply do not exist in Xhosa, which,\nalong with Zulu, is one of the two most widely spoken languages in South\nAfrica. In America, blacks are said to have a “tendency to approximate\nspace, numbers and time instead of aiming for complete accuracy.” (\nStar,\nJune 8, 1988, p.10.) In other words, they are also poor at math. Notice\nthe identical triumvirate—space, numbers, and time. Is it just a\ncoincidence that these three highly abstract concepts are the ones with\nwhich blacks — everywhere — seem to have such difficulties?\nThe entry in the Zulu dictionary for “number,” by the way —\nningi\n—\nmeans “numerous,” which is not at all the same as the concept of\nnumber. It is clear, therefore, that there is no concept of number in\nZulu.\nWhite rule in South Africa ended in 1994. It was about ten years\nlater that power outages began, which eventually reached crisis\nproportions. The principle reason for this is simply lack of maintenance\non the generating equipment. Maintenance is future-oriented, and the\nZulu entry in the dictionary for it is\nondla,\nwhich means: “1.\nNourish, rear; bring up; 2. Keep an eye on; watch (your crop).”\nIn\nshort, there is no such thing as maintenance in Zulu thought, and it\nwould be hard to argue that this is wholly unrelated to the fact that\nwhen people throughout Africa say “nothing works,” it is only an\nexaggeration.\nNow, it would be surprising if the average American, who has never met an actual African and has absolutely no experience with them, did not blithely attempt to dismiss the detailed observations of someone who has spent more than 30 years living in Africa. After all, most Americans blithely ignore the lessons learned by inner city American schoolteachers. It is considerably harder for those of us who are in occasional contact with Africans and have witnessed them being completely stumped by the abstract concept of “you must first go right in order to go left” to do so.\nFor those equalitarians who are horrified by the terrible racissness intrinsic in the observation that most Africans lack the capacity for abstract thinking, I invite you to consider this thought experiment: how successful would you be in a society where you were required to perform complex calculus calculations just to turn on your car? How easy would it be for you to live your daily life if you had to solve a single higher mathematics problem every time you sat down at your desk to do your job?\nThat is very similar to the position your equalitarianism places hundreds of millions of people by expecting them to constructively participate in a technologically advanced society that is observably beyond their cognitive capacity. Even in the miraculous event you manage to teach the poor bastards how to puzzle out these metaphorical calculus problems, how successful are they going to be if it usually takes them an hour to work out what the other members of society do without even thinking about it?\nWhat the equalitarian dogma inevitably leads to is this: a professional signer\nwho doesn’t know sign language\n.  Now that’s pretty damn funny. But it’s not so funny when you’re talking about engineers at power stations, airplane mechanics, and transportation technicians responsible for keeping the food supply chain flowing smoothly.\nThowing an entire people into the civilizational deep end to either sink or swim is an intrinsically ugly and inhumane action. And it’s even worse to go on and permit them to drag down the very institutions that are capable of raising them up over time. It also has some ominous implications for racially diverse places such as South Africa and various American cities, as there is considerable evidence very thing that the equalitarians are counting on to prevent widespread racial conflict, a sense of future self-interest on the part of the African community, does not exist at all.\nNow, one can certainly argue that I’m incorrect. One can certainly argue that the gentleman’s observations over the last 30 years are mistaken for one reason or another. But doing so will require the presentation of contrasting evidence and running away angrily crying raciss is a retreat from reality; it is not a response. It should also be kept in mind that divergent capacity for abstract thought in various human population groups has no more to do with my personal preferences than the score of the upcoming Vikings game depends upon which team I want to win.\nWhile the idea that I am some sort of reality-defining god is flattering, I can assure you, it simply isn’t the case.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-13T14:00:00+00:00"
}