{
  "url": "https://voxday.net/2013/12/20/only-racists-will-criticize-this-law/",
  "scraped_at": "2025-12-15T16:40:45.737522",
  "title": "Only racists will criticize this law",
  "date_display": "December 20, 2013",
  "date_iso": "2013-12-20T21:58:00+00:00",
  "date_from_url": "2013-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am entirely confident that anti-racist activists will be quick to cry raciss of anyone who speaks out against <a href=\"http://www.myfoxny.com/story/24270183/uganda-passes-tough-new-bill-against-homosexuality\">this African law</a>. And since it is progress, who can possible question this evidence of the way morality is evolving in Uganda.</p><blockquote class=\"tr_bq\"><p> Ugandan lawmakers on Friday passed an anti-gay bill that calls for<br> life imprisonment for certain homosexual acts, drawing criticism from<br> rights campaigners who called it “the worst in the world.” The legislations sets life imprisonment as the<br> penalty for gay sex involving an HIV-infected person, acts with minors<br> and the disabled, as well as repeated sex offenses among consenting<br> adults, according to the office of a spokeswoman for Uganda’s<br> parliament. The bill also prescribes a seven-year jail term for a person who “conducts a marriage ceremony” for same-sex couples.</br></br></br></br></br></br></p></blockquote><p>Since we are often informed that wise Africans who take a village are our moral superiors, it would be a terrible moral failure were the US Congress to fail to pass a similar law.  After all, homosexuality activity is already criminal in 70 percent of African countries.</p></div>",
  "content_text": "I am entirely confident that anti-racist activists will be quick to cry raciss of anyone who speaks out against\nthis African law\n. And since it is progress, who can possible question this evidence of the way morality is evolving in Uganda.\nUgandan lawmakers on Friday passed an anti-gay bill that calls for\nlife imprisonment for certain homosexual acts, drawing criticism from\nrights campaigners who called it “the worst in the world.” The legislations sets life imprisonment as the\npenalty for gay sex involving an HIV-infected person, acts with minors\nand the disabled, as well as repeated sex offenses among consenting\nadults, according to the office of a spokeswoman for Uganda’s\nparliament. The bill also prescribes a seven-year jail term for a person who “conducts a marriage ceremony” for same-sex couples.\nSince we are often informed that wise Africans who take a village are our moral superiors, it would be a terrible moral failure were the US Congress to fail to pass a similar law.  After all, homosexuality activity is already criminal in 70 percent of African countries.",
  "tags": [
    "law",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-20T21:58:00+00:00"
}