{
  "url": "https://voxday.net/2013/12/04/pink-sf-vs-blue-sf/",
  "scraped_at": "2025-12-15T16:38:52.247924",
  "title": "Pink SF vs Blue SF",
  "date_display": "December 4, 2013",
  "date_iso": "2013-12-04T10:59:00+00:00",
  "date_from_url": "2013-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few people have asked me what I mean by differentiating between Pink SF and Blue SF.  Pink SF is the dominant form of science fiction today. Or rather, more properly, the currently dominant form of SyFy. It is necrobestial love triangles. It is using the superficial trappings of science fiction or fantasy or war fiction to tell exactly the same sort of goopy, narcissistic female-oriented story that has already been told in ten thousand Harlequin novels and children’s tales and Hollywood comeuppance fantasies.</p><p>Pink SF primarily concerns a) choosing between two lovers, b) being true to yourself, or c) enacting ex post facto revenge upon the badthinkers and meanies who made the author feel bad about herself at school. Pink SF is about feelings rather than ideas or actions.</p><p>Pink SF is an invasion. Pink SF is a cancer. Pink SF is a parasitical perversion. Pink SF is the little death that kills every literary subgenre. And Pink SF isn’t limited to SF; there is a very good reason the Sports Guy’s meme “Women Ruin Everything” applies so perfectly to most forms of literature. The one exception is the One True Female Genre, which is the Pillow Book. Read Murasaki Shikibu or Sei Shonagon; women have been writing the same thing over and over for more than 1,000 years now and very, very few do it as well as the Lady Murasaki did. Pink SF is the girls coming to play in the boys’ sandbox and then shitting in it like cats.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://3.bp.blogspot.com/-f9rCxjcxD50/Up73vb1yf_I/AAAAAAAAAnM/TkK48Hjkviw/s1600/Pink-Blue.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"298\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/12/Pink-Blue.png\" width=\"320\"/></a></div><p>Consider the way Pink SF has now invaded even that most masculine of subgenres, War Fiction. Books 1, 3, and 5 on Amazon’s War Fiction Top 100 free list are not genuine “war fiction” any more than Pink SF is actual science fiction. It’s WereSEAL porn. It’s 50 Shades of Sexy Soldiers.</p><p>So what, in contrast, is Blue SF? Blue SF is a return to the manly adventure fiction of the past. Blue SF says “fuck that” to strong independent female protagonists who ride rainbow-farting unicorns and flex their nonexistent muscles when they aren’t being mounted by corpses and canids.  Blue SF says “fuck that” to sexual equality, salutes <i>la difference</i>, and doesn’t deign to throw bones to women who might feelbad that their oh-so-tender feelingses isn’t being gently massaged. And Blue SF says “fuck off” to every idiot of either sex who whines about it being too this or not enough that.</p><p>Blue SF does not apologize for being male, for being insufficiently inclusive, or for refusing to fall in line with the dynamic demand for character quotas concerning sex, race, religion, and sexual preferences. Unlike Pink SF, Blue SF is sufficiently confident to be what it is rather than deceptively market itself as what it manifestly is not. Can you even imagine genuine science fiction trying to sneak into the romance market and pretending that it’s all proper romance when actually there is little more than action and technology and ideas under a very thin and superficial veil of romantic intrigue and self-centered drama?</p><p>At the Baen Bar, a retired airborne infantry master sergeant left a comment about <a href=\"http://www.amazon.com/dp/B00H0338RC\"><b><i>QUANTUM MORTIS: A Man Disrupted</i></b></a> that perhaps is not irrelevant in this regard: <i>“I read it and enjoyed it greatly. Baen might want to talk to the authors because they would fit right in. These guys like guns and prefer big guns. Guns that leave big body counts and lots of wreckage. They like hand-carried particle beams, lasers, slug throwers and vehicle-mounted missiles, cannons and chain guns. MCID would fit right in with Monster Hunters International only with better weapons. But the attitude is there. The simple arrest in the park is an all-time classic. I’ll buy the sequels.”</i></p><p>That’s right. Quantum Mortis <i>actually outgunned Larry Correia</i>. And that, in a nutshell, is what Blue SF is all about. Masculine ideas. Masculine challenges. Masculine action. Masculine energy. And, of course, masculine competition.</p><p>Pink SF, on the other hand, is the female equivalent of writing <i>Pride and Prejudice and Zombies</i> and somehow failing to realize that it is a parody.</p></div>",
  "content_text": "A few people have asked me what I mean by differentiating between Pink SF and Blue SF.  Pink SF is the dominant form of science fiction today. Or rather, more properly, the currently dominant form of SyFy. It is necrobestial love triangles. It is using the superficial trappings of science fiction or fantasy or war fiction to tell exactly the same sort of goopy, narcissistic female-oriented story that has already been told in ten thousand Harlequin novels and children’s tales and Hollywood comeuppance fantasies.\nPink SF primarily concerns a) choosing between two lovers, b) being true to yourself, or c) enacting ex post facto revenge upon the badthinkers and meanies who made the author feel bad about herself at school. Pink SF is about feelings rather than ideas or actions.\nPink SF is an invasion. Pink SF is a cancer. Pink SF is a parasitical perversion. Pink SF is the little death that kills every literary subgenre. And Pink SF isn’t limited to SF; there is a very good reason the Sports Guy’s meme “Women Ruin Everything” applies so perfectly to most forms of literature. The one exception is the One True Female Genre, which is the Pillow Book. Read Murasaki Shikibu or Sei Shonagon; women have been writing the same thing over and over for more than 1,000 years now and very, very few do it as well as the Lady Murasaki did. Pink SF is the girls coming to play in the boys’ sandbox and then shitting in it like cats.\nConsider the way Pink SF has now invaded even that most masculine of subgenres, War Fiction. Books 1, 3, and 5 on Amazon’s War Fiction Top 100 free list are not genuine “war fiction” any more than Pink SF is actual science fiction. It’s WereSEAL porn. It’s 50 Shades of Sexy Soldiers.\nSo what, in contrast, is Blue SF? Blue SF is a return to the manly adventure fiction of the past. Blue SF says “fuck that” to strong independent female protagonists who ride rainbow-farting unicorns and flex their nonexistent muscles when they aren’t being mounted by corpses and canids.  Blue SF says “fuck that” to sexual equality, salutes\nla difference\n, and doesn’t deign to throw bones to women who might feelbad that their oh-so-tender feelingses isn’t being gently massaged. And Blue SF says “fuck off” to every idiot of either sex who whines about it being too this or not enough that.\nBlue SF does not apologize for being male, for being insufficiently inclusive, or for refusing to fall in line with the dynamic demand for character quotas concerning sex, race, religion, and sexual preferences. Unlike Pink SF, Blue SF is sufficiently confident to be what it is rather than deceptively market itself as what it manifestly is not. Can you even imagine genuine science fiction trying to sneak into the romance market and pretending that it’s all proper romance when actually there is little more than action and technology and ideas under a very thin and superficial veil of romantic intrigue and self-centered drama?\nAt the Baen Bar, a retired airborne infantry master sergeant left a comment about\nQUANTUM MORTIS: A Man Disrupted\nthat perhaps is not irrelevant in this regard:\n“I read it and enjoyed it greatly. Baen might want to talk to the authors because they would fit right in. These guys like guns and prefer big guns. Guns that leave big body counts and lots of wreckage. They like hand-carried particle beams, lasers, slug throwers and vehicle-mounted missiles, cannons and chain guns. MCID would fit right in with Monster Hunters International only with better weapons. But the attitude is there. The simple arrest in the park is an all-time classic. I’ll buy the sequels.”\nThat’s right. Quantum Mortis\nactually outgunned Larry Correia\n. And that, in a nutshell, is what Blue SF is all about. Masculine ideas. Masculine challenges. Masculine action. Masculine energy. And, of course, masculine competition.\nPink SF, on the other hand, is the female equivalent of writing\nPride and Prejudice and Zombies\nand somehow failing to realize that it is a parody.",
  "tags": [
    "Quantum Mortis",
    "SFWA",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-04T10:59:00+00:00"
}