{
  "url": "https://voxday.net/2013/12/01/pj-orourke-on-baby-boomers/",
  "scraped_at": "2025-12-15T16:38:32.693363",
  "title": "PJ O’Rourke on the Baby Boomers",
  "date_display": "December 1, 2013",
  "date_iso": "2013-12-01T14:00:00+00:00",
  "date_from_url": "2013-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here is one Baby Boomer who appears to be willing to cop to being a member of the worst generation ever, but as is his generation’s wont, <a href=\"http://online.wsj.com/news/articles/SB10001424052702304011304579220174176053820\">he ends up trying to spin the facts</a> on his generation’s behalf:</p><blockquote class=\"tr_bq\"><p> We’ve reached the age of accountability. The world is our fault. We<br> are the generation that has an excuse for everything—one of our greatest<br> contributions to modern life—but the world is still our fault.</br></br></p><p>This<br> is every generation’s fate. It’s a matter of power and privilege and<br> demography. Whenever anything happens anywhere, somebody over 50 signs<br> the bill for it. And the baby boom, seated as we are at the head of<br> life’s table, is hearing Generation X, Generation Y and the Millennials<br> all saying, “Check, please!”</br></br></br></br></br></p><p> To address America’s baby boom is to<br> face big, broad problems. We number more than 75 million, and we’re not<br> only diverse but take a thorny pride in our every deviation from the<br> norm (even though we’re in therapy for it). We are all alike in that<br> each of us thinks we’re unusual.</br></br></br></br></p></blockquote><p>Now, before Ryan launches in with his usual generational public defender routine, I readily admit that every member of a generation is not identical or even in step with the generational norm. But we are talking about <i>a collective</i> here! And more importantly, we are talking about <i>a proudly self-identified collective</i> here. So to bring up individuals in this context is not merely moot, it is a basic category error.</p><p>They claim they changed the world. We agree. We merely observe that they changed it for the worse.</p><p>Some Baby Boomers try to smugly point out that Generation X is also responsible because we have not fixed the problems they caused. They tend to ignore the fact that they are actively standing in the way of any and all attempts to do so. I was correct about the 2008 financial crisis and correct about the failure of the Federal Reserve and the Congress to successfully fix the situation. Did the Fed turn to me or any other GenX economist who correctly observed these things?</p><p>No, they appointed yet another Baby Boomer, one who will step up the intensity of the failed policies of the previous Baby Boomer. So what more can I, or any other member of Generation X, now do except point, laugh, and look forward to the day when we can shut off the generational parasite’s life-support machines.</p></div>",
  "content_text": "Here is one Baby Boomer who appears to be willing to cop to being a member of the worst generation ever, but as is his generation’s wont,\nhe ends up trying to spin the facts\non his generation’s behalf:\nWe’ve reached the age of accountability. The world is our fault. We\nare the generation that has an excuse for everything—one of our greatest\ncontributions to modern life—but the world is still our fault.\nThis\nis every generation’s fate. It’s a matter of power and privilege and\ndemography. Whenever anything happens anywhere, somebody over 50 signs\nthe bill for it. And the baby boom, seated as we are at the head of\nlife’s table, is hearing Generation X, Generation Y and the Millennials\nall saying, “Check, please!”\nTo address America’s baby boom is to\nface big, broad problems. We number more than 75 million, and we’re not\nonly diverse but take a thorny pride in our every deviation from the\nnorm (even though we’re in therapy for it). We are all alike in that\neach of us thinks we’re unusual.\nNow, before Ryan launches in with his usual generational public defender routine, I readily admit that every member of a generation is not identical or even in step with the generational norm. But we are talking about\na collective\nhere! And more importantly, we are talking about\na proudly self-identified collective\nhere. So to bring up individuals in this context is not merely moot, it is a basic category error.\nThey claim they changed the world. We agree. We merely observe that they changed it for the worse.\nSome Baby Boomers try to smugly point out that Generation X is also responsible because we have not fixed the problems they caused. They tend to ignore the fact that they are actively standing in the way of any and all attempts to do so. I was correct about the 2008 financial crisis and correct about the failure of the Federal Reserve and the Congress to successfully fix the situation. Did the Fed turn to me or any other GenX economist who correctly observed these things?\nNo, they appointed yet another Baby Boomer, one who will step up the intensity of the failed policies of the previous Baby Boomer. So what more can I, or any other member of Generation X, now do except point, laugh, and look forward to the day when we can shut off the generational parasite’s life-support machines.",
  "tags": [
    "society",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-01T14:00:00+00:00"
}