{
  "url": "https://voxday.net/2013/12/29/pretending-to-teach-pretending-to-learn/",
  "scraped_at": "2025-12-15T16:41:31.924434",
  "title": "Pretending to teach, pretending to learn",
  "date_display": "December 29, 2013",
  "date_iso": "2013-12-29T14:00:00+00:00",
  "date_from_url": "2013-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jerry Pournelle reflects on <a href=\"http://www.jerrypournelle.com/chaosmanor/credentials-and-a-few-words-for-junior-officers/\">the failure of the California State College system</a>:</p><blockquote class=\"tr_bq\"><p> Back about 1970 I was involved with the Council that was to draw up<br> the Master Plan for the University of California system. The program was<br> very structured: the University System would have a limited number of<br> campuses, and would do all the graduate school education. There would be<br> a limited number of undergraduates at each of those campuses, and they<br> would be the elite applicants. Tuition would be low for state residents,<br> and very high for out of state and foreign students. This would be the<br> University system, and it would be for the best and the brightest.<br> Salaries would be high for an elite faculty.</br></br></br></br></br></br></br></br></p><p>In addition, there would be the California State Colleges, which<br> would not be permitted to award graduate degrees. They would do<br> undergraduate education, and send their best and brightest to compete<br> for places in the University system graduate schools. Their primary<br> purpose was teaching, and it was on their ability to teach that faculty<br> members would be chosen and retained: no publish or perish, because<br> their purpose was to teach, not to do “research”. They were not to<br> discover knowledge, but to convey it to most of the undergraduates in<br> the state. A small number would go to the University undergraduate<br> system, but about 90% of all undergraduates enrolled in state higher<br> education would be in the California State Colleges. This would include<br> colleges of education and teacher. Again the focus would not be on<br> ‘research’ or anything else other than producing great teachers for the<br> California schools.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Of course as soon as the Master Plan was adopted and funded, the<br> California State Colleges began a political campaign to be turned into<br> universities, with salaries comparable to the Universities, and graduate<br> schools with research, and publish or perish, and all the rest of it;<br> and instead of being teaching institutions they would become second rate<br> copies of the Universities, with a faculty neglecting teaching in order<br> to gather prestige in research and publication, or, perhaps, at least<br> to look as if they were. In any event the California State Colleges<br> became California State Universities, their commitment to actual<br> undergraduate education was tempered to make room for the graduate<br> schools, budgets were higher, costs were higher, and tuition, which had<br> been designed to be very low, began to climb.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Everyone always wants elite status without being required to provide elite performance or assume elite responsibility. Unless your system specifically accounts for and prepares for the inevitable push to degrade status, it is doomed to fall in precisely the same way the California State College system did.</p><p>The irony, of course, is that by democratizing the elite status, it is destroyed. That is why university degrees, and increasingly, advanced degrees, are literally worthless these days. Once everyone has the credential, it ceases to mean anything anymore.</p></div>",
  "content_text": "Jerry Pournelle reflects on\nthe failure of the California State College system\n:\nBack about 1970 I was involved with the Council that was to draw up\nthe Master Plan for the University of California system. The program was\nvery structured: the University System would have a limited number of\ncampuses, and would do all the graduate school education. There would be\na limited number of undergraduates at each of those campuses, and they\nwould be the elite applicants. Tuition would be low for state residents,\nand very high for out of state and foreign students. This would be the\nUniversity system, and it would be for the best and the brightest.\nSalaries would be high for an elite faculty.\nIn addition, there would be the California State Colleges, which\nwould not be permitted to award graduate degrees. They would do\nundergraduate education, and send their best and brightest to compete\nfor places in the University system graduate schools. Their primary\npurpose was teaching, and it was on their ability to teach that faculty\nmembers would be chosen and retained: no publish or perish, because\ntheir purpose was to teach, not to do “research”. They were not to\ndiscover knowledge, but to convey it to most of the undergraduates in\nthe state. A small number would go to the University undergraduate\nsystem, but about 90% of all undergraduates enrolled in state higher\neducation would be in the California State Colleges. This would include\ncolleges of education and teacher. Again the focus would not be on\n‘research’ or anything else other than producing great teachers for the\nCalifornia schools.\nOf course as soon as the Master Plan was adopted and funded, the\nCalifornia State Colleges began a political campaign to be turned into\nuniversities, with salaries comparable to the Universities, and graduate\nschools with research, and publish or perish, and all the rest of it;\nand instead of being teaching institutions they would become second rate\ncopies of the Universities, with a faculty neglecting teaching in order\nto gather prestige in research and publication, or, perhaps, at least\nto look as if they were. In any event the California State Colleges\nbecame California State Universities, their commitment to actual\nundergraduate education was tempered to make room for the graduate\nschools, budgets were higher, costs were higher, and tuition, which had\nbeen designed to be very low, began to climb.\nEveryone always wants elite status without being required to provide elite performance or assume elite responsibility. Unless your system specifically accounts for and prepares for the inevitable push to degrade status, it is doomed to fall in precisely the same way the California State College system did.\nThe irony, of course, is that by democratizing the elite status, it is destroyed. That is why university degrees, and increasingly, advanced degrees, are literally worthless these days. Once everyone has the credential, it ceases to mean anything anymore.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-29T14:00:00+00:00"
}