{
  "url": "https://voxday.net/2013/12/13/quantum-mortis-un-hombre-disperso/",
  "scraped_at": "2025-12-15T16:39:57.213917",
  "title": "QUANTUM MORTIS: Un Hombre Disperso",
  "date_display": "December 13, 2013",
  "date_iso": "2013-12-13T18:00:00+00:00",
  "date_from_url": "2013-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>EG is rolling on the Spanish version and is already into chapter three. This is how Capitulo Uno kicks off.</p><blockquote class=\"tr_bq\"><p> <i>Rhysalan fue terraformado y colonizado en el año 2810, pronto se transformo en un planeta importante del subsector Kantillon en la periferia de el Gran Ascendencia de Terra. Debido a su ubicación estratégica, el planeta era blanco para los intereses militares y cambio de manos varias veces hasta que se estableció como un planeta independiente en el año 2935 bajo el Almirante de Flota Beze Davenant de la Flota Vigésimo Primera de La Ascendencia de Terra, que se convertiría en el primer Duque de Rhysalan. Después de la Rebelión de las Dioses Maquinas de 2999 que resulto en La Unidad, Rhysalan se convirtió en el destinatario principal de los gobiernos planetarios y nacionales. Dándose cuenta de que un extendido conflicto interplanetaria ofrecía un sin fin de refugiados acaudalados, el Cuarto Duque fue el primero en institor la práctica de Proveer Santuario formal.</i><br> -De “Una Breve Historia de los Duques de Rhysalan” Por Thucidean Marcel.</br></p><p>Cuando recibió la llamada Graven Tower estaba en un rutinario patrullaje por la pista aérea 775, Casi mil metros sobre Trans Paradis.</p><p>“Tower, tenemos un reporte de un presunto homicidio en la balaustrada norte Uno Nueve Ocho Tres Ocho Diez” Una voz susurro sensualmente en su oreja izquierda. Sonaba sensual, aunque el susurro no era real. Tower estaba solo en el Aerovar, con solo su aumento y la música proviniendo de las bocinas a bordo de compañía.</p><p>“Gracias, Nena. Sabes ?quien, que o por qué?” Tower no era un policía civil, y los homicidio no eran parte de su jurisdicción a menos que se cometieran en la base, fueran cometidos por personal militar, o por uno de las decenas de miles de xenos (alienígenas) cuya residencia era supervisada por las Fuerzas Armadas del Ducado Imperial de Rhysalan.</p></blockquote><p>I’m still in the market for more translators, so if you’re a native speaker of anything besides than English, please get in touch. If you’re less interested in the fiction, I’m also looking to get TIA translated; a French version is presently in the works. In the meantime, the English reviews continue to be positive. In <a href=\"http://www.amazon.com/review/R3F5RU8Y88WIWA/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00H0338RC&amp;linkCode=&amp;nodeID=&amp;tag=\">his Amazon review of QUANTUM MORTIS: A Man Disrupted</a>, Richmond noted:</p><p><i>“The universe building is intelligent and realistic, the economics of<br> Rhysalan and the various Others is interesting as a thing in and of<br> itself.  Most sci-fi (and fantasy) I’ve read has boring as all hell<br> political and economic structures written into it since a lot of authors<br> seem to be more interested in their own commentary on social issues<br> rather than how nations and markets operate in reality.  Vox Day (and I<br> shouldn’t leave out Steve, but I’m more familiar with VD) is very good<br> at describing a clear and functional civilization one can imagine coming<br> into existence.  The separation of tech levels between societies, the<br> acknowledgement of xenophobia, the economic motives of good guys and bad<br> guys, and the recognition of religion and morality, and an accurate<br> storytelling of interpersonal relationships is all excellent and well<br> thought out.” </br></br></br></br></br></br></br></br></br></br></br></br></i></p><p>Anyhow, I rather like the Spanish title.  It would be hard to deny that Graven Tower is one tough hombre. And since we’re talking about translations, here’s a trivia question: to what foreign author does the title of the first Quantum Mortis novel owe inspiration for its name?</p><p>UPDATE: A review from someone who is obviously a poser, a fake, a fraud, a false pretender. Albeit one with unquestionable taste in mystery novels.</p><p><i>“I’m a gun-nut, and generally appreciate “gun porn” in fiction when<br> it’s done correctly (references to safeties on revolvers, or thumbing<br> the hammer back on a Glock grate on me), but I have to say that the<br> detailed descriptions – including manufacturer and part number – of<br> future weapons got to be a bit tedious. As a murder mystery, though, this one was pretty good.” </br></br></br></br></i></p><p>You, sir, are NO TRUE GUN PORN AFICIONADO.<i> </i></p></div>",
  "content_text": "EG is rolling on the Spanish version and is already into chapter three. This is how Capitulo Uno kicks off.\nRhysalan fue terraformado y colonizado en el año 2810, pronto se transformo en un planeta importante del subsector Kantillon en la periferia de el Gran Ascendencia de Terra. Debido a su ubicación estratégica, el planeta era blanco para los intereses militares y cambio de manos varias veces hasta que se estableció como un planeta independiente en el año 2935 bajo el Almirante de Flota Beze Davenant de la Flota Vigésimo Primera de La Ascendencia de Terra, que se convertiría en el primer Duque de Rhysalan. Después de la Rebelión de las Dioses Maquinas de 2999 que resulto en La Unidad, Rhysalan se convirtió en el destinatario principal de los gobiernos planetarios y nacionales. Dándose cuenta de que un extendido conflicto interplanetaria ofrecía un sin fin de refugiados acaudalados, el Cuarto Duque fue el primero en institor la práctica de Proveer Santuario formal.\n-De “Una Breve Historia de los Duques de Rhysalan” Por Thucidean Marcel.\nCuando recibió la llamada Graven Tower estaba en un rutinario patrullaje por la pista aérea 775, Casi mil metros sobre Trans Paradis.\n“Tower, tenemos un reporte de un presunto homicidio en la balaustrada norte Uno Nueve Ocho Tres Ocho Diez” Una voz susurro sensualmente en su oreja izquierda. Sonaba sensual, aunque el susurro no era real. Tower estaba solo en el Aerovar, con solo su aumento y la música proviniendo de las bocinas a bordo de compañía.\n“Gracias, Nena. Sabes ?quien, que o por qué?” Tower no era un policía civil, y los homicidio no eran parte de su jurisdicción a menos que se cometieran en la base, fueran cometidos por personal militar, o por uno de las decenas de miles de xenos (alienígenas) cuya residencia era supervisada por las Fuerzas Armadas del Ducado Imperial de Rhysalan.\nI’m still in the market for more translators, so if you’re a native speaker of anything besides than English, please get in touch. If you’re less interested in the fiction, I’m also looking to get TIA translated; a French version is presently in the works. In the meantime, the English reviews continue to be positive. In\nhis Amazon review of QUANTUM MORTIS: A Man Disrupted\n, Richmond noted:\n“The universe building is intelligent and realistic, the economics of\nRhysalan and the various Others is interesting as a thing in and of\nitself.  Most sci-fi (and fantasy) I’ve read has boring as all hell\npolitical and economic structures written into it since a lot of authors\nseem to be more interested in their own commentary on social issues\nrather than how nations and markets operate in reality.  Vox Day (and I\nshouldn’t leave out Steve, but I’m more familiar with VD) is very good\nat describing a clear and functional civilization one can imagine coming\ninto existence.  The separation of tech levels between societies, the\nacknowledgement of xenophobia, the economic motives of good guys and bad\nguys, and the recognition of religion and morality, and an accurate\nstorytelling of interpersonal relationships is all excellent and well\nthought out.”\nAnyhow, I rather like the Spanish title.  It would be hard to deny that Graven Tower is one tough hombre. And since we’re talking about translations, here’s a trivia question: to what foreign author does the title of the first Quantum Mortis novel owe inspiration for its name?\nUPDATE: A review from someone who is obviously a poser, a fake, a fraud, a false pretender. Albeit one with unquestionable taste in mystery novels.\n“I’m a gun-nut, and generally appreciate “gun porn” in fiction when\nit’s done correctly (references to safeties on revolvers, or thumbing\nthe hammer back on a Glock grate on me), but I have to say that the\ndetailed descriptions – including manufacturer and part number – of\nfuture weapons got to be a bit tedious. As a murder mystery, though, this one was pretty good.”\nYou, sir, are NO TRUE GUN PORN AFICIONADO.",
  "tags": [
    "Quantum Mortis"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-13T18:00:00+00:00"
}