{
  "url": "https://voxday.net/2013/12/11/race-crime-and-r/",
  "scraped_at": "2025-12-15T16:39:42.227210",
  "title": "Race, crime, and (r)",
  "date_display": "December 11, 2013",
  "date_iso": "2013-12-11T14:00:00+00:00",
  "date_from_url": "2013-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Explorable:</p><p><i>Statistical correlation is measured by what is called coefficient of correlation (r). Its numerical value ranges from +1.0 to -1.0. It gives us an indication of the strength of relationship.</i><br> <i><br/></i><br> <i>In general, r &gt; 0 indicates positive relationship, r &lt; 0<br> indicates negative relationship while r = 0 indicates no relationship<br> (or that the variables are independent and not related). Here r = +1.0<br> describes a perfect positive correlation and r = -1.0 describes a<br> perfect negative correlation.</br></br></br></br></i><br> <i>Closer the coefficients are to +1.0 and -1.0, greater is the strength of the relationship between the variables.</i><br> <i><br/></i><br> <i>As a rule of thumb, the following guidelines on strength of<br> relationship are often useful (though many experts would somewhat<br> disagree on the choice of boundaries).</br></br></i></br></br></br></br></br></p><table border=\"1\" cellpadding=\"3\" cellspacing=\"0\" id=\"table-figure\"><tbody><tr bgcolor=\"#CCCCCC\"><th>Value of r</th><th>Strength of relationship</th></tr><tr><td>-1.0 to -0.5 or 1.0 to 0.5</td><td>Strong</td></tr><tr><td>-0.5 to -0.3 or 0.3 to 0.5</td><td>Moderate</td></tr><tr><td>-0.3 to -0.1 or 0.1 to 0.3</td><td>Weak</td></tr><tr><td>-0.1 to 0.1</td><td>None or very weak</td></tr></tbody></table><p> From Ron Unz:</p><blockquote class=\"tr_bq\"><p> [O]ver the last twenty-five years the weighted correlations for each of<br> the crime categories against the percentages of whites, Hispanics, and<br> “immigrants” (i.e. Hispanics-plus-Asians) have fluctuated in the general<br> range of -0.20 to -0.60.  Interestingly enough, for most of the last<br> decade the presence of Hispanics and immigrants has become noticeably<br> less associated with crime than the presence of whites, although that<br> latter category obviously exhibits large regional heterogeneity.<br> Meanwhile, in the case of blacks, the weighted crime correlations have<br> steadily risen from 0.60 to around 0.80 or above, almost always now<br> falling within between 0.75 and 0.85.</br></br></br></br></br></br></br></br></br></p></blockquote><p>That’s not the interesting part, however. At this point, only a complete idiot or the willfully blind will deny the relative African predilection for crime. What is interesting is his conclusions regarding how the supposedly anti-racist liberals are addressing this very strong correlation and how immigration factors into it:</p><blockquote class=\"tr_bq\"><p> America’s ruling financial, media, and political elites are largely<br> concentrated in three major urban centers—New York City, Los Angeles,<br> and Washington, D.C.—and all three have contained large black<br> populations, including a violent underclass.  During the early 1990s,<br> many observers feared New York City was headed for urban collapse due to<br> its enormously high crime rates, Los Angeles experienced the massive<br> and deadly Rodney King Riots, and Washington often vied for the title of<br> American homicide capital.  In each city, the violence and crime were<br> overwhelmingly committed by black males, and although white elites were<br> rarely the victims, their fears were quite palpable.</br></br></br></br></br></br></br></br></br></p><p>One obvious reaction to these concerns was strong political support<br> for a massive national crackdown on crime, and the prison incarceration<br> of black men increased by almost 500% during the two decades after 1980.<br> But even after such enormous rates of imprisonment, official FBI<br> statistics indicate that blacks today are still over 600% as likely to<br> commit homicide than non-blacks and their robbery rate is over 700%<br> larger; these disparities seem just as high with respect to Hispanic or<br> Asian immigrants as they are for whites.  Thus, replacing a city’s<br> blacks with immigrants would tend to lower local crime rates by as much<br> as 90%, and during the 1990s American elites may have become<br> increasingly aware of this important fact, together with the obvious<br> implications for their quality of urban life and housing values.</br></br></br></br></br></br></br></br></br></br></br></p><p>According to Census data, between 1990 and 2010 the number of<br> Hispanics and Asians increased by one-third in Los Angeles, by nearly<br> 50% in New York City, and by over 70% in Washington, D.C.  The<br> inevitable result was to squeeze out much of the local black population,<br> which declined, often substantially, in each location.  And all three<br> cities experienced enormous drops in local crime, with homicide rates<br> falling by 73%, 79%, and 72% respectively, perhaps partly as a result of<br> these underlying demographic changes.  Meanwhile, the white population<br> increasingly shifted toward the affluent, who were best able to afford<br> the sharp rise in housing prices.  It is an undeniable fact that<br> American elites, conservative and liberal alike, are today almost<br> universally in favor of very high levels of immigration, and their<br> possible recognition of the direct demographic impact upon their own<br> urban circumstances may be an important but unspoken factor in shaping<br> their views.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>As an anecdotal example, consider the case of Matthew Yglesias, a<br> prominent young liberal blogger living in Washington, DC.  A couple of<br> years ago <a href=\"http://thinkprogress.org/yglesias/2011/05/14/200983/an-evening-on-the-beltway-yuengling-and-minor-assault-circuit/\">he recounted on his blogsite</a><br> how he was suddenly attacked from behind and seriously beaten by two<br> young men while walking home one evening from a dinner party.  At first<br> he was quite cagey about identifying his attackers, but he eventually<br> admitted they were blacks, possibly engaged in the growing racial<br> practice of urban “polar bear hunting” so widely publicized by the<br> Drudge Report and other rightwing websites.</br></br></br></br></br></br></br></br></p><p>Few matters are more likely to trouble the minds of our<br> Harvard-educated intellectual elite than fear of suffering random<br/> violent assaults while they walk the streets of their own city.  Yet no<br/> respectable progressive would possibly focus on the racial character of<br/> such an attack, let alone advocate the removal of local blacks as a<br/> precautionary measure.  Instead Yglesias suggested that housing-density<br/> issues might have been responsible and that better urban planning would<br/> reduce crime.</br></p><p>But consider that support for very high levels of foreign immigration<br/> is an impeccably liberal cause, and such policies inevitably displace<br/> and remove huge numbers of urban blacks; it is easy to imagine that<br/> Yglesias quietly redoubled his pro-immigration zeal in the wake of the<br/> incident.  Multiply this personal example a thousand-fold, and perhaps<br/> an important strand of the tremendous pro-immigration ideological<br/> framework of American elites becomes apparent.  The more<br/> conspiratorially-minded racialists, bitterly hostile to immigration,<br/> sometimes speculate that there is a diabolical plot by our ruling power<br/> structure to “race-replace” America’s traditional white population.<br/> Perhaps a hidden motive along these lines does indeed help explain some<br/> support for heavy immigration, but I suspect that the race being<br/> targeted for replacement is not the white one.</p></blockquote><p>Indeed. One might reach the same conclusion when looking closely at the consequences of liberal policies on welfare and abortion. Never look at the selling points, look at the consequences. If the course is not subsequently changed in light of a divergence between the two, it is safe to assume that the consequences were planned from the start.</p><p>Remember, extrapolating current trends to predict the future is reliably a failure. In 1900, it was widely believed that the black race was inevitably headed for extinction. 100 years later, it looks like the whites are on the way out. But it’s not hard to imagine ethnic cleansing in Europe combined with ethnic strife in the Americas and ruthless Chinese colonization in Africa leading to the revival of concerns for the black race in 2100.</p></div>",
  "content_text": "From Explorable:\nStatistical correlation is measured by what is called coefficient of correlation (r). Its numerical value ranges from +1.0 to -1.0. It gives us an indication of the strength of relationship.\nIn general, r > 0 indicates positive relationship, r < 0\nindicates negative relationship while r = 0 indicates no relationship\n(or that the variables are independent and not related). Here r = +1.0\ndescribes a perfect positive correlation and r = -1.0 describes a\nperfect negative correlation.\nCloser the coefficients are to +1.0 and -1.0, greater is the strength of the relationship between the variables.\nAs a rule of thumb, the following guidelines on strength of\nrelationship are often useful (though many experts would somewhat\ndisagree on the choice of boundaries).\nValue of r\nStrength of relationship\n-1.0 to -0.5 or 1.0 to 0.5\nStrong\n-0.5 to -0.3 or 0.3 to 0.5\nModerate\n-0.3 to -0.1 or 0.1 to 0.3\nWeak\n-0.1 to 0.1\nNone or very weak\nFrom Ron Unz:\n[O]ver the last twenty-five years the weighted correlations for each of\nthe crime categories against the percentages of whites, Hispanics, and\n“immigrants” (i.e. Hispanics-plus-Asians) have fluctuated in the general\nrange of -0.20 to -0.60.  Interestingly enough, for most of the last\ndecade the presence of Hispanics and immigrants has become noticeably\nless associated with crime than the presence of whites, although that\nlatter category obviously exhibits large regional heterogeneity.\nMeanwhile, in the case of blacks, the weighted crime correlations have\nsteadily risen from 0.60 to around 0.80 or above, almost always now\nfalling within between 0.75 and 0.85.\nThat’s not the interesting part, however. At this point, only a complete idiot or the willfully blind will deny the relative African predilection for crime. What is interesting is his conclusions regarding how the supposedly anti-racist liberals are addressing this very strong correlation and how immigration factors into it:\nAmerica’s ruling financial, media, and political elites are largely\nconcentrated in three major urban centers—New York City, Los Angeles,\nand Washington, D.C.—and all three have contained large black\npopulations, including a violent underclass.  During the early 1990s,\nmany observers feared New York City was headed for urban collapse due to\nits enormously high crime rates, Los Angeles experienced the massive\nand deadly Rodney King Riots, and Washington often vied for the title of\nAmerican homicide capital.  In each city, the violence and crime were\noverwhelmingly committed by black males, and although white elites were\nrarely the victims, their fears were quite palpable.\nOne obvious reaction to these concerns was strong political support\nfor a massive national crackdown on crime, and the prison incarceration\nof black men increased by almost 500% during the two decades after 1980.\nBut even after such enormous rates of imprisonment, official FBI\nstatistics indicate that blacks today are still over 600% as likely to\ncommit homicide than non-blacks and their robbery rate is over 700%\nlarger; these disparities seem just as high with respect to Hispanic or\nAsian immigrants as they are for whites.  Thus, replacing a city’s\nblacks with immigrants would tend to lower local crime rates by as much\nas 90%, and during the 1990s American elites may have become\nincreasingly aware of this important fact, together with the obvious\nimplications for their quality of urban life and housing values.\nAccording to Census data, between 1990 and 2010 the number of\nHispanics and Asians increased by one-third in Los Angeles, by nearly\n50% in New York City, and by over 70% in Washington, D.C.  The\ninevitable result was to squeeze out much of the local black population,\nwhich declined, often substantially, in each location.  And all three\ncities experienced enormous drops in local crime, with homicide rates\nfalling by 73%, 79%, and 72% respectively, perhaps partly as a result of\nthese underlying demographic changes.  Meanwhile, the white population\nincreasingly shifted toward the affluent, who were best able to afford\nthe sharp rise in housing prices.  It is an undeniable fact that\nAmerican elites, conservative and liberal alike, are today almost\nuniversally in favor of very high levels of immigration, and their\npossible recognition of the direct demographic impact upon their own\nurban circumstances may be an important but unspoken factor in shaping\ntheir views.\nAs an anecdotal example, consider the case of Matthew Yglesias, a\nprominent young liberal blogger living in Washington, DC.  A couple of\nyears ago\nhe recounted on his blogsite\nhow he was suddenly attacked from behind and seriously beaten by two\nyoung men while walking home one evening from a dinner party.  At first\nhe was quite cagey about identifying his attackers, but he eventually\nadmitted they were blacks, possibly engaged in the growing racial\npractice of urban “polar bear hunting” so widely publicized by the\nDrudge Report and other rightwing websites.\nFew matters are more likely to trouble the minds of our\nHarvard-educated intellectual elite than fear of suffering random\nviolent assaults while they walk the streets of their own city.  Yet no\nrespectable progressive would possibly focus on the racial character of\nsuch an attack, let alone advocate the removal of local blacks as a\nprecautionary measure.  Instead Yglesias suggested that housing-density\nissues might have been responsible and that better urban planning would\nreduce crime.\nBut consider that support for very high levels of foreign immigration\nis an impeccably liberal cause, and such policies inevitably displace\nand remove huge numbers of urban blacks; it is easy to imagine that\nYglesias quietly redoubled his pro-immigration zeal in the wake of the\nincident.  Multiply this personal example a thousand-fold, and perhaps\nan important strand of the tremendous pro-immigration ideological\nframework of American elites becomes apparent.  The more\nconspiratorially-minded racialists, bitterly hostile to immigration,\nsometimes speculate that there is a diabolical plot by our ruling power\nstructure to “race-replace” America’s traditional white population.\nPerhaps a hidden motive along these lines does indeed help explain some\nsupport for heavy immigration, but I suspect that the race being\ntargeted for replacement is not the white one.\nIndeed. One might reach the same conclusion when looking closely at the consequences of liberal policies on welfare and abortion. Never look at the selling points, look at the consequences. If the course is not subsequently changed in light of a divergence between the two, it is safe to assume that the consequences were planned from the start.\nRemember, extrapolating current trends to predict the future is reliably a failure. In 1900, it was widely believed that the black race was inevitably headed for extinction. 100 years later, it looks like the whites are on the way out. But it’s not hard to imagine ethnic cleansing in Europe combined with ethnic strife in the Americas and ruthless Chinese colonization in Africa leading to the revival of concerns for the black race in 2100.",
  "tags": [
    "immigration",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-11T14:00:00+00:00"
}