{
  "url": "https://voxday.net/2013/12/03/retreat-and-revolution_3/",
  "scraped_at": "2025-12-15T16:38:48.930729",
  "title": "Retreat and revolution",
  "date_display": "December 3, 2013",
  "date_iso": "2013-12-03T18:00:00+00:00",
  "date_from_url": "2013-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The head of CNN finally tires of being repeatedly prison-raped in the ratings every night by Fox News and <a href=\"http://www.capitalnewyork.com/article/media/2013/12/8536789/zucker-plans-massive-change-cnn\">throws in the towel</a>:</p><blockquote class=\"tr_bq\"><p> After<br> almost a year of tinkering, CNN Worldwide President Jeff Zucker has<br> concluded that a news channel cannot subsist on news alone. So<br> he is planning much broader changes for the network—including a<br> prime-time shakeup that’s likely to make CNN traditionalists cringe.</br></br></br></br></p><p>Once,<br> CNN’s vanilla coverage was a point of pride. Now, the boss boasts about<br> the ratings for his unscripted series, and documentaries like the Sea<br> World-slamming film Blackfish. Zucker, in his first one-on-one interview<br> since taking control of CNN last January, told Capital he wants news<br> coverage “that is just not being so obvious.”</br></br></br></br></br></p><p>Instead,<br> he wants more of “an attitude and a take”: “We’re all regurgitating the<br> same information. I want people to say, ‘You know what? That was<br> interesting. I hadn’t thought of that,’” Zucker said. “The goal for the<br> next six months, is that we need more shows and less newscasts.”</br></br></br></br></p><p>Zucker—“rhymes<br> with hooker,” he likes to say—also expanded on comments he has made<br> about breaking CNN out of a mindset created by historic rivalries with<br> MSNBC and Fox. He wants the network to attract “viewers who are watching<br> places like Discovery and History and Nat Geo and A&amp;E.”</br></br></br></br></p><p>“People<br> who traditionally just watch the cable news networks [are] a great<br> audience,” he said. “I’m not trying to alienate that audience. But the<br> overall cable news audience has not grown in the last 12 years, OK? So,<br> all we’re doing is trading [audience] share. … We also want to broaden<br> what people can expect from CNN.”</br></br></br></br></br></p><p>The 48-year-old<br> Zucker initially faced internal resistance to his experiments beyond the<br> realm of hard news, but he now has an irrefutable retort: The No. 1<br> show on CNN is now “Anthony Bourdain: Parts Unknown,” a travel-adventure<br> show featuring the bad-boy celebrity chef. Zucker said that inside CNN,<br> his formula has finally been accepted “because people have seen the<br> results.”</br></br></br></br></br></br></p></blockquote><p>As JartStar commented: “It will be amusing<br> that in another year or two CNN will have less to do with the news and<br> more to do with reality TV than SyFy has with science fiction”.</br></br></p><p>And<br> fitting. What Fox has done to CNN is exactly what Larry, Mike, Tom,<br> Sara, and me are going to do to the world of Pink SF. By presenting an<br> ideological alternative that appeals to more than half of the<br> prospective audience that is ignored and denigrated by the monolithic<br> gatekeepers, our market is far less saturated. Having lost their former<br> ability to keep us out of print and out of the bookstores, there is<br> nothing the genre publishers can do except watch helplessly as we cut<br> into their sales in the same way that Fox News cut into CNN’s ratings.</br></br></br></br></br></br></br></br></p><p>I<br> only wish Amazon permitted authors to give away Kindle Select<br> books on an ongoing basis. Every individual who downloads a free copy of<br> <i>The Last Witchking</i> or <i>The Wardog’s Coin</i> and reads it isn’t merely a potential buyer of <i>A Throne of Bones</i> or <i>Quantum Mortis</i>, he is also one more book sale lost to the gatekeepers.</br></br></br></p><p>They<br> are the dinosaurs, heavy with overhead and thin operating margins. We<br> are the mammals, able to write and publish a book in the time it takes<br> them to bring a finished book to market. That’s why we are going to win<br> despite their best efforts to pretend we don’t even exist.</br></br></br></br></p><p>Speaking<br> of which, I’m looking for translators who are interested in translating<br> my books in return for a share in the revenue. If you are a native<br> speaker of a language other than English and you want to take active part in the Blue<br> SF Revolution, fire me an email.</br></br></br></br></p></div>",
  "content_text": "The head of CNN finally tires of being repeatedly prison-raped in the ratings every night by Fox News and\nthrows in the towel\n:\nAfter\nalmost a year of tinkering, CNN Worldwide President Jeff Zucker has\nconcluded that a news channel cannot subsist on news alone. So\nhe is planning much broader changes for the network—including a\nprime-time shakeup that’s likely to make CNN traditionalists cringe.\nOnce,\nCNN’s vanilla coverage was a point of pride. Now, the boss boasts about\nthe ratings for his unscripted series, and documentaries like the Sea\nWorld-slamming film Blackfish. Zucker, in his first one-on-one interview\nsince taking control of CNN last January, told Capital he wants news\ncoverage “that is just not being so obvious.”\nInstead,\nhe wants more of “an attitude and a take”: “We’re all regurgitating the\nsame information. I want people to say, ‘You know what? That was\ninteresting. I hadn’t thought of that,’” Zucker said. “The goal for the\nnext six months, is that we need more shows and less newscasts.”\nZucker—“rhymes\nwith hooker,” he likes to say—also expanded on comments he has made\nabout breaking CNN out of a mindset created by historic rivalries with\nMSNBC and Fox. He wants the network to attract “viewers who are watching\nplaces like Discovery and History and Nat Geo and A&E.”\n“People\nwho traditionally just watch the cable news networks [are] a great\naudience,” he said. “I’m not trying to alienate that audience. But the\noverall cable news audience has not grown in the last 12 years, OK? So,\nall we’re doing is trading [audience] share. … We also want to broaden\nwhat people can expect from CNN.”\nThe 48-year-old\nZucker initially faced internal resistance to his experiments beyond the\nrealm of hard news, but he now has an irrefutable retort: The No. 1\nshow on CNN is now “Anthony Bourdain: Parts Unknown,” a travel-adventure\nshow featuring the bad-boy celebrity chef. Zucker said that inside CNN,\nhis formula has finally been accepted “because people have seen the\nresults.”\nAs JartStar commented: “It will be amusing\nthat in another year or two CNN will have less to do with the news and\nmore to do with reality TV than SyFy has with science fiction”.\nAnd\nfitting. What Fox has done to CNN is exactly what Larry, Mike, Tom,\nSara, and me are going to do to the world of Pink SF. By presenting an\nideological alternative that appeals to more than half of the\nprospective audience that is ignored and denigrated by the monolithic\ngatekeepers, our market is far less saturated. Having lost their former\nability to keep us out of print and out of the bookstores, there is\nnothing the genre publishers can do except watch helplessly as we cut\ninto their sales in the same way that Fox News cut into CNN’s ratings.\nI\nonly wish Amazon permitted authors to give away Kindle Select\nbooks on an ongoing basis. Every individual who downloads a free copy of\nThe Last Witchking\nor\nThe Wardog’s Coin\nand reads it isn’t merely a potential buyer of\nA Throne of Bones\nor\nQuantum Mortis\n, he is also one more book sale lost to the gatekeepers.\nThey\nare the dinosaurs, heavy with overhead and thin operating margins. We\nare the mammals, able to write and publish a book in the time it takes\nthem to bring a finished book to market. That’s why we are going to win\ndespite their best efforts to pretend we don’t even exist.\nSpeaking\nof which, I’m looking for translators who are interested in translating\nmy books in return for a share in the revenue. If you are a native\nspeaker of a language other than English and you want to take active part in the Blue\nSF Revolution, fire me an email.",
  "tags": [
    "books",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-03T18:00:00+00:00"
}