{
  "url": "https://voxday.net/2013/12/27/rights-roundup_27/",
  "scraped_at": "2025-12-15T16:41:14.322539",
  "title": "Rights roundup",
  "date_display": "December 27, 2013",
  "date_iso": "2013-12-27T08:47:00+00:00",
  "date_from_url": "2013-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.absoluterights.com/no-more-backing-down/\"><b>No More Backing Down</b></a></p><p>Have you noticed something has changed recently in the way the<br> political Right now responds to public criticism and personal attacks?<br> It used to be that when faced with charges of racism, bigotry, or even<br> being insufficiently polite to the Left, right wingers who found<br> themselves in the media cross hairs fell all over themselves<br> apologizing, denying their previous statements, and rejecting their<br> previously held beliefs.</br></br></br></br></br></br></p><p>Not that this cowardly behavior often saved their jobs or their<br> reputations, and yet one public figure after another persisted in<br> responding to criticism by cringing and assuming the fetal position.</br></br></p><p>Not anymore.</p><p> <b><a href=\"http://www.absoluterights.com/shots-in-the-culture-war/\">Shots in the Culture War</a></b></p><p>There could hardly be two men more different in appearance than Phil<br> Robertson and Ethan Krupp. Phil is a bearded Louisiana backwoodsman, a<br> self-made millionaire, a former collegiate quarterback talented enough<br> to keep Terry Bradshaw on the bench, and an outspoken Christian. Ethan<br> Krupp is a bespectacled Jewish man-boy, an Organizing For Action<br> political activist who stars as the effete, onesie-wearing, hot<br> chocolate-sipping douche in the latest Obama ad debacle.</br></br></br></br></br></br></p></div>",
  "content_text": "No More Backing Down\nHave you noticed something has changed recently in the way the\npolitical Right now responds to public criticism and personal attacks?\nIt used to be that when faced with charges of racism, bigotry, or even\nbeing insufficiently polite to the Left, right wingers who found\nthemselves in the media cross hairs fell all over themselves\napologizing, denying their previous statements, and rejecting their\npreviously held beliefs.\nNot that this cowardly behavior often saved their jobs or their\nreputations, and yet one public figure after another persisted in\nresponding to criticism by cringing and assuming the fetal position.\nNot anymore.\nShots in the Culture War\nThere could hardly be two men more different in appearance than Phil\nRobertson and Ethan Krupp. Phil is a bearded Louisiana backwoodsman, a\nself-made millionaire, a former collegiate quarterback talented enough\nto keep Terry Bradshaw on the bench, and an outspoken Christian. Ethan\nKrupp is a bespectacled Jewish man-boy, an Organizing For Action\npolitical activist who stars as the effete, onesie-wearing, hot\nchocolate-sipping douche in the latest Obama ad debacle.",
  "tags": [
    "Absolute Rights"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-27T08:47:00+00:00"
}