{
  "url": "https://voxday.net/2013/12/13/rights-roundup-2/",
  "scraped_at": "2025-12-15T16:39:53.936995",
  "title": "Rights roundup",
  "date_display": "December 13, 2013",
  "date_iso": "2013-12-13T07:59:00+00:00",
  "date_from_url": "2013-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.absoluterights.com/put-not-your-trust-in-men/\">Put Not Your Trust in Men</a></p><p>The late Nelson Mandela possessed a perceived moral authority in the<br> eyes of the world that few men have ever known. His terrorist past<br> notwithstanding, his subsequent commitment to peace and reconciliation<br> as well as his gracious refusal to give in to despair and hatred made<br> him an icon of hope to many. Even his enemies came to admire him over<br> time, as he answered the perfectly reasonable doubts they harbored by<br> his steadfast adherence to that commitment.</br></br></br></br></br></br></p><p> <a href=\"http://www.absoluterights.com/the-un-american-american-president/\">The Un-American President</a></p><p>After five years of his occupation of the Oval Office, it is abundantly<br> clear that wherever Obama’s true sympathies happen to be, they are most<br> certainly not with America or America’s national symbols.</br></br></p><p> <a href=\"http://www.absoluterights.com/mockery-of-mandela/\">A Mockery of Mandela</a></p><p>If there is a better cure for the collection of preening gasbags who<br> call themselves world leaders and assembled themselves in South Africa<br> in order to be seen pretending to mourn for the late Nelson Mandela, it<br> is hard to imagine one.</br></br></br></p></div>",
  "content_text": "Put Not Your Trust in Men\nThe late Nelson Mandela possessed a perceived moral authority in the\neyes of the world that few men have ever known. His terrorist past\nnotwithstanding, his subsequent commitment to peace and reconciliation\nas well as his gracious refusal to give in to despair and hatred made\nhim an icon of hope to many. Even his enemies came to admire him over\ntime, as he answered the perfectly reasonable doubts they harbored by\nhis steadfast adherence to that commitment.\nThe Un-American President\nAfter five years of his occupation of the Oval Office, it is abundantly\nclear that wherever Obama’s true sympathies happen to be, they are most\ncertainly not with America or America’s national symbols.\nA Mockery of Mandela\nIf there is a better cure for the collection of preening gasbags who\ncall themselves world leaders and assembled themselves in South Africa\nin order to be seen pretending to mourn for the late Nelson Mandela, it\nis hard to imagine one.",
  "tags": [
    "Absolute Rights"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-13T07:59:00+00:00"
}