{
  "url": "https://voxday.net/2013/12/20/rights-roundup_20/",
  "scraped_at": "2025-12-15T16:40:43.903420",
  "title": "Rights roundup",
  "date_display": "December 20, 2013",
  "date_iso": "2013-12-20T20:06:00+00:00",
  "date_from_url": "2013-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.absoluterights.com/an-approaching-earthquake-in-economics/\">An Approaching Earthquake in Economics</a></b></p><p>Recently, two fascinating admissions were made by two of America’s<br> most well-known economists. The first was made by Paul Krugman, the New<br> York Times columnist and Nobel Prize-winner, who has, as a good<br> Neo-Keynesian, resolutely denied any possible link between the amount of<br> debt in the economy and the level of demand for goods and services. As<br> recently as March 2012, he was following Paul Samuelson’s literally<br> textbook lead concerning the economically innocuous nature of debt and<br> admitting “I guess I don’t get that at all.” But two weeks ago, he suddenly began singing a completely different tune.</br></br></br></br></br></br></br></p><p><a href=\"http://www.absoluterights.com/desperate-measures-and-the-national-debt/\"><b>Desperate Measures and the National Debt</b></a></p><p>In the fall of 2002, I observed the housing bubble and noted its<br> likely consequences for the future. In the spring of 2008, I warned my<br> readers that the consequences of that bubble were about to erupt, which<br> duly happened six months later, in October. What was it that concerned<br> me about the situation? And how was I able to see the problem coming<br> when so many mainstream economists did not?<br> The reason is simple. Mainstream economists, whether of the neo-Keynesian or the Monetarist variety, believe that debt is, in their words, “exogenous to the system”.</br></br></br></br></br></br></p></div>",
  "content_text": "An Approaching Earthquake in Economics\nRecently, two fascinating admissions were made by two of America’s\nmost well-known economists. The first was made by Paul Krugman, the New\nYork Times columnist and Nobel Prize-winner, who has, as a good\nNeo-Keynesian, resolutely denied any possible link between the amount of\ndebt in the economy and the level of demand for goods and services. As\nrecently as March 2012, he was following Paul Samuelson’s literally\ntextbook lead concerning the economically innocuous nature of debt and\nadmitting “I guess I don’t get that at all.” But two weeks ago, he suddenly began singing a completely different tune.\nDesperate Measures and the National Debt\nIn the fall of 2002, I observed the housing bubble and noted its\nlikely consequences for the future. In the spring of 2008, I warned my\nreaders that the consequences of that bubble were about to erupt, which\nduly happened six months later, in October. What was it that concerned\nme about the situation? And how was I able to see the problem coming\nwhen so many mainstream economists did not?\nThe reason is simple. Mainstream economists, whether of the neo-Keynesian or the Monetarist variety, believe that debt is, in their words, “exogenous to the system”.",
  "tags": [
    "Absolute Rights",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-20T20:06:00+00:00"
}