{
  "url": "https://voxday.net/2013/12/08/saudi-arabia-performs-impossible/",
  "scraped_at": "2025-12-15T16:39:21.574244",
  "title": "Saudi Arabia performs the “impossible”",
  "date_display": "December 8, 2013",
  "date_iso": "2013-12-08T08:00:00+00:00",
  "date_from_url": "2013-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Isn’t it amazing how other countries routinely appear to be able to do what we are informed is not only impossible, but <a href=\"http://www.ft.com/cms/s/0/6b49c0fa-5d9d-11e3-b3e8-00144feabdc0.html\">outright unthinkable</a>?</p><blockquote class=\"tr_bq\"><p> Teodros Adhanom, the Ethiopian foreign minister, has turned to<br> Twitter almost every night for the last three weeks to tersely report<br> the number of his countrymen expelled from Saudi Arabia.“Last night arrivals from Saudi reached 100,620,” he wrote on Friday,<br> describing a fraction of one of the largest deportations in recent<br> Middle East history. Riyadh has said it wants to forcibly expel as many as 2m of the foreign workers, including hundreds of thousands of <a href=\"http://www.ft.com/intl/cms/s/0/353c748a-ce8c-11e2-ae25-00144feab7de.html\" title=\"Ethiopia's boom runs into limits on finance - FT.com\">Ethiopians</a>, Somalis, Indians, Pakistanis and Bangladeshis, who make up around a third of the country’s 30m population.</br></br></br></br></p><p>At home, the exodus of illegal workers is being seen as the kingdom’s<br> most radical labour market experiment yet. With one in four young Saudi<br> males out of work, analysts applaud Riyadh’s determination to tackle the<br> problem, but doubt the crackdown will achieve its objective, as Saudi<br> nationals are unlikely to apply for menial jobs.</br></br></br></br></p></blockquote><p>What a fascinating way to solve the unemployment problem! Get rid of the excess labor supply. Why, the next thing you know, someone will discover that the Law of Supply and Demand applies to the labor market! And if a country with a 30m population can expel 2m illegal workers in a civilized manner, then surely a country with 300m population is capable of expelling 20m of them.  Minnesota could be Somali-free within 15 days if they contracted the job out to the Saudis.</p><p>It’s not a coincidence that after importing tens of millions of immigrants, the USA has gone into economic and demographic decline. The same is true of the UK and Western Europe. The facts are in. Mass immigration does not boost mature economies. It only speeds up their decline by reducing wages and forcing native workers to go into debt in order to try to maintain their standard of living until the debt limits are reached.</p><p>As for the unwillingness of Saudi nationals to apply for menial jobs, the Saudis might consider raising the wages and eliminating the subsidized unemployment.</p></div>",
  "content_text": "Isn’t it amazing how other countries routinely appear to be able to do what we are informed is not only impossible, but\noutright unthinkable\n?\nTeodros Adhanom, the Ethiopian foreign minister, has turned to\nTwitter almost every night for the last three weeks to tersely report\nthe number of his countrymen expelled from Saudi Arabia.“Last night arrivals from Saudi reached 100,620,” he wrote on Friday,\ndescribing a fraction of one of the largest deportations in recent\nMiddle East history. Riyadh has said it wants to forcibly expel as many as 2m of the foreign workers, including hundreds of thousands of\nEthiopians\n, Somalis, Indians, Pakistanis and Bangladeshis, who make up around a third of the country’s 30m population.\nAt home, the exodus of illegal workers is being seen as the kingdom’s\nmost radical labour market experiment yet. With one in four young Saudi\nmales out of work, analysts applaud Riyadh’s determination to tackle the\nproblem, but doubt the crackdown will achieve its objective, as Saudi\nnationals are unlikely to apply for menial jobs.\nWhat a fascinating way to solve the unemployment problem! Get rid of the excess labor supply. Why, the next thing you know, someone will discover that the Law of Supply and Demand applies to the labor market! And if a country with a 30m population can expel 2m illegal workers in a civilized manner, then surely a country with 300m population is capable of expelling 20m of them.  Minnesota could be Somali-free within 15 days if they contracted the job out to the Saudis.\nIt’s not a coincidence that after importing tens of millions of immigrants, the USA has gone into economic and demographic decline. The same is true of the UK and Western Europe. The facts are in. Mass immigration does not boost mature economies. It only speeds up their decline by reducing wages and forcing native workers to go into debt in order to try to maintain their standard of living until the debt limits are reached.\nAs for the unwillingness of Saudi nationals to apply for menial jobs, the Saudis might consider raising the wages and eliminating the subsidized unemployment.",
  "tags": [
    "economics",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-08T08:00:00+00:00"
}