{
  "url": "https://voxday.net/2013/12/03/sex-differences-are-hard-wired/",
  "scraped_at": "2025-12-15T16:38:47.123298",
  "title": "Sex differences are hard-wired",
  "date_display": "December 3, 2013",
  "date_iso": "2013-12-03T13:00:00+00:00",
  "date_from_url": "2013-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://www.independent.co.uk/life-style/the-hardwired-difference-between-male-and-female-brains-could-explain-why-men-are-better-at-map-reading-8978248.html\">research on brain connections</a> won’t come as any surprise to anyone who isn’t ideologically bound to the idea that sex differences are cultural, but it should suffice to explode any last vestiges of biology-based sexual equalitarianism:</p><blockquote class=\"tr_bq\"><p> “What we’ve identified is that, when looked at in groups, there are<br> connections in the brain that are hardwired differently in men and<br> women. Functional tests have already shown than when they carry out<br> certain tasks, men and women engage different parts of the brain,”<br> Professor Verma said.</br></br></br></br></p><p>The research was carried out on 949<br> individuals – 521 females and 428 males – aged between 8 and 22. The<br> brain differences between the sexes only became apparent after<br> adolescence, the study found.</br></br></br></p><p>A special brain-scanning technique<br> called diffusion tensor imaging, which can measure the flow of water<br> along a nerve pathway, established the level of connectivity between<br> nearly 100 regions of the brain, creating a neural map of the brain<br> called the “connectome”, Professor Verma said.</br></br></br></br></p><p>“It tells you<br> whether one region of the brain is physically connected to another part<br> of the brain and you can get significant differences between two<br> populations,” Professor Verma said. “In women most of the<br> connections go between left and right across the two hemispheres while<br> in men most of the connections go between the front and the back of the<br> brain,” she said.</br></br></br></br></br></br></p><p>Because the female connections link the left<br> hemisphere, which is associated with logical thinking, with the right,<br> which is linked with intuition, this could help to explain why women<br> tend to do better than men at intuitive tasks, she added.</br></br></br></p></blockquote><p>It’s amusing how they can’t help but describe their findings in a futile attempt to appeal to women rather than to offend them. It’s not the map-reading that is relevant; the real takeaway here is that women are less logical on average because their right hemisphere interferes with the ability of their left hemisphere to logically process information. It’s never been any secret that women are less logical; among other things, that’s why women weren’t permitted to vote in the first place. But now, thanks to science, we are beginning to understand that limits such as these weren’t set out of simple prejudice, but rather out of the straightforward desire for societal self-preservation.</p><p>And, as the consequences have demonstrated, the West violated those limits at its peril, a mistake for which we are all, men and women alike, paying the price.</p><p>It should be fascinating to see what happens when similar studies begin providing unavoidable scientific explanations for the differences between various human population groups that everyone observes, but affects to either deny or explain away.</p></div>",
  "content_text": "This\nresearch on brain connections\nwon’t come as any surprise to anyone who isn’t ideologically bound to the idea that sex differences are cultural, but it should suffice to explode any last vestiges of biology-based sexual equalitarianism:\n“What we’ve identified is that, when looked at in groups, there are\nconnections in the brain that are hardwired differently in men and\nwomen. Functional tests have already shown than when they carry out\ncertain tasks, men and women engage different parts of the brain,”\nProfessor Verma said.\nThe research was carried out on 949\nindividuals – 521 females and 428 males – aged between 8 and 22. The\nbrain differences between the sexes only became apparent after\nadolescence, the study found.\nA special brain-scanning technique\ncalled diffusion tensor imaging, which can measure the flow of water\nalong a nerve pathway, established the level of connectivity between\nnearly 100 regions of the brain, creating a neural map of the brain\ncalled the “connectome”, Professor Verma said.\n“It tells you\nwhether one region of the brain is physically connected to another part\nof the brain and you can get significant differences between two\npopulations,” Professor Verma said. “In women most of the\nconnections go between left and right across the two hemispheres while\nin men most of the connections go between the front and the back of the\nbrain,” she said.\nBecause the female connections link the left\nhemisphere, which is associated with logical thinking, with the right,\nwhich is linked with intuition, this could help to explain why women\ntend to do better than men at intuitive tasks, she added.\nIt’s amusing how they can’t help but describe their findings in a futile attempt to appeal to women rather than to offend them. It’s not the map-reading that is relevant; the real takeaway here is that women are less logical on average because their right hemisphere interferes with the ability of their left hemisphere to logically process information. It’s never been any secret that women are less logical; among other things, that’s why women weren’t permitted to vote in the first place. But now, thanks to science, we are beginning to understand that limits such as these weren’t set out of simple prejudice, but rather out of the straightforward desire for societal self-preservation.\nAnd, as the consequences have demonstrated, the West violated those limits at its peril, a mistake for which we are all, men and women alike, paying the price.\nIt should be fascinating to see what happens when similar studies begin providing unavoidable scientific explanations for the differences between various human population groups that everyone observes, but affects to either deny or explain away.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-03T13:00:00+00:00"
}