{
  "url": "https://voxday.net/2013/12/10/sic-transit-gloria-campi/",
  "scraped_at": "2025-12-15T16:39:37.088207",
  "title": "Sic transit gloria campi",
  "date_display": "December 10, 2013",
  "date_iso": "2013-12-10T18:03:00+00:00",
  "date_from_url": "2013-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I received some sad news yesterday. The captain of my varsity soccer team, the 25th Anniversary team that won the MISSL and went to State, died last week at the age of 46. It seems absolutely impossible, not because we’re in our forties or because it shatters some illusion of youthful immortality, but because for me he was an acquaintance who was just a little larger than life.</p><p>I met him in 7th grade when I was sent to private school for the first time; we were two of the original class of 1986 that gradually swelled each year. We weren’t friends, but neither were we enemies. He was at the top of the social ladder of our class from the start and I was pretty damn near the bottom for our first three years there. We both played soccer, but as a bigger, more developed, and more skilled player who was the varsity coach’s son, he played two teams ahead of me, on the C-squad.</p><p>I didn’t start to get to know him well until we both started taking German classes in 8th grade from his father, who like most coaches was a teacher at the school. An Austrian immigrant, his father was a good coach and a superlative language teacher. Unlike most kids who take high school languages, all of us were fully and comfortably conversational in German after five years in the program. From day one, we were forbidden to speak English in the classroom and only referred to each other there by our German names. His German name was Max, and I will henceforth refer to him that way.</p><p>Max was a bully, but not a mean one. He was an Alpha male maintaining his place at the top of the social order, not a cruel individual torturing the bottom-dwellers in order to impress others. He was mercurial, quick to anger and even quicker to smile, laugh, and forget whatever had set off his temper. He was stocky, but not heavy-set, just above average height, with dark blond hair parted in the middle and the sort of pugnacious good looks that are adorable on a little boy, but can look thuggish on the face of an adult.</p><p>He was the private school version of a bad boy who sneaked beers into parties, radiated a vague sense of danger, and was usually involved with one of the more attractive girls in our class. His longtime girlfriend, “Liesl”, was a slender athlete who wasn’t especially pretty in the conventional manner, but was the prototypical cool chick everyone liked. We voted her homecoming queen our senior year. When my parents went to Europe for a month during my senior year, I threw a Super Bowl party. Max brought the keg.</p><p>I was always wary of Max although he never really hassled me. It was clear that he wasn’t the sort of boy it was wise to cross. But despite having class with him literally every school day for four years, it wasn’t until I finally made the varsity team, on which he’d already been playing for two years, that I discovered his true colors. He was one of the team’s three captains, but there was no question to whom everyone looked for direction. This wasn’t because he was the coach’s son, but because the other captains were both highly gifted players who were too laid-back and self-contained to concern themselves much with what everyone else was doing.</p><p>We were supposed to be mediocre that year, since the team only had four lettermen returning after the previous team had gone to the State tournament for the first time since the varsity lost the State championship game when I was in 8th grade. (That made a huge impression on me in junior high, going to the night games with the stands full of cheering, chanting fans.) Prior to the start of the season, we were playing Apple Valley, the defending state champions, in a preseason scrimmage and we were losing one to nothing at halftime.</p><p>We were playing poorly and the coach was disgusted. He waved his hand, said he had nothing to say to us, and walked away. Max stood up and promptly lit into every single one of us, sparing no one, not even the bench players. I have no idea what he said, I just remember the raw fury in his eyes as he yelled at us. We went back onto the field, angry and embarrassed, and promptly outplayed the best team in the state. The game ended in a tie.</p><p>That set the stage for the season. We destroyed many of the teams we played. Both of the other captains got hat tricks in the first two games, I got mine in the third one. We had an eclectic group of players, a mix of popular boys and outsiders, and although we didn’t necessarily all like each other, we all really enjoyed playing together. We came together as a team in the purest sense of the word; it wasn’t a social group, it wasn’t a gathering of friends, it wasn’t a family, it was a group that came together for a single purpose: every time we stepped onto the field together, we were there to win.</p><p>That didn’t mean there weren’t some bumps and bruises in practice. Max was our number 10, and he was a bruiser. He wouldn’t so much steal the ball as bulldoze the player on it before taking it and turning up the field. One day, in practice, he came charging at me and kept coming after I passed the ball away. I saw that he was intending to flatten me, so I swung my elbow around and caught him in the jaw, hard enough to knock him down. I swear, he <i>bounced </i>right off the ground and chased me halfway across the field before enough of our teammates managed to corral him and calm him down.</p><p>A few days later, in the middle of a game, I got into some fisticuffs with two Hill-Murray players and was in the process of getting soundly thrashed. Max came flying in, literally threw himself into their bodies and knocked both of them off me. He stood over me until I could scramble to my feet, swearing a blue streak at them all the while. If you were his teammate, he had your back. I’ve played on and against many teams since then, some of them championship teams, and some of them that featured players from Europe’s most famous soccer clubs. But I’ve never known a better team leader than Max. In 27 years of track, martial arts, and soccer since, I’ve never met anyone who was more willing to stand up or throw down on a moment’s notice for a teammate.</p><p>We went on to win the conference, defeating an SPA team had two future US National team players and would go on to win two consecutive State championships. Max was named All-Midwest, some of the other players were named All-State, but we didn’t win the State championship. After defeating our hated archrivals, Minneapolis Washburn, in the quarterfinals, a game followed by a brawl so epic it made the 10 PM news, Max scored a goal that was disallowed (erroneously) against Bloomington Kennedy. They scored in overtime to knock us out of the tournament in the semifinals. It was an especially bitter defeat because Kennedy was the team that had defeated our varsity team in the State championship game four years before.</p><p>Max and I only saw each other again once after graduation. It was on our home soccer field, an alumni game against a varsity that included two of my younger brothers. They had two 30-goal scorers, one of whom did those fancy flip throw-ins. They were undefeated, and they were more than confident that they would beat up on the old guys without breaking a sweat, as the varsity teams usually did. I scored twice and we won 3-1. It didn’t matter if it was a scrimmage, a State tournament, or an alumni game, if you were playing with Max, then you were going to play to win.</p><p>It was a privilege to play with Max, even if only for one season. I wasn’t the only player to feel that way. One of his college teammates, someone I’ve never met, wrote: <i>“He was an unselfish leader and I loved playing with him.”</i> To this day, when I think of a leader, he is the very first individual of whom I think. And if there is a Valhalla for soccer players, I am absolutely certain he will be there in the midfield, taking no prisoners, and inspiring his teammates by word and by deed. Rest in peace, #10.</p><p><i>Exult O shores, and ring O bells!<br> <br>     <br> But I with mournful tread,<br> <br> Walk the deck my Captain lies,<br> <br>     <br> Fallen cold and dead.</br></br></br></br></br></br></br></br></i></p></div>",
  "content_text": "I received some sad news yesterday. The captain of my varsity soccer team, the 25th Anniversary team that won the MISSL and went to State, died last week at the age of 46. It seems absolutely impossible, not because we’re in our forties or because it shatters some illusion of youthful immortality, but because for me he was an acquaintance who was just a little larger than life.\nI met him in 7th grade when I was sent to private school for the first time; we were two of the original class of 1986 that gradually swelled each year. We weren’t friends, but neither were we enemies. He was at the top of the social ladder of our class from the start and I was pretty damn near the bottom for our first three years there. We both played soccer, but as a bigger, more developed, and more skilled player who was the varsity coach’s son, he played two teams ahead of me, on the C-squad.\nI didn’t start to get to know him well until we both started taking German classes in 8th grade from his father, who like most coaches was a teacher at the school. An Austrian immigrant, his father was a good coach and a superlative language teacher. Unlike most kids who take high school languages, all of us were fully and comfortably conversational in German after five years in the program. From day one, we were forbidden to speak English in the classroom and only referred to each other there by our German names. His German name was Max, and I will henceforth refer to him that way.\nMax was a bully, but not a mean one. He was an Alpha male maintaining his place at the top of the social order, not a cruel individual torturing the bottom-dwellers in order to impress others. He was mercurial, quick to anger and even quicker to smile, laugh, and forget whatever had set off his temper. He was stocky, but not heavy-set, just above average height, with dark blond hair parted in the middle and the sort of pugnacious good looks that are adorable on a little boy, but can look thuggish on the face of an adult.\nHe was the private school version of a bad boy who sneaked beers into parties, radiated a vague sense of danger, and was usually involved with one of the more attractive girls in our class. His longtime girlfriend, “Liesl”, was a slender athlete who wasn’t especially pretty in the conventional manner, but was the prototypical cool chick everyone liked. We voted her homecoming queen our senior year. When my parents went to Europe for a month during my senior year, I threw a Super Bowl party. Max brought the keg.\nI was always wary of Max although he never really hassled me. It was clear that he wasn’t the sort of boy it was wise to cross. But despite having class with him literally every school day for four years, it wasn’t until I finally made the varsity team, on which he’d already been playing for two years, that I discovered his true colors. He was one of the team’s three captains, but there was no question to whom everyone looked for direction. This wasn’t because he was the coach’s son, but because the other captains were both highly gifted players who were too laid-back and self-contained to concern themselves much with what everyone else was doing.\nWe were supposed to be mediocre that year, since the team only had four lettermen returning after the previous team had gone to the State tournament for the first time since the varsity lost the State championship game when I was in 8th grade. (That made a huge impression on me in junior high, going to the night games with the stands full of cheering, chanting fans.) Prior to the start of the season, we were playing Apple Valley, the defending state champions, in a preseason scrimmage and we were losing one to nothing at halftime.\nWe were playing poorly and the coach was disgusted. He waved his hand, said he had nothing to say to us, and walked away. Max stood up and promptly lit into every single one of us, sparing no one, not even the bench players. I have no idea what he said, I just remember the raw fury in his eyes as he yelled at us. We went back onto the field, angry and embarrassed, and promptly outplayed the best team in the state. The game ended in a tie.\nThat set the stage for the season. We destroyed many of the teams we played. Both of the other captains got hat tricks in the first two games, I got mine in the third one. We had an eclectic group of players, a mix of popular boys and outsiders, and although we didn’t necessarily all like each other, we all really enjoyed playing together. We came together as a team in the purest sense of the word; it wasn’t a social group, it wasn’t a gathering of friends, it wasn’t a family, it was a group that came together for a single purpose: every time we stepped onto the field together, we were there to win.\nThat didn’t mean there weren’t some bumps and bruises in practice. Max was our number 10, and he was a bruiser. He wouldn’t so much steal the ball as bulldoze the player on it before taking it and turning up the field. One day, in practice, he came charging at me and kept coming after I passed the ball away. I saw that he was intending to flatten me, so I swung my elbow around and caught him in the jaw, hard enough to knock him down. I swear, he\nbounced\nright off the ground and chased me halfway across the field before enough of our teammates managed to corral him and calm him down.\nA few days later, in the middle of a game, I got into some fisticuffs with two Hill-Murray players and was in the process of getting soundly thrashed. Max came flying in, literally threw himself into their bodies and knocked both of them off me. He stood over me until I could scramble to my feet, swearing a blue streak at them all the while. If you were his teammate, he had your back. I’ve played on and against many teams since then, some of them championship teams, and some of them that featured players from Europe’s most famous soccer clubs. But I’ve never known a better team leader than Max. In 27 years of track, martial arts, and soccer since, I’ve never met anyone who was more willing to stand up or throw down on a moment’s notice for a teammate.\nWe went on to win the conference, defeating an SPA team had two future US National team players and would go on to win two consecutive State championships. Max was named All-Midwest, some of the other players were named All-State, but we didn’t win the State championship. After defeating our hated archrivals, Minneapolis Washburn, in the quarterfinals, a game followed by a brawl so epic it made the 10 PM news, Max scored a goal that was disallowed (erroneously) against Bloomington Kennedy. They scored in overtime to knock us out of the tournament in the semifinals. It was an especially bitter defeat because Kennedy was the team that had defeated our varsity team in the State championship game four years before.\nMax and I only saw each other again once after graduation. It was on our home soccer field, an alumni game against a varsity that included two of my younger brothers. They had two 30-goal scorers, one of whom did those fancy flip throw-ins. They were undefeated, and they were more than confident that they would beat up on the old guys without breaking a sweat, as the varsity teams usually did. I scored twice and we won 3-1. It didn’t matter if it was a scrimmage, a State tournament, or an alumni game, if you were playing with Max, then you were going to play to win.\nIt was a privilege to play with Max, even if only for one season. I wasn’t the only player to feel that way. One of his college teammates, someone I’ve never met, wrote:\n“He was an unselfish leader and I loved playing with him.”\nTo this day, when I think of a leader, he is the very first individual of whom I think. And if there is a Valhalla for soccer players, I am absolutely certain he will be there in the midfield, taking no prisoners, and inspiring his teammates by word and by deed. Rest in peace, #10.\nExult O shores, and ring O bells!\nBut I with mournful tread,\nWalk the deck my Captain lies,\nFallen cold and dead.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-10T18:03:00+00:00"
}