{
  "url": "https://voxday.net/2013/12/20/so-gay-thing-backfired/",
  "scraped_at": "2025-12-15T16:40:42.053587",
  "title": "So, the gay thing backfired",
  "date_display": "December 20, 2013",
  "date_iso": "2013-12-20T14:00:00+00:00",
  "date_from_url": "2013-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They’ll just have to <a href=\"http://www.huffingtonpost.com/2013/12/19/phil-robertson-black-people_n_4473474.html?utm_hp_ref=entertainment&amp;ir=Entertainment\">cry raciss</a> instead:</p><blockquote class=\"tr_bq\"><p> “Duck Dynasty” star Phil Robertson made headlines this week for his anti-gay sentiments in a GQ interview. Now another statement from the interview — this time about the black community during the pre-civil rights era — is stirring more controversy.</p><p>GQ’s Drew Magary sat down with the “Duck Dynasty” patriarch for a candid interview about his road to fame. The 67-year-old journeyed from substance abuse to devotion to God to small-screen celebrity, all in the backwoods of Louisiana. According to Robertson, growing up in those Louisiana backwoods in the pre-civil rights era was not bad for black people.</p><p>“I never, with my eyes, saw the mistreatment of any black person,” Robertson is quoted in GQ. “Not once. Where we lived was all farmers. The blacks worked for the farmers. I hoed cotton with them. I’m with the blacks, because we’re white trash. We’re going across the field…. They’re singing and happy. I never heard one of them, one black person, say, ‘I tell you what: These doggone white people’—not a word!… Pre-entitlement, pre-welfare, you say: Were they happy? They were godly; they were happy; no one was singing the blues.”</p></blockquote><p>Presumably the next accusations will be:</p><ol><li>anti-semitism</li><li>anti-science</li><li>evolution denier</li><li>not a true Christian</li></ol><p>Oh, wait, they already tried number four, didn’t they. I think this episode is actually a potentially positive one for American society, as it is making two things abundantly clear. First, give them an inch and they will not only take a mile, but will insult you in the process. Second, there is absolutely no reasoning with these people. They are an implacable enemy and no quarter should be shown to them even when they wave the white flag and start talking about negotiating a settled peace.</p><p>As Churchill once said of the Hun, he is either at your feet or at your throat. We can’t leave them alone because they won’t leave us alone. We can’t tolerate them because they will not tolerate us. So, root them out of your lives, stop supporting them, stop enabling them, and stop funding their assault on your beliefs, your family, and your faith. There are no fences upon which moderates can safely sit in a cultural war.</p><p>One of the few voices of reason on the Left grasps this and laments the totalitarianism of her own side. Camille Paglia writes:</p><blockquote class=\"tr_bq\"><p> “To express yourself in a magazine in an interview — this is the<br> level of punitive PC, utterly fascist, utterly Stalinist, OK, that my<br> liberal colleagues in the Democratic Party and on college campuses have<br> supported and promoted over the last several decades,” Paglia said.<br> “This is the whole legacy of free speech 1960’s that have been lost by<br> my own party.</br></br></br></br></br></p><p>“I think that this intolerance by gay activists toward the full<br> spectrum of human beliefs is a sign of immaturity, juvenility,” Paglia<br> said. “This is not the mark of a true intellectual life. This is why<br> there is no cultural life now in the U.S. Why nothing is of interest<br> coming from the major media in terms of cultural criticism. Why the<br> graduates of the Ivy League with their A, A, A+ grades are complete<br> cultural illiterates, etc. is because they are not being educated in any<br> way to give respect to opposing view points.”</br></br></br></br></br></br></br></p></blockquote><p>One cannot reason with totalitarians. One can only refuse to submit to them. And sooner or later, one must fight them.</p><p>UPDATE: The Robertson family stands fast:</p><p><i>“We are disappointed that Phil has been placed on hiatus for expressing<br> his faith, which is his constitutionally protected right.We have had a<br> successful working relationship with A&amp;E but, as a family, we cannot<br> imagine the show going forward without our patriarch at the helm.  We<br> are in discussions with A&amp;E to see what that means for the future of<br> Duck Dynasty.   Again, thank you for your continued support of our<br> family.”</br></br></br></br></br></br></i></p></div>",
  "content_text": "They’ll just have to\ncry raciss\ninstead:\n“Duck Dynasty” star Phil Robertson made headlines this week for his anti-gay sentiments in a GQ interview. Now another statement from the interview — this time about the black community during the pre-civil rights era — is stirring more controversy.\nGQ’s Drew Magary sat down with the “Duck Dynasty” patriarch for a candid interview about his road to fame. The 67-year-old journeyed from substance abuse to devotion to God to small-screen celebrity, all in the backwoods of Louisiana. According to Robertson, growing up in those Louisiana backwoods in the pre-civil rights era was not bad for black people.\n“I never, with my eyes, saw the mistreatment of any black person,” Robertson is quoted in GQ. “Not once. Where we lived was all farmers. The blacks worked for the farmers. I hoed cotton with them. I’m with the blacks, because we’re white trash. We’re going across the field…. They’re singing and happy. I never heard one of them, one black person, say, ‘I tell you what: These doggone white people’—not a word!… Pre-entitlement, pre-welfare, you say: Were they happy? They were godly; they were happy; no one was singing the blues.”\nPresumably the next accusations will be:\nanti-semitism\nanti-science\nevolution denier\nnot a true Christian\nOh, wait, they already tried number four, didn’t they. I think this episode is actually a potentially positive one for American society, as it is making two things abundantly clear. First, give them an inch and they will not only take a mile, but will insult you in the process. Second, there is absolutely no reasoning with these people. They are an implacable enemy and no quarter should be shown to them even when they wave the white flag and start talking about negotiating a settled peace.\nAs Churchill once said of the Hun, he is either at your feet or at your throat. We can’t leave them alone because they won’t leave us alone. We can’t tolerate them because they will not tolerate us. So, root them out of your lives, stop supporting them, stop enabling them, and stop funding their assault on your beliefs, your family, and your faith. There are no fences upon which moderates can safely sit in a cultural war.\nOne of the few voices of reason on the Left grasps this and laments the totalitarianism of her own side. Camille Paglia writes:\n“To express yourself in a magazine in an interview — this is the\nlevel of punitive PC, utterly fascist, utterly Stalinist, OK, that my\nliberal colleagues in the Democratic Party and on college campuses have\nsupported and promoted over the last several decades,” Paglia said.\n“This is the whole legacy of free speech 1960’s that have been lost by\nmy own party.\n“I think that this intolerance by gay activists toward the full\nspectrum of human beliefs is a sign of immaturity, juvenility,” Paglia\nsaid. “This is not the mark of a true intellectual life. This is why\nthere is no cultural life now in the U.S. Why nothing is of interest\ncoming from the major media in terms of cultural criticism. Why the\ngraduates of the Ivy League with their A, A, A+ grades are complete\ncultural illiterates, etc. is because they are not being educated in any\nway to give respect to opposing view points.”\nOne cannot reason with totalitarians. One can only refuse to submit to them. And sooner or later, one must fight them.\nUPDATE: The Robertson family stands fast:\n“We are disappointed that Phil has been placed on hiatus for expressing\nhis faith, which is his constitutionally protected right.We have had a\nsuccessful working relationship with A&E but, as a family, we cannot\nimagine the show going forward without our patriarch at the helm.  We\nare in discussions with A&E to see what that means for the future of\nDuck Dynasty.   Again, thank you for your continued support of our\nfamily.”",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-20T14:00:00+00:00"
}