{
  "url": "https://voxday.net/2013/12/09/the-scholars-edition/",
  "scraped_at": "2025-12-15T16:39:31.885961",
  "title": "The Scholar’s Edition",
  "date_display": "December 9, 2013",
  "date_iso": "2013-12-09T20:30:00+00:00",
  "date_from_url": "2013-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"margin-bottom: 0in;\"> RG kicks it SERIOUS old school style:<i><br/></i></div><blockquote class=\"tr_bq\"><div style=\"margin-bottom: 0in;\"> <i>Habitabilis facta et condita anno<br> MMDCCCX, Ryshalan mundus insignis<br> in regione Kantillona prope extremos fines </br></br></i><i><i>Dominationis </i> Terranei Maioris<br> celeriter fiebat.  Propter locum pollentiorem<br> ipsa saepissime oppugnata victaque erat dum, anno MMCMXXXV, facta sit<br> mundus liber a Pronavarcho Classis Beze Davenant, imperatore Classis<br> XXIo<br> Imperii, qui erat primus Dux Ryshalanis.  Post Seditionem Machinarum<br> Divinarum anno MMCMXCIX et natum Unitatis, Ryshalan primum destinatum<br> victorum administratorum et nationalum et mundanorum<b><br> </br></b>fiebat.  Quartus Dux, arbitrans<br> haec crebra proelia infinitum numerum exsulum opulentorum creatura,<br> primus morem Asyli praebendi instituit.</br></br></br></br></br></br></br></br></br></i></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> –<br> “Annales Ducum Ryshalanis” scripti a Thucidean Marcel</br></div></blockquote><p><i>QUANTUM MORTIS: The Scholar’s Edition</i>. It’s certain to be a classic in the mode of <i>De Bello Gallico</i>.</p><p>We already ran into one major translation issue. The primary Latin endearment used in the sense that we English-speakers use “baby” is <i>cara</i>. If you’ve read the book, then you can probably see the problem there. But, as it happens, RG managed to resolve the issue in an exquisitely appropriate manner worthy of William Weaver himself.</p><p>This is a very high tone blog, you see. Don’t forget to keep your pinky out while you’re reading.</p><p>In not-entirely-unrelated news, the QM hardcovers are at the printers and should be shipping this week to the preorders. Thanks very much for your support!</p></div>",
  "content_text": "RG kicks it SERIOUS old school style:\nHabitabilis facta et condita anno\nMMDCCCX, Ryshalan mundus insignis\nin regione Kantillona prope extremos fines\nDominationis\nTerranei Maioris\nceleriter fiebat.  Propter locum pollentiorem\nipsa saepissime oppugnata victaque erat dum, anno MMCMXXXV, facta sit\nmundus liber a Pronavarcho Classis Beze Davenant, imperatore Classis\nXXIo\nImperii, qui erat primus Dux Ryshalanis.  Post Seditionem Machinarum\nDivinarum anno MMCMXCIX et natum Unitatis, Ryshalan primum destinatum\nvictorum administratorum et nationalum et mundanorum\nfiebat.  Quartus Dux, arbitrans\nhaec crebra proelia infinitum numerum exsulum opulentorum creatura,\nprimus morem Asyli praebendi instituit.\n–\n“Annales Ducum Ryshalanis” scripti a Thucidean Marcel\nQUANTUM MORTIS: The Scholar’s Edition\n. It’s certain to be a classic in the mode of\nDe Bello Gallico\n.\nWe already ran into one major translation issue. The primary Latin endearment used in the sense that we English-speakers use “baby” is\ncara\n. If you’ve read the book, then you can probably see the problem there. But, as it happens, RG managed to resolve the issue in an exquisitely appropriate manner worthy of William Weaver himself.\nThis is a very high tone blog, you see. Don’t forget to keep your pinky out while you’re reading.\nIn not-entirely-unrelated news, the QM hardcovers are at the printers and should be shipping this week to the preorders. Thanks very much for your support!",
  "tags": [
    "Quantum Mortis"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-09T20:30:00+00:00"
}