{
  "url": "https://voxday.net/2013/12/02/the-december-verdic/",
  "scraped_at": "2025-12-15T16:38:37.802919",
  "title": "The December verdict",
  "date_display": "December 2, 2013",
  "date_iso": "2013-12-02T09:18:00+00:00",
  "date_from_url": "2013-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As some will recall, <a href=\"http://voxday.blogspot.com/2013/11/of-savages-and-post-civilized.html#c7635747346482254857\">on November 2nd</a> Porky predicted that all the suckers were wrong and that the political supergenius and giant leap forward in human evolution that is Obama was simply luring everyone in with his suspiciously underachieving web site before leaping like a tiger and making his critics look like fools again:</p><blockquote class=\"tr_bq\"><p> Suckered again, I see. Are you incapable of seeing that the Obamacare rollout was a planned failure? Do you not understand the progressive tactic of lowered expectations?</p><p>The website will be functioning reasonably well by December (I suspect they’ve had the fix all along) at which time Obama will announce his glorious Christmas gift to humanity is “not perfect, but it’s improving every day and children and pregnant women are safe now.” The argument will have been successfully shifted from “should there even be socialized medicine” to “how can we make socialized medicine work.”</p><p>Mission accomplished. Another brilliant progressive tactic made possible by the type of foolishness we see in the OP. Call ’em savages if you want to. But they are playing this game like a grandmaster plays a patzer.  What’s that old saying about looking for the sucker in the room? If you don’t see him it’s probably you.</p></blockquote><p>A readily testable prediction. It is now December. And how is the glorious Christmas gift to humanity doing? According to CNN, not so well.</p><blockquote><p> GEORGE HOWELL, HOST: We know the first thing you have to do when you<br> go to this website you have to select your state. Is that working?<br> ALISON<br> KOSIK, CNN BUSINESS CORRESPONDENT: And what’s funny is I was talking<br> with Matt, and, yeah, that seemed to work, right, when you logged on.<br> But then came the road blocks. So tell me about what happened, because<br> we’re getting another error message here, and it’s supposed to be<br> running smoothly. We’re just not seeing that.<br> MATT SLOANE, CNN MEDICAL PRODUCER: Yeah, so, you know, we’ve been<br> trying to get into the site since October 1 on and off again. I have to<br> say it did work a lot more smoothly this morning. I got through. I<br> picked my state. I put in all of my information and I got through the<br> whole process in eight minutes. And then it said my status was in<br> progress. So I went to refresh it and I got the error message.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Ah, but it is entirely obvious that the progressives at CNN must be in on the great critic-trap! The fact that it is December and the website still isn’t working is only further proof of the superlative strategic brilliance of the progressive masterminds whose fearsome capabilities it is futile to resist, doubt, or even question.</p><p>In any event, this should suffice to demolish Porky’s tedious political wise-man act. Let that be a lesson to all: if you’re going to insist on calling everyone suckers and fools, and strike poses as if you are the only one who has cracked the code of American politics, then you run the risk of drawing my attention long enough for me to systematically destroy your credibility and expose your pretensions.</p><p>It’s only fair. I’m held accountable for all of my failed predictions, which is why I no longer attempt to predict how Americans will vote or the specific timing of expected economic events no matter how many people ask me to do so. I’ll stick to those areas where my predictions have been reliable. Now, if you think you know what’s going on, by all means, share your opinion with everyone here. If you have a new take on current events or an original hypothesis, I hope you will run it by us. But if you’re so convinced you, and only you, are correct that you’re constantly sneering and denigrating others, well, then you had better actually be correct.</p></div>",
  "content_text": "As some will recall,\non November 2nd\nPorky predicted that all the suckers were wrong and that the political supergenius and giant leap forward in human evolution that is Obama was simply luring everyone in with his suspiciously underachieving web site before leaping like a tiger and making his critics look like fools again:\nSuckered again, I see. Are you incapable of seeing that the Obamacare rollout was a planned failure? Do you not understand the progressive tactic of lowered expectations?\nThe website will be functioning reasonably well by December (I suspect they’ve had the fix all along) at which time Obama will announce his glorious Christmas gift to humanity is “not perfect, but it’s improving every day and children and pregnant women are safe now.” The argument will have been successfully shifted from “should there even be socialized medicine” to “how can we make socialized medicine work.”\nMission accomplished. Another brilliant progressive tactic made possible by the type of foolishness we see in the OP. Call ’em savages if you want to. But they are playing this game like a grandmaster plays a patzer.  What’s that old saying about looking for the sucker in the room? If you don’t see him it’s probably you.\nA readily testable prediction. It is now December. And how is the glorious Christmas gift to humanity doing? According to CNN, not so well.\nGEORGE HOWELL, HOST: We know the first thing you have to do when you\ngo to this website you have to select your state. Is that working?\nALISON\nKOSIK, CNN BUSINESS CORRESPONDENT: And what’s funny is I was talking\nwith Matt, and, yeah, that seemed to work, right, when you logged on.\nBut then came the road blocks. So tell me about what happened, because\nwe’re getting another error message here, and it’s supposed to be\nrunning smoothly. We’re just not seeing that.\nMATT SLOANE, CNN MEDICAL PRODUCER: Yeah, so, you know, we’ve been\ntrying to get into the site since October 1 on and off again. I have to\nsay it did work a lot more smoothly this morning. I got through. I\npicked my state. I put in all of my information and I got through the\nwhole process in eight minutes. And then it said my status was in\nprogress. So I went to refresh it and I got the error message.\nAh, but it is entirely obvious that the progressives at CNN must be in on the great critic-trap! The fact that it is December and the website still isn’t working is only further proof of the superlative strategic brilliance of the progressive masterminds whose fearsome capabilities it is futile to resist, doubt, or even question.\nIn any event, this should suffice to demolish Porky’s tedious political wise-man act. Let that be a lesson to all: if you’re going to insist on calling everyone suckers and fools, and strike poses as if you are the only one who has cracked the code of American politics, then you run the risk of drawing my attention long enough for me to systematically destroy your credibility and expose your pretensions.\nIt’s only fair. I’m held accountable for all of my failed predictions, which is why I no longer attempt to predict how Americans will vote or the specific timing of expected economic events no matter how many people ask me to do so. I’ll stick to those areas where my predictions have been reliable. Now, if you think you know what’s going on, by all means, share your opinion with everyone here. If you have a new take on current events or an original hypothesis, I hope you will run it by us. But if you’re so convinced you, and only you, are correct that you’re constantly sneering and denigrating others, well, then you had better actually be correct.",
  "tags": [
    "conspiracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-02T09:18:00+00:00"
}