{
  "url": "https://voxday.net/2013/12/05/the-outdated-neo-darwinists/",
  "scraped_at": "2025-12-15T16:38:58.882882",
  "title": "The outdated Neo-Darwinists",
  "date_display": "December 5, 2013",
  "date_iso": "2013-12-05T08:15:00+00:00",
  "date_from_url": "2013-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As usual, I appear to be well in advance of the scientists. Isn’t it simply astonishing that a non-scientist can so readily and reliably predict <a href=\"http://www.nytimes.com/2013/12/05/science/at-400000-years-oldest-human-dna-yet-found-raises-new-mysteries.html?partner=rss&amp;emc=rss&amp;smid=tw-nytimes&amp;_r=0\">the inaccuracy and unreliability</a> of the current scientific consensus? How is that even theoretically possible? How can ignorance trump credentials and actual science education? And yet….</p><blockquote class=\"tr_bq\"><p> In a paper in the journal Nature, scientists reported Wednesday that they had retrieved ancient human DNA from a fossil dating back about 400,000 years, shattering the previous record of 100,000 years.</p><p>The fossil, a thigh bone found in Spain, had previously seemed to many experts to belong to a forerunner of Neanderthals. But its DNA tells a very different story. It most closely resembles DNA from an enigmatic lineage of humans known as Denisovans. Until now, Denisovans were known only from DNA retrieved from 80,000-year-old remains in Siberia, 4,000 miles east of where the new DNA was found.</p><p>The mismatch between the anatomical and genetic evidence surprised the scientists, who are now rethinking human evolution over the past few hundred thousand years. It is possible, for example, that there are many extinct human populations that scientists have yet to discover. They might have interbred, swapping DNA. Scientists hope that further studies of extremely ancient human DNA will clarify the mystery.</p></blockquote><p>There isn’t a mystery here. The TENS true believers keep thinking that genetics will color in the lines of their rudimentary evolution-based models, but instead, the science keeps breaking their lines. All of the conceptual models are wrong. Pretty much all of the carefully calculated timelines are wrong. Evolution by natural selection is a red herring of a theory that was developed at a time when the scientific tools were crude and largely unscientific. So, it should be absolutely no surprise that the improved data being provided by advancements in genetic science is repeatedly overturning the conclusions that were previously reached.</p><div itemprop=\"articleBody\"> <i>““This would not have been possible even a year ago,” said Juan Luis<br> Arsuaga, a paleoanthropologist at Universidad Complutense de Madrid and a<br> co-author of the paper. Finding such ancient human DNA was a major advance, said David Reich, a<br> geneticist at Harvard Medical School who was not involved in the<br> research. “That’s an amazing, game-changing thing,” he said.”</br></br></br></br></i><p>The game will change, but it will take time. I am aware that most scientists are still holding firmly to the natural selection model. This, too, is as expected, as per Kuhn. We’ll have to wait until all the Dawkinses and Myerses die off before geneticists with a sufficiently open mind can throw out the theory altogether. As it happens, they’re already <a href=\"http://aeon.co/magazine/nature-and-cosmos/why-its-time-to-lay-the-selfish-gene-to-rest/\">beginning to throw out</a> Mr. Dawkins’s signature concept:</p></div><blockquote class=\"tr_bq\"><p> Mendel didn’t expose the physical gene, of course (that would come a<br> century later), but the conceptual gene. And this conceptual gene,<br> revealed in the tables and calculations of this math-friendly monk,<br> seemed an agent of mathematical neatness. Mendel’s thousands of<br> crossings showed that the traits he studied — smooth skin versus<br> wrinkled, for instance, or purple flower versus white — appeared or<br> disappeared in consistent ratios dictated by clear mathematical<br> formulas. Inheritance appeared to work like algebra. Anything so<br> math-friendly had to be driven by discrete integers.<br> It was beautiful work. Yet when Mendel first published his findings in 1866, just seven years after Charles Darwin’s <i>On the Origin of Species,</i><br> no one noticed. Starting in 1900, however, biologists rediscovering his<br> work began to see that these units of heredity he’d discovered — dubbed<br> <i>genes</i> in 1909 — filled a crucial gap in Darwin’s theory of evolution. This recognition was the <i>Holy Shit!</i> moment that launched genetics’ <i>Holy Shit!</i> century. It seemed to explain <i>everything.</i> And it saved Darwin.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Darwin had legitimised evolution by proposing for it a viable<br> mechanism — natural selection, in which organisms with the most<br> favourable traits survive and multiply at higher rates than do others.<br> But he could not explain what created or altered traits. Mendel could. Genes created traits, and both would spread through a<br> population if a gene created a trait that survived selection….</br></br></br></br></p><p>These days, Dawkins makes the news so often for buffoonery that some might wonder how he ever became so celebrated. <i>The Selfish Gene</i><br> is how. To read this book is to be amazed, entertained, transported.<br> For instance, when Dawkins describes how life might have begun — how a<br> randomly generated strand of chemicals pulled from the ether could<br> happen to become a ‘replicator’, a little machine that starts to build<br> other strands like itself, and then generates organisms to carry it — he<br> creates one of the most thrilling stretches of explanatory writing ever<br> penned. It’s breathtaking.</br></br></br></br></br></br></br></p><p>Dawkins assembles genetics’ dry materials and abstract maths into a<br> rich but orderly landscape through which he guides you with grace,<br> charm, urbanity, and humour. He replicates in prose the process he<br> describes. He gives agency to chemical chains, logic to confounding<br> behaviour. He takes an impossibly complex idea and makes it almost<br> impossible to misunderstand. He reveals the gene as not just the centre<br> of the cell but the centre of all life, agency, and behaviour. By the<br> time you’ve finished his book, or well before that, Dawkins has made of<br> the tiny gene — this replicator, this strip of chemicals little more<br> than an abstraction — a huge, relentlessly turning gearwheel of steel,<br> its teeth driving smaller cogs to make all of life happen. It’s a<br> gorgeous argument. Along with its beauty and other advantageous traits,<br> it is amenable to maths and, at its core, wonderfully simple.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Unfortunately, say Wray, West-Eberhard and others, it’s wrong.</p></blockquote><p>The best part of all this is that Dawkins clearly knows it’s wrong too. Not that he’s going to admit it, though, not yet.</p><blockquote class=\"tr_bq\"><p> I phoned Richard Dawkins to see what he thought of all this. Did<br> genes follow rather than lead? I asked him specifically about whether<br> processes such as gene accommodation might lead instead. Then he did<br> something so slick and wonderful I didn’t quite realise what he’d done<br> till after we hung up: he dismissed genetic accommodation… by<br> accommodating it. Specifically, he said that genetic accommodation<br> doesn’t really change anything, because since the gene ends up locking<br> in the change and carrying it forward, it all comes back to the gene<br> anyway.</br></br></br></br></br></br></br></br></p><p>‘This doesn’t modify the gene-centric model at all,’ he said. ‘The<br> gene-centric model is all about the gene being the unit in the hierarchy<br> of life that is selected. That remains the gene.’</br></br></p><p>‘He’s backfilling,’ said West-Eberhard. ‘He and others have long been<br> arguing for the primacy of an individual gene that creates a trait that<br> either survives or doesn’t.’</br></br></p></blockquote><p>They backtest and they backfill. That’s due to the crumbling state of TENS. They’re still clinging to natural selection, of course. But the TENS model is in crisis and it will collapse soon enough. It is even beginning to look as if we may get to see it happen in our lifetimes. Gene expression is more compatible with Intelligent Design than with TENS. We are not evolved, we are created. DNA is our C++ equivalent, and the womb is our compiler. Compile it differently, get different results. This is not New Age mumbo jumbo, but a scientific hypothesis that will be testable once we understand it well enough to become proficient in programming it ourselves.</p></div>",
  "content_text": "As usual, I appear to be well in advance of the scientists. Isn’t it simply astonishing that a non-scientist can so readily and reliably predict\nthe inaccuracy and unreliability\nof the current scientific consensus? How is that even theoretically possible? How can ignorance trump credentials and actual science education? And yet….\nIn a paper in the journal Nature, scientists reported Wednesday that they had retrieved ancient human DNA from a fossil dating back about 400,000 years, shattering the previous record of 100,000 years.\nThe fossil, a thigh bone found in Spain, had previously seemed to many experts to belong to a forerunner of Neanderthals. But its DNA tells a very different story. It most closely resembles DNA from an enigmatic lineage of humans known as Denisovans. Until now, Denisovans were known only from DNA retrieved from 80,000-year-old remains in Siberia, 4,000 miles east of where the new DNA was found.\nThe mismatch between the anatomical and genetic evidence surprised the scientists, who are now rethinking human evolution over the past few hundred thousand years. It is possible, for example, that there are many extinct human populations that scientists have yet to discover. They might have interbred, swapping DNA. Scientists hope that further studies of extremely ancient human DNA will clarify the mystery.\nThere isn’t a mystery here. The TENS true believers keep thinking that genetics will color in the lines of their rudimentary evolution-based models, but instead, the science keeps breaking their lines. All of the conceptual models are wrong. Pretty much all of the carefully calculated timelines are wrong. Evolution by natural selection is a red herring of a theory that was developed at a time when the scientific tools were crude and largely unscientific. So, it should be absolutely no surprise that the improved data being provided by advancements in genetic science is repeatedly overturning the conclusions that were previously reached.\n““This would not have been possible even a year ago,” said Juan Luis\nArsuaga, a paleoanthropologist at Universidad Complutense de Madrid and a\nco-author of the paper. Finding such ancient human DNA was a major advance, said David Reich, a\ngeneticist at Harvard Medical School who was not involved in the\nresearch. “That’s an amazing, game-changing thing,” he said.”\nThe game will change, but it will take time. I am aware that most scientists are still holding firmly to the natural selection model. This, too, is as expected, as per Kuhn. We’ll have to wait until all the Dawkinses and Myerses die off before geneticists with a sufficiently open mind can throw out the theory altogether. As it happens, they’re already\nbeginning to throw out\nMr. Dawkins’s signature concept:\nMendel didn’t expose the physical gene, of course (that would come a\ncentury later), but the conceptual gene. And this conceptual gene,\nrevealed in the tables and calculations of this math-friendly monk,\nseemed an agent of mathematical neatness. Mendel’s thousands of\ncrossings showed that the traits he studied — smooth skin versus\nwrinkled, for instance, or purple flower versus white — appeared or\ndisappeared in consistent ratios dictated by clear mathematical\nformulas. Inheritance appeared to work like algebra. Anything so\nmath-friendly had to be driven by discrete integers.\nIt was beautiful work. Yet when Mendel first published his findings in 1866, just seven years after Charles Darwin’s\nOn the Origin of Species,\nno one noticed. Starting in 1900, however, biologists rediscovering his\nwork began to see that these units of heredity he’d discovered — dubbed\ngenes\nin 1909 — filled a crucial gap in Darwin’s theory of evolution. This recognition was the\nHoly Shit!\nmoment that launched genetics’\nHoly Shit!\ncentury. It seemed to explain\neverything.\nAnd it saved Darwin.\nDarwin had legitimised evolution by proposing for it a viable\nmechanism — natural selection, in which organisms with the most\nfavourable traits survive and multiply at higher rates than do others.\nBut he could not explain what created or altered traits. Mendel could. Genes created traits, and both would spread through a\npopulation if a gene created a trait that survived selection….\nThese days, Dawkins makes the news so often for buffoonery that some might wonder how he ever became so celebrated.\nThe Selfish Gene\nis how. To read this book is to be amazed, entertained, transported.\nFor instance, when Dawkins describes how life might have begun — how a\nrandomly generated strand of chemicals pulled from the ether could\nhappen to become a ‘replicator’, a little machine that starts to build\nother strands like itself, and then generates organisms to carry it — he\ncreates one of the most thrilling stretches of explanatory writing ever\npenned. It’s breathtaking.\nDawkins assembles genetics’ dry materials and abstract maths into a\nrich but orderly landscape through which he guides you with grace,\ncharm, urbanity, and humour. He replicates in prose the process he\ndescribes. He gives agency to chemical chains, logic to confounding\nbehaviour. He takes an impossibly complex idea and makes it almost\nimpossible to misunderstand. He reveals the gene as not just the centre\nof the cell but the centre of all life, agency, and behaviour. By the\ntime you’ve finished his book, or well before that, Dawkins has made of\nthe tiny gene — this replicator, this strip of chemicals little more\nthan an abstraction — a huge, relentlessly turning gearwheel of steel,\nits teeth driving smaller cogs to make all of life happen. It’s a\ngorgeous argument. Along with its beauty and other advantageous traits,\nit is amenable to maths and, at its core, wonderfully simple.\nUnfortunately, say Wray, West-Eberhard and others, it’s wrong.\nThe best part of all this is that Dawkins clearly knows it’s wrong too. Not that he’s going to admit it, though, not yet.\nI phoned Richard Dawkins to see what he thought of all this. Did\ngenes follow rather than lead? I asked him specifically about whether\nprocesses such as gene accommodation might lead instead. Then he did\nsomething so slick and wonderful I didn’t quite realise what he’d done\ntill after we hung up: he dismissed genetic accommodation… by\naccommodating it. Specifically, he said that genetic accommodation\ndoesn’t really change anything, because since the gene ends up locking\nin the change and carrying it forward, it all comes back to the gene\nanyway.\n‘This doesn’t modify the gene-centric model at all,’ he said. ‘The\ngene-centric model is all about the gene being the unit in the hierarchy\nof life that is selected. That remains the gene.’\n‘He’s backfilling,’ said West-Eberhard. ‘He and others have long been\narguing for the primacy of an individual gene that creates a trait that\neither survives or doesn’t.’\nThey backtest and they backfill. That’s due to the crumbling state of TENS. They’re still clinging to natural selection, of course. But the TENS model is in crisis and it will collapse soon enough. It is even beginning to look as if we may get to see it happen in our lifetimes. Gene expression is more compatible with Intelligent Design than with TENS. We are not evolved, we are created. DNA is our C++ equivalent, and the womb is our compiler. Compile it differently, get different results. This is not New Age mumbo jumbo, but a scientific hypothesis that will be testable once we understand it well enough to become proficient in programming it ourselves.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-05T08:15:00+00:00"
}