{
  "url": "https://voxday.net/2013/12/12/the-fearful-fatted-cows/",
  "scraped_at": "2025-12-15T16:39:52.474253",
  "title": "The fearful fatted cows",
  "date_display": "December 12, 2013",
  "date_iso": "2013-12-12T21:00:00+00:00",
  "date_from_url": "2013-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even if the pinkshirts in the SFWA are too dense and short-sighted to see the truck about to run them over, it appears the Author’s Guild isn’t quite so clueless. In much the same vein as James Patterson’s <a href=\"http://www.milobookclub.com/2013/06/04/the-gatekeepers-know-gates-are-crumbling/\">appeal for federal protection</a>, they’re mooing and seeking safety in numbers. And it’s just delightful to see those who have been protected by the gatekeepers for decades openly fretting about being forced to compete on even terms with those they have so long despised.  This would seem to be just a little strange, in light of how they so often claimed that the reason they were chosen for publication was because their writing was so much better than the writing of those not permitted past the gatekeepers:<b> </b></p><blockquote class=\"tr_bq\"><p> <b>An Open Letter to My Fellow Authors</b></p><p><b> </b>It’s<br> all changing, right before our eyes. Not just publishing, but the<br> writing life itself, our ability to make a living from authorship. Even<br> in the best of times, which these are not, most writers have to<br> supplement their writing incomes by teaching, or throwing up sheet-rock,<br> or cage fighting. It wasn’t always so, but for the last two decades<br> I’ve lived the life most writers dream of: I write novels and stories,<br> as well as the occasional screenplay, and every now and then I hit the<br> road for a week or two and give talks. In short, I’m one of the blessed,<br> and not just in terms of my occupation. My health is good, my children<br> grown, their educations paid for. I’m sixty-four, which sucks, but<br> it also means that nothing that happens in publishing—for good or ill—is<br> going to affect me nearly as much as it affects younger writers,<br> especially those who haven’t made their names yet. Even if the e-price<br> of my next novel is $1.99, I won’t have to go back to cage fighting.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Still, if it turns out that I’ve enjoyed the best the writing life<br> has to offer, that those who follow, even the most brilliant, will have<br> to settle for less, that won’t make me happy and I suspect it won’t<br> cheer other writers who’ve been as fortunate as I. It’s these writers,<br> in particular, that I’m addressing here. Not everyone believes, as I do,<br> that the writing life is endangered by the downward pressure of e-book<br> pricing, by the relentless, ongoing erosion of copyright protection, by<br> the scorched-earth capitalism of companies like Google and Amazon, by<br> spineless publishers who won’t stand up to them, by the “information<br> wants to be free” crowd who believe that art should be cheap or free and<br> treated as a commodity, by internet<br> search engines who are all too happy to direct people to on-line sites<br> that sell pirated (read “stolen”) books, and even by militant librarians<br> who see no reason why they shouldn’t be able to “lend” our e-books<br> without restriction. But those of us who <i>are</i> alarmed by these<br> trends have a duty, I think, to defend and protect the writing life<br> that’s been good to us, not just on behalf of younger writers who will<br> not have our advantages if we don’t, but also on behalf of readers,<br> whose imaginative lives will be diminished if authorship becomes<br> untenable as a profession.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>I know, I know. Some insist that there’s never been a better time to<br> be an author. Self-publishing has democratized the process, they argue,<br> and authors can now<br> earn royalties of up to seventy percent, where once we had to settle for<br> what traditional publishers told us was our share. Anecdotal evidence<br> is marshaled in support of this view (statistical evidence to follow).<br> Those of us who are alarmed, we’re told, are, well, alarmists. Time will<br> tell who’s right, but surely it can’t be a good idea for writers to<br> stand on the sidelines while our collective fate is decided by others.<br> Especially when we consider who those others are. Entities like Google<br> and Apple and Amazon are rich and powerful enough to influence<br> governments, and every day they demonstrate their willingness to wield<br> that enormous power. Books and authors are a tiny but not insignificant<br> part of the larger battle being waged between these companies, a<br> battleground<br> that includes the movie, music, and newspaper industries. I think it’s<br> fair to say that to a greater or lesser degree, those other industries<br> have all gotten their asses kicked, just as we’re getting ours kicked<br> now. And not just in the courts. Somehow, we’re even losing the war for<br> hearts and minds. When we defend copyright, we’re seen as greedy. When<br> we justly sue, we’re seen as litigious. When we attempt to defend the<br> physical book and stores that sell them, we’re seen as Luddites. Our<br> altruism, when we’re able to summon it, is too often seen as<br> self-serving.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>But here’s the thing. What the Apples and Googles and Amazons and<br> Netflixes of the world all have in common (in addition to their quest<br> for world domination), is that<br> they’re all starved for content, and for that they need us. Which means<br> we have a say in all this. Everything in the digital age may feel new<br> and may seem to operate under new rules, but the conversation about the<br> relationship between art and commerce is age-old, and artists must be<br> part of it. To that end we’d do well to speak with one voice, though<br> it’s here we demonstrate our greatest weakness. Writers are notoriously<br> independent cusses, hard to wrangle. We spend our mostly solitary days<br/> filling up blank pieces of paper with words. We must like it that way,<br/> or we wouldn’t do it. But while it’s pretty to think that our odd way of<br/> life will endure, there’s no guarantee. The writing life is ours to<br/> defend. Protecting it also happens to be the mission of<br/> the Authors Guild, which I myself did not join until last year, when the<br/> light switch in my cave finally got tripped. Are you a member? If not,<br/> please consider becoming one. We’re badly outgunned and in need of<br/> reinforcements. If the writing life has done well by you, as it has by<br/> me, here’s your chance to return the favor. Do it now, because there’s<br/> such a thing as being too late.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Oh, boo-freaking-hoo. Just get a real job like everyone else and write when you can. And “altruism” my fourth point of contact. I’ve lived on three continents and the only people I’ve met who are more self-serving than professional writers are international bankers. Although I slipped past the gatekeepers myself and was treated very well by the good people at Simon &amp; Schuster, I very much disliked a lot of what I saw on the other side of the gates. Now I’m happily on the outs, surrounded by a blue-painted gang of Vandals and Visigoths, and very much looking forward to the slaughter of the fatted cows and shambling shoggoths that is about to begin. It does rather look like they’re getting their asses kicked now, and I, for one, expect to do some of the kicking next year.</p><p>Now that the playing field is being leveled by technology, it appears they’re suddenly not so confident that they’re markedly better than the competition. Amusing, is it not? In any event, with all due respect, I believe I shall politely decline the author’s invitation to join the Guild, continue to proudly fly the flag of an independent Blue SF/F author, and let my books sink or swim on their own merits.</p><p>In case you’re in any doubt about how the fatted cows really thought about the competition before they realized they were about to be overrun by it, here are just a few of their unvarnished thoughts about the unwashed and “unprofessional” masses of independent writers, which I cite here for the purposes of commentary and criticism.</p><p><i>“I don’t think SFWA should extend a full membership option to<br/> self-published writers.  It seems to me that the organization cannot<br/> exist as an organization for professional writers if our doors are open<br/> to writers who don’t meet any professional standards.”</i></p><p><i>“SFWA members cringe a bit at the idea of admitting self-published writers without some form of screening, no matter what we think about the changing realities of publishing.”</i><br/> <i><br/></i><br/> <i>“Why would a self-publishing writer want to be a member of SFWA, assuming<br/> they were self-publishing exclusively” </i><br/> <i><br/></i><br/> <i>“It seems to me that the SFWA is on solid, rational, defensible ground<br/> when it says that self-published writers are operating outside the world<br/> that the SFWA was created to police, and thus their membership in the<br/> organization doesn’t make sense.” </i><br/> <i><br/></i><br/> <i>“I am categorically opposed to accepting self-published writers as SFWA<br/> members at any level IF that is the only cedit(s) they have…. there’s a significant difference between Joe Wannabe offering his<br/> “novel” to potential readers from his website without the benefit of any<br/> professional-level editorial oversight and someone who’s had the chance<br/> to run hers past an established and well-regarded author.”</i><br/> <i><br/></i><br/> <i>“the great majority of self-published work is simply bad”</i><br/> <i><br/></i><br/> <i>“I do not want to become an organization of aspiring writers”</i><br/> <i><br/></i><br/> <i>“I for one am worried that if we follow your suggestion and double,<br/> triple, or quadruple our membership by allowing self-published authors<br/> to join, we’ll wind up with either (1) an organization that’s so divided<br/> it can’t function or (2) two groups of members whose needs and<br/> interests conflict as often as they overlap.”</i></p><p>Needless to say, I opposed this widespread anti-self publishing attitude as a part of my campaign for SFWA president. This was in direct opposition to the vociferously anti-self publishing position taken by the organization’s previous three-term president.</p></div>",
  "content_text": "Even if the pinkshirts in the SFWA are too dense and short-sighted to see the truck about to run them over, it appears the Author’s Guild isn’t quite so clueless. In much the same vein as James Patterson’s\nappeal for federal protection\n, they’re mooing and seeking safety in numbers. And it’s just delightful to see those who have been protected by the gatekeepers for decades openly fretting about being forced to compete on even terms with those they have so long despised.  This would seem to be just a little strange, in light of how they so often claimed that the reason they were chosen for publication was because their writing was so much better than the writing of those not permitted past the gatekeepers:\nAn Open Letter to My Fellow Authors\nIt’s\nall changing, right before our eyes. Not just publishing, but the\nwriting life itself, our ability to make a living from authorship. Even\nin the best of times, which these are not, most writers have to\nsupplement their writing incomes by teaching, or throwing up sheet-rock,\nor cage fighting. It wasn’t always so, but for the last two decades\nI’ve lived the life most writers dream of: I write novels and stories,\nas well as the occasional screenplay, and every now and then I hit the\nroad for a week or two and give talks. In short, I’m one of the blessed,\nand not just in terms of my occupation. My health is good, my children\ngrown, their educations paid for. I’m sixty-four, which sucks, but\nit also means that nothing that happens in publishing—for good or ill—is\ngoing to affect me nearly as much as it affects younger writers,\nespecially those who haven’t made their names yet. Even if the e-price\nof my next novel is $1.99, I won’t have to go back to cage fighting.\nStill, if it turns out that I’ve enjoyed the best the writing life\nhas to offer, that those who follow, even the most brilliant, will have\nto settle for less, that won’t make me happy and I suspect it won’t\ncheer other writers who’ve been as fortunate as I. It’s these writers,\nin particular, that I’m addressing here. Not everyone believes, as I do,\nthat the writing life is endangered by the downward pressure of e-book\npricing, by the relentless, ongoing erosion of copyright protection, by\nthe scorched-earth capitalism of companies like Google and Amazon, by\nspineless publishers who won’t stand up to them, by the “information\nwants to be free” crowd who believe that art should be cheap or free and\ntreated as a commodity, by internet\nsearch engines who are all too happy to direct people to on-line sites\nthat sell pirated (read “stolen”) books, and even by militant librarians\nwho see no reason why they shouldn’t be able to “lend” our e-books\nwithout restriction. But those of us who\nare\nalarmed by these\ntrends have a duty, I think, to defend and protect the writing life\nthat’s been good to us, not just on behalf of younger writers who will\nnot have our advantages if we don’t, but also on behalf of readers,\nwhose imaginative lives will be diminished if authorship becomes\nuntenable as a profession.\nI know, I know. Some insist that there’s never been a better time to\nbe an author. Self-publishing has democratized the process, they argue,\nand authors can now\nearn royalties of up to seventy percent, where once we had to settle for\nwhat traditional publishers told us was our share. Anecdotal evidence\nis marshaled in support of this view (statistical evidence to follow).\nThose of us who are alarmed, we’re told, are, well, alarmists. Time will\ntell who’s right, but surely it can’t be a good idea for writers to\nstand on the sidelines while our collective fate is decided by others.\nEspecially when we consider who those others are. Entities like Google\nand Apple and Amazon are rich and powerful enough to influence\ngovernments, and every day they demonstrate their willingness to wield\nthat enormous power. Books and authors are a tiny but not insignificant\npart of the larger battle being waged between these companies, a\nbattleground\nthat includes the movie, music, and newspaper industries. I think it’s\nfair to say that to a greater or lesser degree, those other industries\nhave all gotten their asses kicked, just as we’re getting ours kicked\nnow. And not just in the courts. Somehow, we’re even losing the war for\nhearts and minds. When we defend copyright, we’re seen as greedy. When\nwe justly sue, we’re seen as litigious. When we attempt to defend the\nphysical book and stores that sell them, we’re seen as Luddites. Our\naltruism, when we’re able to summon it, is too often seen as\nself-serving.\nBut here’s the thing. What the Apples and Googles and Amazons and\nNetflixes of the world all have in common (in addition to their quest\nfor world domination), is that\nthey’re all starved for content, and for that they need us. Which means\nwe have a say in all this. Everything in the digital age may feel new\nand may seem to operate under new rules, but the conversation about the\nrelationship between art and commerce is age-old, and artists must be\npart of it. To that end we’d do well to speak with one voice, though\nit’s here we demonstrate our greatest weakness. Writers are notoriously\nindependent cusses, hard to wrangle. We spend our mostly solitary days\nfilling up blank pieces of paper with words. We must like it that way,\nor we wouldn’t do it. But while it’s pretty to think that our odd way of\nlife will endure, there’s no guarantee. The writing life is ours to\ndefend. Protecting it also happens to be the mission of\nthe Authors Guild, which I myself did not join until last year, when the\nlight switch in my cave finally got tripped. Are you a member? If not,\nplease consider becoming one. We’re badly outgunned and in need of\nreinforcements. If the writing life has done well by you, as it has by\nme, here’s your chance to return the favor. Do it now, because there’s\nsuch a thing as being too late.\nOh, boo-freaking-hoo. Just get a real job like everyone else and write when you can. And “altruism” my fourth point of contact. I’ve lived on three continents and the only people I’ve met who are more self-serving than professional writers are international bankers. Although I slipped past the gatekeepers myself and was treated very well by the good people at Simon & Schuster, I very much disliked a lot of what I saw on the other side of the gates. Now I’m happily on the outs, surrounded by a blue-painted gang of Vandals and Visigoths, and very much looking forward to the slaughter of the fatted cows and shambling shoggoths that is about to begin. It does rather look like they’re getting their asses kicked now, and I, for one, expect to do some of the kicking next year.\nNow that the playing field is being leveled by technology, it appears they’re suddenly not so confident that they’re markedly better than the competition. Amusing, is it not? In any event, with all due respect, I believe I shall politely decline the author’s invitation to join the Guild, continue to proudly fly the flag of an independent Blue SF/F author, and let my books sink or swim on their own merits.\nIn case you’re in any doubt about how the fatted cows really thought about the competition before they realized they were about to be overrun by it, here are just a few of their unvarnished thoughts about the unwashed and “unprofessional” masses of independent writers, which I cite here for the purposes of commentary and criticism.\n“I don’t think SFWA should extend a full membership option to\nself-published writers.  It seems to me that the organization cannot\nexist as an organization for professional writers if our doors are open\nto writers who don’t meet any professional standards.”\n“SFWA members cringe a bit at the idea of admitting self-published writers without some form of screening, no matter what we think about the changing realities of publishing.”\n“Why would a self-publishing writer want to be a member of SFWA, assuming\nthey were self-publishing exclusively”\n“It seems to me that the SFWA is on solid, rational, defensible ground\nwhen it says that self-published writers are operating outside the world\nthat the SFWA was created to police, and thus their membership in the\norganization doesn’t make sense.”\n“I am categorically opposed to accepting self-published writers as SFWA\nmembers at any level IF that is the only cedit(s) they have…. there’s a significant difference between Joe Wannabe offering his\n“novel” to potential readers from his website without the benefit of any\nprofessional-level editorial oversight and someone who’s had the chance\nto run hers past an established and well-regarded author.”\n“the great majority of self-published work is simply bad”\n“I do not want to become an organization of aspiring writers”\n“I for one am worried that if we follow your suggestion and double,\ntriple, or quadruple our membership by allowing self-published authors\nto join, we’ll wind up with either (1) an organization that’s so divided\nit can’t function or (2) two groups of members whose needs and\ninterests conflict as often as they overlap.”\nNeedless to say, I opposed this widespread anti-self publishing attitude as a part of my campaign for SFWA president. This was in direct opposition to the vociferously anti-self publishing position taken by the organization’s previous three-term president.",
  "tags": [
    "SFWA",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-12T21:00:00+00:00"
}