{
  "url": "https://voxday.net/2013/12/22/the-war-on-christianity/",
  "scraped_at": "2025-12-15T16:40:51.609792",
  "title": "The World War on Christianity",
  "date_display": "December 22, 2013",
  "date_iso": "2013-12-22T14:12:00+00:00",
  "date_from_url": "2013-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Never forget that <a href=\"http://www.telegraph.co.uk/news/religion/10531964/Christians-left-by-the-world-to-suffer.html\">the spirit of the world hates Jesus Christ</a> and hates the Christian for refusing to submit to it, for refusing to be a part of it.</p><blockquote class=\"tr_bq\"><div class=\"firstPar\"> Across the world this week, hundreds of millions of us will be singing of that<br> “silent night, holy night” in the town of Bethlehem. But as Christmas approaches, with its beguiling promise of “peace on earth and<br> mercy mild”, how many of us will reflect on the words of our great Christmas<br> carols and be reminded that Christianity was a faith born in the East? How<br> many of us are aware that, while the first Christmas took place in the<br> Middle East, there today that same faith is under threat?</br></br></br></br></br></div><div class=\"thirdPar\"> Last week, the leader of the Catholic Church, His Holiness Pope Francis, chose<br> to cast light on this dark story of persecution by taking to Twitter to warn<br> that we “cannot resign ourselves to think of a Middle East without<br> Christians”. Later in the week, Prince Charles warned that “Christians in the Middle East<br> are, increasingly, being deliberately attacked by fundamentalist Islamist<br> militants. Christianity was, literally, born in the Middle East and we must<br> not forget our Middle Eastern brothers and sisters in Christ”.</br></br></br></br></br></br></div></blockquote><p>Don’t forget your brothers and sisters in Christ in the Middle East, in North Korea, in China, and in Africa. Pray for them. Pray that their persecutors will be won over by their faith, even as the Apostle Paul was won over by Stephen the martyr.</p><p>As the A&amp;E affair demonstrates, one day you may need them to pray for you.</p></div>",
  "content_text": "Never forget that\nthe spirit of the world hates Jesus Christ\nand hates the Christian for refusing to submit to it, for refusing to be a part of it.\nAcross the world this week, hundreds of millions of us will be singing of that\n“silent night, holy night” in the town of Bethlehem. But as Christmas approaches, with its beguiling promise of “peace on earth and\nmercy mild”, how many of us will reflect on the words of our great Christmas\ncarols and be reminded that Christianity was a faith born in the East? How\nmany of us are aware that, while the first Christmas took place in the\nMiddle East, there today that same faith is under threat?\nLast week, the leader of the Catholic Church, His Holiness Pope Francis, chose\nto cast light on this dark story of persecution by taking to Twitter to warn\nthat we “cannot resign ourselves to think of a Middle East without\nChristians”. Later in the week, Prince Charles warned that “Christians in the Middle East\nare, increasingly, being deliberately attacked by fundamentalist Islamist\nmilitants. Christianity was, literally, born in the Middle East and we must\nnot forget our Middle Eastern brothers and sisters in Christ”.\nDon’t forget your brothers and sisters in Christ in the Middle East, in North Korea, in China, and in Africa. Pray for them. Pray that their persecutors will be won over by their faith, even as the Apostle Paul was won over by Stephen the martyr.\nAs the A&E affair demonstrates, one day you may need them to pray for you.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-22T14:12:00+00:00"
}