{
  "url": "https://voxday.net/2013/12/17/the-unconstitutional-nsa/",
  "scraped_at": "2025-12-15T16:40:23.262717",
  "title": "The unconstitutional NSA",
  "date_display": "December 17, 2013",
  "date_iso": "2013-12-17T18:05:00+00:00",
  "date_from_url": "2013-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s about time the violation of the 4th Amendment <a href=\"http://www.nytimes.com/2013/12/17/opinion/a-powerful-rebuke-of-mass-surveillance.html?hp&amp;rref=opinion&amp;_r=0\">is addressed by the courts</a>:</p><blockquote class=\"tr_bq\"><p> For the first time since the revelation of the National Security<br> Agency’s vast dragnet of all Americans’ telephone records, a federal<br> court <a href=\"http://www.nytimes.com/2013/12/17/us/politics/federal-judge-rules-against-nsa-phone-data-program.html?hp\">has ruled</a> that such surveillance is “significantly likely” to be unconstitutional. In a <a href=\"http://legaltimes.typepad.com/files/obamansa.pdf\">scathing 68-page opinion</a><br> peppered with exclamations of incredulity, United States District Judge<br> Richard Leon, of the Federal District Court of the District of<br> Columbia, found that the seven-year-old phone-data collection program —<br> which was established under the Patriot Act and has been repeatedly<br> reauthorized by a secret intelligence court — “almost certainly”<br> violates the Fourth Amendment’s prohibition against unreasonable<br> searches.</br></br></br></br></br></br></br></br></br></p><p>Reaching into the 18th century from the 21st, the judge wrote that James<br> Madison “would be aghast” at the degree of privacy invasion the data<br> sweep represents. The ruling by Judge Leon, who was nominated to the bench by President<br> George W. Bush on Sept. 10, 2001, was remarkable for many reasons, but<br> mainly because there were real people sitting in open court challenging<br> the government’s lawyers over the program’s constitutionality.</br></br></br></br></br></p><p>The plaintiffs, led by Larry Klayman, a conservative legal activist,<br> sued the government after the program came to light. A similar suit <a href=\"http://www.nytimes.com/2013/11/23/opinion/surveillance-goes-on-trial.html\">filed</a> by the American Civil Liberties Union is in a federal court in New York. Judge Leon’s opinion took issue with the government’s reliance on a 1979<br> Supreme Court case, Smith v. Maryland, which upheld the police’s<br> warrantless capture of phone numbers dialed from the home of a robbery<br> suspect on grounds that the suspect had no reasonable expectation of<br> privacy in the numbers he dialed.</br></br></br></br></br></p></blockquote><p>Don’t get me wrong, I fully expect the Roberts Supreme Court to decide that blanket surveillance is not an unreasonable search. After all, there is always an emanation or a penumbra out there somewhere to imagine and cite. But, in doing so, its actions will only underline the fact that the Constitution is now null and void.</p><p>And that will permit for the pro-Constitutional side to finally get in the game and start redefining the living, breathing version to its own liking.</p></div>",
  "content_text": "It’s about time the violation of the 4th Amendment\nis addressed by the courts\n:\nFor the first time since the revelation of the National Security\nAgency’s vast dragnet of all Americans’ telephone records, a federal\ncourt\nhas ruled\nthat such surveillance is “significantly likely” to be unconstitutional. In a\nscathing 68-page opinion\npeppered with exclamations of incredulity, United States District Judge\nRichard Leon, of the Federal District Court of the District of\nColumbia, found that the seven-year-old phone-data collection program —\nwhich was established under the Patriot Act and has been repeatedly\nreauthorized by a secret intelligence court — “almost certainly”\nviolates the Fourth Amendment’s prohibition against unreasonable\nsearches.\nReaching into the 18th century from the 21st, the judge wrote that James\nMadison “would be aghast” at the degree of privacy invasion the data\nsweep represents. The ruling by Judge Leon, who was nominated to the bench by President\nGeorge W. Bush on Sept. 10, 2001, was remarkable for many reasons, but\nmainly because there were real people sitting in open court challenging\nthe government’s lawyers over the program’s constitutionality.\nThe plaintiffs, led by Larry Klayman, a conservative legal activist,\nsued the government after the program came to light. A similar suit\nfiled\nby the American Civil Liberties Union is in a federal court in New York. Judge Leon’s opinion took issue with the government’s reliance on a 1979\nSupreme Court case, Smith v. Maryland, which upheld the police’s\nwarrantless capture of phone numbers dialed from the home of a robbery\nsuspect on grounds that the suspect had no reasonable expectation of\nprivacy in the numbers he dialed.\nDon’t get me wrong, I fully expect the Roberts Supreme Court to decide that blanket surveillance is not an unreasonable search. After all, there is always an emanation or a penumbra out there somewhere to imagine and cite. But, in doing so, its actions will only underline the fact that the Constitution is now null and void.\nAnd that will permit for the pro-Constitutional side to finally get in the game and start redefining the living, breathing version to its own liking.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-17T18:05:00+00:00"
}