{
  "url": "https://voxday.net/2013/12/14/the-rabbits-ponder-fiver-traffic/",
  "scraped_at": "2025-12-15T16:39:59.032580",
  "title": "The rabbits ponder FIVER traffic",
  "date_display": "December 14, 2013",
  "date_iso": "2013-12-14T11:25:00+00:00",
  "date_from_url": "2013-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was sent this exchange between some of the rabbits at the Whatever warren, bewildered by the frightening notion that their Chief Rabbit may not be anywhere nearly as important as he told them he was and that more people actually prefer the scary bad mans:</p><blockquote class=\"tr_bq\"><p> <b>Rabbit 1:</b> You know I am of two minds on this. First the plus side, the money donated is wonderful and it is fun to see losers fuming because feminism has MADE SF/F BETTER. And really to be honest, any man who believes in “game” is a loser to begin with. On the other hand, Scalzi is huge, with 50k readers a day (1) this only gives the evil side free publicity. If only twenty people wind up reading his stupid blogs because of this, he’ll double his readership. He is a nobody that no one listens to, he can only win in this.</p><p><b>Rabbit 2:</b> <i>Have you read his blog stats? Say what you will about his intelligence or character, but the RSHD gets some serious traffic.</i> (2)</p><p><b>Scalzi-rah:</b> As does Stormfront, I’m sure, and for similar reasons. (3)</p><p><b>Rabbit 3:</b>  <i>If you believe Beale, his Alexa rating has doubled in the past year and<br> his shitty little “game” blog beats out this one, and blah blah blah. <br> I’m not saying he’s lying, exactly, but I dunno. I really can’t be assed<br> to think about it too much, but I have a feeling that Mark Twain’s<br> wisdom applies here.</br></br></br></br></i></p><p><b>Rabbit 4:</b> I’m not saying he’s lying because I have no knowledge one way or the other. Anyway, the substance of a site’s content and the number of hits a site gets are two separate things. </p><p><b>Rabbit 3:</b> <i>Well, okay, to be clear: he’s gaming Alexa, which is obvious if you<br> look up his site’s history. It’s not particularly hard to do, I just<br> don’t know how exactly he’s going about it. There are multiple ways. Not<br> that it really matters, or that overblown narcissists can’t have<br> legitimately high profiles. Some do. Beale doesn’t, though, and I just<br> think it’s worth pointing out his transparent dishonesty.<b> </b></br></br></br></br></br></i></p><p><b>Scalzi-rah:</b> I don’t think we need to worry ourselves whether Mr. Beale’s sites legitimately get the traffic he claims or not. It’s entirely possible they do. The Internet is full off assholes, and they like to clump together. If they go to his sites and off of everyone else’s, then he’s welcome to their traffic. And if he’s making it all up, then it’s nice he has a hobby. (4)</p></blockquote><p>Let’s address the traffic claims first. John Scalzi alternatively switches between claiming “50,000 daily readers”, “up to 50,000 daily readers”, and “~50,000 daily readers” depending upon what he thinks he can get away with.  His actual daily traffic for the year through November 2013 is 21,400 Google pageviews per day. Mine is 36,511. Apparently there are a considerable number of people that John Scalzi considers assholes out there.</p><p>As for the “shitty little game blog”, it has been rapidly catching up to Whatever all by itself. Whatever has been in decline ever since May 2012, the occasional bump from McRapey’s friends at the Guardian notwithstanding. Alpha Game grew from 1,675,300 pageviews in 2012 to what I estimate will be more than 3.7 million in 2013.</p><p>With regards to the supposed gaming of Alexa, I note that Whatever has more sites linking in (4,625) than it has average daily readers. This compares to 893 sites linking in to VP. But even if I did somehow successfully game the improvement of VP’s Alexa rank from 29,426 to 6,987, it should be fascinating to hear how I simultaneously managed to engineer the decline of Whatever from 12,996 to 51,779.</p><p><a href=\"http://3.bp.blogspot.com/-5GUz_BJFflk/UqxBaChibsI/AAAAAAAAAok/7J59c8naGDA/s1600/week.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"108\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/12/week.png\" width=\"320\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2013/12/week.png\" decoding=\"async\" height=\"108\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20108%22%3E%3C/svg%3E\" width=\"320\"/></a>In any event, it is absolutely hilarious to see fans of the least honest blogger on the Internet, the Bernie Madoff of Science Fiction, desperately trying to point out my “transparent dishonesty” when I openly post my Sitemeter numbers and honestly report my Google pageviews. This is what Google reports for VP alone as of this morning; Alpha Game was another 10,115 yesterday for a slightly below par 35,390. Fridays tend to be a little slow. Anyone who doubts that my traffic exceeds Whatever’s should ask John Scalzi to post the exact same screenshot of his traffic for the last month. As for Alexa, I seem to recall openly declaring that it was a bullshit metric when similar survey measures were cited as evidence of Whatever’s presumed popularity last year. I trust that I have now conclusively made my case in that regard.</p><p>And if you think this is amusing, just wait until I am able to show that McRapey’s three “New York Times bestsellers” were gamed by Tor. Being a three-time Billboard Top 40 recording artist myself, I know it happened and I even know how. I just can’t conclusively prove it yet. But if I ever gather the proof, I will certainly post it here.</p><p>Let me see if I can put this in a manner simple enough for the rabbits who genuinely believe “Scalzi is huge” and <i>Redshirts </i>is a great novel to understand:  <b>EMBLEER INLE-RAH HRAIR ELIL. SCALZI-RAH SCALZI-ROO. O ZORN! RUN HLESSI RUN!</b></p><p> <i>(1) See, they really are as dumb as we suspect them to be. 50,000 DAILY READERS!</i><br> <i>(2) Possibly a Not-Rabbit. Sounds suspiciously like a rabbit-hunter to me.</i><br> <i>(3) McRapey is still trying to push the Stormfront meme.  Never mind that the SFWA was so desperate to sweep that report under the table that they sent out DMCA takedown notices to prevent people from reading it.</i><br> <i>(4) Translation: OH GOD, STOP TALKING ABOUT INTERNET TRAFFIC! HE’S JUST GOING TO RUB IT IN MY FACE AGAIN!</i></br></br></br></p></div>",
  "content_text": "I was sent this exchange between some of the rabbits at the Whatever warren, bewildered by the frightening notion that their Chief Rabbit may not be anywhere nearly as important as he told them he was and that more people actually prefer the scary bad mans:\nRabbit 1:\nYou know I am of two minds on this. First the plus side, the money donated is wonderful and it is fun to see losers fuming because feminism has MADE SF/F BETTER. And really to be honest, any man who believes in “game” is a loser to begin with. On the other hand, Scalzi is huge, with 50k readers a day (1) this only gives the evil side free publicity. If only twenty people wind up reading his stupid blogs because of this, he’ll double his readership. He is a nobody that no one listens to, he can only win in this.\nRabbit 2:\nHave you read his blog stats? Say what you will about his intelligence or character, but the RSHD gets some serious traffic.\n(2)\nScalzi-rah:\nAs does Stormfront, I’m sure, and for similar reasons. (3)\nRabbit 3:\nIf you believe Beale, his Alexa rating has doubled in the past year and\nhis shitty little “game” blog beats out this one, and blah blah blah.\nI’m not saying he’s lying, exactly, but I dunno. I really can’t be assed\nto think about it too much, but I have a feeling that Mark Twain’s\nwisdom applies here.\nRabbit 4:\nI’m not saying he’s lying because I have no knowledge one way or the other. Anyway, the substance of a site’s content and the number of hits a site gets are two separate things.\nRabbit 3:\nWell, okay, to be clear: he’s gaming Alexa, which is obvious if you\nlook up his site’s history. It’s not particularly hard to do, I just\ndon’t know how exactly he’s going about it. There are multiple ways. Not\nthat it really matters, or that overblown narcissists can’t have\nlegitimately high profiles. Some do. Beale doesn’t, though, and I just\nthink it’s worth pointing out his transparent dishonesty.\nScalzi-rah:\nI don’t think we need to worry ourselves whether Mr. Beale’s sites legitimately get the traffic he claims or not. It’s entirely possible they do. The Internet is full off assholes, and they like to clump together. If they go to his sites and off of everyone else’s, then he’s welcome to their traffic. And if he’s making it all up, then it’s nice he has a hobby. (4)\nLet’s address the traffic claims first. John Scalzi alternatively switches between claiming “50,000 daily readers”, “up to 50,000 daily readers”, and “~50,000 daily readers” depending upon what he thinks he can get away with.  His actual daily traffic for the year through November 2013 is 21,400 Google pageviews per day. Mine is 36,511. Apparently there are a considerable number of people that John Scalzi considers assholes out there.\nAs for the “shitty little game blog”, it has been rapidly catching up to Whatever all by itself. Whatever has been in decline ever since May 2012, the occasional bump from McRapey’s friends at the Guardian notwithstanding. Alpha Game grew from 1,675,300 pageviews in 2012 to what I estimate will be more than 3.7 million in 2013.\nWith regards to the supposed gaming of Alexa, I note that Whatever has more sites linking in (4,625) than it has average daily readers. This compares to 893 sites linking in to VP. But even if I did somehow successfully game the improvement of VP’s Alexa rank from 29,426 to 6,987, it should be fascinating to hear how I simultaneously managed to engineer the decline of Whatever from 12,996 to 51,779.\nIn any event, it is absolutely hilarious to see fans of the least honest blogger on the Internet, the Bernie Madoff of Science Fiction, desperately trying to point out my “transparent dishonesty” when I openly post my Sitemeter numbers and honestly report my Google pageviews. This is what Google reports for VP alone as of this morning; Alpha Game was another 10,115 yesterday for a slightly below par 35,390. Fridays tend to be a little slow. Anyone who doubts that my traffic exceeds Whatever’s should ask John Scalzi to post the exact same screenshot of his traffic for the last month. As for Alexa, I seem to recall openly declaring that it was a bullshit metric when similar survey measures were cited as evidence of Whatever’s presumed popularity last year. I trust that I have now conclusively made my case in that regard.\nAnd if you think this is amusing, just wait until I am able to show that McRapey’s three “New York Times bestsellers” were gamed by Tor. Being a three-time Billboard Top 40 recording artist myself, I know it happened and I even know how. I just can’t conclusively prove it yet. But if I ever gather the proof, I will certainly post it here.\nLet me see if I can put this in a manner simple enough for the rabbits who genuinely believe “Scalzi is huge” and\nRedshirts\nis a great novel to understand:\nEMBLEER INLE-RAH HRAIR ELIL. SCALZI-RAH SCALZI-ROO. O ZORN! RUN HLESSI RUN!\n(1) See, they really are as dumb as we suspect them to be. 50,000 DAILY READERS!\n(2) Possibly a Not-Rabbit. Sounds suspiciously like a rabbit-hunter to me.\n(3) McRapey is still trying to push the Stormfront meme.  Never mind that the SFWA was so desperate to sweep that report under the table that they sent out DMCA takedown notices to prevent people from reading it.\n(4) Translation: OH GOD, STOP TALKING ABOUT INTERNET TRAFFIC! HE’S JUST GOING TO RUB IT IN MY FACE AGAIN!",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-14T11:25:00+00:00"
}