{
  "url": "https://voxday.net/2013/12/10/the-war-on-grammar/",
  "scraped_at": "2025-12-15T16:39:33.372297",
  "title": "The war on grammar",
  "date_display": "December 10, 2013",
  "date_iso": "2013-12-10T11:00:00+00:00",
  "date_from_url": "2013-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As the rape of science fiction was apparently not enough for the pinkshirts, some of them are now attempting <a href=\"http://www.joyent.com/blog/the-power-of-a-pronoun\">to destroy programming in the name of sex equity</a> as well:</p><blockquote class=\"tr_bq\"><p> One of the node.js core contributors, Ben Noordhuis, rejected a pull request that eliminated the use of a gendered pronoun in libuv. Now, this was quickly reversed by node.js project lead Isaac Schlueter (that is, Isaac accepted the patch eliminating the gendered pronoun), but because this is a Joyent-sponsored project, many made the reasonable inference that Ben is a Joyent employee—and have called Joyent to task for tolerating such poor behavior. (Especially when that poor behavior transcended into the gobsmackingly inappropriate as Ben tried to revert Isaac’s commit.)</p><p>But while Isaac is a Joyent employee, Ben is not—and if he had been, he wouldn’t be as of this morning: to reject a pull request that eliminates a gendered pronoun on the principle that pronouns should in fact be gendered would constitute a fireable offense for me and for Joyent. On the one hand, it seems ridiculous (absurd, perhaps) to fire someone over a pronoun — but to characterize it that way would be a gross oversimplification: it’s not the use of the gendered pronoun that’s at issue (that’s just sloppy), but rather the insistence that pronouns should in fact be gendered. To me, that insistence can only come from one place: that gender—specifically, masculinity—is inextricably linked to software, and that’s not an attitude that Joyent tolerates. This isn’t merely a legalistic concern (though that too, certainly), but also a technical one: we believe that empathy is a core engineering value—and that an engineer that has so little empathy as to not understand why the use of gendered pronouns is a concern almost certainly makes poor technical decisions as well….</p><p>But just so you heard it from<br> us:  if this were the act of a Joyent employee, we would—to<br> deliberately use a gender-neutral pronoun—fire them.</br></br></p></blockquote><p>I would avoid using any of Joyent’s products, given that it is clear that as a company, they are far more concerned about ideological correctness than with working code or the abilities of their programmers. They are actually insisting upon the use of grammatically incorrect language and threatening to fire those who are unwilling to use the improper form. It would be fascinating to investigate their employment practices and determine if they have 50 percent female programmers, and if not, to learn why they are operating in such an overtly sexist manner.</p><p>As a game developer, I am a potential customer of “high-performance cloud infrastructure and big data analytics company”. And I certainly will not be using, or recommending, Joyent.</p><p>It’s also informative to learn it has now been established that the deliberate choice of pronouns is a fireable offense. This means those of us who speak proper English and understand, as Churchill used to say, that the masculine embraces the feminine in English grammar, are now free to fire anyone who deliberately uses a gender-neutral pronoun such as “he or she” or “them”.</p><p>This gender-policing of the language is such a stupid, left-wing, and above all, <i>parochial </i>attitude. It should be amusing to see them clumsily attempt to covert all gendered articles to “das” in German and to attempt to impose gender neutrality upon <i>la lingua bella</i> and <i>le français.</i></p></div>",
  "content_text": "As the rape of science fiction was apparently not enough for the pinkshirts, some of them are now attempting\nto destroy programming in the name of sex equity\nas well:\nOne of the node.js core contributors, Ben Noordhuis, rejected a pull request that eliminated the use of a gendered pronoun in libuv. Now, this was quickly reversed by node.js project lead Isaac Schlueter (that is, Isaac accepted the patch eliminating the gendered pronoun), but because this is a Joyent-sponsored project, many made the reasonable inference that Ben is a Joyent employee—and have called Joyent to task for tolerating such poor behavior. (Especially when that poor behavior transcended into the gobsmackingly inappropriate as Ben tried to revert Isaac’s commit.)\nBut while Isaac is a Joyent employee, Ben is not—and if he had been, he wouldn’t be as of this morning: to reject a pull request that eliminates a gendered pronoun on the principle that pronouns should in fact be gendered would constitute a fireable offense for me and for Joyent. On the one hand, it seems ridiculous (absurd, perhaps) to fire someone over a pronoun — but to characterize it that way would be a gross oversimplification: it’s not the use of the gendered pronoun that’s at issue (that’s just sloppy), but rather the insistence that pronouns should in fact be gendered. To me, that insistence can only come from one place: that gender—specifically, masculinity—is inextricably linked to software, and that’s not an attitude that Joyent tolerates. This isn’t merely a legalistic concern (though that too, certainly), but also a technical one: we believe that empathy is a core engineering value—and that an engineer that has so little empathy as to not understand why the use of gendered pronouns is a concern almost certainly makes poor technical decisions as well….\nBut just so you heard it from\nus:  if this were the act of a Joyent employee, we would—to\ndeliberately use a gender-neutral pronoun—fire them.\nI would avoid using any of Joyent’s products, given that it is clear that as a company, they are far more concerned about ideological correctness than with working code or the abilities of their programmers. They are actually insisting upon the use of grammatically incorrect language and threatening to fire those who are unwilling to use the improper form. It would be fascinating to investigate their employment practices and determine if they have 50 percent female programmers, and if not, to learn why they are operating in such an overtly sexist manner.\nAs a game developer, I am a potential customer of “high-performance cloud infrastructure and big data analytics company”. And I certainly will not be using, or recommending, Joyent.\nIt’s also informative to learn it has now been established that the deliberate choice of pronouns is a fireable offense. This means those of us who speak proper English and understand, as Churchill used to say, that the masculine embraces the feminine in English grammar, are now free to fire anyone who deliberately uses a gender-neutral pronoun such as “he or she” or “them”.\nThis gender-policing of the language is such a stupid, left-wing, and above all,\nparochial\nattitude. It should be amusing to see them clumsily attempt to covert all gendered articles to “das” in German and to attempt to impose gender neutrality upon\nla lingua bella\nand\nle français.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-10T11:00:00+00:00"
}