{
  "url": "https://voxday.net/2013/12/26/the-economics-of-christmas/",
  "scraped_at": "2025-12-15T16:41:10.676102",
  "title": "The economics of Christmas",
  "date_display": "December 26, 2013",
  "date_iso": "2013-12-26T15:30:00+00:00",
  "date_from_url": "2013-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not often that someone else writes a post I genuinely envy. But John Carney has put together <a href=\"http://www.cnbc.com/id/101295601/page/1\">a brilliant economic satire</a> of various writers and their competing perspectives through the lens of Christmas:<b> </b></p><blockquote class=\"tr_bq\"><p> <b>The Christmas equivalence theorem<br> </br></b></p><div class=\"group-container\"><div class=\"group\"> <i>By Robert Barro, Wall Street Journal</i><br> While<br> it’s understandable that young people across America hope that their<br> lives will be enriched by a sudden influx of toys and sugarplums on<br> December 25, it is incumbent on grown-ups to realize the truth about<br> this Keynesian scheme. It<br> has been demonstrated time and again that Christmas cannot add to the<br> store of toys of the nation or even a single household. Households<br> experiencing a surge in gifts on Christmas day compensate by withholding<br> gifts in the future. That is, gifts that are “spent” on Christmas are<br> saved during the remainder of the year. So each Christmas gift isn’t<br> really so much given as borrowed from the future. Sorry kids, Santa isn’t so much bringing you presents as stealing presents you would have received in the future.</br></br></br></br></br></br></br></br></br></br></br></div></div><h4 class=\"subtitle\"> Rudolph’s Ruddy Nose (Wonkish)</h4><p><i>By Paul Krugman, New York Times</i><br> Joe<br> Weisenthal has a terrific take on the growth of unemployment in the<br> North Pole. As is well known, reindeer unemployment has surged. Yet the<br> Very Serious Elves who promised that sleigh austerity would rapidly<br> bring growth back to the Pole have learned nothing.</br></br></br></br></br></p><p>But<br> it’s not just the elves. Even economists, who should know better, go on<br> insisting that we need to shrink Santa’s route now despite high<br> reindeer unemployment. Some continue to insist that there just is a<br> skill mismatch in the Pole economy, so that we have no choice but to<br> allow the diminutive Rudolph resources go unemployed. This truly is the<br> dark age of North Pole economics. Imagine<br> for a moment that the pole suffered from an immense foggy night.<br> Everyone would agree in that case that we could put Rudolph’s red nose<br> to good use. I know it drives people crazy when I mention that a crisis<br> can be good for aggregate demand—but everyone who disagrees with me is<br> already crazy, so who cares?</br></br></br></br></br></br></br></br></br></br></br></p><div class=\"group-container\"><h4 class=\"subtitle\"> The dirty secret of North Pole’s success</h4><div class=\"group\"> <i>By Steve Sailer, isteve.blogspot.com</i><br> There<br> appears to be a silent rule among pundits—all of whom secretly read<br> me—that we not mention immigration and the North Pole in the same<br> sentence. The truth is that the success of Santa’s operation up there<br> demonstrates that the accepted orthodoxy on immigration is 100 percent<br> wrong. For as long as anyone can remember, there’s been zero immigration<br> to the North Pole—yet the economy thrives, the elves have a thriving<br> culture and there is very little social strife. All that is supposed to<br> be impossible in a monoculture.<p>But, of course, you’re not supposed to notice these hate-facts.</p></br></br></br></br></br></br></br></br></br></div></div><h4 class=\"subtitle\"> Open Borders: Why should they stop at Christmas?</h4><p><i>By Tyler Cowen, Marginal Revolution</i><br> Every<br> year the American government briefly relaxes its stranglehold on our<br> borders to permit the entrance of Santa Claus and his team of reindeer.<br> If this is a good thing on Christmas, imagine how much better it would<br> be if we made this our year round policy? Have you ever eaten in an<br> Elven restaurant? The candy canes are sublime.</br></br></br></br></br></br></p><p>While<br> there are some who think that competition with elf workers would<br> impoverish American workers, there is not a lot of evidence to support<br> this. In fact, the toy making of the elves would likely be complimentary<br> to native production. What’s more, the wealth generated by elven labor<br> would add to economic growth.</br></br></br></br></br></p></blockquote><p>Now that is really funny and very well done. It’s a pity he didn’t include McRapey, although I suppose it’s hard to satirize self-satire.</p><p><b>Santa’s Straight, White, Cis-Male Privilege</b><br> <i>By John Scalzi, Whatever </i><br> “I’m a jolly old elf. I’m one of those elves who likes to force myself into houses without their owner’s consent or desire. The<br> details of how I do this are not particularly important at the moment —<br> although I love when you try to make distinctions about “forced entry”<br> or “legitimate intrusion” because that gives me all sorts of wiggle room —<br> but I will tell you one of the details about why I do it: I like to eat pie.</br></br></br></br></br></br></p></div>",
  "content_text": "It’s not often that someone else writes a post I genuinely envy. But John Carney has put together\na brilliant economic satire\nof various writers and their competing perspectives through the lens of Christmas:\nThe Christmas equivalence theorem\nBy Robert Barro, Wall Street Journal\nWhile\nit’s understandable that young people across America hope that their\nlives will be enriched by a sudden influx of toys and sugarplums on\nDecember 25, it is incumbent on grown-ups to realize the truth about\nthis Keynesian scheme. It\nhas been demonstrated time and again that Christmas cannot add to the\nstore of toys of the nation or even a single household. Households\nexperiencing a surge in gifts on Christmas day compensate by withholding\ngifts in the future. That is, gifts that are “spent” on Christmas are\nsaved during the remainder of the year. So each Christmas gift isn’t\nreally so much given as borrowed from the future. Sorry kids, Santa isn’t so much bringing you presents as stealing presents you would have received in the future.\nRudolph’s Ruddy Nose (Wonkish)\nBy Paul Krugman, New York Times\nJoe\nWeisenthal has a terrific take on the growth of unemployment in the\nNorth Pole. As is well known, reindeer unemployment has surged. Yet the\nVery Serious Elves who promised that sleigh austerity would rapidly\nbring growth back to the Pole have learned nothing.\nBut\nit’s not just the elves. Even economists, who should know better, go on\ninsisting that we need to shrink Santa’s route now despite high\nreindeer unemployment. Some continue to insist that there just is a\nskill mismatch in the Pole economy, so that we have no choice but to\nallow the diminutive Rudolph resources go unemployed. This truly is the\ndark age of North Pole economics. Imagine\nfor a moment that the pole suffered from an immense foggy night.\nEveryone would agree in that case that we could put Rudolph’s red nose\nto good use. I know it drives people crazy when I mention that a crisis\ncan be good for aggregate demand—but everyone who disagrees with me is\nalready crazy, so who cares?\nThe dirty secret of North Pole’s success\nBy Steve Sailer, isteve.blogspot.com\nThere\nappears to be a silent rule among pundits—all of whom secretly read\nme—that we not mention immigration and the North Pole in the same\nsentence. The truth is that the success of Santa’s operation up there\ndemonstrates that the accepted orthodoxy on immigration is 100 percent\nwrong. For as long as anyone can remember, there’s been zero immigration\nto the North Pole—yet the economy thrives, the elves have a thriving\nculture and there is very little social strife. All that is supposed to\nbe impossible in a monoculture.\nBut, of course, you’re not supposed to notice these hate-facts.\nOpen Borders: Why should they stop at Christmas?\nBy Tyler Cowen, Marginal Revolution\nEvery\nyear the American government briefly relaxes its stranglehold on our\nborders to permit the entrance of Santa Claus and his team of reindeer.\nIf this is a good thing on Christmas, imagine how much better it would\nbe if we made this our year round policy? Have you ever eaten in an\nElven restaurant? The candy canes are sublime.\nWhile\nthere are some who think that competition with elf workers would\nimpoverish American workers, there is not a lot of evidence to support\nthis. In fact, the toy making of the elves would likely be complimentary\nto native production. What’s more, the wealth generated by elven labor\nwould add to economic growth.\nNow that is really funny and very well done. It’s a pity he didn’t include McRapey, although I suppose it’s hard to satirize self-satire.\nSanta’s Straight, White, Cis-Male Privilege\nBy John Scalzi, Whatever\n“I’m a jolly old elf. I’m one of those elves who likes to force myself into houses without their owner’s consent or desire. The\ndetails of how I do this are not particularly important at the moment —\nalthough I love when you try to make distinctions about “forced entry”\nor “legitimate intrusion” because that gives me all sorts of wiggle room —\nbut I will tell you one of the details about why I do it: I like to eat pie.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-26T15:30:00+00:00"
}