{
  "url": "https://voxday.net/2013/12/05/the-state-of-independent-publishing/",
  "scraped_at": "2025-12-15T16:39:02.530817",
  "title": "The state of independent publishing",
  "date_display": "December 5, 2013",
  "date_iso": "2013-12-05T18:00:00+00:00",
  "date_from_url": "2013-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One-quarter of the top 100 Amazon sellers <a href=\"http://www.theguardian.com/books/2013/dec/04/amazon-kindle-ebook-sales-indie-publishers\">are independently published</a>:</p><blockquote class=\"tr_bq\"><p> As many as a quarter of the top 100 Kindle books on Amazon.com are from indie publishers, according to data revealed at a trade presentation by the retailer. A chart detailing the 25 top-selling indie titles in 2012 was passed on by an audience member via Twitter. Though the term indie is broad, covering everything from self-published authors to publishing houses that fall outside the big six, the news has been interpreted as a victory for the go-it-alone author. However in the US the term has come to mean self-published. A spokeswoman for Amazon.com said: “This figure is referring to Kindle books on Amazon.com in 2012, with ‘indie’ meaning books self-published via Kindle Direct Publishing (KDP). So a quarter of the top 100 bestselling Kindle books on Amazon.com in 2012 were self-published via KDP.”</p></blockquote><p>Amazon is playing a little fast and loose with the term “indie” here. KDP does not require self-publishing; Marcher Lord has multiple Kindle Select titles that are not self-published. I suspect Amazon doesn’t want to rub it in the major publisher’s faces that they are already as much a super-publisher as a retail channel. Indie quite clearly means independent publishers AND self- publishers.</p><p>My experience with the both world of conventional mainstream publishing as well as indie ebook publishing may be useful here.  I looked up my old reports from various publishers, which happens to include a few books that were not mine, and found the following numbers for conventionally published books distributed through the the traditional bookstores:</p><p><b>SS1: 12,348</b><br> <b>SS2: 43,000</b><br> <b>SS3: 8,000</b><br> <b>IN1: 4,790</b><br> IN2: 3,815<br> IN3: 3,441<br> IN4: 2,796</br></br></br></br></br></br></p><p>Books in bold are mine. The others are not mine, but the numbers are hard. Now, one year ago today, I published <i>A Throne of Bones</i> with Marcher Lord Hinterlands. In terms of sales, it is basically a pure ebook and it isn’t available in any bookstore.</p><p>ATOB: 1,989</p><p>Here is where it gets interesting.  Let’s assume, for the simplicity’s sake, that the three novellas and SE are a single ebook called SE+.</p><p>SE+ PAID: 2,163<br> SE+ FREE: 21,681</br></p><p>So, even as a relative nobody, who is primarily known for being hated within the genre, and lacking a single book for sale on a bookshelf anywhere, I am still able to sell nearly as many copies of a book in a single year as a well-established minor conventional publisher managed to sell through traditional channels in a book’s lifetime.  Since IN1 is one of my books, that indicates that I’m only able to sell about half as many books without conventional distribution, but the higher royalty rate balances that out. Conventional publishing will do literally nothing for me unless it is one of the six majors.</p><p>That being said, it is clear that even from my non-bestselling experience, the major publishers can still push more books than the same writer can reasonably expect to sell on his own. But since they pay lower royalties, which The Author’s Guild describes as 15% of list on hardcovers and 25% of revenue on ebooks, a major publisher still has to sell twice as many copies just to keep pace with the independent revenues.</p><p>But that is far from the only consideration. Pocket signed me to write six books. I only wrote four of them and they only published three of them. Even if you sign a book contract with one of the six major publishers, even if you write and deliver the book, even if the book is edited, accepted, and the second half of the advance is paid, there is still no guarantee that the book will ever be published. Now, it’s not a bad gig, being paid to not write books, but it’s hard to really build on your success that way.</p><p>To top it all off, the ability to give ebooks away allows me to reach 10x more readers. I previously worked out that one out of every five free SE+ readers will subsequently buy ATOB. And, most importantly, the primary limiting factor, the publisher’s print run, no longer applies. I could have sold considerably more copies of <i>The War in Heaven</i> and <i>The World in Shadow</i> had they not been limited by the print run; both books sold through their respective print runs, which caused the vice-president to call me up, congratulate me, and promptly signed me to two more books… neither of which were either completed or published due to organizational changes that had nothing to do with me. Hence the absence of <i>Stalking the Beast</i> from my literary oeuvre</p><p>Here is how I see the pros and cons of independent publishing:</p><p>Pros: higher royalties, no print runs, no 6-18 months publishing delays, guaranteed publication, no gatekeeping, total freedom.</p><p>Cons: lower sales numbers, no books in bookstores, no marketing, no advances, no professional validation, no free editing and cover art.</p><p>Since print runs and publisher reorgs have been the bane of my publishing history, and since I insist on being heavily involved with my covers, there simply isn’t any doubt that indie publishing is my preference. If, on the other hand, all you’re really looking for is professional validation, then you probably won’t be happy with publishing independently.</p><p>I tend to suspect that Hugh Howey has demonstrated the future of the industry for the successful writer, which is to publish the ebooks independently and publish print books through a mainstream publisher.  However, it will be very difficult for established writers to swing this and an independent probably has to sell at least 100k ebooks per year before the major publishers will be seriously interested in that sort of arrangement.</p></div>",
  "content_text": "One-quarter of the top 100 Amazon sellers\nare independently published\n:\nAs many as a quarter of the top 100 Kindle books on Amazon.com are from indie publishers, according to data revealed at a trade presentation by the retailer. A chart detailing the 25 top-selling indie titles in 2012 was passed on by an audience member via Twitter. Though the term indie is broad, covering everything from self-published authors to publishing houses that fall outside the big six, the news has been interpreted as a victory for the go-it-alone author. However in the US the term has come to mean self-published. A spokeswoman for Amazon.com said: “This figure is referring to Kindle books on Amazon.com in 2012, with ‘indie’ meaning books self-published via Kindle Direct Publishing (KDP). So a quarter of the top 100 bestselling Kindle books on Amazon.com in 2012 were self-published via KDP.”\nAmazon is playing a little fast and loose with the term “indie” here. KDP does not require self-publishing; Marcher Lord has multiple Kindle Select titles that are not self-published. I suspect Amazon doesn’t want to rub it in the major publisher’s faces that they are already as much a super-publisher as a retail channel. Indie quite clearly means independent publishers AND self- publishers.\nMy experience with the both world of conventional mainstream publishing as well as indie ebook publishing may be useful here.  I looked up my old reports from various publishers, which happens to include a few books that were not mine, and found the following numbers for conventionally published books distributed through the the traditional bookstores:\nSS1: 12,348\nSS2: 43,000\nSS3: 8,000\nIN1: 4,790\nIN2: 3,815\nIN3: 3,441\nIN4: 2,796\nBooks in bold are mine. The others are not mine, but the numbers are hard. Now, one year ago today, I published\nA Throne of Bones\nwith Marcher Lord Hinterlands. In terms of sales, it is basically a pure ebook and it isn’t available in any bookstore.\nATOB: 1,989\nHere is where it gets interesting.  Let’s assume, for the simplicity’s sake, that the three novellas and SE are a single ebook called SE+.\nSE+ PAID: 2,163\nSE+ FREE: 21,681\nSo, even as a relative nobody, who is primarily known for being hated within the genre, and lacking a single book for sale on a bookshelf anywhere, I am still able to sell nearly as many copies of a book in a single year as a well-established minor conventional publisher managed to sell through traditional channels in a book’s lifetime.  Since IN1 is one of my books, that indicates that I’m only able to sell about half as many books without conventional distribution, but the higher royalty rate balances that out. Conventional publishing will do literally nothing for me unless it is one of the six majors.\nThat being said, it is clear that even from my non-bestselling experience, the major publishers can still push more books than the same writer can reasonably expect to sell on his own. But since they pay lower royalties, which The Author’s Guild describes as 15% of list on hardcovers and 25% of revenue on ebooks, a major publisher still has to sell twice as many copies just to keep pace with the independent revenues.\nBut that is far from the only consideration. Pocket signed me to write six books. I only wrote four of them and they only published three of them. Even if you sign a book contract with one of the six major publishers, even if you write and deliver the book, even if the book is edited, accepted, and the second half of the advance is paid, there is still no guarantee that the book will ever be published. Now, it’s not a bad gig, being paid to not write books, but it’s hard to really build on your success that way.\nTo top it all off, the ability to give ebooks away allows me to reach 10x more readers. I previously worked out that one out of every five free SE+ readers will subsequently buy ATOB. And, most importantly, the primary limiting factor, the publisher’s print run, no longer applies. I could have sold considerably more copies of\nThe War in Heaven\nand\nThe World in Shadow\nhad they not been limited by the print run; both books sold through their respective print runs, which caused the vice-president to call me up, congratulate me, and promptly signed me to two more books… neither of which were either completed or published due to organizational changes that had nothing to do with me. Hence the absence of\nStalking the Beast\nfrom my literary oeuvre\nHere is how I see the pros and cons of independent publishing:\nPros: higher royalties, no print runs, no 6-18 months publishing delays, guaranteed publication, no gatekeeping, total freedom.\nCons: lower sales numbers, no books in bookstores, no marketing, no advances, no professional validation, no free editing and cover art.\nSince print runs and publisher reorgs have been the bane of my publishing history, and since I insist on being heavily involved with my covers, there simply isn’t any doubt that indie publishing is my preference. If, on the other hand, all you’re really looking for is professional validation, then you probably won’t be happy with publishing independently.\nI tend to suspect that Hugh Howey has demonstrated the future of the industry for the successful writer, which is to publish the ebooks independently and publish print books through a mainstream publisher.  However, it will be very difficult for established writers to swing this and an independent probably has to sell at least 100k ebooks per year before the major publishers will be seriously interested in that sort of arrangement.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-05T18:00:00+00:00"
}