{
  "url": "https://voxday.net/2013/12/15/throwing-out-aristotle/",
  "scraped_at": "2025-12-15T16:40:08.216669",
  "title": "Throwing out Aristotle",
  "date_display": "December 15, 2013",
  "date_iso": "2013-12-15T14:00:00+00:00",
  "date_from_url": "2013-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To say nothing of more than two millennia of theology, philosophy, and modern science. And you wonder <a href=\"http://www.hastac.org/blogs/ari-schlesinger/2013/11/26/feminism-and-programming-languages\">why I’m dubious</a> about the survival prospects of equalitarian society, or indeed, any society where feminism has grown roots:</p><blockquote class=\"tr_bq\"><p> What is a feminist logic is a question I’ve spent the past six months<br> thinking about and researching. There are not a lot of women in<br> philosophy, and there are definitely not a lot of feminist philosophers,<br> so I don’t have a good answer for this question. There is great<br> scholarship talking about weather a feminist logic can build off of<br> formal logic or if it has to reject the laws of identity and create<br> something entirely new. There are solid arguments for both camps,<br> personally I’m swayed by the constructive theories that would build onto<br> formal logic through a feminist lens. There exist logics that handle<br> contradiction as part of the system, namely paraconsistent logic. I<br> think this type of logic represents the feminist idea that something can<br> be and not be without being a contradiction, that is a system where the<br> following statement is not explosive: (p &amp;&amp; ¬p) == 1.</br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>It should be readily apparent that once you’ve decided that X = !X, you have essentially doomed yourself by denying reality. It is only a matter of time before you make the fatal determination that the hungry bear wants you to play with it, the November ice is thick enough to drive on, or you can leap off the cliff and fly.</p><p>This holds as true for societies as it does for individuals. Consider the paraconsistencies that Examerican society has adopted as truths.</p><ul><li>Third world immigrants are effective substitutes for native children.</li><li>Expanding the vote to women will improve society.</li><li>Paying money to the unemployed will not discourage them from working.</li><li>Debt can expand infinitely without risk of default or currency devaluation.</li><li>Female labor is as productive as male labor.</li><li>Free trade in good, services, and labor benefits the economy.</li><li>Increasing the supply of labor doesn’t reduce its price.</li><li>Men will marry women and support children regardless of financial disincentives.</li><li>Members of non-European population groups will behave more like European population groups in European geographies than like non-Europeans in their original geographies.</li></ul></div>",
  "content_text": "To say nothing of more than two millennia of theology, philosophy, and modern science. And you wonder\nwhy I’m dubious\nabout the survival prospects of equalitarian society, or indeed, any society where feminism has grown roots:\nWhat is a feminist logic is a question I’ve spent the past six months\nthinking about and researching. There are not a lot of women in\nphilosophy, and there are definitely not a lot of feminist philosophers,\nso I don’t have a good answer for this question. There is great\nscholarship talking about weather a feminist logic can build off of\nformal logic or if it has to reject the laws of identity and create\nsomething entirely new. There are solid arguments for both camps,\npersonally I’m swayed by the constructive theories that would build onto\nformal logic through a feminist lens. There exist logics that handle\ncontradiction as part of the system, namely paraconsistent logic. I\nthink this type of logic represents the feminist idea that something can\nbe and not be without being a contradiction, that is a system where the\nfollowing statement is not explosive: (p && ¬p) == 1.\nIt should be readily apparent that once you’ve decided that X = !X, you have essentially doomed yourself by denying reality. It is only a matter of time before you make the fatal determination that the hungry bear wants you to play with it, the November ice is thick enough to drive on, or you can leap off the cliff and fly.\nThis holds as true for societies as it does for individuals. Consider the paraconsistencies that Examerican society has adopted as truths.\nThird world immigrants are effective substitutes for native children.\nExpanding the vote to women will improve society.\nPaying money to the unemployed will not discourage them from working.\nDebt can expand infinitely without risk of default or currency devaluation.\nFemale labor is as productive as male labor.\nFree trade in good, services, and labor benefits the economy.\nIncreasing the supply of labor doesn’t reduce its price.\nMen will marry women and support children regardless of financial disincentives.\nMembers of non-European population groups will behave more like European population groups in European geographies than like non-Europeans in their original geographies.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-15T14:00:00+00:00"
}