{
  "url": "https://voxday.net/2013/12/31/unpublished/",
  "scraped_at": "2025-12-15T16:41:39.616699",
  "title": "Unpublished",
  "date_display": "December 31, 2013",
  "date_iso": "2013-12-31T10:17:00+00:00",
  "date_from_url": "2013-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For reasons that will become clear in a few weeks, and which I am not presently able to disclose, I am no longer publishing my books with Marcher Lord Hinterlands as of today. There haven’t been any problems or a falling out, and indeed, even our most recent collaboration has been successful, with 1,100 copies of QM being sold in its first month of release. I have merely arranged to reacquire the full publishing rights to my books.</p><p>What this means in the short-term is that neither the Selenoth books nor the Quantum Mortis books will be available from Amazon or anywhere else for that matter. I expect the books to again be available on Amazon, the Apple Store, and elsewhere, by the end of January.</p><p>I very much appreciate what Jeff has done with Marcher Lord. Were it not for his contacting me a few years ago and asking me if I had anything that my other publishers weren’t likely to publish, I would never have written <i>Summa Elvetica</i>. And were it not for <i>Summa Elvetica</i>, I very much doubt that I would have proceeded to write <i>A Throne of Bones</i> or to write the nine shorter works that presently make up the land of Selenoth.</p><p>Rest assured I am still hard at work on both QM2 and TAODAL 2. I’m hoping for September and December releases there.</p><p>Due to some vagaries with regards to the Kindle Select program, please note that it is possible that AMB, TWC, TLW, and QM:GK will continue to be available on Amazon in some capacities until the end of February. If that is the case, it is not necessary to inform me that they are still being loaned or sold.</p></div>",
  "content_text": "For reasons that will become clear in a few weeks, and which I am not presently able to disclose, I am no longer publishing my books with Marcher Lord Hinterlands as of today. There haven’t been any problems or a falling out, and indeed, even our most recent collaboration has been successful, with 1,100 copies of QM being sold in its first month of release. I have merely arranged to reacquire the full publishing rights to my books.\nWhat this means in the short-term is that neither the Selenoth books nor the Quantum Mortis books will be available from Amazon or anywhere else for that matter. I expect the books to again be available on Amazon, the Apple Store, and elsewhere, by the end of January.\nI very much appreciate what Jeff has done with Marcher Lord. Were it not for his contacting me a few years ago and asking me if I had anything that my other publishers weren’t likely to publish, I would never have written\nSumma Elvetica\n. And were it not for\nSumma Elvetica\n, I very much doubt that I would have proceeded to write\nA Throne of Bones\nor to write the nine shorter works that presently make up the land of Selenoth.\nRest assured I am still hard at work on both QM2 and TAODAL 2. I’m hoping for September and December releases there.\nDue to some vagaries with regards to the Kindle Select program, please note that it is possible that AMB, TWC, TLW, and QM:GK will continue to be available on Amazon in some capacities until the end of February. If that is the case, it is not necessary to inform me that they are still being loaned or sold.",
  "tags": [
    "books",
    "Quantum Mortis",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-31T10:17:00+00:00"
}