{
  "url": "https://voxday.net/2013/12/05/we-are-not-fooled/",
  "scraped_at": "2025-12-15T16:39:03.996305",
  "title": "We are not fooled",
  "date_display": "December 5, 2013",
  "date_iso": "2013-12-05T21:00:00+00:00",
  "date_from_url": "2013-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Larry Correia totally feigns <a href=\"http://larrycorreia.wordpress.com/2013/12/05/a-book-i-need-to-read/\">putting on a supportive face</a> while pretending to play down the fact that Steve and I actually managed to OUTGUN the master Monster Hunter. But we are not fooled. We all know this has lit a fire burning deep within the man, the green-hot flames of fury fed by envy, disbelief, and outrage:</p><blockquote class=\"tr_bq\"><p> I  know the author online. I’ve participated in many email chains with<br> him, Sarah, Mike, and Tom. I’ve got a copy, but I’ve not had a chance to<br> read it yet. I wanted to read the review copy, but I’ve got a deadline<br> and I’ve been slammed. I’ve heard good things about it though…. I offend people on the internet for being an unabashed right winger. Vox sends them into hyperbolic rage spirals. He is their devil. They hate him more than Scott Card or George Bush, so that is saying something. Anybody who has caused that many panty twists is deserving of royalties just for the entertainment value of watching the literati have come aparts. </br></br></br></p></blockquote><p>Needless to say, I’ll be watching my six with extra caution given the likelihood that Larry will be sending magic kanji-enhanced Shadow Guard after us. Now, where did I put that Benelli-Mossberg Area Suppression Expediter-5K? One of those city block-sweepers could come in handy right about now.</p><p>In truth, it wouldn’t be entirely unfair to describe Quantum Mortis as Alien Hunters Intergalactic in Space. We had a nice little SF murder mystery going, but after reading MHI and the Grimnoire Chronicles, I realized that it had two major flaws.</p><ol><li>Too few bodies.</li><li>Too small guns.</li></ol><p>That is how Graven Tower received a transfer from the Trans Paradis Police Department to the Military Crimes Investigative Division. My reasoning was that the police can only get away with so much collateral damage before the public refuses to put up with it. But the military, well, all they have to do is cry “planetary security” and they can get away with damn near anything.</p></div>",
  "content_text": "Larry Correia totally feigns\nputting on a supportive face\nwhile pretending to play down the fact that Steve and I actually managed to OUTGUN the master Monster Hunter. But we are not fooled. We all know this has lit a fire burning deep within the man, the green-hot flames of fury fed by envy, disbelief, and outrage:\nI  know the author online. I’ve participated in many email chains with\nhim, Sarah, Mike, and Tom. I’ve got a copy, but I’ve not had a chance to\nread it yet. I wanted to read the review copy, but I’ve got a deadline\nand I’ve been slammed. I’ve heard good things about it though…. I offend people on the internet for being an unabashed right winger. Vox sends them into hyperbolic rage spirals. He is their devil. They hate him more than Scott Card or George Bush, so that is saying something. Anybody who has caused that many panty twists is deserving of royalties just for the entertainment value of watching the literati have come aparts.\nNeedless to say, I’ll be watching my six with extra caution given the likelihood that Larry will be sending magic kanji-enhanced Shadow Guard after us. Now, where did I put that Benelli-Mossberg Area Suppression Expediter-5K? One of those city block-sweepers could come in handy right about now.\nIn truth, it wouldn’t be entirely unfair to describe Quantum Mortis as Alien Hunters Intergalactic in Space. We had a nice little SF murder mystery going, but after reading MHI and the Grimnoire Chronicles, I realized that it had two major flaws.\nToo few bodies.\nToo small guns.\nThat is how Graven Tower received a transfer from the Trans Paradis Police Department to the Military Crimes Investigative Division. My reasoning was that the police can only get away with so much collateral damage before the public refuses to put up with it. But the military, well, all they have to do is cry “planetary security” and they can get away with damn near anything.",
  "tags": [
    "Quantum Mortis",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-05T21:00:00+00:00"
}