{
  "url": "https://voxday.net/2013/12/08/why-pink-sf-is-doomed/",
  "scraped_at": "2025-12-15T16:39:27.115902",
  "title": "Why Pink SF is doomed",
  "date_display": "December 8, 2013",
  "date_iso": "2013-12-08T21:00:00+00:00",
  "date_from_url": "2013-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright continues his series on Saving Science Fiction from Strong Female Characters. <a href=\"http://www.scifiwright.com/2013/12/saving-science-fiction-from-strong-female-characters-part-six/\">In the sixth part</a>, he explains why Pink SF is intrinsically bound to suck, how some Pink SF authors have attempted to get around the dramatic limits they have imposed on themselves, and points out that Urban Fantasy has done little more than recreate the very sexual dynamic it was supposed to subvert:</p><blockquote class=\"tr_bq\"><p> The logic of Political Correctness requires that men and women not be complimentary because the concept of complementary strengths and weakness is not a concept that Political Correctness can admit, lest it be destroyed. The concept of complimentary virtues undermines the concept of envy, and Political Correctness is nothing but politicized fury based on politicized envy. We can define Political Correctness as the attempt to express fury and envy via radical changes to legal and social institutions.</p><p>Hence, the Politically Correct writer attempting to make the female ‘strong’ cannot make her strong in the particular feminine way of, for example, Nausicaa, because that would be the same as admitting that there is a particular nature of male and female, which are different and complimentary, which, as I said above, undermines the envy-fury on which Political Correctness is based.</p><p>So the logic of Political Correctness directly defies the logic of drama. The more you have of one, the less you have of the other.</p><p>The more Political Correctness you have, the less Science Fiction you have, because Politically Correct science is Junk Science.</p><p>Political Correctness requires the women not to be of complimentary strength to men, that is, not strong in a feminine way, because that would legitimize femininity. Remember, feminism is the foe of femininity, hence of love and romance.</p><p>Instead, Political Correctness requires the female to be as strong as a man, as good as a man, in the very areas men are good at and want to be good at. It is a deliberately unnatural pose. The women character have to be portrayed as the types of character female readers, by and large, do not want to be like or read about, and the female character have to do things women by and large do not create a big thrill or many bragging rights about doing, and the male characters are basically extraneous.</p><p>Can it be done? Sure. Writers are endlessly inventive, and we get to set the situation and the plot and, in science fiction, we get to set the laws of nature, too. So the basic physical limitations of the female physique in real life need not hinder us in science fiction situations, because your heroine can be from Krypton, or armed with a phaser weapon, or have cat-girl genes spliced into her DNA, or be an Amazon. Second, the writer gets to set the period and the genre. No one can claim that Hermione Grangier is in any way a second class citizen of Hogwarts, because, like a detective in a detective novel, physical strength and fighting prowess are not the main point of a magical school-chums novel.</p><p>Third, if your superheroine is stronger than any normal man, and does not need Prince Charming to settle the hash of the evil dragon, but can wield the sword herself, you can either leave out your male love interest, or you can, Anita Blake style, make him superhuman also. This, of course, is a sly cheat, because it put the girl back in the position of being allured to a dangerous male figure who is more powerful than she, so your vampire huntress falling for a fallen angel (or whatever) is in the same dainty shoes as the spitfire Irish lass kidnapped by the ruthless but devilishly handsome pirate Black Jamie (or whatever) which we all see in the Bodice Ripper racks at the paperback bookstore.</p><p>Paranormal Romance, in other words, is an example of the logic of drama subverting (or perhaps superverting) the logic of Political Correctness. It allows the writer to eat her cake and have it too: she can make her warrior-princess or vampire huntress as tough and strong in any way she likes, as tough as Scarlet O’Hara vowing as God is her witness never to go hungry again, and then also bring in a supernatural version of Rhett Butler, and she can retell the story of Beauty and the Beast while retelling GONE WITH THE WIND, and make her man a human being.</p></blockquote></div>",
  "content_text": "John C. Wright continues his series on Saving Science Fiction from Strong Female Characters.\nIn the sixth part\n, he explains why Pink SF is intrinsically bound to suck, how some Pink SF authors have attempted to get around the dramatic limits they have imposed on themselves, and points out that Urban Fantasy has done little more than recreate the very sexual dynamic it was supposed to subvert:\nThe logic of Political Correctness requires that men and women not be complimentary because the concept of complementary strengths and weakness is not a concept that Political Correctness can admit, lest it be destroyed. The concept of complimentary virtues undermines the concept of envy, and Political Correctness is nothing but politicized fury based on politicized envy. We can define Political Correctness as the attempt to express fury and envy via radical changes to legal and social institutions.\nHence, the Politically Correct writer attempting to make the female ‘strong’ cannot make her strong in the particular feminine way of, for example, Nausicaa, because that would be the same as admitting that there is a particular nature of male and female, which are different and complimentary, which, as I said above, undermines the envy-fury on which Political Correctness is based.\nSo the logic of Political Correctness directly defies the logic of drama. The more you have of one, the less you have of the other.\nThe more Political Correctness you have, the less Science Fiction you have, because Politically Correct science is Junk Science.\nPolitical Correctness requires the women not to be of complimentary strength to men, that is, not strong in a feminine way, because that would legitimize femininity. Remember, feminism is the foe of femininity, hence of love and romance.\nInstead, Political Correctness requires the female to be as strong as a man, as good as a man, in the very areas men are good at and want to be good at. It is a deliberately unnatural pose. The women character have to be portrayed as the types of character female readers, by and large, do not want to be like or read about, and the female character have to do things women by and large do not create a big thrill or many bragging rights about doing, and the male characters are basically extraneous.\nCan it be done? Sure. Writers are endlessly inventive, and we get to set the situation and the plot and, in science fiction, we get to set the laws of nature, too. So the basic physical limitations of the female physique in real life need not hinder us in science fiction situations, because your heroine can be from Krypton, or armed with a phaser weapon, or have cat-girl genes spliced into her DNA, or be an Amazon. Second, the writer gets to set the period and the genre. No one can claim that Hermione Grangier is in any way a second class citizen of Hogwarts, because, like a detective in a detective novel, physical strength and fighting prowess are not the main point of a magical school-chums novel.\nThird, if your superheroine is stronger than any normal man, and does not need Prince Charming to settle the hash of the evil dragon, but can wield the sword herself, you can either leave out your male love interest, or you can, Anita Blake style, make him superhuman also. This, of course, is a sly cheat, because it put the girl back in the position of being allured to a dangerous male figure who is more powerful than she, so your vampire huntress falling for a fallen angel (or whatever) is in the same dainty shoes as the spitfire Irish lass kidnapped by the ruthless but devilishly handsome pirate Black Jamie (or whatever) which we all see in the Bodice Ripper racks at the paperback bookstore.\nParanormal Romance, in other words, is an example of the logic of drama subverting (or perhaps superverting) the logic of Political Correctness. It allows the writer to eat her cake and have it too: she can make her warrior-princess or vampire huntress as tough and strong in any way she likes, as tough as Scarlet O’Hara vowing as God is her witness never to go hungry again, and then also bring in a supernatural version of Rhett Butler, and she can retell the story of Beauty and the Beast while retelling GONE WITH THE WIND, and make her man a human being.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-12-08T21:00:00+00:00"
}