{
  "url": "https://voxday.net/2013/08/05/a-black-view-on-white-decline/",
  "scraped_at": "2025-12-14T22:37:48.189737",
  "title": "A view on black crime and white decline",
  "date_display": "August 5, 2013",
  "date_iso": "2013-08-05T09:11:00+00:00",
  "date_from_url": "2013-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I ask Huggums for his opinion about the observation that blacks have higher crime rates in a wide sampling of societies:</p><blockquote class=\"tr_bq\"><p> <b>What is your currently preferred theory for higher black crime rates? You<br> know mine is a combination of genetic and cultural factors leading to<br> lower average time preferences, I’m just interested in knowing what<br> yours happens to be.</br></br></br></b></p><p>Pretty much the same, but I don’t think the<br> genetic influence is quite as strong as many believe it to be. I think<br> that depending on the cultural environment and the existence of positive<br> social pressure, just about any human trait can find a positive mode of<br> expression.</br></br></br></br></p><p>The genetic issue can only really be “solved” with<br> time. Of course, if white liberals are any indication, even if some<br> environmental catastrophe or social upheaval pushed the next generations<br> of black people towards civilization, once that civilization reaches<br> its apex, it will begin working feverishly to destroy itself. Either<br> that or just start massacring its own citizens because of whatever<br> thin-as-wet-tissue-paper reason it happens to come up with.</br></br></br></br></br></br></p></blockquote><p>Huggums raises an important point here, which is the flip side of my controversial observation that the African population, taken in the whole, can only be half-civilized because fully civilizing a people appears to require about 1,000 years of exposure to civilization.  This, I have argued, is the primary reason blacks have repeatedly shown themselves unable to maintain advanced societies everywhere from Detroit to Zimbabwe, and why the more savage portion of the population has demonstrated that it cannot even constructively participate in an advanced society.</p><p>However, whites and other distinct human populations should not be too impressed with the accomplishments of their ancestors simply because they happened to get an earlier start on the process, because if the process of civilization is hard, maintaining it is observably even more difficult.  Indeed, one could even argue that it is impossible and eventual failure is only a matter of time.</p><p>It would be very hard to argue with Huggums’s observation that there are a considerable quantity of whites who have been working feverishly, and in some cases purposefully, to destroy white Christian European civilization.  Indeed, one could observe that their actions are a logical extension of the white European destruction of traditional Chinese civilization, traditional Japanese civilization, traditional Russian half-civilization, and even traditional Aztec/Inca quarter-civilization.</p><p>If I am correct and extended average time preferences is a critical factor in developing and maintaining civilization, then it would appear the white population has taken several significant steps towards savagery, in both intellectual and behavioral terms. The Keynesian concept of economic growth through inflation and debt-spending is literal intellectual savagery, as intrinsically magical and nonsensical as the illiterate Australian aborigines ideas about causation. And it is not hard to determine where “if it feels good, do it” falls on the time preferences spectrum.</p><p>And this highlights the intrinsic danger of inviting the barbarians inside the gates and encouraging them to integrate with the civilized citizenry. It is easier to bring down than to build up. It is much easier to infect the civilized youth with the idea of living for today and letting tomorrow take care of itself than it is to convince the savage youth to restrain their impulses and save for tomorrow what could be be consumed today. </p><p>Daniel Patrick Moynihan once described the pathologies of black America as a warning of the coming pathologies of white America.  He was more prophetic than he knew; the dire effects of the behavioral problems to which he attempted to draw America’s attention turned out to be even worse than he had feared.  Black hip-hop culture may have been the most noticeable symptom of the cancer of anti-civilizational savagery, but it was the wigger adoption of it that signified the metastasis.</p><p>We are now well past the point of peak American civilization. The only question now is how far into savagery we are going to fall before the process can be reversed.  If it can be reversed.</p></div>",
  "content_text": "In which I ask Huggums for his opinion about the observation that blacks have higher crime rates in a wide sampling of societies:\nWhat is your currently preferred theory for higher black crime rates? You\nknow mine is a combination of genetic and cultural factors leading to\nlower average time preferences, I’m just interested in knowing what\nyours happens to be.\nPretty much the same, but I don’t think the\ngenetic influence is quite as strong as many believe it to be. I think\nthat depending on the cultural environment and the existence of positive\nsocial pressure, just about any human trait can find a positive mode of\nexpression.\nThe genetic issue can only really be “solved” with\ntime. Of course, if white liberals are any indication, even if some\nenvironmental catastrophe or social upheaval pushed the next generations\nof black people towards civilization, once that civilization reaches\nits apex, it will begin working feverishly to destroy itself. Either\nthat or just start massacring its own citizens because of whatever\nthin-as-wet-tissue-paper reason it happens to come up with.\nHuggums raises an important point here, which is the flip side of my controversial observation that the African population, taken in the whole, can only be half-civilized because fully civilizing a people appears to require about 1,000 years of exposure to civilization.  This, I have argued, is the primary reason blacks have repeatedly shown themselves unable to maintain advanced societies everywhere from Detroit to Zimbabwe, and why the more savage portion of the population has demonstrated that it cannot even constructively participate in an advanced society.\nHowever, whites and other distinct human populations should not be too impressed with the accomplishments of their ancestors simply because they happened to get an earlier start on the process, because if the process of civilization is hard, maintaining it is observably even more difficult.  Indeed, one could even argue that it is impossible and eventual failure is only a matter of time.\nIt would be very hard to argue with Huggums’s observation that there are a considerable quantity of whites who have been working feverishly, and in some cases purposefully, to destroy white Christian European civilization.  Indeed, one could observe that their actions are a logical extension of the white European destruction of traditional Chinese civilization, traditional Japanese civilization, traditional Russian half-civilization, and even traditional Aztec/Inca quarter-civilization.\nIf I am correct and extended average time preferences is a critical factor in developing and maintaining civilization, then it would appear the white population has taken several significant steps towards savagery, in both intellectual and behavioral terms. The Keynesian concept of economic growth through inflation and debt-spending is literal intellectual savagery, as intrinsically magical and nonsensical as the illiterate Australian aborigines ideas about causation. And it is not hard to determine where “if it feels good, do it” falls on the time preferences spectrum.\nAnd this highlights the intrinsic danger of inviting the barbarians inside the gates and encouraging them to integrate with the civilized citizenry. It is easier to bring down than to build up. It is much easier to infect the civilized youth with the idea of living for today and letting tomorrow take care of itself than it is to convince the savage youth to restrain their impulses and save for tomorrow what could be be consumed today.\nDaniel Patrick Moynihan once described the pathologies of black America as a warning of the coming pathologies of white America.  He was more prophetic than he knew; the dire effects of the behavioral problems to which he attempted to draw America’s attention turned out to be even worse than he had feared.  Black hip-hop culture may have been the most noticeable symptom of the cancer of anti-civilizational savagery, but it was the wigger adoption of it that signified the metastasis.\nWe are now well past the point of peak American civilization. The only question now is how far into savagery we are going to fall before the process can be reversed.  If it can be reversed.",
  "tags": [
    "decline and fall",
    "mailvox",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-05T08:11:00+00:00"
}