{
  "url": "https://voxday.net/2013/08/23/a-culture-of-abuse/",
  "scraped_at": "2025-12-14T22:39:46.048352",
  "title": "The culture of abuse",
  "date_display": "August 23, 2013",
  "date_iso": "2013-08-23T07:56:00+00:00",
  "date_from_url": "2013-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div dir=\"ltr\"> The Mad Genius and former SFWA member that is Kate Paulk slogs her way through <a href=\"http://www.voxday.net/mart/SFWA_response.pdf\" rel=\"noopener\" target=\"_blank\">my response to the SFWA Board report</a> and finds it not only worth reading, but apparently not entirely lacking in entertainment value.  She also determines that <a href=\"http://madgeniusclub.com/2013/08/22/tofkasfwa-the-gift-that-keeps-on-giving/\" rel=\"noopener\" target=\"_blank\">SFWA is a “culture of abuse”</a>:<blockquote class=\"tr_bq\"><p> Naturally, he has made public <a href=\"http://www.voxday.net/mart/SFWA_response.pdf\" rel=\"noopener\" target=\"_blank\">his response</a> to the shit-sheet… <i>ahem</i>…<br> report. I recommend reading it. My knowledge of the SFWA by-laws from<br> actually reading the wretched things when the last revision of them came<br> up for a vote is that Mr Beale’s facts are 100% accurate. That’s<br> something I’ve noticed with him: you can disagree with him on how to<br> interpret the data, but the data he offers is usually pretty damned<br> accurate.</br></br></br></br></br></br></p><p>Among the many things Mr Beale is totally correct about is<br> the culture of abuse within TOFKASFWA. Name-calling that could make a<br> dock worker blush is one of the charming features of the regular<br> shit-storms, right alongside a truly remarkable lack of originality and<br> wit in the insults being flung right and left… mostly from left to<br> right, but but that’s another story. You’d think a collection of<br> speculative fiction writers could manage better insults than endless<br> conjugations of the standard four letter words (and no, I don’t mean<br> ‘work’ and ‘food’).</br></br></br></br></br></br></br></br></p><p>Having read Mr Beale’s “vigorous” responses to some of<br> these childish inanities, I can say with a degree of authority that he’s<br> definitely more imaginative, and often more witty. He even manages to<br> be self-deprecating once or twice.</br></br></br></p><p>As for the substance of the alleged offenses he allegedly<br> committed: it’s pretty clear that every sin Mr Beale committed against<br> TOFKASFWA was committed in greater quantity by what seems like half the<br> flipping membership. Possibly half the non-flipping membership, too.<br> Since they apparently don’t keep accurate membership records (in<br> violation of their by-laws and the relevant laws for non-profit<br> organization in the two states they’re incorporated in – because their<br> MA incorporation is not over and they’ve taken out CA incorporation.<br> Possibly in violation of Federal laws for their tax status as a<br> non-profit as well) it’s a little difficult to tell what proportion of<br> the membership does anything.</br></br></br></br></br></br></br></br></br></br></p></blockquote></div><p>Actually, it’s not too hard to tell what the barely published affiliate members who are pushing the pinkshirt agenda do. They clearly spend considerably more time reading obscure feminist sociology papers than they do publishing anything.  I suspect that what will ultimately be seen to have killed SFWA in the end is the removal of the requalifying requirement for Active membership; the techno-democratization of publishing may have eliminated SFWA’s original <i>raison d’etre</i>, but it was the makeup of the membership that prevented it from finding a new one still related to the creation of science fiction.</p><p>I have to confess that I am just a little disappointed no one has yet managed to identify the stylized way in which I began my response. I mean, I’m not at all surprised that it went right over the head of the relatively poorly read members of the SFWA Board, but I would have thought that more people here would have caught the reference.  I thought it was rather funny myself, but then, as Spacebunny assures me, I am the only one who truly appreciates my own sense of humor.</p><p><strike>Kate</strike> Another Mad Genius, Dave Freer, also has some interesting thoughts <a href=\"http://madgeniusclub.com/2013/08/19/numbers/\" rel=\"noopener\" target=\"_blank\">on publishing and probability</a> that the writers here will probably find worth checking out.</p></div>",
  "content_text": "The Mad Genius and former SFWA member that is Kate Paulk slogs her way through\nmy response to the SFWA Board report\nand finds it not only worth reading, but apparently not entirely lacking in entertainment value.  She also determines that\nSFWA is a “culture of abuse”\n:\nNaturally, he has made public\nhis response\nto the shit-sheet…\nahem\n…\nreport. I recommend reading it. My knowledge of the SFWA by-laws from\nactually reading the wretched things when the last revision of them came\nup for a vote is that Mr Beale’s facts are 100% accurate. That’s\nsomething I’ve noticed with him: you can disagree with him on how to\ninterpret the data, but the data he offers is usually pretty damned\naccurate.\nAmong the many things Mr Beale is totally correct about is\nthe culture of abuse within TOFKASFWA. Name-calling that could make a\ndock worker blush is one of the charming features of the regular\nshit-storms, right alongside a truly remarkable lack of originality and\nwit in the insults being flung right and left… mostly from left to\nright, but but that’s another story. You’d think a collection of\nspeculative fiction writers could manage better insults than endless\nconjugations of the standard four letter words (and no, I don’t mean\n‘work’ and ‘food’).\nHaving read Mr Beale’s “vigorous” responses to some of\nthese childish inanities, I can say with a degree of authority that he’s\ndefinitely more imaginative, and often more witty. He even manages to\nbe self-deprecating once or twice.\nAs for the substance of the alleged offenses he allegedly\ncommitted: it’s pretty clear that every sin Mr Beale committed against\nTOFKASFWA was committed in greater quantity by what seems like half the\nflipping membership. Possibly half the non-flipping membership, too.\nSince they apparently don’t keep accurate membership records (in\nviolation of their by-laws and the relevant laws for non-profit\norganization in the two states they’re incorporated in – because their\nMA incorporation is not over and they’ve taken out CA incorporation.\nPossibly in violation of Federal laws for their tax status as a\nnon-profit as well) it’s a little difficult to tell what proportion of\nthe membership does anything.\nActually, it’s not too hard to tell what the barely published affiliate members who are pushing the pinkshirt agenda do. They clearly spend considerably more time reading obscure feminist sociology papers than they do publishing anything.  I suspect that what will ultimately be seen to have killed SFWA in the end is the removal of the requalifying requirement for Active membership; the techno-democratization of publishing may have eliminated SFWA’s original\nraison d’etre\n, but it was the makeup of the membership that prevented it from finding a new one still related to the creation of science fiction.\nI have to confess that I am just a little disappointed no one has yet managed to identify the stylized way in which I began my response. I mean, I’m not at all surprised that it went right over the head of the relatively poorly read members of the SFWA Board, but I would have thought that more people here would have caught the reference.  I thought it was rather funny myself, but then, as Spacebunny assures me, I am the only one who truly appreciates my own sense of humor.\nKate\nAnother Mad Genius, Dave Freer, also has some interesting thoughts\non publishing and probability\nthat the writers here will probably find worth checking out.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-23T06:56:00+00:00"
}