{
  "url": "https://voxday.net/2013/08/08/a-fallen-atheis/",
  "scraped_at": "2025-12-14T22:38:07.919303",
  "title": "A fallen atheist",
  "date_display": "August 8, 2013",
  "date_iso": "2013-08-08T17:00:00+00:00",
  "date_from_url": "2013-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This self-described fallen atheist <a href=\"http://arnade.tumblr.com/post/57346559499/notes-of-a-fallen-atheist-part-2\">appears to have realized</a>, as a result of up close and personal experience with the weak and the broken, that kicking away the crutch upon which people are leaning is not the act of a brave intellectual or an honest seeker after truth.  Even if the crutch is an intellectual placebo.</p><p>It is the cruel and thoughtless act of a self-centered asshole:</p><blockquote class=\"tr_bq\"><p> I heard how<br> the small cross in Takeesha’s purse offered her protection when getting<br> into a strangers car. “When I climb into that car God comes with me and<br> keeps me safe.”</br></br></br></p><p> I heard how Neecy found the strength to try and find a better life in her Bible.</p><p> I heard how Michael’s Rosary “Was a reminder that there is something better than all of this.”<br>Soon I saw my atheism for what it is: An intellectual luxury for those who have done well.</br></p></blockquote><p>It isn’t a coincidence that the rise of the New Atheism coincided with the peak of the greatest credit boom in history.  And it isn’t an accident that the New Atheists are increasingly seen as intellectual embarrassments only five years into the Great Depression 2.0.</p><p>There is no shortage of scientific evidence that religion is, at worst, a placebo. Even if we assume that religion is entirely false, how can anyone who claims to possess any ethics, let alone superior and rationally determined ethics, possibly justify harming others by intentionally eliminating that placebo effect?</p></div>",
  "content_text": "This self-described fallen atheist\nappears to have realized\n, as a result of up close and personal experience with the weak and the broken, that kicking away the crutch upon which people are leaning is not the act of a brave intellectual or an honest seeker after truth.  Even if the crutch is an intellectual placebo.\nIt is the cruel and thoughtless act of a self-centered asshole:\nI heard how\nthe small cross in Takeesha’s purse offered her protection when getting\ninto a strangers car. “When I climb into that car God comes with me and\nkeeps me safe.”\nI heard how Neecy found the strength to try and find a better life in her Bible.\nI heard how Michael’s Rosary “Was a reminder that there is something better than all of this.”\nSoon I saw my atheism for what it is: An intellectual luxury for those who have done well.\nIt isn’t a coincidence that the rise of the New Atheism coincided with the peak of the greatest credit boom in history.  And it isn’t an accident that the New Atheists are increasingly seen as intellectual embarrassments only five years into the Great Depression 2.0.\nThere is no shortage of scientific evidence that religion is, at worst, a placebo. Even if we assume that religion is entirely false, how can anyone who claims to possess any ethics, let alone superior and rationally determined ethics, possibly justify harming others by intentionally eliminating that placebo effect?",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-08T16:00:00+00:00"
}