{
  "url": "https://voxday.net/2013/08/16/a-failure-of-gun-control_16/",
  "scraped_at": "2025-12-14T22:38:59.740306",
  "title": "A failure of gun control",
  "date_display": "August 16, 2013",
  "date_iso": "2013-08-16T06:00:00+00:00",
  "date_from_url": "2013-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The attempt to emotionally bludgeon Americans into supporting gun<br> control on the purported bodies of little kids has not only failed, <a href=\"http://www.nydailynews.com/news/national/request-gun-permits-double-newtown-connecticut-article-1.1426754\">but backfired entirely</a>:</br></p><blockquote class=\"tr_bq\"><p> Police said the<br> Connecticut town — where 26 students and six staffers were killed at<br> Sandy Hook Elementary School during gunman Adam Lanza’s massacre — has<br> already had 211 permit requests this year, a number far above the 171<br> requested in 2012 and the 99 in 2011.</br></br></br></br></p><p>There has been a<br> run on guns in the Connecticut town where a madman armed with a<br> Bushmaster assault rifle turned a grade school into a slaughterhouse.</br></br></p><p>Requests<br> for gun permits are on track to double this year over last year in<br> heartbroken Newtown, where 20 first-graders and six staffers were<br> massacred at Sandy Hook Elementary School last Dec. 14, police said.</br></br></br></p></blockquote><p>How deliciously ironic indeed. It<br> should be eminently clear that absolutely nothing is going to convince<br> Americans to disarm, not at a time where violent feral vibrants roam city streets in packs, Hispanic gangs are ethnically cleansing<br> entire cities one neighborhood at a time, the police are militarized, and agents from the<br> Department of Education and the Internal Revenue Service are armed<br> better than the average third-world army.</br></br></br></br></br></p><p>Granted, the average American has given his government a plethora of reasons to believe he is stupid, but Americans are not completely devoid of an instinct for self-preservation.</p></div>",
  "content_text": "The attempt to emotionally bludgeon Americans into supporting gun\ncontrol on the purported bodies of little kids has not only failed,\nbut backfired entirely\n:\nPolice said the\nConnecticut town — where 26 students and six staffers were killed at\nSandy Hook Elementary School during gunman Adam Lanza’s massacre — has\nalready had 211 permit requests this year, a number far above the 171\nrequested in 2012 and the 99 in 2011.\nThere has been a\nrun on guns in the Connecticut town where a madman armed with a\nBushmaster assault rifle turned a grade school into a slaughterhouse.\nRequests\nfor gun permits are on track to double this year over last year in\nheartbroken Newtown, where 20 first-graders and six staffers were\nmassacred at Sandy Hook Elementary School last Dec. 14, police said.\nHow deliciously ironic indeed. It\nshould be eminently clear that absolutely nothing is going to convince\nAmericans to disarm, not at a time where violent feral vibrants roam city streets in packs, Hispanic gangs are ethnically cleansing\nentire cities one neighborhood at a time, the police are militarized, and agents from the\nDepartment of Education and the Internal Revenue Service are armed\nbetter than the average third-world army.\nGranted, the average American has given his government a plethora of reasons to believe he is stupid, but Americans are not completely devoid of an instinct for self-preservation.",
  "tags": [
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-16T05:00:00+00:00"
}