{
  "url": "https://voxday.net/2013/08/11/a-lethally-unsafe-vaccine/",
  "scraped_at": "2025-12-14T22:38:29.715399",
  "title": "A lethally unsafe vaccine",
  "date_display": "August 11, 2013",
  "date_iso": "2013-08-11T19:55:00+00:00",
  "date_from_url": "2013-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Clinical equipoise notwithstanding, it should be interesting to see the anti-science vaccine extremists attempting to claim that “the lead researcher in the development of the human papilloma virus vaccines” doesn’t know anything about science or vaccines due to her expressed opinion concerning <a href=\"http://www.undergroundhealth.com/the-lead-vaccine-developer-comes-clean-so-she-can-sleep-at-night/?ModPagespeed=noscript\">the risk of adverse side effects </a>from the vaccine:</p><blockquote class=\"tr_bq\"><p> All trials of the vaccines were done on children aged 15 and above, despite them currently being marketed for 9-year-olds. So far, 15,037 girls have reported adverse side effects from Gardasil alone to the Vaccine Adverse Event Reporting System (V.A.E.R.S.), and this number only reflects parents who underwent the hurdles required for reporting adverse reactions.<br> At the time of writing, 44 girls are officially known to have died from these vaccines. The reported side effects include Guillian Barré Syndrome (paralysis lasting for years, or permanently — sometimes eventually causing suffocation), lupus, seizures, blood clots, and brain inflammation. Parents are usually not made aware of these risks.</br></p></blockquote><p>44 dead.  Notice how the trials were completely unsuitable for proving the safety of the vaccine for the age of the girls to whom it is being administered.</p><p>Vaccines are not magic, like everything else, they need to be subjected to a basic risk/reward analysis.  But the scientific community has not only failed to due its duty to provide the public with the necessary information to perform this analysis, it has clearly failed to inform the public of the risks even when they were known, and known to be potentially fatal.</p><p>Some vaccines are necessary for certain people at certain times.  Gardasil and Cervarix are not, and no parent with a teenage daughter should permit her to receive them.</p></div>",
  "content_text": "Clinical equipoise notwithstanding, it should be interesting to see the anti-science vaccine extremists attempting to claim that “the lead researcher in the development of the human papilloma virus vaccines” doesn’t know anything about science or vaccines due to her expressed opinion concerning\nthe risk of adverse side effects\nfrom the vaccine:\nAll trials of the vaccines were done on children aged 15 and above, despite them currently being marketed for 9-year-olds. So far, 15,037 girls have reported adverse side effects from Gardasil alone to the Vaccine Adverse Event Reporting System (V.A.E.R.S.), and this number only reflects parents who underwent the hurdles required for reporting adverse reactions.\nAt the time of writing, 44 girls are officially known to have died from these vaccines. The reported side effects include Guillian Barré Syndrome (paralysis lasting for years, or permanently — sometimes eventually causing suffocation), lupus, seizures, blood clots, and brain inflammation. Parents are usually not made aware of these risks.\n44 dead.  Notice how the trials were completely unsuitable for proving the safety of the vaccine for the age of the girls to whom it is being administered.\nVaccines are not magic, like everything else, they need to be subjected to a basic risk/reward analysis.  But the scientific community has not only failed to due its duty to provide the public with the necessary information to perform this analysis, it has clearly failed to inform the public of the risks even when they were known, and known to be potentially fatal.\nSome vaccines are necessary for certain people at certain times.  Gardasil and Cervarix are not, and no parent with a teenage daughter should permit her to receive them.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-11T18:55:00+00:00"
}