{
  "url": "https://voxday.net/2013/08/20/anti-racism-in-action/",
  "scraped_at": "2025-12-14T22:39:28.772769",
  "title": "Anti-racism in action",
  "date_display": "August 20, 2013",
  "date_iso": "2013-08-20T20:33:00+00:00",
  "date_from_url": "2013-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NK Jemison on <a href=\"http://nkjemisin.com/2013/06/continuum-goh-speech/\" rel=\"noopener\" target=\"_blank\">the dangers posed to vibrant Americans</a> by Australians:</p><blockquote class=\"tr_bq\"><p> “My father was afraid for me to come to Australia. He mostly made jokes about it — “Good, you’ve got dredlocks, maybe<br> they won’t think you’re Chinese”, stuff like that.  But I know my<br> father, and I know when the jokes have a serious undercurrent.  Now,<br> mind you, I travel alone all the time, and I’m not always traveling to<br> places that are friendly to Americans, or women, or black people…. I say all this so you will understand the context of my father’s fear, when I told him I was going to Australia.”</br></br></br></br></p></blockquote><p>The Associated Press on <a href=\"http://www.kjrh.com/dpp/news/state/police-teens-killed-australian-east-central-university-baseball-player-christopher-lane-for-fun#http://bit.ly/WjCMFG\" rel=\"noopener\" target=\"_blank\">the dangers posed to Australians</a> by vibrant Americans:</p><blockquote class=\"tr_bq\"><p> Two Oklahoma teens have been charged with first-degree murder in the<br> fatal shooting of an Australian baseball player, while a third player<br> has been named as an accessory. Christopher Lane was out for a<br> jog in an Oklahoma neighborhood when he was shot and killed by three<br> “bored” teenagers who decided to kill someone for fun, police said.</br></br></br></br></p></blockquote><p>How many innocent people have to die, murdered by vibrant Americans, before the non-vibrant stop trying to convince themselves that race does not exist, that all human sub-species behave exactly the same, and that forced desegregation is of material benefit to society?</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://resources2.news.com.au/images/2013/08/20/1226700/916806-b2161dcc-0982-11e3-affc-ced01c385700.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"180\" src=\"http://resources2.news.com.au/images/2013/08/20/1226700/916806-b2161dcc-0982-11e3-affc-ced01c385700.jpg\" width=\"320\"/></a></div><p>These murders and white-beatings by feral vibrants are not an accident.  They are anti-racism in action. This particular case also demonstrates how the Obama administration’s new vibrant dispersal plan is likely to have more negative consequences than most people think, as one Market Ticker commenter observes:</p><p><i>“Duncan, OK, according to Wiki, had a population of 22,505 as of the 2000<br> census, of which just 1.07% were black. So there were a grand total of<br> just over 225 blacks in the entire town, and here’s 3 of them just up<br> &amp; shooting someone for kicks.” </br></br></br></i></p><p>John Derbyshire was right.<i> </i></p></div>",
  "content_text": "NK Jemison on\nthe dangers posed to vibrant Americans\nby Australians:\n“My father was afraid for me to come to Australia. He mostly made jokes about it — “Good, you’ve got dredlocks, maybe\nthey won’t think you’re Chinese”, stuff like that.  But I know my\nfather, and I know when the jokes have a serious undercurrent.  Now,\nmind you, I travel alone all the time, and I’m not always traveling to\nplaces that are friendly to Americans, or women, or black people…. I say all this so you will understand the context of my father’s fear, when I told him I was going to Australia.”\nThe Associated Press on\nthe dangers posed to Australians\nby vibrant Americans:\nTwo Oklahoma teens have been charged with first-degree murder in the\nfatal shooting of an Australian baseball player, while a third player\nhas been named as an accessory. Christopher Lane was out for a\njog in an Oklahoma neighborhood when he was shot and killed by three\n“bored” teenagers who decided to kill someone for fun, police said.\nHow many innocent people have to die, murdered by vibrant Americans, before the non-vibrant stop trying to convince themselves that race does not exist, that all human sub-species behave exactly the same, and that forced desegregation is of material benefit to society?\nThese murders and white-beatings by feral vibrants are not an accident.  They are anti-racism in action. This particular case also demonstrates how the Obama administration’s new vibrant dispersal plan is likely to have more negative consequences than most people think, as one Market Ticker commenter observes:\n“Duncan, OK, according to Wiki, had a population of 22,505 as of the 2000\ncensus, of which just 1.07% were black. So there were a grand total of\njust over 225 blacks in the entire town, and here’s 3 of them just up\n& shooting someone for kicks.”\nJohn Derbyshire was right.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-20T19:33:00+00:00"
}