{
  "url": "https://voxday.net/2013/08/17/book-review-hard-magic_17/",
  "scraped_at": "2025-12-14T22:39:08.565659",
  "title": "Book review: Hard Magic",
  "date_display": "August 17, 2013",
  "date_iso": "2013-08-17T14:00:00+00:00",
  "date_from_url": "2013-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonathan Moeller <a href=\"http://www.jonathanmoeller.com/writer/?p=4088\">reviewed Hard Magic</a> by Larry Correia.</p><p>Based on the cover art, I picked up this book anticipating something<br> along the lines of THE DRESDEN FILES or GARRETT, P.I – you know, a<br> hardbitten private investigator solves crimes involving supernatural<br> creatures while dealing with the ever-evolving mess that is his personal<br> and/or love life. (Depending on the skill of the writer in question,<br> the series might eventually degenerate into an endless sequence of<br> werewolf-on-vampire romantic interludes.)</br></br></br></br></br></br></p><p>HARD MAGIC is <em>nothing</em> like that.</p><p><a href=\"http://www.sfsite.com/grc/1210/hmlg.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.sfsite.com/grc/1210/hmlg.jpg\" width=\"210\"/></a>It is speculative fiction in the purest sense of the word – changing<br> one element of human history or technology and asking “what if?” from<br> the question. In the case of this book, the premise is that in the<br> mid-19th century, humans started developing magical powers for unknown<br> reasons. As one might expect, this played havoc with quite a few<br> different aspects of human society – World War I was bad, but World War I<br> with zombies and fire wizards was <em>much worse</em>.</br></br></br></br></br></br></p><p>HARD MAGIC opens at the start of the Great Depression. Despite the<br> Depression, the world is at peace – Nikola Tesla figured out how to use<br> magic to build his fabled <a href=\"http://en.wikipedia.org/wiki/Teleforce\">teleforce Death Ray</a>,<br> and Tesla’ s “Peace Rays” have made war obsolete…or so claims the<br> government. Jake Sullivan, an ex-con with magical superstrength, is<br> recruited by the Bureau of Investigation (the precursor to the modern<br> FBI) to help bring down dangerous “Actives”, or magically empowered<br> individuals. Jake quickly realizes that the Bureau is in over its head –<br> in HARD MAGIC, Japan has been taken over by magic-using eugenic-minded<br> fascists, led by an ancient wizard who is determined to make humanity<br> stronger to face some unknown enemy…no matter how many people he has to<br> kill in the process.</br></br></br></br></br></br></br></br></br></br></br></p><p>Meanwhile, an unwanted girl named Faye, feared for her unusual<br> magical power of teleportation, grows up with her adoptive grandfather,<br> who also has the same power. One day when cars full of armed men show up<br> at her grandfather’s farm, Faye quickly realizes that Grandpa has a<br> secret…and a lot of people are willing to kill to get their hands on<br> that secret.</br></br></br></br></br></p><p>HARD MAGIC is chock-full of action, guns, adventure, and cool magical<br> powers. It’s also a fascinating piece of speculative fiction. How would<br> the use of magical powers shape human history? I especially liked the<br> quotes from historical figures at the start of each chapter, altered<br> slightly to contain the magical perspective. This also helps make the<br> villains particularly villainous – 20th century era eugenics were bad<br> enough, but magic-backed eugenics are even worse. (Also, there seems to<br> be an unwritten law of alternate history fiction that zeppelins must<br> make an appearance, and HARD MAGIC has zeppelins in spades.)</br></br></br></br></br></br></br></br></p><p>Definitely recommended, and I’ll be reading the sequel later this year.</p></div>",
  "content_text": "Jonathan Moeller\nreviewed Hard Magic\nby Larry Correia.\nBased on the cover art, I picked up this book anticipating something\nalong the lines of THE DRESDEN FILES or GARRETT, P.I – you know, a\nhardbitten private investigator solves crimes involving supernatural\ncreatures while dealing with the ever-evolving mess that is his personal\nand/or love life. (Depending on the skill of the writer in question,\nthe series might eventually degenerate into an endless sequence of\nwerewolf-on-vampire romantic interludes.)\nHARD MAGIC is\nnothing\nlike that.\nIt is speculative fiction in the purest sense of the word – changing\none element of human history or technology and asking “what if?” from\nthe question. In the case of this book, the premise is that in the\nmid-19th century, humans started developing magical powers for unknown\nreasons. As one might expect, this played havoc with quite a few\ndifferent aspects of human society – World War I was bad, but World War I\nwith zombies and fire wizards was\nmuch worse\n.\nHARD MAGIC opens at the start of the Great Depression. Despite the\nDepression, the world is at peace – Nikola Tesla figured out how to use\nmagic to build his fabled\nteleforce Death Ray\n,\nand Tesla’ s “Peace Rays” have made war obsolete…or so claims the\ngovernment. Jake Sullivan, an ex-con with magical superstrength, is\nrecruited by the Bureau of Investigation (the precursor to the modern\nFBI) to help bring down dangerous “Actives”, or magically empowered\nindividuals. Jake quickly realizes that the Bureau is in over its head –\nin HARD MAGIC, Japan has been taken over by magic-using eugenic-minded\nfascists, led by an ancient wizard who is determined to make humanity\nstronger to face some unknown enemy…no matter how many people he has to\nkill in the process.\nMeanwhile, an unwanted girl named Faye, feared for her unusual\nmagical power of teleportation, grows up with her adoptive grandfather,\nwho also has the same power. One day when cars full of armed men show up\nat her grandfather’s farm, Faye quickly realizes that Grandpa has a\nsecret…and a lot of people are willing to kill to get their hands on\nthat secret.\nHARD MAGIC is chock-full of action, guns, adventure, and cool magical\npowers. It’s also a fascinating piece of speculative fiction. How would\nthe use of magical powers shape human history? I especially liked the\nquotes from historical figures at the start of each chapter, altered\nslightly to contain the magical perspective. This also helps make the\nvillains particularly villainous – 20th century era eugenics were bad\nenough, but magic-backed eugenics are even worse. (Also, there seems to\nbe an unwritten law of alternate history fiction that zeppelins must\nmake an appearance, and HARD MAGIC has zeppelins in spades.)\nDefinitely recommended, and I’ll be reading the sequel later this year.",
  "tags": [
    "books",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-17T13:00:00+00:00"
}