{
  "url": "https://voxday.net/2013/08/26/bound-by-zero-hall-paper/",
  "scraped_at": "2025-12-14T22:40:06.316718",
  "title": "Bound by Zero: the Hall paper",
  "date_display": "August 26, 2013",
  "date_iso": "2013-08-26T13:00:00+00:00",
  "date_from_url": "2013-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like Karl Denninger, I found the conclusion of <a href=\"http://kansascityfed.org/publicat/sympos/2013/2013Hall.pdf\" rel=\"noopener\" target=\"_blank\">Fed economist Robert Hall’s paper</a> to be fascinating, both for what it did and did not say:</p><blockquote class=\"tr_bq\"><p> 4.4 The deflation nightmare</p><p>So far, inflation has fallen only slightly and remains in positive territory. Fears in early 2009 that rapid deflation might break out and cause the economy to collapse as in 1929 to 1933 proved unfounded, luckily. I have advanced the hypothesis that rampant price-cutting has failed to appear because businesses are in equilibrium and perceive that price-cutting has bigger costs than benefits. If the hypothesis is wrong and businesses are  finally responding to five years of slack by cutting prices, the generally optimistic tone of this section could be quite mistaken. The bottom could fall out of the economy as it did in the Great Depression.</p><p>5 Concluding Remarks</p><p>The central danger in the next two years is that the Fed will yield to the intensifying pressure to raise interest rates and contract its portfolio well before the economy is back to normal. The worst step the Fed could take would be to raise the interest rate it pays on reserves. The analysis of this paper focusing on the zero lower bound applies equally to a reserve rate above zero. Every percentage point increase in the reserve rate drives the real interest rate up and contracts the economy by the principles discussed here.</p><p>With respect to policies that might lower the probability of a repetition of the multi-trillion dollar disaster of the past  five years, it is true that a policy of higher chronic inflation would have given monetary policy more headroom for expansion to counteract the decline in output demand and to prevent it from causing a decline in output. But I see that response as distinctly second-best. Much preferable are policies to maintain a robust financial system that responds smoothly to declines in real-estate prices. Requiring more capital in fi nancial institutions is an important part of good policy, but to determine the amount of capital, there is no substitute in a modern  financial system for frequent and rigorous stress-testing.</p><p>Derivatives create exposures that are not recorded as leverage, but are fully apparent in stress tests. With a stable, bullet-proof fi nancial system, policies of low inflation are quite safe.</p></blockquote><p>I have explained, repeatedly, why we haven’t seen deflation set in yet.  Credit is still expanding, only at a rate insufficient to provide for either economic growth or private sector jobs. Sans the 114% increase in Federal sector debt and the over the last five years, instead of credit disinflation we would have seen actual deflation.   There are no signs that either the 7% decline in Household debt or 20% decline in Financial sector debt are going to change, so the federal government has no choice but to keep <i>doubling its spending</i> every four years just to hold its ground.</p><p>Unsurprisingly, lacking any model to account for credit, Paul Krugman <a href=\"http://krugman.blogs.nytimes.com/2013/08/25/unnatural-models-of-the-labor-market-wonkish/?_r=0\" rel=\"noopener\" target=\"_blank\">isn’t quite sure</a> exactly what to make of it. But I suspect Hall knows better, which is why he admits that if his hypothesis is wrong, “the generally optimistic tone of this section could be quite mistaken”.</p><p>It is mistaken. Other than idiot college students who don’t know any better and whose debt servitude is guaranteed by the government, do you know anyone who is increasing their debt?</p><p>This problem of the Zero Bound was long predicted by every economist who warned of the impossibility of “pushing on a string”.  Cutting interest rates can stimulate borrowing, and the subsequent creation of credit, until they cannot be cut anymore.  I, and numerous others, pointed this out, but the Krugmans of the world argued that the Zero Bound was not binding.</p><p>But eventually, the long run always arrives.  Everyone wants to know exactly when the economy will hit the ground towards which it is falling, but I can’t say because that depends upon how long the Fed and the Federal government are willing to try to keep trying to flap their arms instead of bracing for impact.</p></div>",
  "content_text": "Like Karl Denninger, I found the conclusion of\nFed economist Robert Hall’s paper\nto be fascinating, both for what it did and did not say:\n4.4 The deflation nightmare\nSo far, inflation has fallen only slightly and remains in positive territory. Fears in early 2009 that rapid deflation might break out and cause the economy to collapse as in 1929 to 1933 proved unfounded, luckily. I have advanced the hypothesis that rampant price-cutting has failed to appear because businesses are in equilibrium and perceive that price-cutting has bigger costs than benefits. If the hypothesis is wrong and businesses are  finally responding to five years of slack by cutting prices, the generally optimistic tone of this section could be quite mistaken. The bottom could fall out of the economy as it did in the Great Depression.\n5 Concluding Remarks\nThe central danger in the next two years is that the Fed will yield to the intensifying pressure to raise interest rates and contract its portfolio well before the economy is back to normal. The worst step the Fed could take would be to raise the interest rate it pays on reserves. The analysis of this paper focusing on the zero lower bound applies equally to a reserve rate above zero. Every percentage point increase in the reserve rate drives the real interest rate up and contracts the economy by the principles discussed here.\nWith respect to policies that might lower the probability of a repetition of the multi-trillion dollar disaster of the past  five years, it is true that a policy of higher chronic inflation would have given monetary policy more headroom for expansion to counteract the decline in output demand and to prevent it from causing a decline in output. But I see that response as distinctly second-best. Much preferable are policies to maintain a robust financial system that responds smoothly to declines in real-estate prices. Requiring more capital in fi nancial institutions is an important part of good policy, but to determine the amount of capital, there is no substitute in a modern  financial system for frequent and rigorous stress-testing.\nDerivatives create exposures that are not recorded as leverage, but are fully apparent in stress tests. With a stable, bullet-proof fi nancial system, policies of low inflation are quite safe.\nI have explained, repeatedly, why we haven’t seen deflation set in yet.  Credit is still expanding, only at a rate insufficient to provide for either economic growth or private sector jobs. Sans the 114% increase in Federal sector debt and the over the last five years, instead of credit disinflation we would have seen actual deflation.   There are no signs that either the 7% decline in Household debt or 20% decline in Financial sector debt are going to change, so the federal government has no choice but to keep\ndoubling its spending\nevery four years just to hold its ground.\nUnsurprisingly, lacking any model to account for credit, Paul Krugman\nisn’t quite sure\nexactly what to make of it. But I suspect Hall knows better, which is why he admits that if his hypothesis is wrong, “the generally optimistic tone of this section could be quite mistaken”.\nIt is mistaken. Other than idiot college students who don’t know any better and whose debt servitude is guaranteed by the government, do you know anyone who is increasing their debt?\nThis problem of the Zero Bound was long predicted by every economist who warned of the impossibility of “pushing on a string”.  Cutting interest rates can stimulate borrowing, and the subsequent creation of credit, until they cannot be cut anymore.  I, and numerous others, pointed this out, but the Krugmans of the world argued that the Zero Bound was not binding.\nBut eventually, the long run always arrives.  Everyone wants to know exactly when the economy will hit the ground towards which it is falling, but I can’t say because that depends upon how long the Fed and the Federal government are willing to try to keep trying to flap their arms instead of bracing for impact.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-26T12:00:00+00:00"
}