{
  "url": "https://voxday.net/2013/08/12/bryan-caplan-and-open-borders-movemen/",
  "scraped_at": "2025-12-14T22:38:32.534750",
  "title": "Bryan Caplan and the Open Borders movement",
  "date_display": "August 12, 2013",
  "date_iso": "2013-08-12T07:33:00+00:00",
  "date_from_url": "2013-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it remarkable that the image below is what the U.S. Chamber of Commerce thinks passes for a pro-immigration image.<br> <a href=\"http://www.freeenterprise.com/sites/default/files/styles/large/public/media/00_IMMI_60894820_marching_659px_0.jpg?itok=NT62uKiN\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"213\" src=\"http://www.freeenterprise.com/sites/default/files/styles/large/public/media/00_IMMI_60894820_marching_659px_0.jpg?itok=NT62uKiN\" width=\"320\"/></a>In the meantime, the quasi-libertarian economist Bryan Caplan is demonstrating that he can’t follow the basic logic of domestic free trade or understand the consequences of the free movement of international labor as the Open Borders movement searches for a logo.  <a href=\"http://isteve.blogspot.com/search/label/Open%20Borders\">Steve Sailer has compiled a number of them</a> that are nearly as bad as the Chamber of Commerce’s entry.</br></p><p><i>“The Open Borders movement seeks a symbol that embodies the spirit of<br> free migration. To achieve that goal, we are sponsoring a logo contest.<br> The winner of this contest will get $200 and their design will become<br> the official logo of the Open Borders web site.”</br></br></br></i></p><p>Lacking any graphic talent, I shall refrain from attempting to create one myself, although I would certainly encourage the Dread Ilk to do so if anyone is so inclined.  Instead, I would invite Mr. Caplan to attempt to rebut my argument that an Open Borders regime will force <a href=\"http://www.milobookclub.com/2012/08/01/gary-north-still-hates-americans/\">the international emigration of more than 40 percent of Americans before they turn 35</a>.  I should also like to see him address the fact that this forced economic migration is desired by influential statists specifically in order to <a href=\"http://www.milobookclub.com/2012/08/20/free-trade-and-undermining-of-nations/\">“undermine the “homogeneity of its member states”</a>.</p><p>It is very important to understand that Open Borders movement seeks nothing less than the destruction of the nation-state in the name of the global economy.  This extreme Free Trade doctrine necessarily requires the end of the Jewish state of Israel, the end of the U.S. Constitution, and the demolition of the chief structural obstacle to global dictatorship. Open Borders and the Free Trade argument can be best understood as the European Common Market scheme writ large; it is the economic bait for global political integration.</p><p>The current immigration reform bill is the completion of the American national suicide that began with the Immigration and Nationality Act of 1965 and was proposed by the grandson of Jewish immigrants, sponsored by the grandson of Irish immigrants, and publicly championed by another grandson of Irish immigrants.  Thus demonstrating that even when they are superficially integrated, second- and third-generation immigrants tend to act against the interests of the nations their parents and grandparents invaded.</p></div>",
  "content_text": "I find it remarkable that the image below is what the U.S. Chamber of Commerce thinks passes for a pro-immigration image.\nIn the meantime, the quasi-libertarian economist Bryan Caplan is demonstrating that he can’t follow the basic logic of domestic free trade or understand the consequences of the free movement of international labor as the Open Borders movement searches for a logo.\nSteve Sailer has compiled a number of them\nthat are nearly as bad as the Chamber of Commerce’s entry.\n“The Open Borders movement seeks a symbol that embodies the spirit of\nfree migration. To achieve that goal, we are sponsoring a logo contest.\nThe winner of this contest will get $200 and their design will become\nthe official logo of the Open Borders web site.”\nLacking any graphic talent, I shall refrain from attempting to create one myself, although I would certainly encourage the Dread Ilk to do so if anyone is so inclined.  Instead, I would invite Mr. Caplan to attempt to rebut my argument that an Open Borders regime will force\nthe international emigration of more than 40 percent of Americans before they turn 35\n.  I should also like to see him address the fact that this forced economic migration is desired by influential statists specifically in order to\n“undermine the “homogeneity of its member states”\n.\nIt is very important to understand that Open Borders movement seeks nothing less than the destruction of the nation-state in the name of the global economy.  This extreme Free Trade doctrine necessarily requires the end of the Jewish state of Israel, the end of the U.S. Constitution, and the demolition of the chief structural obstacle to global dictatorship. Open Borders and the Free Trade argument can be best understood as the European Common Market scheme writ large; it is the economic bait for global political integration.\nThe current immigration reform bill is the completion of the American national suicide that began with the Immigration and Nationality Act of 1965 and was proposed by the grandson of Jewish immigrants, sponsored by the grandson of Irish immigrants, and publicly championed by another grandson of Irish immigrants.  Thus demonstrating that even when they are superficially integrated, second- and third-generation immigrants tend to act against the interests of the nations their parents and grandparents invaded.",
  "tags": [
    "free trade",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-12T06:33:00+00:00"
}