{
  "url": "https://voxday.net/2013/08/15/cease-and-desis/",
  "scraped_at": "2025-12-14T22:38:57.923693",
  "title": "Cease and desist",
  "date_display": "August 15, 2013",
  "date_iso": "2013-08-15T20:00:00+00:00",
  "date_from_url": "2013-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Shermer’s lawyers ordered PZ Myers to immediately retract <a href=\"http://freethoughtblogs.com/pharyngula/2013/08/08/what-do-you-do-when-someone-pulls-the-pin-and-hands-you-a-grenade/\">his public allegations of rape</a> at a science conference, but based on the fact that no retraction has yet been made, it appears PZ intends to ride or die with the unidentified accuser.</p><blockquote class=\"tr_bq\"><p> This firm represents Michael Shermer. It recently has come to our attention that you have made, published, broadcasted, and are continuing to publish and broadcast on your blog numerous false, defamatory, libelous, inaccurate, and/or misleading statements about Mr. Shermer.</p><p>We are informed that on or about August 8, 2013, you authored and posted an entry on your blog entitled <a href=\"http://freethoughtblogs.com/pharyngula/2013/08/08/what-do-you-do-when-someone-pulls-the-pin-and-hands-you-a-grenade/\">What do you do when someone pulls the pin and hands you a grenade?</a> The Entry contains numerous false and defamatory statements about Mr. Shermer based on certain unsubstantiated allegations purportedly made by an unidentified woman against Mr. Shermer….</p><p>As you are the author of one of the most popular science blogs in the World Wide Web, we find your self-proclaimed intentions “to do the right thing” by publishing unproven and unsubstantiated allegations of forced or nonconsensual sexual intercourse against Mr. Shermer to be outrageous and inexcusable.  It is not accident that the Entry containing these extremely inflammatory and defamatory statements about Mr. Shermer has garnered your blog the highest number of comments of any entry in the history of your entire Blog and you clearly stand to benefit substantially from the posting of these unsubstantiated allegations against Mr. Shermer, all while under the appearance that you have some higher ethical purpose for doing so. Clearly, no matter how reasonably foreseeable it is that your actions would result in serious harm to Mr. Shermer’s name, reputation, and character in the science community, you have chosen to injure and humiliate Mr. Shermer by publishing and posting defamatory statements and comments about him.</p></blockquote><p>Here is <a href=\"http://www.voxday.net/mart/shermer_letter.pdf\">the entire letter</a> in PDF form. What a pity this was a science conference instead of a science fiction one, or the SFWA’s Pink Gestapo could have waddled to the rescue.</p><p>I have absolutely no idea what did or did not happen, but based on the sort of women who attend science conferences and hang out with atheists, I would be very, very leery about putting too much confidence in a secondhand version of events.</p><p>First Hugo Danger, then PZ/Shermer. One would assume McRapey’s inevitable meltdown is lurking on the horizon. However, I don’t think he’ll be the next SFWA member accused of sexual assault at a conference. My money is on Jim Hines, aka McCreepy.  His volunteer counseling reminds me of the elementary school teacher with the mustache who is always pestering parents to let him take their little boys camping with him.</p><p>At this point, I find it hard to believe that any men risk attending conferences where there are going to be a lumpening of avowedly feminist women. It strikes me as playing Russian Roulette with three bullets in the chamber; these women are absolutely dying to be able to cry harassment and tell the story of their victimization for the rest of their lives.</p></div>",
  "content_text": "Michael Shermer’s lawyers ordered PZ Myers to immediately retract\nhis public allegations of rape\nat a science conference, but based on the fact that no retraction has yet been made, it appears PZ intends to ride or die with the unidentified accuser.\nThis firm represents Michael Shermer. It recently has come to our attention that you have made, published, broadcasted, and are continuing to publish and broadcast on your blog numerous false, defamatory, libelous, inaccurate, and/or misleading statements about Mr. Shermer.\nWe are informed that on or about August 8, 2013, you authored and posted an entry on your blog entitled\nWhat do you do when someone pulls the pin and hands you a grenade?\nThe Entry contains numerous false and defamatory statements about Mr. Shermer based on certain unsubstantiated allegations purportedly made by an unidentified woman against Mr. Shermer….\nAs you are the author of one of the most popular science blogs in the World Wide Web, we find your self-proclaimed intentions “to do the right thing” by publishing unproven and unsubstantiated allegations of forced or nonconsensual sexual intercourse against Mr. Shermer to be outrageous and inexcusable.  It is not accident that the Entry containing these extremely inflammatory and defamatory statements about Mr. Shermer has garnered your blog the highest number of comments of any entry in the history of your entire Blog and you clearly stand to benefit substantially from the posting of these unsubstantiated allegations against Mr. Shermer, all while under the appearance that you have some higher ethical purpose for doing so. Clearly, no matter how reasonably foreseeable it is that your actions would result in serious harm to Mr. Shermer’s name, reputation, and character in the science community, you have chosen to injure and humiliate Mr. Shermer by publishing and posting defamatory statements and comments about him.\nHere is\nthe entire letter\nin PDF form. What a pity this was a science conference instead of a science fiction one, or the SFWA’s Pink Gestapo could have waddled to the rescue.\nI have absolutely no idea what did or did not happen, but based on the sort of women who attend science conferences and hang out with atheists, I would be very, very leery about putting too much confidence in a secondhand version of events.\nFirst Hugo Danger, then PZ/Shermer. One would assume McRapey’s inevitable meltdown is lurking on the horizon. However, I don’t think he’ll be the next SFWA member accused of sexual assault at a conference. My money is on Jim Hines, aka McCreepy.  His volunteer counseling reminds me of the elementary school teacher with the mustache who is always pestering parents to let him take their little boys camping with him.\nAt this point, I find it hard to believe that any men risk attending conferences where there are going to be a lumpening of avowedly feminist women. It strikes me as playing Russian Roulette with three bullets in the chamber; these women are absolutely dying to be able to cry harassment and tell the story of their victimization for the rest of their lives.",
  "tags": [
    "atheism",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-15T19:00:00+00:00"
}