{
  "url": "https://voxday.net/2013/08/19/credit-and-price-inflation/",
  "scraped_at": "2025-12-14T22:39:15.909880",
  "title": "Credit and price inflation",
  "date_display": "August 19, 2013",
  "date_iso": "2013-08-19T08:25:00+00:00",
  "date_from_url": "2013-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger understands <a href=\"http://market-ticker.org/akcs-www?post=223699\" rel=\"noopener\" target=\"_blank\">the intrinsic connection</a> between the two:</p><blockquote class=\"tr_bq\"><p> The availability of “cheap credit” has made everything from houses to furniture to TVs to cell phones to cars more expensive.  Virtually everyone shops a “payment” now instead of a price. </p><p>Why else would you hear all the car dealers telling you how they can get you into a new car for “two-ninety-nine!” instead of telling you the price is $24,923? </p><p>That’s simple — everyone buys a payment.</p><p>House — same deal.  Do you qualify for a house or for a payment? You know the answer — and the big scam nowdays (and has been for the last decade) is finding ways to get around the down payment — actual cash on the table has been reduced to record lows, with the goal for many being zero.</p><p>Then there’s student loans, as Taibbi recently went off on and which I’ve been covering for years.  They are alleged to make college “more accessible.”  Nonsense; what they do is enslave young people who are our most-vulnerable due to lack of life experience and being that these debts cannot be discharged except under extraordinary circumstance they’re one of the worst forms of debt slavery.</p><p>The truth is that the basic laws of economics tell you that when there are more buyers willing to pay a given price irrespective of how or why the price of that item will tend to rise.  This is true whether the thing is a car, a house, health care, college tuition or anything else.</p><p>Ultimately this forces anyone who wants said thing to use credit to obtain it as the ability to pay cash dwindles away.</p><p>And that, ultimately, destroys the middle class by making the true cost of such pulled-forward demand rise so high that it cannot be afforded at all.</p><p>So long as the government coerces this behavior for its own benefit so it can hand out money to its favored few, whether those be “poor” people (with iPhones of course) or defense contractors this cycle continues until it is either voluntarily abandoned or it is forced to stop by impact with the zero boundary.</p></blockquote><p>“Impact with the zero boundary” is exactly what I described in my <a href=\"http://www.milobookclub.com/2009/06/18/limits-of-demand/\" rel=\"noopener\" target=\"_blank\">“limits of demand”</a> in which I suggested an alternative mechanism for the Austrian Business Cycle. This points to the core flaw of the inflationista perspective, which is that even if the government prints an unlimited amount of money, it still has to somehow get into the hands of the people who are going to spend it on goods and services.</p><p>The federal government does an amount of this through its income transfer programs, which are now better understood as distributed inflation programs. The problem is that the very act of distribution tends to reduce the willingness of the recipients to do anything productive, as could be seen in this Rattlife clip from Fox News.  And the horrified tone of the reporter explains why significantly expanding these programs is politically untenable; keep in mind they would need to increase by a factor of more than TWENTY in order to compensate for five years of credit disinflation.</p><p>That leaves expanding the credit base as the other option, which is precisely what the Federal Reserve has been trying to do.  But here it runs into the “pushing on a string” problem due to its inability to print more borrowers.  It’s not so much that the banks won’t lend as the banks can’t find anyone credible to lend to as about 40 percent of the loans they are presently holding are already in default.</p><p>About the only thing the federal government can do at this point is expand its student loan guarantees to the home mortgage and credit card markets. However, that terrifies Fed officials, who are already looking at the fact that only 10.8 million of the 28 million federal student loan borrowers in the US <a href=\"http://www.zerohedge.com/news/2013-08-06/only-40-federal-student-loan-borrowers-are-currently-making-payment\" rel=\"noopener\" target=\"_blank\">are making any payments</a> on their student loans.</p><p>Which points to the quasi-Soviet nature of the problem where the federal government pretends to give money to banks to lend out to borrowers and the borrowers pretend they are going to pay it back. Expanding the sham to mortgages and credit cards may buy a little more time, but it’s not going to fix anything. It is certainly not a credible basis for economic growth.</p></div>",
  "content_text": "Karl Denninger understands\nthe intrinsic connection\nbetween the two:\nThe availability of “cheap credit” has made everything from houses to furniture to TVs to cell phones to cars more expensive.  Virtually everyone shops a “payment” now instead of a price.\nWhy else would you hear all the car dealers telling you how they can get you into a new car for “two-ninety-nine!” instead of telling you the price is $24,923?\nThat’s simple — everyone buys a payment.\nHouse — same deal.  Do you qualify for a house or for a payment? You know the answer — and the big scam nowdays (and has been for the last decade) is finding ways to get around the down payment — actual cash on the table has been reduced to record lows, with the goal for many being zero.\nThen there’s student loans, as Taibbi recently went off on and which I’ve been covering for years.  They are alleged to make college “more accessible.”  Nonsense; what they do is enslave young people who are our most-vulnerable due to lack of life experience and being that these debts cannot be discharged except under extraordinary circumstance they’re one of the worst forms of debt slavery.\nThe truth is that the basic laws of economics tell you that when there are more buyers willing to pay a given price irrespective of how or why the price of that item will tend to rise.  This is true whether the thing is a car, a house, health care, college tuition or anything else.\nUltimately this forces anyone who wants said thing to use credit to obtain it as the ability to pay cash dwindles away.\nAnd that, ultimately, destroys the middle class by making the true cost of such pulled-forward demand rise so high that it cannot be afforded at all.\nSo long as the government coerces this behavior for its own benefit so it can hand out money to its favored few, whether those be “poor” people (with iPhones of course) or defense contractors this cycle continues until it is either voluntarily abandoned or it is forced to stop by impact with the zero boundary.\n“Impact with the zero boundary” is exactly what I described in my\n“limits of demand”\nin which I suggested an alternative mechanism for the Austrian Business Cycle. This points to the core flaw of the inflationista perspective, which is that even if the government prints an unlimited amount of money, it still has to somehow get into the hands of the people who are going to spend it on goods and services.\nThe federal government does an amount of this through its income transfer programs, which are now better understood as distributed inflation programs. The problem is that the very act of distribution tends to reduce the willingness of the recipients to do anything productive, as could be seen in this Rattlife clip from Fox News.  And the horrified tone of the reporter explains why significantly expanding these programs is politically untenable; keep in mind they would need to increase by a factor of more than TWENTY in order to compensate for five years of credit disinflation.\nThat leaves expanding the credit base as the other option, which is precisely what the Federal Reserve has been trying to do.  But here it runs into the “pushing on a string” problem due to its inability to print more borrowers.  It’s not so much that the banks won’t lend as the banks can’t find anyone credible to lend to as about 40 percent of the loans they are presently holding are already in default.\nAbout the only thing the federal government can do at this point is expand its student loan guarantees to the home mortgage and credit card markets. However, that terrifies Fed officials, who are already looking at the fact that only 10.8 million of the 28 million federal student loan borrowers in the US\nare making any payments\non their student loans.\nWhich points to the quasi-Soviet nature of the problem where the federal government pretends to give money to banks to lend out to borrowers and the borrowers pretend they are going to pay it back. Expanding the sham to mortgages and credit cards may buy a little more time, but it’s not going to fix anything. It is certainly not a credible basis for economic growth.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-19T07:25:00+00:00"
}