{
  "url": "https://voxday.net/2013/08/20/ensnaring-sophists/",
  "scraped_at": "2025-12-14T22:39:26.935708",
  "title": "Ensnaring the sophists",
  "date_display": "August 20, 2013",
  "date_iso": "2013-08-20T17:00:00+00:00",
  "date_from_url": "2013-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There was an interesting synchronicity between one of McRapey’s recent tweets and a text from the <i>Organon </i>that I was reading at the gym yesterday.</p><blockquote class=\"tr_bq\"><p> <b class=\"fullname js-action-profile-name show-popup-with-id\"></b><a class=\"account-group js-account-group js-action-profile js-user-profile-link js-nav\" data-user-id=\"14202817\" href=\"https://twitter.com/scalzi\"><b class=\"fullname js-action-profile-name show-popup-with-id\">John Scalzi</b><br> ‏<s>@</s><b>scalzi</b><br> </br></br></a><br> <a class=\"tweet-timestamp js-permalink js-nav\" href=\"https://twitter.com/scalzi/status/368183063563337728\" title=\"11:30 PM - 15 Aug 13\">15 Aug</a><br/></br></p><div class=\"js-tweet-text tweet-text\"> It’s interesting how many people clearly think they can argue well, who in fact can’t argue their way out of a paper bag.</div></blockquote><div class=\"js-tweet-text tweet-text\"> I found his characteristically self-inflating implication to be more than a little amusing there, coming as it does from an individual who makes habitual use of the sophistical tactic that Aristotle described in <i>De sophisticis elenchis</i> as “ambiguity”, and, when called on it, once tried to justify its use because “a degree in philosophy from the University of Chicago”.  I imagine the educated reader can identify the logical fallacy there.<p>Now, it’s probably true that a lot number of people overrate their ability to argue; I may have helped a few of them better understand the effective limits of their ability right here on this blog. But at the end of the day, it doesn’t really matter what one thinks of one’s own ability to argue, what matters is what those who have actually observed one’s arguments think of them.</p><p>In any event, what I find more interesting than a perfectly normal inability to correctly self-assess is how most people are completely unable to expose false arguments despite the fact that the tools for doing so have been readily available for literally thousands of years.<i> </i></p><p><i>Rhetoric </i>may be a little complicated for some to follow, but <i>On Sophistical Refutations</i> is relatively straightforward, it’s short, and it is well worth reading as it specifically identifies a number of basic tactics that are repeatedly utilized by those who are presenting invalid arguments, or as is often the case, presenting a false refutation of another’s argument.</p><blockquote class=\"tr_bq\"><p>  “Those ways of producing the false appearance of an argument which depend on language are six in number: they are ambiguity, amphiboly, combination, division of words, accent, form of expression. Of this we may assure ourselves both by induction, and by syllogistic proof based on this-and it may be on other assumptions as well-that this is the number of ways in which we might fall to mean the same thing by the same names or expressions.</p><p>“Arguments such as the following depend upon ambiguity. ‘Those learn who know: for it is those who know their letters who learn the letters dictated to them’. For to ‘learn’ is ambiguous; it signifies both ‘to understand’ by the use of knowledge, and also ‘to acquire knowledge’. Again, ‘Evils are good: for what needs to be is good, and evils must needs be’. For ‘what needs to be’ has a double meaning: it means what is inevitable, as often is the case with evils, too (for evil of some kind is inevitable), while on the other hand we say of good things as well that they ‘need to be’. Moreover, ‘The same man is both seated and standing and he is both sick and in health: for it is he who stood up who is standing, and he who is recovering who is in health: but it is the seated man who stood up, and the sick man who was recovering’. For ‘The sick man does so and so’, or ‘has so and so done to him’ is not single in meaning: sometimes it means ‘the man who is sick or is seated now’, sometimes ‘the man who was sick formerly’.</p><p>“Of course, the man who was recovering was the sick man, who really was sick at the time: but the man who is in health is not sick at the same time: he is ‘the sick man’ in the sense not that he is sick now, but that he was sick formerly.”</p></blockquote></div><p>Aristotelian ambiguity is a tactic that is often used by sophistical interlocutors by claiming the right to assign to their opponent the only possible meaning of a word that the opponent has used, even when the other meanings of that word are much more readily applicable and the opponent has declared that the assigned meaning was not the meaning utilized.  The fact that this requires both a) mind-reading, and, b) the opponent’s ignorance of his own word-choice seldom slows the sophistical leftist down.</p><p>But then, Aristotle understood that for some people, the perception, (50,000 claimed daily blog readers), is much more important than the reality, (4,000 actual daily blog readers).</p><p><i>“Now for some people it is better worth while to seem to be wise, than to be wise without seeming to be (for the art of the sophist is the semblance of wisdom without the reality, and the sophist is one who makes money from an apparent but unreal wisdom); for them, then, it is clearly essential also to seem to accomplish the task of a wise man rather than to accomplish it without seeming to do so.”</i></p><p>It’s worth noting that sophists who favor ambiguity-based refutations are extremely vulnerable to having their<br> tactics used against them.  By<br> intentionally utilizing a word that has multiple definitions, including some<br> that are less than helpful to your case, you can be certain that the sophist will<br> latch onto the definition they perceive to be damaging to your argument and<br> thereby leap eagerly into the trap. He will do so because his objective in an argument<br> is usually focused on disqualifying his opponent in the eyes of the crowd rather than in genuinely refuting his opponent’s argument<i>.</i></br></br></br></br></br></br></p></div>",
  "content_text": "There was an interesting synchronicity between one of McRapey’s recent tweets and a text from the\nOrganon\nthat I was reading at the gym yesterday.\nJohn Scalzi\n‏\n@\nscalzi\n15 Aug\nIt’s interesting how many people clearly think they can argue well, who in fact can’t argue their way out of a paper bag.\nI found his characteristically self-inflating implication to be more than a little amusing there, coming as it does from an individual who makes habitual use of the sophistical tactic that Aristotle described in\nDe sophisticis elenchis\nas “ambiguity”, and, when called on it, once tried to justify its use because “a degree in philosophy from the University of Chicago”.  I imagine the educated reader can identify the logical fallacy there.\nNow, it’s probably true that a lot number of people overrate their ability to argue; I may have helped a few of them better understand the effective limits of their ability right here on this blog. But at the end of the day, it doesn’t really matter what one thinks of one’s own ability to argue, what matters is what those who have actually observed one’s arguments think of them.\nIn any event, what I find more interesting than a perfectly normal inability to correctly self-assess is how most people are completely unable to expose false arguments despite the fact that the tools for doing so have been readily available for literally thousands of years.\nRhetoric\nmay be a little complicated for some to follow, but\nOn Sophistical Refutations\nis relatively straightforward, it’s short, and it is well worth reading as it specifically identifies a number of basic tactics that are repeatedly utilized by those who are presenting invalid arguments, or as is often the case, presenting a false refutation of another’s argument.\n“Those ways of producing the false appearance of an argument which depend on language are six in number: they are ambiguity, amphiboly, combination, division of words, accent, form of expression. Of this we may assure ourselves both by induction, and by syllogistic proof based on this-and it may be on other assumptions as well-that this is the number of ways in which we might fall to mean the same thing by the same names or expressions.\n“Arguments such as the following depend upon ambiguity. ‘Those learn who know: for it is those who know their letters who learn the letters dictated to them’. For to ‘learn’ is ambiguous; it signifies both ‘to understand’ by the use of knowledge, and also ‘to acquire knowledge’. Again, ‘Evils are good: for what needs to be is good, and evils must needs be’. For ‘what needs to be’ has a double meaning: it means what is inevitable, as often is the case with evils, too (for evil of some kind is inevitable), while on the other hand we say of good things as well that they ‘need to be’. Moreover, ‘The same man is both seated and standing and he is both sick and in health: for it is he who stood up who is standing, and he who is recovering who is in health: but it is the seated man who stood up, and the sick man who was recovering’. For ‘The sick man does so and so’, or ‘has so and so done to him’ is not single in meaning: sometimes it means ‘the man who is sick or is seated now’, sometimes ‘the man who was sick formerly’.\n“Of course, the man who was recovering was the sick man, who really was sick at the time: but the man who is in health is not sick at the same time: he is ‘the sick man’ in the sense not that he is sick now, but that he was sick formerly.”\nAristotelian ambiguity is a tactic that is often used by sophistical interlocutors by claiming the right to assign to their opponent the only possible meaning of a word that the opponent has used, even when the other meanings of that word are much more readily applicable and the opponent has declared that the assigned meaning was not the meaning utilized.  The fact that this requires both a) mind-reading, and, b) the opponent’s ignorance of his own word-choice seldom slows the sophistical leftist down.\nBut then, Aristotle understood that for some people, the perception, (50,000 claimed daily blog readers), is much more important than the reality, (4,000 actual daily blog readers).\n“Now for some people it is better worth while to seem to be wise, than to be wise without seeming to be (for the art of the sophist is the semblance of wisdom without the reality, and the sophist is one who makes money from an apparent but unreal wisdom); for them, then, it is clearly essential also to seem to accomplish the task of a wise man rather than to accomplish it without seeming to do so.”\nIt’s worth noting that sophists who favor ambiguity-based refutations are extremely vulnerable to having their\ntactics used against them.  By\nintentionally utilizing a word that has multiple definitions, including some\nthat are less than helpful to your case, you can be certain that the sophist will\nlatch onto the definition they perceive to be damaging to your argument and\nthereby leap eagerly into the trap. He will do so because his objective in an argument\nis usually focused on disqualifying his opponent in the eyes of the crowd rather than in genuinely refuting his opponent’s argument\n.",
  "tags": [
    "McRapey",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-20T16:00:00+00:00"
}