{
  "url": "https://voxday.net/2013/08/19/explaining-flynn-effec/",
  "scraped_at": "2025-12-14T22:39:21.398406",
  "title": "Explaining the Flynn Effect",
  "date_display": "August 19, 2013",
  "date_iso": "2013-08-19T20:00:00+00:00",
  "date_from_url": "2013-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think <a href=\"http://news.yahoo.com/obama-math-under-common-core-3-x-4-151805230.html\" rel=\"noopener\" target=\"_blank\">this philosophy of testing</a> may explain the dichotomy between the fact that people are getting progressively more intelligent according to IQ tests while becoming observably more stupid in terms of their behavior:</p><blockquote class=\"tr_bq\"><p> In a pretty amazing YouTube video, Amanda August, a curriculum<br> coordinator in a suburb of Chicago called Grayslake, explains that<br> getting the right answer in math just doesn’t matter as long as kids can<br> explain the necessarily faulty reasoning they used to get to that wrong<br> answer.</br></br></br></br></p><p>“Even if they said, ’3 x 4 was 11,’ if they were able to explain<br> their reasoning and explain how they came up with their answer really<br> in, umm, words and oral explanation, and they showed it in the picture<br> but they just got the final number wrong, we’re really more focused on<br> the how,” August says in the video.</br></br></br></br></p></blockquote><p> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"http://www.youtube.com/embed/DW0VxxoCrNo?feature=player_embedded\" width=\"640\"></iframe></p></div>",
  "content_text": "I think\nthis philosophy of testing\nmay explain the dichotomy between the fact that people are getting progressively more intelligent according to IQ tests while becoming observably more stupid in terms of their behavior:\nIn a pretty amazing YouTube video, Amanda August, a curriculum\ncoordinator in a suburb of Chicago called Grayslake, explains that\ngetting the right answer in math just doesn’t matter as long as kids can\nexplain the necessarily faulty reasoning they used to get to that wrong\nanswer.\n“Even if they said, ’3 x 4 was 11,’ if they were able to explain\ntheir reasoning and explain how they came up with their answer really\nin, umm, words and oral explanation, and they showed it in the picture\nbut they just got the final number wrong, we’re really more focused on\nthe how,” August says in the video.",
  "tags": [
    "education",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-19T19:00:00+00:00"
}