{
  "url": "https://voxday.net/2013/08/28/facebook-free-speech-and-fbi_28/",
  "scraped_at": "2025-12-14T22:40:21.048845",
  "title": "Facebook, free speech, and the FBI",
  "date_display": "August 28, 2013",
  "date_iso": "2013-08-28T13:00:00+00:00",
  "date_from_url": "2013-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yes, American, you are now <a href=\"http://www.policestateusa.com/2013/fbi-interrogated-man-after-comment-about-american-police-state-on-facebook/\">officially living in a police state</a> possessed of an all-seeing eye the likes of which even the Soviets and East Germans never managed to achieve:</p><blockquote class=\"tr_bq\"><p> A<br> man says that within hours of making an impassioned post on Facebook,<br> he was being interrogated by police and the FBI. Blaine Cooper, 33,<br> contacted policestateusa.com with a concerning story about how his<br> sentiments posted on Facebook had drawn the attention of the federal<br> government.  He showed me the comment and told me that within 24-hours<br> of posting it, he was being contacted by the police and FBI.</br></br></br></br></br></br></p><p>His<br> colorful comment was in reference to what he believes is an “American<br> Police State,” in which the power of the federal government is growing<br> in a direction which may one day lead people to fight back.</br></br></br></p><p>Cooper,<br> who is training to be a wild land fire fighter, said that on August 23,<br> he was contacted by Officer Jason Kuafman of the Prescott Valley Police<br> Department and was told that he needed to come to the police station<br> for an interview with the FBI.</br></br></br></br></p><p>He complied with the<br> request for an interview, which lasted 45 minutes with federal agents<br> present.  He was released after apparently being determined to not be a<br> threat.</br></br></br></p><p>“They had every Facebook post I had ever made<br> in a huge file, along with all my wife’s information, and parent’s<br> information,” Cooper told policestateusa.com.</br></br></p></blockquote><p>I<br> sometimes feel as if I should take requests from the federal agents<br> charged with monitoring this blog.  I mean, if I knew the usual guy was a<br> Jets fan or particularly into Asian women, I’d feel obliged to<br> occasionally surf through a few Jets sites or hit up Hot Asian Babes<br> every now and then. While I’m obviously opposed to the universal spying<br> system and I think it is the very definition of the sort of fragile<br> system that predictably ends in chaos and tears, the actual individuals<br> are basically the Internet equivalent of the late-night security guard.</br></br></br></br></br></br></br></br></p><p>What<br> is there to do?  Either go entirely dark or flood them with<br> information.  Those are your two options.  Nothing else is even remotely<br> viable.</br></br></br></p></div>",
  "content_text": "Yes, American, you are now\nofficially living in a police state\npossessed of an all-seeing eye the likes of which even the Soviets and East Germans never managed to achieve:\nA\nman says that within hours of making an impassioned post on Facebook,\nhe was being interrogated by police and the FBI. Blaine Cooper, 33,\ncontacted policestateusa.com with a concerning story about how his\nsentiments posted on Facebook had drawn the attention of the federal\ngovernment.  He showed me the comment and told me that within 24-hours\nof posting it, he was being contacted by the police and FBI.\nHis\ncolorful comment was in reference to what he believes is an “American\nPolice State,” in which the power of the federal government is growing\nin a direction which may one day lead people to fight back.\nCooper,\nwho is training to be a wild land fire fighter, said that on August 23,\nhe was contacted by Officer Jason Kuafman of the Prescott Valley Police\nDepartment and was told that he needed to come to the police station\nfor an interview with the FBI.\nHe complied with the\nrequest for an interview, which lasted 45 minutes with federal agents\npresent.  He was released after apparently being determined to not be a\nthreat.\n“They had every Facebook post I had ever made\nin a huge file, along with all my wife’s information, and parent’s\ninformation,” Cooper told policestateusa.com.\nI\nsometimes feel as if I should take requests from the federal agents\ncharged with monitoring this blog.  I mean, if I knew the usual guy was a\nJets fan or particularly into Asian women, I’d feel obliged to\noccasionally surf through a few Jets sites or hit up Hot Asian Babes\nevery now and then. While I’m obviously opposed to the universal spying\nsystem and I think it is the very definition of the sort of fragile\nsystem that predictably ends in chaos and tears, the actual individuals\nare basically the Internet equivalent of the late-night security guard.\nWhat\nis there to do?  Either go entirely dark or flood them with\ninformation.  Those are your two options.  Nothing else is even remotely\nviable.",
  "tags": [
    "corpocracy",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-28T12:00:00+00:00"
}