{
  "url": "https://voxday.net/2013/08/22/fukushima-truth-leaks-ou/",
  "scraped_at": "2025-12-14T22:39:40.906767",
  "title": "Fukushima: the truth leaks out",
  "date_display": "August 22, 2013",
  "date_iso": "2013-08-22T18:11:00+00:00",
  "date_from_url": "2013-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The story of the still-ongoing disaster in Japan that has been regularly reported on Zerohedge and other alt-right sites <a href=\"http://www.bbc.co.uk/news/science-environment-23779561\" rel=\"noopener\" target=\"_blank\">is finally beginning to leak out</a> into the mainstream media:</p><blockquote class=\"tr_bq\"><p> A nuclear expert has told<br> the BBC that he believes the current water leaks at Fukushima are much<br> worse than the authorities have stated. Mycle Schneider is an independent consultant who has previously advised the French and German governments.He says water is leaking out all over the site and there are no accurate figures for radiation levels.</br></br></p><p> Meanwhile the chairman of Japan’s nuclear authority said that he feared there would be further leaks. The ongoing problems at the Fukushima plant increased in<br> recent days when the Tokyo Electric Power Company (Tepco) admitted that<br> around 300 tonnes of highly radioactive water had leaked from a storage<br> tank on the site….</br></br></br></p><p>“It is much worse than we have been led to believe, much worse,” said<br> Mr Schneider, who is lead author for the World Nuclear Industry status<br> reports.</br></br></p><p>At news conference, the head of Japan’s nuclear regulation<br> authority Shunichi Tanaka appeared to give credence to Mr Schneider’s<br> concerns, saying that he feared there would be further leaks. “We should assume that what has happened once could happen<br> again, and prepare for more. We are in a situation where there is no<br> time to waste,” he told reporters.</br></br></br></br></p></blockquote><p>This is of no surprise to anyone with any experience of Japan.  The Japanese NEVER tell the truth about anything if the truth is expected to create conflict or drama. Everyone in the game industry who has ever worked with Nintendo, Sega, or Konami knows that they won’t even give you a straightforward “no” when a yes/no decision is scheduled.  You’re just supposed to figure it out on the basis of not receiving a “yes” and ignore all of the perfectly legitimate-sounding explanations.</p><p>Don’t be surprised when another “unexpected” emergency is announced once Tepco can’t keep a lid on the situation anymore.  This is potentially an extraordinarily ugly situation and it absolutely dwarfs Chernobyl.</p></div>",
  "content_text": "The story of the still-ongoing disaster in Japan that has been regularly reported on Zerohedge and other alt-right sites\nis finally beginning to leak out\ninto the mainstream media:\nA nuclear expert has told\nthe BBC that he believes the current water leaks at Fukushima are much\nworse than the authorities have stated. Mycle Schneider is an independent consultant who has previously advised the French and German governments.He says water is leaking out all over the site and there are no accurate figures for radiation levels.\nMeanwhile the chairman of Japan’s nuclear authority said that he feared there would be further leaks. The ongoing problems at the Fukushima plant increased in\nrecent days when the Tokyo Electric Power Company (Tepco) admitted that\naround 300 tonnes of highly radioactive water had leaked from a storage\ntank on the site….\n“It is much worse than we have been led to believe, much worse,” said\nMr Schneider, who is lead author for the World Nuclear Industry status\nreports.\nAt news conference, the head of Japan’s nuclear regulation\nauthority Shunichi Tanaka appeared to give credence to Mr Schneider’s\nconcerns, saying that he feared there would be further leaks. “We should assume that what has happened once could happen\nagain, and prepare for more. We are in a situation where there is no\ntime to waste,” he told reporters.\nThis is of no surprise to anyone with any experience of Japan.  The Japanese NEVER tell the truth about anything if the truth is expected to create conflict or drama. Everyone in the game industry who has ever worked with Nintendo, Sega, or Konami knows that they won’t even give you a straightforward “no” when a yes/no decision is scheduled.  You’re just supposed to figure it out on the basis of not receiving a “yes” and ignore all of the perfectly legitimate-sounding explanations.\nDon’t be surprised when another “unexpected” emergency is announced once Tepco can’t keep a lid on the situation anymore.  This is potentially an extraordinarily ugly situation and it absolutely dwarfs Chernobyl.",
  "tags": [
    "corpocracy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-22T17:11:00+00:00"
}