{
  "url": "https://voxday.net/2013/08/19/less-than-inconceivable/",
  "scraped_at": "2025-12-14T22:39:19.578560",
  "title": "Less than inconceivable",
  "date_display": "August 19, 2013",
  "date_iso": "2013-08-19T17:00:00+00:00",
  "date_from_url": "2013-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While liberals are staggered with the probability that the Lightbringer would be more accurately described as the Liebringer, I think the defense has a fairly credible case. Not a very flattering one, to be sure, but credible:</p><blockquote class=\"tr_bq\"><p> But just as it is utterly absurd to claim Director of National Intelligence James Clapper didn’t lie before Congress (and <a href=\"http://www.washingtonpost.com/blogs/erik-wemple/wp/2013/06/11/james-clapper-nsa-and-the-l-word/\">some reporters thankfully admitted that truth in the open</a>), it has now become almost silly to insinuate or assume that the president hasn’t also been <em>lying</em>. Why? Because if that’s true — if indeed he <em>hasn’t</em><br> been deliberately lying — then it means he has been dangerously,<br> irresponsibly and negligently ignorant of not only the government he<br> runs, but also of the news breaking around him.</br></br></br></p><p>Think about three recent presidential declarations. A few weeks back, the president appeared on <a href=\"http://www.cbsnews.com/video/watch/?id=50149123n\">CBS</a> to claim that the secret FISA court is “transparent.” He then appeared on <a href=\"http://www.usatoday.com/story/theoval/2013/08/06/obama-talk-show-leno-letterman-nixon-clinton-arsenio-hall/2622767/\">NBC</a><br> to claim that “We don’t have a domestic spying program.” Then, as<br> mentioned above, he held a press conference on Friday to suggest there<br> was no evidence the NSA was “actually abusing” its power.</br></br></br></p><p>For<br> these statements to just be inaccurate and not be deliberate, calculated<br> lies it would mean that the president 1) made his declarative statement<br> to CBS even though he didn’t know the FISA court was secret (despite <a href=\"http://www.huffingtonpost.com/barack-obama/my-position-on-fisa_b_110789.html\">knowing all about the FISA court six years ago</a>); 2) made his declarative statement to NBC but somehow didn’t see <a href=\"http://www.theguardian.com/world/2013/jun/06/nsa-phone-records-verizon-court-order\">any of the news coverage</a> of the Snowden disclosures proving the <a href=\"http://www.forbes.com/sites/andygreenberg/2013/06/05/nsas-verizon-spying-order-specifically-targeted-americans-not-foreigners/\">existence of domestic spying</a> and 3) made his sweeping “actually abusing” statement somehow not knowing that his own administration <a href=\"http://www.nytimes.com/2009/04/16/us/16nsa.html?pagewanted=all\">previously admitted</a> the NSA had abused its power, and worse, made his statement without bothering to look at the NSA audit report that <a href=\"http://www.washingtonpost.com/world/national-security/nsa-broke-privacy-rules-thousands-of-times-per-year-audit-finds/2013/08/15/3310e554-05ca-11e3-a07f-49ddc7417125_story.html\">Gellman revealed today</a>.</br></br></br></p><p>So<br> sure, I guess it’s possible Obama has merely been “wrong” but has not<br> been lying. But the implications of that would be just as bad — albeit<br> in a different way — as if he were deliberately lying. It would mean<br> that he is making sweeping and wildly inaccurate statements without<br> bothering to find out if they are actually true. Worse, for him merely<br> to be wrong but not deliberately lying, it would mean that he didn’t<br> know the most basic facts about how his own administration runs. It<br> would, in other words, mean he is so totally out of the loop on<br> absolutely everything — even the public news cycle — that he has no idea<br> what’s going on.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>The reason the Left has such a hard time understanding Obama’s behavior is because they are inextricably wedded to a false assumption, which is that he is highly intelligent.  I have been pointing out for years that the guy not only isn’t particularly bright, but he isn’t even particularly interested in his presidential responsibilities.  It’s hard for the media, particularly the political media, to understand that latter point because nearly everyone in the political game is in it for the power.</p><p>The reason the Right has such a hard time understanding Obama’s behavior is because they are inextricably wedded to a different false assumption, which is that Obama has an agenda. He doesn’t. He’s never been in politics for the power. He doesn’t give a damn about what he can do and he doesn’t have a particular agenda. Forget the Republican paranoia; I don’t think there has ever been a post-FDR president who was less likely to even think about seeking four more years.</p><p>Obama got into politics for the same reason rock stars get into music. He can’t wait to get on the Clinton lecture circuit, have no responsibilities, get away from Michelle, and travel around the world with his very close male friends being applauded for walking on stage and reading his teleprompter. I still contend that if the decision had been left up solely to Obama, he would not have run for re-election. He not only made the second term Reagan look like a paragon of presidential engagement in his first term, but has rendered himself the lamest of ducks without even being crippled by a major internal scandal or losing the Senate.</p><p>Obviously, what Obama has been saying about the NSA is not true. But when one considers both his intelligence and his observable level of interest in his presidency, I think Occam’s Razor strongly suggests that it is the alternative explanation that is the correct one and he has no idea what is going on in his administration.</p><p>It’s not that Obama lied to you, my progressive friends, it’s that you lied to yourself about him.</p></div>",
  "content_text": "While liberals are staggered with the probability that the Lightbringer would be more accurately described as the Liebringer, I think the defense has a fairly credible case. Not a very flattering one, to be sure, but credible:\nBut just as it is utterly absurd to claim Director of National Intelligence James Clapper didn’t lie before Congress (and\nsome reporters thankfully admitted that truth in the open\n), it has now become almost silly to insinuate or assume that the president hasn’t also been\nlying\n. Why? Because if that’s true — if indeed he\nhasn’t\nbeen deliberately lying — then it means he has been dangerously,\nirresponsibly and negligently ignorant of not only the government he\nruns, but also of the news breaking around him.\nThink about three recent presidential declarations. A few weeks back, the president appeared on\nCBS\nto claim that the secret FISA court is “transparent.” He then appeared on\nNBC\nto claim that “We don’t have a domestic spying program.” Then, as\nmentioned above, he held a press conference on Friday to suggest there\nwas no evidence the NSA was “actually abusing” its power.\nFor\nthese statements to just be inaccurate and not be deliberate, calculated\nlies it would mean that the president 1) made his declarative statement\nto CBS even though he didn’t know the FISA court was secret (despite\nknowing all about the FISA court six years ago\n); 2) made his declarative statement to NBC but somehow didn’t see\nany of the news coverage\nof the Snowden disclosures proving the\nexistence of domestic spying\nand 3) made his sweeping “actually abusing” statement somehow not knowing that his own administration\npreviously admitted\nthe NSA had abused its power, and worse, made his statement without bothering to look at the NSA audit report that\nGellman revealed today\n.\nSo\nsure, I guess it’s possible Obama has merely been “wrong” but has not\nbeen lying. But the implications of that would be just as bad — albeit\nin a different way — as if he were deliberately lying. It would mean\nthat he is making sweeping and wildly inaccurate statements without\nbothering to find out if they are actually true. Worse, for him merely\nto be wrong but not deliberately lying, it would mean that he didn’t\nknow the most basic facts about how his own administration runs. It\nwould, in other words, mean he is so totally out of the loop on\nabsolutely everything — even the public news cycle — that he has no idea\nwhat’s going on.\nThe reason the Left has such a hard time understanding Obama’s behavior is because they are inextricably wedded to a false assumption, which is that he is highly intelligent.  I have been pointing out for years that the guy not only isn’t particularly bright, but he isn’t even particularly interested in his presidential responsibilities.  It’s hard for the media, particularly the political media, to understand that latter point because nearly everyone in the political game is in it for the power.\nThe reason the Right has such a hard time understanding Obama’s behavior is because they are inextricably wedded to a different false assumption, which is that Obama has an agenda. He doesn’t. He’s never been in politics for the power. He doesn’t give a damn about what he can do and he doesn’t have a particular agenda. Forget the Republican paranoia; I don’t think there has ever been a post-FDR president who was less likely to even think about seeking four more years.\nObama got into politics for the same reason rock stars get into music. He can’t wait to get on the Clinton lecture circuit, have no responsibilities, get away from Michelle, and travel around the world with his very close male friends being applauded for walking on stage and reading his teleprompter. I still contend that if the decision had been left up solely to Obama, he would not have run for re-election. He not only made the second term Reagan look like a paragon of presidential engagement in his first term, but has rendered himself the lamest of ducks without even being crippled by a major internal scandal or losing the Senate.\nObviously, what Obama has been saying about the NSA is not true. But when one considers both his intelligence and his observable level of interest in his presidency, I think Occam’s Razor strongly suggests that it is the alternative explanation that is the correct one and he has no idea what is going on in his administration.\nIt’s not that Obama lied to you, my progressive friends, it’s that you lied to yourself about him.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-19T16:00:00+00:00"
}