{
  "url": "https://voxday.net/2013/08/01/lions-den-i-larry-correia/",
  "scraped_at": "2025-12-14T22:37:25.677750",
  "title": "Lions Den I: Larry Correia",
  "date_display": "August 1, 2013",
  "date_iso": "2013-08-01T17:00:00+00:00",
  "date_from_url": "2013-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>I thought the inaugural Lions’ Den should start off with a literal literary bang, so I asked my fellow co-founder of the Hispanic-Latino Science Fiction Writers Alliance and Gun Club, Larry Correia, if he would do the honors. Being both fearless and heavily armed, he did not hesitate to kick the door down and stride right in with <a href=\"http://www.amazon.com/Hard-Magic-Grimnoir-Chronicles-ebook/dp/B00APAHLMA/ref=tmm_kin_title_0?ie=UTF8&amp;qid=1375309764&amp;sr=8-1\">HARD MAGIC</a>, the first book in the Grimnoir Chronicles. </i></p><div class=\"MsoNormal\" style=\"margin: 0in 0in 10pt;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.sfsite.com/grc/1210/hmlg.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.sfsite.com/grc/1210/hmlg.jpg\" width=\"210\"/></a></div><div class=\"MsoNormal\" style=\"margin: 0in 0in 10pt;\"> “The Grimnoir Chronicles trilogy is kind of hard to<br> categorize. It is an alternative history, epic fantasy, noir-pulp sci-fi, diesel<br> punk saga about 1930s Great Depression superheroes battling the magical samurai<br> of Imperial Japan. Yeah, good luck pitching that genre to an editor. However,<br> they are also a lot of fun, and the series turned out really well. It starts<br> out with Hard Magic, then Spellbound is the sequel, and the final book of the<br> trilogy, Warbound, is coming out this week.</br></br></br></br></br></br></div><div></div><div class=\"MsoNormal\" style=\"margin: 0in 0in 10pt;\"> “On this project I was originally brainstorming a regular<br> epic fantasy story, lots of magic, big interconnected plots, lots and lots of<br> characters, but it kind of mutated, mostly because I was talking with author<br> Mike Kupari at the time about how cool the styles of the 30s were and how everybody<br> loves Zeppelins. So I wound up setting this epic fantasy story in an<br> alternative history version of the 1930s.</br></br></br></br></br></div><div></div><div class=\"MsoNormal\" style=\"margin: 0in 0in 10pt;\"> “As a history nut I find the period between the world wars<br> absolutely fascinating, and it was a period that I’d already studied a lot so I<br> could add some cultural authenticity. This was also when men wore hats, and<br> that’s just cool. I’m a big fan of hard boiled crime novels, Chandler and<br> Hammett especially, so this was my chance to take on those kind of characters. I<br> love the vibe, I love the style, and as a gun nut there was so much classy<br> hardware to choose from.</br></br></br></br></br></br></div><div></div><div class=\"MsoNormal\" style=\"margin: 0in 0in 10pt;\"> “This world diverged from ours in the 1850s when a handful of<br> people began to develop magical powers for an unknown reason. As time goes on,<br> the numbers with magic grow, until by the 30s it is about one in a hundred<br> people with some measure of power, and one in a thousand capable of truly<br> impressive feats. The reason it gets a superhero vibe is because each person’s<br> magic can screw with one part of the laws of physics (and as a writer known for<br> his action scenes, this meant I could do some crazy stuff). By the time Hard<br> Magic begins the world has been changed in a lot of drastic ways by the introduction<br> of magic, which as a history geek, enabled me to have a lot of fun.</br></br></br></br></br></br></br></br></div><div></div><div class=\"MsoNormal\" style=\"margin: 0in 0in 10pt;\"> “Hard Magic has two main characters, “Heavy” Jake Sullivan,<br> who is a war hero, ex-con, forced into working for J. Edgar Hoover to catch<br> magical fugitives. He can control the direction and strength of gravity. And Faye<br> Vierra, a teenage dustbowl Okie refugee, who is a teensy bit crazy, can<br> teleport, and is potentially the most dangerous person in the world. Hard Magic<br> is about them getting involved with a secret society known as the Grimnoir and<br> their battle to keep a Tesla super weapon from falling into the hands of the<br> deadly Imperium.</br></br></br></br></br></br></br></div><div></div><p>“I like to say that this is the only book I’m aware of that<br> features a teleporting magic ninja fight on top of a flaming pirate dirigible.<br> And somehow, despite my unabashed love of pulp awesomeness, Hard Magic has been<br> nominated for and won some awards and been really well received. I’ve got back<br> to back Audie wins for the audiobooks of the first two, and Hard Magic was a<br> finalist for best novel in France!  That<br> was certainly unexpected.”<br>      – Larry Correia</br></br></br></br></br></br></br></p><p><i>The three reviewers have volunteered and been assigned.  I will post their reviews here in two weeks.</i></p></div>",
  "content_text": "I thought the inaugural Lions’ Den should start off with a literal literary bang, so I asked my fellow co-founder of the Hispanic-Latino Science Fiction Writers Alliance and Gun Club, Larry Correia, if he would do the honors. Being both fearless and heavily armed, he did not hesitate to kick the door down and stride right in with\nHARD MAGIC\n, the first book in the Grimnoir Chronicles.\n“The Grimnoir Chronicles trilogy is kind of hard to\ncategorize. It is an alternative history, epic fantasy, noir-pulp sci-fi, diesel\npunk saga about 1930s Great Depression superheroes battling the magical samurai\nof Imperial Japan. Yeah, good luck pitching that genre to an editor. However,\nthey are also a lot of fun, and the series turned out really well. It starts\nout with Hard Magic, then Spellbound is the sequel, and the final book of the\ntrilogy, Warbound, is coming out this week.\n“On this project I was originally brainstorming a regular\nepic fantasy story, lots of magic, big interconnected plots, lots and lots of\ncharacters, but it kind of mutated, mostly because I was talking with author\nMike Kupari at the time about how cool the styles of the 30s were and how everybody\nloves Zeppelins. So I wound up setting this epic fantasy story in an\nalternative history version of the 1930s.\n“As a history nut I find the period between the world wars\nabsolutely fascinating, and it was a period that I’d already studied a lot so I\ncould add some cultural authenticity. This was also when men wore hats, and\nthat’s just cool. I’m a big fan of hard boiled crime novels, Chandler and\nHammett especially, so this was my chance to take on those kind of characters. I\nlove the vibe, I love the style, and as a gun nut there was so much classy\nhardware to choose from.\n“This world diverged from ours in the 1850s when a handful of\npeople began to develop magical powers for an unknown reason. As time goes on,\nthe numbers with magic grow, until by the 30s it is about one in a hundred\npeople with some measure of power, and one in a thousand capable of truly\nimpressive feats. The reason it gets a superhero vibe is because each person’s\nmagic can screw with one part of the laws of physics (and as a writer known for\nhis action scenes, this meant I could do some crazy stuff). By the time Hard\nMagic begins the world has been changed in a lot of drastic ways by the introduction\nof magic, which as a history geek, enabled me to have a lot of fun.\n“Hard Magic has two main characters, “Heavy” Jake Sullivan,\nwho is a war hero, ex-con, forced into working for J. Edgar Hoover to catch\nmagical fugitives. He can control the direction and strength of gravity. And Faye\nVierra, a teenage dustbowl Okie refugee, who is a teensy bit crazy, can\nteleport, and is potentially the most dangerous person in the world. Hard Magic\nis about them getting involved with a secret society known as the Grimnoir and\ntheir battle to keep a Tesla super weapon from falling into the hands of the\ndeadly Imperium.\n“I like to say that this is the only book I’m aware of that\nfeatures a teleporting magic ninja fight on top of a flaming pirate dirigible.\nAnd somehow, despite my unabashed love of pulp awesomeness, Hard Magic has been\nnominated for and won some awards and been really well received. I’ve got back\nto back Audie wins for the audiobooks of the first two, and Hard Magic was a\nfinalist for best novel in France!  That\nwas certainly unexpected.”\n– Larry Correia\nThe three reviewers have volunteered and been assigned.  I will post their reviews here in two weeks.",
  "tags": [
    "books",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-01T16:00:00+00:00"
}