{
  "url": "https://voxday.net/2013/08/27/lions-den-iii-kate-paulk_27/",
  "scraped_at": "2025-12-14T22:40:13.767059",
  "title": "Lions Den III: Kate Paulk",
  "date_display": "August 27, 2013",
  "date_iso": "2013-08-27T13:00:00+00:00",
  "date_from_url": "2013-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Along with Dave Freer, Sarah Hoyt, and Chris McMahon, Kate Paulk is a member of the Mad Genius Club. She is also a Mensa-qualified history buff and her take on Vlad Tepes, aka Dracula, <b><a href=\"http://www.amazon.com/Impaler-ebook/dp/B004URURJ8/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;sr=1-1&amp;qid=1377589843\" rel=\"noopener\" target=\"_blank\">Impaler</a></b>, is based on the actual historical figure and military leader, as opposed to the caped seducer. Please note that we now have our three volunteer reviewers.</i></p><p><b>Not Another Dracula Book</b></p><p>I get that a lot, since <i>Impaler </i>is – as the title suggests – about Vlad Dracula. Except, well… it’s not “another Dracula book”. For starters there’s the barest hint of a nod to the vampire legends, and for seconds, he’s the hero. Not anti-hero and not some PC navel gazing everyone is horrible and it’s all awful hero, either, he’s an honest to $DEITY$* actual hero in the old style. Also, because <i>Impaler </i>is alternate history, he wins.</p><p>Now that I’ve covered the plot in a nutshell (I really do describe the book to others this way. “Yes, it’s about Vlad the Impaler. He wins.” I think it might be the big grin when I say this that causes the faint of heart to edge away. That and the badge proclaiming “Dracula NEVER sparkled”), I should probably add a little more about what else makes Impaler not your typical Dracula book.</p><p><a href=\"http://www.amazon.com/Impaler-ebook/dp/B004URURJ8/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;sr=1-1&amp;qid=1377589843\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/08/Impaler_Cover_Small.jpg\" width=\"213\"/></a>I hesitate to say that I researched the hell out of it, not least because any time I hear someone say that, the end result looks like the research came mostly out of the strange inner curves of their cranium rather than any actual library. I hope I got reasonably close to accurate, given that nobody has written “Everyday Life in Late Fifteenth Century Wallachia” – or if they have, they weren’t considerate enough to publish it in time for me to use it. A heck of a lot of architecture has vanished since then, too, so I spent hours chasing around for weird stuff like “What did Varna’s main gate look like in 1477?” (I didn’t find an answer to that one, so I guessed), “Where was Mehmed II in the winter of 1477/1478?” (Another guess – this one unfortunately essential to the plot), “What state were Constantinople’s walls in by early 1478?” (That one, I did get a more or less useful answer to).</p><p>From this the astute reader (meaning most of the folks here) might have guessed that a good chunk of <i>Impaler </i>is in the alternate side of history, and they’d be right. By the end of the first chapter <i>Impaler </i>is out of our timeline and into what might have happened if the man who was at one time regarded as the possible savior of Christendom had survived what was almost certainly an assassination attempt authored by Mehmed II (from a very safe distance – Vlad was the only person who ever scared Mehmed. Which in my opinion put Vlad on the right side of the line).</p><p>I started this because Vlad himself has intrigued me for years. Here was a man who was quite possibly the only hope his small nation had – someone with enough strength of will to challenge the noble class who had been going through Princes at the rate of one every couple of years on average (some of them with reigns so short any official portraits would have to be taken from their death mask), the determination to turn what would be called a failed state these days into a law-abiding nation (he succeeded), and the audacity to challenge the overwhelming power of the Ottoman Empire – which had been seen as unbeatable since the fall of Constantinople.</p><p>There were also the legends that suggested he inspired extraordinary loyalty, enough of them that there had to have been something there, particularly when some of these legends were authored by his enemies (of which he had many – not helped by Matthias Corvinus betraying him so he could use the crusade gold to ransom the crown of Hungary and forging “evidence” to that end – just like modern politics only with more blood), and the hints that the man behind the legends was strictly moral, determined, and had a vile semi-berserker temper that led him to fly into uncontrollable rages if something hit one of his triggers.</p><p>So I started to play with the question of what would Vlad have done if he had survived the assassination attempt. The rest of the book followed on from that.</p></div>",
  "content_text": "Along with Dave Freer, Sarah Hoyt, and Chris McMahon, Kate Paulk is a member of the Mad Genius Club. She is also a Mensa-qualified history buff and her take on Vlad Tepes, aka Dracula,\nImpaler\n, is based on the actual historical figure and military leader, as opposed to the caped seducer. Please note that we now have our three volunteer reviewers.\nNot Another Dracula Book\nI get that a lot, since\nImpaler\nis – as the title suggests – about Vlad Dracula. Except, well… it’s not “another Dracula book”. For starters there’s the barest hint of a nod to the vampire legends, and for seconds, he’s the hero. Not anti-hero and not some PC navel gazing everyone is horrible and it’s all awful hero, either, he’s an honest to $DEITY$* actual hero in the old style. Also, because\nImpaler\nis alternate history, he wins.\nNow that I’ve covered the plot in a nutshell (I really do describe the book to others this way. “Yes, it’s about Vlad the Impaler. He wins.” I think it might be the big grin when I say this that causes the faint of heart to edge away. That and the badge proclaiming “Dracula NEVER sparkled”), I should probably add a little more about what else makes Impaler not your typical Dracula book.\nI hesitate to say that I researched the hell out of it, not least because any time I hear someone say that, the end result looks like the research came mostly out of the strange inner curves of their cranium rather than any actual library. I hope I got reasonably close to accurate, given that nobody has written “Everyday Life in Late Fifteenth Century Wallachia” – or if they have, they weren’t considerate enough to publish it in time for me to use it. A heck of a lot of architecture has vanished since then, too, so I spent hours chasing around for weird stuff like “What did Varna’s main gate look like in 1477?” (I didn’t find an answer to that one, so I guessed), “Where was Mehmed II in the winter of 1477/1478?” (Another guess – this one unfortunately essential to the plot), “What state were Constantinople’s walls in by early 1478?” (That one, I did get a more or less useful answer to).\nFrom this the astute reader (meaning most of the folks here) might have guessed that a good chunk of\nImpaler\nis in the alternate side of history, and they’d be right. By the end of the first chapter\nImpaler\nis out of our timeline and into what might have happened if the man who was at one time regarded as the possible savior of Christendom had survived what was almost certainly an assassination attempt authored by Mehmed II (from a very safe distance – Vlad was the only person who ever scared Mehmed. Which in my opinion put Vlad on the right side of the line).\nI started this because Vlad himself has intrigued me for years. Here was a man who was quite possibly the only hope his small nation had – someone with enough strength of will to challenge the noble class who had been going through Princes at the rate of one every couple of years on average (some of them with reigns so short any official portraits would have to be taken from their death mask), the determination to turn what would be called a failed state these days into a law-abiding nation (he succeeded), and the audacity to challenge the overwhelming power of the Ottoman Empire – which had been seen as unbeatable since the fall of Constantinople.\nThere were also the legends that suggested he inspired extraordinary loyalty, enough of them that there had to have been something there, particularly when some of these legends were authored by his enemies (of which he had many – not helped by Matthias Corvinus betraying him so he could use the crusade gold to ransom the crown of Hungary and forging “evidence” to that end – just like modern politics only with more blood), and the hints that the man behind the legends was strictly moral, determined, and had a vile semi-berserker temper that led him to fly into uncontrollable rages if something hit one of his triggers.\nSo I started to play with the question of what would Vlad have done if he had survived the assassination attempt. The rest of the book followed on from that.",
  "tags": [
    "books",
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-27T12:00:00+00:00"
}