{
  "url": "https://voxday.net/2013/08/06/mailvox-null-hypothesis_6/",
  "scraped_at": "2025-12-14T22:37:55.483210",
  "title": "Mailvox: the null hypothesis",
  "date_display": "August 6, 2013",
  "date_iso": "2013-08-06T13:00:00+00:00",
  "date_from_url": "2013-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CKK has a few questions about God:</p><blockquote class=\"tr_bq\"><p> I<br> read your blog and find that you make interesting points. I have a few<br> questions for you which revolve around the Null Hypothesis as it relates<br> to the evidence and knowledge of God.</br></br></br></p><p>First, do you<br> ground your faith in God based upon an evidentiary standpoint? I know<br> the trend (and often impasse) in discourse between atheists/agnostics<br> and Christians revolves around which side has the burden of proof and I<br> am wondering how God has satisfied any logical hiccups you may have come<br> across in your life.</br></br></br></br></br></p><p>Second, in regards to other<br> people who lack faith, how can God ask people to perform a logical leap<br> to believe in Him which they don’t do in every other part of their<br> lives? For example, a basic precept of just criminal courts is the idea<br> of being innocent until proven guilty; the burden of proof is always on<br> the accuser (in the form of the State) as they are the ones making the<br> claim of guilt. This is the same with every other arena of life and even<br> forms the basis of the scientific method. Yet this isn’t done for God.<br> We are given antidotes based on argument but not necessarily based on<br> evidence.</br></br></br></br></br></br></br></br></br></p><p>Third, and this relates to the first, is who<br> does the burden of proof regarding the evidence of God falls upon? Those<br> who claim His existence or those who deny Him?</br></br></p></blockquote><p>I<br> would say my faith is more grounded in a logical standpoint than in one<br> based purely on evidence, although I am entirely content with the<br> evidence for God as it exists to date.  The inability of secular and<br> pagan philosophers to produce coherent moral systems, combined with the<br> logical absurdity of most non-Christian moral systems, leaves me<br> entirely satisfied with the Christian moral structure, even if I find<br> occasionally find the application of that structure to social policy to<br> be difficult, if not impossible.  Since a Creator God is a necessary<br> anchor for that moral structure, I conclude that not only must He exist,<br> but that it is necessary for Man to postulate His existence even if<br> there were no evidence for that existence to be found.</br></br></br></br></br></br></br></br></br></br></br></p><p>I<br> find it remarkable, and rather stupid, that individuals who don’t<br> hesitate to accept mathematical postulates in order to permit a<br> considerable quantity of mathematical equations to function effectively<br> are so terrified of accepting the existence of God as a moral<br> postulate.  It strikes me as even less intelligent than rejecting basic<br> math postulates and thereby refusing to utilize any of the math that<br> follows from them.</br></br></br></br></br></br></br></p><p>How can God ask people to perform a<br> leap of faith rather than logic?  Very easily, since obedience is<br> clearly more important to God than understanding.  I neither ask nor<br> care if my dog, my children, or my teammates understand my orders, I<br> simply want them to follow them.  If I yell “square” to a teammate with<br> the ball, it is of no concern to me whether he grasps all the relative<br> positions of the various players on the field, I just want him to react<br> by immediately passing the ball 90 degrees to one side.  If I can test<br> my teammate’s confidence in me by telling him to pass the ball based on<br> faith, God can certainly test our confidence in Him by telling us to<br> believe without proof.</br></br></br></br></br></br></br></br></br></br></p><p>It’s not as if both Jesus Christ<br> and Aristotle haven’t independently explained the reason anyhow.  Many<br> people saw Jesus perform miracles and didn’t believe. And as Aristotle<br> observed centuries before Jesus was performing those miracles, some<br> people cannot be instructed by knowledge.  I tend to doubt this<br> observation of basic human behavior would have escaped God.</br></br></br></br></br></p><p>The<br> burden of proof always falls upon the individual asserting something to<br> another individual.  If I ask you if you believe God exists and you<br> tell me that you do not, you have no burden of proof.  You were simply<br> asked about a simple fact and you have no need to justify that fact to<br> me or anyone else.  If, on the other hand, you tell me that God does not<br> exist, then you have made an assertion and the burden of proving the<br> truth of that assertion lies with you.</br></br></br></br></br></br></br></p></div>",
  "content_text": "CKK has a few questions about God:\nI\nread your blog and find that you make interesting points. I have a few\nquestions for you which revolve around the Null Hypothesis as it relates\nto the evidence and knowledge of God.\nFirst, do you\nground your faith in God based upon an evidentiary standpoint? I know\nthe trend (and often impasse) in discourse between atheists/agnostics\nand Christians revolves around which side has the burden of proof and I\nam wondering how God has satisfied any logical hiccups you may have come\nacross in your life.\nSecond, in regards to other\npeople who lack faith, how can God ask people to perform a logical leap\nto believe in Him which they don’t do in every other part of their\nlives? For example, a basic precept of just criminal courts is the idea\nof being innocent until proven guilty; the burden of proof is always on\nthe accuser (in the form of the State) as they are the ones making the\nclaim of guilt. This is the same with every other arena of life and even\nforms the basis of the scientific method. Yet this isn’t done for God.\nWe are given antidotes based on argument but not necessarily based on\nevidence.\nThird, and this relates to the first, is who\ndoes the burden of proof regarding the evidence of God falls upon? Those\nwho claim His existence or those who deny Him?\nI\nwould say my faith is more grounded in a logical standpoint than in one\nbased purely on evidence, although I am entirely content with the\nevidence for God as it exists to date.  The inability of secular and\npagan philosophers to produce coherent moral systems, combined with the\nlogical absurdity of most non-Christian moral systems, leaves me\nentirely satisfied with the Christian moral structure, even if I find\noccasionally find the application of that structure to social policy to\nbe difficult, if not impossible.  Since a Creator God is a necessary\nanchor for that moral structure, I conclude that not only must He exist,\nbut that it is necessary for Man to postulate His existence even if\nthere were no evidence for that existence to be found.\nI\nfind it remarkable, and rather stupid, that individuals who don’t\nhesitate to accept mathematical postulates in order to permit a\nconsiderable quantity of mathematical equations to function effectively\nare so terrified of accepting the existence of God as a moral\npostulate.  It strikes me as even less intelligent than rejecting basic\nmath postulates and thereby refusing to utilize any of the math that\nfollows from them.\nHow can God ask people to perform a\nleap of faith rather than logic?  Very easily, since obedience is\nclearly more important to God than understanding.  I neither ask nor\ncare if my dog, my children, or my teammates understand my orders, I\nsimply want them to follow them.  If I yell “square” to a teammate with\nthe ball, it is of no concern to me whether he grasps all the relative\npositions of the various players on the field, I just want him to react\nby immediately passing the ball 90 degrees to one side.  If I can test\nmy teammate’s confidence in me by telling him to pass the ball based on\nfaith, God can certainly test our confidence in Him by telling us to\nbelieve without proof.\nIt’s not as if both Jesus Christ\nand Aristotle haven’t independently explained the reason anyhow.  Many\npeople saw Jesus perform miracles and didn’t believe. And as Aristotle\nobserved centuries before Jesus was performing those miracles, some\npeople cannot be instructed by knowledge.  I tend to doubt this\nobservation of basic human behavior would have escaped God.\nThe\nburden of proof always falls upon the individual asserting something to\nanother individual.  If I ask you if you believe God exists and you\ntell me that you do not, you have no burden of proof.  You were simply\nasked about a simple fact and you have no need to justify that fact to\nme or anyone else.  If, on the other hand, you tell me that God does not\nexist, then you have made an assertion and the burden of proving the\ntruth of that assertion lies with you.",
  "tags": [
    "mailvox",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-06T12:00:00+00:00"
}