{
  "url": "https://voxday.net/2013/08/16/mailvox-what-color-amused/",
  "scraped_at": "2025-12-14T22:39:04.863097",
  "title": "Mailvox: What color? Amused",
  "date_display": "August 16, 2013",
  "date_iso": "2013-08-16T20:00:00+00:00",
  "date_from_url": "2013-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dominic detects scientific falsification:</p><blockquote class=\"tr_bq\"><p> Last year, you made a post entitled <a href=\"http://www.milobookclub.com/2012/10/11/evolution-and-potential-rabbi/\">Evolution and a potential rabbit</a><br> where you showed some in the scientific community had established that<br> DNA could last no longer than between 1.5 to 6.8 million years, even<br> under ideal conditions, where the linked article stated: “This confirms<br> the widely held suspicion that claims of DNA from dinosaurs and ancient<br> insects trapped in amber are incorrect”</br></br></br></br></br></p><p>Well, in 2009 <a href=\"http://www.wired.com/science/discoveries/magazine/17-08/ff_primordial_yeast?currentPage=all\">Wired magazine posted a story of a man who extracted live bacteria and yeast samples from preserved Amber </a>well<br> beyond the 1.5-6.8 million year threshold. The plot twist being that<br> his only successful attempt at capitalizing on the discovery was that a<br> particular strain of yeast made good beer. But that’s it, nothing else<br> he extracted was different enough from modern microorganisms to yield<br> anything new or of value, in spite of the supposed tens of millions of<br> years difference in time and environment.</br></br></br></br></br></br></p><p>I know its not cloning, <i>per se</i>, but<br> this does seem, at least superficially, to meet your criteria of either<br> debunking the evolutionary timeline as it currently stands, given a man<br> has made a career out of resurrecting live organisms that should have no<br> DNA left, or further discrediting the peer-review process which allowed<br> a paper claiming a 521 year DNA half-life to get published..</br></br></br></br></br></p><p>Color me amused.</p></blockquote><p>That is two more strikes against Darwin’s Dangerous Idea. I think it would be overly aggressive to conclude that the evolutionary timeline has been comprehensively debunked, but this is, at the very least, yet another crack in the crumbling wall of the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow.</p></div>",
  "content_text": "Dominic detects scientific falsification:\nLast year, you made a post entitled\nEvolution and a potential rabbit\nwhere you showed some in the scientific community had established that\nDNA could last no longer than between 1.5 to 6.8 million years, even\nunder ideal conditions, where the linked article stated: “This confirms\nthe widely held suspicion that claims of DNA from dinosaurs and ancient\ninsects trapped in amber are incorrect”\nWell, in 2009\nWired magazine posted a story of a man who extracted live bacteria and yeast samples from preserved Amber\nwell\nbeyond the 1.5-6.8 million year threshold. The plot twist being that\nhis only successful attempt at capitalizing on the discovery was that a\nparticular strain of yeast made good beer. But that’s it, nothing else\nhe extracted was different enough from modern microorganisms to yield\nanything new or of value, in spite of the supposed tens of millions of\nyears difference in time and environment.\nI know its not cloning,\nper se\n, but\nthis does seem, at least superficially, to meet your criteria of either\ndebunking the evolutionary timeline as it currently stands, given a man\nhas made a career out of resurrecting live organisms that should have no\nDNA left, or further discrediting the peer-review process which allowed\na paper claiming a 521 year DNA half-life to get published..\nColor me amused.\nThat is two more strikes against Darwin’s Dangerous Idea. I think it would be overly aggressive to conclude that the evolutionary timeline has been comprehensively debunked, but this is, at the very least, yet another crack in the crumbling wall of the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow.",
  "tags": [
    "evolution",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-16T19:00:00+00:00"
}