{
  "url": "https://voxday.net/2013/08/26/mailvox-john-scalzi-is-stuart-smalley/",
  "scraped_at": "2025-12-14T22:40:10.110386",
  "title": "Mailvox: John Scalzi IS Stuart Smalley",
  "date_display": "August 26, 2013",
  "date_iso": "2013-08-26T19:30:00+00:00",
  "date_from_url": "2013-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He’s good enough, he’s smart enough, and DOGGONE IT, people like him! An acquaintance emails me to wonder if McRapey has finally jumped the shark:</p><blockquote class=\"tr_bq\"><p> <i>But, here’s the thing. I may be a dirty dirty feminist, but I’m also a<br> feminist with five acres of really awesome lawn, on which rests a<br> lovely, large house, in which I have lots of very cool things. I got the<br> lawn and house and things by being successful — that’s right! I am<br> financially successful through work! It’s not like, say, I’ve generally<br> failed at everything I’ve done and am living off remittances from<br> family. Nope, I worked for this stuff. Go me.</br></br></br></br></br></br></i></p><p>So, he’s denouncing white privilege?</p><p><i>I<br> am not saying that being a feminist is sufficient for having a<br> successful career, big house and a ridiculously large lawn that is the<br> size of a New York City block — but on the other hand it certainly<br> hasn’t hurt me in acquiring those things, has it.</br></br></br></br></i></p><p>So, white males have the privilege of doing things that are against the cultural norm, without hurting their privilege?</p><div></div><p><i>Or,<br> to put it another way, after some random dudebro has attempted to<br> insult me on the Internet by taking a photo of me in a dress that I’ve<br> already posted on my own site and slapping the word “feminist” on it,<br> all I have to go back to is a successful career, a loving family, a<br> circle of amazing friends and talented peers, and a social system whose<br> systematic biases favor me in nearly all cases as a well-off straight<br> white man. Even when I put on a dress.</br></br></br></br></br></br></br></i></p><div> <br> So, he’s boasting of white male privilege now.  I DID say that would come out eventually.</br></div></blockquote><div> I had no idea what my emailer was talking about, which turned out to be <a href=\"http://whatever.scalzi.com/2013/08/26/to-the-dudebro-who-thinks-hes-insulting-me-by-calling-me-a-feminist/\" rel=\"noopener\" target=\"_blank\">this post at Whatever</a>.  And it appears that McRapey has the wrong idea about who produced the image that mocked him.<blockquote class=\"tr_bq\"><p> Over the weekend, some dudebro with a history of shitting on women took this picture of me (which you may remember from here) and meme-ized it, with the intent, given his personal history and predilections, of mocking me — both for my views as regards women, and for wearing a dress.</p></blockquote><p>If McRapey happens to be referring to me or to Heartiste, he has it completely wrong.  Neither one of us had anything to do with producing or captioning his experiment in transgenderism.  Because he swims in a very small and self-selected pond, McRapey doesn’t seem to understand that he has literally become an Internet joke to many and my blog is only one of several better trafficked than Whatever that consider him to be a laughing matter.  As Heartiste puts it: “It’s telling that the triumvirate of Schwyzer, Manboobz and @scalzi are the best quasi-male tokens the feminist collective can claim.” And as much as I appreciate the descriptive phrase “scalzied manboob”, I can’t take any credit for it.</p><p>Calling anyone a feminist is a very serious insult.  As I have previously noted: calling a feminist a feminazi is an insult to the German National Socialist Workers Party. Despite their many flaws, Fascism, National Socialism and Communism were all demonstrably more humane, more sustainable, more rational ideologies than feminism. Attempt to own the insult at your own risk.</p><table cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"float: left; margin-right: 1em; text-align: left;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"http://farm8.staticflickr.com/7318/9600388870_3dbdb95eae_z.jpg\" imageanchor=\"1\" style=\"clear: left; margin-bottom: 1em; margin-left: auto; margin-right: auto;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://farm8.staticflickr.com/7318/9600388870_3dbdb95eae_z.jpg\" width=\"212\"/></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">He does it for you.</td></tr></tbody></table><p>In answer to my emailer’s question, I don’t think McRapey has jumped the shark here. The feminist left has a very high tolerance for hypocrisy on behalf of those it sees as its male allies. See: Bill Clinton. McRapey’s primary problem is that he has never recovered from his Daddy abandoning him to be raised by a woman in poverty.  He’s constantly reminding himself, and everyone else, that he possesses the trappings of success because he feels like a fraud and a failure.  Which is understandable, because although he did find a surprising amount of success through his combination of hard work, stunt writing and relentless self-promotion, he is a fraud.</p><p>And that’s why his success will never be enough for him. I’ve seen his type numerous times on a much larger scale in both the game industry and in the tech industry. The car always has to be more exotic, the boat always has to be bigger, the lawn always has to be more expansive, and the readership always has to be 46,000 daily readers more than it is, because nothing is enough to erase that irrational fear of being found out.</p></div><div> <br> That’s why I get under McRapey’s skin so easily and why he repeatedly announces that he doesn’t care, he’s henceforth ignoring me, and so forth, before launching yet another charity drive, attempting yet another surreptitious dig, or holding his breath and threatening to quit an organization if I am not expelled from it. Notice that someone else merely captions a photo and that is sufficient to provoke yet another Stuart Smalley outburst from the man.<p>And still some of you ask me why I continue to do this. Is it not self-evident?</p><p>On a tangential note, it is little surprising to hear that the liberal proponent of gun control has acquired some guns and is attempting to learn how to use them.  I suppose we can all look forward to seeing the inevitable picture featuring McRapey as Lara Croft.  Because charity.  In the end, McRapey is little more than a tragicomic example of how the absence of a father in one’s youth scars even the successful individual, as his Smalleyesque boasting shows that he never had anyone in his life to teach him this:<br> <i><br/></i><br> <i>“If you can meet with Triumph and Disaster</i><br> <i>And treat those two impostors just the same;</i><br> <i>If you can bear to hear the truth you’ve spoken</i><br> <i>Twisted by knaves to make a trap for fools,</i><br> <i>Or watch the things you gave your life to, broken,</i><br> <i>And stoop and build ’em up with worn-out tools….</i><br> <i><br/></i><br> <i>“If you can talk with crowds and keep your virtue,</i><br> <i>Or walk with Kings – nor lose the common touch,</i><br> <i>If neither foes nor loving friends can hurt you,</i><br> <i>If all men count with you, but none too much;</i><br> <i>If you can fill the unforgiving minute</i><br> <i>With sixty seconds’ worth of distance run,</i><br> <i>Yours is the Earth and everything that’s in it,</i><br> <i>And – which is more – you’ll be a Man, my son!” </i></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></br></div></div>",
  "content_text": "He’s good enough, he’s smart enough, and DOGGONE IT, people like him! An acquaintance emails me to wonder if McRapey has finally jumped the shark:\nBut, here’s the thing. I may be a dirty dirty feminist, but I’m also a\nfeminist with five acres of really awesome lawn, on which rests a\nlovely, large house, in which I have lots of very cool things. I got the\nlawn and house and things by being successful — that’s right! I am\nfinancially successful through work! It’s not like, say, I’ve generally\nfailed at everything I’ve done and am living off remittances from\nfamily. Nope, I worked for this stuff. Go me.\nSo, he’s denouncing white privilege?\nI\nam not saying that being a feminist is sufficient for having a\nsuccessful career, big house and a ridiculously large lawn that is the\nsize of a New York City block — but on the other hand it certainly\nhasn’t hurt me in acquiring those things, has it.\nSo, white males have the privilege of doing things that are against the cultural norm, without hurting their privilege?\nOr,\nto put it another way, after some random dudebro has attempted to\ninsult me on the Internet by taking a photo of me in a dress that I’ve\nalready posted on my own site and slapping the word “feminist” on it,\nall I have to go back to is a successful career, a loving family, a\ncircle of amazing friends and talented peers, and a social system whose\nsystematic biases favor me in nearly all cases as a well-off straight\nwhite man. Even when I put on a dress.\nSo, he’s boasting of white male privilege now.  I DID say that would come out eventually.\nI had no idea what my emailer was talking about, which turned out to be\nthis post at Whatever\n.  And it appears that McRapey has the wrong idea about who produced the image that mocked him.\nOver the weekend, some dudebro with a history of shitting on women took this picture of me (which you may remember from here) and meme-ized it, with the intent, given his personal history and predilections, of mocking me — both for my views as regards women, and for wearing a dress.\nIf McRapey happens to be referring to me or to Heartiste, he has it completely wrong.  Neither one of us had anything to do with producing or captioning his experiment in transgenderism.  Because he swims in a very small and self-selected pond, McRapey doesn’t seem to understand that he has literally become an Internet joke to many and my blog is only one of several better trafficked than Whatever that consider him to be a laughing matter.  As Heartiste puts it: “It’s telling that the triumvirate of Schwyzer, Manboobz and @scalzi are the best quasi-male tokens the feminist collective can claim.” And as much as I appreciate the descriptive phrase “scalzied manboob”, I can’t take any credit for it.\nCalling anyone a feminist is a very serious insult.  As I have previously noted: calling a feminist a feminazi is an insult to the German National Socialist Workers Party. Despite their many flaws, Fascism, National Socialism and Communism were all demonstrably more humane, more sustainable, more rational ideologies than feminism. Attempt to own the insult at your own risk.\nHe does it for you.\nIn answer to my emailer’s question, I don’t think McRapey has jumped the shark here. The feminist left has a very high tolerance for hypocrisy on behalf of those it sees as its male allies. See: Bill Clinton. McRapey’s primary problem is that he has never recovered from his Daddy abandoning him to be raised by a woman in poverty.  He’s constantly reminding himself, and everyone else, that he possesses the trappings of success because he feels like a fraud and a failure.  Which is understandable, because although he did find a surprising amount of success through his combination of hard work, stunt writing and relentless self-promotion, he is a fraud.\nAnd that’s why his success will never be enough for him. I’ve seen his type numerous times on a much larger scale in both the game industry and in the tech industry. The car always has to be more exotic, the boat always has to be bigger, the lawn always has to be more expansive, and the readership always has to be 46,000 daily readers more than it is, because nothing is enough to erase that irrational fear of being found out.\nThat’s why I get under McRapey’s skin so easily and why he repeatedly announces that he doesn’t care, he’s henceforth ignoring me, and so forth, before launching yet another charity drive, attempting yet another surreptitious dig, or holding his breath and threatening to quit an organization if I am not expelled from it. Notice that someone else merely captions a photo and that is sufficient to provoke yet another Stuart Smalley outburst from the man.\nAnd still some of you ask me why I continue to do this. Is it not self-evident?\nOn a tangential note, it is little surprising to hear that the liberal proponent of gun control has acquired some guns and is attempting to learn how to use them.  I suppose we can all look forward to seeing the inevitable picture featuring McRapey as Lara Croft.  Because charity.  In the end, McRapey is little more than a tragicomic example of how the absence of a father in one’s youth scars even the successful individual, as his Smalleyesque boasting shows that he never had anyone in his life to teach him this:\n“If you can meet with Triumph and Disaster\nAnd treat those two impostors just the same;\nIf you can bear to hear the truth you’ve spoken\nTwisted by knaves to make a trap for fools,\nOr watch the things you gave your life to, broken,\nAnd stoop and build ’em up with worn-out tools….\n“If you can talk with crowds and keep your virtue,\nOr walk with Kings – nor lose the common touch,\nIf neither foes nor loving friends can hurt you,\nIf all men count with you, but none too much;\nIf you can fill the unforgiving minute\nWith sixty seconds’ worth of distance run,\nYours is the Earth and everything that’s in it,\nAnd – which is more – you’ll be a Man, my son!”",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-26T18:30:00+00:00"
}