{
  "url": "https://voxday.net/2013/08/06/mailvox-four-erroneous-arguments/",
  "scraped_at": "2025-12-14T22:37:59.131225",
  "title": "Mailvox: four erroneous arguments",
  "date_display": "August 6, 2013",
  "date_iso": "2013-08-06T20:00:00+00:00",
  "date_from_url": "2013-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ann Morgan appears to have no idea that she’s in completely over her head here. Her anti-Christian reasoning is specious and rests on a foundation of ignorance and error.</p><blockquote class=\"tr_bq\"><p> Christianity generally fails when one or more of a few things happen:</p><p>1.<br> Those who claim something is ‘sinful’ cannot give any reason why it is,<br> other than ‘Because God says so’. In the absence of actual proof of<br> God, functionally, that statement is no different than ‘Because I say<br> so’.</br></br></br></br></p><p>2. A person is promised various rewards during their life<br> for being ‘good’, only to have the promise broken, and the rewards<br> either not given out at all, or given to those who were not good. Sooner<br> or later, they will conclude that the promise of an afterlife is just<br> one more promise that is going to be broken.</br></br></br></br></p><p>3. The wealth earned<br> by a person believing in Christian ethics ends up in the hands of those<br> promoting the Christian ethics. At some point they are going to<br> conclude that the entire business of Christianity is a con, to trick<br> them out of their wealth.</br></br></br></br></p><p>4. The promise of ‘forgiveness’ sounds<br> nice, but the way it functions is that people who harm others and their<br> society their whole lives, get to repent at the end of their lives and<br> go to heaven. This will end up in some sort of ‘tragedy of the commons’.<br> If you don’t want the commons overgrazed, you need to be vigilant about<br> those who are overgrazing it; allowing them to overgraze it for years,<br> ruin the commons for everyone else while getting fat cattle for<br> themselves, then tell them everything will be fine because they ‘repent’<br> is a recipe for disaster.</br></br></br></br></br></br></br></br></p></blockquote><p>Even her introduction is false.  Christianity does not, and cannot, fail on the basis of any of these points.</p><ol><li>There is no other reason than “God says so”.  In the absence of God, sin does not exist.  This is hardly philosophical or theological news.  However, makes the basic error of confusing an objective statement with a subjective one.  For example, it makes no difference whether the Magna Carta exists or not, the statement that “the Magna Carta says you must do X” is materially different than “I say you must do X”.  This should be completely obvious, since when the Christian says “God says Y is a sin” and cites a document that existed before he was born, that statement cannot possibly be considered equal to “because I say so” whether God exists or not.</li><li>This is irrelevant.  The Bible says that all are fallen and no one is good, save God.  Her argument is based on a false premise and indicates her ignorance concerning Christian theology.  Luke 18:19: “And Jesus said unto him, Why callest thou me good? none is good, save one, that is, God.”</li><li>This is observably false, as evidenced by the fact of billions of Christians who have not, in fact, concluded that the entire business of Christianity is a con.  It would be a poor con that settles for ten percent when the federal government takes, on average, twice that.</li><li>This is logically fallacious because it rests on a false assumption.  The fact is that there are relatively few deathbed conversions and there are billions of Christians who do not wait to repent of their sins.  Ergo, no tragedy of the commons. Let reason be silent when experience gainsays its conclusions.</li></ol></div>",
  "content_text": "Ann Morgan appears to have no idea that she’s in completely over her head here. Her anti-Christian reasoning is specious and rests on a foundation of ignorance and error.\nChristianity generally fails when one or more of a few things happen:\n1.\nThose who claim something is ‘sinful’ cannot give any reason why it is,\nother than ‘Because God says so’. In the absence of actual proof of\nGod, functionally, that statement is no different than ‘Because I say\nso’.\n2. A person is promised various rewards during their life\nfor being ‘good’, only to have the promise broken, and the rewards\neither not given out at all, or given to those who were not good. Sooner\nor later, they will conclude that the promise of an afterlife is just\none more promise that is going to be broken.\n3. The wealth earned\nby a person believing in Christian ethics ends up in the hands of those\npromoting the Christian ethics. At some point they are going to\nconclude that the entire business of Christianity is a con, to trick\nthem out of their wealth.\n4. The promise of ‘forgiveness’ sounds\nnice, but the way it functions is that people who harm others and their\nsociety their whole lives, get to repent at the end of their lives and\ngo to heaven. This will end up in some sort of ‘tragedy of the commons’.\nIf you don’t want the commons overgrazed, you need to be vigilant about\nthose who are overgrazing it; allowing them to overgraze it for years,\nruin the commons for everyone else while getting fat cattle for\nthemselves, then tell them everything will be fine because they ‘repent’\nis a recipe for disaster.\nEven her introduction is false.  Christianity does not, and cannot, fail on the basis of any of these points.\nThere is no other reason than “God says so”.  In the absence of God, sin does not exist.  This is hardly philosophical or theological news.  However, makes the basic error of confusing an objective statement with a subjective one.  For example, it makes no difference whether the Magna Carta exists or not, the statement that “the Magna Carta says you must do X” is materially different than “I say you must do X”.  This should be completely obvious, since when the Christian says “God says Y is a sin” and cites a document that existed before he was born, that statement cannot possibly be considered equal to “because I say so” whether God exists or not.\nThis is irrelevant.  The Bible says that all are fallen and no one is good, save God.  Her argument is based on a false premise and indicates her ignorance concerning Christian theology.  Luke 18:19: “And Jesus said unto him, Why callest thou me good? none is good, save one, that is, God.”\nThis is observably false, as evidenced by the fact of billions of Christians who have not, in fact, concluded that the entire business of Christianity is a con.  It would be a poor con that settles for ten percent when the federal government takes, on average, twice that.\nThis is logically fallacious because it rests on a false assumption.  The fact is that there are relatively few deathbed conversions and there are billions of Christians who do not wait to repent of their sins.  Ergo, no tragedy of the commons. Let reason be silent when experience gainsays its conclusions.",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-06T19:00:00+00:00"
}