{
  "url": "https://voxday.net/2013/08/19/mailvox-futility-of-cancer/",
  "scraped_at": "2025-12-14T22:39:17.764941",
  "title": "Mailvox: the futility of cancer",
  "date_display": "August 19, 2013",
  "date_iso": "2013-08-19T13:00:00+00:00",
  "date_from_url": "2013-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nate explains both why left-wing parasites are driven to take over organizations and why their takeovers always end in the eventual demise of the organization:</p><blockquote class=\"tr_bq\"><p> They never learn.  They don’t understand civilization, and they don’t<br> understand power.  That’s why they are never able to successfully build<br> organizations in the first place.  So they have to take over the<br> organizations others have already built and try to use them for their<br> own goals.  They think that the organization itself… the name… is<br> what makes it relevant.  So they imagine if they can just get control of<br> it… all that power will be theirs.</br></br></br></br></br></br></p><p>So they break the very tools they are planning to use to fix the world.</p><p>Then<br> they stand there with a dumb look on their face… trying to drive a<br> nail with a broken hammer… and cannot understand why it isn’t working.</br></br></p></blockquote><p>This process is as true of the Episcopalian Church and the Boy Scouts of America as it is of the SFWA.  Some believe that destruction was always the aim, but I don’t think that is true of the average parasite who joins an organization. I think in most cases they genuinely wish to “improve” the organization and do not understand that their desired improvements will kill it.</p><p>I’ll write more on this in the next day or two, in my response to NK Jemisin’s call for further “reconciliation”. What is interesting is the way in which Nate’s description here perfectly describes her approach to “improving” SF/F.</p><p>Their analytical abilities don’t appear to exceed that of the average cancer cell. The current SFWA is rather like a collection of cancer cells congratulating themselves on how much they have improved the body they are inhabiting and celebrating the way in which they have driven most of those disgusting, unprofessional white blood cells out.  And it is not hard to imagine their alarm when suddenly the body that sustains them begins to cease functioning, for no particular reason at all.</p><p>This is something that the Society for the Advancement of Speculative Storytelling may wish to keep in mind, lest it one day find itself going the same route as SFWA.  And speaking of SASS, the organization released a statement entitled: “<a href=\"http://www.sasswritersgroup.blogspot.com/2013/08/statement-on-expulsion-of-member-by.html\" rel=\"noopener\" target=\"_blank\">Statement on the expulsion of a member by another writers’ organization</a>“</p><p><i>In response to requests for comments regarding the decision of another writers’ group to formally expel a lifetime member, SASS Secretary and spokesman Lou Antonelli makes the following statement:</i></p><p>“Although the subject in question was exercising his free speech rights under the First Amendment to the US Constitution, that has nothing to do with the standards of conduct and behavior within a private organization</p><p>“Like any private club, the organization in question is allowed to police its membership according to its regulations and bylaws. This is an internal discipline issue and not a matter of concern to the Society for the Advancement of Speculative Storytelling.</p><p>“The by-laws of the Society for the Advancement of Speculative Storytelling clearly state that members should not discuss religion or politics within its auspices, and its members are expected to treat each other with respect. Those are our bylaws, and each group operates according to its own bylaws and policies.</p><p>I note that not only does SFWA have no standard of conduct and behavior, but it previously had one that was, if I recall correctly, junked during the Russell Davis administration.  As the SFWA’s statement demonstrated, the current Board believes it can throw anyone out of the organization at any time for no particular reason at all.  If I hadn’t made it clear to everyone that I was the member to whom the statement referred, no one would outside the SFWA Board and its confidants would even know with certainty who the expelled member was.</p><p>Of course, it would certainly be amusing if the Board’s assumptions turned out to be incorrect, would it not?  Because in that case, I would not even be expelled at all. And it occurs to me that someone inclined towards conspiracy theory might even conjecture that the reason the SFWA Board refused to publicly identify the expelled member is because they know very well that the expulsion was not legitimate, that it was a sham expulsion, and they are attempting to avoid being sued for damages once the illegitimacy of their action is established.</p></div>",
  "content_text": "Nate explains both why left-wing parasites are driven to take over organizations and why their takeovers always end in the eventual demise of the organization:\nThey never learn.  They don’t understand civilization, and they don’t\nunderstand power.  That’s why they are never able to successfully build\norganizations in the first place.  So they have to take over the\norganizations others have already built and try to use them for their\nown goals.  They think that the organization itself… the name… is\nwhat makes it relevant.  So they imagine if they can just get control of\nit… all that power will be theirs.\nSo they break the very tools they are planning to use to fix the world.\nThen\nthey stand there with a dumb look on their face… trying to drive a\nnail with a broken hammer… and cannot understand why it isn’t working.\nThis process is as true of the Episcopalian Church and the Boy Scouts of America as it is of the SFWA.  Some believe that destruction was always the aim, but I don’t think that is true of the average parasite who joins an organization. I think in most cases they genuinely wish to “improve” the organization and do not understand that their desired improvements will kill it.\nI’ll write more on this in the next day or two, in my response to NK Jemisin’s call for further “reconciliation”. What is interesting is the way in which Nate’s description here perfectly describes her approach to “improving” SF/F.\nTheir analytical abilities don’t appear to exceed that of the average cancer cell. The current SFWA is rather like a collection of cancer cells congratulating themselves on how much they have improved the body they are inhabiting and celebrating the way in which they have driven most of those disgusting, unprofessional white blood cells out.  And it is not hard to imagine their alarm when suddenly the body that sustains them begins to cease functioning, for no particular reason at all.\nThis is something that the Society for the Advancement of Speculative Storytelling may wish to keep in mind, lest it one day find itself going the same route as SFWA.  And speaking of SASS, the organization released a statement entitled: “\nStatement on the expulsion of a member by another writers’ organization\n“\nIn response to requests for comments regarding the decision of another writers’ group to formally expel a lifetime member, SASS Secretary and spokesman Lou Antonelli makes the following statement:\n“Although the subject in question was exercising his free speech rights under the First Amendment to the US Constitution, that has nothing to do with the standards of conduct and behavior within a private organization\n“Like any private club, the organization in question is allowed to police its membership according to its regulations and bylaws. This is an internal discipline issue and not a matter of concern to the Society for the Advancement of Speculative Storytelling.\n“The by-laws of the Society for the Advancement of Speculative Storytelling clearly state that members should not discuss religion or politics within its auspices, and its members are expected to treat each other with respect. Those are our bylaws, and each group operates according to its own bylaws and policies.\nI note that not only does SFWA have no standard of conduct and behavior, but it previously had one that was, if I recall correctly, junked during the Russell Davis administration.  As the SFWA’s statement demonstrated, the current Board believes it can throw anyone out of the organization at any time for no particular reason at all.  If I hadn’t made it clear to everyone that I was the member to whom the statement referred, no one would outside the SFWA Board and its confidants would even know with certainty who the expelled member was.\nOf course, it would certainly be amusing if the Board’s assumptions turned out to be incorrect, would it not?  Because in that case, I would not even be expelled at all. And it occurs to me that someone inclined towards conspiracy theory might even conjecture that the reason the SFWA Board refused to publicly identify the expelled member is because they know very well that the expulsion was not legitimate, that it was a sham expulsion, and they are attempting to avoid being sued for damages once the illegitimacy of their action is established.",
  "tags": [
    "politics",
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-19T12:00:00+00:00"
}