{
  "url": "https://voxday.net/2013/08/17/mailvox-comparative-racisms/",
  "scraped_at": "2025-12-14T22:39:06.696941",
  "title": "Mailvox: comparative racisms",
  "date_display": "August 17, 2013",
  "date_iso": "2013-08-17T11:05:00+00:00",
  "date_from_url": "2013-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Myrddin compares my purported racism to N.K. Jemisin’s <a href=\"http://madgeniusclub.com/2013/08/15/the-organization-formerly-known-as-sfwa/#comment-28512\">at the Mad Genius club</a>:</p><blockquote class=\"tr_bq\"><p> [Vox]-style racism is far less direct.  So<br> far, he’s pointed out that according to the Theory of Evolution (to<br> which he does not subscribe, but he never brings THAT up at the time<br> because he is a pro a-hole), different races are not equally<br> homo-sapiens (which does not mean that they aren’t equally validly human<br> or equally worthwhile, but he never brings THAT up at the time because<br> he enjoys being a pro a-hole).  Other than that, his primary ‘racism’ is<br> the frequent claim that when wildly different cultures mix, the results<br> tend to be explosive.</br></br></br></br></br></br></br></br></p><p>Jemism’s style, on the other hand, seems to be “whites are<br> intrinsically racist because they are white.”  To which my only response<br> can be “If you will judge evil regardless of my actions, what possible<br> motivation could I have to appease you?”</br></br></br></p><p>So… a bit of a stretch, yes, in that if he’s a racist, he has plausible deniability.  She really doesn’t.</p></blockquote><div class=\"comment-body\"> He is far from the only one to observe that Ms Jemisin is, and always has been, an unrepentant black racist who angrily blames all white people for a broad panoply of material evils for which they cannot reasonably be held responsible.  Will Shetterly <a href=\"http://shetterly.blogspot.com/2013/07/on-vox-day-and-n-k-jemisin-feuding.html\">has similarly observed</a> that Jemisin is of the Critical Race Theory school; she is about as moderate as Elijah Poole. Jemisin’s cartoonish behavior was precisely why I nicknamed her McRacist in the first place and I suspect one could produce a pretty funny cartoon strip about the Superheroes of the SFWA featuring McRapey, McRacist, and McCreepy.<p>However, I have to correct Myrddin on two points. First, my statement concerning the way in which different races are not equally<br> <i>homo sapiens sapiens</i> has absolutely nothing to do with the theory of<br> evolution. Although one could reach that conclusion, as it logically follows from conventional evolutionary theory, my statement is nothing more than the citation of current scientific evidence, namely, DNA differences observed<br> in the various human population groups.</br></br></br></p><p>Second, I have repeatedly pointed out that the existence of different<br> human sub-species and/or races does not make those different<br> sub-species and/or races any less validly human.  A dog is a dog whether<br> it is a Bichon Frise or a Great Dane.  A man is a man whether he is Yoruba or Prussian. My basic argument on race and<br> civilization can be most accurately summarized as the observation that if you wish to<br> pull a sled, you would be well advised to select Siberian huskies rather than<br> chihuahuas or pit bulls.</br></br></br></br></br></br></p><p>The deniability is plausible due to the fact that I am denying the nonexistent.</p></div></div>",
  "content_text": "Myrddin compares my purported racism to N.K. Jemisin’s\nat the Mad Genius club\n:\n[Vox]-style racism is far less direct.  So\nfar, he’s pointed out that according to the Theory of Evolution (to\nwhich he does not subscribe, but he never brings THAT up at the time\nbecause he is a pro a-hole), different races are not equally\nhomo-sapiens (which does not mean that they aren’t equally validly human\nor equally worthwhile, but he never brings THAT up at the time because\nhe enjoys being a pro a-hole).  Other than that, his primary ‘racism’ is\nthe frequent claim that when wildly different cultures mix, the results\ntend to be explosive.\nJemism’s style, on the other hand, seems to be “whites are\nintrinsically racist because they are white.”  To which my only response\ncan be “If you will judge evil regardless of my actions, what possible\nmotivation could I have to appease you?”\nSo… a bit of a stretch, yes, in that if he’s a racist, he has plausible deniability.  She really doesn’t.\nHe is far from the only one to observe that Ms Jemisin is, and always has been, an unrepentant black racist who angrily blames all white people for a broad panoply of material evils for which they cannot reasonably be held responsible.  Will Shetterly\nhas similarly observed\nthat Jemisin is of the Critical Race Theory school; she is about as moderate as Elijah Poole. Jemisin’s cartoonish behavior was precisely why I nicknamed her McRacist in the first place and I suspect one could produce a pretty funny cartoon strip about the Superheroes of the SFWA featuring McRapey, McRacist, and McCreepy.\nHowever, I have to correct Myrddin on two points. First, my statement concerning the way in which different races are not equally\nhomo sapiens sapiens\nhas absolutely nothing to do with the theory of\nevolution. Although one could reach that conclusion, as it logically follows from conventional evolutionary theory, my statement is nothing more than the citation of current scientific evidence, namely, DNA differences observed\nin the various human population groups.\nSecond, I have repeatedly pointed out that the existence of different\nhuman sub-species and/or races does not make those different\nsub-species and/or races any less validly human.  A dog is a dog whether\nit is a Bichon Frise or a Great Dane.  A man is a man whether he is Yoruba or Prussian. My basic argument on race and\ncivilization can be most accurately summarized as the observation that if you wish to\npull a sled, you would be well advised to select Siberian huskies rather than\nchihuahuas or pit bulls.\nThe deniability is plausible due to the fact that I am denying the nonexistent.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2013-08-17T10:05:00+00:00"
}