{
  "url": "https://voxday.net/2013/08/18/mailvox-answering-simple-question/",
  "scraped_at": "2025-12-14T22:39:14.052975",
  "title": "Mailvox: answering a simple question",
  "date_display": "August 18, 2013",
  "date_iso": "2013-08-18T13:00:00+00:00",
  "date_from_url": "2013-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Will Shetterly <a href=\"http://shetterly.blogspot.com/2013/08/a-simple-question-for-n-k-jemisin-and.html\" rel=\"noopener\" target=\"_blank\">poses questions for me and for NK Jemisin</a>. I don’t know if she will see fit to answer him, but I certainly don’t mind doing so:</p><blockquote class=\"tr_bq\"><p> What do you want, besides book sales? You both have strongly-held beliefs, <a href=\"http://sjwar.blogspot.com/2012/07/the-man-who-changed-middle-class.html\">Critical Race Theory</a> and <a href=\"http://www.bigwowo.com/2011/10/the-perversity-of-human-biodiversity-a-k-a-scientific-racism/\">Human Biodiversity</a>, but you’re both silent about the practical application of those beliefs.</p><p>Vox Day, you <a href=\"http://www.milobookclub.com/2013/08/17/mailvox-comparative-racisms/\">say</a>:</p><p><i>“I have repeatedly pointed out that the existence of different human<br> sub-species and/or races does not make those different sub-species<br> and/or races any less validly human. A dog is a dog whether it is a<br> Bichon Frise or a Great Dane. A man is a man whether he is Yoruba or<br> Prussian. My basic argument on race and civilization can be most<br> accurately summarized as the observation that if you wish to pull a<br> sled, you would be well advised to select Siberian huskies rather than<br> chihuahuas or pit bulls.”</br></br></br></br></br></br></br></i></p><p>If people with your beliefs were in power, what changes would there be?<br> Legal segregation of the races as you understand them? A ban on<br> miscegenation? Breeding programs to increase the virtues you see in the<br> different human races, stronger blacks and smarter Asians to serve the<br> more “alpha” whites?</br></br></br></br></p></blockquote><p>Let me first point out something that many people fail to keep in mind when they are occupied with being offended at something I have said. I am a libertarian, so it should always be kept in mind that I am intrinsically skeptical of the idea that government can be effectively utilized to solve most societal problems, or even avoid making them worse, regardless of how serious we all agree those problems happen to be.  The fact that I point to something as being a problem should NEVER be taken as an implicit suggestion that the solution can be found in government action.</p><p>With regards to race, I would be more than content to see the U.S. federal government and other governments across the West firmly respect the right to self-determination, the right to free speech, and the right to freedom of economic association on the part of individual, as well as the political sovereignty of the several States.</p><p>This would likely lead to legal segregation in some states, most likely beginning, ironically enough, with the States where Hispanics are expected to soon be the majority. In most of the rest, I expect a return to Constitutional federalism and the concept of democratic laboratories would merely lead to bans on enforced desegregation and government violations of the freedom of association; history indicates that people have a tendency to naturally segregate as that is how most of the various population groups were formed in the first place.</p><p>I do not support bans on miscegenation nor do I believe they would be required in any environment that permitted genuine freedom of speech and association. Despite being inundated with heavy doses of pro-miscegenation and pro-equalitarian propaganda in the media, relatively few women of any race have shown themselves to be open to sexual involvement with men of other races.</p><p>Being an anti-eugenicist, I do not support breeding programs of any kind, especially not government-sponsored programs.</p><p>As for the idea of stronger blacks and smarter Asians serving whites, that could not be further from my own position on ideal interracial relations. My belief is that every population group, every human sub-species, every nation, is better served by furthering a homogeneous group interest.  To put it crudely, whites would do well to pick their own cotton and count their own money, blacks would do well to build their own power stations and grow their own crops, and yellows would do well to develop their own technologies and establish their own university systems. Let Israel be Israel and let Myanmar be Myanmar.</p><p>Inter-societal communication and assistance is a good thing, so long as it is the sort that involves teaching men to fish and not fishing for them… and if the fishermen are left alone to deal with the consequences of their catch. Trade is generally good. Information exchange is generally good. Even immigration can beneficial in small and limited doses. But the benefits of moderation does not extend to the extremes. For example, trade can benefit both sides, but truly free trade will inevitably destroy the more prosperous side.</p><p>It should be noted that the consequences of mass migration are all but indistinguishable from the effects of invasion and occupation, and multi-ethnic societies have shown a strong historical tendency to collapse amidst vicious ethnic violence. No one who recalls the intra-black violence in Rwanda, the intra-white violence in Yugoslavia, or the intra-yellow violence in Vietnam should be misled into thinking that expanding the range of population heterogeneousity is going to alleviate, rather than exacerbate, the eventual inter-ethnic violence.  Ms Jemisin may be more right than she knows about how everyone will eventually be forced to take a side, whether they want to or not.</p><p>I understand that three generations of Americans who have been raised to venerate the Civil Rights movement will find it hard, if not impossible, to grasp that history may ultimately prove to be firmly on the side of those they have always believed to be monsters of bigotry. But if what logic suggests is the most probable outcome indeed comes to pass, I suspect that forced segregation and non-violent ethnic cleansing will be the best case scenario in consequence of the damnable social engineering of the grand multicultural experiment that began in 1965.</p><p>It may already be too late for a peaceful return to historical segregation patterns. But if history is an even remotely reliable guide, the West will return to them one way or another. And keep in mind that my expectations of the future have nothing whatsoever to do with my personal preferences, any more than I wanted to see the global financial system seize up when I predicted the 2008 economic crisis six years before it happened.</p><p>There is a flaw in someone’s assumptions. The error may be on my part. But based on the known historical patterns as well as the way in which increased integration throughout the West has observably increased racial tensions rather than eliminating them as the multiculturalists so confidently asserted, I very much doubt it.</p><p>So, to answer the original question, what do I want? I want to preserve the greatest, most advanced, and most humane civilization the human race has ever known. I want the West to avoid descending into violence and chaos on a scale that will threaten to end our advanced civilization as we know it. And I believe continued mass migration, forced desegregation, reconciliation, government intervention, and racial integration only serve to increase the likelihood of a nightmarish scenario taking place.</p></div>",
  "content_text": "Will Shetterly\nposes questions for me and for NK Jemisin\n. I don’t know if she will see fit to answer him, but I certainly don’t mind doing so:\nWhat do you want, besides book sales? You both have strongly-held beliefs,\nCritical Race Theory\nand\nHuman Biodiversity\n, but you’re both silent about the practical application of those beliefs.\nVox Day, you\nsay\n:\n“I have repeatedly pointed out that the existence of different human\nsub-species and/or races does not make those different sub-species\nand/or races any less validly human. A dog is a dog whether it is a\nBichon Frise or a Great Dane. A man is a man whether he is Yoruba or\nPrussian. My basic argument on race and civilization can be most\naccurately summarized as the observation that if you wish to pull a\nsled, you would be well advised to select Siberian huskies rather than\nchihuahuas or pit bulls.”\nIf people with your beliefs were in power, what changes would there be?\nLegal segregation of the races as you understand them? A ban on\nmiscegenation? Breeding programs to increase the virtues you see in the\ndifferent human races, stronger blacks and smarter Asians to serve the\nmore “alpha” whites?\nLet me first point out something that many people fail to keep in mind when they are occupied with being offended at something I have said. I am a libertarian, so it should always be kept in mind that I am intrinsically skeptical of the idea that government can be effectively utilized to solve most societal problems, or even avoid making them worse, regardless of how serious we all agree those problems happen to be.  The fact that I point to something as being a problem should NEVER be taken as an implicit suggestion that the solution can be found in government action.\nWith regards to race, I would be more than content to see the U.S. federal government and other governments across the West firmly respect the right to self-determination, the right to free speech, and the right to freedom of economic association on the part of individual, as well as the political sovereignty of the several States.\nThis would likely lead to legal segregation in some states, most likely beginning, ironically enough, with the States where Hispanics are expected to soon be the majority. In most of the rest, I expect a return to Constitutional federalism and the concept of democratic laboratories would merely lead to bans on enforced desegregation and government violations of the freedom of association; history indicates that people have a tendency to naturally segregate as that is how most of the various population groups were formed in the first place.\nI do not support bans on miscegenation nor do I believe they would be required in any environment that permitted genuine freedom of speech and association. Despite being inundated with heavy doses of pro-miscegenation and pro-equalitarian propaganda in the media, relatively few women of any race have shown themselves to be open to sexual involvement with men of other races.\nBeing an anti-eugenicist, I do not support breeding programs of any kind, especially not government-sponsored programs.\nAs for the idea of stronger blacks and smarter Asians serving whites, that could not be further from my own position on ideal interracial relations. My belief is that every population group, every human sub-species, every nation, is better served by furthering a homogeneous group interest.  To put it crudely, whites would do well to pick their own cotton and count their own money, blacks would do well to build their own power stations and grow their own crops, and yellows would do well to develop their own technologies and establish their own university systems. Let Israel be Israel and let Myanmar be Myanmar.\nInter-societal communication and assistance is a good thing, so long as it is the sort that involves teaching men to fish and not fishing for them… and if the fishermen are left alone to deal with the consequences of their catch. Trade is generally good. Information exchange is generally good. Even immigration can beneficial in small and limited doses. But the benefits of moderation does not extend to the extremes. For example, trade can benefit both sides, but truly free trade will inevitably destroy the more prosperous side.\nIt should be noted that the consequences of mass migration are all but indistinguishable from the effects of invasion and occupation, and multi-ethnic societies have shown a strong historical tendency to collapse amidst vicious ethnic violence. No one who recalls the intra-black violence in Rwanda, the intra-white violence in Yugoslavia, or the intra-yellow violence in Vietnam should be misled into thinking that expanding the range of population heterogeneousity is going to alleviate, rather than exacerbate, the eventual inter-ethnic violence.  Ms Jemisin may be more right than she knows about how everyone will eventually be forced to take a side, whether they want to or not.\nI understand that three generations of Americans who have been raised to venerate the Civil Rights movement will find it hard, if not impossible, to grasp that history may ultimately prove to be firmly on the side of those they have always believed to be monsters of bigotry. But if what logic suggests is the most probable outcome indeed comes to pass, I suspect that forced segregation and non-violent ethnic cleansing will be the best case scenario in consequence of the damnable social engineering of the grand multicultural experiment that began in 1965.\nIt may already be too late for a peaceful return to historical segregation patterns. But if history is an even remotely reliable guide, the West will return to them one way or another. And keep in mind that my expectations of the future have nothing whatsoever to do with my personal preferences, any more than I wanted to see the global financial system seize up when I predicted the 2008 economic crisis six years before it happened.\nThere is a flaw in someone’s assumptions. The error may be on my part. But based on the known historical patterns as well as the way in which increased integration throughout the West has observably increased racial tensions rather than eliminating them as the multiculturalists so confidently asserted, I very much doubt it.\nSo, to answer the original question, what do I want? I want to preserve the greatest, most advanced, and most humane civilization the human race has ever known. I want the West to avoid descending into violence and chaos on a scale that will threaten to end our advanced civilization as we know it. And I believe continued mass migration, forced desegregation, reconciliation, government intervention, and racial integration only serve to increase the likelihood of a nightmarish scenario taking place.",
  "tags": [
    "mailvox",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-18T12:00:00+00:00"
}