{
  "url": "https://voxday.net/2013/08/31/obama-syria-is-on/",
  "scraped_at": "2025-12-14T22:40:40.903277",
  "title": "Obama: Syria is on",
  "date_display": "August 31, 2013",
  "date_iso": "2013-08-31T19:03:00+00:00",
  "date_from_url": "2013-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or maybe not.  I have to wonder if Obama is hoping Congress will bail him out by refusing to provide <a href=\"http://www.foxnews.com/politics/2013/08/31/president-obama-says-us-must-act-on-syria/\">the authorization sought</a>:</p><blockquote class=\"tr_bq\"><p> President Obama announced Saturday that he has concluded the United<br> States should take military action against Syrian President Bashar<br> al-Assad and his regime for using chemical weapons on civilians, but<br> will first seek authorization from Congress.</br></br></br></p></blockquote><p>My suspicions regarding this are mostly aroused by the fact that historically, most military actions haven’t waited on Congressional summer vacations.</p><p>UPDATE: Oops.  It turns out the rebels are even admitting that they were responsible for the chemical weapons attack:</p><p><i>“In a report that is sure to be considered blockbuster news, the<br> rebels told Dale Gavlak, a reporter who has written for the Associated<br> Press, NPR and BBC, they are responsible for the <a class=\"inline_link\" href=\"http://www.examiner.com/topic/chemical-attack\">chemical attack</a> last week.</br></br></i></p><p><i><br> </br></i><i>“Gavlak is a Middle Eastern journalist who filed the report about the<br> rebels claiming responsibility on the Mint Press News website, which is<br> affiliated with AP. In that report allegedly the rebels told him the chemical attack was a result of mishandling chemical weapons….</br></br></i></p><p><i>“Gavlak reports he was told by rebels that the gas “attack” was the<br> result of rebels mishandling the chemical weapons they acquired from the<br> <a class=\"inline_link\" href=\"http://www.examiner.com/topic/saudis\">Saudis</a>. He says in the Mint Press report the following:</br></br></i></p><p><i><br> </br></i><i>“”They didn’t tell us what these arms were or how to use them,”<br> complained a female fighter named ‘K.’ “We didn’t know they were<br> chemical weapons. We never imagined they were chemical weapons.””</br></br></i></p><p>This tends to raise an obvious question: from whom did the Saudis obtain the chemical weapons?<i> </i></p></div>",
  "content_text": "Or maybe not.  I have to wonder if Obama is hoping Congress will bail him out by refusing to provide\nthe authorization sought\n:\nPresident Obama announced Saturday that he has concluded the United\nStates should take military action against Syrian President Bashar\nal-Assad and his regime for using chemical weapons on civilians, but\nwill first seek authorization from Congress.\nMy suspicions regarding this are mostly aroused by the fact that historically, most military actions haven’t waited on Congressional summer vacations.\nUPDATE: Oops.  It turns out the rebels are even admitting that they were responsible for the chemical weapons attack:\n“In a report that is sure to be considered blockbuster news, the\nrebels told Dale Gavlak, a reporter who has written for the Associated\nPress, NPR and BBC, they are responsible for the\nchemical attack\nlast week.\n“Gavlak is a Middle Eastern journalist who filed the report about the\nrebels claiming responsibility on the Mint Press News website, which is\naffiliated with AP. In that report allegedly the rebels told him the chemical attack was a result of mishandling chemical weapons….\n“Gavlak reports he was told by rebels that the gas “attack” was the\nresult of rebels mishandling the chemical weapons they acquired from the\nSaudis\n. He says in the Mint Press report the following:\n“”They didn’t tell us what these arms were or how to use them,”\ncomplained a female fighter named ‘K.’ “We didn’t know they were\nchemical weapons. We never imagined they were chemical weapons.””\nThis tends to raise an obvious question: from whom did the Saudis obtain the chemical weapons?",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-31T18:03:00+00:00"
}