{
  "url": "https://voxday.net/2013/08/24/predictable-consequences/",
  "scraped_at": "2025-12-14T22:39:55.261418",
  "title": "Predictable consequences",
  "date_display": "August 24, 2013",
  "date_iso": "2013-08-24T13:45:00+00:00",
  "date_from_url": "2013-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s absolutely hilarious to see the mainstream media and government employees complaining about private citizens putting what they have learned from the IRS and the mortgage banks <a href=\"http://www.nytimes.com/2013/08/24/us/citizens-without-a-country-wage-battle-with-liens.html?hp\" rel=\"noopener\" target=\"_blank\">into action</a>:</p><blockquote class=\"tr_bq\"><p> “It must be a mistake,” he said, when the loan officer told him that<br> someone had placed liens totaling more than $25 million on his house and<br> on other properties he owned.</br></br></p><p>But as Sheriff Stanek soon learned, the liens, legal claims on property<br> to secure the payment of a debt, were just the earliest salvos in a war<br> of paper, waged by a couple who had lost their home to foreclosure in<br> 2009 — a tactic that, with the spread of an anti-government ideology<br> known as the “sovereign citizen” movement, is being employed more<br> frequently as a way to retaliate against perceived injustices.</br></br></br></br></br></p><p>Over the next three years, the couple, Thomas and Lisa Eilertson, filed<br> more than $250 billion in liens, demands for compensatory damages and<br> other claims against more than a dozen people, including the sheriff,<br> county attorneys, the Hennepin County registrar of titles and other<br> court officials.</br></br></br></br></p><p>“It affects your credit rating, it affected my wife, it affected my<br> children,” Sheriff Stanek said of the liens. “We spent countless hours<br> trying to undo it.”</br></br></p><p>Cases involving sovereign citizens are surfacing increasingly here in<br> Minnesota and in other states, posing a challenge to law enforcement<br> officers and court officials, who often become aware of the movement — a<br> loose network of groups and individuals who do not recognize the<br> authority of federal, state or municipal government — only when they<br> become targets. Although the filing of liens for outrageous sums or<br> other seemingly frivolous claims might appear laughable, dealing with<br> them can be nightmarish, so much so that the F.B.I. has labeled the<br> strategy “paper terrorism.” A lien can be filed by anyone under the<br> Uniform Commercial Code.</br></br></br></br></br></br></br></br></br></p></blockquote><p>These liens, and many of the “frivolous” claims made by various private citizens are not necessarily fraudulent in the legal sense. There can be no question that they are no more fake than the millions of liens and foreclosures filed by mortgage banks that never held title to the properties they seized and no more illegal than the private MERS system that those banks tried to substitute for the historical county land records.</p><p>That is precisely why dealing with them can be so nightmarish; because they are as legal and legally enforceable as anything that the courts produce.  This is nothing but a natural consequence of the government declaring itself and its agents above the rule of law and then being surprised when the people follow its lead.</p><p>This is how a civilization falls, one step into barbaric chaos at a time. </p></div>",
  "content_text": "It’s absolutely hilarious to see the mainstream media and government employees complaining about private citizens putting what they have learned from the IRS and the mortgage banks\ninto action\n:\n“It must be a mistake,” he said, when the loan officer told him that\nsomeone had placed liens totaling more than $25 million on his house and\non other properties he owned.\nBut as Sheriff Stanek soon learned, the liens, legal claims on property\nto secure the payment of a debt, were just the earliest salvos in a war\nof paper, waged by a couple who had lost their home to foreclosure in\n2009 — a tactic that, with the spread of an anti-government ideology\nknown as the “sovereign citizen” movement, is being employed more\nfrequently as a way to retaliate against perceived injustices.\nOver the next three years, the couple, Thomas and Lisa Eilertson, filed\nmore than $250 billion in liens, demands for compensatory damages and\nother claims against more than a dozen people, including the sheriff,\ncounty attorneys, the Hennepin County registrar of titles and other\ncourt officials.\n“It affects your credit rating, it affected my wife, it affected my\nchildren,” Sheriff Stanek said of the liens. “We spent countless hours\ntrying to undo it.”\nCases involving sovereign citizens are surfacing increasingly here in\nMinnesota and in other states, posing a challenge to law enforcement\nofficers and court officials, who often become aware of the movement — a\nloose network of groups and individuals who do not recognize the\nauthority of federal, state or municipal government — only when they\nbecome targets. Although the filing of liens for outrageous sums or\nother seemingly frivolous claims might appear laughable, dealing with\nthem can be nightmarish, so much so that the F.B.I. has labeled the\nstrategy “paper terrorism.” A lien can be filed by anyone under the\nUniform Commercial Code.\nThese liens, and many of the “frivolous” claims made by various private citizens are not necessarily fraudulent in the legal sense. There can be no question that they are no more fake than the millions of liens and foreclosures filed by mortgage banks that never held title to the properties they seized and no more illegal than the private MERS system that those banks tried to substitute for the historical county land records.\nThat is precisely why dealing with them can be so nightmarish; because they are as legal and legally enforceable as anything that the courts produce.  This is nothing but a natural consequence of the government declaring itself and its agents above the rule of law and then being surprised when the people follow its lead.\nThis is how a civilization falls, one step into barbaric chaos at a time.",
  "tags": [
    "decline and fall",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-24T12:45:00+00:00"
}