{
  "url": "https://voxday.net/2013/08/26/privatizing-state-departmen/",
  "scraped_at": "2025-12-14T22:40:08.137674",
  "title": "Privatizing the State Department",
  "date_display": "August 26, 2013",
  "date_iso": "2013-08-26T17:00:00+00:00",
  "date_from_url": "2013-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Never forget that <a href=\"http://www.zerohedge.com/news/2013-08-26/julian-assange-reveals-googles-covert-role-foaming-uprisings\" rel=\"noopener\" target=\"_blank\">corporations are creations of government</a>:</p><blockquote class=\"tr_bq\"><p> Back in 2011 I had a meeting with Eric Schmidt, the then Chairman of<br> Google, who came out to see me with three other people while I was under<br> house arrest. You might suppose that coming to see me was gesture that<br> he and the other big boys at Google were secretly on our side: that they<br> support what we at WikiLeaks are struggling for: justice, government<br> transparency, and privacy for individuals.</br></br></br></br></br></p><p>But that would be a false<br> supposition. Their agenda was much more complex, and as we found out,<br> was inextricable from that of the US State Department. The full<br> transcript of our meeting is available online through the WikiLeaks<br> website. The pretext for their visit was that Schmidt was then researching a new book, a banal tome which has since come out as <i>The New Digital Age</i>.<br> My less than enthusiastic review of this book was published in the New<br> York Times in late May of this year. On the back of that book are a<br> series of pre-publication endorsements: Henry Kissinger, Bill Clinton,<br> Madeleine Albright, Michael Hayden (former head of the CIA and NSA) and<br> Tony Blair. Inside the book Henry Kissinger appears once again, this<br> time given pride of place in the acknowledgements.</br></br></br></br></br></br></br></br></br></br></p><p>Schmidt’s book is not about communicating with the public. He is<br> worth $6.1 billion and does not need to sell books. Rather, this book is<br> a mechanism by which Google seeks to project itself into Washington. It<br> shows Washington that Google can be its partner, its geopolitical<br> visionary, who will help Washington see further about America’s<br> interests. And by tying itself to the US state, Google thereby cements<br> its own security, at the expense of all competitors.</br></br></br></br></br></br></p><p>Two months after my meeting with Eric Schmidt, WikiLeaks had a legal<br> reason to call Hilary Clinton and to document that we were calling her.<br> It’s interesting that if you call the front desk of the State Department<br> and ask for Hillary Clinton, you can actually get pretty close, and<br> we’ve become quite good at this. Anyone who has seen Doctor Strangelove<br> may remember the fantastic scene when Peter Sellers calls the White<br> House from a payphone on the army base and is put on hold as his call<br> gradually moves through the levels. Well WikiLeaks journalist Sarah<br> Harrison, pretending to be my PA, put through our call to the State<br> Department, and like Peter Sellers we started moving through the levels,<br> and eventually we got up to Hillary Clinton’s senior legal advisor, who<br> said that we would be called back.</br></br></br></br></br></br></br></br></br></br></br></p><p>Shortly afterwards another one of our people, WikiLeaks’ ambassador<br> Joseph Farrell, received a call back, not from the State Department, but<br> from Lisa Shields, the then girlfriend of Eric Schmidt, who does not<br> formally work for the US State Department. So let’s reprise this<br> situation: The Chairman of Google’s girlfriend was being used as a back<br> channel for Hillary Clinton. This is illustrative. It shows that at this<br> level of US society, as in other corporate states, it is all musical<br> chairs.</br></br></br></br></br></br></br></p><p>That visit from Google while I was under house arrest was, as it<br> turns out, an unofficial visit from the State Department. Just consider<br> the people who accompanied Schmidt on that visit: his girlfriend Lisa<br> Shields, Vice President for Communications at the CFR; Scott Malcolmson,<br> former senior State Department advisor; and Jared Cohen,  advisor to<br> both Hillary Clinton and Condoleezza Rice, a kind of Generation Y<br> Kissinger figure — a noisy Quiet American as the author Graham Greene<br> might have put it.</br></br></br></br></br></br></br></p></blockquote><p>So, whatever happened to Don’t Be Evil?  Or, as I’ve previously thought, perhaps we should have all viewed Google with the same wariness that one views a kindergarten teacher who is constantly gritting his teeth and reminding himself: “Don’t touch the merchandise… don’t touch the merchandise.”</p></div>",
  "content_text": "Never forget that\ncorporations are creations of government\n:\nBack in 2011 I had a meeting with Eric Schmidt, the then Chairman of\nGoogle, who came out to see me with three other people while I was under\nhouse arrest. You might suppose that coming to see me was gesture that\nhe and the other big boys at Google were secretly on our side: that they\nsupport what we at WikiLeaks are struggling for: justice, government\ntransparency, and privacy for individuals.\nBut that would be a false\nsupposition. Their agenda was much more complex, and as we found out,\nwas inextricable from that of the US State Department. The full\ntranscript of our meeting is available online through the WikiLeaks\nwebsite. The pretext for their visit was that Schmidt was then researching a new book, a banal tome which has since come out as\nThe New Digital Age\n.\nMy less than enthusiastic review of this book was published in the New\nYork Times in late May of this year. On the back of that book are a\nseries of pre-publication endorsements: Henry Kissinger, Bill Clinton,\nMadeleine Albright, Michael Hayden (former head of the CIA and NSA) and\nTony Blair. Inside the book Henry Kissinger appears once again, this\ntime given pride of place in the acknowledgements.\nSchmidt’s book is not about communicating with the public. He is\nworth $6.1 billion and does not need to sell books. Rather, this book is\na mechanism by which Google seeks to project itself into Washington. It\nshows Washington that Google can be its partner, its geopolitical\nvisionary, who will help Washington see further about America’s\ninterests. And by tying itself to the US state, Google thereby cements\nits own security, at the expense of all competitors.\nTwo months after my meeting with Eric Schmidt, WikiLeaks had a legal\nreason to call Hilary Clinton and to document that we were calling her.\nIt’s interesting that if you call the front desk of the State Department\nand ask for Hillary Clinton, you can actually get pretty close, and\nwe’ve become quite good at this. Anyone who has seen Doctor Strangelove\nmay remember the fantastic scene when Peter Sellers calls the White\nHouse from a payphone on the army base and is put on hold as his call\ngradually moves through the levels. Well WikiLeaks journalist Sarah\nHarrison, pretending to be my PA, put through our call to the State\nDepartment, and like Peter Sellers we started moving through the levels,\nand eventually we got up to Hillary Clinton’s senior legal advisor, who\nsaid that we would be called back.\nShortly afterwards another one of our people, WikiLeaks’ ambassador\nJoseph Farrell, received a call back, not from the State Department, but\nfrom Lisa Shields, the then girlfriend of Eric Schmidt, who does not\nformally work for the US State Department. So let’s reprise this\nsituation: The Chairman of Google’s girlfriend was being used as a back\nchannel for Hillary Clinton. This is illustrative. It shows that at this\nlevel of US society, as in other corporate states, it is all musical\nchairs.\nThat visit from Google while I was under house arrest was, as it\nturns out, an unofficial visit from the State Department. Just consider\nthe people who accompanied Schmidt on that visit: his girlfriend Lisa\nShields, Vice President for Communications at the CFR; Scott Malcolmson,\nformer senior State Department advisor; and Jared Cohen,  advisor to\nboth Hillary Clinton and Condoleezza Rice, a kind of Generation Y\nKissinger figure — a noisy Quiet American as the author Graham Greene\nmight have put it.\nSo, whatever happened to Don’t Be Evil?  Or, as I’ve previously thought, perhaps we should have all viewed Google with the same wariness that one views a kindergarten teacher who is constantly gritting his teeth and reminding himself: “Don’t touch the merchandise… don’t touch the merchandise.”",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-26T16:00:00+00:00"
}