{
  "url": "https://voxday.net/2013/08/22/publishing-bias-and-new-vertical-markets/",
  "scraped_at": "2025-12-14T22:39:37.598100",
  "title": "Publishing bias and the new vertical markets",
  "date_display": "August 22, 2013",
  "date_iso": "2013-08-22T13:00:00+00:00",
  "date_from_url": "2013-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I take exception to Standout Author Larry Correia’s take on <a href=\"http://larrycorreia.wordpress.com/2013/08/21/publisher-cancels-book-contract-because-the-writer-is-gay/\" rel=\"noopener\" target=\"_blank\">Cedar Fort’s decision to cancel a publishing contract</a> given to a gay writer:</p><blockquote class=\"tr_bq\"><p> So Cedar Fort really likes a book submitted to them and says that they<br> think it will sell well. Cedar Fort gives a contract to these two<br> authors. They write their author bios. One mentions his “partner”<br> instead of his wife. Cedar Fort flips out and drops them.</br></br></br></p></blockquote><p>There are two schools of thought with dealing with the Left.  Larry’s is presently the dominant one among conservatives, which is that one should play by idealistic rules of ideological fair play that are observably no longer in effect. He notes, correctly, that this decision by Cedar Fort to blackball homosexuals is no different than the decision by major Manhattan publishers to blackball writers of the political Right.  He writes:</p><blockquote class=\"tr_bq\"><p> I keep seeing authors get black listed for their political opinions, and<br> since the publishing industry is mostly in Manhattan, it is usually<br> writers who lean right (righters?) that get blackballed. Of course, when<br> I talk about this on the internet, proper goodthinking people tell me<br> that’s crazy talk.</br></br></br></br></p></blockquote><p>As one of the few writers who has been blackballed by both left-wing Manhattan publishers AND right-wing regional publishers, (Thomas Nelson canceled the contract for <i>Media Whores</i> when it discovered that I was going to address various Fox News figures in addition to the mainstream media figures they expected to be targeted), I actually think it is a positive development that these publishing biases of left and right are exposed and made more visible to the reading public.</p><p>The observable fact is that all publishing houses are ideologically biased and none of them are solely motivated by business concerns due to the fact that the editors are human, and their financial interests in the publishing houses for which they work is generally negligible.  Their bias is further compounded by the fact that none of them has any real ability to know what will, and what will not, sell well, which means that they will always be free to indulge their ideological biases with regards to every writer who does not already have an established track record of considerable success.</p><p>My opinion is that it is a serious mistake for the Right to attempt to remain above the fray and refuse to play by the rules established by the Left.  As the example of Fox News shows, as the example of Larry’s own exceptional literary success shows, the Right has considerable economic power.  However, the Right has long played into the hands of the Left by being more than willing to financially sustain the Left while the Left is doing its level best to financially starve the Right. Many conservatives fall all over themselves to proclaim how eager they are to read books by gay black handicapped communist Che Guevara enthusiasts in a futile attempt to establish their cultural impartiality.</p><p>Which means that in the cultural civil war, the Left is playing the role of the ruthless Union while the Right is playing the role of a Confederacy that is too gentlemanly and refined to take the opposition seriously.  You may recall who won that war, and how.</p><p>I fully accept that no matter how many books I write, no matter how many games I sell, Tor and its filthy editors will never publish my books.  That is absolutely and entirely fine with me.  I never wanted to have anything to do with such despicable creatures, which is why I never submitted anything to them even prior to the changes in the publishing industry that are rendering the mainstream publishers less necessary than before.  I have no problem with the fact that the<i><b> 4,000 daily readers</b></i> of Whatever will never buy my books or with the fact that many left-wing fans of epic fantasy will prefer to wait another five years to slog through George R.R. Martin’s next interminable self-parody than read <i>A Throne of Bones</i>.  I realize, as I expect Larry does as well, that there are thousands of SF/F readers who will never even look at <i>The Grimnoire Chronicles</i> because they are written by an avid gun enthusiast and published by Baen Books.</p><p>And, in like manner, left-wing writers should learn to accept that right-leaning publishers will not work with them and an increasing number of right-leaning consumers will not read their works.  The age of the uniform mass market and its ideological impartiality is over and the age of ideologically-based vertical markets is upon us. The sooner everyone on the right side of the ideological aisle embraces that fact <i>and begins to act accordingly</i>, the sooner we will be able to stop swimming in the moral filth, breathing in the philosophical effluvia, and wandering aimlessly throughout the creative wasteland of the Left.</p><p>Larry, I have no doubt, will disagree with my opinion.  So will a number of other writers on the Right. And that’s fine, as we can disagree about this and debate this without feeling any need to excommunicate each other or rigidly enforce a dogmatic consensus because we are not rabbits of the Left.</p></div>",
  "content_text": "In which I take exception to Standout Author Larry Correia’s take on\nCedar Fort’s decision to cancel a publishing contract\ngiven to a gay writer:\nSo Cedar Fort really likes a book submitted to them and says that they\nthink it will sell well. Cedar Fort gives a contract to these two\nauthors. They write their author bios. One mentions his “partner”\ninstead of his wife. Cedar Fort flips out and drops them.\nThere are two schools of thought with dealing with the Left.  Larry’s is presently the dominant one among conservatives, which is that one should play by idealistic rules of ideological fair play that are observably no longer in effect. He notes, correctly, that this decision by Cedar Fort to blackball homosexuals is no different than the decision by major Manhattan publishers to blackball writers of the political Right.  He writes:\nI keep seeing authors get black listed for their political opinions, and\nsince the publishing industry is mostly in Manhattan, it is usually\nwriters who lean right (righters?) that get blackballed. Of course, when\nI talk about this on the internet, proper goodthinking people tell me\nthat’s crazy talk.\nAs one of the few writers who has been blackballed by both left-wing Manhattan publishers AND right-wing regional publishers, (Thomas Nelson canceled the contract for\nMedia Whores\nwhen it discovered that I was going to address various Fox News figures in addition to the mainstream media figures they expected to be targeted), I actually think it is a positive development that these publishing biases of left and right are exposed and made more visible to the reading public.\nThe observable fact is that all publishing houses are ideologically biased and none of them are solely motivated by business concerns due to the fact that the editors are human, and their financial interests in the publishing houses for which they work is generally negligible.  Their bias is further compounded by the fact that none of them has any real ability to know what will, and what will not, sell well, which means that they will always be free to indulge their ideological biases with regards to every writer who does not already have an established track record of considerable success.\nMy opinion is that it is a serious mistake for the Right to attempt to remain above the fray and refuse to play by the rules established by the Left.  As the example of Fox News shows, as the example of Larry’s own exceptional literary success shows, the Right has considerable economic power.  However, the Right has long played into the hands of the Left by being more than willing to financially sustain the Left while the Left is doing its level best to financially starve the Right. Many conservatives fall all over themselves to proclaim how eager they are to read books by gay black handicapped communist Che Guevara enthusiasts in a futile attempt to establish their cultural impartiality.\nWhich means that in the cultural civil war, the Left is playing the role of the ruthless Union while the Right is playing the role of a Confederacy that is too gentlemanly and refined to take the opposition seriously.  You may recall who won that war, and how.\nI fully accept that no matter how many books I write, no matter how many games I sell, Tor and its filthy editors will never publish my books.  That is absolutely and entirely fine with me.  I never wanted to have anything to do with such despicable creatures, which is why I never submitted anything to them even prior to the changes in the publishing industry that are rendering the mainstream publishers less necessary than before.  I have no problem with the fact that the\n4,000 daily readers\nof Whatever will never buy my books or with the fact that many left-wing fans of epic fantasy will prefer to wait another five years to slog through George R.R. Martin’s next interminable self-parody than read\nA Throne of Bones\n.  I realize, as I expect Larry does as well, that there are thousands of SF/F readers who will never even look at\nThe Grimnoire Chronicles\nbecause they are written by an avid gun enthusiast and published by Baen Books.\nAnd, in like manner, left-wing writers should learn to accept that right-leaning publishers will not work with them and an increasing number of right-leaning consumers will not read their works.  The age of the uniform mass market and its ideological impartiality is over and the age of ideologically-based vertical markets is upon us. The sooner everyone on the right side of the ideological aisle embraces that fact\nand begins to act accordingly\n, the sooner we will be able to stop swimming in the moral filth, breathing in the philosophical effluvia, and wandering aimlessly throughout the creative wasteland of the Left.\nLarry, I have no doubt, will disagree with my opinion.  So will a number of other writers on the Right. And that’s fine, as we can disagree about this and debate this without feeling any need to excommunicate each other or rigidly enforce a dogmatic consensus because we are not rabbits of the Left.",
  "tags": [
    "politics",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-22T12:00:00+00:00"
}