{
  "url": "https://voxday.net/2013/08/29/rating-epic-fantasies_29/",
  "scraped_at": "2025-12-14T22:40:26.365663",
  "title": "Rating the epic fantasies",
  "date_display": "August 29, 2013",
  "date_iso": "2013-08-29T14:00:00+00:00",
  "date_from_url": "2013-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After taking everyone’s opinions into account, I removed a few<br> series, added a few more, and came up with the following order. <br> Underlining indicates an incomplete series, or at least one I deem insufficiently complete to conclusively judge, while italics indicates a series I have not personally<br> read.</br></br></br></p><ol><li>The Lord of the Rings, Tolkien</li><li>The First Law, Abercrombie</li><li>Malazan Book of the Fallen, Erikson</li><li><u>A Song of Ice and Fire, Martin</u></li><li>The Black Company, Cook</li><li>Dragonlance, Weis &amp; Hickman</li><li>The Chronicles of Thomas Covenant, Donaldson</li><li>The Riftwar Saga, Feist</li><li>The Long Price Quartet, Abraham</li><li><u>The Demon Cycle, Brett  </u></li><li><u>The Stormlight Archive, Sanderson </u></li><li>The Belgariad/The Mallorean, Eddings</li><li>Codex Alera, Butcher</li><li>The Prince of Nothing, Bakker</li><li><i>Memory, Sorrow, and Thorn, Williams</i></li><li>The Deathgate Cycle, Weis and Hickman  </li><li>The Wheel of Time, Jordan/Sanderson</li><li>The Sword of Truth, Goodkind</li><li>Shannara, Brooks<u> </u></li><li><u>The Red Knight, Cameron</u></li></ol><p>No doubt many will disagree with my opinions here, but they are<br> not arbitrary.  First, I’m judging the series as a whole.  One thing<br> I’ve noticed is a lot of series take a serious nosedive after a certain<br> point.  The Chronicles of Thomas Covenant would be number two on this<br> list if judged solely on the first two Chronicles, (six books). <br> Bakker’s series would have cracked the top ten were it not for the<br> abysmal third book. And as crazy as it sounds, Martin could freefall if<br> he doesn’t turn it around in this next book; post Dance, the “American<br> Tolkien” already sounds silly.</br></br></br></br></br></br></br></br></p><p>I tend to suspect<br> Brandon Sanderson will move up and Peter Brett will move down.  Brett<br> started great, but his demon world is a boring hive mind and he never<br> got around to actually writing about eponymous Daylight War in the third<br> book.  I suspect that he may have fallen victim to Epic Author Disease<br> even faster than Jordan or Martin did.</br></br></br></br></br></p><p>There<br> are series that I love, that I consider much better than most of the<br> series on this list.  But they’re not epic, by which I mean I regard<br> them as books that on some level are doing something similar to what I’m<br> attempting to do.  The whole reason that I’ve been closely considering<br> the various epic fantasy series is to avoid the problems that have<br> plagued some of these series in the past.</br></br></br></br></br></br></p><p>It’s<br> too soon to judge ATOB, but good or bad, I can hope to keep improving. <br> Some would even say there is considerable room for it….</br></br></p></div>",
  "content_text": "After taking everyone’s opinions into account, I removed a few\nseries, added a few more, and came up with the following order.\nUnderlining indicates an incomplete series, or at least one I deem insufficiently complete to conclusively judge, while italics indicates a series I have not personally\nread.\nThe Lord of the Rings, Tolkien\nThe First Law, Abercrombie\nMalazan Book of the Fallen, Erikson\nA Song of Ice and Fire, Martin\nThe Black Company, Cook\nDragonlance, Weis & Hickman\nThe Chronicles of Thomas Covenant, Donaldson\nThe Riftwar Saga, Feist\nThe Long Price Quartet, Abraham\nThe Demon Cycle, Brett\nThe Stormlight Archive, Sanderson\nThe Belgariad/The Mallorean, Eddings\nCodex Alera, Butcher\nThe Prince of Nothing, Bakker\nMemory, Sorrow, and Thorn, Williams\nThe Deathgate Cycle, Weis and Hickman\nThe Wheel of Time, Jordan/Sanderson\nThe Sword of Truth, Goodkind\nShannara, Brooks\nThe Red Knight, Cameron\nNo doubt many will disagree with my opinions here, but they are\nnot arbitrary.  First, I’m judging the series as a whole.  One thing\nI’ve noticed is a lot of series take a serious nosedive after a certain\npoint.  The Chronicles of Thomas Covenant would be number two on this\nlist if judged solely on the first two Chronicles, (six books).\nBakker’s series would have cracked the top ten were it not for the\nabysmal third book. And as crazy as it sounds, Martin could freefall if\nhe doesn’t turn it around in this next book; post Dance, the “American\nTolkien” already sounds silly.\nI tend to suspect\nBrandon Sanderson will move up and Peter Brett will move down.  Brett\nstarted great, but his demon world is a boring hive mind and he never\ngot around to actually writing about eponymous Daylight War in the third\nbook.  I suspect that he may have fallen victim to Epic Author Disease\neven faster than Jordan or Martin did.\nThere\nare series that I love, that I consider much better than most of the\nseries on this list.  But they’re not epic, by which I mean I regard\nthem as books that on some level are doing something similar to what I’m\nattempting to do.  The whole reason that I’ve been closely considering\nthe various epic fantasy series is to avoid the problems that have\nplagued some of these series in the past.\nIt’s\ntoo soon to judge ATOB, but good or bad, I can hope to keep improving.\nSome would even say there is considerable room for it….",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-29T13:00:00+00:00"
}