{
  "url": "https://voxday.net/2013/08/25/ruthless-compliance/",
  "scraped_at": "2025-12-14T22:39:57.099192",
  "title": "Ruthless compliance",
  "date_display": "August 25, 2013",
  "date_iso": "2013-08-25T09:02:00+00:00",
  "date_from_url": "2013-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Marine Corps appears to be going about <a href=\"http://www.marinecorpstimes.com/article/20130824/CAREERS02/308240009/Marine-Corps-will-open-infantry-training-enlisted-women\" rel=\"noopener\" target=\"_blank\">complying with the Defense Department’s decision</a> earlier this year to repeal the Direct Combat Exclusion Rule in a correct and effective manner.</p><blockquote class=\"tr_bq\"><p> The Marine Corps will allow enlisted women to participate in basic infantry training beginning this fall as part of ongoing research to determine what additional ground combat jobs may open to female personnel.</p><p>New female enlisted Marines will volunteer for spots in the service’s Infantry Training Battalion, mirroring a related effort allowing new female lieutenants to enroll in the Corps’ Infantry Officer Course, according to an official planning document obtained by Marine Corps Times. Titled “Assignment of Women in Combat Units,” the document is dated Aug. 16.</p><p>“Female Marines will have the opportunity to go through the same infantry training course as their male counterparts,” the document states. However, as with the research involving female officers, “female enlisted Marines who successfully complete infantry training as part of this research process will not be assigned infantry as a military occupational specialty and will not be assigned to infantry units.”</p></blockquote><p>The correct way to address female claims to equality is always to insist upon completely objective standards.  Women tend to be highly skilled at manipulating subjective standards, which is why so many of them shriek with indignation whenever they discover that their tears, emotional appeals, prostitution, rhetorical sallies, and negotiating tactics will avail them nothing.</p><p>Take the oft-cited “women make 77 cents of the male dollar for doing the same job”, for example.  There is a very easy solution to that “problem”. Eliminate salaries and put everyone with the same job on equal hourly wages. Women will still be making less money on average, but their complaints won’t be credible because it is objectively clear why they are earning less: they work fewer hours.  As Kay Hymowitz wrote in the Wall Street Journal, “the famous gender-wage gap is to a considerable degree a gender-hours gap.”</p><p>Now, it can be expected that the Marine Corps will eventually come under considerable pressure to reduce the difficulty of its basic infantry training. But with a growing number of Obama Wars to fight, the Corps has very good reason to resist the political pressure to produce inferior Marines, and in the unlikely event a woman proves capable of successfully completing the course, (note that <a href=\"http://www.businessinsider.com/2-more-women-fail-marine-infantry-test-2013-7\" rel=\"noopener\" target=\"_blank\">none of the 10</a> women who have tried have passed the Infantry Officer Course and only one of those ten made it through the course’s very first test), she is likely to be an extraordinary individual who will not be disposed to creating the sort of problems that most women in the military do.</p></div>",
  "content_text": "The Marine Corps appears to be going about\ncomplying with the Defense Department’s decision\nearlier this year to repeal the Direct Combat Exclusion Rule in a correct and effective manner.\nThe Marine Corps will allow enlisted women to participate in basic infantry training beginning this fall as part of ongoing research to determine what additional ground combat jobs may open to female personnel.\nNew female enlisted Marines will volunteer for spots in the service’s Infantry Training Battalion, mirroring a related effort allowing new female lieutenants to enroll in the Corps’ Infantry Officer Course, according to an official planning document obtained by Marine Corps Times. Titled “Assignment of Women in Combat Units,” the document is dated Aug. 16.\n“Female Marines will have the opportunity to go through the same infantry training course as their male counterparts,” the document states. However, as with the research involving female officers, “female enlisted Marines who successfully complete infantry training as part of this research process will not be assigned infantry as a military occupational specialty and will not be assigned to infantry units.”\nThe correct way to address female claims to equality is always to insist upon completely objective standards.  Women tend to be highly skilled at manipulating subjective standards, which is why so many of them shriek with indignation whenever they discover that their tears, emotional appeals, prostitution, rhetorical sallies, and negotiating tactics will avail them nothing.\nTake the oft-cited “women make 77 cents of the male dollar for doing the same job”, for example.  There is a very easy solution to that “problem”. Eliminate salaries and put everyone with the same job on equal hourly wages. Women will still be making less money on average, but their complaints won’t be credible because it is objectively clear why they are earning less: they work fewer hours.  As Kay Hymowitz wrote in the Wall Street Journal, “the famous gender-wage gap is to a considerable degree a gender-hours gap.”\nNow, it can be expected that the Marine Corps will eventually come under considerable pressure to reduce the difficulty of its basic infantry training. But with a growing number of Obama Wars to fight, the Corps has very good reason to resist the political pressure to produce inferior Marines, and in the unlikely event a woman proves capable of successfully completing the course, (note that\nnone of the 10\nwomen who have tried have passed the Infantry Officer Course and only one of those ten made it through the course’s very first test), she is likely to be an extraordinary individual who will not be disposed to creating the sort of problems that most women in the military do.",
  "tags": [
    "war",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-25T08:02:00+00:00"
}