{
  "url": "https://voxday.net/2013/08/29/societal-evolution-in-action/",
  "scraped_at": "2025-12-14T22:40:28.224905",
  "title": "Societal evolution in action",
  "date_display": "August 29, 2013",
  "date_iso": "2013-08-29T18:00:00+00:00",
  "date_from_url": "2013-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Whatever the environment of America is naturally selecting for, <a href=\"http://www.wpxi.com/news/news/woman-brutally-beaten-group-teens-north-side-says-/nZfFy/\">it doesn’t appear to be either civilization or intelligence</a>:</p><blockquote class=\"tr_bq\"><p> A woman who said she was brutally attacked by a group of black<br> teenagers in Pittsburgh’s North Side Sunday said the girls savagely beat<br> her while calling her racial slurs. Ginger Slepski said she<br> suffered multiple injuries, including torn shoulder ligaments. She said<br> she thought the girls were going to kill her.</br></br></br></br></p><p>“I thought it was so animalistic. So violent. I’m so afraid for these girls to get out and walk the streets,” Slepski said.</p><p>Police<br> said Slepski was savagely beaten after the girls threw a bottle at her<br> car on Concord Street and she stopped to confront them.</br></br></p><p>“I was<br> mad. I knew they were younger. I thought they were in their early 20s. I<br> got out and said, ‘What is your problem?’” Slepski said.</br></br></p><p>All four African-American girls then called her names before getting physically violent.</p><p>“They yelled, ‘Shut up white [expletive].’ The other said, ‘Get that white [expletive],’” Slepski said.</p><p>Slepski said she tried to get back into her car but the girls grabbed her by the hair.</p><p>“The<br> one punched me in the head and I was on a set of concrete steps and my<br> head hit the concrete so hard,” said Slepski. “Then they all got on top<br> of me and all their hands were in my hair. They kept telling each other<br> to, ‘Kick her in the head. Kick her head in the concrete.’”</br></br></br></br></p><p>Slepski said several people witnessed the attack but were too afraid to intervene.</p></blockquote><p>Demographics is destiny.  If you’re going to permit large numbers of barbarians inside the gates, don’t become surprised when your society becomes barbarous. This is the inevitable consequence of “civil rights” and forced desegregation. Don’t try to kid yourself otherwise.  You know it’s true. It’s why you keep your mouth shut and turn a blind eye to misbehaving young men and women. Ms Slepski didn’t believe it; now she knows better.</p><p>Do you think next time she’ll attempt to confront young vibrants who are acting in a civilized manner?  Do you think she’ll even dare to confront young whites who aren’t? This is how civilizations die, one individual retreat at a time.</p></div>",
  "content_text": "Whatever the environment of America is naturally selecting for,\nit doesn’t appear to be either civilization or intelligence\n:\nA woman who said she was brutally attacked by a group of black\nteenagers in Pittsburgh’s North Side Sunday said the girls savagely beat\nher while calling her racial slurs. Ginger Slepski said she\nsuffered multiple injuries, including torn shoulder ligaments. She said\nshe thought the girls were going to kill her.\n“I thought it was so animalistic. So violent. I’m so afraid for these girls to get out and walk the streets,” Slepski said.\nPolice\nsaid Slepski was savagely beaten after the girls threw a bottle at her\ncar on Concord Street and she stopped to confront them.\n“I was\nmad. I knew they were younger. I thought they were in their early 20s. I\ngot out and said, ‘What is your problem?’” Slepski said.\nAll four African-American girls then called her names before getting physically violent.\n“They yelled, ‘Shut up white [expletive].’ The other said, ‘Get that white [expletive],’” Slepski said.\nSlepski said she tried to get back into her car but the girls grabbed her by the hair.\n“The\none punched me in the head and I was on a set of concrete steps and my\nhead hit the concrete so hard,” said Slepski. “Then they all got on top\nof me and all their hands were in my hair. They kept telling each other\nto, ‘Kick her in the head. Kick her head in the concrete.’”\nSlepski said several people witnessed the attack but were too afraid to intervene.\nDemographics is destiny.  If you’re going to permit large numbers of barbarians inside the gates, don’t become surprised when your society becomes barbarous. This is the inevitable consequence of “civil rights” and forced desegregation. Don’t try to kid yourself otherwise.  You know it’s true. It’s why you keep your mouth shut and turn a blind eye to misbehaving young men and women. Ms Slepski didn’t believe it; now she knows better.\nDo you think next time she’ll attempt to confront young vibrants who are acting in a civilized manner?  Do you think she’ll even dare to confront young whites who aren’t? This is how civilizations die, one individual retreat at a time.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2013-08-29T17:00:00+00:00"
}