{
  "url": "https://voxday.net/2013/08/07/the-dismay-of-white-liberal_7/",
  "scraped_at": "2025-12-14T22:38:04.642880",
  "title": "The dismay of the white liberal",
  "date_display": "August 7, 2013",
  "date_iso": "2013-08-07T18:30:00+00:00",
  "date_from_url": "2013-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Brown America waxes in influence, <a href=\"http://my.firedoglake.com/mspbwatch/2013/07/31/markos-moulitsas-ugly-reverse-racist-smear/\">its longtime white liberal allies are dismayed</a> to discover that the minorities they championed never actually gave a damn about the liberal principles they espoused:</p><blockquote class=\"tr_bq\"><p> Here’s the Daily Kos founder on the Snowden revelations:</p><p><i>I<br> don’t give a shit. Seriously, I just don’t care. NSA spying is bad! So<br> is stop and frisk. So is splitting up families by deporting children to<br> countries they’ve never been to and don’t speak the language. So is<br> harassing American muslims.</br></br></br></br></i></p><p><i>Government overreach<br> is bad. But to act like having the government track who you call is the<br> height of government abuse is a very white privileged view of the<br> privacy issue.</br></br></br></i></p><p><i>But as for Greenwald and Snowden? Seriously, I don’t give two shits.</i></p><p>Please,<br> Mr. Moulitsas, tell us, what is the proper, non-privileged,<br> multi-cultural view of the “privacy issue”? Is it one that stays within<br> the confines of what’s allowed by the Democratic Party? Is it one that<br> is relevant to the war on women, or voting rights, or immigration, but<br> ignores the collapse of the rule of law and the justice system (which is<br> far from a “white privileged” issue)?</br></br></br></br></br></br></p></blockquote><p>Of course a<br> Mr. Moulitsas doesn’t give a damn about privileged whites such as<br> Greenwald and Snowden.  They are not of his clan or a minority in a<br> similar position. Imagine how shocked the white liberals are going to be<br> when they find out their erstwhile allies don’t give a damn about the<br> equality, the environment, abortion, women’s rights, or any of the<br> Left’s other sacred causes.  They never did, they merely went through<br> the motions and mouthed all the right words in order to ensure<br> themselves a place at the table.</br></br></br></br></br></br></br></br></p><p>The two-party system<br> based on ideology is totally foreign to most non-Americans, who are<br> accustomed to interest-based politics.  Now that minorities, real ethnic<br> minorities, make up a significant part of the Democratic party, it<br> should come as no surprise that they are beginning to reveal the true<br> nature of their politics.  Because of this, don’t be surprised when La<br> Raza becomes an effective third party in California and begins to<br> compete directly with the Democrats.</br></br></br></br></br></br></br></p></div>",
  "content_text": "As Brown America waxes in influence,\nits longtime white liberal allies are dismayed\nto discover that the minorities they championed never actually gave a damn about the liberal principles they espoused:\nHere’s the Daily Kos founder on the Snowden revelations:\nI\ndon’t give a shit. Seriously, I just don’t care. NSA spying is bad! So\nis stop and frisk. So is splitting up families by deporting children to\ncountries they’ve never been to and don’t speak the language. So is\nharassing American muslims.\nGovernment overreach\nis bad. But to act like having the government track who you call is the\nheight of government abuse is a very white privileged view of the\nprivacy issue.\nBut as for Greenwald and Snowden? Seriously, I don’t give two shits.\nPlease,\nMr. Moulitsas, tell us, what is the proper, non-privileged,\nmulti-cultural view of the “privacy issue”? Is it one that stays within\nthe confines of what’s allowed by the Democratic Party? Is it one that\nis relevant to the war on women, or voting rights, or immigration, but\nignores the collapse of the rule of law and the justice system (which is\nfar from a “white privileged” issue)?\nOf course a\nMr. Moulitsas doesn’t give a damn about privileged whites such as\nGreenwald and Snowden.  They are not of his clan or a minority in a\nsimilar position. Imagine how shocked the white liberals are going to be\nwhen they find out their erstwhile allies don’t give a damn about the\nequality, the environment, abortion, women’s rights, or any of the\nLeft’s other sacred causes.  They never did, they merely went through\nthe motions and mouthed all the right words in order to ensure\nthemselves a place at the table.\nThe two-party system\nbased on ideology is totally foreign to most non-Americans, who are\naccustomed to interest-based politics.  Now that minorities, real ethnic\nminorities, make up a significant part of the Democratic party, it\nshould come as no surprise that they are beginning to reveal the true\nnature of their politics.  Because of this, don’t be surprised when La\nRaza becomes an effective third party in California and begins to\ncompete directly with the Democrats.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-07T17:30:00+00:00"
}