{
  "url": "https://voxday.net/2013/08/16/the-financial-idiocracy_16/",
  "scraped_at": "2025-12-14T22:39:03.046001",
  "title": "The financial idiocracy",
  "date_display": "August 16, 2013",
  "date_iso": "2013-08-16T17:00:00+00:00",
  "date_from_url": "2013-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Keep in mind that <a href=\"http://www.nytimes.com/2013/08/14/business/economy/careers-of-2-fed-contenders-reveal-little-on-regulatory-approach.html?pagewanted=3\">this woman</a> is widely considered to be the most credible candidate to succeed Ben Bernanke at the Federal Reserve:</p><blockquote class=\"tr_bq\"><p> “For my own part,” Ms. Yellen said, “I did not see and did not<br> appreciate what the risks were with securitization, the credit ratings<br> agencies, the shadow banking system, the S.I.V.’s — I didn’t see any of<br> that coming until it happened.” Her startled interviewers noted that<br> almost none of the officials who testified had offered a similar<br> acknowledgment of an almost universal failure.</br></br></br></br></br></p></blockquote><p>Meanwhile,<br> I was publicly warning about the dangerous risks facing the global<br> financial system from 2002 to the spring of 2008. And it wasn’t even my<br> job to pay attention to those things.  I see no chance, none, that these<br> maleducated academic idiots even posses the conceptual tools to<br> understand the current situation, let alone have the ability to do<br> anything about it.</br></br></br></br></br></br></p><p>It’s like watching monkeys try to<br> repair a space shuttle.  Which wouldn’t be so bad if we weren’t all out<br> in space inside the shuttle.</br></br></p><p>I used to wonder why people like this would take an impossible job knowing that they would likely be considered responsible for the incipient disaster. Now I realize that it’s not that they’re not totally indifferent to their historical legacy, they’re just completely clueless about the situation facing them.</p></div>",
  "content_text": "Keep in mind that\nthis woman\nis widely considered to be the most credible candidate to succeed Ben Bernanke at the Federal Reserve:\n“For my own part,” Ms. Yellen said, “I did not see and did not\nappreciate what the risks were with securitization, the credit ratings\nagencies, the shadow banking system, the S.I.V.’s — I didn’t see any of\nthat coming until it happened.” Her startled interviewers noted that\nalmost none of the officials who testified had offered a similar\nacknowledgment of an almost universal failure.\nMeanwhile,\nI was publicly warning about the dangerous risks facing the global\nfinancial system from 2002 to the spring of 2008. And it wasn’t even my\njob to pay attention to those things.  I see no chance, none, that these\nmaleducated academic idiots even posses the conceptual tools to\nunderstand the current situation, let alone have the ability to do\nanything about it.\nIt’s like watching monkeys try to\nrepair a space shuttle.  Which wouldn’t be so bad if we weren’t all out\nin space inside the shuttle.\nI used to wonder why people like this would take an impossible job knowing that they would likely be considered responsible for the incipient disaster. Now I realize that it’s not that they’re not totally indifferent to their historical legacy, they’re just completely clueless about the situation facing them.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-16T16:00:00+00:00"
}