{
  "url": "https://voxday.net/2013/08/16/the-organization-formerly-known-as-sfwa/",
  "scraped_at": "2025-12-14T22:39:01.583900",
  "title": "The organization formerly known as SFWA",
  "date_display": "August 16, 2013",
  "date_iso": "2013-08-16T13:00:00+00:00",
  "date_from_url": "2013-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kate Paulk <a href=\"http://madgeniusclub.com/2013/08/15/the-organization-formerly-known-as-sfwa/\">shares her thoughts</a> on my recent, and historic, distinction:</p><blockquote class=\"tr_bq\"><p> His crime? I never really figured that out. It had something to do with<br> the SFWA twitter account, for which there were no official guidelines<br> until after whatever Mr Beale did, at least, not that I can find. As far as I can see, Mr Beale was doing nothing more horrible than<br> stating his opinions – not representing his opinions as those of any<br> other person or organization, not claiming to be anyone but himself, not<br> doing anything remotely unethical in other words.</br></br></br></br></br></p><p>Considering that a leading light of the industry can publicly grope a<br> female author at an awards banquet and not even get a mild, “that was<br> bad form” from the organization formerly known as SFWA, it’s clear that<br> the real reason for Mr Beale’s eviction was his outspoken personal<br> views.</br></br></br></br></p><p>Now I don’t particularly care what anyone’s personal beliefs are. I <i>do</i><br> believe that an organization claiming to represent “Science Fiction and<br> Fantasy Writers” should have some kind of clause up front if they’re<br> going to limit membership to people with the “correct” beliefs. Now, if<br> they were the Communist Science Fiction and Fantasy Writers of America,<br> they’d have every reason to want Mr Beale out of their ranks, since he<br> is vehemently anti-communist. They’re not. Or at least, not openly.</br></br></br></br></br></br></p></blockquote><p>SFWA may not be openly communist, but it is eminently clear that the F in SFWA now stands for Feminist. I didn’t see much hostility for capitalists in the organization, but it is readily apparent that if you are not a self-described feminist, of either sex, there is no place for you in the SFWA. The pinkshirts have already implemented various diktats concerning sexual harassment, SF conferences, and diversity, such as this one.<br> <i><br/></i><br> <i>The Science Fiction and Fantasy Writers of America Statement on Diversity<br> </br></i><br> <i>The Science Fiction and Fantasy Writers of America strongly believes that a diverse membership is the key to a strong community. We define “diversity” as understanding and embracing the fact that our current and future members are composed of a broad range of individuals, who may vary in ethnicity, race, gender identity or expression, sexual orientation, age, physical disabilities, political or religious beliefs.</i></br></br></br></p><p>By including in our membership those of diverse backgrounds and experiences, we hope to provide an inclusive environment for our members, which is the foundation for civil discourse and the free exchange of ideas. Moreover, maximizing the diversity of our organization is important so that we can benefit from the talent and energy of all those who contribute to excellence in science fiction and fantasy writing.<br> <br> <i>Recognizing that historical and present day inequities must be addressed, we understand the need to promote diversity within the Board, staff, members, programs, and written policies of our organization. We must embody the change we advocate for others in the publishing industry. By seeking greater diversity and inclusion, we can serve as a model of the fairness and equality of opportunity we envision for our members.</i></br></br></p><p>We value the perspectives and contributions of all of our members. We welcome and support anyone who comes to us in good faith and with the desire to promote the SFWA, science fiction and fantasy writing, and the genre community as a whole. </p><p>This Very Important Statement was penned on the organization’s behalf by one Carrie Cuin, a fat little feminist who hasn’t even published enough fiction to qualify as a full member.  Many, if not most, of the outspoken feminists who have appointed themselves the organization’s stormtroopers haven’t published a single novel; the nobodies on the SFWA Board look like respected elders of the field by comparison.</p><p>And forget science fiction, the self-appointed experts on Stormfront and its associates have even gotten into the business of determining who is, and who is not, Hispanic. Despite my great-grandfather being a Mexican revolutionary and close associate of Pancho Villa’s, and despite my great-uncle being a well-known Hispanic painter, due to my failure to be publicly “Latino-identified” and my “discriminatory statements against Latinos”, Ms Cuin informed me that she “was afraid that you wouldn’t fall under that category” and therefore could not be included on a list of Hispanic SF writers.</p><p>Of course I’m not “Latino-identified”. I’m not Latino. And I don’t think I’ve made any statements about Latinos at all. The inability of a white woman from Ithaca to recognize the difference between Hispanics and Latinos is merely the icing on the irony cake.  No doubt they all look the same to her, and besides, they all speak Spanish anyhow, right?</p><p>The SFWA’s position on who is and who is not Hispanic reminded me of a statement by one of my feminist university professors, who once quite seriously declared that Margaret Thatcher “was not of the gender woman”. SFWA is so committed to diversity and inclusiveness that it excluded one of its few genuine writers of color… for no particular reason at all.</p><p><i>¡Viva la Revolución! </i></p></div>",
  "content_text": "Kate Paulk\nshares her thoughts\non my recent, and historic, distinction:\nHis crime? I never really figured that out. It had something to do with\nthe SFWA twitter account, for which there were no official guidelines\nuntil after whatever Mr Beale did, at least, not that I can find. As far as I can see, Mr Beale was doing nothing more horrible than\nstating his opinions – not representing his opinions as those of any\nother person or organization, not claiming to be anyone but himself, not\ndoing anything remotely unethical in other words.\nConsidering that a leading light of the industry can publicly grope a\nfemale author at an awards banquet and not even get a mild, “that was\nbad form” from the organization formerly known as SFWA, it’s clear that\nthe real reason for Mr Beale’s eviction was his outspoken personal\nviews.\nNow I don’t particularly care what anyone’s personal beliefs are. I\ndo\nbelieve that an organization claiming to represent “Science Fiction and\nFantasy Writers” should have some kind of clause up front if they’re\ngoing to limit membership to people with the “correct” beliefs. Now, if\nthey were the Communist Science Fiction and Fantasy Writers of America,\nthey’d have every reason to want Mr Beale out of their ranks, since he\nis vehemently anti-communist. They’re not. Or at least, not openly.\nSFWA may not be openly communist, but it is eminently clear that the F in SFWA now stands for Feminist. I didn’t see much hostility for capitalists in the organization, but it is readily apparent that if you are not a self-described feminist, of either sex, there is no place for you in the SFWA. The pinkshirts have already implemented various diktats concerning sexual harassment, SF conferences, and diversity, such as this one.\nThe Science Fiction and Fantasy Writers of America Statement on Diversity\nThe Science Fiction and Fantasy Writers of America strongly believes that a diverse membership is the key to a strong community. We define “diversity” as understanding and embracing the fact that our current and future members are composed of a broad range of individuals, who may vary in ethnicity, race, gender identity or expression, sexual orientation, age, physical disabilities, political or religious beliefs.\nBy including in our membership those of diverse backgrounds and experiences, we hope to provide an inclusive environment for our members, which is the foundation for civil discourse and the free exchange of ideas. Moreover, maximizing the diversity of our organization is important so that we can benefit from the talent and energy of all those who contribute to excellence in science fiction and fantasy writing.\nRecognizing that historical and present day inequities must be addressed, we understand the need to promote diversity within the Board, staff, members, programs, and written policies of our organization. We must embody the change we advocate for others in the publishing industry. By seeking greater diversity and inclusion, we can serve as a model of the fairness and equality of opportunity we envision for our members.\nWe value the perspectives and contributions of all of our members. We welcome and support anyone who comes to us in good faith and with the desire to promote the SFWA, science fiction and fantasy writing, and the genre community as a whole.\nThis Very Important Statement was penned on the organization’s behalf by one Carrie Cuin, a fat little feminist who hasn’t even published enough fiction to qualify as a full member.  Many, if not most, of the outspoken feminists who have appointed themselves the organization’s stormtroopers haven’t published a single novel; the nobodies on the SFWA Board look like respected elders of the field by comparison.\nAnd forget science fiction, the self-appointed experts on Stormfront and its associates have even gotten into the business of determining who is, and who is not, Hispanic. Despite my great-grandfather being a Mexican revolutionary and close associate of Pancho Villa’s, and despite my great-uncle being a well-known Hispanic painter, due to my failure to be publicly “Latino-identified” and my “discriminatory statements against Latinos”, Ms Cuin informed me that she “was afraid that you wouldn’t fall under that category” and therefore could not be included on a list of Hispanic SF writers.\nOf course I’m not “Latino-identified”. I’m not Latino. And I don’t think I’ve made any statements about Latinos at all. The inability of a white woman from Ithaca to recognize the difference between Hispanics and Latinos is merely the icing on the irony cake.  No doubt they all look the same to her, and besides, they all speak Spanish anyhow, right?\nThe SFWA’s position on who is and who is not Hispanic reminded me of a statement by one of my feminist university professors, who once quite seriously declared that Margaret Thatcher “was not of the gender woman”. SFWA is so committed to diversity and inclusiveness that it excluded one of its few genuine writers of color… for no particular reason at all.\n¡Viva la Revolución!",
  "tags": [
    "freakshow",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-16T12:00:00+00:00"
}