{
  "url": "https://voxday.net/2013/08/25/the-grimy-pessimism-of-george-rr-martin/",
  "scraped_at": "2025-12-14T22:39:58.934726",
  "title": "The grimy pessimism of George RR Martin",
  "date_display": "August 25, 2013",
  "date_iso": "2013-08-25T13:00:00+00:00",
  "date_from_url": "2013-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rowan Light <a href=\"http://mercatornet.com/articles/view/battle_of_the_myths_game_of_thrones_v._lord_of_the_rings\" rel=\"noopener\" target=\"_blank\">addresses the silly and unjustified claim</a> that George RR Martin’s epic work is comparable, let alone superior, to JRR Tolkien’s The Lord of the Rings:</p><blockquote class=\"tr_bq\"><p> Though Martin knows how to tell a good story, brilliantly weaving his<br> complex plots with familiar tropes (without falling into kitsch), his<br> appeal depends on more than just skilful prose. Brutal cruelty, sex, and<br> disloyalty are the hallmarks of Martin’s world. This makes him, it is<br> argued, far more realistic than Tolkien. As Lev Grossman, the fantasy<br> author who first dubbed Martin “the American Tolkien”, writes,</br></br></br></br></br></p><p><i>“What … distinguishes Martin, and what marks him as a major force for<br> evolution in fantasy, is his refusal to embrace a vision of the world<br> as a Manichean struggle between Good and Evil. Tolkien’s work has<br> enormous imaginative force, but you have to go elsewhere for moral<br> complexity.”</br></br></br></br></i></p><p>There are no clear “goodies” in Westeros. Characters are honourable<br> or treacherous depending on the day of the week. Good guys finish last<br> and those who cling to noble principles are manipulated and/or beheaded.<br> We sympathize with immoral characters like the incestuous Lannisters,<br> Varys the Eunuch, and an assortment of murderers, rapists, and sadists.<br> Nothing is taboo.</br></br></br></br></br></p><p>Tolkien’s G-rated narrative, critics argue, has burdened the fantasy<br> genre with a “Disneyland Middle Ages”. Martin is more meaningful because<br> he is morally ambiguous.</br></br></p><p>Although he is an admirer of Tolkien, Martin notes that “the whole<br> concept of the Dark Lord, and good guys battling ugly guys, Good versus<br> Evil … has become a kind of cartoon.” Fantasy doesn’t need any more Dark<br> Lords or hideous enemies, because “in real life, the hardest aspect of<br> the battle between good and evil is determining which is which”.</br></br></br></br></p><p>“I’ve always liked grey characters”, Martin said in a 2001 interview,<br> “And as for the gods, I’ve never been satisfied by any of the answers<br> that are given. If there really is a benevolent loving god, why is the<br> world full of rape and torture? Why do we even have pain? … Why is agony<br> a good way to handle [death]?”</br></br></br></br></p><p>The “game of thrones” is a cynical view of politics with its<br> factional back-stabbing, unbridled lust, fickle allies and treacherous<br> families. The anarchic world of Westeros is fundamentally defined by the<br> ladder to power. “Some are given a chance to climb but they cling to<br> the realm or the gods or love – illusions!</br></br></br></br></p><p>Only the ladder is real; the<br> climb is all there is”, says the amoral and supremely calculating Lord<br> Baelish.</br></br></p><p>In this moral fog there is no room for nobility and beauty. “Of all<br> the bright cruel lies they tell you, the crudest is the one called<br> love”, Martin wrote in his 1976 short story “Meathouse”. But the<br> “realist” fantasy is limited to the basest dimensions of human<br> experience. It’s like reading a newspaper which only features articles<br> about Ariel Castro the Cleveland rapist, al-Qaeda suicide bombers and<br> waterboarding at Guantanamo Bay. It is hard to imagine anyone wanting to<br> live eternally in the brutal and sadistic Westeros.</br></br></br></br></br></br></br></p><p>Is Tolkien really less realistic, though?</p></blockquote><p>The problem with Martin and his imitators is that their works reflect their crabbed and ugly souls.  It is interesting to compare the early reviews of Martin’s first two books with the latest two books in the series; Martin is increasingly committing some of the very acts that he was praised for avoiding in the beginning.</p><p>Does anyone believe that John Snow is truly dead?  Did anyone fail to notice that Martin ended A Dance with Dragons in much the same way that cheap sitcoms of the 1970s once ended their seasons? And how many characters that we were led to believe were dead are still wandering around Westeros in varying stages of life and undeath? Who has not marked the tragic decline of Tyrion Lannister from the witty dwarf who surmounted his short stature to the silly fool who falls off pigs?</p><p>Tolkien’s world was original and breathtaking. Martin’s is derivative and flat. Tolkien was a master of the structure of the epic tale. Martin wrote himself into an obvious structural impasse. But worst of all, where there is depth of soul and all the grandeur of Creation in Tolkien’s work, there is neither soul nor beauty in Martin’s. Martin focuses solely on the petty and ugly aspects of life, rendering his magnum opus more a commentary on his own nihilistic perspective than one upon the world in all its joys and sorrows.</p><p>Light is absolutely correct when he concludes that Tolkien “will still be sitting on the throne of fantasy in a hundred years’ time<br> while George Martin will be dismissed as the practitioner of an early<br> 21st Century fad for grimy pessimism.”</br></br></p><p>It’s not that Martin is a mediocre fantasy author.  He is, in fact, a very good one.  I very much enjoyed the first three books and I hope that the sixth one will have more in common with them than its immediate predecessor. But it should not escape the reader’s attention that most of the superlatives praising Martin so highly predate <i>A Dance with Dragons</i>. </p><p>This is why I don’t take either the effusive praise or the disdainful dismissals of <i>A Throne of Bones</i> very seriously. The story is not even one-quarter told.  The jury is still out on Martin and it has barely even begun being selected on my behalf.  But one thing I find very encouraging in this regard is the way in which my self-appointed enemies keep posting <a href=\"http://www.amazon.com/Throne-Bones-Arts-Light-ebook/product-reviews/B00AHK8LGI/ref=cm_cr_dp_synop?ie=UTF8&amp;showViewpoints=0&amp;sortBy=bySubmissionDateDescending#R1MAGBCVF9SJ12\" rel=\"noopener\" target=\"_blank\">shamelessly dishonest reviews</a> and trying to discourage people from reading <i>Arts of Dark and Light</i>.  They just don’t seem to realize that if <i>A Throne of Bones</i> were truly as terrible as they say, or even merely mediocre, they would be encouraging everyone to read it.</p></div>",
  "content_text": "Rowan Light\naddresses the silly and unjustified claim\nthat George RR Martin’s epic work is comparable, let alone superior, to JRR Tolkien’s The Lord of the Rings:\nThough Martin knows how to tell a good story, brilliantly weaving his\ncomplex plots with familiar tropes (without falling into kitsch), his\nappeal depends on more than just skilful prose. Brutal cruelty, sex, and\ndisloyalty are the hallmarks of Martin’s world. This makes him, it is\nargued, far more realistic than Tolkien. As Lev Grossman, the fantasy\nauthor who first dubbed Martin “the American Tolkien”, writes,\n“What … distinguishes Martin, and what marks him as a major force for\nevolution in fantasy, is his refusal to embrace a vision of the world\nas a Manichean struggle between Good and Evil. Tolkien’s work has\nenormous imaginative force, but you have to go elsewhere for moral\ncomplexity.”\nThere are no clear “goodies” in Westeros. Characters are honourable\nor treacherous depending on the day of the week. Good guys finish last\nand those who cling to noble principles are manipulated and/or beheaded.\nWe sympathize with immoral characters like the incestuous Lannisters,\nVarys the Eunuch, and an assortment of murderers, rapists, and sadists.\nNothing is taboo.\nTolkien’s G-rated narrative, critics argue, has burdened the fantasy\ngenre with a “Disneyland Middle Ages”. Martin is more meaningful because\nhe is morally ambiguous.\nAlthough he is an admirer of Tolkien, Martin notes that “the whole\nconcept of the Dark Lord, and good guys battling ugly guys, Good versus\nEvil … has become a kind of cartoon.” Fantasy doesn’t need any more Dark\nLords or hideous enemies, because “in real life, the hardest aspect of\nthe battle between good and evil is determining which is which”.\n“I’ve always liked grey characters”, Martin said in a 2001 interview,\n“And as for the gods, I’ve never been satisfied by any of the answers\nthat are given. If there really is a benevolent loving god, why is the\nworld full of rape and torture? Why do we even have pain? … Why is agony\na good way to handle [death]?”\nThe “game of thrones” is a cynical view of politics with its\nfactional back-stabbing, unbridled lust, fickle allies and treacherous\nfamilies. The anarchic world of Westeros is fundamentally defined by the\nladder to power. “Some are given a chance to climb but they cling to\nthe realm or the gods or love – illusions!\nOnly the ladder is real; the\nclimb is all there is”, says the amoral and supremely calculating Lord\nBaelish.\nIn this moral fog there is no room for nobility and beauty. “Of all\nthe bright cruel lies they tell you, the crudest is the one called\nlove”, Martin wrote in his 1976 short story “Meathouse”. But the\n“realist” fantasy is limited to the basest dimensions of human\nexperience. It’s like reading a newspaper which only features articles\nabout Ariel Castro the Cleveland rapist, al-Qaeda suicide bombers and\nwaterboarding at Guantanamo Bay. It is hard to imagine anyone wanting to\nlive eternally in the brutal and sadistic Westeros.\nIs Tolkien really less realistic, though?\nThe problem with Martin and his imitators is that their works reflect their crabbed and ugly souls.  It is interesting to compare the early reviews of Martin’s first two books with the latest two books in the series; Martin is increasingly committing some of the very acts that he was praised for avoiding in the beginning.\nDoes anyone believe that John Snow is truly dead?  Did anyone fail to notice that Martin ended A Dance with Dragons in much the same way that cheap sitcoms of the 1970s once ended their seasons? And how many characters that we were led to believe were dead are still wandering around Westeros in varying stages of life and undeath? Who has not marked the tragic decline of Tyrion Lannister from the witty dwarf who surmounted his short stature to the silly fool who falls off pigs?\nTolkien’s world was original and breathtaking. Martin’s is derivative and flat. Tolkien was a master of the structure of the epic tale. Martin wrote himself into an obvious structural impasse. But worst of all, where there is depth of soul and all the grandeur of Creation in Tolkien’s work, there is neither soul nor beauty in Martin’s. Martin focuses solely on the petty and ugly aspects of life, rendering his magnum opus more a commentary on his own nihilistic perspective than one upon the world in all its joys and sorrows.\nLight is absolutely correct when he concludes that Tolkien “will still be sitting on the throne of fantasy in a hundred years’ time\nwhile George Martin will be dismissed as the practitioner of an early\n21st Century fad for grimy pessimism.”\nIt’s not that Martin is a mediocre fantasy author.  He is, in fact, a very good one.  I very much enjoyed the first three books and I hope that the sixth one will have more in common with them than its immediate predecessor. But it should not escape the reader’s attention that most of the superlatives praising Martin so highly predate\nA Dance with Dragons\n.\nThis is why I don’t take either the effusive praise or the disdainful dismissals of\nA Throne of Bones\nvery seriously. The story is not even one-quarter told.  The jury is still out on Martin and it has barely even begun being selected on my behalf.  But one thing I find very encouraging in this regard is the way in which my self-appointed enemies keep posting\nshamelessly dishonest reviews\nand trying to discourage people from reading\nArts of Dark and Light\n.  They just don’t seem to realize that if\nA Throne of Bones\nwere truly as terrible as they say, or even merely mediocre, they would be encouraging everyone to read it.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-25T12:00:00+00:00"
}