{
  "url": "https://voxday.net/2013/08/09/the-people-in-your-neighborhood/",
  "scraped_at": "2025-12-14T22:38:17.138488",
  "title": "The people in your neighborhood",
  "date_display": "August 9, 2013",
  "date_iso": "2013-08-09T20:03:00+00:00",
  "date_from_url": "2013-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If your neighborhood is insufficiently vibrant, Obama has <a href=\"http://www.foxnews.com/politics/2013/08/08/obama-administration-using-housing-department-to-compel-diversity-in/\">a plan to fix that</a>:</p><blockquote class=\"tr_bq\"><p> In a move some claim is tantamount to social engineering, the<br> Department of Housing and Urban Development is imposing a new rule that<br> would allow the feds to track diversity in America’s neighborhoods and<br> then push policies to change those it deems discriminatory.</br></br></br></p><p>The policy is called, “Affirmatively Furthering Fair Housing.” It<br> will require HUD to gather data on segregation and discrimination in<br> every single neighborhood and try to remedy it. HUD Secretary Shaun Donovan unveiled the federal rule at the NAACP convention in July.</br></br></p><p>“Unfortunately, in too many of our hardest hit communities, no matter<br> how hard a child or her parents work, the life chances of that child,<br> even her lifespan, is determined by the zip code she grows up in. This<br> is simply wrong,” he said. Data from this discrimination database would be used with zoning<br> laws, housing finance policy, infrastructure planning and transportation<br> to alleviate alleged discrimination and segregation.</br></br></br></br></br></p></blockquote><p>I think this is what one calls “a clarifying moment”.  It will be interesting to see how long it takes for “anti-racists” to change their position once they are forced to actually live in close exposure to vibrancy.</p><p>This should work about as well as busing did in the 1970s.</p></div>",
  "content_text": "If your neighborhood is insufficiently vibrant, Obama has\na plan to fix that\n:\nIn a move some claim is tantamount to social engineering, the\nDepartment of Housing and Urban Development is imposing a new rule that\nwould allow the feds to track diversity in America’s neighborhoods and\nthen push policies to change those it deems discriminatory.\nThe policy is called, “Affirmatively Furthering Fair Housing.” It\nwill require HUD to gather data on segregation and discrimination in\nevery single neighborhood and try to remedy it. HUD Secretary Shaun Donovan unveiled the federal rule at the NAACP convention in July.\n“Unfortunately, in too many of our hardest hit communities, no matter\nhow hard a child or her parents work, the life chances of that child,\neven her lifespan, is determined by the zip code she grows up in. This\nis simply wrong,” he said. Data from this discrimination database would be used with zoning\nlaws, housing finance policy, infrastructure planning and transportation\nto alleviate alleged discrimination and segregation.\nI think this is what one calls “a clarifying moment”.  It will be interesting to see how long it takes for “anti-racists” to change their position once they are forced to actually live in close exposure to vibrancy.\nThis should work about as well as busing did in the 1970s.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-09T19:03:00+00:00"
}