{
  "url": "https://voxday.net/2013/08/13/the-japanese-experiment-has-failed/",
  "scraped_at": "2025-12-14T22:38:40.176565",
  "title": "The Japanese experiment has failed",
  "date_display": "August 13, 2013",
  "date_iso": "2013-08-13T08:15:00+00:00",
  "date_from_url": "2013-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The impotence of Abenomics demonstrates that Karl Denninger and others were right, Paul Krugman was wrong, and quantitative easing <a href=\"http://www.zerohedge.com/contributed/2013-08-12/bernanke-just-felt-chill-down-his-spine\">does not magically produce economic growth</a>.</p><blockquote class=\"tr_bq\"><p> In April 2013, Japan announced a QE program of $1.4 trillion, an<br> amount equal to roughly 25% of the Japanese GDP. To put this into<br> perspective, the US’s QE1, QE 2, QE 3, and QE 4 programs <i>which were spaced out over four years</i> are an amount equal to roughly 16% of US GDP.</br></br></p><p>Japan announced a larger program relative to its economy <i>all at once</i>.<br> The idea was that by throwing around a big enough amount of money,<br> Japan’s economy would finally waken from its 20-year slumber and take<br> off.</br></br></br></p><p>This effort has been an abysmal failure. Japan’s second quarter GDP<br> grew at just 0.6% quarter over quarter, registering the single biggest<br> growth <i>MISS</i> in a year (economists were expecting 0.9% which, by the way had already been revised lower).</br></br></p><p>Put in plain terms, Japan announced the single largest QE effort in<br> history, and not only did its economic growth projections have to be<br> lowered, but it is failing to even meet these <i>lowered</i> growth projections.</br></br></p></blockquote><p>The failure of Abe’s daring plan to print Japan back into prosperity should suffice to explode the inflationista argument.  The US equivalent would be a $4 trillion spending program that barely managed to keep GDP from turning negative. And in directly related news, it is absolutely fascinating to see Paul Krugman complaining that <a href=\"http://www.nytimes.com/2013/08/12/opinion/krugman-milton-friedman-unperson.html?hp\">Milton Friedman is no longer a hero</a> on the economic right:</p><blockquote class=\"tr_bq\"><p> Friedman, who used to be the ultimate avatar of conservative economics, has essentially disappeared from right-wing discourse. Oh, he gets name-checked now and then — but only for his political polemics, never for his monetary theories. Instead, Rand Paul turns to the “Austrian” view of thinkers like Friedrich Hayek — a view Friedman once described as an “atrophied and rigid caricature” — while Paul Ryan, the G.O.P.’s de facto intellectual leader, gets his monetary economics from Ayn Rand, or more precisely from fictional characters in “Atlas Shrugged.”</p><p>How did that happen? Friedman, it turns out, was too nuanced and realist a figure for the modern right, which doesn’t do nuance and rejects reality, which has a well-known liberal bias…. He was willing to give a little ground, and admit that government action was indeed necessary to prevent depressions. But the required government action, he insisted, was of a very narrow kind: all you needed was an appropriately active Federal Reserve. In particular, he argued that the Fed could have prevented the Great Depression — with no need for new government programs — if only it had acted to save failing banks and pumped enough reserves into the banking system to prevent a sharp decline in the money supply.</p></blockquote><p>Krugman fails to realize that the right wing is putting one of John Maynard Keynes’s few legitimate ideas into action.</p><p>“When the facts change, I change my mind.”</p><p>Friedman was a Keynesian, albeit a Keynesian heretic who rejected the use of fiscal policy in favor of monetary policy.  And, more importantly, he was completely wrong.  Ben Bernanke has followed an almost flawlessly Friedmanite policy, bailed out the banks, pumped massive reserves into the banking system, and prevented a sharp decline in the money supply.</p><p>And yet, it hasn’t worked, because Friedman’s monetarist theory failed to account for the fact that it is credit money that is the larger and more important factor with regards to prices and the limits of demand, and, as Abe has shown in Japan, even an unprecedented increase in the money supply is not enough to make up for the deflationary forces at work in the various credit sectors.  One cannot push on a string and one cannot print borrowers.</p></div>",
  "content_text": "The impotence of Abenomics demonstrates that Karl Denninger and others were right, Paul Krugman was wrong, and quantitative easing\ndoes not magically produce economic growth\n.\nIn April 2013, Japan announced a QE program of $1.4 trillion, an\namount equal to roughly 25% of the Japanese GDP. To put this into\nperspective, the US’s QE1, QE 2, QE 3, and QE 4 programs\nwhich were spaced out over four years\nare an amount equal to roughly 16% of US GDP.\nJapan announced a larger program relative to its economy\nall at once\n.\nThe idea was that by throwing around a big enough amount of money,\nJapan’s economy would finally waken from its 20-year slumber and take\noff.\nThis effort has been an abysmal failure. Japan’s second quarter GDP\ngrew at just 0.6% quarter over quarter, registering the single biggest\ngrowth\nMISS\nin a year (economists were expecting 0.9% which, by the way had already been revised lower).\nPut in plain terms, Japan announced the single largest QE effort in\nhistory, and not only did its economic growth projections have to be\nlowered, but it is failing to even meet these\nlowered\ngrowth projections.\nThe failure of Abe’s daring plan to print Japan back into prosperity should suffice to explode the inflationista argument.  The US equivalent would be a $4 trillion spending program that barely managed to keep GDP from turning negative. And in directly related news, it is absolutely fascinating to see Paul Krugman complaining that\nMilton Friedman is no longer a hero\non the economic right:\nFriedman, who used to be the ultimate avatar of conservative economics, has essentially disappeared from right-wing discourse. Oh, he gets name-checked now and then — but only for his political polemics, never for his monetary theories. Instead, Rand Paul turns to the “Austrian” view of thinkers like Friedrich Hayek — a view Friedman once described as an “atrophied and rigid caricature” — while Paul Ryan, the G.O.P.’s de facto intellectual leader, gets his monetary economics from Ayn Rand, or more precisely from fictional characters in “Atlas Shrugged.”\nHow did that happen? Friedman, it turns out, was too nuanced and realist a figure for the modern right, which doesn’t do nuance and rejects reality, which has a well-known liberal bias…. He was willing to give a little ground, and admit that government action was indeed necessary to prevent depressions. But the required government action, he insisted, was of a very narrow kind: all you needed was an appropriately active Federal Reserve. In particular, he argued that the Fed could have prevented the Great Depression — with no need for new government programs — if only it had acted to save failing banks and pumped enough reserves into the banking system to prevent a sharp decline in the money supply.\nKrugman fails to realize that the right wing is putting one of John Maynard Keynes’s few legitimate ideas into action.\n“When the facts change, I change my mind.”\nFriedman was a Keynesian, albeit a Keynesian heretic who rejected the use of fiscal policy in favor of monetary policy.  And, more importantly, he was completely wrong.  Ben Bernanke has followed an almost flawlessly Friedmanite policy, bailed out the banks, pumped massive reserves into the banking system, and prevented a sharp decline in the money supply.\nAnd yet, it hasn’t worked, because Friedman’s monetarist theory failed to account for the fact that it is credit money that is the larger and more important factor with regards to prices and the limits of demand, and, as Abe has shown in Japan, even an unprecedented increase in the money supply is not enough to make up for the deflationary forces at work in the various credit sectors.  One cannot push on a string and one cannot print borrowers.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-13T07:15:00+00:00"
}