{
  "url": "https://voxday.net/2013/08/04/the-legacy-of-slavery/",
  "scraped_at": "2025-12-14T22:37:44.510508",
  "title": "The legacy of slavery",
  "date_display": "August 4, 2013",
  "date_iso": "2013-08-04T14:31:00+00:00",
  "date_from_url": "2013-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is informative to note that the black population in the UK, which is less racially mixed than the black population in the USA, commits violent crimes <a href=\"http://www.telegraph.co.uk/news/uknews/crime/7856787/Violent-inner-city-crime-the-figures-and-a-question-of-race.html\">at an even higher rate</a> than the latter:</p><blockquote class=\"tr_bq\"><p> The official figures, which examine the ethnicity of those accused of violent<br> offences in London, suggest the majority of men held responsible by police<br> for gun crimes, robberies and street crimes are black….</br></br></p><p>The data provide a breakdown of the ethnicity of the 18,091 men and boys who<br> police took action against for a range of violent and sexual offences in<br> London in 2009-10. They show that among those proceeded against for street crimes, 54 per cent<br> were black; for robbery, 59 per cent; and for gun crimes, 67 per cent.<br> Street crimes include muggings, assault with intent to rob and snatching<br> property.</br></br></br></br></br></p><p>Just over 12 per cent of London’s 7.5 million population is black, including<br> those of mixed black and white parentage, while 69 per cent is white,<br> according to the Office for National Statistics….</br></br></p><p>On sex offences, black men made up 32 per cent of male suspects proceeded<br> against, and white men 49 per cent. The statistics also suggest that black<br> women are responsible for a disproportionate amount of violent crime<br> committed by females. </br></br></br></p></blockquote><p>These UK statistics are likely to be useful when responding to those who attempt to blame the legacy of slavery for disproportionately criminal behavior among the American black community.  And remember, it is blacks who suffer disproportionately from criminal black predation, especially in the UK where they do not have the ability to defend themselves due to the absence of concealed carry and stand your ground laws.  Hiding this statistical data and refusing to take it into account when formulating policy will tend to harm more blacks than the individuals of any other race.</p><p>Since women are more prone to equalitarianism than men, I’ve found the most useful tactic when discussing the connection between race and crime is to appeal to their heightened fears of sex crime.  However, it is intriguing to observe that comparative sex crimes do not follow the pattern of violent crimes.  In the UK, the average black man is 275 percent more likely to commit a sex offense than the average white man, the comparable delta in the USA is 763 percent.  However, I suspect this is mostly an artifact of the larger and more segregated black population because 24 percent of all American sex offenses are black-on-black. The relevant delta for a white American woman is much closer to the overall UK figure at 334 percent.</p><p>Still, the fact that the average black man poses <i>more than four times the sexual assault risk</i> to a white woman than the average white man is not something that is taught to young American women despite the fact that most women’s studies programs spend a great deal of time discussing the sexual dangers posed by men.  Then again, math is hard….</p><p>I note that vaccines are declared to be safe on statistical grounds that are far less sound than the statistical correlations reliably observed between race and criminal behavior in various societies.  As usual, the merciless application of the facts across the board will tend to expose the attempt of the ideological left to conceal the truth through ignorance, deceit, and sophistry.</p><p>Science and statistics are gradually destroying the myth of equality, which is why we have now reached the point that many governments, including the US federal government, are being forced to resort to hiding statistics they once deemed necessary in order to continue justifying their false equalitarian dogma.  But the truth is what it is, whether we like it or not, and deceit that flies in the face of observable reality is eventually going to be exposed.</p></div>",
  "content_text": "It is informative to note that the black population in the UK, which is less racially mixed than the black population in the USA, commits violent crimes\nat an even higher rate\nthan the latter:\nThe official figures, which examine the ethnicity of those accused of violent\noffences in London, suggest the majority of men held responsible by police\nfor gun crimes, robberies and street crimes are black….\nThe data provide a breakdown of the ethnicity of the 18,091 men and boys who\npolice took action against for a range of violent and sexual offences in\nLondon in 2009-10. They show that among those proceeded against for street crimes, 54 per cent\nwere black; for robbery, 59 per cent; and for gun crimes, 67 per cent.\nStreet crimes include muggings, assault with intent to rob and snatching\nproperty.\nJust over 12 per cent of London’s 7.5 million population is black, including\nthose of mixed black and white parentage, while 69 per cent is white,\naccording to the Office for National Statistics….\nOn sex offences, black men made up 32 per cent of male suspects proceeded\nagainst, and white men 49 per cent. The statistics also suggest that black\nwomen are responsible for a disproportionate amount of violent crime\ncommitted by females.\nThese UK statistics are likely to be useful when responding to those who attempt to blame the legacy of slavery for disproportionately criminal behavior among the American black community.  And remember, it is blacks who suffer disproportionately from criminal black predation, especially in the UK where they do not have the ability to defend themselves due to the absence of concealed carry and stand your ground laws.  Hiding this statistical data and refusing to take it into account when formulating policy will tend to harm more blacks than the individuals of any other race.\nSince women are more prone to equalitarianism than men, I’ve found the most useful tactic when discussing the connection between race and crime is to appeal to their heightened fears of sex crime.  However, it is intriguing to observe that comparative sex crimes do not follow the pattern of violent crimes.  In the UK, the average black man is 275 percent more likely to commit a sex offense than the average white man, the comparable delta in the USA is 763 percent.  However, I suspect this is mostly an artifact of the larger and more segregated black population because 24 percent of all American sex offenses are black-on-black. The relevant delta for a white American woman is much closer to the overall UK figure at 334 percent.\nStill, the fact that the average black man poses\nmore than four times the sexual assault risk\nto a white woman than the average white man is not something that is taught to young American women despite the fact that most women’s studies programs spend a great deal of time discussing the sexual dangers posed by men.  Then again, math is hard….\nI note that vaccines are declared to be safe on statistical grounds that are far less sound than the statistical correlations reliably observed between race and criminal behavior in various societies.  As usual, the merciless application of the facts across the board will tend to expose the attempt of the ideological left to conceal the truth through ignorance, deceit, and sophistry.\nScience and statistics are gradually destroying the myth of equality, which is why we have now reached the point that many governments, including the US federal government, are being forced to resort to hiding statistics they once deemed necessary in order to continue justifying their false equalitarian dogma.  But the truth is what it is, whether we like it or not, and deceit that flies in the face of observable reality is eventually going to be exposed.",
  "tags": [
    "society",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-04T13:31:00+00:00"
}