{
  "url": "https://voxday.net/2013/08/14/tiananmen-spring/",
  "scraped_at": "2025-12-14T22:38:47.595447",
  "title": "Tiananmen Spring",
  "date_display": "August 14, 2013",
  "date_iso": "2013-08-14T13:00:00+00:00",
  "date_from_url": "2013-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall I was more than a little dubious about the “Arab Spring” being trumpeted by Middle East experts such as Thomas Friedman:</p><blockquote class=\"tr_bq\"><p> A security operation to clear protesters camped out on the streets of<br> Cairo since President Mohamed Morsi was deposed by the military last<br> month has left at least 40 people died. The Egyptian Interior Ministry says 200 people have been arrested,<br> including 50 in the Rabaa al-Adawiya sit-in in Nasr City and 150 at the<br> Nahda Square sit-in in Giza.</br></br></br></br></p><p>By mid-morning, state television reported that security forces had finished breaking up the sit-in there. Bulldozers were said to have been used to uproot the camps. The Interior Ministry said security forces had “total control” over<br> Nahda Square, and that “police forces had managed to remove most of the<br> tents” in the area. Security forces had blocked all access to the<br> protest camp.<br> <strong><br/></strong><br> Sources on the ground told Al Jazeera of at least 40 fatalities,<br> while the Muslim Brotherhood said at least 300 people had been killed,<br> with more than 5,000 others injured.</br></br></br></br></br></br></br></p></blockquote><p>Democracy is not a viable alternative for any society that is not both fully civilized and homogenous.  It used to work for the USA and the UK.  It still works in Japan. It has never really worked on the continent of Europe. It is not a societal panacea and it should never come as a surprise when the imposition of a democratic system leads directly to violence and political turmoil.</p><p>Remember, civil war is nothing more than extreme politics.</p></div>",
  "content_text": "You may recall I was more than a little dubious about the “Arab Spring” being trumpeted by Middle East experts such as Thomas Friedman:\nA security operation to clear protesters camped out on the streets of\nCairo since President Mohamed Morsi was deposed by the military last\nmonth has left at least 40 people died. The Egyptian Interior Ministry says 200 people have been arrested,\nincluding 50 in the Rabaa al-Adawiya sit-in in Nasr City and 150 at the\nNahda Square sit-in in Giza.\nBy mid-morning, state television reported that security forces had finished breaking up the sit-in there. Bulldozers were said to have been used to uproot the camps. The Interior Ministry said security forces had “total control” over\nNahda Square, and that “police forces had managed to remove most of the\ntents” in the area. Security forces had blocked all access to the\nprotest camp.\nSources on the ground told Al Jazeera of at least 40 fatalities,\nwhile the Muslim Brotherhood said at least 300 people had been killed,\nwith more than 5,000 others injured.\nDemocracy is not a viable alternative for any society that is not both fully civilized and homogenous.  It used to work for the USA and the UK.  It still works in Japan. It has never really worked on the continent of Europe. It is not a societal panacea and it should never come as a surprise when the imposition of a democratic system leads directly to violence and political turmoil.\nRemember, civil war is nothing more than extreme politics.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-14T12:00:00+00:00"
}