{
  "url": "https://voxday.net/2013/08/23/vet-killed-by-vibrant-america/",
  "scraped_at": "2025-12-14T22:39:47.868564",
  "title": "Vet killed by Vibrant America",
  "date_display": "August 23, 2013",
  "date_iso": "2013-08-23T10:33:00+00:00",
  "date_from_url": "2013-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What presently <a href=\"http://www.kxly.com/news/spokane-news/elderly-man-dies-after-being-attacked-outside-ice-arena/-/101214/21574858/-/9flm7iz/-/index.html\" rel=\"noopener\" target=\"_blank\">passes for the USA</a> is observably no longer the nation for which Mr. Belton fought:</p><blockquote class=\"tr_bq\"><p> WWII veteran Delbert Belton survived being wounded in action during the Battle of Okinawa only to be beaten and left for dead by two teens at the Eagles Lodge in Spokane on Wednesday evening. Belton, 88, succumbed to his injuries Thursday morning at Sacred Heart Medical Center.</p><p>Witnesses say Belton was in the parking lot of the Eagles Lodge at 6410 N. Lidgerwood, adjacent to the Eagles Ice-A-Rena, around 8 p.m. Wednesday when the two male suspects attacked him as he was about to head inside to play pool.</p><p>Spokane police are looking for two male suspects in the attack. They<br> said the suspects are African Americans between 16 and 19 years old. One<br> suspect was described as heavy set and wearing all black clothing. The<br> other was described as being about 6 feet tall and 150 pounds.</br></br></br></p></blockquote><p>It increasingly appears as if the two choices facing America are peaceful segregation or ethnic violence and civil war.  Contra the expectations of the multicultis and the anti-racists, the vibrant community is becoming less civilized as they become more numerous.  The civil rights vision has failed and appeasement clearly works no better with vibrants than it did with Nazis.</p><p>Those who babble interminably about racism and equality are no more relevant to the practical discussion of what should be done than the disarmament activists were after the invasion of Czechoslovakia.  Let reason be silent when experience gainsays its conclusions. No one needs to understand what inspires young vibrants to commit these acts of unprovoked and murderous violence in order to render it impossible for them to do so in the future.</p><p>The only real question is how much of this violence white, Hispanic, and Asian Americans are willing to tolerate before they finally put an end to it. It is observably worse than it was <a href=\"http://www.examiner.com/article/federal-statistics-of-black-on-white-violence-with-links-and-mathematical-extrapolation-formulas\" rel=\"noopener\" target=\"_blank\">in 2009</a>, when it was reported “Blacks are 39 times more likely to commit a violent crime against whites then vice versa…. Forty-five percent of black crime is against whites, 43 against other blacks, and 10 percent against Hispanic.”</p><p>Is it possible that I am wrong and contra both my observations and historical patterns that can be observed throughout the entire written record of Man, the USA is not going to be riven by ethnic strife, but is instead on the verge of transforming itself into a glorious and peaceful multi-ethnic utopia?  Theoretically, I suppose.  But the probabilities of such an outcome are not high.</p></div>",
  "content_text": "What presently\npasses for the USA\nis observably no longer the nation for which Mr. Belton fought:\nWWII veteran Delbert Belton survived being wounded in action during the Battle of Okinawa only to be beaten and left for dead by two teens at the Eagles Lodge in Spokane on Wednesday evening. Belton, 88, succumbed to his injuries Thursday morning at Sacred Heart Medical Center.\nWitnesses say Belton was in the parking lot of the Eagles Lodge at 6410 N. Lidgerwood, adjacent to the Eagles Ice-A-Rena, around 8 p.m. Wednesday when the two male suspects attacked him as he was about to head inside to play pool.\nSpokane police are looking for two male suspects in the attack. They\nsaid the suspects are African Americans between 16 and 19 years old. One\nsuspect was described as heavy set and wearing all black clothing. The\nother was described as being about 6 feet tall and 150 pounds.\nIt increasingly appears as if the two choices facing America are peaceful segregation or ethnic violence and civil war.  Contra the expectations of the multicultis and the anti-racists, the vibrant community is becoming less civilized as they become more numerous.  The civil rights vision has failed and appeasement clearly works no better with vibrants than it did with Nazis.\nThose who babble interminably about racism and equality are no more relevant to the practical discussion of what should be done than the disarmament activists were after the invasion of Czechoslovakia.  Let reason be silent when experience gainsays its conclusions. No one needs to understand what inspires young vibrants to commit these acts of unprovoked and murderous violence in order to render it impossible for them to do so in the future.\nThe only real question is how much of this violence white, Hispanic, and Asian Americans are willing to tolerate before they finally put an end to it. It is observably worse than it was\nin 2009\n, when it was reported “Blacks are 39 times more likely to commit a violent crime against whites then vice versa…. Forty-five percent of black crime is against whites, 43 against other blacks, and 10 percent against Hispanic.”\nIs it possible that I am wrong and contra both my observations and historical patterns that can be observed throughout the entire written record of Man, the USA is not going to be riven by ethnic strife, but is instead on the verge of transforming itself into a glorious and peaceful multi-ethnic utopia?  Theoretically, I suppose.  But the probabilities of such an outcome are not high.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-08-23T09:33:00+00:00"
}