{
  "url": "https://voxday.net/2009/01/21/ad-2-atheist-logic/",
  "scraped_at": "2026-01-08T22:46:09.828494",
  "title": "AD #2: Atheist logic",
  "date_display": "January 21, 2009",
  "date_iso": "2009-01-21T08:45:00+00:00",
  "date_from_url": "2009-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXZHIRt_oKI/AAAAAAAAAFw/j6kmhIdEQTI/s1600-h/ATHEIST+LOGIC.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2009/01/ATHEIST-LOGIC.jpg\" style=\"margin: 0pt 10px 10px 0pt; float: left; cursor: pointer; width: 320px; height: 400px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2009/01/ATHEIST-LOGIC.jpg\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5293496619541438626\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"margin: 0pt 10px 10px 0pt; float: left; cursor: pointer; width: 320px; height: 400px;\"/></a>One of the most interesting things about all of the squawking and shrieking by various Internet atheists in response to <i>The Irrational Atheist</i> has been the way they have tended to complain about the contempt I show for their champions while failing to even try to refute the great majority of the charges.  No one, for example, has serously attempted to defend any of Daniel Dennett’s logical blunders, which are particularly damning in an academic who is supposed to be a reasonably competent philosopher.  At first I suspected this might due to the fact that they were so relieved I wasn’t blasting away at one of the New Atheists with both barrels for once that they didn’t even notice how the blatant errors in Dennett’s thinking tend to undermine the man’s reputation.  However, after seeing the way one critic after another showed a near complete inability to competently address any of the many cases I have made, I was forced to conclude that merely seeing the words “division of doxastic labor” is enough to make their overheated little brains shut down and force them to skip ahead to the next chapter, which is a nice bit and also makes fun of the French.</p><p>Dennett’s rationale for not holding those who believe in science accountable for the same doxastic division of labor he calls “immoral” in religious individuals is not his only logical error in <i>Breaking the Spell</i>, but it is easily the least defensible.  Perhaps if his editor had been capable of understanding the philosopher’s logic and done him the favor of it repeating it accurately to him, Dennett would have recognized the absurdity of his position and saved himself serious embarrassment.</p></div>",
  "content_text": "One of the most interesting things about all of the squawking and shrieking by various Internet atheists in response to\nThe Irrational Atheist\nhas been the way they have tended to complain about the contempt I show for their champions while failing to even try to refute the great majority of the charges.  No one, for example, has serously attempted to defend any of Daniel Dennett’s logical blunders, which are particularly damning in an academic who is supposed to be a reasonably competent philosopher.  At first I suspected this might due to the fact that they were so relieved I wasn’t blasting away at one of the New Atheists with both barrels for once that they didn’t even notice how the blatant errors in Dennett’s thinking tend to undermine the man’s reputation.  However, after seeing the way one critic after another showed a near complete inability to competently address any of the many cases I have made, I was forced to conclude that merely seeing the words “division of doxastic labor” is enough to make their overheated little brains shut down and force them to skip ahead to the next chapter, which is a nice bit and also makes fun of the French.\nDennett’s rationale for not holding those who believe in science accountable for the same doxastic division of labor he calls “immoral” in religious individuals is not his only logical error in\nBreaking the Spell\n, but it is easily the least defensible.  Perhaps if his editor had been capable of understanding the philosopher’s logic and done him the favor of it repeating it accurately to him, Dennett would have recognized the absurdity of his position and saved himself serious embarrassment.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-21T08:45:00+00:00"
}