{
  "url": "https://voxday.net/2009/01/08/awsommely-bad-idea/",
  "scraped_at": "2026-01-08T22:45:05.383259",
  "title": "An awsommely bad idea",
  "date_display": "January 8, 2009",
  "date_iso": "2009-01-08T21:30:00+00:00",
  "date_from_url": "2009-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Arnold Kling perceives <a href=\"http://econlog.econlib.org/archives/2009/01/the_stimulus_an.html\">a rather unpromising historical analogy</a>:</p><blockquote><p>I was reminded of the Battle of the Somme, one of the worst policy blunders of all time. Having experienced nothing but failure using offensive tactics up to that point, the Allies decided that what they needed to try was….a really big offensive. Just as Feldstein and Stiglitz pay no attention to the on-the-ground the housing market, the British generals ignored the impact of machine guns on men advancing over open fields.</p><p>My guess is that in 1916, anyone who doubted his own ability to direct an enormous offensive involving hundreds of thousands of soldiers would never have made it to general. Similarly, today, anyone who doubts the ability of a handful of technocrats to sensibly allocate $800 billion would never make it into government or the mainstream media….  The arithmetic is mind-boggling. If 500 people have meaningful input, and the stimulus is almost $800 billion, then on average each person is responsible for taking more than $1.5 billion of our money and trying to spend it more wisely than we would spend it ourselves.</p></blockquote><p>Considering that it was some 89 years ago that Ludwig von Mises first demonstrated <a href=\"http://mises.org/books/socialism/part2_ch6.aspx\">the Impossibility of Socialist Calculation</a>, it’s stunning to observe that Americans are collectively dumb enough to intentionally repeat one of Mankind’s greatest economic blunders.  I mean, I am perfectly aware that most people are idiots, repeating that as a mantra is about the only way one can watch the news with equanimity these days, but come on!</p></div>",
  "content_text": "Arnold Kling perceives\na rather unpromising historical analogy\n:\nI was reminded of the Battle of the Somme, one of the worst policy blunders of all time. Having experienced nothing but failure using offensive tactics up to that point, the Allies decided that what they needed to try was….a really big offensive. Just as Feldstein and Stiglitz pay no attention to the on-the-ground the housing market, the British generals ignored the impact of machine guns on men advancing over open fields.\nMy guess is that in 1916, anyone who doubted his own ability to direct an enormous offensive involving hundreds of thousands of soldiers would never have made it to general. Similarly, today, anyone who doubts the ability of a handful of technocrats to sensibly allocate $800 billion would never make it into government or the mainstream media….  The arithmetic is mind-boggling. If 500 people have meaningful input, and the stimulus is almost $800 billion, then on average each person is responsible for taking more than $1.5 billion of our money and trying to spend it more wisely than we would spend it ourselves.\nConsidering that it was some 89 years ago that Ludwig von Mises first demonstrated\nthe Impossibility of Socialist Calculation\n, it’s stunning to observe that Americans are collectively dumb enough to intentionally repeat one of Mankind’s greatest economic blunders.  I mean, I am perfectly aware that most people are idiots, repeating that as a mantra is about the only way one can watch the news with equanimity these days, but come on!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-08T21:30:00+00:00"
}