{
  "url": "https://voxday.net/2009/01/22/cracks-widen-2/",
  "scraped_at": "2026-01-08T22:46:16.935480",
  "title": "The cracks widen",
  "date_display": "January 22, 2009",
  "date_iso": "2009-01-22T20:45:00+00:00",
  "date_from_url": "2009-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When I have warned of a violent end to European multiculturalism in the past, those who look favorably on cultural plurality have tended to dismiss the prediction as being somehow unthinkable or the product of my wild-eyed fever dreams.  It will be interesting to see what they make of <a href=\"http://www.foxnews.com/story/0,2933,481351,00.html\">a similar warning from a very different source</a>:</p><blockquote><p>Yazid Sabeg issued a wakeup call to the French nation, which has already suffered major rioting from alienated immigrant youth in the country’s social housing projects. He stressed that the current financial crisis will hit those suffering from discrimination and lack of opportunity most severely.  “We are creating a social civil war in this country,” said Sabeg. “I believe that today we are digging a ditch that leads straight into apartheid.”</p><p>Sabeg is the son of Algerian immigrants and is known for his efforts to bring equality to the workplace. President Nicolas Sarkozy appointed Sabeg in December to the newly created post of diversity and equality commissioner. He is to oversee a government action plan aimed at putting more ethnic minorities on TV screens, in political parties and in elite schools that lead to jobs in government and industry.</p></blockquote><p>Sabeg is correct about the incipient problems, but his solution is akin to trying to burn out a cancer by pouring gasoline over the victim and setting him on fire.  It will eventually come down to violence and expulsion or violence and occupation.  Those are the two options that history has always presented humanity in the past.</p></div>",
  "content_text": "When I have warned of a violent end to European multiculturalism in the past, those who look favorably on cultural plurality have tended to dismiss the prediction as being somehow unthinkable or the product of my wild-eyed fever dreams.  It will be interesting to see what they make of\na similar warning from a very different source\n:\nYazid Sabeg issued a wakeup call to the French nation, which has already suffered major rioting from alienated immigrant youth in the country’s social housing projects. He stressed that the current financial crisis will hit those suffering from discrimination and lack of opportunity most severely.  “We are creating a social civil war in this country,” said Sabeg. “I believe that today we are digging a ditch that leads straight into apartheid.”\nSabeg is the son of Algerian immigrants and is known for his efforts to bring equality to the workplace. President Nicolas Sarkozy appointed Sabeg in December to the newly created post of diversity and equality commissioner. He is to oversee a government action plan aimed at putting more ethnic minorities on TV screens, in political parties and in elite schools that lead to jobs in government and industry.\nSabeg is correct about the incipient problems, but his solution is akin to trying to burn out a cancer by pouring gasoline over the victim and setting him on fire.  It will eventually come down to violence and expulsion or violence and occupation.  Those are the two options that history has always presented humanity in the past.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-22T20:45:00+00:00"
}