{
  "url": "https://voxday.net/2009/01/16/ding-dong-strib-is-dead/",
  "scraped_at": "2026-01-08T22:45:49.683797",
  "title": "Ding-dong, the Strib is dead",
  "date_display": "January 16, 2009",
  "date_iso": "2009-01-16T18:30:00+00:00",
  "date_from_url": "2009-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Okay, so <a href=\"http://www.reuters.com/article/americasDealsNews/idUSTRE50F1BW20090116\">the corpse hasn’t actually quit twitching</a> yet, but I, for one, anticipate bidding a cheerful “good riddance” to the Star &amp; Sickle:</p><blockquote><p>The Minneapolis Star Tribune filed for bankruptcy, becoming one of the biggest U.S. newspapers yet to financially flame out under a heavy debt load and a punishing decline in advertising revenue.  The 15th-largest U.S. daily based on circulation, which McClatchy Co sold to private equity firm Avista Capital Partners for $530 million less than two years ago, filed for Chapter 11 bankruptcy protection after missing payments to lenders, it said on Thursday.</p></blockquote><p>I actually spoke with an editor at the Star Tribune about writing an electronic games column for them many years ago, but being clueless dinosaurs, they didn’t think anyone would be interested in reading about <i>video games</i>.  The editor at the Pioneer Press, on the other hand, thought it was a great idea, which, among other things, eventually led to this blog.</p><p>That’s not why I have long disliked the paper, though.  Its unique combination of clueless arrogance, incompetent economics coverage, and mindless cheerleading of all things Left was astonishing for a product of the Midwest.  It was a paper produced by people who wanted to be living in either New York City or San Francisco, and it showed.  The Red Star actually had a MORE annoying collection of Democratic columnists than the New York Times has ever managed to assemble.</p><p>This is, of course, tremendously amusing in light of all those people who used to try to give me a hard time for electing to write for an Internet site… which just happens to have a readership that is not only larger than the Star Tribune, but has continued to grow since I began writing there in 2001.  I guess after the last newspaper dies, there won’t be any real opinion writers anymore, we’ll all just be bloggers posting away in our pajamas.</p></div>",
  "content_text": "Okay, so\nthe corpse hasn’t actually quit twitching\nyet, but I, for one, anticipate bidding a cheerful “good riddance” to the Star & Sickle:\nThe Minneapolis Star Tribune filed for bankruptcy, becoming one of the biggest U.S. newspapers yet to financially flame out under a heavy debt load and a punishing decline in advertising revenue.  The 15th-largest U.S. daily based on circulation, which McClatchy Co sold to private equity firm Avista Capital Partners for $530 million less than two years ago, filed for Chapter 11 bankruptcy protection after missing payments to lenders, it said on Thursday.\nI actually spoke with an editor at the Star Tribune about writing an electronic games column for them many years ago, but being clueless dinosaurs, they didn’t think anyone would be interested in reading about\nvideo games\n.  The editor at the Pioneer Press, on the other hand, thought it was a great idea, which, among other things, eventually led to this blog.\nThat’s not why I have long disliked the paper, though.  Its unique combination of clueless arrogance, incompetent economics coverage, and mindless cheerleading of all things Left was astonishing for a product of the Midwest.  It was a paper produced by people who wanted to be living in either New York City or San Francisco, and it showed.  The Red Star actually had a MORE annoying collection of Democratic columnists than the New York Times has ever managed to assemble.\nThis is, of course, tremendously amusing in light of all those people who used to try to give me a hard time for electing to write for an Internet site… which just happens to have a readership that is not only larger than the Star Tribune, but has continued to grow since I began writing there in 2001.  I guess after the last newspaper dies, there won’t be any real opinion writers anymore, we’ll all just be bloggers posting away in our pajamas.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-16T18:30:00+00:00"
}