{
  "url": "https://voxday.net/2009/01/05/dont-stop-until-democrat-wins/",
  "scraped_at": "2026-01-08T22:44:45.202170",
  "title": "Don’t stop until the Democrat wins",
  "date_display": "January 5, 2009",
  "date_iso": "2009-01-05T15:35:00+00:00",
  "date_from_url": "2009-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The count finally comes out <a href=\"http://www.cnn.com/2009/POLITICS/01/04/minnesota.senate.race/index.html\">the way they wanted</a>:</p><blockquote><p>A state election board on Monday will announce Democrat Al Franken has defeated Republican incumbent Norm Coleman in Minnesota’s U.S. Senate race, state officials told CNN Sunday.<br>A board will say Al Franken won the U.S. Senate race by 225 votes, Minnesota’s secretary of state says.  The canvassing board on Monday will say a recount determined Franken won by 225 votes, Secretary of State Mark Ritchie told CNN.</br></p></blockquote><p>Norm Coleman’s defeat is no loss for Minnesotans or for conservatives, as the replacement with one liberal Jew born in New York with a more liberal Jew also born in New York is hardly going to make much of a difference; at least Franken grew up there and has some genuinely Minnesotan sensibilities.  And, let’s face it, there’s even more prospective hilarity to be expected with Senator Franken than there was with Senator Wellstone and Governor Ventura <i>combined</i>.</p><p>Of course, his election should suffice to create some doubts among those who still seriously buy into the idea that voting is a sacred responsibility.</p><p>UPDATE – Every vote counts.  And some votes <a href=\"http://online.wsj.com/article/SB123111967642552909.html\">count twice</a>:</p><blockquote><p>Under Minnesota law, election officials are required to make a duplicate ballot if the original is damaged during Election Night counting. Officials are supposed to mark these as “duplicate” and segregate the original ballots. But it appears some officials may have failed to mark ballots as duplicates, which are now being counted in addition to the originals. This helps explain why more than 25 precincts now have more ballots than voters who signed in to vote.</p></blockquote></div>",
  "content_text": "The count finally comes out\nthe way they wanted\n:\nA state election board on Monday will announce Democrat Al Franken has defeated Republican incumbent Norm Coleman in Minnesota’s U.S. Senate race, state officials told CNN Sunday.\nA board will say Al Franken won the U.S. Senate race by 225 votes, Minnesota’s secretary of state says.  The canvassing board on Monday will say a recount determined Franken won by 225 votes, Secretary of State Mark Ritchie told CNN.\nNorm Coleman’s defeat is no loss for Minnesotans or for conservatives, as the replacement with one liberal Jew born in New York with a more liberal Jew also born in New York is hardly going to make much of a difference; at least Franken grew up there and has some genuinely Minnesotan sensibilities.  And, let’s face it, there’s even more prospective hilarity to be expected with Senator Franken than there was with Senator Wellstone and Governor Ventura\ncombined\n.\nOf course, his election should suffice to create some doubts among those who still seriously buy into the idea that voting is a sacred responsibility.\nUPDATE – Every vote counts.  And some votes\ncount twice\n:\nUnder Minnesota law, election officials are required to make a duplicate ballot if the original is damaged during Election Night counting. Officials are supposed to mark these as “duplicate” and segregate the original ballots. But it appears some officials may have failed to mark ballots as duplicates, which are now being counted in addition to the originals. This helps explain why more than 25 precincts now have more ballots than voters who signed in to vote.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-05T15:35:00+00:00"
}