{
  "url": "https://voxday.net/2009/01/08/global-warming-naming-names/",
  "scraped_at": "2026-01-08T22:44:59.887740",
  "title": "Global Warming: naming names",
  "date_display": "January 8, 2009",
  "date_iso": "2009-01-08T09:09:00+00:00",
  "date_from_url": "2009-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that the polar ice cap is not only NOT ice-free as predicted by the global climate change charlatans <a href=\"http://www.cnn.com/2008/WORLD/weather/06/27/north.pole.melting/\">as recently as June</a>, but is actually back at levels <a href=\"http://www.dailytech.com/Article.aspx?newsid=13834\">not seen since 1979</a>, it is becoming <a href=\"http://www.dailymail.co.uk/news/article-1105053/The-day-sea-froze-Temperature-plunges-MINUS-12C-forecasters-say-wont-warm-Sunday.html\">ever more clear</a> to all and sundry that the “scientific fact” of global warming is verifiably false.  Of course, this also serves to demonstrate that science, as represented by so-called “scientific consensus”, is a fundamentally unreliable tool with which to establish verifiable facts.  Because of this, I’m interested in keeping track of those science fetishists who have used global warming as a foundation of their argument that science is the only proper arbiter of reality.  Here’s a few of the individuals I have identified as devotees of the global climate change charade; feel free to suggest more additions as you find confirmation of their belief in global warming.</p><blockquote><p><a href=\"http://denerding.blogspot.com/2008/02/al-gore-north-polar-icecap-gone-in-5.html\">Al Gore</a><br>“We could take the whole session talking just about the new scientific evidence of the last few weeks and months showing that the climate crisis is significantly worse and unfolding more rapidly than those on the pessimistic side of the IPCC projections have warned us.”</br></p><p><a href=\"http://www.independent.co.uk/news/people/profiles/richard-dawkins-you-ask-the-questions-special-427003.html\">Richard Dawkins</a><br>RT: Is global warming a threat to the human species?</br></p><p>RD: Yes.  You could say that the human species is a threat to the human species. I recommend Al Gore’s film on global warming. See it and weep. Not just for the human species.</p><p><a href=\"http://newsweek.washingtonpost.com/onfaith/daniel_c_dennett/\">Daniel Dennett</a><br>“The larger problem with this week’s ON FAITH question is that it is being asked at all. This question should not be seen as a matter of personal conviction or opinion at all. People’s hunches, anecdotal recollections, or personal convictions are of no more weight here than they would be about the causes of global warming. You have asked an empirical question, and there are established methods for answering such questions. Encouraging any other approach is actually undermining proper respect for scientific methods and facts, right alongside the nefarious tactics of the tobacco companies, the global warming skeptics, and the “teach the controversy” Intelligent Design crowd who have so successfully persuaded so many people to treat factual material as if it were mere opinion.”</br></p><p><a href=\"http://pharyngula.org/index/weblog/comments/a_neandertal_academic/\">Paul Myers</a><br>“What does “environmental religion” mean? Did they teach her to worship dryads or something?  Or do you consider teaching someone about global warming, ozone holes, or ongoing extinctions, all established facts about our natural world, to be indoctrination?”</br></p><p><a href=\"http://gristmill.grist.org/story/2009/1/7/134728/5150\">Arianna Huffington</a><br>“I am a firm believer that there are not two sides to every issue, and that on some issues the jury is no longer out. The climate crisis is one of these issues.”</br></p></blockquote><p>But why, one must ask Daniel Dennett, should one have any respect for “scientific method and facts” when they are <a href=\"http://www.milobookclub.com/2008/03/13/triumph-of-science-skeptic/\">demonstrably less reliable* than intelligent intuition</a>?  The proper level of respect in these particular cases is, in fact, none.  Now, at this point it’s still theoretically possible that these individuals will be rewarded in their faith over time if the recent cold snaps around the world don’t turn out to be a genuine trend.  But, if they are not correct, then this will conclusively prove that there is no legitimate reason to pay a “scientific consensus” any more regard than one does the collective opinions of any other group of semi-educated people.</p><p>The insightful observer will further note that if all of the global warming models are confirmed to be false over the next five years, it will not only be reasonable, but downright necessary, to question other “established facts” held to be true on this same basis of scientific consensus by this gullible flock of the scientific faithful.</p><p>*<i>“Dark Matter and Dark Energy…Dark Matter and Dark Energy…. Our two explanations are Dark Matter and Dark Energy…and Dark Vapor…. Our three explanations are Dark Matter, and Dark Energy, and Dark Vapor…and an almost fanatical devotion to Karl Popper…. Our four…no… Amongst our explanations are such elements as Dark Matter, Dark Energy…. I’ll come in again.”</i></p></div>",
  "content_text": "Now that the polar ice cap is not only NOT ice-free as predicted by the global climate change charlatans\nas recently as June\n, but is actually back at levels\nnot seen since 1979\n, it is becoming\never more clear\nto all and sundry that the “scientific fact” of global warming is verifiably false.  Of course, this also serves to demonstrate that science, as represented by so-called “scientific consensus”, is a fundamentally unreliable tool with which to establish verifiable facts.  Because of this, I’m interested in keeping track of those science fetishists who have used global warming as a foundation of their argument that science is the only proper arbiter of reality.  Here’s a few of the individuals I have identified as devotees of the global climate change charade; feel free to suggest more additions as you find confirmation of their belief in global warming.\nAl Gore\n“We could take the whole session talking just about the new scientific evidence of the last few weeks and months showing that the climate crisis is significantly worse and unfolding more rapidly than those on the pessimistic side of the IPCC projections have warned us.”\nRichard Dawkins\nRT: Is global warming a threat to the human species?\nRD: Yes.  You could say that the human species is a threat to the human species. I recommend Al Gore’s film on global warming. See it and weep. Not just for the human species.\nDaniel Dennett\n“The larger problem with this week’s ON FAITH question is that it is being asked at all. This question should not be seen as a matter of personal conviction or opinion at all. People’s hunches, anecdotal recollections, or personal convictions are of no more weight here than they would be about the causes of global warming. You have asked an empirical question, and there are established methods for answering such questions. Encouraging any other approach is actually undermining proper respect for scientific methods and facts, right alongside the nefarious tactics of the tobacco companies, the global warming skeptics, and the “teach the controversy” Intelligent Design crowd who have so successfully persuaded so many people to treat factual material as if it were mere opinion.”\nPaul Myers\n“What does “environmental religion” mean? Did they teach her to worship dryads or something?  Or do you consider teaching someone about global warming, ozone holes, or ongoing extinctions, all established facts about our natural world, to be indoctrination?”\nArianna Huffington\n“I am a firm believer that there are not two sides to every issue, and that on some issues the jury is no longer out. The climate crisis is one of these issues.”\nBut why, one must ask Daniel Dennett, should one have any respect for “scientific method and facts” when they are\ndemonstrably less reliable* than intelligent intuition\n?  The proper level of respect in these particular cases is, in fact, none.  Now, at this point it’s still theoretically possible that these individuals will be rewarded in their faith over time if the recent cold snaps around the world don’t turn out to be a genuine trend.  But, if they are not correct, then this will conclusively prove that there is no legitimate reason to pay a “scientific consensus” any more regard than one does the collective opinions of any other group of semi-educated people.\nThe insightful observer will further note that if all of the global warming models are confirmed to be false over the next five years, it will not only be reasonable, but downright necessary, to question other “established facts” held to be true on this same basis of scientific consensus by this gullible flock of the scientific faithful.\n*\n“Dark Matter and Dark Energy…Dark Matter and Dark Energy…. Our two explanations are Dark Matter and Dark Energy…and Dark Vapor…. Our three explanations are Dark Matter, and Dark Energy, and Dark Vapor…and an almost fanatical devotion to Karl Popper…. Our four…no… Amongst our explanations are such elements as Dark Matter, Dark Energy…. I’ll come in again.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-08T09:09:00+00:00"
}