{
  "url": "https://voxday.net/2009/01/07/mailvox-on-gaza/",
  "scraped_at": "2026-01-08T22:44:54.291118",
  "title": "Mailvox: on Gaza",
  "date_display": "January 7, 2009",
  "date_iso": "2009-01-07T10:24:00+00:00",
  "date_from_url": "2009-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CD asks about the recent military operations in Gaza:</p><blockquote><p>Can you share with us your thoughts on the Israel attacks on Gaza?  I’d be interested to hear your perspective.  I already know Justin Raimondo’s</p></blockquote><p>While I like and respect Justin Raimondo, appreciate his consistent criticism of America’s War Party, and understand <a href=\"http://www.antiwar.com/justin/?articleid=14001\">his take on the current violence</a>, I think it’s more important to look at the situation from a strategic and historical perspective than from a political perspective, particularly an <i>American</i> political perspective.</p><p>Raimondo is absolutely right to question the reasons behind Washington’s tacit support of the Israeli attacks; there is very good reason to be suspicious of many of the individuals who insist on attempting to subordinate American foreign policy to the Israeli national interest.  But none of those political realities have anything to do with the fundamental problem underlying the Gaza operations because the core issue is a straightforward one that revolves around a very basic historical reality: The Palestinians refuse to recognize the very right of conquest by which they themselves previously held claim to the land.</p><p>In considering this, I note that it is irrelevant to debate the question of whether the descendants of Ashkenazi European Zionists hold the same historical claim to the land of Israel as Sephardic Jews, given that the way in which that historical claim is based on an identical right of conquest.  From the historical perspective, the primary issue is the realization that the situation will remain violent until one of three things happens:</p><p>1) The Palestinians accept their conquest and are peacefully digested into a trans-tribal Israeli identity.<br>2) The Israelis are forced to withdraw to the United States and Europe.<br>3) The Palestinians are forced to withdraw to the neighboring Arab countries.</br></br></p><p>Given the decades-long failure of various parties to force option (1) through a wide variety of measures, to say nothing of the obvious futility of attempting to construct a modern representative democracy with an electorate that would include a large and understandably bitter tribal near-majority, it’s not a reasonable strategy.  Option (2) is even less tenable given the military balance of power, leaving option (3) is the only possible solution <i>regardless of one’s sympathies or distaste for forced population movements</i>.</p><p>Understand that I’m not advocating this option, I’m merely pointing out the strategic realities of the situation.  My actual position is total indifference to the Gaza invasion, which those who read this blog have probably gleaned already based on my failure to so much as mention it prior to this post.  If the Palestinians don’t want to have their territory, which is held only by the permission of the Israeli authorities, strafed by IDF rockets and overrun by IDF tanks, then they should refrain from annoying their conquerers by firing mortars at them.</p><p>Anyhow, Israelis have the same right to Gaza as various Palestinians have <a href=\"http://www.breitbart.com/article.php?id=D95HN1H02&amp;show_article=1\">to London, Stockholm, Brussels, Toulouse, and Copenhagen</a>.  Because the Western authorities so foolishly ignored the sage warnings of men such as Samuel Huntington, the forced exodus of peoples everywhere from America to Europe and the Middle East is all but inevitable now.</p><p>UPDATE – My thinking may be original, but it is by no means new. Consider <a href=\"http://www.nationalreview.com/derbyshire/derbyshire050902.asp\">John Derbyshire’s 2002 article</a> on the issue:</p><p><i>What, actually, are the possible futures for the Palestinians? I think the following list is exhaustive.</i></p><p>1. An independent state, under Arafat or someone just as thuggish.<br>2. Military occupation by Israel.<br>3. Re-incorporation into a Jordanian-Palestinian nation.<br>4. Some sort of U.N. trusteeship.<br>5. Expulsion from the West Bank and Gaza, those territories then incorporated into Israel.</br></br></br></br></p><p>Number 1 is what we are all supposed to want. As I have already indicated, I don’t want it, and I can’t see why anyone else would, either. Except Palestinians, I suppose: If they yearn to be ruled by amoral hoodlums (as, according to polls, they apparently do), I suppose they have some theoretical right to see their wishes fulfilled — but why should the rest of us allow it to happen, given the dangers to us? Number 2 might work for a time, but the Israelis would eventually get fed up with it, and then we’d move on to one of the other options. Number 3 would get us back to the pseudo-stability of pre-1967, but is deeply unpopular with Jordanians — and look what happened in 1967! Number 4 undoubtedly has the UNRWA bureaucrats drooling, but as with number 1, it’s hard to see what’s in it for the rest of us. Aren’t we handing over enough of our money in welfare payments to our own people?</p><p>Which leaves us with number 5: expulsion. I am starting to think that this might be the best option</p><p>There would appear to be a high probability that in another seven years, there will be writers be making similarly keen observations of the obvious.</p></div>",
  "content_text": "CD asks about the recent military operations in Gaza:\nCan you share with us your thoughts on the Israel attacks on Gaza?  I’d be interested to hear your perspective.  I already know Justin Raimondo’s\nWhile I like and respect Justin Raimondo, appreciate his consistent criticism of America’s War Party, and understand\nhis take on the current violence\n, I think it’s more important to look at the situation from a strategic and historical perspective than from a political perspective, particularly an\nAmerican\npolitical perspective.\nRaimondo is absolutely right to question the reasons behind Washington’s tacit support of the Israeli attacks; there is very good reason to be suspicious of many of the individuals who insist on attempting to subordinate American foreign policy to the Israeli national interest.  But none of those political realities have anything to do with the fundamental problem underlying the Gaza operations because the core issue is a straightforward one that revolves around a very basic historical reality: The Palestinians refuse to recognize the very right of conquest by which they themselves previously held claim to the land.\nIn considering this, I note that it is irrelevant to debate the question of whether the descendants of Ashkenazi European Zionists hold the same historical claim to the land of Israel as Sephardic Jews, given that the way in which that historical claim is based on an identical right of conquest.  From the historical perspective, the primary issue is the realization that the situation will remain violent until one of three things happens:\n1) The Palestinians accept their conquest and are peacefully digested into a trans-tribal Israeli identity.\n2) The Israelis are forced to withdraw to the United States and Europe.\n3) The Palestinians are forced to withdraw to the neighboring Arab countries.\nGiven the decades-long failure of various parties to force option (1) through a wide variety of measures, to say nothing of the obvious futility of attempting to construct a modern representative democracy with an electorate that would include a large and understandably bitter tribal near-majority, it’s not a reasonable strategy.  Option (2) is even less tenable given the military balance of power, leaving option (3) is the only possible solution\nregardless of one’s sympathies or distaste for forced population movements\n.\nUnderstand that I’m not advocating this option, I’m merely pointing out the strategic realities of the situation.  My actual position is total indifference to the Gaza invasion, which those who read this blog have probably gleaned already based on my failure to so much as mention it prior to this post.  If the Palestinians don’t want to have their territory, which is held only by the permission of the Israeli authorities, strafed by IDF rockets and overrun by IDF tanks, then they should refrain from annoying their conquerers by firing mortars at them.\nAnyhow, Israelis have the same right to Gaza as various Palestinians have\nto London, Stockholm, Brussels, Toulouse, and Copenhagen\n.  Because the Western authorities so foolishly ignored the sage warnings of men such as Samuel Huntington, the forced exodus of peoples everywhere from America to Europe and the Middle East is all but inevitable now.\nUPDATE – My thinking may be original, but it is by no means new. Consider\nJohn Derbyshire’s 2002 article\non the issue:\nWhat, actually, are the possible futures for the Palestinians? I think the following list is exhaustive.\n1. An independent state, under Arafat or someone just as thuggish.\n2. Military occupation by Israel.\n3. Re-incorporation into a Jordanian-Palestinian nation.\n4. Some sort of U.N. trusteeship.\n5. Expulsion from the West Bank and Gaza, those territories then incorporated into Israel.\nNumber 1 is what we are all supposed to want. As I have already indicated, I don’t want it, and I can’t see why anyone else would, either. Except Palestinians, I suppose: If they yearn to be ruled by amoral hoodlums (as, according to polls, they apparently do), I suppose they have some theoretical right to see their wishes fulfilled — but why should the rest of us allow it to happen, given the dangers to us? Number 2 might work for a time, but the Israelis would eventually get fed up with it, and then we’d move on to one of the other options. Number 3 would get us back to the pseudo-stability of pre-1967, but is deeply unpopular with Jordanians — and look what happened in 1967! Number 4 undoubtedly has the UNRWA bureaucrats drooling, but as with number 1, it’s hard to see what’s in it for the rest of us. Aren’t we handing over enough of our money in welfare payments to our own people?\nWhich leaves us with number 5: expulsion. I am starting to think that this might be the best option\nThere would appear to be a high probability that in another seven years, there will be writers be making similarly keen observations of the obvious.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-07T10:24:00+00:00"
}