{
  "url": "https://voxday.net/2009/01/16/new-is-old/",
  "scraped_at": "2026-01-08T22:45:45.927922",
  "title": "Atheist is the New Heathen",
  "date_display": "January 16, 2009",
  "date_iso": "2009-01-16T08:59:00+00:00",
  "date_from_url": "2009-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Happiness is a well-stocked library.  One of the reasons I am in an exceedingly good mood today is that I finally obtained a set of the Cambridge Medieval History series planned by JB Bury to replace the one that was somehow lost amidst the chaos of a past move.  This one is actually in better shape than its predecessor, for all that the dustjackets and maps are missing, and I found the whole set for not much more than the going rate of two single volumes.  If you’re interested, and if you’re a regular here you doggone well should be, you can find <a href=\"http://www.archive.org/search.php?query=the%20cambridge%20medieval%20history\">PDFs of the eight volumes</a> here.  They’re absolutely worth the download, although at more than half a gig, you may want to burn them to CD rather than leave them on your hard drive.</p><p>Anyhow, having happily ensconced myself in the infamous Comfy Chair and settled down to a careful read yesterday evening, I was amused to encounter the following passage in light of last year’s literary labor:</p><p><i>Maximin’s endeavor was to stir up the principalities against the Christians, to organize a rival church of heathenism, and to give a definitely antichristian bias to education.  Even the fall of Maxentius had drawn from him only a rescript so full of inconsistencies that neither heathen nor Christian could make head or tail of it, except that Maximin was a prodigious liar.  He even denied that there had been any persecution during his reign.</i><br>– Cambridge Medieval History, Vol. 1 p. 5</br></p><p>Maximin was the Emperor Gaius Valerius Galerius Maximinus, whose persecution of Christians inspired his rivals Constantine and Licinius to issue the Edict of Milan, the first state recognition of religious freedom, and was defeated by Licinius in 313 AD.  The Edict was, like the Emancipation Proclamation, far more a political weapon than a genuine act of moral principle, but it had significant historical and philosophical ramifications.  The entire episode is fascinating, not so much for what it reveals about the rivalries of emperors or Constantine’s eminently pragmatic character, but for how it shows the way the heathen attack Christianity has changed very little in the last 1,700 years.</p><p><i>Plus ça change, plus c’est la même chose</i>.  It didn’t work for Maximin then.  It won’t work for Dawkins now.</p></div>",
  "content_text": "Happiness is a well-stocked library.  One of the reasons I am in an exceedingly good mood today is that I finally obtained a set of the Cambridge Medieval History series planned by JB Bury to replace the one that was somehow lost amidst the chaos of a past move.  This one is actually in better shape than its predecessor, for all that the dustjackets and maps are missing, and I found the whole set for not much more than the going rate of two single volumes.  If you’re interested, and if you’re a regular here you doggone well should be, you can find\nPDFs of the eight volumes\nhere.  They’re absolutely worth the download, although at more than half a gig, you may want to burn them to CD rather than leave them on your hard drive.\nAnyhow, having happily ensconced myself in the infamous Comfy Chair and settled down to a careful read yesterday evening, I was amused to encounter the following passage in light of last year’s literary labor:\nMaximin’s endeavor was to stir up the principalities against the Christians, to organize a rival church of heathenism, and to give a definitely antichristian bias to education.  Even the fall of Maxentius had drawn from him only a rescript so full of inconsistencies that neither heathen nor Christian could make head or tail of it, except that Maximin was a prodigious liar.  He even denied that there had been any persecution during his reign.\n– Cambridge Medieval History, Vol. 1 p. 5\nMaximin was the Emperor Gaius Valerius Galerius Maximinus, whose persecution of Christians inspired his rivals Constantine and Licinius to issue the Edict of Milan, the first state recognition of religious freedom, and was defeated by Licinius in 313 AD.  The Edict was, like the Emancipation Proclamation, far more a political weapon than a genuine act of moral principle, but it had significant historical and philosophical ramifications.  The entire episode is fascinating, not so much for what it reveals about the rivalries of emperors or Constantine’s eminently pragmatic character, but for how it shows the way the heathen attack Christianity has changed very little in the last 1,700 years.\nPlus ça change, plus c’est la même chose\n.  It didn’t work for Maximin then.  It won’t work for Dawkins now.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-16T08:59:00+00:00"
}