{
  "url": "https://voxday.net/2009/01/03/on-quality-of-evidence/",
  "scraped_at": "2026-01-08T22:44:36.026727",
  "title": "On the quality of evidence",
  "date_display": "January 3, 2009",
  "date_iso": "2009-01-03T16:08:00+00:00",
  "date_from_url": "2009-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dominic Saltarelli raises an interesting question:</p><blockquote><p>If we all agree that “faith” is trust in a source, this still begs the question of who to trust and why.  I’ve always taken evidence to mean things that you can verify for yourself. If my own mother came up to me and told me something outrageous, like a block of cheese told her where her favorite shoes were, I’d be skeptical.  Now, I trust my Mom more than anybody, but until I start conversing with dairy myself, I simply wouldn’t believe her story. I’d just think my Mom had gone nuts (and if she’s reading this, Hey Mom! Love you too!)</p><p>Similarly, if the Bible tells me that Jesus really did rise from the dead, why should I believe its account, but NOT believe Hercules killed a hydra, or Mohammed flew around on a winged horse?</p></blockquote><p>This is a perfectly reasonable perspective, although it is a mistake to think that evidence is something verifiable, as it is merely anything that provides grounds for belief.  A man will believe his mother loved him because she told him so when he was a child, while a scientist will believe what he reads in an old scientific journal because he has confidence in the scholarly reputations of the editors.  In both cases, the belief has reasonable evidential grounds even if it is not verifiable by the believer; the mother may be dead and the scientist may lack the expertise or the resources required to imitate the experiment reported.  And yet, the evidence remains, even if it is only the memory of words spoken long ago.</p><p>Unsurprisingly, Dominic’s perspective betrays an unconscious bias towards “scientific evidence” which is, ironically enough, a bit of a misnomer.  Consider the definition of evidence: <i>“that which tends to prove or disprove something; ground for belief</i>“.  Since scientists tell us repeatedly that science is not in the logical proof business but rather the pragmatic and effective model business, one could construct a perfectly rational case that there is no such thing as scientific evidence as the very concept borders on oxymoronic.  But, as this would be taking pedantry to an inutile extreme in these circumstances, we shall forgo that line of thought for the present and focus on answering Dominic’s question.</p><p>I believe the issue of Hercules has already been dealt with to Dominic’s satisfaction, so let’s consider the comparative value of the sources for Jesus Christ’s resurrection and Mohammed’s flying horse.  In the case of the latter, the oldest extant source is the one written down by Muhammad ibn Ismail al-Bukhari, who is reported to have collected over 300,000 hadith told to him and wrote down the 2,602 stories that he personally felt to be authentic.  Al-Bukhari wrote down these tales in 846, 214 years after the death of Mohammed.  Furthermore, one of the two major branches of Islam, the Shia, reject the Sahih Bukhari, going so far as to state that “There is NO requirement in Islam to believe in Sahih Bukhari….”</p><p>The story of Jesus Christ’s resurrection, on the other hand, is reportedly told by several of his personal companions, who claim to have encountered him subsequent to his very public death.  The oldest manuscript to date is the Magdelen Papyrus, which contains Matthew 26 and has been dated as early as 66 AD, 33 years after the events it describes.  The Lukan Papyrus is dated between 67 and 77 years after Christ’s reported death, and there are another 230 extant manuscripts compiled within 500 years of the event.</p><p>Contrast with this the earliest copies of the works of historians such as Thucydides, Herodotus, Aristotle, Caesar, and Tacitus.  There are no more than 20 copies of any of these manuscripts and the earliest extant copy was made more than 1,000 years after the original.  If it were not for the seemingly absurd claims about a man doing miracles and rising from the dead, no one would even think to question the historical veracity of the Bible.  And there’s simply no comparison between the veracity of an account to which every Christian today subscribes and the Islamic hadith, in which many Muslims place no credence.</p><p>Now, it would be one thing if the event described in Gospels was claimed to be a quotidian reality that, nevertheless, no one has witnessed since.  But that is not the case, as the accounts are very clear about the astonishing, even singular, nature of the event.  Common sense dictates that one ask oneself the question: if the resurrection of God’s Son was a one-time historical event as it purports to be, how else could eyewitness reports possibly have been recorded given the technology of the time, and what alternative explanation beyond the convincing nature of the reports will suffice to explain the enormous number of ancient manuscripts that were produced and circulated long before the Edict of Milan ended the Imperial persecution of Christianity and the Church achieved its position of intellectual domination that allowed it to put thousands of monks to work making manuscripts.</p><p>The truth is that modern doubts about the Gospel accounts have a basis that is no more objectively legitimate than that upon which al-Buhkari’s rejection of the vast majority of hadiths he was told rests.  They’re subjective, and they’re based on nothing more than personal feelings and the obvious difficulty in testing a historical event.  If the ancients are trusted to have reliably passed on the accounts of the Peloponnesian war for 1300 years, then they were quite obviously just as capable of faithfully passing on the eyewitness accounts of a strange event that took place in Jerusalem nearly two thousand years ago for a few decades.  Based on the available evidence, logic dictates that one either <i>tentatively</i> accept the essential reliability of the record testifying to Jesus Christ’s resurrection or reject the greater part of Mankind’s recorded history.</p><p>This may explain in part the peculiar nature of the New Atheism, given the obvious deficiencies of the New Atheists with regards to both logic and history.  Now, does this prove beyond any reasonable shadow of a doubt that Jesus Christ rose from the dead?  No, it does not.  But it should be more than enough to prove why that account is far more credible than the tale of a flying horse.</p><p><i>Note – any discussion of evolution or Creationism is off-topic and will be promptly deleted.</i></p></div>",
  "content_text": "Dominic Saltarelli raises an interesting question:\nIf we all agree that “faith” is trust in a source, this still begs the question of who to trust and why.  I’ve always taken evidence to mean things that you can verify for yourself. If my own mother came up to me and told me something outrageous, like a block of cheese told her where her favorite shoes were, I’d be skeptical.  Now, I trust my Mom more than anybody, but until I start conversing with dairy myself, I simply wouldn’t believe her story. I’d just think my Mom had gone nuts (and if she’s reading this, Hey Mom! Love you too!)\nSimilarly, if the Bible tells me that Jesus really did rise from the dead, why should I believe its account, but NOT believe Hercules killed a hydra, or Mohammed flew around on a winged horse?\nThis is a perfectly reasonable perspective, although it is a mistake to think that evidence is something verifiable, as it is merely anything that provides grounds for belief.  A man will believe his mother loved him because she told him so when he was a child, while a scientist will believe what he reads in an old scientific journal because he has confidence in the scholarly reputations of the editors.  In both cases, the belief has reasonable evidential grounds even if it is not verifiable by the believer; the mother may be dead and the scientist may lack the expertise or the resources required to imitate the experiment reported.  And yet, the evidence remains, even if it is only the memory of words spoken long ago.\nUnsurprisingly, Dominic’s perspective betrays an unconscious bias towards “scientific evidence” which is, ironically enough, a bit of a misnomer.  Consider the definition of evidence:\n“that which tends to prove or disprove something; ground for belief\n“.  Since scientists tell us repeatedly that science is not in the logical proof business but rather the pragmatic and effective model business, one could construct a perfectly rational case that there is no such thing as scientific evidence as the very concept borders on oxymoronic.  But, as this would be taking pedantry to an inutile extreme in these circumstances, we shall forgo that line of thought for the present and focus on answering Dominic’s question.\nI believe the issue of Hercules has already been dealt with to Dominic’s satisfaction, so let’s consider the comparative value of the sources for Jesus Christ’s resurrection and Mohammed’s flying horse.  In the case of the latter, the oldest extant source is the one written down by Muhammad ibn Ismail al-Bukhari, who is reported to have collected over 300,000 hadith told to him and wrote down the 2,602 stories that he personally felt to be authentic.  Al-Bukhari wrote down these tales in 846, 214 years after the death of Mohammed.  Furthermore, one of the two major branches of Islam, the Shia, reject the Sahih Bukhari, going so far as to state that “There is NO requirement in Islam to believe in Sahih Bukhari….”\nThe story of Jesus Christ’s resurrection, on the other hand, is reportedly told by several of his personal companions, who claim to have encountered him subsequent to his very public death.  The oldest manuscript to date is the Magdelen Papyrus, which contains Matthew 26 and has been dated as early as 66 AD, 33 years after the events it describes.  The Lukan Papyrus is dated between 67 and 77 years after Christ’s reported death, and there are another 230 extant manuscripts compiled within 500 years of the event.\nContrast with this the earliest copies of the works of historians such as Thucydides, Herodotus, Aristotle, Caesar, and Tacitus.  There are no more than 20 copies of any of these manuscripts and the earliest extant copy was made more than 1,000 years after the original.  If it were not for the seemingly absurd claims about a man doing miracles and rising from the dead, no one would even think to question the historical veracity of the Bible.  And there’s simply no comparison between the veracity of an account to which every Christian today subscribes and the Islamic hadith, in which many Muslims place no credence.\nNow, it would be one thing if the event described in Gospels was claimed to be a quotidian reality that, nevertheless, no one has witnessed since.  But that is not the case, as the accounts are very clear about the astonishing, even singular, nature of the event.  Common sense dictates that one ask oneself the question: if the resurrection of God’s Son was a one-time historical event as it purports to be, how else could eyewitness reports possibly have been recorded given the technology of the time, and what alternative explanation beyond the convincing nature of the reports will suffice to explain the enormous number of ancient manuscripts that were produced and circulated long before the Edict of Milan ended the Imperial persecution of Christianity and the Church achieved its position of intellectual domination that allowed it to put thousands of monks to work making manuscripts.\nThe truth is that modern doubts about the Gospel accounts have a basis that is no more objectively legitimate than that upon which al-Buhkari’s rejection of the vast majority of hadiths he was told rests.  They’re subjective, and they’re based on nothing more than personal feelings and the obvious difficulty in testing a historical event.  If the ancients are trusted to have reliably passed on the accounts of the Peloponnesian war for 1300 years, then they were quite obviously just as capable of faithfully passing on the eyewitness accounts of a strange event that took place in Jerusalem nearly two thousand years ago for a few decades.  Based on the available evidence, logic dictates that one either\ntentatively\naccept the essential reliability of the record testifying to Jesus Christ’s resurrection or reject the greater part of Mankind’s recorded history.\nThis may explain in part the peculiar nature of the New Atheism, given the obvious deficiencies of the New Atheists with regards to both logic and history.  Now, does this prove beyond any reasonable shadow of a doubt that Jesus Christ rose from the dead?  No, it does not.  But it should be more than enough to prove why that account is far more credible than the tale of a flying horse.\nNote – any discussion of evolution or Creationism is off-topic and will be promptly deleted.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-03T16:08:00+00:00"
}