{
  "url": "https://voxday.net/2009/01/13/pedophile-or-post-human/",
  "scraped_at": "2026-01-08T22:45:31.150458",
  "title": "Pedophile or Post-human?",
  "date_display": "January 13, 2009",
  "date_iso": "2009-01-13T18:49:00+00:00",
  "date_from_url": "2009-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If a fourteen year-old girl has sex, <a href=\"http://news.yahoo.com/s/livescience/20090112/sc_livescience/superpredatorshumansforcerapidevolutionofanimals\">is she still human</a>?</p><blockquote><p>Darimont told LiveScience that while he considers the changes to be evolutionary, some biologists consider them phenotypic and, without evidence of genetic shifts, would not call them evolution…  One specific example: the overfished Atlantic cod on the eastern coast of Canada. Less than two decades ago, they began mating at age 6. Now they start at age 5.</p></blockquote><p>In support of this impressive science, I note the following report <a href=\"http://observer.guardian.co.uk/sex/story/0,,818356,00.html\">from the Observer</a>: <i>Britons are losing their virginity younger than in the past: for over-55s the average age was 19; within the 25-34 group it was 16; and among 16-24s, 15.</i> That’s a difference of THREE years in two decades; <i>homo sapiens</i> is evolving even faster than the Atlantic cod!</p><p>Clearly adults who are attracted to children under 15 should not be labeled pedophiles when they can be <i>scientifically</i> shown to be nothing more than evolutionary change-agents bringing about post-humanity.  Based on the increasingly lunatic declarations of its advocates, I’m beginning to suspect we may see TENS collapse even sooner than I’d ever imagined.  I still don’t expect to see it happen in my lifetime, but I’m quite confident that it is probable, if not necessarily inevitable.  Yet.</p><p>Evolution’s defenders are in the position of a bridge builder watching his rickety old edifice sway and bend in the wind.  “It hasn’t fallen yet!” he shouts defiantly.  But any less self-interested observer will readily notice that it’s only a matter of time before the structure collapses completely.  The linked article is evidence of bad science journalism, not bad science, but then, there’s not much about evolution that can reasonably described as science by any non-tautological definition of the term.</p></div>",
  "content_text": "If a fourteen year-old girl has sex,\nis she still human\n?\nDarimont told LiveScience that while he considers the changes to be evolutionary, some biologists consider them phenotypic and, without evidence of genetic shifts, would not call them evolution…  One specific example: the overfished Atlantic cod on the eastern coast of Canada. Less than two decades ago, they began mating at age 6. Now they start at age 5.\nIn support of this impressive science, I note the following report\nfrom the Observer\n:\nBritons are losing their virginity younger than in the past: for over-55s the average age was 19; within the 25-34 group it was 16; and among 16-24s, 15.\nThat’s a difference of THREE years in two decades;\nhomo sapiens\nis evolving even faster than the Atlantic cod!\nClearly adults who are attracted to children under 15 should not be labeled pedophiles when they can be\nscientifically\nshown to be nothing more than evolutionary change-agents bringing about post-humanity.  Based on the increasingly lunatic declarations of its advocates, I’m beginning to suspect we may see TENS collapse even sooner than I’d ever imagined.  I still don’t expect to see it happen in my lifetime, but I’m quite confident that it is probable, if not necessarily inevitable.  Yet.\nEvolution’s defenders are in the position of a bridge builder watching his rickety old edifice sway and bend in the wind.  “It hasn’t fallen yet!” he shouts defiantly.  But any less self-interested observer will readily notice that it’s only a matter of time before the structure collapses completely.  The linked article is evidence of bad science journalism, not bad science, but then, there’s not much about evolution that can reasonably described as science by any non-tautological definition of the term.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-13T18:49:00+00:00"
}