{
  "url": "https://voxday.net/2009/01/01/rules-of-blog_01/",
  "scraped_at": "2026-01-08T22:44:23.159791",
  "title": "Rules and Facts of the blog",
  "date_display": "January 1, 2009",
  "date_iso": "2009-01-01T15:30:00+00:00",
  "date_from_url": "2009-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>1. You will be addressed in the style you choose. If you come in here slinging insults and acting disrespectfully, you will be treated with a contemptuous and derisive disdain that will, based on past experience, probably upset you.  This is particularly true for visitors who are under the impression, mistaken or not, that they are far more intelligent than the average individual here.  If instead, you elect to offer substantive and civil criticism, then you will meet with a similarly civil response.  Because we are equally capable of polite intellectual discourse and appallingly creative verbal cruelty, the form the interaction will take is up to you. Vox Popoli is not an echo chamber, but it is also not the typical Internet cesspool where you can expect to get away with spouting factual nonsense or blatant illogic with impunity.</p><p>2. You are expected to back up your assertions, so don’t be surprised if you happen to get called on them.  If you fail to back up an assertion when called on it, but refuse to retract the statement, understand that we reserve the right to delete the relevant comment and all subsequent comments you attempt to make. If you are asked a direct question relevant to the topic, then you will be expected to answer it in a straightforward and non-evasive manner; providing links in lieu of answers is not acceptable. (Links providing additional information in support of your answer are great, of course.) The dishonest and evasive tactics that are so common in Internet argumentation are not permitted here. If you refuse to either answer a question or admit that you cannot answer it, then you will not be permitted to comment here and all of your subsequent comments will be deleted.</p><p>3. Cross-comments and off-topic comments will usually be deleted. If your comment gets deleted, deal with it. Don’t try to argue with use about it. We don’t care. If you have a serious problem with the deletion of a comment, then email us.  More than one individual has managed to get himself banned by refusing to accept the reality that his precious comment was seen to be of no value here and deleted.</p><p>4. This is not a democracy. Commenting here is a privilege, not a right. If you are instructed not to comment here, for whatever reason, then please go share your unique gems of wisdom somewhere else. There are thousands of blogs out there and perhaps some will value them; we clearly don’t. So, just go away, this isn’t an appropriate venue for you to work out your personal issues for our entertainment. On a related note, please don’t respond to the trolls. There are at least fifteen people who have been banned that insist on trying to comment here from time to time under different names; just ignore them as someone will get around to deleting their comments as well as the comments of those who respond to them soon enough.</p><p>5. You are expected to be polite to your fellow commenters, especially if you don’t know them. The regulars, who have been commenting here for years and know each other reasonably well, often engage each other in a vicious and vituperative manner that you should not try to imitate because you are not an accepted part of the group yet. Take your best shot, by all means, but attack the idea, not the individual.</p><p>6. The long-time regulars will always be favored over drive-by commenters.</p><p>7.  Don’t make assumptions about the regulars here.  They’re not all Christians, much less Creationists.  Most are not libertarians.  A fair number are not Americans.  And some don’t even play computer games or read SF/F fiction.  They do, however, tend to skew much more intelligent and broadly educated than you’re probably accustomed to encountering.</p><p>8.  If you haven’t read <i>The Irrational Atheist</i>, don’t bother trying to critique it sight unseen.  You’re wrong.  Your arguments are not new and they have been brought up many times before, usually by atheists who are smarter than you are.  While you won’t be banned, you will be humiliated, and even your fellow atheists will point at you and laugh.</p><p>9.  Do not attempt to hijack posts and direct the discourse towards a subject of more interest to you; if you are interested in a discussion of a particular subject, email a request. Any insertion of evolution or Creationism into a post that is not<br> directly and specifically related to either subject will be deleted.<br> Repeated efforts to do so will result in banning. Monomanias of any kind are not permitted.</br></br></p><p>10.  If you have made several comments that lead a moderator to observe you have nothing interesting to contribute to an ongoing discussion, we reserve the right to tell you to stop commenting on that post.  A refusal to abide by that decision will lead to a bann.</p><p>11.  In general, you will be well-served if you stop to think for thirty seconds and read everything twice before responding to it. It’s also wise to ask if your assumptions are correct before launching critical attacks. This blog has been around for 12 years, so the chances are fairly good that your argument was presented and successfully dismissed long before you first formulated your thoughts on the subject. Remember, there are few original thoughts under the sun.</p><p>12.  If you have repeatedly shown yourself to be the sort of petty, ankle-biting critic who has no genuine interest in discussion or debate, but merely wishes to criticize by any means necessary, it is very unlikely that you will receive a response.  This failure to respond should not be interpreted as the difficulty of the former or the strength of the latter.  If you are not willing to argue in good faith, then there is absolutely no need to pay any attention to you.  Furthermore, if you are one of the small group of persistent anklebiters who insist on making the same tedious and incompetent attacks over and over again, your comments will be deleted.</p><p>13.  Attempts to claim that a refusal to further engage with a commenter whose arguments have repeatedly been demonstrated to be flawed are the result of cowardice or an inability to respond are false and will be deleted.</p><p>14. If you give a moderator reason to believe that you are not interested in honest, straightforward interaction, he will simply spam your comments. Continued attempts to post comments here will be considered harassment and dealt with accordingly. The police have already intervened twice to deal with cyberstalkers harassing this blog and it will not be a problem to identify you and contact your local authorities if necessary.</p><p>15. Vox Popoli is a participant in the Amazon Services LLC Associates Program, an affiliate<br> advertising program designed to provide a means for sites to earn advertising fees by advertising and<br> linking to Amazon.com.</br></br></p><p>16.  No data from visitors is collected, used, stored, or disclosed except for information provided via the Blogger comments and whatever data is collected by Google and used, stored, or disclosed by Google.</p><p>29.  These Rules may in no case be interpreted contrary to the purposes and principles of Vox Day, as solely determined by Vox Day.</p></div>",
  "content_text": "1. You will be addressed in the style you choose. If you come in here slinging insults and acting disrespectfully, you will be treated with a contemptuous and derisive disdain that will, based on past experience, probably upset you.  This is particularly true for visitors who are under the impression, mistaken or not, that they are far more intelligent than the average individual here.  If instead, you elect to offer substantive and civil criticism, then you will meet with a similarly civil response.  Because we are equally capable of polite intellectual discourse and appallingly creative verbal cruelty, the form the interaction will take is up to you. Vox Popoli is not an echo chamber, but it is also not the typical Internet cesspool where you can expect to get away with spouting factual nonsense or blatant illogic with impunity.\n2. You are expected to back up your assertions, so don’t be surprised if you happen to get called on them.  If you fail to back up an assertion when called on it, but refuse to retract the statement, understand that we reserve the right to delete the relevant comment and all subsequent comments you attempt to make. If you are asked a direct question relevant to the topic, then you will be expected to answer it in a straightforward and non-evasive manner; providing links in lieu of answers is not acceptable. (Links providing additional information in support of your answer are great, of course.) The dishonest and evasive tactics that are so common in Internet argumentation are not permitted here. If you refuse to either answer a question or admit that you cannot answer it, then you will not be permitted to comment here and all of your subsequent comments will be deleted.\n3. Cross-comments and off-topic comments will usually be deleted. If your comment gets deleted, deal with it. Don’t try to argue with use about it. We don’t care. If you have a serious problem with the deletion of a comment, then email us.  More than one individual has managed to get himself banned by refusing to accept the reality that his precious comment was seen to be of no value here and deleted.\n4. This is not a democracy. Commenting here is a privilege, not a right. If you are instructed not to comment here, for whatever reason, then please go share your unique gems of wisdom somewhere else. There are thousands of blogs out there and perhaps some will value them; we clearly don’t. So, just go away, this isn’t an appropriate venue for you to work out your personal issues for our entertainment. On a related note, please don’t respond to the trolls. There are at least fifteen people who have been banned that insist on trying to comment here from time to time under different names; just ignore them as someone will get around to deleting their comments as well as the comments of those who respond to them soon enough.\n5. You are expected to be polite to your fellow commenters, especially if you don’t know them. The regulars, who have been commenting here for years and know each other reasonably well, often engage each other in a vicious and vituperative manner that you should not try to imitate because you are not an accepted part of the group yet. Take your best shot, by all means, but attack the idea, not the individual.\n6. The long-time regulars will always be favored over drive-by commenters.\n7.  Don’t make assumptions about the regulars here.  They’re not all Christians, much less Creationists.  Most are not libertarians.  A fair number are not Americans.  And some don’t even play computer games or read SF/F fiction.  They do, however, tend to skew much more intelligent and broadly educated than you’re probably accustomed to encountering.\n8.  If you haven’t read\nThe Irrational Atheist\n, don’t bother trying to critique it sight unseen.  You’re wrong.  Your arguments are not new and they have been brought up many times before, usually by atheists who are smarter than you are.  While you won’t be banned, you will be humiliated, and even your fellow atheists will point at you and laugh.\n9.  Do not attempt to hijack posts and direct the discourse towards a subject of more interest to you; if you are interested in a discussion of a particular subject, email a request. Any insertion of evolution or Creationism into a post that is not\ndirectly and specifically related to either subject will be deleted.\nRepeated efforts to do so will result in banning. Monomanias of any kind are not permitted.\n10.  If you have made several comments that lead a moderator to observe you have nothing interesting to contribute to an ongoing discussion, we reserve the right to tell you to stop commenting on that post.  A refusal to abide by that decision will lead to a bann.\n11.  In general, you will be well-served if you stop to think for thirty seconds and read everything twice before responding to it. It’s also wise to ask if your assumptions are correct before launching critical attacks. This blog has been around for 12 years, so the chances are fairly good that your argument was presented and successfully dismissed long before you first formulated your thoughts on the subject. Remember, there are few original thoughts under the sun.\n12.  If you have repeatedly shown yourself to be the sort of petty, ankle-biting critic who has no genuine interest in discussion or debate, but merely wishes to criticize by any means necessary, it is very unlikely that you will receive a response.  This failure to respond should not be interpreted as the difficulty of the former or the strength of the latter.  If you are not willing to argue in good faith, then there is absolutely no need to pay any attention to you.  Furthermore, if you are one of the small group of persistent anklebiters who insist on making the same tedious and incompetent attacks over and over again, your comments will be deleted.\n13.  Attempts to claim that a refusal to further engage with a commenter whose arguments have repeatedly been demonstrated to be flawed are the result of cowardice or an inability to respond are false and will be deleted.\n14. If you give a moderator reason to believe that you are not interested in honest, straightforward interaction, he will simply spam your comments. Continued attempts to post comments here will be considered harassment and dealt with accordingly. The police have already intervened twice to deal with cyberstalkers harassing this blog and it will not be a problem to identify you and contact your local authorities if necessary.\n15. Vox Popoli is a participant in the Amazon Services LLC Associates Program, an affiliate\nadvertising program designed to provide a means for sites to earn advertising fees by advertising and\nlinking to Amazon.com.\n16.  No data from visitors is collected, used, stored, or disclosed except for information provided via the Blogger comments and whatever data is collected by Google and used, stored, or disclosed by Google.\n29.  These Rules may in no case be interpreted contrary to the purposes and principles of Vox Day, as solely determined by Vox Day.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-01-01T15:30:00+00:00"
}