{
  "url": "https://voxday.net/2009/01/27/why-fowl-atheist-ran-away/",
  "scraped_at": "2026-01-08T22:46:38.558944",
  "title": "Why the Fowl Atheist ran away",
  "date_display": "January 27, 2009",
  "date_iso": "2009-01-27T18:30:00+00:00",
  "date_from_url": "2009-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It was probably wise of PZ <a href=\"http://www.milobookclub.com/2008/06/09/challenge-to-pz-myers/\">to run away</a> from me, considering that he couldn’t even <a href=\"http://www.kennethhynek.net/2009/01/27/pz-myers-should-have-skipped-the-debate\">beat an incompetent Canadian</a>:</p><blockquote><p>I attended the debate tonight, and I have to honestly say that PZ lost… badly.</p><p>He basically decided to dismiss the agreed topic of debate and then proceeded to lecture on Hox genes. If the topic of debate was really evolution vs Intelligent Design he certainly would have won on the issue of genetics, but still would have lost on the issue of overall rationale.</p><p>In the end, his conclusion was that he couldn’t argue the agreed-upon question because it wasn’t his area of expertise and they should have gotten someone else.</p></blockquote><p>PZ is so incompetent and historically ignorant that I doubt he could win a debate that remained solidly within his area of expertise.  There’s a reason he’s still a community college professor, after all.  Have a look through the blog at every single exchange that’s ever taken place between us; you’ll see that painfully lame <i>ad hominem</i> is the very best that he can ever do.  It doesn’t sound like Durston was much of a debater himself, but that doesn’t prevent PZ <a href=\"http://scienceblogs.com/pharyngula/2009/01/an_ugly_debate_in_edmonton.php#comments\">from whining about him</a>.  That’s pathetic, since nothing is easier than slashing apart someone who is attempting to play fast and loose with the facts.  They do your job for you.</p><p>PZ was completely wrong when he attempted to claim that Hitler was a Christian.  (PZ’s opponent was also wrong, as Hitler was not an atheist although he was a science fetishist.)  The OSS reports released in 2001, with which PZ is obviously unfamiliar, make it clear that while the man was, like Dawkins and Hitchens, raised within a church tradition, he abandoned it and sought to destroy both the Protestant and Catholic churches as an adult.</p><p>As for those who completely dismiss the legitimacy of the Testimonium Flavianum, I would merely inquire by what evidence they do so.  I completely agree that the text doesn’t sound like Josephus, but then, that’s hardly conclusive proof of it being a post-facto addition.  Moreover, the Testimonium Flavianum is not the only reference to Jesus in the <i>Antiquities</i>, it’s merely the only one whose legitimacy is seriously questioned.</p></div>",
  "content_text": "It was probably wise of PZ\nto run away\nfrom me, considering that he couldn’t even\nbeat an incompetent Canadian\n:\nI attended the debate tonight, and I have to honestly say that PZ lost… badly.\nHe basically decided to dismiss the agreed topic of debate and then proceeded to lecture on Hox genes. If the topic of debate was really evolution vs Intelligent Design he certainly would have won on the issue of genetics, but still would have lost on the issue of overall rationale.\nIn the end, his conclusion was that he couldn’t argue the agreed-upon question because it wasn’t his area of expertise and they should have gotten someone else.\nPZ is so incompetent and historically ignorant that I doubt he could win a debate that remained solidly within his area of expertise.  There’s a reason he’s still a community college professor, after all.  Have a look through the blog at every single exchange that’s ever taken place between us; you’ll see that painfully lame\nad hominem\nis the very best that he can ever do.  It doesn’t sound like Durston was much of a debater himself, but that doesn’t prevent PZ\nfrom whining about him\n.  That’s pathetic, since nothing is easier than slashing apart someone who is attempting to play fast and loose with the facts.  They do your job for you.\nPZ was completely wrong when he attempted to claim that Hitler was a Christian.  (PZ’s opponent was also wrong, as Hitler was not an atheist although he was a science fetishist.)  The OSS reports released in 2001, with which PZ is obviously unfamiliar, make it clear that while the man was, like Dawkins and Hitchens, raised within a church tradition, he abandoned it and sought to destroy both the Protestant and Catholic churches as an adult.\nAs for those who completely dismiss the legitimacy of the Testimonium Flavianum, I would merely inquire by what evidence they do so.  I completely agree that the text doesn’t sound like Josephus, but then, that’s hardly conclusive proof of it being a post-facto addition.  Moreover, the Testimonium Flavianum is not the only reference to Jesus in the\nAntiquities\n, it’s merely the only one whose legitimacy is seriously questioned.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-27T18:30:00+00:00"
}