{
  "url": "https://voxday.net/2009/01/02/wracked-with-doub/",
  "scraped_at": "2026-01-08T22:44:32.339782",
  "title": "Wracked with doubt",
  "date_display": "January 2, 2009",
  "date_iso": "2009-01-02T20:04:00+00:00",
  "date_from_url": "2009-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Sports Guy <a href=\"http://sports.espn.go.com/espn/page2/story?page=simmons/090102\">sums it up nicely</a>:</p><blockquote><p>VIKINGS (+3) over Eagles<br>The scariest game on the board and, quite possibly, in the history of mankind. Remember when I picked Philly over Dallas last week because “I hated this pick both ways, changed it 35 times and settled on being more frightened having the Cowboys than the Eagles”? This is that game, squared. The Vikings violate four of my signature rules for a decent playoff team: They’re poorly coached, they have abominable special teams, their QB could self-destruct at any time, and their fans are so racked with doubt about this particular team that you can hear their sphincters collectively tightening during games.</br></p></blockquote><p>I have zero faith in this Vikings team.  Childress is the most frighteningly incompetent game coach since, well, Andy Reid, now that Art Shell is no longer coaching.  It’s like a Jedi showdown, only the exact opposite.  The Tarvaris Jackson Experiment is proceeding and at times appears to have succeeded in developing into a robotic emulation of real NFL quarterback that goes haywire when the defensive pressure heats up.  The Wall of Williams is damaged, the receivers are mediocre, the special teams are reliably horrible and our one superweapon, Adrian Peterson, is having more problems hanging on than a high school senior whose longtime girlfriend just moved to California to star in a major motion picture.</p><p>Fortunately, Vikings fans have no need of faith.  We have no expectations, we have no heart, we simply watch in numbed catalepsy and hope for the best.  An NFC North championship and a 10-6 record is more than we’d dreamed possible this year.  Sure, there are those poor souls who shriek “Super Bowl” every time we win two games in a row, but that’s just the Post-Traumatic Staubach Disorder talking.  Or, in the case of younger fans, 38 Wide Syndrome.  Just nod, speak softly to them, and leave them to their haunted dreams of victories that never were.</p><p>Can we beat the Eagles?  Absolutely.  Can we lose to them?  Definitely.  Either way, we porphyrogeniti will watch, all purple-clad, and hope Sons of Bud Grant will give us cause to sound the horn and wave the sword.</p></div>",
  "content_text": "The Sports Guy\nsums it up nicely\n:\nVIKINGS (+3) over Eagles\nThe scariest game on the board and, quite possibly, in the history of mankind. Remember when I picked Philly over Dallas last week because “I hated this pick both ways, changed it 35 times and settled on being more frightened having the Cowboys than the Eagles”? This is that game, squared. The Vikings violate four of my signature rules for a decent playoff team: They’re poorly coached, they have abominable special teams, their QB could self-destruct at any time, and their fans are so racked with doubt about this particular team that you can hear their sphincters collectively tightening during games.\nI have zero faith in this Vikings team.  Childress is the most frighteningly incompetent game coach since, well, Andy Reid, now that Art Shell is no longer coaching.  It’s like a Jedi showdown, only the exact opposite.  The Tarvaris Jackson Experiment is proceeding and at times appears to have succeeded in developing into a robotic emulation of real NFL quarterback that goes haywire when the defensive pressure heats up.  The Wall of Williams is damaged, the receivers are mediocre, the special teams are reliably horrible and our one superweapon, Adrian Peterson, is having more problems hanging on than a high school senior whose longtime girlfriend just moved to California to star in a major motion picture.\nFortunately, Vikings fans have no need of faith.  We have no expectations, we have no heart, we simply watch in numbed catalepsy and hope for the best.  An NFC North championship and a 10-6 record is more than we’d dreamed possible this year.  Sure, there are those poor souls who shriek “Super Bowl” every time we win two games in a row, but that’s just the Post-Traumatic Staubach Disorder talking.  Or, in the case of younger fans, 38 Wide Syndrome.  Just nod, speak softly to them, and leave them to their haunted dreams of victories that never were.\nCan we beat the Eagles?  Absolutely.  Can we lose to them?  Definitely.  Either way, we porphyrogeniti will watch, all purple-clad, and hope Sons of Bud Grant will give us cause to sound the horn and wave the sword.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-01-02T20:04:00+00:00"
}