{
  "url": "https://voxday.net/2006/12/12/boys-and-books/",
  "scraped_at": "2026-01-08T21:25:32.578281",
  "title": "Boys and books",
  "date_display": "December 12, 2006",
  "date_iso": "2006-12-12T11:52:00+00:00",
  "date_from_url": "2006-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dr. Helen <a href=\"http://drhelen.blogspot.com/2006/12/who-says-boys-dont-like-to-read-and.html\">has a reasonable thought</a> after perusing a certain children’s book:</p><blockquote><p>I think more boys would enjoy reading and writing if they were encouraged to read and write about things that held their interest, as opposed to what librarians and teachers give them on a reading list.</p></blockquote><p>I have to agree.  I began reading at an early age, was far more interested in books than in food, sport or pretty much anything else until Intellivision and the Apple II came along, and yet even I found many of the books we were required to read in high school to be utterly gruesome.  I still won’t read Saul Bellow or Graham Greene to this day, even though I suspect I might rather like the latter now based on what I remember of “The Power and the Glory”.</p><p>And “Giants in the Earth”, yikes, one should be able to find that in the thesaurus as an antonym for “engaging”.</p><p>On a related note, SF writer John Scalzi realizes to his regret that he’ll <a href=\"http://journals.aol.com/johnmscalzi/bytheway/entries/2006/12/11/and-now-i-feel-like-a-total-slacker/6857\">have to come up with a new concept</a> for his next series:</p><blockquote><p>Hey! That’s the plot of my next book! Nuts. Back to the drawing board for me….  Does the young author have his own Web site? Oh, my, yes. Personally, I eagerly await the movie deal, ancillary marketing and plush toys, all before the lad is eight. Man, I’ve been wasting my life.</p></blockquote><p>Hey, at least he has a publisher for his fiction….  Actually, I should mention that I’ve very much enjoyed this first experiment in self-publishing.  (And how many authors, even big name ones, can <a href=\"http://dell.skinit.com/skins//art/fantasy_art/RowenaMorrill&amp;resourceId=1773\">put their cover on their own computer</a>?)  Instant Publisher is very, very easy to use and it’s surprisingly entertaining to look up your order and see it go from “Preparing Cover” to “Ready to Print” and so forth.  I absolutely had the irrational urge to upload another book once I’d completed the order for the first run of “The Wrath of Angels”, so perhaps I’ll put out a short story collection next, if anyone happens to be interested.</p><p>We’ll have to see how the quality is, but otherwise, if it weren’t for the mass distribution angle – or lack thereof – I’d vastly prefer this process to the hand-it-over-and-wait-18-months that I went through four times with Pocket Books.</p></div>",
  "content_text": "Dr. Helen\nhas a reasonable thought\nafter perusing a certain children’s book:\nI think more boys would enjoy reading and writing if they were encouraged to read and write about things that held their interest, as opposed to what librarians and teachers give them on a reading list.\nI have to agree.  I began reading at an early age, was far more interested in books than in food, sport or pretty much anything else until Intellivision and the Apple II came along, and yet even I found many of the books we were required to read in high school to be utterly gruesome.  I still won’t read Saul Bellow or Graham Greene to this day, even though I suspect I might rather like the latter now based on what I remember of “The Power and the Glory”.\nAnd “Giants in the Earth”, yikes, one should be able to find that in the thesaurus as an antonym for “engaging”.\nOn a related note, SF writer John Scalzi realizes to his regret that he’ll\nhave to come up with a new concept\nfor his next series:\nHey! That’s the plot of my next book! Nuts. Back to the drawing board for me….  Does the young author have his own Web site? Oh, my, yes. Personally, I eagerly await the movie deal, ancillary marketing and plush toys, all before the lad is eight. Man, I’ve been wasting my life.\nHey, at least he has a publisher for his fiction….  Actually, I should mention that I’ve very much enjoyed this first experiment in self-publishing.  (And how many authors, even big name ones, can\nput their cover on their own computer\n?)  Instant Publisher is very, very easy to use and it’s surprisingly entertaining to look up your order and see it go from “Preparing Cover” to “Ready to Print” and so forth.  I absolutely had the irrational urge to upload another book once I’d completed the order for the first run of “The Wrath of Angels”, so perhaps I’ll put out a short story collection next, if anyone happens to be interested.\nWe’ll have to see how the quality is, but otherwise, if it weren’t for the mass distribution angle – or lack thereof – I’d vastly prefer this process to the hand-it-over-and-wait-18-months that I went through four times with Pocket Books.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-12-12T11:52:00+00:00"
}