{
  "url": "https://voxday.net/2006/12/11/brown-america-looks-pretty-good-after/",
  "scraped_at": "2026-01-08T21:25:27.101960",
  "title": "Brown America looks pretty good after all",
  "date_display": "December 11, 2006",
  "date_iso": "2006-12-11T13:55:00+00:00",
  "date_from_url": "2006-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know about you, but I’d certainly prefer the chaos of the half-civilized third-world society that appears to be in America’s future to the mad totalitarian hellhole that Cthulhu’s Coven are fantasizing about.  Someone needs to haul off these womyn and get them fitted for burqahs, stat!  Seriously, <a href=\"http://pandagon.net/2006/12/09/and-heres-the-answer-to-the-big-question/\">this uberwellian vision should give serious pause</a> to anyone who still believes that women’s suffrage was a fine idea.</p><p>In bringing this to our attention, RK writes:</p><blockquote><p>Amanda and her friends are discussing their utopia.  If you want to be both amused and depressed,  take a look.  No need to comment.  It speaks for itself.</p><p>Like a bunch of college freshman talking over a few too many beers.  They do have some odd ideas about economics.  One odd note, Amanda seems to agree with you on IP laws.</p></blockquote><p>Only because she doesn’t understand them, no doubt.</p></div>",
  "content_text": "I don’t know about you, but I’d certainly prefer the chaos of the half-civilized third-world society that appears to be in America’s future to the mad totalitarian hellhole that Cthulhu’s Coven are fantasizing about.  Someone needs to haul off these womyn and get them fitted for burqahs, stat!  Seriously,\nthis uberwellian vision should give serious pause\nto anyone who still believes that women’s suffrage was a fine idea.\nIn bringing this to our attention, RK writes:\nAmanda and her friends are discussing their utopia.  If you want to be both amused and depressed,  take a look.  No need to comment.  It speaks for itself.\nLike a bunch of college freshman talking over a few too many beers.  They do have some odd ideas about economics.  One odd note, Amanda seems to agree with you on IP laws.\nOnly because she doesn’t understand them, no doubt.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-12-11T13:55:00+00:00"
}