{
  "url": "https://voxday.net/2006/12/14/eo-multiphiles-and-multiphobes/",
  "scraped_at": "2026-01-08T21:25:47.334058",
  "title": "EO: multiphiles and multiphobes",
  "date_display": "December 14, 2006",
  "date_iso": "2006-12-14T12:45:00+00:00",
  "date_from_url": "2006-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joe Carter <a href=\"http://www.evangelicaloutpost.com/archives/003321.html#more\">considers the matter</a> and appears to accept its inevitable societal acceptance somewhat begrudgingly.  I agree with his thoughts on its inevitability, although I don’t see that there’s anything to fear from it.  It’s certainly a Biblical model far superior to the secular divorce culture we currently possess, and offers a familiar pro-child familial template that might allow the West to sustain itself without the need to import camel-sacrificing barbarians:</p><blockquote><p>All of the major world religions – Judaism, Islam, Hinduism, Buddhism, and Christianity – have condoned the practice of taking multiple spouses.</p><p>The same holds true for most every culture on earth. Out of 1170 societies recorded in Murdock’s Ethnographic Atlas, polygyny (the practice of men having more than one wife) is prevalent in 850. Even our own culture, which has an astoundingly high divorce and remarriage rate, practices a form of “serial polygamy.”</p></blockquote><p>The fact that a mere mention of the concept is enough to cause feminists to explode with rage should alone suffice to recommend the institution.  And while it’s not a vision that is very much in line with the modern woman’s Prince Charming / Pretty Woman fantasy, I don’t think destroying that pernicious fairy tale is necessarily such a bad thing.</p><p>(We’ll know it’s a done deal when the first Disney cartoon featuring Mickey and Minnie and Miranda Mouse appears.)</p><p>In any event, this is just one of the many signs indicating that the end of the Equalitarian Age is approaching.  And a good riddance too.  It will be interesting to see if the greater trend ends up being more in the direction of a traditional model like this one or a technological model complete with robot girls, smooth-talking vibrators and artificial wombs.</p><p>The answer is most likely some unforseeable combination of both, of course.</p></div>",
  "content_text": "Joe Carter\nconsiders the matter\nand appears to accept its inevitable societal acceptance somewhat begrudgingly.  I agree with his thoughts on its inevitability, although I don’t see that there’s anything to fear from it.  It’s certainly a Biblical model far superior to the secular divorce culture we currently possess, and offers a familiar pro-child familial template that might allow the West to sustain itself without the need to import camel-sacrificing barbarians:\nAll of the major world religions – Judaism, Islam, Hinduism, Buddhism, and Christianity – have condoned the practice of taking multiple spouses.\nThe same holds true for most every culture on earth. Out of 1170 societies recorded in Murdock’s Ethnographic Atlas, polygyny (the practice of men having more than one wife) is prevalent in 850. Even our own culture, which has an astoundingly high divorce and remarriage rate, practices a form of “serial polygamy.”\nThe fact that a mere mention of the concept is enough to cause feminists to explode with rage should alone suffice to recommend the institution.  And while it’s not a vision that is very much in line with the modern woman’s Prince Charming / Pretty Woman fantasy, I don’t think destroying that pernicious fairy tale is necessarily such a bad thing.\n(We’ll know it’s a done deal when the first Disney cartoon featuring Mickey and Minnie and Miranda Mouse appears.)\nIn any event, this is just one of the many signs indicating that the end of the Equalitarian Age is approaching.  And a good riddance too.  It will be interesting to see if the greater trend ends up being more in the direction of a traditional model like this one or a technological model complete with robot girls, smooth-talking vibrators and artificial wombs.\nThe answer is most likely some unforseeable combination of both, of course.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-12-14T12:45:00+00:00"
}