{
  "url": "https://voxday.net/2006/12/29/feminism-kills/",
  "scraped_at": "2026-01-08T21:26:53.051018",
  "title": "Feminism kills",
  "date_display": "December 29, 2006",
  "date_iso": "2006-12-29T19:21:00+00:00",
  "date_from_url": "2006-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Out of all of the activities, only housework significantly reduced the risk of both pre- and post-menopausal women getting the disease.</p><p>Housework cut breast cancer risk by 30% among the pre-menopausal women and 20% among the post-menopausal women.</p><p>The women were studied over an average of 6.4 years, during which time there were 3,423 cases of breast cancer.</p></blockquote><p>Perhaps it is the specific form of light exercise that housework offers.  More likely, women who live the sort of traditional lives that involve running a household and doing housework are less likely to do the sort of things that spark breast cancer, unlike your average post-feminist skank with a career and a gym membership.</p><p>Because dosing yourself with estrogen daily and having abortions can’t possibly be related to anything bad, like breast cancer, oh no. <a href=\"http://news.bbc.co.uk/1/hi/health/6214655.stm\">That’s just the Patriarchy’s mysogynistic scientists</a> trying to keep women oppressed, barefoot and doing the dishes, a proper feminist science wouldn’t be allowed to publish anything that a woman doesn’t want to hear.</p></div>",
  "content_text": "Out of all of the activities, only housework significantly reduced the risk of both pre- and post-menopausal women getting the disease.\nHousework cut breast cancer risk by 30% among the pre-menopausal women and 20% among the post-menopausal women.\nThe women were studied over an average of 6.4 years, during which time there were 3,423 cases of breast cancer.\nPerhaps it is the specific form of light exercise that housework offers.  More likely, women who live the sort of traditional lives that involve running a household and doing housework are less likely to do the sort of things that spark breast cancer, unlike your average post-feminist skank with a career and a gym membership.\nBecause dosing yourself with estrogen daily and having abortions can’t possibly be related to anything bad, like breast cancer, oh no.\nThat’s just the Patriarchy’s mysogynistic scientists\ntrying to keep women oppressed, barefoot and doing the dishes, a proper feminist science wouldn’t be allowed to publish anything that a woman doesn’t want to hear.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-12-29T19:21:00+00:00"
}