{
  "url": "https://voxday.net/2013/01/26/a-better-class-of-fake-review/",
  "scraped_at": "2025-12-14T22:18:43.712937",
  "title": "A better class of fake review",
  "date_display": "January 26, 2013",
  "date_iso": "2013-01-26T12:36:00+00:00",
  "date_from_url": "2013-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One has to respect that at least Zoidy went to the trouble of buying the Kindle version before writing <a href=\"http://www.amazon.com/review/RWPFCC3T4A3GO/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00AHK8LGI&amp;linkCode=&amp;nodeID=&amp;tag=\">his fake review</a>.</p><blockquote class=\"tr_bq\"><p> <b>Boring! Very much a Warhammer novel (with the license)</b>, January 25, 2013<br/></p><div style=\"margin-bottom: 0.5em;\"><div><div class=\"tiny\" style=\"margin-bottom: 0.5em;\"> By Zoidy, Amazon Verified Purchase</div></div></div><div class=\"tiny\" style=\"margin-bottom: 0.5em;\"> <b></b>This is a terrible book. Slow, tiresome, boring!</div><p>It’s pointlessly<br> wasteful with pages upon pages of characters writing letters that say<br> nothing! Of characters that spend ungodly amounts of time internalising<br> about simple issues like whether to put their cloak on to go outside!<br> What’s the weather like?! Who might see them outside?! Will they catch a<br> chill…and on and on! This is horrible writing.</br></br></br></br></br></p><p>Also, thanks to the Warhammer fantasy and Warhammer 40k worlds for providing pretty much most of what this author has written.</p></blockquote><p>Note to the next fake reviewer: it’s more convincing if you actually read the book.  And noticing the absence of any brand logos or laser guns would also help.  Of course, actually reading the book sort of defeats the purpose of the fake review, doesn’t it?  If Zoidy thinks A Throne of Bones has pages of pages of letters – about 12 out of 854 – I’d hate to imagine what he’d conclude of Pat Wrede’s <i>Sorcery and Cecilia</i>, which I am given to understand is a Vampire Diaries-licensed novel.</p><p>I should be absolutely fascinated to learn what elements of the Warhammer 40k universe are present in the novel.  I don’t know whether to be flattered or appalled that people are actually willing to pay money in order to publicly trash my work.  But it occurs to me that this may open up whole new horizons in the honorable profession of getting paid to not write….</p></div>",
  "content_text": "One has to respect that at least Zoidy went to the trouble of buying the Kindle version before writing\nhis fake review\n.\nBoring! Very much a Warhammer novel (with the license)\n, January 25, 2013\nBy Zoidy, Amazon Verified Purchase\nThis is a terrible book. Slow, tiresome, boring!\nIt’s pointlessly\nwasteful with pages upon pages of characters writing letters that say\nnothing! Of characters that spend ungodly amounts of time internalising\nabout simple issues like whether to put their cloak on to go outside!\nWhat’s the weather like?! Who might see them outside?! Will they catch a\nchill…and on and on! This is horrible writing.\nAlso, thanks to the Warhammer fantasy and Warhammer 40k worlds for providing pretty much most of what this author has written.\nNote to the next fake reviewer: it’s more convincing if you actually read the book.  And noticing the absence of any brand logos or laser guns would also help.  Of course, actually reading the book sort of defeats the purpose of the fake review, doesn’t it?  If Zoidy thinks A Throne of Bones has pages of pages of letters – about 12 out of 854 – I’d hate to imagine what he’d conclude of Pat Wrede’s\nSorcery and Cecilia\n, which I am given to understand is a Vampire Diaries-licensed novel.\nI should be absolutely fascinated to learn what elements of the Warhammer 40k universe are present in the novel.  I don’t know whether to be flattered or appalled that people are actually willing to pay money in order to publicly trash my work.  But it occurs to me that this may open up whole new horizons in the honorable profession of getting paid to not write….",
  "tags": [
    "books",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-26T12:36:00+00:00"
}