{
  "url": "https://voxday.net/2013/01/08/a-bestiary-of-hate/",
  "scraped_at": "2025-12-14T22:17:08.550910",
  "title": "A bestiary of hate",
  "date_display": "January 8, 2013",
  "date_iso": "2013-01-08T12:03:00+00:00",
  "date_from_url": "2013-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And why it is increasingly important to provide Amazon reviews for books you really like.</p><p>Now, some authors firmly believe you should never engage with a critic of your books.  They’ve got a sound basis for this belief, because most authors are sensitive little wallflowers who can’t bear criticism, so when they do respond to it, they tend to overdo it a little.  Or a lot.  The prime example, of course, being Laurell K. Hamilton, whose <a href=\"http://www.laurellkhamilton.org/2006/12/dear-negative-reader/\">epic hissy fit</a> was ironically more entertaining than any of the novels she inflicted upon the general public.  Her predecessor in the sexy corpse genre, Anne Rice, also provided <a href=\"http://www.journalfen.net/community/fandom_wank/515245.html?nc=911\">another well-regarded classic</a> in the annals of authorial peevishness, albeit one handicapped by the virtue of it showing at least some signs of the sanity entirely missing from Hamilton’s masterpiece.</p><p>Given that I have been the beneficiary of the constant attentions of various anklebiters and more substantive critics for some years now, I am considerably less upset than most writers when it comes to negative readers.  They’re bound to come, particularly when an author is as free with his own opinions as I am.  But that doesn’t mean that I am any less inclined to permit reader absurdities go unchallenged, particularly when they are putting them out there in public in an attempt to influence the decisions of potential readers to give my books a shot or not.  Also, given that I am a polemicist of some notoriety, I am more conscious than most of how some purported “reviews” are nothing more than polemics by other means.</p><p>Everyone has a right to their own opinion of every book.  Tastes and intellects differ considerably.  But no one has a right to not have their opinions mocked or criticized.  Now, most of those who have read and reviewed A THRONE OF BONES have expressed a generally favorable opinion of it; some have even written of it in a superlative manner.  Most consider it to have surpassed their expectations.  Not these three reviewers, however, who claim to have found literally nothing of merit in the novel:</p><p><a href=\"http://www.amazon.com/review/R1MY0ZGZWBURU0/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00AHK8LGI&amp;linkCode=&amp;nodeID=&amp;tag=\">THE DELICATE CHRISTIAN FLOWER</a></p><p><i>“I was looking forward to reading it.  I was sorely disappointed to find<br> profanity, and vulgarity and a few other things I found objectionable.<br> If you are into Christian fiction, this is not the book for you.”</br></br></i></p><p>Translation: “All books with bad words are bad.  Don’t read them.”</p><p>My response: hey, at least her opinion is based on fact and is reasonably consistent, given that she also gives a glowing five-star review to a children’s Bible that leaves out that unimportant bit about Jesus’s death.</p><p> <a href=\"http://www.amazon.com/review/R14BP6QDTSBFFW/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00AHK8LGI&amp;linkCode=&amp;nodeID=&amp;tag=\">THE EVERYDAY ANKLEBITER</a></p><p><i>“This book is bad.  So bad that I was moved to leave my first amazon<br> review and I couldn’t just put it down and move on to the next book in<br> my pile, I had to move on to something I already knew was exceptional,<br> like Tolkien.  Since zero stars is not an option, I can at least take<br> some comfort in the fact that I had to give “A Throne of Bones” one star<br> in that it pushed me into something more worthwhile.”</br></br></br></br></br></i></p><p>Translation: “I hate the author, so I’ll just fling some imaginary crap and hope it sticks.”</p><p>My response: Trolls are going to troll and anklebiters are going to snap at ankles wherever they can.  Keep in mind this first-time “reviewer” appears to be the same guy who was dumb enough to claim, on this blog, that the novel was a structural imitation of Gibbon – whose work covered the imperial Roman period some 200 years after the Republican era I utilized – and a literary imitation of R. Scott Bakker.  The fact that the “reviewer” is a fan of Bakker’s who is still bitter about my failure to genuflect before Bakker in the nihilism debate is, no doubt, entirely unrelated to his review….</p><p>The strange thing about The Everyday Anklebiter is that he apparently has never stopped to think that there are thousands of readers of this blog who are perfectly able to do what he has done in purposefully tanking the ratings of authors they don’t like.  This sort of negative review isn’t merely abusive, it is dangerous to the entire review system, given its potential to start a reviews war.</p><p>If you have an Amazon account, I would encourage you to <a href=\"http://www.amazon.com/gp/voting/cast/Reviews/2115/R14BP6QDTSBFFW/Inappropriate/1/ref=cm_cr_rdpvoteyn?ie=UTF8&amp;target=aHR0cDovL3d3dy5hbWF6b24uY29tL3Jldmlldy9SMTRCUDZRRFRTQkZGVy9yZWY9Y21fY3JfcmRwdm90ZXJkcj9fZW5jb2Rpbmc9VVRGOCZBU0lOPUIwMEFISzhMR0kmbGlua0NvZGU9Jm5vZGVJRD0mdGFnPQ&amp;token=1A0C9687A8812BFDAB258E984B16901053C7FA6F&amp;voteAnchorName=R14BP6QDTSBFFW.2115.Inappropriate.Reviews&amp;voteSessionID=178-4219463-9678919\">report this as abuse</a>. I have already done so.  Personal vendettas belong on the blogs, they have no place on public book review sites.</p><p> <a href=\"http://www.amazon.com/review/R389GL9C3AW0AI/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00AHK8LGI&amp;linkCode=&amp;nodeID=&amp;tag=\">THE OVER-HIS-HEAD GUY</a></p><p><i>“The author show no imagination. He basically  just copies imperial Rome<br> at the time of the Roman Catholic church. Neither one of which I find<br> entertaining in a fantasy setting. If I wanted to read about Roman<br> Legions and the Church I’d buy a history book.  I’ll get through it<br> eventually and maybe it will get better but if the first 20% is this bad<br> I can’t imagine how it’s going to redeem itself. Don’t waste your money<br> or your time. It’s the worst book I’ve ever read and I’ve read about<br> everything.”</br></br></br></br></br></br></br></i></p><p>Translation: tl;dr</p><p>My response: (laughs)  Imperial Rome copied at the time of the Roman Catholic Church… that pretty much says it all.  But it least it is an honest review, as clearly, if the idea of combining Rome and fantasy bores you, A THRONE OF BONES is almost surely the most boring book you could ever hope to read. </p><p>No book is for everyone because we all have different tastes.  Some read fiction, some don’t.  Some love history, some find it tedious in the extreme.  But these reviews should help underline the importance of reviewing the books you like, especially those books you love.  So, later today, I’ll be posting a review of a book I recently read that I really liked, and which I would recommend reading.</p></div>",
  "content_text": "And why it is increasingly important to provide Amazon reviews for books you really like.\nNow, some authors firmly believe you should never engage with a critic of your books.  They’ve got a sound basis for this belief, because most authors are sensitive little wallflowers who can’t bear criticism, so when they do respond to it, they tend to overdo it a little.  Or a lot.  The prime example, of course, being Laurell K. Hamilton, whose\nepic hissy fit\nwas ironically more entertaining than any of the novels she inflicted upon the general public.  Her predecessor in the sexy corpse genre, Anne Rice, also provided\nanother well-regarded classic\nin the annals of authorial peevishness, albeit one handicapped by the virtue of it showing at least some signs of the sanity entirely missing from Hamilton’s masterpiece.\nGiven that I have been the beneficiary of the constant attentions of various anklebiters and more substantive critics for some years now, I am considerably less upset than most writers when it comes to negative readers.  They’re bound to come, particularly when an author is as free with his own opinions as I am.  But that doesn’t mean that I am any less inclined to permit reader absurdities go unchallenged, particularly when they are putting them out there in public in an attempt to influence the decisions of potential readers to give my books a shot or not.  Also, given that I am a polemicist of some notoriety, I am more conscious than most of how some purported “reviews” are nothing more than polemics by other means.\nEveryone has a right to their own opinion of every book.  Tastes and intellects differ considerably.  But no one has a right to not have their opinions mocked or criticized.  Now, most of those who have read and reviewed A THRONE OF BONES have expressed a generally favorable opinion of it; some have even written of it in a superlative manner.  Most consider it to have surpassed their expectations.  Not these three reviewers, however, who claim to have found literally nothing of merit in the novel:\nTHE DELICATE CHRISTIAN FLOWER\n“I was looking forward to reading it.  I was sorely disappointed to find\nprofanity, and vulgarity and a few other things I found objectionable.\nIf you are into Christian fiction, this is not the book for you.”\nTranslation: “All books with bad words are bad.  Don’t read them.”\nMy response: hey, at least her opinion is based on fact and is reasonably consistent, given that she also gives a glowing five-star review to a children’s Bible that leaves out that unimportant bit about Jesus’s death.\nTHE EVERYDAY ANKLEBITER\n“This book is bad.  So bad that I was moved to leave my first amazon\nreview and I couldn’t just put it down and move on to the next book in\nmy pile, I had to move on to something I already knew was exceptional,\nlike Tolkien.  Since zero stars is not an option, I can at least take\nsome comfort in the fact that I had to give “A Throne of Bones” one star\nin that it pushed me into something more worthwhile.”\nTranslation: “I hate the author, so I’ll just fling some imaginary crap and hope it sticks.”\nMy response: Trolls are going to troll and anklebiters are going to snap at ankles wherever they can.  Keep in mind this first-time “reviewer” appears to be the same guy who was dumb enough to claim, on this blog, that the novel was a structural imitation of Gibbon – whose work covered the imperial Roman period some 200 years after the Republican era I utilized – and a literary imitation of R. Scott Bakker.  The fact that the “reviewer” is a fan of Bakker’s who is still bitter about my failure to genuflect before Bakker in the nihilism debate is, no doubt, entirely unrelated to his review….\nThe strange thing about The Everyday Anklebiter is that he apparently has never stopped to think that there are thousands of readers of this blog who are perfectly able to do what he has done in purposefully tanking the ratings of authors they don’t like.  This sort of negative review isn’t merely abusive, it is dangerous to the entire review system, given its potential to start a reviews war.\nIf you have an Amazon account, I would encourage you to\nreport this as abuse\n. I have already done so.  Personal vendettas belong on the blogs, they have no place on public book review sites.\nTHE OVER-HIS-HEAD GUY\n“The author show no imagination. He basically  just copies imperial Rome\nat the time of the Roman Catholic church. Neither one of which I find\nentertaining in a fantasy setting. If I wanted to read about Roman\nLegions and the Church I’d buy a history book.  I’ll get through it\neventually and maybe it will get better but if the first 20% is this bad\nI can’t imagine how it’s going to redeem itself. Don’t waste your money\nor your time. It’s the worst book I’ve ever read and I’ve read about\neverything.”\nTranslation: tl;dr\nMy response: (laughs)  Imperial Rome copied at the time of the Roman Catholic Church… that pretty much says it all.  But it least it is an honest review, as clearly, if the idea of combining Rome and fantasy bores you, A THRONE OF BONES is almost surely the most boring book you could ever hope to read.\nNo book is for everyone because we all have different tastes.  Some read fiction, some don’t.  Some love history, some find it tedious in the extreme.  But these reviews should help underline the importance of reviewing the books you like, especially those books you love.  So, later today, I’ll be posting a review of a book I recently read that I really liked, and which I would recommend reading.",
  "tags": [
    "books",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-08T12:03:00+00:00"
}