{
  "url": "https://voxday.net/2013/01/15/a-discourse-on-euthyphro/",
  "scraped_at": "2025-12-14T22:17:42.423518",
  "title": "A discourse on Euthyphro",
  "date_display": "January 15, 2013",
  "date_iso": "2013-01-15T11:27:00+00:00",
  "date_from_url": "2013-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since <a href=\"http://scienceblogs.com/principles/2008/04/10/john-scalzi-should-be-ashamed/\">this exchange concerning the classic dialogue</a> took place on Chad Orzel’s blog more than four years ago, a lot of you never had the chance to read it.  I think it’s worth posting here in its entirety because it is very nearly a textbook example of the way half-educated midwits who can’t believe they are not smarter than their intellectual superiors behave.  Notice how at every step along the way, there are repeated attempts to disengage, attempts to avoid having to support the naked assertions without recanting them, pointless passive-aggressive shots, and in general, a consistent effort avoid dealing with the actual subject at hand.  And, in the end, the hapless midwit simply runs away, still clinging to his now-exposed assertions, appealing to others in the hopes that they will pat him on the head and tell him that he is still a smart and good boy.</p><p>This behavior is quite typical when dealing with the moderately intelligent.  They are so accustomed to being superior that they literally cannot grasp the idea that the thinking of the highly intelligent is as far beyond them as they are beyond those they regard as ignorant mouth-breathers.  Anyone who disagrees with them must be stupid and a bad thinker; the possibility that they are in over their heads despite their ability to even follow, much less address, the salient points genuinely does not occur to them.  This particular discourse began with a throwaway comment by one Jasper in reference to <i>The Irrational Atheist<b>.</b></i></p><p></p><blockquote class=\"tr_bq\"><p> [T]here’s no reason not to allow him to continue to maintain those<br> particular beliefs – although not necessarily the beliefs in the book<br> itself, most of which are a little sad, insofar as he genuinely appears<br> to think that he’s resolved the Euthyphro dilemma. (A clue: he hasn’t.)</br></br></br></p></blockquote><p>As usual, nothing but safely general comments… because you can’t make<br> the specific case.  Regarding Euthyphro, you’re about the 20th atheist<br> to claim this.  And yet, every time I ask the person to explain<br> precisely how my resolution of the dilemma on either Christian or<br> Socrates’s own terms is mistaken, they fall silent.  Every single time.<br> So, by all means, Jasper, please show how my resolutions of it are<br> flawed, as I always like to improve my arguments.  Post your critique on<br> my blog or email it to me, I’ll post it in its entirety and we’ll see<br> how valid it is.</br></br></br></br></br></br></br></br></p><div class=\"content\"><blockquote class=\"tr_bq\"><p> In seeking to resolve the dilemma, you state that <b><i>At first<br> glance, this looks easy enough, as simply substituting “obedience” for<br> “the pious” will destroy the dilemma because it eliminates the tautology<br> posed. One can’t do this since it’s not right to simply substitute<br> whatever terms one likes and declare the problem solved.</br></br></br></br></i></b> Later in the argument, you then say: <b><i>At<br> this point we can reach three conclusions: 1. The Euthyphro “dilemma”<br> is defeated by shifting the focus from “the pious” to “obedience,”<br> therefore it is an inappropriate criticism of Christian morality that is<br> founded on obedience to God’s Will.</br></br></br></br></i></b> So this point is based on you doing something that you have previously declared is not allowed.</p><p>You also state that it <b><i>can only be considered a genuine problem<br> for those who insist that a fixed principle cannot be arbitrary. In<br> other words, for those paying absolutely no attention to reality. There<br> are a panoply of fixed variables which, if they were different than they<br> are, would radically alter the reality of our universe.</br></br></br></br></i></b> Here you<br> conflate moral principles with physical variables; but they are not the<br> same, and consequently this point is irrelevant.</br></br></p><p>You finally state that <b><i>The section about disagreement between gods<br> regarding the pious and impious does not apply to a monotheistic god or<br> a Supreme God who rules over other, lesser gods and deines their<br> morality for them.</br></br></br></i></b> Socrates and Euthyphro agree in the course of the dialogue to discuss that “what <b>all</b> the gods love is pious and holy, and the opposite which they <b>all</b> hate, impious” – in all respects, a situation identical to being under a monotheistic god. So this point is irrelevant.</p><p>The rest of your refutation rests on a misunderstanding of what<br> actually constitutes the Euthyphro dilemma. You focus obsessively on a<br> literal translation of the language, rather than attempting to<br> understand the underlying argument. In modern terms, this is phrased as:<br> Is something moral because god commands it, or does god command it<br> because it is moral? You simply don’t address this at all in your<br> supposed refutation, as far as I can see; I may be missing the point<br> entirely, but in that case you have not managed to convey your argument<br> well. You may then say that you are not prepared to compromise your<br> writing in order to make yourself understood; but then why did you<br> bother to write in the first place?</br></br></br></br></br></br></br></br></br></br></p></blockquote></div><p>Jasper, thank you very much for presenting your response to my critique<br> of the Euthyphro “Dilemma”.  In summary, yes, you did miss the point, in<br> fact, you managed to successfully miss the point on all four issues you<br> raised.  As promised, I will explain this in whatever detail is<br> necessary on the blog tomorrow, so please consider stopping by.</br></br></br></br></p><blockquote class=\"tr_bq\"><p> Vox: if that’s the case, I’ll withdraw my points, so there’s no need to<br> post them on your blog. Since you accuse nearly everybody that disagrees<br> with you of missing the point, your only problem is that you appear to<br> be unable to communicate fairly simple points, which I would have<br> thought was a pretty crippling problem for a writer.</br></br></br></br></p><p>Incidentally, why are you not prepared to address my response on this blog? It’s all very Sun Tzu, but a little bit childish.</p></blockquote><div class=\"content\"> <i>“Vox: if that’s the case, I’ll withdraw my points, so there’s no need to post them on your blog.”</i><p>Please tell me you’re kidding.  You don’t seriously expect me to<br> believe that you’re willing to just take my word that your critique is<br> flawed after you’ve informed us how my arguments are mostly sad and my<br> Euthyphro refutation is a failure?</br></br></br></p><p><i>“Since you accuse nearly everybody that disagrees with you of<br> missing the point, your only problem is that you appear to be unable to<br> communicate fairly simple points, which I would have thought was a<br> pretty crippling problem for a writer.”</br></br></br></i></p><p>I don’t accuse anyone of anything I can’t demonstrate.  I don’t<br> pretend to be a particularly good writer, so fortunately, it’s merely a<br> pasttime.  Perhaps if I really concentrate and write really well, I’ll<br> be able to demonstrate why the Euthyphro refutations are solid.</br></br></br></p><p><i>“Incidentally, why are you not prepared to address my response on this blog? It’s all very Sun Tzu, but a little bit childish.”</i></p><p>I’ll post it here too if you like.  I just assumed that no one would<br> see it if I post it here tomorrow.</br></p><blockquote class=\"tr_bq\"><p> You didn’t say that my critique was flawed, you said that I’d<br> completely missed the point of your argument. If I’ve missed the point<br> of your argument, that means that my critique is not of your argument.<br> Nobody knows your argument better than you, so why wouldn’t I take your<br> word on it?</br></br></br></br></p><p>Since we’ve already established that you can’t convey relatively<br> simple points, why on earth do you think you’re “demonstration” will be<br> any more comprehensible than your original text? There are two<br> possibilities here – either you’re a poor thinker or a poor writer –<br> but in either case, why would anybody read your work?</br></br></br></br></p></blockquote></div><div class=\"content\"><div class=\"content\"> <i>“In seeking to resolve the dilemma, you state that “At first<br> glance, this looks easy enough, as simply substituting “obedience” for<br/> “the pious” will destroy the dilemma because it eliminates the tautology<br/> posed. One can’t do this since it’s not right to simply substitute<br/> whatever terms one likes and declare the problem solved.” Later in the<br/> argument, you then say: “At this point we can reach three conclusions:<br/> 1. The Euthyphro “dilemma” is defeated by shifting the focus from “the<br/> pious” to “obedience,” therefore it is an inappropriate criticism of<br/> Christian morality that is founded on obedience to God’s Will.” So this<br/> point is based on you doing something that you have previously declared<br/> is not allowed.”</br></i><p>You’re skipping over the extremely relevant section wherein I<br/> distinguish between refuting the Euthyphro dilemma on its own terms and<br/> refuting its mistaken application to Christian morality because the<br/> definition of that morality precludes the second horn of the dilemma.<br/> Ergo, no tautology and no dilemma.  One cannot simply change Socrates’s<br/> definitions and claim to be attacking the dilemma on its own terms,<br/> while on the other hand, one cannot apply the dilemma to a specific morality such as the Christian moral standard without<br/> first changing those definitions.</p><p><i>“You also state that it can only be considered a genuine problem<br/> for those who insist that a fixed principle cannot be arbitrary. In<br/> other words, for those paying absolutely no attention to reality. There<br/> are a panoply of fixed variables which, if they were different than they<br/> are, would radically alter the reality of our universe. Here you<br/> conflate moral principles with physical variables; but they are not the<br/> same, and consequently this point is irrelevant.”</i></p><p>Conflate?  Combine into one?  Not at all.  You’re forgetting the<br/> rather obvious fact that whereas the necessary physical variables of<br/> this universe are fixed, moral principles vary even within it.<br/> Therefore, it is a massive logical error on multiple levels to assume<br/> that in the universe next door, moral principles must be the same as<br/> they are in this universe, while physical variables are assumed to be<br/> different.  In fact, given the competing moral principles currently on<br/> offer in this universe, one couldn’t possibly even say which of them<br/> must be the fixed ones next door.</p><p><i>“You finally state that The section about disagreement between gods<br/> regarding the pious and impious does not apply to a monotheistic god or<br/> a Supreme God who rules over other, lesser gods and deines their<br/> morality for them. Socrates and Euthyphro agree in the course of the<br/> dialogue to discuss that “what all the gods love is pious and holy, and<br/> the opposite which they all hate, impious” – in all respects, a<br/> situation identical to being under a monotheistic god. So this point is<br/> irrelevant.”</i></p><p>You’re incorrect.  If you read the dialogue more closely, you will<br/> see that the situations are not identical because in the one case, the<br/> net result of “what all the gods love” is a drastically restricted set of<br/> polytheistic divine preferences reduced to the lowest common denominator,<br/> whereas in the monotheistic case, the preferences are singular and exercised in full.<br/> For example, Athena’s love for Athens would have to be excised in the former<br/> case, but retained were she the sole god in the latter one.</p><p><i>“The rest of your refutation rests on a misunderstanding of what<br/> actually constitutes the Euthyphro dilemma. You focus obsessively on a<br/> literal translation of the language, rather than attempting to<br/> understand the underlying argument. In modern terms, this is phrased as:<br/> Is something moral because god commands it, or does god command it<br/> because it is moral? You simply don’t address this at all in your<br/> supposed refutation, as far as I can see; I may be missing the point<br/> entirely, but in that case you have not managed to convey your argument<br/> well.”</i></p><p>This is a false statement based on intellectual laziness.  There is<br/> no “underlying argument”, Socrates makes a specific and detailed<br/> argument which contains various assertions and assumptions along the way, and as I<br/> have shown, some of them are not logically justifiable. Now, if you want an<br/> answer to what you describe as the modern terms, it is that something<br/> is moral because god commands it.  God’s game, god’s rules.  Now, you<br/> can still argue that God doesn’t exist or that his rules are imperfectly<br/> understood by Man, but that’s a tangential subject that cannot be<br/> reasonably used to defend the dilemma.</p><blockquote class=\"tr_bq\"><p> I think we’ll have a problem with continuing the dialogue. It seems<br/> fairly clear that – whether I have missed your points or not – you<br/> genuinely don’t understand either my comments or – more worryingly – the<br/> Euthyphro dilemma itself.</p><p>For example, your response to my first point appears to be completely<br/> unrelated to the point that I’ve actually made – which was that you<br/> said “one could defeat it by doing X, but obviously one can’t do X” and<br/> then later said “by doing X, I’ve defeated the argument.” On the<br/> “drastically reduced” set of preferences – it’s irrelevant to the<br/> discussion. If there’s only one thing on the menu of divine command, it<br/> still poses exactly the same problem for theists. On the “variable<br/> morals”: well, you’re the one arguing that there is in fact only one set<br/> of fixed morals in this universe (your god’s) – and since some physical<br/> variables in this universe do vary depending on context, it seems that<br/> your point is defeated on both sides. To be brutally honest, though,<br/> your writing is poor enough that it’s possible that even you’re not sure<br/> what your argument is.</p><p>Euthyphro stands. If you honestly don’t see that, there isn’t really<br/> anywhere for the discussion to go – we can just leave it here and other<br/> readers can decide for themselves.<b><i> </i></b></p><p><b><i>If you want an answer to what you describe as the modern terms,<br/> it is that something is moral because god commands it. God’s game, god’s<br/> rules.</i></b></p><p>Quod Erat Demonstrandum! It would be funny if it wasn’t so sad.</p></blockquote></div><div class=\"content\">  <i>“I think we’ll have a problem with continuing the dialogue. It<br/> seems fairly clear that – whether I have missed your points or not – you<br/> genuinely don’t understand either my comments or – more worryingly –<br/> the Euthyphro dilemma itself.”</i><br/><div class=\"content\"> <br/> Actually, Jasper, you omitted what has become the most obvious<br/> conclusion, which is that you’re simply not very intelligent.  The fact<br/> that you are having trouble understanding this doesn’t mean everyone is.<br/> But do keep making those little passive-aggressive statements, I’m<br/> sure they’re very convincing.<p><i>“For example, your response to my first point appears to be<br/> completely unrelated to the point that I’ve actually made – which was<br/> that you said “one could defeat it by doing X, but obviously one can’t<br/> do X” and then later said “by doing X, I’ve defeated the argument.””</i></p><p>It’s not unrelated and I didn’t write “by doing X, I’ve defeated the<br/> argument”, I wrote “The Euthyphro “dilemma” is defeated by shifting the<br/> focus from “the pious” to “obedience,” therefore it is an inappropriate<br/> criticism of Christian morality that is founded on obedience to God’s<br/> Will”.  It is not only appropriate to amend the relevant terms in order<br/> to correspond with a religion that differs from the original, it is<br/> necessary.  You are clearly having problems understanding the<br/> distinction between refuting the dilemma on its own terms and explaining<br/> why the dilemma can’t successfully be applied to Christian morality.<br/> Christian morality != “the pious” or “what God loves”.</p><p><i>“On the “drastically reduced” set of preferences – it’s irrelevant<br/> to the discussion. If there’s only one thing on the menu of divine<br/> command, it still poses exactly the same problem for theists.”</i></p><p>No, it isn’t because the second horn of the dilemma  depends upon<br/> this “irrelevancy”.  You clearly haven’t read the dialogue closely<br/> enough.  Socrates even admits that he is amending his original<br/> definition because he has to narrow it so closely that all individual<br/> preferences are removed in order to maintain the viability of his<br/> argument.  This is why the second horn could be a problem for<br/> polytheists, (although it really shouldn’t, due to the bait-and-switch<br/> on Socrates’s part), but it is no problem for monotheists or those who<br/> worship one supreme God.</p><p><i>“On the “variable morals”: well, you’re the one arguing that there<br/> is in fact only one set of fixed morals in this universe (your god’s) –<br/> and since some physical variables in this universe do vary depending on<br/> context, it seems that your point is defeated on both sides. To be<br/> brutally honest, though, your writing is poor enough that it’s possible<br/> that even you’re not sure what your argument is.”</i></p><p>You’re dancing to avoid the obvious.  Physical constants are assumed<br/> to vary from universe to universe.  There is absolutely no logical<br/> reason to declare that moral principles could not vary as well, whether<br/> the Creator God is the same in both universes or not.</p><p><i>“Euthyphro stands….  Quod Erat Demonstrandum! It would be funny if it wasn’t so sad.”</i></p><p>It doesn’t stand in either modern or Greek terms.  Do you also find<br/> William of Ockham’s logic to be funny and sad, given that he reached<br/> precisely the same conclusion I did?</p><blockquote class=\"tr_bq\"><p> Where do you go with these kinds of discussions, when somebody misses<br/> the point of a basic philosophical argument so completely – and defends<br/> himself by accusing everybody who disagrees with him of missing the<br/> point? I begin to see what you were getting at in your original post…</p></blockquote></div></div></div><p>Perhaps, after reading this, one will better understand why I am so often forced to tell people that they are missing a relevant point.  Now, perhaps it is because I am a bad thinker, or because I am a bad writer and my points are so often insufficiently clear.  Or, alternatively, perhaps Most People Are Idiots.<br/> I leave it to you to decide which explanation is more strongly supported by the documentary and scientific evidence.</p></div>",
  "content_text": "Since\nthis exchange concerning the classic dialogue\ntook place on Chad Orzel’s blog more than four years ago, a lot of you never had the chance to read it.  I think it’s worth posting here in its entirety because it is very nearly a textbook example of the way half-educated midwits who can’t believe they are not smarter than their intellectual superiors behave.  Notice how at every step along the way, there are repeated attempts to disengage, attempts to avoid having to support the naked assertions without recanting them, pointless passive-aggressive shots, and in general, a consistent effort avoid dealing with the actual subject at hand.  And, in the end, the hapless midwit simply runs away, still clinging to his now-exposed assertions, appealing to others in the hopes that they will pat him on the head and tell him that he is still a smart and good boy.\nThis behavior is quite typical when dealing with the moderately intelligent.  They are so accustomed to being superior that they literally cannot grasp the idea that the thinking of the highly intelligent is as far beyond them as they are beyond those they regard as ignorant mouth-breathers.  Anyone who disagrees with them must be stupid and a bad thinker; the possibility that they are in over their heads despite their ability to even follow, much less address, the salient points genuinely does not occur to them.  This particular discourse began with a throwaway comment by one Jasper in reference to\nThe Irrational Atheist\n.\n[T]here’s no reason not to allow him to continue to maintain those\nparticular beliefs – although not necessarily the beliefs in the book\nitself, most of which are a little sad, insofar as he genuinely appears\nto think that he’s resolved the Euthyphro dilemma. (A clue: he hasn’t.)\nAs usual, nothing but safely general comments… because you can’t make\nthe specific case.  Regarding Euthyphro, you’re about the 20th atheist\nto claim this.  And yet, every time I ask the person to explain\nprecisely how my resolution of the dilemma on either Christian or\nSocrates’s own terms is mistaken, they fall silent.  Every single time.\nSo, by all means, Jasper, please show how my resolutions of it are\nflawed, as I always like to improve my arguments.  Post your critique on\nmy blog or email it to me, I’ll post it in its entirety and we’ll see\nhow valid it is.\nIn seeking to resolve the dilemma, you state that\nAt first\nglance, this looks easy enough, as simply substituting “obedience” for\n“the pious” will destroy the dilemma because it eliminates the tautology\nposed. One can’t do this since it’s not right to simply substitute\nwhatever terms one likes and declare the problem solved.\nLater in the argument, you then say:\nAt\nthis point we can reach three conclusions: 1. The Euthyphro “dilemma”\nis defeated by shifting the focus from “the pious” to “obedience,”\ntherefore it is an inappropriate criticism of Christian morality that is\nfounded on obedience to God’s Will.\nSo this point is based on you doing something that you have previously declared is not allowed.\nYou also state that it\ncan only be considered a genuine problem\nfor those who insist that a fixed principle cannot be arbitrary. In\nother words, for those paying absolutely no attention to reality. There\nare a panoply of fixed variables which, if they were different than they\nare, would radically alter the reality of our universe.\nHere you\nconflate moral principles with physical variables; but they are not the\nsame, and consequently this point is irrelevant.\nYou finally state that\nThe section about disagreement between gods\nregarding the pious and impious does not apply to a monotheistic god or\na Supreme God who rules over other, lesser gods and deines their\nmorality for them.\nSocrates and Euthyphro agree in the course of the dialogue to discuss that “what\nall\nthe gods love is pious and holy, and the opposite which they\nall\nhate, impious” – in all respects, a situation identical to being under a monotheistic god. So this point is irrelevant.\nThe rest of your refutation rests on a misunderstanding of what\nactually constitutes the Euthyphro dilemma. You focus obsessively on a\nliteral translation of the language, rather than attempting to\nunderstand the underlying argument. In modern terms, this is phrased as:\nIs something moral because god commands it, or does god command it\nbecause it is moral? You simply don’t address this at all in your\nsupposed refutation, as far as I can see; I may be missing the point\nentirely, but in that case you have not managed to convey your argument\nwell. You may then say that you are not prepared to compromise your\nwriting in order to make yourself understood; but then why did you\nbother to write in the first place?\nJasper, thank you very much for presenting your response to my critique\nof the Euthyphro “Dilemma”.  In summary, yes, you did miss the point, in\nfact, you managed to successfully miss the point on all four issues you\nraised.  As promised, I will explain this in whatever detail is\nnecessary on the blog tomorrow, so please consider stopping by.\nVox: if that’s the case, I’ll withdraw my points, so there’s no need to\npost them on your blog. Since you accuse nearly everybody that disagrees\nwith you of missing the point, your only problem is that you appear to\nbe unable to communicate fairly simple points, which I would have\nthought was a pretty crippling problem for a writer.\nIncidentally, why are you not prepared to address my response on this blog? It’s all very Sun Tzu, but a little bit childish.\n“Vox: if that’s the case, I’ll withdraw my points, so there’s no need to post them on your blog.”\nPlease tell me you’re kidding.  You don’t seriously expect me to\nbelieve that you’re willing to just take my word that your critique is\nflawed after you’ve informed us how my arguments are mostly sad and my\nEuthyphro refutation is a failure?\n“Since you accuse nearly everybody that disagrees with you of\nmissing the point, your only problem is that you appear to be unable to\ncommunicate fairly simple points, which I would have thought was a\npretty crippling problem for a writer.”\nI don’t accuse anyone of anything I can’t demonstrate.  I don’t\npretend to be a particularly good writer, so fortunately, it’s merely a\npasttime.  Perhaps if I really concentrate and write really well, I’ll\nbe able to demonstrate why the Euthyphro refutations are solid.\n“Incidentally, why are you not prepared to address my response on this blog? It’s all very Sun Tzu, but a little bit childish.”\nI’ll post it here too if you like.  I just assumed that no one would\nsee it if I post it here tomorrow.\nYou didn’t say that my critique was flawed, you said that I’d\ncompletely missed the point of your argument. If I’ve missed the point\nof your argument, that means that my critique is not of your argument.\nNobody knows your argument better than you, so why wouldn’t I take your\nword on it?\nSince we’ve already established that you can’t convey relatively\nsimple points, why on earth do you think you’re “demonstration” will be\nany more comprehensible than your original text? There are two\npossibilities here – either you’re a poor thinker or a poor writer –\nbut in either case, why would anybody read your work?\n“In seeking to resolve the dilemma, you state that “At first\nglance, this looks easy enough, as simply substituting “obedience” for\n“the pious” will destroy the dilemma because it eliminates the tautology\nposed. One can’t do this since it’s not right to simply substitute\nwhatever terms one likes and declare the problem solved.” Later in the\nargument, you then say: “At this point we can reach three conclusions:\n1. The Euthyphro “dilemma” is defeated by shifting the focus from “the\npious” to “obedience,” therefore it is an inappropriate criticism of\nChristian morality that is founded on obedience to God’s Will.” So this\npoint is based on you doing something that you have previously declared\nis not allowed.”\nYou’re skipping over the extremely relevant section wherein I\ndistinguish between refuting the Euthyphro dilemma on its own terms and\nrefuting its mistaken application to Christian morality because the\ndefinition of that morality precludes the second horn of the dilemma.\nErgo, no tautology and no dilemma.  One cannot simply change Socrates’s\ndefinitions and claim to be attacking the dilemma on its own terms,\nwhile on the other hand, one cannot apply the dilemma to a specific morality such as the Christian moral standard without\nfirst changing those definitions.\n“You also state that it can only be considered a genuine problem\nfor those who insist that a fixed principle cannot be arbitrary. In\nother words, for those paying absolutely no attention to reality. There\nare a panoply of fixed variables which, if they were different than they\nare, would radically alter the reality of our universe. Here you\nconflate moral principles with physical variables; but they are not the\nsame, and consequently this point is irrelevant.”\nConflate?  Combine into one?  Not at all.  You’re forgetting the\nrather obvious fact that whereas the necessary physical variables of\nthis universe are fixed, moral principles vary even within it.\nTherefore, it is a massive logical error on multiple levels to assume\nthat in the universe next door, moral principles must be the same as\nthey are in this universe, while physical variables are assumed to be\ndifferent.  In fact, given the competing moral principles currently on\noffer in this universe, one couldn’t possibly even say which of them\nmust be the fixed ones next door.\n“You finally state that The section about disagreement between gods\nregarding the pious and impious does not apply to a monotheistic god or\na Supreme God who rules over other, lesser gods and deines their\nmorality for them. Socrates and Euthyphro agree in the course of the\ndialogue to discuss that “what all the gods love is pious and holy, and\nthe opposite which they all hate, impious” – in all respects, a\nsituation identical to being under a monotheistic god. So this point is\nirrelevant.”\nYou’re incorrect.  If you read the dialogue more closely, you will\nsee that the situations are not identical because in the one case, the\nnet result of “what all the gods love” is a drastically restricted set of\npolytheistic divine preferences reduced to the lowest common denominator,\nwhereas in the monotheistic case, the preferences are singular and exercised in full.\nFor example, Athena’s love for Athens would have to be excised in the former\ncase, but retained were she the sole god in the latter one.\n“The rest of your refutation rests on a misunderstanding of what\nactually constitutes the Euthyphro dilemma. You focus obsessively on a\nliteral translation of the language, rather than attempting to\nunderstand the underlying argument. In modern terms, this is phrased as:\nIs something moral because god commands it, or does god command it\nbecause it is moral? You simply don’t address this at all in your\nsupposed refutation, as far as I can see; I may be missing the point\nentirely, but in that case you have not managed to convey your argument\nwell.”\nThis is a false statement based on intellectual laziness.  There is\nno “underlying argument”, Socrates makes a specific and detailed\nargument which contains various assertions and assumptions along the way, and as I\nhave shown, some of them are not logically justifiable. Now, if you want an\nanswer to what you describe as the modern terms, it is that something\nis moral because god commands it.  God’s game, god’s rules.  Now, you\ncan still argue that God doesn’t exist or that his rules are imperfectly\nunderstood by Man, but that’s a tangential subject that cannot be\nreasonably used to defend the dilemma.\nI think we’ll have a problem with continuing the dialogue. It seems\nfairly clear that – whether I have missed your points or not – you\ngenuinely don’t understand either my comments or – more worryingly – the\nEuthyphro dilemma itself.\nFor example, your response to my first point appears to be completely\nunrelated to the point that I’ve actually made – which was that you\nsaid “one could defeat it by doing X, but obviously one can’t do X” and\nthen later said “by doing X, I’ve defeated the argument.” On the\n“drastically reduced” set of preferences – it’s irrelevant to the\ndiscussion. If there’s only one thing on the menu of divine command, it\nstill poses exactly the same problem for theists. On the “variable\nmorals”: well, you’re the one arguing that there is in fact only one set\nof fixed morals in this universe (your god’s) – and since some physical\nvariables in this universe do vary depending on context, it seems that\nyour point is defeated on both sides. To be brutally honest, though,\nyour writing is poor enough that it’s possible that even you’re not sure\nwhat your argument is.\nEuthyphro stands. If you honestly don’t see that, there isn’t really\nanywhere for the discussion to go – we can just leave it here and other\nreaders can decide for themselves.\nIf you want an answer to what you describe as the modern terms,\nit is that something is moral because god commands it. God’s game, god’s\nrules.\nQuod Erat Demonstrandum! It would be funny if it wasn’t so sad.\n“I think we’ll have a problem with continuing the dialogue. It\nseems fairly clear that – whether I have missed your points or not – you\ngenuinely don’t understand either my comments or – more worryingly –\nthe Euthyphro dilemma itself.”\nActually, Jasper, you omitted what has become the most obvious\nconclusion, which is that you’re simply not very intelligent.  The fact\nthat you are having trouble understanding this doesn’t mean everyone is.\nBut do keep making those little passive-aggressive statements, I’m\nsure they’re very convincing.\n“For example, your response to my first point appears to be\ncompletely unrelated to the point that I’ve actually made – which was\nthat you said “one could defeat it by doing X, but obviously one can’t\ndo X” and then later said “by doing X, I’ve defeated the argument.””\nIt’s not unrelated and I didn’t write “by doing X, I’ve defeated the\nargument”, I wrote “The Euthyphro “dilemma” is defeated by shifting the\nfocus from “the pious” to “obedience,” therefore it is an inappropriate\ncriticism of Christian morality that is founded on obedience to God’s\nWill”.  It is not only appropriate to amend the relevant terms in order\nto correspond with a religion that differs from the original, it is\nnecessary.  You are clearly having problems understanding the\ndistinction between refuting the dilemma on its own terms and explaining\nwhy the dilemma can’t successfully be applied to Christian morality.\nChristian morality != “the pious” or “what God loves”.\n“On the “drastically reduced” set of preferences – it’s irrelevant\nto the discussion. If there’s only one thing on the menu of divine\ncommand, it still poses exactly the same problem for theists.”\nNo, it isn’t because the second horn of the dilemma  depends upon\nthis “irrelevancy”.  You clearly haven’t read the dialogue closely\nenough.  Socrates even admits that he is amending his original\ndefinition because he has to narrow it so closely that all individual\npreferences are removed in order to maintain the viability of his\nargument.  This is why the second horn could be a problem for\npolytheists, (although it really shouldn’t, due to the bait-and-switch\non Socrates’s part), but it is no problem for monotheists or those who\nworship one supreme God.\n“On the “variable morals”: well, you’re the one arguing that there\nis in fact only one set of fixed morals in this universe (your god’s) –\nand since some physical variables in this universe do vary depending on\ncontext, it seems that your point is defeated on both sides. To be\nbrutally honest, though, your writing is poor enough that it’s possible\nthat even you’re not sure what your argument is.”\nYou’re dancing to avoid the obvious.  Physical constants are assumed\nto vary from universe to universe.  There is absolutely no logical\nreason to declare that moral principles could not vary as well, whether\nthe Creator God is the same in both universes or not.\n“Euthyphro stands….  Quod Erat Demonstrandum! It would be funny if it wasn’t so sad.”\nIt doesn’t stand in either modern or Greek terms.  Do you also find\nWilliam of Ockham’s logic to be funny and sad, given that he reached\nprecisely the same conclusion I did?\nWhere do you go with these kinds of discussions, when somebody misses\nthe point of a basic philosophical argument so completely – and defends\nhimself by accusing everybody who disagrees with him of missing the\npoint? I begin to see what you were getting at in your original post…\nPerhaps, after reading this, one will better understand why I am so often forced to tell people that they are missing a relevant point.  Now, perhaps it is because I am a bad thinker, or because I am a bad writer and my points are so often insufficiently clear.  Or, alternatively, perhaps Most People Are Idiots.\nI leave it to you to decide which explanation is more strongly supported by the documentary and scientific evidence.",
  "tags": [
    "debate",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-15T11:27:00+00:00"
}