{
  "url": "https://voxday.net/2013/01/28/a-magic-broken-free-on-amazon/",
  "scraped_at": "2025-12-14T22:18:54.313392",
  "title": "A MAGIC BROKEN free on Amazon",
  "date_display": "January 28, 2013",
  "date_iso": "2013-01-28T10:39:00+00:00",
  "date_from_url": "2013-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I also posted this notice <a href=\"http://www.helenspage.com/p/a-magic-broken-free-on-amazon/388\">on Helen’s Page</a>, which is rapidly turning out to be a rather useful online bulletin board for the liberty-minded.</p><p> The novella <a href=\"http://www.amazon.com/dp/B009OP9G0C\"><i><b>A MAGIC BROKEN</b></i></a> is free for Amazon Kindle users today and tomorrow.</p><p>It has 78 reviews, including this 5-star one:<br> <i><br> “This is a short book, and I understand it is intended to introduce<br> some characters and setting for Vox Day’s upcoming book “A Throne of<br> Bones.” I thoroughly enjoyed it. Once it gets going, it is hard to put<br> down. I highly recommend it, especially if you are weary of the typical<br> book in the fantasy genre that goes on and on and on and never comes to a<br> conclusion. You won’t be disappointed in your purchase, and you will be<br> excited to read the next book.”</br></br></br></br></br></br></br></i></br></p></div>",
  "content_text": "I also posted this notice\non Helen’s Page\n, which is rapidly turning out to be a rather useful online bulletin board for the liberty-minded.\nThe novella\nA MAGIC BROKEN\nis free for Amazon Kindle users today and tomorrow.\nIt has 78 reviews, including this 5-star one:\n“This is a short book, and I understand it is intended to introduce\nsome characters and setting for Vox Day’s upcoming book “A Throne of\nBones.” I thoroughly enjoyed it. Once it gets going, it is hard to put\ndown. I highly recommend it, especially if you are weary of the typical\nbook in the fantasy genre that goes on and on and on and never comes to a\nconclusion. You won’t be disappointed in your purchase, and you will be\nexcited to read the next book.”",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-28T10:39:00+00:00"
}