{
  "url": "https://voxday.net/2013/01/23/a-rabbit-bites-back/",
  "scraped_at": "2025-12-14T22:18:21.795800",
  "title": "The bright lights of the hrududu",
  "date_display": "January 23, 2013",
  "date_iso": "2013-01-23T09:12:00+00:00",
  "date_from_url": "2013-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall that I’ve mentioned how the Rabbit People have three basic weapons to which they resort.  One of their most important ones is exclusion; to a herd animal exclusion is the worst of all possible fates because they are incapable of even imagining survival on their own.</p><p>Now consider in this light <a href=\"http://www.amazon.com/review/R2A2JIGO51CG0E/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=1935929828&amp;linkCode=&amp;nodeID=&amp;tag=\">an intriguing one-star review of A THRONE OF BONES</a> that appeared yesterday courtesy of one Virginia Conterato of <strike>Edina</strike>Minneapolis.</p><blockquote class=\"tr_bq\"><p> It’s very difficult to review a book so badly written.  The wordiness<br> attempts to disguise the utter lack of decent storytelling and world<br> building.  There is a whole lot of NOTHING happening along with badly<br> written dialogue and poorly developed characters.  It is not often that I<br> write negative reviews, but I felt I needed to warn others away from<br> this terrible book. THis book is truly terrible.  Don’t waste your time,<br> much less your money. </br></br></br></br></br></br></p></blockquote><p>It’s even harder to convincingly review a book one hasn’t read.  Or, as appears to be the case, even bought.  Isn’t it amazing how strongly some of these one-star reviewers feel they need to “warn others” and save them from exposure to the terrible, horrible, doubleplusungood novel?  As if otherwise, they might inadvertently read such a miniscule tome?  It tends to remind one of McRapey warning his readers not to read this blog or even mention <strike>Lord Voldemort</strike>RSHD.  This is classic Rabbit People behavior, especially in light of how Mrs. Conterato clearly hasn’t read the book.  You’ll note that attack reviews are usually phrased in the most general of terms; if they do provide details, they usually just happen to come from things that take place in the text selection available on Amazon.  Seriously, is there anyone who genuinely believes that Kay is one of the very few people who bought the hardcover?</p><p>Although I have to admit, the idea of an angry little rabbit flipping furiously through all 854 pages just to write a credible-sounding fake review does amuse me.  It’s worse than TIA’s unclimbable Mount Chapter Four.</p><p>Now, why would a married woman in her late forties be so upset that she would go to the trouble of posting a fake review at this particular time?  The answer, I suspect, is to be found at Change.org, where last year Kay signed the petition “Senator Amy Klobuchar: Publicly Come Out in Support of Same-Sex Marriage”.  Logic suggests the following scenario: McRapey repeatedly pounds the homophobic drum, Kay’s little rabbit ears perk up, and she bravely hops forth to do battle on behalf of the Whatever warren and her lesbian writer friends at The Loft.</p><p>And then the bright lights appeared….</p><p>Now, you’d have to have lived in the Twin Cities to fully appreciate what I find funniest about the good doctor’s wife.  You see, when Kay signed the petition, she claimed to live in Edina.  But she doesn’t.  As it happens, in high school I dated a few girls from Edina, including one who lived just down the road from Southdale. Which, you see, is why I happen to know that Kay, like many others in certain parts of Richfield and southwest Minneapolis, only affects to live in the more prestigious city….</p><p>I now await, with no little amusement, the declarations of how scary the Rabbit People find it to discover that Lord Voldemort now has the dark and dangerous powers of <i>Google-fu</i> at his disposal.  I have to confess, I’m more than a little tempted to knock on her door and offer to sign her nonexistent hardcover the next time I’m in <strike>Edina</strike>Minneapolis.</p><p>The other interesting thing, in addition to the fake reviews, is that there are at least two rabbits who are giving helpful ratings to all the negative reviews and rating all of the positive reviews unhelpful.  Given the timing, one of them is likely our little friend Kay.  It’s not so much the review as <a href=\"http://www.amazon.com/review/R2ILRP5F68HA4L/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00AHK8LGI&amp;linkCode=&amp;nodeID=&amp;tag=\">the rating of the review</a> that is of interest here:</p><blockquote class=\"tr_bq\"><p> 2 of 3 people found the following review helpful</p><p>1 out of 5 stars: hard to follow yet very predictable January 21, 2013<br> By  Tracy</br></p><p>This a long book, very slow read. Not a lot of action or suspense. You can tell whats going to happen almost every step of the way. It is layed out like it is 7 or 8 books stuck together. The chapter titles are just the name of the character that will be prominent for that chapter. Then the next chapter is for the storyline of the next character and so on. After forcing myself to finish the book, it is only a lead up to a second book! It does’t even stand on it’s own! Horrible!  </p></blockquote><p>Helpful indeed.  This is how the Rabbit People fight; it’s all nonsensical, passive-aggressive attacks intended to be plausibly deniable, sniping from behind corners, and appealing to the herd; the correct way to respond is not through reactive passive-aggression, but rather to shine a light on the little critters’s activities.</p><p>We are not like them, we are better than them.  They know it.  And they know we know it.  That is why they hate us.</p><p> UPDATE: Some are incredulous that I would post information that is freely available to the public about a suspected fraud here on this blog.  Very well, let me be clear.  I am demanding an admission from Mrs. Conterato that she neither purchased the hardcover nor the Kindle version, nor did she read the book in its entirety prior to posting her review.  On a related note, I am requesting the order records from my publisher today; since the book is not available in retail bookstores, I should be able to confirm within days that she did not, in fact, ever purchase the hardcover that she claimed to have reviewed.  I will remove the public information from this post if a) Mrs. Conterato admits she did not buy the book and her review is a fake one, or b) if she proves that she did purchase the book and read it in its entirety.</p><p>UPDATE II: I just got an email from the publisher containing a list of the books sent to Minnesota.  None was sent to anyone named Conterato or to the address shown above.  Or to Edina…. This is not yet conclusive proof as one more possibility exists that I am presently having tracked down, but it is a significant step in that direction.</p></div>",
  "content_text": "You may recall that I’ve mentioned how the Rabbit People have three basic weapons to which they resort.  One of their most important ones is exclusion; to a herd animal exclusion is the worst of all possible fates because they are incapable of even imagining survival on their own.\nNow consider in this light\nan intriguing one-star review of A THRONE OF BONES\nthat appeared yesterday courtesy of one Virginia Conterato of\nEdina\nMinneapolis.\nIt’s very difficult to review a book so badly written.  The wordiness\nattempts to disguise the utter lack of decent storytelling and world\nbuilding.  There is a whole lot of NOTHING happening along with badly\nwritten dialogue and poorly developed characters.  It is not often that I\nwrite negative reviews, but I felt I needed to warn others away from\nthis terrible book. THis book is truly terrible.  Don’t waste your time,\nmuch less your money.\nIt’s even harder to convincingly review a book one hasn’t read.  Or, as appears to be the case, even bought.  Isn’t it amazing how strongly some of these one-star reviewers feel they need to “warn others” and save them from exposure to the terrible, horrible, doubleplusungood novel?  As if otherwise, they might inadvertently read such a miniscule tome?  It tends to remind one of McRapey warning his readers not to read this blog or even mention\nLord Voldemort\nRSHD.  This is classic Rabbit People behavior, especially in light of how Mrs. Conterato clearly hasn’t read the book.  You’ll note that attack reviews are usually phrased in the most general of terms; if they do provide details, they usually just happen to come from things that take place in the text selection available on Amazon.  Seriously, is there anyone who genuinely believes that Kay is one of the very few people who bought the hardcover?\nAlthough I have to admit, the idea of an angry little rabbit flipping furiously through all 854 pages just to write a credible-sounding fake review does amuse me.  It’s worse than TIA’s unclimbable Mount Chapter Four.\nNow, why would a married woman in her late forties be so upset that she would go to the trouble of posting a fake review at this particular time?  The answer, I suspect, is to be found at Change.org, where last year Kay signed the petition “Senator Amy Klobuchar: Publicly Come Out in Support of Same-Sex Marriage”.  Logic suggests the following scenario: McRapey repeatedly pounds the homophobic drum, Kay’s little rabbit ears perk up, and she bravely hops forth to do battle on behalf of the Whatever warren and her lesbian writer friends at The Loft.\nAnd then the bright lights appeared….\nNow, you’d have to have lived in the Twin Cities to fully appreciate what I find funniest about the good doctor’s wife.  You see, when Kay signed the petition, she claimed to live in Edina.  But she doesn’t.  As it happens, in high school I dated a few girls from Edina, including one who lived just down the road from Southdale. Which, you see, is why I happen to know that Kay, like many others in certain parts of Richfield and southwest Minneapolis, only affects to live in the more prestigious city….\nI now await, with no little amusement, the declarations of how scary the Rabbit People find it to discover that Lord Voldemort now has the dark and dangerous powers of\nGoogle-fu\nat his disposal.  I have to confess, I’m more than a little tempted to knock on her door and offer to sign her nonexistent hardcover the next time I’m in\nEdina\nMinneapolis.\nThe other interesting thing, in addition to the fake reviews, is that there are at least two rabbits who are giving helpful ratings to all the negative reviews and rating all of the positive reviews unhelpful.  Given the timing, one of them is likely our little friend Kay.  It’s not so much the review as\nthe rating of the review\nthat is of interest here:\n2 of 3 people found the following review helpful\n1 out of 5 stars: hard to follow yet very predictable January 21, 2013\nBy  Tracy\nThis a long book, very slow read. Not a lot of action or suspense. You can tell whats going to happen almost every step of the way. It is layed out like it is 7 or 8 books stuck together. The chapter titles are just the name of the character that will be prominent for that chapter. Then the next chapter is for the storyline of the next character and so on. After forcing myself to finish the book, it is only a lead up to a second book! It does’t even stand on it’s own! Horrible!\nHelpful indeed.  This is how the Rabbit People fight; it’s all nonsensical, passive-aggressive attacks intended to be plausibly deniable, sniping from behind corners, and appealing to the herd; the correct way to respond is not through reactive passive-aggression, but rather to shine a light on the little critters’s activities.\nWe are not like them, we are better than them.  They know it.  And they know we know it.  That is why they hate us.\nUPDATE: Some are incredulous that I would post information that is freely available to the public about a suspected fraud here on this blog.  Very well, let me be clear.  I am demanding an admission from Mrs. Conterato that she neither purchased the hardcover nor the Kindle version, nor did she read the book in its entirety prior to posting her review.  On a related note, I am requesting the order records from my publisher today; since the book is not available in retail bookstores, I should be able to confirm within days that she did not, in fact, ever purchase the hardcover that she claimed to have reviewed.  I will remove the public information from this post if a) Mrs. Conterato admits she did not buy the book and her review is a fake one, or b) if she proves that she did purchase the book and read it in its entirety.\nUPDATE II: I just got an email from the publisher containing a list of the books sent to Minnesota.  None was sent to anyone named Conterato or to the address shown above.  Or to Edina…. This is not yet conclusive proof as one more possibility exists that I am presently having tracked down, but it is a significant step in that direction.",
  "tags": [
    "books",
    "rabbitology",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-23T09:12:00+00:00"
}