{
  "url": "https://voxday.net/2013/01/02/abolish-death-penalty/",
  "scraped_at": "2025-12-14T22:16:41.438031",
  "title": "Abolish the death penalty",
  "date_display": "January 2, 2013",
  "date_iso": "2013-01-02T16:50:00+00:00",
  "date_from_url": "2013-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not often that I agree with a New York Times editorial, but I, too, oppose the death penalty.  I don’t oppose it because there are not criminals who merit death, but rather because I do not trust the state <a href=\"http://www.nytimes.com/2013/01/02/opinion/americas-retreat-from-the-death-penalty.html?hpw\">to be able to carry it out responsibly</a> and in a strictly limited manner, a doubt that the historical and scientific evidence tends to strongly bolster:</p><blockquote class=\"tr_bq\"><div itemprop=\"articleBody\"> Thanks to the <a href=\"http://www.innocenceproject.org/Content/Facts_on_PostConviction_DNA_Exonerations.php\" title=\"The Innocence Project\">Innocence Project</a><br> and the overturning of 18 wrongful convictions of death-row inmates<br> with DNA evidence and the exonerations of 16 others charged with capital<br> crimes, the American public is increasingly aware that the system makes<br> terrible mistakes. Since 1973, a total of 142 people have been freed<br> from death row after being exonerated with DNA or other kinds of<br> evidence.</br></br></br></br></br></br></div><div itemprop=\"articleBody\"> All of these factors have led the states to retreat from the death<br> penalty in recent years — in both law and in practice. In 2012,<br> Connecticut became the fifth state in five years to abolish the penalty.<br> Nine states executed inmates, the fewest in two decades. Three-fourths<br> of the 43 executions in 2012 were carried out in only four states. The<br> number of new death sentences remained low at 77 — about one-third the<br> number in 2000 — with just four states accounting for almost two-thirds<br> of those sentences. While 33 states retain the death penalty on their<br> books, 13 of them have not executed anyone for at least five years.</br></br></br></br></br></br></br></br></div></blockquote><p>It is always important to keep in mind that murder and other capital crimes are far less significant problems than mass murder by government.  The very last thing any libertarian should support is a government that wants to confiscate firearms being empowered with life and death over its citizens.  Moreover, a death penalty ban should also include a ban on the Obama administration’s claim of a power of secret president-ordered assassinations.</p><p>If the federal government cannot execute a citizen with a trial, it bloody well can’t assassinate him without one either.</p></div>",
  "content_text": "It’s not often that I agree with a New York Times editorial, but I, too, oppose the death penalty.  I don’t oppose it because there are not criminals who merit death, but rather because I do not trust the state\nto be able to carry it out responsibly\nand in a strictly limited manner, a doubt that the historical and scientific evidence tends to strongly bolster:\nThanks to the\nInnocence Project\nand the overturning of 18 wrongful convictions of death-row inmates\nwith DNA evidence and the exonerations of 16 others charged with capital\ncrimes, the American public is increasingly aware that the system makes\nterrible mistakes. Since 1973, a total of 142 people have been freed\nfrom death row after being exonerated with DNA or other kinds of\nevidence.\nAll of these factors have led the states to retreat from the death\npenalty in recent years — in both law and in practice. In 2012,\nConnecticut became the fifth state in five years to abolish the penalty.\nNine states executed inmates, the fewest in two decades. Three-fourths\nof the 43 executions in 2012 were carried out in only four states. The\nnumber of new death sentences remained low at 77 — about one-third the\nnumber in 2000 — with just four states accounting for almost two-thirds\nof those sentences. While 33 states retain the death penalty on their\nbooks, 13 of them have not executed anyone for at least five years.\nIt is always important to keep in mind that murder and other capital crimes are far less significant problems than mass murder by government.  The very last thing any libertarian should support is a government that wants to confiscate firearms being empowered with life and death over its citizens.  Moreover, a death penalty ban should also include a ban on the Obama administration’s claim of a power of secret president-ordered assassinations.\nIf the federal government cannot execute a citizen with a trial, it bloody well can’t assassinate him without one either.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-02T16:50:00+00:00"
}