{
  "url": "https://voxday.net/2013/01/31/alert-oed/",
  "scraped_at": "2025-12-14T22:19:13.703316",
  "title": "Alert the OED",
  "date_display": "January 31, 2013",
  "date_iso": "2013-01-31T19:30:00+00:00",
  "date_from_url": "2013-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Roissy <a href=\"http://heartiste.wordpress.com/2013/01/31/this-house-is-clean-and-sex-free/\">coins a new term</a>:</p><blockquote class=\"tr_bq\"><p> When men are men and women are women, the sex is more frequent. And<br> probably hotter, too. When men are scalzied manboobs and women are<br> manjawed feminists, the bedroom is an arid wasteland of dashed passion.</br></br></p><p>Sexual polarity — the primal force that adheres the cosmic cock to<br> the celestial snatch — is the truth of truths that belies every feminist<br> assertion ever made in the history of that insipid, leprotic ideology.<br> May the losers of the world quake and fall to their knees before its<br> divine directive.</br></br></br></br></p><p>This isn’t a truth borne of social constructs, or of cultural<br> conditionings, or of privileges of privilege. It’s a truth woven into<br> the fabric of our origin atoms, the glue that binds our helical<br> commandments and reaches outward to breathe life into the monolith of<br> our souls.</br></br></br></br></p><p>It is what is.</p></blockquote><p>The man is a wordsmith of uncommon skill and violence.  He takes words and makes them his own in much the same way McRapey informs us he treats women.  And speaking of McRapey, it was more than a little amusing to see Roissy utilize the term “scalzied” in a sentence.</p><p>But precisely what does it mean for someone to be scalzied?  In the context given, I can only conclude that it means for a man to have become accustomed to assuming a servile and inferior demeanor in relation to women based on a mistaken impression that doing so would curry favor with them.  Naturally, I defer to Roissy if I have somehow failed to grasp his neologism in its entirety.</p><p>As for the study that is the main subject of his post, I’ll address it on Alpha Game tomorrow, since a considerable number of people have been kind enough to bring it to my attention.  Translation: <i>thank you and you can stop emailing it to me now….</i></p><p> UPDATE:  Johnny is very bravely keeping a smile on his face and attempting to pretend that he thinks this is all so very much fun and adorable.  Which is great, because I certainly find it amusing too and I’m more than happy to continue to amusing him and his fellow rabbits accordingly. The thing is, he appears to be under the misapprehension that I had anything to do with whatever it was that inspired <a href=\"http://whatever.scalzi.com/2013/01/31/troll-report-active-with-increasing-chance-of-stupid/\">his latest inspirational message</a>.  Unfortunately, I can’t take any credit for it.  Strangely enough, I’m responding to a post he wrote about me describing how I frequently write about him when I hadn’t, in fact, done so.  This is all beginning to get a little meta.<br> <i><br/></i><br> <i>“Folks, as you may know, out there on the Internets there is a Racist Sexist Homophobic Dipshit who at the moment has an adorable mancrush on me. This means that he can hardly go a day or two without saying something about me on his Web site, usually something which reflects his own deep and abiding personal insecurities. And of course, this is his prerogative; if it makes him feel better about himself and pumps up his social status with his clutch of equally insecure racist sexist homophobic dipshit admirers, then by all means he can spout as much garbage about me as he likes. It does no harm to me (as noted before, no one outside his little huddle of bigots gives much mind to anything he has to say about anything, much less anything  he has to say about me) and I suppose it keeps him from playing in traffic. So, fine.”</i></br></br></p><p>Isn’t it wonderful that everyone is fine with it?  It should certainly be fascinating to see McRapey attempt to pretend The Chateau is as trivial and little-regarded as Vox Popoli.  I wonder what clever name he’ll come up with for Roissy?  I am, after all, but a humble superintelligence, while Roissy is the one of the true geniuses of our generation.</p></div>",
  "content_text": "Roissy\ncoins a new term\n:\nWhen men are men and women are women, the sex is more frequent. And\nprobably hotter, too. When men are scalzied manboobs and women are\nmanjawed feminists, the bedroom is an arid wasteland of dashed passion.\nSexual polarity — the primal force that adheres the cosmic cock to\nthe celestial snatch — is the truth of truths that belies every feminist\nassertion ever made in the history of that insipid, leprotic ideology.\nMay the losers of the world quake and fall to their knees before its\ndivine directive.\nThis isn’t a truth borne of social constructs, or of cultural\nconditionings, or of privileges of privilege. It’s a truth woven into\nthe fabric of our origin atoms, the glue that binds our helical\ncommandments and reaches outward to breathe life into the monolith of\nour souls.\nIt is what is.\nThe man is a wordsmith of uncommon skill and violence.  He takes words and makes them his own in much the same way McRapey informs us he treats women.  And speaking of McRapey, it was more than a little amusing to see Roissy utilize the term “scalzied” in a sentence.\nBut precisely what does it mean for someone to be scalzied?  In the context given, I can only conclude that it means for a man to have become accustomed to assuming a servile and inferior demeanor in relation to women based on a mistaken impression that doing so would curry favor with them.  Naturally, I defer to Roissy if I have somehow failed to grasp his neologism in its entirety.\nAs for the study that is the main subject of his post, I’ll address it on Alpha Game tomorrow, since a considerable number of people have been kind enough to bring it to my attention.  Translation:\nthank you and you can stop emailing it to me now….\nUPDATE:  Johnny is very bravely keeping a smile on his face and attempting to pretend that he thinks this is all so very much fun and adorable.  Which is great, because I certainly find it amusing too and I’m more than happy to continue to amusing him and his fellow rabbits accordingly. The thing is, he appears to be under the misapprehension that I had anything to do with whatever it was that inspired\nhis latest inspirational message\n.  Unfortunately, I can’t take any credit for it.  Strangely enough, I’m responding to a post he wrote about me describing how I frequently write about him when I hadn’t, in fact, done so.  This is all beginning to get a little meta.\n“Folks, as you may know, out there on the Internets there is a Racist Sexist Homophobic Dipshit who at the moment has an adorable mancrush on me. This means that he can hardly go a day or two without saying something about me on his Web site, usually something which reflects his own deep and abiding personal insecurities. And of course, this is his prerogative; if it makes him feel better about himself and pumps up his social status with his clutch of equally insecure racist sexist homophobic dipshit admirers, then by all means he can spout as much garbage about me as he likes. It does no harm to me (as noted before, no one outside his little huddle of bigots gives much mind to anything he has to say about anything, much less anything  he has to say about me) and I suppose it keeps him from playing in traffic. So, fine.”\nIsn’t it wonderful that everyone is fine with it?  It should certainly be fascinating to see McRapey attempt to pretend The Chateau is as trivial and little-regarded as Vox Popoli.  I wonder what clever name he’ll come up with for Roissy?  I am, after all, but a humble superintelligence, while Roissy is the one of the true geniuses of our generation.",
  "tags": [
    "Alpha Game",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-31T19:30:00+00:00"
}