{
  "url": "https://voxday.net/2013/01/29/blowing-away-backstop/",
  "scraped_at": "2025-12-14T22:19:01.725341",
  "title": "Blowing away the backstop",
  "date_display": "January 29, 2013",
  "date_iso": "2013-01-29T14:00:00+00:00",
  "date_from_url": "2013-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Iceland <a href=\"http://online.wsj.com/article/SB10001424127887323375204578269550368102278.html?KEYWORDS=iceland\">wins a legal victory</a> with serious international ramifications:</p><blockquote class=\"tr_bq\"><p> Iceland won a sweeping victory in a court fight over its<br> responsibilities to foreign depositors in Icelandic bank Landsbanki,<br> which failed in 2008. The court of the European Free Trade<br> Association on Monday said Iceland didn’t breach European Economic Area<br> directives on deposit guarantees by not compensating U.K. and Dutch<br> depositors in Landsbanki’s online savings accounts, known as Icesave<br> accounts.</br></br></br></br></br></br></p></blockquote><p>Iceland has blown a large hole in the entire bankocracy.  First, it has shown that a country materially much better off to blow off the bankers, refuse to bail them out, and let them go under than accede to their demands.  Notice that Iceland is not having any trouble borrowing money despite the dire predictions of those running interference for the banks.</p><p>Second, it shows that the dubious legal claims about “debts” that are somehow assumed to be magically passed on to parties who were not involved in the debt contracts are false.  And third, it proves that the foreign “deposit guarantees” are absolutely nothing of the sort.</p><p>This is serious, because, as Karl Denninger <a href=\"http://market-ticker.org/akcs-www?post=216771\">observes</a>: “There are other nations where demands have been made for citizens to cover other, non-citizen losses.  I can think of a few… like, for instance…. Greece…. What this decision does is provide a solid backstop to the opinion that such a guarantee program does not reach beyond the fund and into the general finances of the nation involved, nor can that nation be forced to do so retroactively.”</p></div>",
  "content_text": "Iceland\nwins a legal victory\nwith serious international ramifications:\nIceland won a sweeping victory in a court fight over its\nresponsibilities to foreign depositors in Icelandic bank Landsbanki,\nwhich failed in 2008. The court of the European Free Trade\nAssociation on Monday said Iceland didn’t breach European Economic Area\ndirectives on deposit guarantees by not compensating U.K. and Dutch\ndepositors in Landsbanki’s online savings accounts, known as Icesave\naccounts.\nIceland has blown a large hole in the entire bankocracy.  First, it has shown that a country materially much better off to blow off the bankers, refuse to bail them out, and let them go under than accede to their demands.  Notice that Iceland is not having any trouble borrowing money despite the dire predictions of those running interference for the banks.\nSecond, it shows that the dubious legal claims about “debts” that are somehow assumed to be magically passed on to parties who were not involved in the debt contracts are false.  And third, it proves that the foreign “deposit guarantees” are absolutely nothing of the sort.\nThis is serious, because, as Karl Denninger\nobserves\n: “There are other nations where demands have been made for citizens to cover other, non-citizen losses.  I can think of a few… like, for instance…. Greece…. What this decision does is provide a solid backstop to the opinion that such a guarantee program does not reach beyond the fund and into the general finances of the nation involved, nor can that nation be forced to do so retroactively.”",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-29T14:00:00+00:00"
}