{
  "url": "https://voxday.net/2013/01/17/corrections/",
  "scraped_at": "2025-12-14T22:17:57.623986",
  "title": "Correction(s)",
  "date_display": "January 17, 2013",
  "date_iso": "2013-01-17T18:00:00+00:00",
  "date_from_url": "2013-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In my post at Black Gate <a href=\"http://www.blackgate.com/2012/12/27/sff-corruption-part-i/\">in support of Amazon’s decision</a> to forbid authors to review works in their genres, I erroneously stated that Catherine Asaro was the SFWA president at the time she was awarded the 2002 Nebula for Best Novel.  Michael Capobianco, another past SFWA president, corrected me thusly:</p><p><i>“The Quantum Rose won the Nebula Award for best novel on April<br> 27, 2002. Catherine Asaro was not an officer of SFWA at the time.<br> She was VP of SFWA from July 1, 2002 to June 30, 2003 and<br> President of SFWA from July 1, 2003 to June 30, 2005.”</br></br></br></i></p><p> However, a little research showed Capobianco’s correction to be a little on the disingenuous side, which I suspected given his misleading answer concerning the justification for changes to the Nebula award process.  <a href=\"http://www.sfsite.com/vault/news0205.htm\">The SF Site reported in 2002</a>:<br/></p><blockquote class=\"tr_bq\"><p> <b>SFWA Elections</b><b> <br> </br></b></p><p> The results of the SFWA officer elections were announced<br> on April 27 at the SFWA Business Meeting in Kansas City,<br> MO. Sharon Lee defeated incumbent Norman Spinrad for<br> the Presidency. Two other authors received write-in<br> votes. Catherine Asaro defeated Lee Martindale for the<br> Vice-Presidency, again with two other (different)<br> authors receiving write-in votes. Chuck Rothman<br> (treasurer) and ElizaBeth Gilligan (Secretary) both ran<br> unopposed. Because of the closeness of the race for<br> Eastern Regional Director, the election committee has<br> decided re-balloting will take place in that race.<br> <b> </b><b>Nebula Awards</b><b> </b></br></br></br></br></br></br></br></br></br></br></br></p><p> Only hours after being named Vice President of SFWA,<br> Catherine Asaro was honored with a Nebula for her novel<br> The Quantum Rose (Tor).</br></br></p></blockquote><p>In other words, Asaro wasn’t the President, she was the Vice President-elect.  Which underlines the point that I was making, which was never that Asaro had somehow abused her position as President, or, as more accurately, Vice President-elect, (I don’t even know how it would have been possible in either case), but  rather that the award that year was a simple popularity contest which led to a mediocre novel being unjustly awarded the Best Novel award.</p></div>",
  "content_text": "In my post at Black Gate\nin support of Amazon’s decision\nto forbid authors to review works in their genres, I erroneously stated that Catherine Asaro was the SFWA president at the time she was awarded the 2002 Nebula for Best Novel.  Michael Capobianco, another past SFWA president, corrected me thusly:\n“The Quantum Rose won the Nebula Award for best novel on April\n27, 2002. Catherine Asaro was not an officer of SFWA at the time.\nShe was VP of SFWA from July 1, 2002 to June 30, 2003 and\nPresident of SFWA from July 1, 2003 to June 30, 2005.”\nHowever, a little research showed Capobianco’s correction to be a little on the disingenuous side, which I suspected given his misleading answer concerning the justification for changes to the Nebula award process.\nThe SF Site reported in 2002\n:\nSFWA Elections\nThe results of the SFWA officer elections were announced\non April 27 at the SFWA Business Meeting in Kansas City,\nMO. Sharon Lee defeated incumbent Norman Spinrad for\nthe Presidency. Two other authors received write-in\nvotes. Catherine Asaro defeated Lee Martindale for the\nVice-Presidency, again with two other (different)\nauthors receiving write-in votes. Chuck Rothman\n(treasurer) and ElizaBeth Gilligan (Secretary) both ran\nunopposed. Because of the closeness of the race for\nEastern Regional Director, the election committee has\ndecided re-balloting will take place in that race.\nNebula Awards\nOnly hours after being named Vice President of SFWA,\nCatherine Asaro was honored with a Nebula for her novel\nThe Quantum Rose (Tor).\nIn other words, Asaro wasn’t the President, she was the Vice President-elect.  Which underlines the point that I was making, which was never that Asaro had somehow abused her position as President, or, as more accurately, Vice President-elect, (I don’t even know how it would have been possible in either case), but  rather that the award that year was a simple popularity contest which led to a mediocre novel being unjustly awarded the Best Novel award.",
  "tags": [
    "Black Gate",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-17T18:00:00+00:00"
}