{
  "url": "https://voxday.net/2013/01/06/creeping-out-from-under-their-rocks/",
  "scraped_at": "2025-12-14T22:17:01.209295",
  "title": "Creeping out from under their rocks",
  "date_display": "January 6, 2013",
  "date_iso": "2013-01-06T14:45:00+00:00",
  "date_from_url": "2013-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The advocates of unlimited government are beginning to sense that their long-sought victory over the concept of limited government <a href=\"http://www.nytimes.com/2012/12/31/opinion/lets-give-up-on-the-constitution.html?hp\">is finally within sight</a>:</p><blockquote class=\"tr_bq\"><p> As the nation teeters at the edge of fiscal chaos, observers are<br> reaching the conclusion that the American system of government is<br> broken. But almost no one blames the culprit: our insistence on<br> obedience to the Constitution, with all its archaic, idiosyncratic and<br> downright evil provisions…</br></br></br></br></p><p>it is hard to take seriously the claim by the<br> Constitution’s defenders that we would be reduced to a Hobbesian state<br> of nature if we asserted our freedom from this ancient text. Our<br> sometimes flagrant disregard of the Constitution has not produced chaos<br> or totalitarianism; on the contrary, it has helped us to grow and<br> prosper.</br></br></br></br></br></p><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> This is not to say that we should disobey all constitutional commands.<br> Freedom of speech and religion, equal protection of the laws and<br> protections against governmental deprivation of life, liberty or<br> property are important, whether or not they are in the Constitution. We<br> should continue to follow those requirements out of respect, not<br> obligation. </br></br></br></br></br></div></blockquote><p>Make no mistake, getting rid of the Constitution has always been the penultimate goal of the Left.  Everything they have done, from expanding the franchise to women and younger voters to changing the demographic makeup of the electorate and buying off the elderly, has been with this object in mind.  Unlimited government is the goal, and even though the Constitution is mostly honored in its breach these days, it is still a reminder that the real America, the historical America, is a nation of laws and not men.</p></div>",
  "content_text": "The advocates of unlimited government are beginning to sense that their long-sought victory over the concept of limited government\nis finally within sight\n:\nAs the nation teeters at the edge of fiscal chaos, observers are\nreaching the conclusion that the American system of government is\nbroken. But almost no one blames the culprit: our insistence on\nobedience to the Constitution, with all its archaic, idiosyncratic and\ndownright evil provisions…\nit is hard to take seriously the claim by the\nConstitution’s defenders that we would be reduced to a Hobbesian state\nof nature if we asserted our freedom from this ancient text. Our\nsometimes flagrant disregard of the Constitution has not produced chaos\nor totalitarianism; on the contrary, it has helped us to grow and\nprosper.\nThis is not to say that we should disobey all constitutional commands.\nFreedom of speech and religion, equal protection of the laws and\nprotections against governmental deprivation of life, liberty or\nproperty are important, whether or not they are in the Constitution. We\nshould continue to follow those requirements out of respect, not\nobligation.\nMake no mistake, getting rid of the Constitution has always been the penultimate goal of the Left.  Everything they have done, from expanding the franchise to women and younger voters to changing the demographic makeup of the electorate and buying off the elderly, has been with this object in mind.  Unlimited government is the goal, and even though the Constitution is mostly honored in its breach these days, it is still a reminder that the real America, the historical America, is a nation of laws and not men.",
  "tags": [
    "decline and fall",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-06T14:45:00+00:00"
}