{
  "url": "https://voxday.net/2013/01/22/defying-king-cuomo/",
  "scraped_at": "2025-12-14T22:18:16.510457",
  "title": "Defying King Cuomo",
  "date_display": "January 22, 2013",
  "date_iso": "2013-01-22T09:27:00+00:00",
  "date_from_url": "2013-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Will the shooting start in New York?  New York gun owners <a href=\"http://www.nypost.com/p/news/local/hit_us_with_your_best_shot_andy_5rxZg0gYBJJhkLBtiTPMfJ\">have no intention of complying</a> with King Cuomo’s attempt to disarm them:</p><blockquote class=\"tr_bq\"><p> Assault-rifle owners statewide are organizing a mass boycott of Gov.<br> Cuomo’s new law mandating they register their weapons, daring officials<br> to “come and take it away,” The Post has learned.</br></br></p><p>Gun-range owners<br> and gun-rights advocates are encouraging hundreds of thousands of<br> owners to defy the law, saying it’d be the largest act of civil<br> disobedience in state history.</br></br></br></p><p>“I’ve heard from hundreds of people<br> that they’re prepared to defy the law, and that number will be<br> magnified by the thousands, by the tens of thousands, when the<br> registration deadline comes,’’ said Brian Olesen, president of the<br> American Shooters Supply, one of the largest gun dealers in the state.</br></br></br></br></p></blockquote><p>King Cuomo is violating the Second Amendment and his new law is void on its face, being a clear infringement upon the right to bear arms.  No New Yorker should obey King Cuomo’s mandate, no New Yorker should register his weapons, and no New Yorker should permit himself to be disarmed by New York State.</p><p>“State officials will be nervously watching the registration figures to see how many gun owners comply, sources said.”</p><p>I’ll bet they’re nervous.  Molon labe.</p></div>",
  "content_text": "Will the shooting start in New York?  New York gun owners\nhave no intention of complying\nwith King Cuomo’s attempt to disarm them:\nAssault-rifle owners statewide are organizing a mass boycott of Gov.\nCuomo’s new law mandating they register their weapons, daring officials\nto “come and take it away,” The Post has learned.\nGun-range owners\nand gun-rights advocates are encouraging hundreds of thousands of\nowners to defy the law, saying it’d be the largest act of civil\ndisobedience in state history.\n“I’ve heard from hundreds of people\nthat they’re prepared to defy the law, and that number will be\nmagnified by the thousands, by the tens of thousands, when the\nregistration deadline comes,’’ said Brian Olesen, president of the\nAmerican Shooters Supply, one of the largest gun dealers in the state.\nKing Cuomo is violating the Second Amendment and his new law is void on its face, being a clear infringement upon the right to bear arms.  No New Yorker should obey King Cuomo’s mandate, no New Yorker should register his weapons, and no New Yorker should permit himself to be disarmed by New York State.\n“State officials will be nervously watching the registration figures to see how many gun owners comply, sources said.”\nI’ll bet they’re nervous.  Molon labe.",
  "tags": [
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-22T09:27:00+00:00"
}