{
  "url": "https://voxday.net/2013/01/30/do-caterpillars-fear-cocoon/",
  "scraped_at": "2025-12-14T22:19:05.049437",
  "title": "Do caterpillars fear the cocoon?",
  "date_display": "January 30, 2013",
  "date_iso": "2013-01-30T09:15:00+00:00",
  "date_from_url": "2013-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I know all atheists are not<a href=\"http://www.helenspage.com/p/my-dying-father-is-america/414\"> in denial concerning their mortality</a>.  But it is informative to see how people tend to become more open-minded towards religious matters as they approach life’s finish line.  I tend to suspect the relative irreligion of the young is more indicative of an erroneous belief in their own immortality than any sort of genuine disbelief.</p><blockquote class=\"tr_bq\"><p>  My father has lived in a state of blissful denial his entire life. He<br> used to smoke five packs of cigarettes a day, and until he was seventy<br> he drank a quart of scotch a day. His diet consists of steak, salami,<br> potatoes, bread, cheese, mayonnaise, ice cream, and pie.</br></br></br></p><p>By this afternoon, my father’s pain was alleviated substantially, and<br> he began bitching about how he was going to get off the oxycontin after<br> he recovered. He told me recently that until he was eighty, he honestly<br> thought he’d live forever. I didn’t say, “Really? You thought you’d<br> live in your house here in Los Angeles for trillions and trillions and<br> trillions of years, making your wooden toys, watching Bill O’Reilly, and<br> eating salami sandwiches with an inch of cheddar cheese, for all<br> eternity?”</br></br></br></br></br></br></br></p><p>I didn’t say that because my father’s fear of death is irrational. It<br> would be cruel to subject him to that sort of conversation…. When my father was eighty-three, he had an operation on his hand.<br> Since he takes blood thinners, any surgery is risky. They had to prepare<br> to do an emergency transfusion. In discussing his fears with him, I<br> mentioned that I couldn’t donate blood because I lived in Britain for<br> two years during the eighties. Due to the risk that I may have ingested<br> the prion that causes Creutzfeldt–Jakob disease, I’m permanently barred<br> from donating blood. This made my father terrified that he might get<br> Creutzfeldt–Jakob disease if he got a transfusion.</br></br></br></br></br></br></br></br></p><p>“Don’t worry about it,” I said. “It has a forty-year incubation period.”</p><p>His face fell. “Are you saying I’m not going to be here in forty<br> years?” He was horrified and his feelings were hurt. I thought he’d<br> laugh, but I’d scared him. He went to bed chilled to the bone at the<br> thought that he might not live to be 123.</br></br></br></p></blockquote><p>We are all going to die eventually.  After a long life of joy, happiness, love, and good works, one hopes, but regardless, sooner or later, the final day will come.  This is why it is vital for us to make the most of our lives, to balance the urgent need to make a living and support our families with truly important matters such as serving God, spreading the Good News, and making some sort of positive mark to permit future generations to realize that we were here.</p><p>We can spend our days seeking mindless pleasure, but hedonism burns out fast and leaves little more than a burned-out shell behind.  We can live in fear and denial, or we can live in nihilistic stoicism, attempting to manufacture our own meaning and desperately trying to convince others of what we do not truly believe ourselves.  Or we can live by faith, trusting God, accepting that we are merely caterpillars and death is nothing more than a cocoon we must endure before we can take flight.</p><p>And what is true of men is true of nations.  America is entering its cocoon.  Who is to say with any certainty that what will eventually result will not be better than what came before.</p></div>",
  "content_text": "I know all atheists are not\nin denial concerning their mortality\n.  But it is informative to see how people tend to become more open-minded towards religious matters as they approach life’s finish line.  I tend to suspect the relative irreligion of the young is more indicative of an erroneous belief in their own immortality than any sort of genuine disbelief.\nMy father has lived in a state of blissful denial his entire life. He\nused to smoke five packs of cigarettes a day, and until he was seventy\nhe drank a quart of scotch a day. His diet consists of steak, salami,\npotatoes, bread, cheese, mayonnaise, ice cream, and pie.\nBy this afternoon, my father’s pain was alleviated substantially, and\nhe began bitching about how he was going to get off the oxycontin after\nhe recovered. He told me recently that until he was eighty, he honestly\nthought he’d live forever. I didn’t say, “Really? You thought you’d\nlive in your house here in Los Angeles for trillions and trillions and\ntrillions of years, making your wooden toys, watching Bill O’Reilly, and\neating salami sandwiches with an inch of cheddar cheese, for all\neternity?”\nI didn’t say that because my father’s fear of death is irrational. It\nwould be cruel to subject him to that sort of conversation…. When my father was eighty-three, he had an operation on his hand.\nSince he takes blood thinners, any surgery is risky. They had to prepare\nto do an emergency transfusion. In discussing his fears with him, I\nmentioned that I couldn’t donate blood because I lived in Britain for\ntwo years during the eighties. Due to the risk that I may have ingested\nthe prion that causes Creutzfeldt–Jakob disease, I’m permanently barred\nfrom donating blood. This made my father terrified that he might get\nCreutzfeldt–Jakob disease if he got a transfusion.\n“Don’t worry about it,” I said. “It has a forty-year incubation period.”\nHis face fell. “Are you saying I’m not going to be here in forty\nyears?” He was horrified and his feelings were hurt. I thought he’d\nlaugh, but I’d scared him. He went to bed chilled to the bone at the\nthought that he might not live to be 123.\nWe are all going to die eventually.  After a long life of joy, happiness, love, and good works, one hopes, but regardless, sooner or later, the final day will come.  This is why it is vital for us to make the most of our lives, to balance the urgent need to make a living and support our families with truly important matters such as serving God, spreading the Good News, and making some sort of positive mark to permit future generations to realize that we were here.\nWe can spend our days seeking mindless pleasure, but hedonism burns out fast and leaves little more than a burned-out shell behind.  We can live in fear and denial, or we can live in nihilistic stoicism, attempting to manufacture our own meaning and desperately trying to convince others of what we do not truly believe ourselves.  Or we can live by faith, trusting God, accepting that we are merely caterpillars and death is nothing more than a cocoon we must endure before we can take flight.\nAnd what is true of men is true of nations.  America is entering its cocoon.  Who is to say with any certainty that what will eventually result will not be better than what came before.",
  "tags": [
    "Christianity",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-30T09:15:00+00:00"
}