{
  "url": "https://voxday.net/2013/01/26/efficiently-incommunicado/",
  "scraped_at": "2025-12-14T22:18:45.529587",
  "title": "Efficiently incommunicado",
  "date_display": "January 26, 2013",
  "date_iso": "2013-01-26T14:00:00+00:00",
  "date_from_url": "2013-01-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is some <a href=\"http://canadiancincinnatus.typepad.com/my_weblog/2013/01/rob-long-stop-connecting-or-why-the-british-empire-was-so-efficient.html\">commendable cogitation</a> on the part of the Canadian Cincinnatus:</p><blockquote class=\"tr_bq\"><p> [W]hy was the British Empire so efficient? For there<br> is no doubt about it, it was. A mere thousand bureaucrats in the Colonial<br> Office managed an empire so large that the sun never set on it, an empire that<br> included a subcontinent. How was this possible?</br></br></br></p><p>One<br> reason, I think, is that the colonies weren’t informatically connected. No<br> phones, no text messages, no Skype, no e-mail, no conference calls, no<br> webinars, no meetings. Therefore, no micromanagement. For reasons of necessity,<br> all decisions had to be pushed down to the lowest possible levels. This not<br> only had the effect of minimizing bureaucracy but it also meant that the<br> character of the Empire’s decision makers was more solid.</br></br></br></br></br></br></p></blockquote><p>Contrast with this Richard Nixon speaking to platoon leaders in the field in Vietnam.  Bureaucracy can be a killer even in very small organizations and also relates to the r/K metaphor; once the job becomes sufficiently easy and risk-free, the change almost dictates the mass entry of the Rabbit People.</p><p>One of the things that strikes the reader of Imperial British history was the youth and astounding arrogance of the men who ruled its colonies.  Their belief in their own superiority was, to a certain extent, a self-fulfilling prophecy.  My favorite example from the era was the officer who steamed something like a hundred miles upriver from his army, showed up at the gates of a garrisoned, walled city with about twenty men, and demanded its surrender.</p><p>Since it never occurred to the enemy commander whose army had previously been defeated that anyone could possibly be so insanely arrogant as to make such a demand without having his victorious army in the near vicinity, the city was surrendered at once.  And yet, it wasn’t actually crazy, it was a straightforward calculated risk based on the idea of the enemy’s interest in his own self-preservation. </p></div>",
  "content_text": "This is some\ncommendable cogitation\non the part of the Canadian Cincinnatus:\n[W]hy was the British Empire so efficient? For there\nis no doubt about it, it was. A mere thousand bureaucrats in the Colonial\nOffice managed an empire so large that the sun never set on it, an empire that\nincluded a subcontinent. How was this possible?\nOne\nreason, I think, is that the colonies weren’t informatically connected. No\nphones, no text messages, no Skype, no e-mail, no conference calls, no\nwebinars, no meetings. Therefore, no micromanagement. For reasons of necessity,\nall decisions had to be pushed down to the lowest possible levels. This not\nonly had the effect of minimizing bureaucracy but it also meant that the\ncharacter of the Empire’s decision makers was more solid.\nContrast with this Richard Nixon speaking to platoon leaders in the field in Vietnam.  Bureaucracy can be a killer even in very small organizations and also relates to the r/K metaphor; once the job becomes sufficiently easy and risk-free, the change almost dictates the mass entry of the Rabbit People.\nOne of the things that strikes the reader of Imperial British history was the youth and astounding arrogance of the men who ruled its colonies.  Their belief in their own superiority was, to a certain extent, a self-fulfilling prophecy.  My favorite example from the era was the officer who steamed something like a hundred miles upriver from his army, showed up at the gates of a garrisoned, walled city with about twenty men, and demanded its surrender.\nSince it never occurred to the enemy commander whose army had previously been defeated that anyone could possibly be so insanely arrogant as to make such a demand without having his victorious army in the near vicinity, the city was surrendered at once.  And yet, it wasn’t actually crazy, it was a straightforward calculated risk based on the idea of the enemy’s interest in his own self-preservation.",
  "tags": [
    "corpocracy",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-26T14:00:00+00:00"
}