{
  "url": "https://voxday.net/2013/01/16/empty-words/",
  "scraped_at": "2025-12-14T22:17:50.902296",
  "title": "Empty words",
  "date_display": "January 16, 2013",
  "date_iso": "2013-01-16T18:21:00+00:00",
  "date_from_url": "2013-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Barack Obama attempted to unilaterally impose the following on Americans today:<br> 1. Issue a Presidential Memorandum to require federal<br> agencies to make relevant data available to the federal background check<br> system.</br></br></br></p><p>2. Address unnecessary legal barriers, particularly<br> relating to the Health Insurance Portability and Accountability Act,<br> that may prevent states from making information available to the<br> background check system.</br></br></br></p><p>3. Improve incentives for states to share information with the background check system.</p><p>4.<br> Direct the Attorney General to review categories of individuals<br> prohibited from having a gun to make sure dangerous people are not<br> slipping through the cracks.</br></br></br></p><p>5. Propose rulemaking to give law<br> enforcement the ability to run a full background check on an individual<br> before returning a seized gun.</br></br></p><p>6. Publish a letter from ATF to<br> federally licensed gun dealers providing guidance on how to run<br> background checks for private sellers.</br></br></p><p>7. Launch a national safe and responsible gun ownership campaign.</p><p>8. Review safety standards for gun locks and gun safes (Consumer Product Safety Commission).</p><p>9. Issue a Presidential Memorandum to require federal law enforcement to trace guns recovered in criminal investigations.</p><p>10. Release a DOJ report analyzing information on lost and stolen guns and make it widely available to law enforcement.</p><p>11. Nominate an ATF director.</p><p>12. Provide law enforcement, first responders, and school officials with proper training for active shooter situations.</p><p>13. Maximize enforcement efforts to prevent gun violence and prosecute gun crime.</p><p>14.<br> Issue a Presidential Memorandum directing the Centers for Disease<br> Control to research the causes and prevention of gun violence.</br></br></p><p>15.<br> Direct the Attorney General to issue a report on the availability and<br> most effective use of new gun safety technologies and challenge the<br> private sector to develop innovative technologies.</br></br></br></p><p>16. Clarify that the Affordable Care Act does not prohibit doctors asking their patients about guns in their homes.</p><p>17.<br> Release a letter to health care providers clarifying that no federal<br> law prohibits them from reporting threats of violence to law enforcement<br> authorities.</br></br></br></p><p>18. Provide incentives for schools to hire school resource officers.</p><p>19. Develop model emergency response plans for schools, houses of worship and institutions of higher education.</p><p>20. Release a letter to state health officials clarifying the scope of mental health services that Medicaid plans must cover.</p><p>21. Finalize regulations clarifying essential health benefits and parity requirements within ACA exchanges.</p><p>22. Commit to finalizing mental health parity regulations.</p><p>23. Launch a national dialogue led by Secretaries Sebelius and Duncan on mental health.</p><p>It isn’t law.  It isn’t anything but the meaningless words of one man who seeks to disarm Americans.</p></div>",
  "content_text": "Barack Obama attempted to unilaterally impose the following on Americans today:\n1. Issue a Presidential Memorandum to require federal\nagencies to make relevant data available to the federal background check\nsystem.\n2. Address unnecessary legal barriers, particularly\nrelating to the Health Insurance Portability and Accountability Act,\nthat may prevent states from making information available to the\nbackground check system.\n3. Improve incentives for states to share information with the background check system.\n4.\nDirect the Attorney General to review categories of individuals\nprohibited from having a gun to make sure dangerous people are not\nslipping through the cracks.\n5. Propose rulemaking to give law\nenforcement the ability to run a full background check on an individual\nbefore returning a seized gun.\n6. Publish a letter from ATF to\nfederally licensed gun dealers providing guidance on how to run\nbackground checks for private sellers.\n7. Launch a national safe and responsible gun ownership campaign.\n8. Review safety standards for gun locks and gun safes (Consumer Product Safety Commission).\n9. Issue a Presidential Memorandum to require federal law enforcement to trace guns recovered in criminal investigations.\n10. Release a DOJ report analyzing information on lost and stolen guns and make it widely available to law enforcement.\n11. Nominate an ATF director.\n12. Provide law enforcement, first responders, and school officials with proper training for active shooter situations.\n13. Maximize enforcement efforts to prevent gun violence and prosecute gun crime.\n14.\nIssue a Presidential Memorandum directing the Centers for Disease\nControl to research the causes and prevention of gun violence.\n15.\nDirect the Attorney General to issue a report on the availability and\nmost effective use of new gun safety technologies and challenge the\nprivate sector to develop innovative technologies.\n16. Clarify that the Affordable Care Act does not prohibit doctors asking their patients about guns in their homes.\n17.\nRelease a letter to health care providers clarifying that no federal\nlaw prohibits them from reporting threats of violence to law enforcement\nauthorities.\n18. Provide incentives for schools to hire school resource officers.\n19. Develop model emergency response plans for schools, houses of worship and institutions of higher education.\n20. Release a letter to state health officials clarifying the scope of mental health services that Medicaid plans must cover.\n21. Finalize regulations clarifying essential health benefits and parity requirements within ACA exchanges.\n22. Commit to finalizing mental health parity regulations.\n23. Launch a national dialogue led by Secretaries Sebelius and Duncan on mental health.\nIt isn’t law.  It isn’t anything but the meaningless words of one man who seeks to disarm Americans.",
  "tags": [
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-16T18:21:00+00:00"
}