{
  "url": "https://voxday.net/2013/01/17/gun-bans-dont-work/",
  "scraped_at": "2025-12-14T22:17:55.803648",
  "title": "Gun bans don’t work",
  "date_display": "January 17, 2013",
  "date_iso": "2013-01-17T14:33:00+00:00",
  "date_from_url": "2013-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A prosecutor from Washington DC <a href=\"http://online.wsj.com/article/SB10001424127887324081704578235460300469292.html?mod=WSJ_hps_sections_opinion\">recounts his experience</a> with one of the strongest gun bans in the country:</p><blockquote class=\"tr_bq\"><p> As a former prosecutor in Washington, D.C., who enforced firearms and<br> ammunition cases while a severe local gun ban was still in effect, I am<br> skeptical of the benefits that many imagine will result from additional<br> gun-control efforts. I dislike guns, but I believe that a nationwide<br> firearms crackdown would place an undue burden on law enforcement and<br> endanger civil liberties while potentially increasing crime.</br></br></br></br></br></p><p>The D.C. gun ban, enacted in 1976, prohibited anyone other than<br> law-enforcement officers from carrying a firearm in the city. Residents<br> were even barred from keeping guns in their homes for self-defense.</br></br></p><p><a href=\"http://www.blogger.com/blogger.g?blogID=5604161\" name=\"U90402792486SWG\"></a>Some in Washington who owned firearms<br> before the ban were allowed to keep them as long as the weapons were<br> disassembled or trigger-locked at all times. According to the law,<br> trigger locks could not be removed for self-defense even if the owner<br> was being robbed at gunpoint. The only way anyone could legally possess a<br> firearm in the District without a trigger lock was to obtain written<br> permission from the D.C. police. The granting of such permission was<br> rare.</br></br></br></br></br></br></br></p><p><a href=\"http://www.blogger.com/blogger.g?blogID=5604161\" name=\"U904027924862PE\"></a>The gun ban had an unintended effect:<br> It emboldened criminals because they knew that law-abiding District<br> residents were unarmed and powerless to defend themselves. Violent crime<br> increased after the law was enacted, with homicides rising to 369 in<br> 1988, from 188 in 1976 when the ban started. By 1993, annual homicides<br> had reached 454.</br></br></br></br></br></p></blockquote><p>As I’ve already shown by citing the international firearms homicide statistics, guns are quite clearly not the problem.  It is absolutely impossible to reasonably claim, with a straight face, that the Obama administration’s push for gun control has anything whatsoever to do with reducing gun deaths in particular or the violence in general.</p><p>This is obvious because regardless of whether one looks at Western Europe, Latin America, Australia, the UK, or US cities such as Chicago and Washington DC, gun bans have reliably led to more violence, and often, more firearms homicide.  The logic is not compelling, it is conclusive and inescapable.</p><p>And it leads one to the next question.  Since reducing the rate of gun deaths and criminal violence is obviously not the objective of pursuing increased restrictions on firearms and further infringing upon the Second Amendment rights of the American people, <i>what is the real objective?</i></p><p>Now, I know what I believe it to be.  But I’m interested to hear the claims, and the supporting arguments for those claims, from those who believe it to be anything but the eventual disarmament of the American people.</p></div>",
  "content_text": "A prosecutor from Washington DC\nrecounts his experience\nwith one of the strongest gun bans in the country:\nAs a former prosecutor in Washington, D.C., who enforced firearms and\nammunition cases while a severe local gun ban was still in effect, I am\nskeptical of the benefits that many imagine will result from additional\ngun-control efforts. I dislike guns, but I believe that a nationwide\nfirearms crackdown would place an undue burden on law enforcement and\nendanger civil liberties while potentially increasing crime.\nThe D.C. gun ban, enacted in 1976, prohibited anyone other than\nlaw-enforcement officers from carrying a firearm in the city. Residents\nwere even barred from keeping guns in their homes for self-defense.\nSome in Washington who owned firearms\nbefore the ban were allowed to keep them as long as the weapons were\ndisassembled or trigger-locked at all times. According to the law,\ntrigger locks could not be removed for self-defense even if the owner\nwas being robbed at gunpoint. The only way anyone could legally possess a\nfirearm in the District without a trigger lock was to obtain written\npermission from the D.C. police. The granting of such permission was\nrare.\nThe gun ban had an unintended effect:\nIt emboldened criminals because they knew that law-abiding District\nresidents were unarmed and powerless to defend themselves. Violent crime\nincreased after the law was enacted, with homicides rising to 369 in\n1988, from 188 in 1976 when the ban started. By 1993, annual homicides\nhad reached 454.\nAs I’ve already shown by citing the international firearms homicide statistics, guns are quite clearly not the problem.  It is absolutely impossible to reasonably claim, with a straight face, that the Obama administration’s push for gun control has anything whatsoever to do with reducing gun deaths in particular or the violence in general.\nThis is obvious because regardless of whether one looks at Western Europe, Latin America, Australia, the UK, or US cities such as Chicago and Washington DC, gun bans have reliably led to more violence, and often, more firearms homicide.  The logic is not compelling, it is conclusive and inescapable.\nAnd it leads one to the next question.  Since reducing the rate of gun deaths and criminal violence is obviously not the objective of pursuing increased restrictions on firearms and further infringing upon the Second Amendment rights of the American people,\nwhat is the real objective?\nNow, I know what I believe it to be.  But I’m interested to hear the claims, and the supporting arguments for those claims, from those who believe it to be anything but the eventual disarmament of the American people.",
  "tags": [
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-17T14:33:00+00:00"
}