{
  "url": "https://voxday.net/2013/01/30/i-am-still-not-conservative/",
  "scraped_at": "2025-12-14T22:19:06.539763",
  "title": "I am still not a conservative",
  "date_display": "January 30, 2013",
  "date_iso": "2013-01-30T14:30:00+00:00",
  "date_from_url": "2013-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ed Trimnell is operating from a fundamentally flawed logical foundation <a href=\"http://onewordtrimnell.blogspot.com/2013/01/real-conservatives-arent-sexist.html\">in his defense</a> of what he calls conservatism:</p><blockquote class=\"tr_bq\"><p> Today I read a piece on Vox Day’s blog, entitled “Women ruin everything.” (Vox Day bills himself as a conservative.)</p><p>Leaving the title aside, most of the blog post deals with the excesses of the radical gender  politics that have arisen in collegiate sports since the passage of Title IX. In other words: the excesses of leftwing, political feminism. This portion of the post is generally reasonable, and generally conservative.</p><p>But then Vox ends his post with a non sequitur:</p><p><i> “Do you really think it was an accident that women were never permitted any voice in the governance of the Roman Republic or the great historical democracies such as Athens, Thebes, Imperial Britain, and Revolutionary America?  Do you really believe it to be a mere coincidence that many modern democracies, including Germany, Italy, and the member states of the European Union, were not able to survive even 100 years of female suffrage?”</i></p><p>What about Jeane Kirkpatrick–and Margaret Thatcher? Would Vox seriously deny these women the vote? (A true conservative would not apportion any political privileges or penalties based on race or gender. Once again–that is the game of the Left and the Democratic Party.)</p><p>The implication in Vox’s post is that members of one gender are inherently wiser than those of the other. And there is one gender which–by virtue of being that gender–“ruins everything,” in his words.</p><p>This is exactly what the radical feminists say–only in reverse.</p><p>Conservatives cannot fight irrational gender politics by becoming sexists ourselves, just as we cannot fight the tribal politics of the race card by becoming racists. Conservatism is for men as well as women–and for people of all races and ethnicities. (Let us not forget that most of the welfare states in Europe are essentially the creations of white males, while there are some fairly astute Asian capitalists. And yes–some of them are women.)</p><p>The logical flaws in Vox’s “Women ruin everything” post are obvious. What is not so obvious is how this sort of rhetoric plays into the hands of Obama and the Obamaites.</p><p>One phony conservative can do more damage to the conservative movement than all the prattling leftwing lemmings on The Daily Kos and John Scalzi’s Whatever combined.</p></blockquote><p>I will begin by pointing out that Mr. Trimnell’s reasoning is generally sound, as evidenced by <a href=\"http://onewordtrimnell.blogspot.com/2013/01/vox-day-vs-john-scalzi-echo-chamber.html\">his observations concerning the material difference</a> between Vox Popoli and the warren that is Whatever.  However, his reasoning happens to go significantly awry here because it is built upon false foundations and erroneous assumptions.</p><p>First, I do not bill myself as a conservative.  I am not a conservative.  Neither am I a Republican.  I have never claimed to be either since I first began writing political op/ed in 2001.  While I did briefly belong to the Young Republicans in 1988 and attended both the national convention in Houston as well as the inaugural ball, I have never voted for a Republican for President. To the best of my recollection I registered as a Libertarian in 1992 and have only ever voted for Libertarian presidential candidates.  It may be worth noting that my blog is <a href=\"http://www.theburningplatform.com/?p=12211\">repeatedly listed</a> as one of the <a href=\"http://www.stephankinsella.com/2012/04/the-most-visited-libertarian-websites/\">top libertarian sites</a> and my positions on the drug war, the foreign wars, immigration, the banks, and free trade, among many others, are considerably different than the conventional conservative positions.</p><p>Second, the connection between the observed and incoherent evils of Title IX and female suffrage is far from a non sequitur.  It may be ironic and unexpected that feminism can ruin even the most notable fruits of feminism, but it was both anticipated and predicted by many brilliant past writers that women’s suffrage would bring about both “the despotism of the petticoat” better known today as liberal fascism as well as the eventual demise of those societies that were foolish enough to embrace it.</p><p>In answer to his question, I would absolutely deny women such as Jeanne Kirkpatrick and Margaret Thatcher the vote if the responsibility was given to me.  (It may interest some to know that I’ve actually met both women; I even have a picture of me with Mrs. Kirkpatrick around here somewhere.)  While Mrs. Thatcher was a great woman of genuine courage, she betrayed her country in the end.  And she did so for the very reason women would not be permitted to vote in any society that wishes to sustain itself: she was taken in by the lies of dishonest men.</p><p><i>“We had to learn the hard way that by agreement to what were<br> apparently empty generalizations or vague aspirations we were later held<br> to have committed ourselves to political structures which were contrary<br> to our interests.”</br></br></br></i><br> – Lady Margaret Thatcher, “The Downing Street Years”</br></p><p>Third, while one “gender” is not wiser than the other, gender being a grammatical construct, it is an observable, provable, statistical, and scientific fact that the two sexes possess different brain structures, different thought patterns, different hormonal balances, and different time-preferences.  By a timely coincidence, <a href=\"http://alphagameplan.blogspot.com/2013/01/macrosocio-sexuality.html\">I happened to address this very subject on Alpha Game</a> earlier today.</p><p><i>“[I]f one is able to understand how women’s cumulative socio-sexual<br> preferences affect the housing market and the economy, how is it<br> possible that one is not able to understand that those preferences will<br> also affect the governance of a nation as well as the scope of human<br> liberty deemed legally permissible.”</br></br></br></br></i></p><p>What Trimnell fails to realize here is that he is inadvertently attempting to undermine everything from insurance premiums to science and human reason, which I would characterize as a profoundly unconservative act.  Due to its false foundations, his “conservatism” is not only neither rational nor coherent, it is more firmly in accordance with the egalitarian ideals of the French Revolution than anything that can be credibly identified with conservative thought dating back to Athens.</p><p>Once he claims that “Conservatism is for men as well as women–and for people of all races and ethnicities”, it should be eminently clear that he is unwittingly preaching the same sort of revolutionary equalitarian nonsense that real conservatives, who have always understood that there are fundamental differences of race and culture, have rejected for centuries.  It is pure equalitarianism, which is based on an intellectual foundation every bit as credible and materially substantive as unicornology and leprechaunics.</p><p>As for fighting tribal politics, I would submit that they cannot be understood, much less engaged, without becoming what he describes as “racist” and what I would describe as “scientifically and historically observant” or even “sub-speciesist”.  It is a little ironic that men like Mr. Trimnell are still trying to argue that race does not exist when genetic science has demonstrated that humanity is not even made up of the same sub-species.  As it no doubt justifies its own detailed debate, I shall set aside, for now, the obvious observation that to not be sub-speciesist is absolutely and necessarily equivalent to denying human evolution.</p><p>In summary, I recommend Spengler, the real Spengler, to Mr. Trimnell, as well as Aristotle’s Rhetoric, as a corrective.  He is an intelligent man, so I have little doubt that even a modicum of exposure to such classic works will prove an effective palliative to the equalitarian propaganda in which he, like me and most of the readers here, was steeped throughout his intellectually formative years.</p><p>Since I am not a phony conservative, or indeed, a conservative of any kind, I hope that Mr. Trimnell will understand my concern for any potentially negative effect upon the “conservative” movement is a matter of complete and utter indifference to me.  I should also note that  for once, I am in complete accordance with Mr. Trimnell’s commenter, as Hunt correctly notes: “I think it’s important to say that you should not feel as if you are in<br> any way obligated to account for anything VD happens to think or say….<br> VD would<br> probably not pledge any allegiance to the conservatism that you support.”</br></br></br></p><p>I am, of course, entirely willing to defend my positions from Mr. Trimnell’s assertions, be they reasonable and compelling or not.  I hope it is readily apparent that I am only attacking what I see as the deficiencies in his ideas, not his character.</p></div>",
  "content_text": "Ed Trimnell is operating from a fundamentally flawed logical foundation\nin his defense\nof what he calls conservatism:\nToday I read a piece on Vox Day’s blog, entitled “Women ruin everything.” (Vox Day bills himself as a conservative.)\nLeaving the title aside, most of the blog post deals with the excesses of the radical gender  politics that have arisen in collegiate sports since the passage of Title IX. In other words: the excesses of leftwing, political feminism. This portion of the post is generally reasonable, and generally conservative.\nBut then Vox ends his post with a non sequitur:\n“Do you really think it was an accident that women were never permitted any voice in the governance of the Roman Republic or the great historical democracies such as Athens, Thebes, Imperial Britain, and Revolutionary America?  Do you really believe it to be a mere coincidence that many modern democracies, including Germany, Italy, and the member states of the European Union, were not able to survive even 100 years of female suffrage?”\nWhat about Jeane Kirkpatrick–and Margaret Thatcher? Would Vox seriously deny these women the vote? (A true conservative would not apportion any political privileges or penalties based on race or gender. Once again–that is the game of the Left and the Democratic Party.)\nThe implication in Vox’s post is that members of one gender are inherently wiser than those of the other. And there is one gender which–by virtue of being that gender–“ruins everything,” in his words.\nThis is exactly what the radical feminists say–only in reverse.\nConservatives cannot fight irrational gender politics by becoming sexists ourselves, just as we cannot fight the tribal politics of the race card by becoming racists. Conservatism is for men as well as women–and for people of all races and ethnicities. (Let us not forget that most of the welfare states in Europe are essentially the creations of white males, while there are some fairly astute Asian capitalists. And yes–some of them are women.)\nThe logical flaws in Vox’s “Women ruin everything” post are obvious. What is not so obvious is how this sort of rhetoric plays into the hands of Obama and the Obamaites.\nOne phony conservative can do more damage to the conservative movement than all the prattling leftwing lemmings on The Daily Kos and John Scalzi’s Whatever combined.\nI will begin by pointing out that Mr. Trimnell’s reasoning is generally sound, as evidenced by\nhis observations concerning the material difference\nbetween Vox Popoli and the warren that is Whatever.  However, his reasoning happens to go significantly awry here because it is built upon false foundations and erroneous assumptions.\nFirst, I do not bill myself as a conservative.  I am not a conservative.  Neither am I a Republican.  I have never claimed to be either since I first began writing political op/ed in 2001.  While I did briefly belong to the Young Republicans in 1988 and attended both the national convention in Houston as well as the inaugural ball, I have never voted for a Republican for President. To the best of my recollection I registered as a Libertarian in 1992 and have only ever voted for Libertarian presidential candidates.  It may be worth noting that my blog is\nrepeatedly listed\nas one of the\ntop libertarian sites\nand my positions on the drug war, the foreign wars, immigration, the banks, and free trade, among many others, are considerably different than the conventional conservative positions.\nSecond, the connection between the observed and incoherent evils of Title IX and female suffrage is far from a non sequitur.  It may be ironic and unexpected that feminism can ruin even the most notable fruits of feminism, but it was both anticipated and predicted by many brilliant past writers that women’s suffrage would bring about both “the despotism of the petticoat” better known today as liberal fascism as well as the eventual demise of those societies that were foolish enough to embrace it.\nIn answer to his question, I would absolutely deny women such as Jeanne Kirkpatrick and Margaret Thatcher the vote if the responsibility was given to me.  (It may interest some to know that I’ve actually met both women; I even have a picture of me with Mrs. Kirkpatrick around here somewhere.)  While Mrs. Thatcher was a great woman of genuine courage, she betrayed her country in the end.  And she did so for the very reason women would not be permitted to vote in any society that wishes to sustain itself: she was taken in by the lies of dishonest men.\n“We had to learn the hard way that by agreement to what were\napparently empty generalizations or vague aspirations we were later held\nto have committed ourselves to political structures which were contrary\nto our interests.”\n– Lady Margaret Thatcher, “The Downing Street Years”\nThird, while one “gender” is not wiser than the other, gender being a grammatical construct, it is an observable, provable, statistical, and scientific fact that the two sexes possess different brain structures, different thought patterns, different hormonal balances, and different time-preferences.  By a timely coincidence,\nI happened to address this very subject on Alpha Game\nearlier today.\n“[I]f one is able to understand how women’s cumulative socio-sexual\npreferences affect the housing market and the economy, how is it\npossible that one is not able to understand that those preferences will\nalso affect the governance of a nation as well as the scope of human\nliberty deemed legally permissible.”\nWhat Trimnell fails to realize here is that he is inadvertently attempting to undermine everything from insurance premiums to science and human reason, which I would characterize as a profoundly unconservative act.  Due to its false foundations, his “conservatism” is not only neither rational nor coherent, it is more firmly in accordance with the egalitarian ideals of the French Revolution than anything that can be credibly identified with conservative thought dating back to Athens.\nOnce he claims that “Conservatism is for men as well as women–and for people of all races and ethnicities”, it should be eminently clear that he is unwittingly preaching the same sort of revolutionary equalitarian nonsense that real conservatives, who have always understood that there are fundamental differences of race and culture, have rejected for centuries.  It is pure equalitarianism, which is based on an intellectual foundation every bit as credible and materially substantive as unicornology and leprechaunics.\nAs for fighting tribal politics, I would submit that they cannot be understood, much less engaged, without becoming what he describes as “racist” and what I would describe as “scientifically and historically observant” or even “sub-speciesist”.  It is a little ironic that men like Mr. Trimnell are still trying to argue that race does not exist when genetic science has demonstrated that humanity is not even made up of the same sub-species.  As it no doubt justifies its own detailed debate, I shall set aside, for now, the obvious observation that to not be sub-speciesist is absolutely and necessarily equivalent to denying human evolution.\nIn summary, I recommend Spengler, the real Spengler, to Mr. Trimnell, as well as Aristotle’s Rhetoric, as a corrective.  He is an intelligent man, so I have little doubt that even a modicum of exposure to such classic works will prove an effective palliative to the equalitarian propaganda in which he, like me and most of the readers here, was steeped throughout his intellectually formative years.\nSince I am not a phony conservative, or indeed, a conservative of any kind, I hope that Mr. Trimnell will understand my concern for any potentially negative effect upon the “conservative” movement is a matter of complete and utter indifference to me.  I should also note that  for once, I am in complete accordance with Mr. Trimnell’s commenter, as Hunt correctly notes: “I think it’s important to say that you should not feel as if you are in\nany way obligated to account for anything VD happens to think or say….\nVD would\nprobably not pledge any allegiance to the conservatism that you support.”\nI am, of course, entirely willing to defend my positions from Mr. Trimnell’s assertions, be they reasonable and compelling or not.  I hope it is readily apparent that I am only attacking what I see as the deficiencies in his ideas, not his character.",
  "tags": [
    "politics",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-30T14:30:00+00:00"
}