{
  "url": "https://voxday.net/2013/01/16/impeach-obama-2/",
  "scraped_at": "2025-12-14T22:17:52.476626",
  "title": "Impeach Obama",
  "date_display": "January 16, 2013",
  "date_iso": "2013-01-16T23:41:00+00:00",
  "date_from_url": "2013-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But much more importantly, DON’T RAISE THE DEBT LIMIT!</p><blockquote class=\"tr_bq\"><p> A second Republican congressman is suggesting that <a href=\"http://dailycaller.com/2013/01/16/second-gop-congressman-suggests-impeachment-over-executive-action-for-gun-control/\">impeachment should be an option</a> as President Barack Obama takes executive action to enact gun control measures. In an interview with Florida’s “The Shark Tank,” Florida Republican Trey Radel addressed Texas Republican Rep. Steve Stockman’s statement that he might seek impeachment if Obama goes forward with executive action to bring about gun control measures.</p><p>“All options should be on the table,” Radel responded.</p><p>Obama announced 23 executive actions during his Wednesday press conference.</p></blockquote><p>Obama should be impeached, although there is no chance that the Democratic Senate would vote to remove him from office even if he barbecued the children he was using to sell his Second Amendment violations in the Rose Garden and ate them in front of the cameras.  But more importantly, he can’t continue his disarmament campaign against the American people if the government is in default.</p><p>I don’t expect the House Republicans to follow through on this, of course, they’ll cave a third time, just as they did before.  But if they actually intended to defend the American people against the metastasizing government in Washington, they would do so.</p><p>What part of “shall not be infringed” does the administration not understand?  It’s not just “Congress shall make no law”.  Unlike the First Amendment, the Second Amendment means the Executive Branch is also barred from taking any actions whatsoever that limit the people’s right to bear arms.  There are no mental health exceptions; these 23 executive dictates collectively amount to straightforward unconstitutional dictatorship.</p></div>",
  "content_text": "But much more importantly, DON’T RAISE THE DEBT LIMIT!\nA second Republican congressman is suggesting that\nimpeachment should be an option\nas President Barack Obama takes executive action to enact gun control measures. In an interview with Florida’s “The Shark Tank,” Florida Republican Trey Radel addressed Texas Republican Rep. Steve Stockman’s statement that he might seek impeachment if Obama goes forward with executive action to bring about gun control measures.\n“All options should be on the table,” Radel responded.\nObama announced 23 executive actions during his Wednesday press conference.\nObama should be impeached, although there is no chance that the Democratic Senate would vote to remove him from office even if he barbecued the children he was using to sell his Second Amendment violations in the Rose Garden and ate them in front of the cameras.  But more importantly, he can’t continue his disarmament campaign against the American people if the government is in default.\nI don’t expect the House Republicans to follow through on this, of course, they’ll cave a third time, just as they did before.  But if they actually intended to defend the American people against the metastasizing government in Washington, they would do so.\nWhat part of “shall not be infringed” does the administration not understand?  It’s not just “Congress shall make no law”.  Unlike the First Amendment, the Second Amendment means the Executive Branch is also barred from taking any actions whatsoever that limit the people’s right to bear arms.  There are no mental health exceptions; these 23 executive dictates collectively amount to straightforward unconstitutional dictatorship.",
  "tags": [
    "gun control",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-16T23:41:00+00:00"
}