{
  "url": "https://voxday.net/2013/01/18/interview-by-speculative-fai/",
  "scraped_at": "2025-12-14T22:17:59.470283",
  "title": "Interview by Speculative Faith",
  "date_display": "January 18, 2013",
  "date_iso": "2013-01-18T09:05:00+00:00",
  "date_from_url": "2013-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>E. Stephen Burnett <a href=\"http://www.speculativefaith.com/2013/01/18/on-the-throne-of-bones-a-q-and-a-with-vox-day/\">interviewed me for the Speculative Faith Blog</a> about <i><b>A THRONE OF BONES</b></i> and various aspects of the novel that some Christians apparently consider to be controversial.</p><p><i><b>ESB: </b>What’s different between Summa Elvetica and your newest novel, A Throne of Bones?</i></p><p><b>Vox Day: </b>About 650 pages, for one thing. Summa Elvetica could be considered a long chapter in the life of one of the perspective characters in A Throne of Bones, the military tribune Marcus Valerius Clericus. In fact, it explains his agnomen, Clericus, which means “priest”. But the real difference is that I learned to stop being clever and to focus on the story instead of the subtext. The Wrath of Angels, for example, is a subtextual spin on the single European currency and the failure of the European elite to replace the pound sterling, but no one has ever picked up on that. I’ve found that the depth of the subtext tends to detract from the natural flow of the story, at least when written by an author of my admittedly limited talents.</p><p>After A Dance with Dragons came out, I was talking with a friend who was as disgusted with that epic disappointment as I was, and he was lamenting that with Martin having gone south, there wasn’t anything worth reading in that genre. I always wanted to write a fat fantasy and figured I couldn’t do all that much worse than Martin had, so I decided I would return to the world of Summa Elvetica. This time, however, I would throw out the intellectual fireworks that no one seemed to notice or care about anyhow and focus solely on writing a good story with strong, memorable characters. I assumed I’d have to self-publish it, but I needed to get Marcher Lord’s permission first since it could be considered a sequel of sorts even though there is absolutely no need to read the earlier novel. All I was looking for was a release and I was shocked when Jeff said he wanted to publish it, even after I warned him that I intended for it to be around 300,000 words. He didn’t blink, not then, and not later when I turned in the 297,500-word manuscript.</p><p>Despite being longer, Throne was much easier to write than Summa. It was exactly 494 days from that first conversation to publication on December 1, 2012. I figured that taking six years to write Dragons hadn’t done Martin any good, so what was the point of dragging the process out? Also, if it was going to be a spectacular failure, the less time I wasted on it, the better.</p><p> <b>ESB: </b><i>Now for the controversial parts. Last week, your editor/publisher Jeff Gerke shared the story behind the novel. In part: “The author felt very strongly that the book needed to have vulgarity (which, he informed me, is different from profanity), nudity, and even sex.” To you, how are vulgarity and profanity different? Which Scriptures have informed your views? Do you think you can write a character saying something you would try not to say?</i></p><p><b>Vox Day: </b>The distinction between profanity and vulgarity is not original to me, anyone can look up the etymology of the words. To be profane is to attack the sacred. To be vulgar is merely to be low and common. Even the most uptight, eagle-eyed Churchian will not find any blasphemy or taking the name of our Lord and Savior in vain; such profanity wouldn’t make any sense in the world of Selenoth. To me, the idea of writing a book where legionaries are anything but low and common in their speech and behavior is so ludicrous that it would be more credible to give them jet packs and laser guns than to delicately avoid showing them drinking themselves insensate at every opportunity, whoring in brothels, bitching about their officers, and jeering at those who betray a physical response to being terrified in battle.</p><p>The verses which influence me on the subject of literary language are Leviticus 19:12, Colossians 3:8, and 1 Peter 3:10. Particularly Colossians 3:8. I find it absurd and bordering on the delusional to see Christians who would never think to object to angry, malicious, and slanderous speech in fiction nevertheless try to use the Bible as a basis for objecting to vulgar language in the mouths of fictional characters. I write about life in a fallen world and I do so as honestly and accurately as I can. I believe that to do otherwise is to be deceitful.</p><p>And yes, I absolutely assert that I can write something that I would never say or even think for myself. The writer is not the character. And the writer whose characters are little more than various reflections of himself is one who lacks imagination, creativity, and basic powers of observation.</p><p> This is merely an excerpt from the interview; read the rest of it <a href=\"http://www.speculativefaith.com/2013/01/18/on-the-throne-of-bones-a-q-and-a-with-vox-day/\">at Speculative Faith</a>.</p></div>",
  "content_text": "E. Stephen Burnett\ninterviewed me for the Speculative Faith Blog\nabout\nA THRONE OF BONES\nand various aspects of the novel that some Christians apparently consider to be controversial.\nESB:\nWhat’s different between Summa Elvetica and your newest novel, A Throne of Bones?\nVox Day:\nAbout 650 pages, for one thing. Summa Elvetica could be considered a long chapter in the life of one of the perspective characters in A Throne of Bones, the military tribune Marcus Valerius Clericus. In fact, it explains his agnomen, Clericus, which means “priest”. But the real difference is that I learned to stop being clever and to focus on the story instead of the subtext. The Wrath of Angels, for example, is a subtextual spin on the single European currency and the failure of the European elite to replace the pound sterling, but no one has ever picked up on that. I’ve found that the depth of the subtext tends to detract from the natural flow of the story, at least when written by an author of my admittedly limited talents.\nAfter A Dance with Dragons came out, I was talking with a friend who was as disgusted with that epic disappointment as I was, and he was lamenting that with Martin having gone south, there wasn’t anything worth reading in that genre. I always wanted to write a fat fantasy and figured I couldn’t do all that much worse than Martin had, so I decided I would return to the world of Summa Elvetica. This time, however, I would throw out the intellectual fireworks that no one seemed to notice or care about anyhow and focus solely on writing a good story with strong, memorable characters. I assumed I’d have to self-publish it, but I needed to get Marcher Lord’s permission first since it could be considered a sequel of sorts even though there is absolutely no need to read the earlier novel. All I was looking for was a release and I was shocked when Jeff said he wanted to publish it, even after I warned him that I intended for it to be around 300,000 words. He didn’t blink, not then, and not later when I turned in the 297,500-word manuscript.\nDespite being longer, Throne was much easier to write than Summa. It was exactly 494 days from that first conversation to publication on December 1, 2012. I figured that taking six years to write Dragons hadn’t done Martin any good, so what was the point of dragging the process out? Also, if it was going to be a spectacular failure, the less time I wasted on it, the better.\nESB:\nNow for the controversial parts. Last week, your editor/publisher Jeff Gerke shared the story behind the novel. In part: “The author felt very strongly that the book needed to have vulgarity (which, he informed me, is different from profanity), nudity, and even sex.” To you, how are vulgarity and profanity different? Which Scriptures have informed your views? Do you think you can write a character saying something you would try not to say?\nVox Day:\nThe distinction between profanity and vulgarity is not original to me, anyone can look up the etymology of the words. To be profane is to attack the sacred. To be vulgar is merely to be low and common. Even the most uptight, eagle-eyed Churchian will not find any blasphemy or taking the name of our Lord and Savior in vain; such profanity wouldn’t make any sense in the world of Selenoth. To me, the idea of writing a book where legionaries are anything but low and common in their speech and behavior is so ludicrous that it would be more credible to give them jet packs and laser guns than to delicately avoid showing them drinking themselves insensate at every opportunity, whoring in brothels, bitching about their officers, and jeering at those who betray a physical response to being terrified in battle.\nThe verses which influence me on the subject of literary language are Leviticus 19:12, Colossians 3:8, and 1 Peter 3:10. Particularly Colossians 3:8. I find it absurd and bordering on the delusional to see Christians who would never think to object to angry, malicious, and slanderous speech in fiction nevertheless try to use the Bible as a basis for objecting to vulgar language in the mouths of fictional characters. I write about life in a fallen world and I do so as honestly and accurately as I can. I believe that to do otherwise is to be deceitful.\nAnd yes, I absolutely assert that I can write something that I would never say or even think for myself. The writer is not the character. And the writer whose characters are little more than various reflections of himself is one who lacks imagination, creativity, and basic powers of observation.\nThis is merely an excerpt from the interview; read the rest of it\nat Speculative Faith\n.",
  "tags": [
    "books",
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-18T09:05:00+00:00"
}