{
  "url": "https://voxday.net/2013/01/23/jared-diamond-and-grass-hut-imperative/",
  "scraped_at": "2025-12-14T22:18:25.552828",
  "title": "Jared Diamond and the Grass Hut Imperative",
  "date_display": "January 23, 2013",
  "date_iso": "2013-01-23T18:19:00+00:00",
  "date_from_url": "2013-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At least there is one left-liberal who is honest about <a href=\"http://www.hoover.org/publications/defining-ideas/article/138501\">his heartfelt desire</a> to return to the Great Grass Hut Matriarchy:</p><blockquote class=\"tr_bq\"><p> ….<i>The World Until Yesterday</i>, a vanity project marketed as anthropology. In this book, Diamond draws from his extensive field research in New Guinea to share his views on the shortcomings of contemporary American society. Primitive approaches to social problems, he thinks, would better serve our society. For example, he argues for: dedicating more resources to mediation as an alternative to civil lawsuits, establishing “conventional monopolies” to smooth out trade fluctuations, deemphasizing competition and the desire for excellence among children, on-demand nursing for infants, spending more time talking to our children, devising new living conditions for the elderly, accepting that the gulf between rich and poor in the United States provides an explanation of the popularity of religion in our country, preserving language diversity, and ending obesity.</p><p>At its core, the book is based on a fundamental contradiction. Diamond explains that the customs of primitive societies are not applicable to the characteristics of our society; then he proceeds to use those customs as the basis for recommendations for improving everything in our society from parenting to diet.</p></blockquote><p>Apparently it’s not enough that we’re basing our trade policy upon early 19th century illogic, our monetary system upon early 20th century fraud, our economic system upon Depression-era nonsense, and our immigration policy upon a play written by a Jewish immigrant to Britain in 1908, Diamond wants us to go all the way back to cannibalism, huts, and throwing rocks at one another.</p><p>What I don’t understand is why?  I mean, they don’t actually ever go and live in Papua New Guinea or Deepest, Darkest Africa themselves, so why do they think that the primitive lifestyles that they favor should be imported and imposed upon the West?</p></div>",
  "content_text": "At least there is one left-liberal who is honest about\nhis heartfelt desire\nto return to the Great Grass Hut Matriarchy:\n….\nThe World Until Yesterday\n, a vanity project marketed as anthropology. In this book, Diamond draws from his extensive field research in New Guinea to share his views on the shortcomings of contemporary American society. Primitive approaches to social problems, he thinks, would better serve our society. For example, he argues for: dedicating more resources to mediation as an alternative to civil lawsuits, establishing “conventional monopolies” to smooth out trade fluctuations, deemphasizing competition and the desire for excellence among children, on-demand nursing for infants, spending more time talking to our children, devising new living conditions for the elderly, accepting that the gulf between rich and poor in the United States provides an explanation of the popularity of religion in our country, preserving language diversity, and ending obesity.\nAt its core, the book is based on a fundamental contradiction. Diamond explains that the customs of primitive societies are not applicable to the characteristics of our society; then he proceeds to use those customs as the basis for recommendations for improving everything in our society from parenting to diet.\nApparently it’s not enough that we’re basing our trade policy upon early 19th century illogic, our monetary system upon early 20th century fraud, our economic system upon Depression-era nonsense, and our immigration policy upon a play written by a Jewish immigrant to Britain in 1908, Diamond wants us to go all the way back to cannibalism, huts, and throwing rocks at one another.\nWhat I don’t understand is why?  I mean, they don’t actually ever go and live in Papua New Guinea or Deepest, Darkest Africa themselves, so why do they think that the primitive lifestyles that they favor should be imported and imposed upon the West?",
  "tags": [
    "books",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-23T18:19:00+00:00"
}