{
  "url": "https://voxday.net/2013/01/27/mailvox-metaphysical-straddle/",
  "scraped_at": "2025-12-14T22:18:48.808781",
  "title": "Mailvox: the metaphysical straddle",
  "date_display": "January 27, 2013",
  "date_iso": "2013-01-27T10:06:00+00:00",
  "date_from_url": "2013-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This discussion with Asher concerning the utility and legitimacy of utilizing both practical and metaphysical arguments was too long for Blogger’s comment system, so I’m giving it its own post.</p><p> <b>I’m not sure what you mean by “that”. Are you saying you never do the metaphysical/practical straddle or that the way you do it isn’t a problem? IF you are offering both metaphysical and practical arguments THEN you are doing the straddle, and the straddle is the problem, in itself.</b></p><p>Earlier you noted that you effortlessly switched back and forth between metaphysical and practical considerations, which looks, to me, like an admission of a straddle. If so, then that is a problem and, if not, could you clarify that statement.</p><p>High IQ does not mean one is able to avoid the straddle problem by being smart, as the straddle IS the problem. Either one makes metaphysical arguments or one does not, and if one does than the entire argument is metaphysical.</p><p> No.  Your core assumption is wrong.  A metaphysical argument does not magically subsume a practical one.  They are two different arguments that happen to concern the same subject.  You are conflating “straddle” and “switch”; you’ve used the term “straddle” in two different ways.  What I do not do is what you correctly claimed many libertarians (and many others) do, switching back and forth between the practical and the metaphysical in order to avoid having their weakest arguments exposed and defeated.  I do not “switch” between the two for that reason.  I utilize both, following my opponent where he goes.</p><p>Where you are correct is that once one RETREATS to the metaphysical, one cannot legitimately return to the defeated practical argument.  But following another’s retreat to the metaphysical in no way invalidates what has already been shown to be a successful practical argument.</p><p><b>The average ability of the ilk is considerably better than that of the average Joe, but most of the ilk do not capable of following you, at least in the way you lead the conversation. It’s not that your reasoning is bad but that it’s too demanding for most of your blog readers, both those that agree and those that disagree.  The ilk are considerably more advanced than the average guy but less advanced than they fancy themselves.</b></p><p>On average?  Of course.  That’s precisely why I repeat myself over and over again.  That’s why I provide illustrative examples.  Those who can, learn, and eventually demonstrate that they can utilize the tactics themselves, often in long debates here in which I don’t involve myself.  Those who can’t follow are at least usually able to appreciate the tactical aspects in both the aesthetic and entertainment senses.  And given that I have repeatedly stepped in and informed people when they were using various tactics improperly, why would you think you are informing me of anything I don’t already know in this regard?</p><p>It’s not difficult to see when someone is attempting to utilize a dialectical device in a rhetorical manner or asserting a nonexistent logical fallacy.  Sometimes people have to experiment and try things out before they get the hang of it.  Sometimes, it is eminently clear they will never be able to do more than bluster and posture.  So be it.  I don’t always get things right myself, as readers like you are always, to your credit, pleased to point out.  However, the other day, I said this blog is not The Following, but it could be reasonably considered to be like that show in that I have helped develop a widespread collection of lethal serial killers in the intellectual sense.  When a member of the Dread Ilk eviscerates the arguments of a friend, or family member, or co-worker using the tactics he has learned here, I am with him in spirit.</p><p> <b>I can use this metaphor. A trap is like a claymore mine. You are a parent and the ilk are your young children. You leave the mine lying around your house in the event of a home invasion and, instead, one of the ilk sets it off and it ruins his day. From where I’m sitting that is what we’d call an “own goal”.</b></p><p>It’s not an applicable metaphor.  The traps are, in almost all situations, triggered by the interlocutor.  It’s more like planting a minefield on a battlefield and I am the only soldier on the one side, outnumbered though not outgunned.  The civilians are safe.  The other side, well, one of them will probably step on a mine.  And even if a civilian decides to come onto the field and inadvertently sets one off, well, hopefully it will be a learning experience for him and everyone who witnessed it.  The traps are only set to catch those who are determined to be blindly critical at all costs.</p><p> <b>The only way that setting traps is always a good thing is when there is no audience or where you know the audience is on your level of intellect. Most of the ilk are likely to misuse most of your traps most of the time.</b></p><p>Totally disagree and would go so far to assert that your perspective is solely tactical and fails to even begin to take the strategic aspects into account.  The traps are set, in part, for the benefit of the audience, who tend to find them more than a little entertaining in operation.  For example, I suspect Allyn was at least mildly amused when she commented: <i>Vox claims “For my next trick I will make the rabbits appear and then dance and hop on one foot”.  On<br> command the rabbits appear, raging at Vox for being a Nazi, homophobic,<br> poopy head that is not smarter than them.  What they seem to miss is<br> they are doing this while dancing and hopping on one foot.”</br></br></br></i></p><p>Now I agree that most people, including the many of the Dread Ilk, don’t have the ability to effectively lay traps for critics.  The capacity for constructing them requires a psychological inclination as well as the ability to utilize a dialectical device with rhetorical ramifications.  That’s all right, it is only one of many techniques and is primarily useful for someone like me, who has hundreds, if not thousands, of critics eager to attack him at every sign of weakness or error.  By displaying false signs, I can take out most of them and demonstrate that their criticism is both superficial and baseless with very little effort.  Your average person who is not a critical target has considerably less need of any such device.  As Allyn observes, I can come right out and announce that I am doing this, just as I am doing here, and it won’t even slow down the speed with which the average rabbit will plunge his head into the shining wire.</p><p>Some may consider this to be sadistic, but my view is that if you are aware someone harbors a negative attitude towards you and is inclined to attack you at the earliest opportunity, they entirely merit whatever consequences result from their predictable behavior.</p><p> <b>If they are harmonious then you only need to use one and the other is redundant. If anyone uses two the odds of them being harmonious is, to put it charitably, very thin. The entire reason that people do the straddle is that they use one set of arguments to cover for weaknesses in the other set and vice versa.</b></p><p>You’re incorrect; you’re again conflating straddle and switch.  I utilize both levels in order to expose that both levels of the critic’s arguments are wrong and thereby render the switch useless.  You’re completely failing to understand how the game is actually played in favor of some imaginary, metaphysical version of it.</p><p> <b>Another metaphor I can use. If day after day an army takes the field, gets defeated and then retreats to higher ground then there is something wrong with the field officers. The obvious strategy would be to stick to where one can win and not continue sallying forth onto ground where one keeps being defeated.</b></p><p>Another bad metaphor.  First I defeat them on the lower ground.  They retreat.  Then I defeat them on the higher ground.  At which point they usually abandon the battlefield altogether.  You know perfectly well that is the usual pattern observed here.  With, of course, the exception of the anklebiters of the world, who sally forth to defeat again, and again, and again, much to the amusement of many.  I don’t mind them most of the time.  It take absolutely no effort to keep swatting down their arguments.</p><p> <b>That just doesn’t make any sense. If one has already won on the field of battle then one doesn’t *need* to retreat.</b></p><p>You’re missing the point.  I’m not retreating.  I’m following up the successful defense with a counterattack.  Here is how it almost always works.  I post something.  My statements are attacked on factual grounds.  I defeat the factual argument.  The interlocutor retreats and attempts to justify his now-defeated practical argument with a metaphysical one.  I then launch an attack on his metaphysical argument.  That defeated, he runs away.  We’ve seen this process again, and again, and again, have we not?</p><p>I’m not switching anything.  I haven’t given up one iota of my practical argument or the ground I am defending.  I’m simply moving onto the other side’s ground and taking that away from him too.</p><p> <b>If you find yourself doing the straddle that indicates that you are faced with an intractable foe, and many in the audience are also likely to be intractable foes. </b></p><p>Of course.  This is hardly news.  I’ve been getting death threats, having book contracts paid off, and seeing my job, my music, and my books attacked for 12 years now.  And yet, my audience keeps growing, the Dread Ilk continue to become more capable, and my abilities continue to develop.</p><p> <b>There are two ways to take this observation. Either you already convinced a bunch of Bush Republicans to join Team Vox or you just admitted to an own goal. Chasing people away is likely to decrease the chances of their joining your team.</b></p><p>If you’ve been around here for as long as you said, you already know the answer to this question.  The people who are chased away tend to be the apparently intractable ones, and even some of them don’t stay chased away.  Will they ever join the team of truth, reason, and freedom?  I have known a few who have.  But it is not for me to say if my actions have changed anyone’s minds.  And it’s not Team Vox, it is Team Truth.  I don’t dictate anything, I simply follow the truth, and The Truth, as best I understand it and as well as my limitations will permit.</p></div>",
  "content_text": "This discussion with Asher concerning the utility and legitimacy of utilizing both practical and metaphysical arguments was too long for Blogger’s comment system, so I’m giving it its own post.\nI’m not sure what you mean by “that”. Are you saying you never do the metaphysical/practical straddle or that the way you do it isn’t a problem? IF you are offering both metaphysical and practical arguments THEN you are doing the straddle, and the straddle is the problem, in itself.\nEarlier you noted that you effortlessly switched back and forth between metaphysical and practical considerations, which looks, to me, like an admission of a straddle. If so, then that is a problem and, if not, could you clarify that statement.\nHigh IQ does not mean one is able to avoid the straddle problem by being smart, as the straddle IS the problem. Either one makes metaphysical arguments or one does not, and if one does than the entire argument is metaphysical.\nNo.  Your core assumption is wrong.  A metaphysical argument does not magically subsume a practical one.  They are two different arguments that happen to concern the same subject.  You are conflating “straddle” and “switch”; you’ve used the term “straddle” in two different ways.  What I do not do is what you correctly claimed many libertarians (and many others) do, switching back and forth between the practical and the metaphysical in order to avoid having their weakest arguments exposed and defeated.  I do not “switch” between the two for that reason.  I utilize both, following my opponent where he goes.\nWhere you are correct is that once one RETREATS to the metaphysical, one cannot legitimately return to the defeated practical argument.  But following another’s retreat to the metaphysical in no way invalidates what has already been shown to be a successful practical argument.\nThe average ability of the ilk is considerably better than that of the average Joe, but most of the ilk do not capable of following you, at least in the way you lead the conversation. It’s not that your reasoning is bad but that it’s too demanding for most of your blog readers, both those that agree and those that disagree.  The ilk are considerably more advanced than the average guy but less advanced than they fancy themselves.\nOn average?  Of course.  That’s precisely why I repeat myself over and over again.  That’s why I provide illustrative examples.  Those who can, learn, and eventually demonstrate that they can utilize the tactics themselves, often in long debates here in which I don’t involve myself.  Those who can’t follow are at least usually able to appreciate the tactical aspects in both the aesthetic and entertainment senses.  And given that I have repeatedly stepped in and informed people when they were using various tactics improperly, why would you think you are informing me of anything I don’t already know in this regard?\nIt’s not difficult to see when someone is attempting to utilize a dialectical device in a rhetorical manner or asserting a nonexistent logical fallacy.  Sometimes people have to experiment and try things out before they get the hang of it.  Sometimes, it is eminently clear they will never be able to do more than bluster and posture.  So be it.  I don’t always get things right myself, as readers like you are always, to your credit, pleased to point out.  However, the other day, I said this blog is not The Following, but it could be reasonably considered to be like that show in that I have helped develop a widespread collection of lethal serial killers in the intellectual sense.  When a member of the Dread Ilk eviscerates the arguments of a friend, or family member, or co-worker using the tactics he has learned here, I am with him in spirit.\nI can use this metaphor. A trap is like a claymore mine. You are a parent and the ilk are your young children. You leave the mine lying around your house in the event of a home invasion and, instead, one of the ilk sets it off and it ruins his day. From where I’m sitting that is what we’d call an “own goal”.\nIt’s not an applicable metaphor.  The traps are, in almost all situations, triggered by the interlocutor.  It’s more like planting a minefield on a battlefield and I am the only soldier on the one side, outnumbered though not outgunned.  The civilians are safe.  The other side, well, one of them will probably step on a mine.  And even if a civilian decides to come onto the field and inadvertently sets one off, well, hopefully it will be a learning experience for him and everyone who witnessed it.  The traps are only set to catch those who are determined to be blindly critical at all costs.\nThe only way that setting traps is always a good thing is when there is no audience or where you know the audience is on your level of intellect. Most of the ilk are likely to misuse most of your traps most of the time.\nTotally disagree and would go so far to assert that your perspective is solely tactical and fails to even begin to take the strategic aspects into account.  The traps are set, in part, for the benefit of the audience, who tend to find them more than a little entertaining in operation.  For example, I suspect Allyn was at least mildly amused when she commented:\nVox claims “For my next trick I will make the rabbits appear and then dance and hop on one foot”.  On\ncommand the rabbits appear, raging at Vox for being a Nazi, homophobic,\npoopy head that is not smarter than them.  What they seem to miss is\nthey are doing this while dancing and hopping on one foot.”\nNow I agree that most people, including the many of the Dread Ilk, don’t have the ability to effectively lay traps for critics.  The capacity for constructing them requires a psychological inclination as well as the ability to utilize a dialectical device with rhetorical ramifications.  That’s all right, it is only one of many techniques and is primarily useful for someone like me, who has hundreds, if not thousands, of critics eager to attack him at every sign of weakness or error.  By displaying false signs, I can take out most of them and demonstrate that their criticism is both superficial and baseless with very little effort.  Your average person who is not a critical target has considerably less need of any such device.  As Allyn observes, I can come right out and announce that I am doing this, just as I am doing here, and it won’t even slow down the speed with which the average rabbit will plunge his head into the shining wire.\nSome may consider this to be sadistic, but my view is that if you are aware someone harbors a negative attitude towards you and is inclined to attack you at the earliest opportunity, they entirely merit whatever consequences result from their predictable behavior.\nIf they are harmonious then you only need to use one and the other is redundant. If anyone uses two the odds of them being harmonious is, to put it charitably, very thin. The entire reason that people do the straddle is that they use one set of arguments to cover for weaknesses in the other set and vice versa.\nYou’re incorrect; you’re again conflating straddle and switch.  I utilize both levels in order to expose that both levels of the critic’s arguments are wrong and thereby render the switch useless.  You’re completely failing to understand how the game is actually played in favor of some imaginary, metaphysical version of it.\nAnother metaphor I can use. If day after day an army takes the field, gets defeated and then retreats to higher ground then there is something wrong with the field officers. The obvious strategy would be to stick to where one can win and not continue sallying forth onto ground where one keeps being defeated.\nAnother bad metaphor.  First I defeat them on the lower ground.  They retreat.  Then I defeat them on the higher ground.  At which point they usually abandon the battlefield altogether.  You know perfectly well that is the usual pattern observed here.  With, of course, the exception of the anklebiters of the world, who sally forth to defeat again, and again, and again, much to the amusement of many.  I don’t mind them most of the time.  It take absolutely no effort to keep swatting down their arguments.\nThat just doesn’t make any sense. If one has already won on the field of battle then one doesn’t *need* to retreat.\nYou’re missing the point.  I’m not retreating.  I’m following up the successful defense with a counterattack.  Here is how it almost always works.  I post something.  My statements are attacked on factual grounds.  I defeat the factual argument.  The interlocutor retreats and attempts to justify his now-defeated practical argument with a metaphysical one.  I then launch an attack on his metaphysical argument.  That defeated, he runs away.  We’ve seen this process again, and again, and again, have we not?\nI’m not switching anything.  I haven’t given up one iota of my practical argument or the ground I am defending.  I’m simply moving onto the other side’s ground and taking that away from him too.\nIf you find yourself doing the straddle that indicates that you are faced with an intractable foe, and many in the audience are also likely to be intractable foes.\nOf course.  This is hardly news.  I’ve been getting death threats, having book contracts paid off, and seeing my job, my music, and my books attacked for 12 years now.  And yet, my audience keeps growing, the Dread Ilk continue to become more capable, and my abilities continue to develop.\nThere are two ways to take this observation. Either you already convinced a bunch of Bush Republicans to join Team Vox or you just admitted to an own goal. Chasing people away is likely to decrease the chances of their joining your team.\nIf you’ve been around here for as long as you said, you already know the answer to this question.  The people who are chased away tend to be the apparently intractable ones, and even some of them don’t stay chased away.  Will they ever join the team of truth, reason, and freedom?  I have known a few who have.  But it is not for me to say if my actions have changed anyone’s minds.  And it’s not Team Vox, it is Team Truth.  I don’t dictate anything, I simply follow the truth, and The Truth, as best I understand it and as well as my limitations will permit.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-27T10:06:00+00:00"
}