{
  "url": "https://voxday.net/2013/01/20/mcrapey-and-male-privilege/",
  "scraped_at": "2025-12-14T22:18:07.548489",
  "title": "McRapey exercises his male privilege",
  "date_display": "January 20, 2013",
  "date_iso": "2013-01-20T11:24:00+00:00",
  "date_from_url": "2013-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a quixotic choice, to be sure, but I suppose we all have our issues.  Apparently <a href=\"http://whatever.scalzi.com/2012/10/25/a-fan-letter-to-certain-conservative-politicians/\">confessing to being a rapist</a> isn’t enough for John Scalzi, as the male-privileged SFWA President has now taken it upon himself <a href=\"http://whatever.scalzi.com/2012/12/13/some-thoughts-on-the-pose-off-between-jim-c-hines-and-me/\">to publicly mock women for the sort of covers they prefer to see</a> on the books they write and buy.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.sff.net/people/jchines/Pics/Scalzi%20Night.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"147\" src=\"http://www.sff.net/people/jchines/Pics/Scalzi%20Night.jpg\" width=\"200\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.sff.net/people/jchines/Pics/Scalzi%20Night.jpg\" decoding=\"async\" height=\"147\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20200%20147%22%3E%3C/svg%3E\" width=\"200\"/></a></div><p><i>“The pose-off, while for charity, has its genesis in Jim taking pictures of himself in the poses that science fiction and fantasy book covers often put women in to call attention to the point that these positions are absurd (whereas the positions men are put in on covers are generally substantially less so).”</i></p><p> The irony, as I noted at Alpha Game, is that what Scalzi and Hines are mocking in their <a href=\"http://alphagameplan.blogspot.ch/2013/01/gammas-dont-get-girls.html\">gamma male cluelessness</a> about women is not male sexism, but rather, female preferences.  The book whose “sexism” and “objectification” Scalzi is protesting in the photo above happens to be THE TASTE OF NIGHT, by Vicki Pettersson.  It is described thusly:</p><p>“<i>Equal parts Light and Shadow, Joanna Archer must fulfill a destiny she<br> never wanted. Once a photographer and heiress to a casino fortune, she<br> is now dedicated to the cause of good . . . but susceptible to the<br> seductions of evil.” </br></br></br></i></p><p>An heiress who is susceptible to seduction and bears no responsibility for her actions… does this sound more like a science fiction novel intended to appeal to men or a romance novel aimed at a female audience?  As it happens, THE TASTE OF NIGHT<br> has 47 reviews, by Jenna, Rita, Angela, Courtney, Phyllis, Jessica,<br> Patience, Rhona, Kelley, Kelly, Shalonda, Chica, Karissa, Michelle,<br> Debra, and Susan, among others.  Since Pettersson is, we are informed, a New York Times bestselling author, it should be obvious that her work, and the cover of her book that John Scalzi is lampooning, (which you can download as wallpaper in various formats <a href=\"http://www.vickipettersson.com/books/the-signs-of-the-zodiac/the-taste-of-night/\">from her website</a> should you be so inclined), are very popular with women and appeal to female tastes.</br></br></br></p><p>The fact is that it is not men, but women, who are drawn to pictures of women posed in this manner.  Men, as a rule, like to look at young, pretty, naked, feminine, women posing with their breasts and buttocks on display, not thick, thirty-something man-jawed women wearing clothes, brandishing weapons, and striking aggressive and unlikely power-poses.  The urban fantasy/paranormal market that distinguishes itself from high fantasy, epic fantasy, and science fiction by utilizing such imagery is predominantly female.  It is women to whom such covers are designed to appeal, it is women to whom such books are sold, and by mocking those covers, John Scalzi and Jim Hines are exercising their male privilege to mock the women who write urban fantasy books as well as the women who buy them.</p><p>Now, there is nothing wrong with mocking the books on the grounds of literary quality or their covers on the grounds of aesthetics.  But to mock them with the mistaken impression that one is striking a blow against male sexism is not only to insult female preferences, it is to betray a fundamental misunderstanding of human socio-sexuality so profound that it should be no surprise that it took a pair of male science fiction writers to do it.</p><p>Perhaps the most amusing thing is that even after progressive women <a href=\"http://thinkprogress.org/alyssa/2012/12/13/1331171/jim-hines-john-scalzi-gender-swapping-superheroes/\">questioned their actions</a>, prompting a little belated self-reflection, it is abundantly clear that they <a href=\"http://www.jimchines.com/2012/12/wait-what-were-we-laughing-at/\">still don’t get it</a>. I doubt I’m the only one to wonder if Jim Hines was initially inspired to launch his campaign after getting caught by his wife taking pictures of himself in her lingerie.</p><p>“No, honey, I don’t LIKE wearing your underwear, I’m just, um, protesting the objectifying of women in science fiction!  It’s, ah, for charity!”</p><p>And just to address the usual suspects, I will freely confess that jealousy is the only reason I am posting this.  I doubt that I could ever aspire to the transcendent gamma sex appeal that shines so gloriously from the image above.</p></div>",
  "content_text": "It’s a quixotic choice, to be sure, but I suppose we all have our issues.  Apparently\nconfessing to being a rapist\nisn’t enough for John Scalzi, as the male-privileged SFWA President has now taken it upon himself\nto publicly mock women for the sort of covers they prefer to see\non the books they write and buy.\n“The pose-off, while for charity, has its genesis in Jim taking pictures of himself in the poses that science fiction and fantasy book covers often put women in to call attention to the point that these positions are absurd (whereas the positions men are put in on covers are generally substantially less so).”\nThe irony, as I noted at Alpha Game, is that what Scalzi and Hines are mocking in their\ngamma male cluelessness\nabout women is not male sexism, but rather, female preferences.  The book whose “sexism” and “objectification” Scalzi is protesting in the photo above happens to be THE TASTE OF NIGHT, by Vicki Pettersson.  It is described thusly:\n“\nEqual parts Light and Shadow, Joanna Archer must fulfill a destiny she\nnever wanted. Once a photographer and heiress to a casino fortune, she\nis now dedicated to the cause of good . . . but susceptible to the\nseductions of evil.”\nAn heiress who is susceptible to seduction and bears no responsibility for her actions… does this sound more like a science fiction novel intended to appeal to men or a romance novel aimed at a female audience?  As it happens, THE TASTE OF NIGHT\nhas 47 reviews, by Jenna, Rita, Angela, Courtney, Phyllis, Jessica,\nPatience, Rhona, Kelley, Kelly, Shalonda, Chica, Karissa, Michelle,\nDebra, and Susan, among others.  Since Pettersson is, we are informed, a New York Times bestselling author, it should be obvious that her work, and the cover of her book that John Scalzi is lampooning, (which you can download as wallpaper in various formats\nfrom her website\nshould you be so inclined), are very popular with women and appeal to female tastes.\nThe fact is that it is not men, but women, who are drawn to pictures of women posed in this manner.  Men, as a rule, like to look at young, pretty, naked, feminine, women posing with their breasts and buttocks on display, not thick, thirty-something man-jawed women wearing clothes, brandishing weapons, and striking aggressive and unlikely power-poses.  The urban fantasy/paranormal market that distinguishes itself from high fantasy, epic fantasy, and science fiction by utilizing such imagery is predominantly female.  It is women to whom such covers are designed to appeal, it is women to whom such books are sold, and by mocking those covers, John Scalzi and Jim Hines are exercising their male privilege to mock the women who write urban fantasy books as well as the women who buy them.\nNow, there is nothing wrong with mocking the books on the grounds of literary quality or their covers on the grounds of aesthetics.  But to mock them with the mistaken impression that one is striking a blow against male sexism is not only to insult female preferences, it is to betray a fundamental misunderstanding of human socio-sexuality so profound that it should be no surprise that it took a pair of male science fiction writers to do it.\nPerhaps the most amusing thing is that even after progressive women\nquestioned their actions\n, prompting a little belated self-reflection, it is abundantly clear that they\nstill don’t get it\n. I doubt I’m the only one to wonder if Jim Hines was initially inspired to launch his campaign after getting caught by his wife taking pictures of himself in her lingerie.\n“No, honey, I don’t LIKE wearing your underwear, I’m just, um, protesting the objectifying of women in science fiction!  It’s, ah, for charity!”\nAnd just to address the usual suspects, I will freely confess that jealousy is the only reason I am posting this.  I doubt that I could ever aspire to the transcendent gamma sex appeal that shines so gloriously from the image above.",
  "tags": [
    "Alpha Game",
    "McRapey",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-20T11:24:00+00:00"
}