{
  "url": "https://voxday.net/2013/01/04/more-questions-at-sandy-hook/",
  "scraped_at": "2025-12-14T22:16:54.278273",
  "title": "More questions at Sandy Hook",
  "date_display": "January 4, 2013",
  "date_iso": "2013-01-04T19:14:00+00:00",
  "date_from_url": "2013-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lanza didn’t even <a href=\"http://digitaljournal.com/article/340113\">have an assault rifle</a>:</p><blockquote class=\"tr_bq\"><div class=\"body\"> After two weeks of media reports that a .223 AR-15<br> Bushmaster was found in the trunk of Lanza’s car, gun aficionados point<br> out that the rifle is not a Bushmaster, nor even an AR-class assault<br> weapon. Gun experts say that the weapon shown in an NBC News report is some kind of shotgun. </br></br></br></div><div class=\"body\"></div><div class=\"body\"> Another interesting aspect of the news report pointed out by law<br> enforcement commenters is that the officer seems to be completely<br> mishandling evidence, possibly destroying valuable fingerprints and<br> other clues.  Law enforcement commenters have indicated that proper<br> procedure might call for the trunk being sealed with evidence tape and<br> the entire car transported to a main crime lab for examination and<br> evidence gathering, such as dusting for prints.<br> This follows a bewildering change of story from the authorities as to what weapons were actually used in the shooting.</br></br></br></br></br></br></br></div></blockquote><div class=\"body\"> At<br> this point, I think it is perfectly reasonable to question if Lanza had<br> anything to do with the shootings beyond being one of the victims of<br> the real shooters.  But what about <a href=\"http://www.youtube.com/watch?v=cKWgCRBR5qE&amp;list=PLNNEcJPmlWdzVjsSqHZAyYcE_ZLvvbtvv&amp;index=8\">those grief-stricken parents</a>? <br> And why is the media still going on about assault rifles when they have<br> nothing to do with what supposedly happened at Sandy Hook?</br></br></br></br></br></div><p>I<br> was entirely willing to reserve judgment, but the inexplicable<br> anomalies are rapidly piling up again.  The pattern is readily apparent<br> and given the facts at hand, Occam’s Razor increasingly suggests a false<br> flag.  I don’t understand why anyone finds it hard to believe there are<br> elements in the US government who don’t hesitate to murder US citizens,<br> given that the Obama administration <i>openly asserts its legal right </i>to kill citizens at will without due process.</br></br></br></br></br></br></p><p>Let’s engage in a little outlandish legal conjecture and assume that the shootings were real.  What, one wonders, would have prevented the administration from legally placing the<br> children of Sandy Hook elementary school on its secret kill list and then ordering their assassination?</br></p></div>",
  "content_text": "Lanza didn’t even\nhave an assault rifle\n:\nAfter two weeks of media reports that a .223 AR-15\nBushmaster was found in the trunk of Lanza’s car, gun aficionados point\nout that the rifle is not a Bushmaster, nor even an AR-class assault\nweapon. Gun experts say that the weapon shown in an NBC News report is some kind of shotgun.\nAnother interesting aspect of the news report pointed out by law\nenforcement commenters is that the officer seems to be completely\nmishandling evidence, possibly destroying valuable fingerprints and\nother clues.  Law enforcement commenters have indicated that proper\nprocedure might call for the trunk being sealed with evidence tape and\nthe entire car transported to a main crime lab for examination and\nevidence gathering, such as dusting for prints.\nThis follows a bewildering change of story from the authorities as to what weapons were actually used in the shooting.\nAt\nthis point, I think it is perfectly reasonable to question if Lanza had\nanything to do with the shootings beyond being one of the victims of\nthe real shooters.  But what about\nthose grief-stricken parents\n?\nAnd why is the media still going on about assault rifles when they have\nnothing to do with what supposedly happened at Sandy Hook?\nI\nwas entirely willing to reserve judgment, but the inexplicable\nanomalies are rapidly piling up again.  The pattern is readily apparent\nand given the facts at hand, Occam’s Razor increasingly suggests a false\nflag.  I don’t understand why anyone finds it hard to believe there are\nelements in the US government who don’t hesitate to murder US citizens,\ngiven that the Obama administration\nopenly asserts its legal right\nto kill citizens at will without due process.\nLet’s engage in a little outlandish legal conjecture and assume that the shootings were real.  What, one wonders, would have prevented the administration from legally placing the\nchildren of Sandy Hook elementary school on its secret kill list and then ordering their assassination?",
  "tags": [
    "conspiracy",
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-04T19:14:00+00:00"
}