{
  "url": "https://voxday.net/2013/01/15/obama-bypasses-congress/",
  "scraped_at": "2025-12-14T22:17:45.740266",
  "title": "Obama bypasses Congress",
  "date_display": "January 15, 2013",
  "date_iso": "2013-01-15T18:00:00+00:00",
  "date_from_url": "2013-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The totalitarians don’t have the votes to disarm America, so they’re going to try <a href=\"http://www.politico.com/story/2013/01/biden-guns-executive-actions-86187.html?hp=t1_3\">to bypass the democratic process</a> by utilizing Obama and a collection of unconstitutional executive orders.</p><blockquote class=\"tr_bq\"><p> The White House has identified 19 executive actions for President Barack Obama to move unilaterally on <a href=\"http://www.politico.com/tag/guncontrol\" rel=\"noopener\" target=\"_blank\">gun control</a>,<br> Vice President Joe Biden told a group of House Democrats on Monday, the<br> administration’s first definitive statements about its response to last<br> month’s mass shooting at Sandy Hook Elementary School.</br></br></br></p></blockquote><p>Let’s see them try it.  If nothing else, it might put an end to the use of executive orders.  More likely, it will explode the last tattered vestiges of the veil that disguises the dictatorial nature of the ruling oligarchy in Washington DC.</p><p>And yes, I know Republicans have used executive orders too.  That’s because they’re part of the problem, not the solution.</p></div>",
  "content_text": "The totalitarians don’t have the votes to disarm America, so they’re going to try\nto bypass the democratic process\nby utilizing Obama and a collection of unconstitutional executive orders.\nThe White House has identified 19 executive actions for President Barack Obama to move unilaterally on\ngun control\n,\nVice President Joe Biden told a group of House Democrats on Monday, the\nadministration’s first definitive statements about its response to last\nmonth’s mass shooting at Sandy Hook Elementary School.\nLet’s see them try it.  If nothing else, it might put an end to the use of executive orders.  More likely, it will explode the last tattered vestiges of the veil that disguises the dictatorial nature of the ruling oligarchy in Washington DC.\nAnd yes, I know Republicans have used executive orders too.  That’s because they’re part of the problem, not the solution.",
  "tags": [
    "gun control",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-15T18:00:00+00:00"
}