{
  "url": "https://voxday.net/2013/01/01/pray-for-one-of-best-of-us/",
  "scraped_at": "2025-12-14T22:16:34.459502",
  "title": "Pray for one of the best of us",
  "date_display": "January 1, 2013",
  "date_iso": "2013-01-01T13:32:00+00:00",
  "date_from_url": "2013-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bart comments:</p><blockquote class=\"tr_bq\"><p> Happy new year.  This is to let you know that last Friday Beau had a minor stroke. he is in the  hospital<br> in Albq. New Mexico.  Beau was taking me to the va hospital for tests.<br> We had been talking about how some people are simply to selfish to let<br> other people to have their way in anything. About this time Beau started<br> having his Tia. Proving to me that he is too selfish to allow me to<br> have my way. Please pray for Beau.  He is hopefully coming home<br> tomorrow.</br></br></br></br></br></br></p></blockquote><p>Beau is more than the Christian conscience of the Dread Ilk, he is what every Christian man should aspire to be.  I hope and pray that he has many years of service to his Savior left in him, but if not, I can’t think of anyone I know who is better prepared to meet his Maker.</p></div>",
  "content_text": "Bart comments:\nHappy new year.  This is to let you know that last Friday Beau had a minor stroke. he is in the  hospital\nin Albq. New Mexico.  Beau was taking me to the va hospital for tests.\nWe had been talking about how some people are simply to selfish to let\nother people to have their way in anything. About this time Beau started\nhaving his Tia. Proving to me that he is too selfish to allow me to\nhave my way. Please pray for Beau.  He is hopefully coming home\ntomorrow.\nBeau is more than the Christian conscience of the Dread Ilk, he is what every Christian man should aspire to be.  I hope and pray that he has many years of service to his Savior left in him, but if not, I can’t think of anyone I know who is better prepared to meet his Maker.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2013-01-01T13:32:00+00:00"
}