{
  "url": "https://voxday.net/2013/01/21/rabbit-man-is-rabbity/",
  "scraped_at": "2025-12-14T22:18:11.214104",
  "title": "Rabbit man is rabbity",
  "date_display": "January 21, 2013",
  "date_iso": "2013-01-21T09:04:00+00:00",
  "date_from_url": "2013-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://whatever.scalzi.com/2013/01/20/my-weekend-adventures/\">McRapey asks for more mancrushing</a> and I am gracious enough to oblige him.  Although I must warn you, if you are reading this, we are reliably informed that risks making you one of my “merry band of racist<br> sexist homophobic dipshit readers”.  Otherwise known as… THE DREAD ILK!</br></p><blockquote class=\"tr_bq\"><p> On the way home from ConFusion today I received a concerned phone<br> call from a good friend, who informed me that someone had just posted<br> something about me online that to his eye was entirely libelous; he then<br> gave me a brief rundown on the piece. It appears the racist sexist<br> homophobic dipshit who has an adorable little mancrush on me has been<br> spinning up his racist sexist homophobic dipshit blog readers yet again<br> with a typically gibbering gout of stupidity, with my name inserted into<br> it at some point.</br></br></br></br></br></br></br></p><p>I told my friend not to worry about it. Aside from it being just<br> another example of this particular racist sexist homophobic dipshit<br> trying to work out his adorable little mancrush issues in public, it’s<br> probably not libel. One of the pillars of libel is that what’s being<br> written has to effect material damage on the person allegedly being<br> libeled. I experience no material damage in this case, because no one<br> actually gives a shit what this particular racist sexist homophobic<br> dipshit has to say about anything, other than his merry band of racist<br> sexist homophobic dipshit readers. And why would I care what any of<br> those racist sexist homophoblic dipshits think about me? They’re racist<br> sexist homophobic dipshits. The racist sexist homophobic dipshit market<br> is one I’m willing to lose.</br></br></br></br></br></br></br></br></br></br></br></p><p>I imagine that one day the racist sexist homophobic dipshit with the<br> adorable little mancrush on me will finally figure himself out. Until<br> then, I suppose his adorable little mancrush on me is cheaper than<br> therapy. So mancrush on, you racist sexist homophobic dipshit. Because<br> it’s <i>adorable</i>, and I get a giggle about just how much you can’t quit me.</br></br></br></br></p></blockquote><p>The interesting thing about gammas is that they don’t realize that what scalds their souls doesn’t bother those higher in the socio-sexual hierarchy in the slightest.  Still less those who are comfortable outside the social hierarchy.  But it’s a lovely attempt at playing “ha ha ha, see if I care cuz I don’t” through the tears.  I have to confess, it stings a little to be accused of homophobia when John keeps putting <a href=\"http://www.jimchines.com/Pics/Flandry%20Side%20by%20Side.jpg\">delectable, mancrushable eye candy like this</a> on display.  Can you honestly blame me for my adorable little mancrush?  I really think he’s created a whole new category of hotness, the “doughy-sexy”!  But I’m very glad to hear that he gets “a giggle” about it, because, let’s face it, we all know that I will never quit him until his gamma antics cease to provide amusement, which should happen right around the time Heimdall blows his horn.  Mancrushes may not be legal in Ohio, but this is a committed one nevertheless.</p><p>One should appreciate the way McRapey keeps trying to work “libel” into his responses?  Not that he would ever threaten anyone with it, because he totally believes in free speech… but he’s got to mention it, you know, just because.  This reminds me of the scrawny little seventh-grader who can’t fight his way out of a paper bag, who froths at the mouth and tells the high school bullies not to mess with him because he’s crazy.  CRAAAZY!  But I find the most interesting thing to be how he thinks that simply pointing out <a href=\"http://alphagameplan.blogspot.com/2013/01/gammas-dont-get-girls.html\">the attack on female-oriented urban fantasy covers is a misguided attack on female preferences</a> amounts to “a typically gibbering gout of stupidity”.</p><p>In that vein, this comment from a Whatever reader pretty much says it all about the Rabbit People: <i>“I found the RSHD after Scalzi’s piece on the mind of a rapist. The RSHD decided that this post meant that Salzi himself was a rapist. The rest of his thought is on a par with this gem. I’ve been looking at his blog with a kind of horrified fascination ever since. I find him thoroughly dispiriting, rather frightening, and in the end<br> just inexplicable. He presents as a well-educated, articulate,<br> functioning kind of guy, and yet he traffics in vile racism, a sexism so<br> absolute that women seem not to exist as real people, weird conspiracy<br> theories, and general religious crackpottery. I don’t get it at all. Is<br> he insane? I wonder. Are all his readers insane as well?”</br></br></br></br></br></i></p><p>Frightening and inexplicable stupidity.  That concept summarizes the midwitted limits of this particular warren of Rabbit People.  They literally cannot imagine that their worldview is incorrect or is not in line with observable reality.  Anything that is over their heads or beyond them has to be either stupid or crazy, or perhaps both.  And, of course, scary.  They also fail to realize how their responses and accusations betray their own psychologies. John Scalzi is obviously engaging in satire, but I could not possibly be doing anything of the sort.  I must be the insecure and upset one even though it is McRapey who refuses to link to or even identify the RSHD he is nominally addressing.  He even requests that his fellow rabbits follow his lead, whereas I am content to simply shine a light on his creepy, crawly gamma antics and don’t concern myself with what anyone else does.  He deletes or “subverts” the comments of any of those favorable to me who comment on his blog while I both permit and respond to comments by those favorable to him.</p><p> The Rabbit People think I am obsessed, and yet they rush to <i>call his freaking phone</i> simply because I mentioned him in a post.  And my failure to recoil in horror and flee in terror from the VERY BADDEST WORDS THEY CAN POSSIBLY IMAGINE leaves them not only bewildered, but scared.</p><p>“He didn’t react to the H word.  And I already called him stupid.  And crazy. What now?”<br> “Did you try the S word?”<br> “Yeah, good idea… ZOMG, that didn’t work either!”<br> “Very well, he leaves us no choice.  I don’t like it, but he totally asked for it.”<br> “You don’t mean….”<br> “I do.  The R word.”<br> “Wow.  I pity him.  I really do.  Here goes… OMFG, NOTHING HAPPENED!”<br> “What?  That can’t be!  Try it again… TRY IT AGAIN!”<br> “R word!  S word! H word! Stupid!  Crazy!  R WORD!  S WORD!  R WORD!  DAMMIT, IT’S NOT WORKING!”<br> “AAAUUUGGH!  RUN!  SAVE YOURSELVES!  WHERE IS THE SAND?  WHERE IS THE SAND?” (thunk) (thunk)</br></br></br></br></br></br></br></br></br></p><p>Later that day, sounds are heard emanating from a pair of seemingly headless bodies.</p><p>(muffled) “Mmff.  Well, we sure showed him!”<br> (muffled) “Yeah, now everyone will see he’s evil and bad, and sooner or later, the emptiness and loneliness of the social rejection that will surely follow will make him say he’s sorry and that we’re really good people who only want to help everyone.  Also, hugs.”<br> (muffled) “Do you think he’ll pat us on the head too?”<br> (muffled) “That would be nice.”</br></br></br></p><p> I am aware there are a few who still believe I post about McRapey due to jealousy, and it is to them I direct this question: what part of Award-Winning Cruelty Artist do you not understand?  This is not an obsession.  This is a Voxiversity course.  And if you still don’t grasp that, you’re not passing it.</p></div>",
  "content_text": "McRapey asks for more mancrushing\nand I am gracious enough to oblige him.  Although I must warn you, if you are reading this, we are reliably informed that risks making you one of my “merry band of racist\nsexist homophobic dipshit readers”.  Otherwise known as… THE DREAD ILK!\nOn the way home from ConFusion today I received a concerned phone\ncall from a good friend, who informed me that someone had just posted\nsomething about me online that to his eye was entirely libelous; he then\ngave me a brief rundown on the piece. It appears the racist sexist\nhomophobic dipshit who has an adorable little mancrush on me has been\nspinning up his racist sexist homophobic dipshit blog readers yet again\nwith a typically gibbering gout of stupidity, with my name inserted into\nit at some point.\nI told my friend not to worry about it. Aside from it being just\nanother example of this particular racist sexist homophobic dipshit\ntrying to work out his adorable little mancrush issues in public, it’s\nprobably not libel. One of the pillars of libel is that what’s being\nwritten has to effect material damage on the person allegedly being\nlibeled. I experience no material damage in this case, because no one\nactually gives a shit what this particular racist sexist homophobic\ndipshit has to say about anything, other than his merry band of racist\nsexist homophobic dipshit readers. And why would I care what any of\nthose racist sexist homophoblic dipshits think about me? They’re racist\nsexist homophobic dipshits. The racist sexist homophobic dipshit market\nis one I’m willing to lose.\nI imagine that one day the racist sexist homophobic dipshit with the\nadorable little mancrush on me will finally figure himself out. Until\nthen, I suppose his adorable little mancrush on me is cheaper than\ntherapy. So mancrush on, you racist sexist homophobic dipshit. Because\nit’s\nadorable\n, and I get a giggle about just how much you can’t quit me.\nThe interesting thing about gammas is that they don’t realize that what scalds their souls doesn’t bother those higher in the socio-sexual hierarchy in the slightest.  Still less those who are comfortable outside the social hierarchy.  But it’s a lovely attempt at playing “ha ha ha, see if I care cuz I don’t” through the tears.  I have to confess, it stings a little to be accused of homophobia when John keeps putting\ndelectable, mancrushable eye candy like this\non display.  Can you honestly blame me for my adorable little mancrush?  I really think he’s created a whole new category of hotness, the “doughy-sexy”!  But I’m very glad to hear that he gets “a giggle” about it, because, let’s face it, we all know that I will never quit him until his gamma antics cease to provide amusement, which should happen right around the time Heimdall blows his horn.  Mancrushes may not be legal in Ohio, but this is a committed one nevertheless.\nOne should appreciate the way McRapey keeps trying to work “libel” into his responses?  Not that he would ever threaten anyone with it, because he totally believes in free speech… but he’s got to mention it, you know, just because.  This reminds me of the scrawny little seventh-grader who can’t fight his way out of a paper bag, who froths at the mouth and tells the high school bullies not to mess with him because he’s crazy.  CRAAAZY!  But I find the most interesting thing to be how he thinks that simply pointing out\nthe attack on female-oriented urban fantasy covers is a misguided attack on female preferences\namounts to “a typically gibbering gout of stupidity”.\nIn that vein, this comment from a Whatever reader pretty much says it all about the Rabbit People:\n“I found the RSHD after Scalzi’s piece on the mind of a rapist. The RSHD decided that this post meant that Salzi himself was a rapist. The rest of his thought is on a par with this gem. I’ve been looking at his blog with a kind of horrified fascination ever since. I find him thoroughly dispiriting, rather frightening, and in the end\njust inexplicable. He presents as a well-educated, articulate,\nfunctioning kind of guy, and yet he traffics in vile racism, a sexism so\nabsolute that women seem not to exist as real people, weird conspiracy\ntheories, and general religious crackpottery. I don’t get it at all. Is\nhe insane? I wonder. Are all his readers insane as well?”\nFrightening and inexplicable stupidity.  That concept summarizes the midwitted limits of this particular warren of Rabbit People.  They literally cannot imagine that their worldview is incorrect or is not in line with observable reality.  Anything that is over their heads or beyond them has to be either stupid or crazy, or perhaps both.  And, of course, scary.  They also fail to realize how their responses and accusations betray their own psychologies. John Scalzi is obviously engaging in satire, but I could not possibly be doing anything of the sort.  I must be the insecure and upset one even though it is McRapey who refuses to link to or even identify the RSHD he is nominally addressing.  He even requests that his fellow rabbits follow his lead, whereas I am content to simply shine a light on his creepy, crawly gamma antics and don’t concern myself with what anyone else does.  He deletes or “subverts” the comments of any of those favorable to me who comment on his blog while I both permit and respond to comments by those favorable to him.\nThe Rabbit People think I am obsessed, and yet they rush to\ncall his freaking phone\nsimply because I mentioned him in a post.  And my failure to recoil in horror and flee in terror from the VERY BADDEST WORDS THEY CAN POSSIBLY IMAGINE leaves them not only bewildered, but scared.\n“He didn’t react to the H word.  And I already called him stupid.  And crazy. What now?”\n“Did you try the S word?”\n“Yeah, good idea… ZOMG, that didn’t work either!”\n“Very well, he leaves us no choice.  I don’t like it, but he totally asked for it.”\n“You don’t mean….”\n“I do.  The R word.”\n“Wow.  I pity him.  I really do.  Here goes… OMFG, NOTHING HAPPENED!”\n“What?  That can’t be!  Try it again… TRY IT AGAIN!”\n“R word!  S word! H word! Stupid!  Crazy!  R WORD!  S WORD!  R WORD!  DAMMIT, IT’S NOT WORKING!”\n“AAAUUUGGH!  RUN!  SAVE YOURSELVES!  WHERE IS THE SAND?  WHERE IS THE SAND?” (thunk) (thunk)\nLater that day, sounds are heard emanating from a pair of seemingly headless bodies.\n(muffled) “Mmff.  Well, we sure showed him!”\n(muffled) “Yeah, now everyone will see he’s evil and bad, and sooner or later, the emptiness and loneliness of the social rejection that will surely follow will make him say he’s sorry and that we’re really good people who only want to help everyone.  Also, hugs.”\n(muffled) “Do you think he’ll pat us on the head too?”\n(muffled) “That would be nice.”\nI am aware there are a few who still believe I post about McRapey due to jealousy, and it is to them I direct this question: what part of Award-Winning Cruelty Artist do you not understand?  This is not an obsession.  This is a Voxiversity course.  And if you still don’t grasp that, you’re not passing it.",
  "tags": [
    "freakshow",
    "McRapey",
    "rabbitology",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-21T09:04:00+00:00"
}