{
  "url": "https://voxday.net/2013/01/25/rabbit-people-rage/",
  "scraped_at": "2025-12-14T22:18:36.769112",
  "title": "When rabbits rage",
  "date_display": "January 25, 2013",
  "date_iso": "2013-01-25T13:46:00+00:00",
  "date_from_url": "2013-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know about you, but one of the things I found most illuminating about the inevitable reaction of various angry rabbits to the featuring of the fraudulent reviewer was the strength of their expressed emotions.  I mean, even if I was absolutely everything they claimed me to be: insecure, childish, a baby, bratty, thin-skinned, small, unprofessional, pathetic, out-of-line, and so forth, why would that be so observably upsetting to them?</p><p>Why would they go out of their way to declare, with considerable umbrage, that they would never read a book of which they had never heard before and which they never had any intention of reading anyhow? Why would they find it to be “utterly reprehensible” to do what literally dozens of other sites were already doing?  Why did they find me to be “scary” when they presumably don’t feel that way about MyAddress or Google Street View?  Why would they feel the urgent need to follow the fraudulent reviewer’s example and “warning other to stay away” from my terrifying books? </p><p>Part of the answer can be found inadvertently provided in the comment of Farida Y.  “He deliberately posted the address of a woman as a clear target of contempt.”  Remember, we usually give away our values in the process of attacking others.  Because I most typically deride others as weaklings, fools and idiots, I betray the fact that I value strength, wisdom, and intelligence, and aspire to those things.</p><p>From their insults, we can see that Rabbit People place particular value on being viewed as sane, grown-up, mature, professional, and in-line.  For example, if you see a blog that describes itself as “thoughtful”, you can be sure that it belongs to a rabbit.  This doesn’t mean, of course, that they actually are any of those things, it merely means that those things are what they aspire to, and what they erroneously believe everyone else aspires to as well.</p><p>Now, the main reason the Rabbit People were offended was that they correctly interpreted my action to be one of contempt.  They know that I do not see them as equals, but as inferiors whose opinions are not to be taken seriously and are useful only for the purpose of amusing me and my readers.  This tends to infuriate those who consider themselves to be thoughtful, grown-up, and responsible because one of their primary objectives is to be taken seriously by the herd, thereby elevating their status within it.</p><p>But if the correctly perceived contempt explains the offense, and therefore the nature of the responses, it does not explain their vehemence or the level of emotions that fueled them.  To understand this, you must first understand that the Rabbit mind is fundamentally feminine, and the feminine mind is ruled, first, foremost, and forever, by fear.</p><p>This is why, in addition to the previously listed descriptions, I was also described as: angry, scary, frightening, psychopathic, creepy, unstable, and obsessed.  These labels are not meant literally, they are simply code words meant to warn fellow rabbits <i>ELIL AHEAD: BEWARE THE PREDATOR</i>.  In addition to being offended, the rabbits are also afraid on two counts.  First, I have demonstrated that I am immune to their weapons of excoriation and exclusion, which, being herd animals, is something they find inexplicable and frightening.  Second, I have shown that I am willing to step “out-of-line”, which means that I am capable of taking actions that they cannot imagine, anticipate, or control.  The combination of these two things is enough to strike absolute terror in the rabbity heart; it quite literally panics them even when, as in the case of the fraudulent reviewer, no one was threatened in any way, shape, or form.</p><p>Their antics weren’t inspired by the fact that my actions were intrinsically dangerous, as they obviously were not, but rather, from the fact that those actions were outside the boundaries defined by the rabbits as being safe.  Rabbits bolt from big scary noises; they don’t stop to reflect upon whether it is a hungry bear with a particular hankering for rabbit or a truck that isn’t anywhere near them and isn’t even capable of being aware of their existence.  The simple act of stepping outside the lines is, from the rabbity perspective, an inherently dangerous act, because their way of life revolves around the dynamic construction of rules designed to circumscribe the behavior of others.</p><p>Jack Amok explained it correctly<i>: “Rabbit/Lefty people count on this, that their opponents will hold<br> themselves to civilized rules of conduct the lefties will themselves<br> aggressively ignore.  Like a woman who screams, spits and throws things<br> at a man, confident he wouldn’t dare backhand her across the room in<br> response.  The shock when he doesn’t conform to expectations is usually dramatic.” </br></br></br></br></i></p><p>Stickwick added: <i>“</i><i>For the rabbit people, any behavior that isn’t sufficiently supplicating<br> in response to their attempts to shame and cow probably does have the<br> appearance of psychopathy.” </br></br></i></p><p>And Allyn asked an apt question:</p><blockquote class=\"tr_bq\"><p> “A question for those that have a better understanding of rabbit behavior.  Do rabbit folk go blind during their rage and lose the ability for reading cognitive recognition?  This question is a direct result of observing today’s acts.</p><p>Vox claims “For my next trick I will make the rabbits appear and then dance and hop on one foot”.</p><p>On<br> command the rabbits appear, raging at Vox for being a Nazi, homophobic,<br> poopy head that is not smarter than them.  What they seem to miss is<br> they are doing this while dancing and hopping on one foot.”</br></br></br></p></blockquote><p> Yes, that’s exactly what they do.  They go blind with rage and fear.  A sufficiently angry rabbit, (which is essentially synonymous with a sufficiently frightened rabbit), is hopelessly irrational and possesses mere fragments of the cognitive abilities it usually has.  They are rendered intellectually <i>tharn</i>.</p><p>Let me give you an example from an exchange that followed yesterday’s chorus line of hopping, dancing rabbits between an SFWA member and me.  Unfortunately, I can’t quote the other individual due to where the exchange took place, but the summary should suffice to illustrate the point.  Being a candidate for the office of president, I was asked to explain my actions related to the fraudulent reviewer, which I did as follows:</p><blockquote class=\"tr_bq\"><p> “[I]t was part of a larger point I was making about Rabbit People and one of their common tactics. I knew several Whatever readers would attack my books by using the reviews because that’s the sort of readership Mr. Scalzi has. I had a similar experience with Richard Dawkins’s fans after publishing TIA. There were a number of other fake reviews posted yesterday that I reported in the conventional manner and were immediately removed by Amazon, such as this one: “Vox Day” is not only a bad writer; he’s also an angry, racist psychopath. Stay far away from this mediocre book.””</p></blockquote><p>This led to a response from one gentleman who rejoices in sprinkling his missives with lawyerly idioms.  He claimed that because he happened to provide a few of Whatever’s 7.8 MILLION PAGEVIEWS in 2012, I had personally insulted him by accusing him of engaging in unprofessional tactics, and furthermore, had attacked the SFWA membership as well.</p><p>Now, it shouldn’t be terribly difficult for anyone who has graduated from elementary school, much less law school, to realize that an insignificant number of readers are not synonymous with the entire readership.  Still less does the subset necessarily have anything to do with a separate organization, even if that organization happens to have some degree of overlap with the set.  But the rabbit, esq. was so angry and <i>tharn </i>that he manufactured a nonsensical ex post facto justification for his wounded feelings, which of course required me, as a known healer and teacher, to gently explain the errors in his reasoning to him.</p><p>Which explanation I provided with such care and compassion that one giant of science fiction was moved to exclaim in open amazement and wonder.</p><p>I have to admit, I wasn’t particularly sanguine about my electoral prospects before yesterday, but I’m feeling pretty optimistic about them now.  After all, even rabbits like seeing a lawyer get bitch-slapped.</p></div>",
  "content_text": "I don’t know about you, but one of the things I found most illuminating about the inevitable reaction of various angry rabbits to the featuring of the fraudulent reviewer was the strength of their expressed emotions.  I mean, even if I was absolutely everything they claimed me to be: insecure, childish, a baby, bratty, thin-skinned, small, unprofessional, pathetic, out-of-line, and so forth, why would that be so observably upsetting to them?\nWhy would they go out of their way to declare, with considerable umbrage, that they would never read a book of which they had never heard before and which they never had any intention of reading anyhow? Why would they find it to be “utterly reprehensible” to do what literally dozens of other sites were already doing?  Why did they find me to be “scary” when they presumably don’t feel that way about MyAddress or Google Street View?  Why would they feel the urgent need to follow the fraudulent reviewer’s example and “warning other to stay away” from my terrifying books?\nPart of the answer can be found inadvertently provided in the comment of Farida Y.  “He deliberately posted the address of a woman as a clear target of contempt.”  Remember, we usually give away our values in the process of attacking others.  Because I most typically deride others as weaklings, fools and idiots, I betray the fact that I value strength, wisdom, and intelligence, and aspire to those things.\nFrom their insults, we can see that Rabbit People place particular value on being viewed as sane, grown-up, mature, professional, and in-line.  For example, if you see a blog that describes itself as “thoughtful”, you can be sure that it belongs to a rabbit.  This doesn’t mean, of course, that they actually are any of those things, it merely means that those things are what they aspire to, and what they erroneously believe everyone else aspires to as well.\nNow, the main reason the Rabbit People were offended was that they correctly interpreted my action to be one of contempt.  They know that I do not see them as equals, but as inferiors whose opinions are not to be taken seriously and are useful only for the purpose of amusing me and my readers.  This tends to infuriate those who consider themselves to be thoughtful, grown-up, and responsible because one of their primary objectives is to be taken seriously by the herd, thereby elevating their status within it.\nBut if the correctly perceived contempt explains the offense, and therefore the nature of the responses, it does not explain their vehemence or the level of emotions that fueled them.  To understand this, you must first understand that the Rabbit mind is fundamentally feminine, and the feminine mind is ruled, first, foremost, and forever, by fear.\nThis is why, in addition to the previously listed descriptions, I was also described as: angry, scary, frightening, psychopathic, creepy, unstable, and obsessed.  These labels are not meant literally, they are simply code words meant to warn fellow rabbits\nELIL AHEAD: BEWARE THE PREDATOR\n.  In addition to being offended, the rabbits are also afraid on two counts.  First, I have demonstrated that I am immune to their weapons of excoriation and exclusion, which, being herd animals, is something they find inexplicable and frightening.  Second, I have shown that I am willing to step “out-of-line”, which means that I am capable of taking actions that they cannot imagine, anticipate, or control.  The combination of these two things is enough to strike absolute terror in the rabbity heart; it quite literally panics them even when, as in the case of the fraudulent reviewer, no one was threatened in any way, shape, or form.\nTheir antics weren’t inspired by the fact that my actions were intrinsically dangerous, as they obviously were not, but rather, from the fact that those actions were outside the boundaries defined by the rabbits as being safe.  Rabbits bolt from big scary noises; they don’t stop to reflect upon whether it is a hungry bear with a particular hankering for rabbit or a truck that isn’t anywhere near them and isn’t even capable of being aware of their existence.  The simple act of stepping outside the lines is, from the rabbity perspective, an inherently dangerous act, because their way of life revolves around the dynamic construction of rules designed to circumscribe the behavior of others.\nJack Amok explained it correctly\n: “Rabbit/Lefty people count on this, that their opponents will hold\nthemselves to civilized rules of conduct the lefties will themselves\naggressively ignore.  Like a woman who screams, spits and throws things\nat a man, confident he wouldn’t dare backhand her across the room in\nresponse.  The shock when he doesn’t conform to expectations is usually dramatic.”\nStickwick added:\n“\nFor the rabbit people, any behavior that isn’t sufficiently supplicating\nin response to their attempts to shame and cow probably does have the\nappearance of psychopathy.”\nAnd Allyn asked an apt question:\n“A question for those that have a better understanding of rabbit behavior.  Do rabbit folk go blind during their rage and lose the ability for reading cognitive recognition?  This question is a direct result of observing today’s acts.\nVox claims “For my next trick I will make the rabbits appear and then dance and hop on one foot”.\nOn\ncommand the rabbits appear, raging at Vox for being a Nazi, homophobic,\npoopy head that is not smarter than them.  What they seem to miss is\nthey are doing this while dancing and hopping on one foot.”\nYes, that’s exactly what they do.  They go blind with rage and fear.  A sufficiently angry rabbit, (which is essentially synonymous with a sufficiently frightened rabbit), is hopelessly irrational and possesses mere fragments of the cognitive abilities it usually has.  They are rendered intellectually\ntharn\n.\nLet me give you an example from an exchange that followed yesterday’s chorus line of hopping, dancing rabbits between an SFWA member and me.  Unfortunately, I can’t quote the other individual due to where the exchange took place, but the summary should suffice to illustrate the point.  Being a candidate for the office of president, I was asked to explain my actions related to the fraudulent reviewer, which I did as follows:\n“[I]t was part of a larger point I was making about Rabbit People and one of their common tactics. I knew several Whatever readers would attack my books by using the reviews because that’s the sort of readership Mr. Scalzi has. I had a similar experience with Richard Dawkins’s fans after publishing TIA. There were a number of other fake reviews posted yesterday that I reported in the conventional manner and were immediately removed by Amazon, such as this one: “Vox Day” is not only a bad writer; he’s also an angry, racist psychopath. Stay far away from this mediocre book.””\nThis led to a response from one gentleman who rejoices in sprinkling his missives with lawyerly idioms.  He claimed that because he happened to provide a few of Whatever’s 7.8 MILLION PAGEVIEWS in 2012, I had personally insulted him by accusing him of engaging in unprofessional tactics, and furthermore, had attacked the SFWA membership as well.\nNow, it shouldn’t be terribly difficult for anyone who has graduated from elementary school, much less law school, to realize that an insignificant number of readers are not synonymous with the entire readership.  Still less does the subset necessarily have anything to do with a separate organization, even if that organization happens to have some degree of overlap with the set.  But the rabbit, esq. was so angry and\ntharn\nthat he manufactured a nonsensical ex post facto justification for his wounded feelings, which of course required me, as a known healer and teacher, to gently explain the errors in his reasoning to him.\nWhich explanation I provided with such care and compassion that one giant of science fiction was moved to exclaim in open amazement and wonder.\nI have to admit, I wasn’t particularly sanguine about my electoral prospects before yesterday, but I’m feeling pretty optimistic about them now.  After all, even rabbits like seeing a lawyer get bitch-slapped.",
  "tags": [
    "rabbitology",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-25T13:46:00+00:00"
}