{
  "url": "https://voxday.net/2013/01/31/race-based-contraception/",
  "scraped_at": "2025-12-14T22:19:11.889292",
  "title": "Race-based contraception",
  "date_display": "January 31, 2013",
  "date_iso": "2013-01-31T17:06:00+00:00",
  "date_from_url": "2013-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://allafrica.com/stories/201301290366.html\">contraception scandal in Israel</a> is rather timely news in light of the recent discussion concerning racism:</p><blockquote class=\"tr_bq\"><p> The director of the Ministry of Health in Israel, Roni Gamzo, has<br> issued a formal directive instructing that gynaecologists should not<br> inject women with the contraceptive Depo-Provera without their knowledge<br> or consent.</br></br></br></p><p>The directive, issued last week, comes after around 30 Ethiopian Jews<br> who had emigrated to Israel said they had been told that they would not<br> be allowed into the country without receiving the contraceptive drug.  Within Israel, Ethiopian Jews make up the majority of those given the<br> drug, according to a report published in 2010 by Isha le’Isha, a<br> women’s rights organization; 57 percent of women who had received the<br> drug in Israel are Ethiopian Jews, although they account for less than 2<br> percent of the overall population.</br></br></br></br></br></br></p></blockquote><p>I found it to be particularly interesting in light of how American Jewish support for third world immigration is largely based on their parents’ and grandparents’ experience in America.  Perhaps the Southern Poverty Law Center, which is deeply concerned with all things even potentially racist, will find the time to look into who is responsible for this involuntary contraceptive program.</p></div>",
  "content_text": "This\ncontraception scandal in Israel\nis rather timely news in light of the recent discussion concerning racism:\nThe director of the Ministry of Health in Israel, Roni Gamzo, has\nissued a formal directive instructing that gynaecologists should not\ninject women with the contraceptive Depo-Provera without their knowledge\nor consent.\nThe directive, issued last week, comes after around 30 Ethiopian Jews\nwho had emigrated to Israel said they had been told that they would not\nbe allowed into the country without receiving the contraceptive drug.  Within Israel, Ethiopian Jews make up the majority of those given the\ndrug, according to a report published in 2010 by Isha le’Isha, a\nwomen’s rights organization; 57 percent of women who had received the\ndrug in Israel are Ethiopian Jews, although they account for less than 2\npercent of the overall population.\nI found it to be particularly interesting in light of how American Jewish support for third world immigration is largely based on their parents’ and grandparents’ experience in America.  Perhaps the Southern Poverty Law Center, which is deeply concerned with all things even potentially racist, will find the time to look into who is responsible for this involuntary contraceptive program.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-31T17:06:00+00:00"
}