{
  "url": "https://voxday.net/2013/01/07/race-and-guns-part-1/",
  "scraped_at": "2025-12-14T22:17:04.867450",
  "title": "Race and guns: part 1",
  "date_display": "January 7, 2013",
  "date_iso": "2013-01-07T11:34:00+00:00",
  "date_from_url": "2013-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Cole of the New York Times argues that <a href=\"http://www.nytimes.com/2013/01/02/opinion/who-pays-for-the-right-to-bear-arms.html?hp\">young urban blacks pay the cost</a> for the right to bear arms:</p><blockquote class=\"tr_bq\"><div itemprop=\"articleBody\"> Gun rights defenders argue that gun laws don’t reduce violence, noting<br> that many cities with high gun violence already have strict gun laws.<br> But this ignores the ease with which urban residents can evade local<br> laws by obtaining guns from dealers outside their cities or states.<br> Effective gun regulation requires a nationally coordinated response. </br></br></br></br></div><div itemprop=\"articleBody\"> A cynic might propose resurrecting the Black Panthers to heighten white<br> anxiety as the swiftest route to breaking the logjam on gun reform. I<br> hope we are better than that. If the nation were to view the everyday<br> tragedies that befall young black and Latino men in the inner cities<br> with the same sympathy that it has shown for the Newtown victims, there<br> would be a groundswell of support not just for gun law reform, but for<br> much broader measures. </br></br></br></br></br></br></div><div itemprop=\"articleBody\"> If we are to reduce the inequitable costs of gun rights, it’s not enough<br> to tighten licensing requirements, expand background checks to private<br> gun sales or ban assault weapons. In addition to such national measures,<br> meaningful reform must include initiatives directed to where gun<br> violence is worst: the inner cities. Aggressive interventions by police<br> and social workers focused on gang gun violence, coupled with economic<br> investment, better schools and more after-school and job training<br> programs, are all necessary if we are to reduce the violence that gun<br> rights entail. </br></br></br></br></br></br></br></br></div><div itemprop=\"articleBody\"> To tweak the National Rifle Association’s refrain, “guns don’t kill<br> people; indifference to poverty kills people.” We can’t in good<br> conscience keep making young black men pay the cost of our right to bear<br> arms. </br></br></br></div></blockquote><div itemprop=\"articleBody\"> However, Cole assumes a causation that simply is not supported by the facts at hand.  Below is a chart I prepared based on the state-by-state offense rates, per 100k population, comparing black homicide to non-black homicide.  The source was the commenter Silver’s comment on <a href=\"http://isteve.blogspot.com/2012/12/has-anybody-ever-calculated-white.html\">a recent Steve Sailer post</a>, derived from a 2009 FBI report.  The average state homicide rate is 17.3 per 100k for the black population and 2.5 per 100k for the non-black population.<div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://3.bp.blogspot.com/-5ZjJy_8OlFk/UOqyoITU4lI/AAAAAAAAAZE/d5I9eo9HJHc/s1600/Homicide_State_Race.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"315\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/01/Homicide_State_Race.png\" width=\"400\"/></a></div><p>As Silver notes, the FBI information cannot be used to directly compare black and white homicide rates, since the non-black rate combines the white, Hispanic, Asian, and American Indian rates.  I will attempt to sort out some of those rates in the next post on this subject, but even a casual glance will suffice to show that the states with the highest non-black homicide rates, the District of Columbia (9.1), Nevada (5.2), Arizona (4.4), and California (4.3) tends to coincide with higher levels of Hispanic population.</p><p>If Cole’s thesis was correct, we would have to find that gun ownership and poverty are vastly higher among the black population than among the other U.S. populations.  But this is clearly not the case with regards to gun ownership, since 44% of whites own guns compared to 27% of blacks, and the Hispanic poverty rate is 26.6%, nearly equal to the black poverty rate of 27.4%.  Therefore, we can not only refute his argument that gun rights entail violence <a href=\"http://www.milobookclub.com/2012/12/21/why-us-gun-deaths-are-hig/\">by comparing international crime statistics</a>, but also conclusively show that his “necessary” recommendations for reducing violence are unrelated to the causal problem at hand, and as a result, extremely unlikely to reduce it in any substantive manner.</p></div></div>",
  "content_text": "David Cole of the New York Times argues that\nyoung urban blacks pay the cost\nfor the right to bear arms:\nGun rights defenders argue that gun laws don’t reduce violence, noting\nthat many cities with high gun violence already have strict gun laws.\nBut this ignores the ease with which urban residents can evade local\nlaws by obtaining guns from dealers outside their cities or states.\nEffective gun regulation requires a nationally coordinated response.\nA cynic might propose resurrecting the Black Panthers to heighten white\nanxiety as the swiftest route to breaking the logjam on gun reform. I\nhope we are better than that. If the nation were to view the everyday\ntragedies that befall young black and Latino men in the inner cities\nwith the same sympathy that it has shown for the Newtown victims, there\nwould be a groundswell of support not just for gun law reform, but for\nmuch broader measures.\nIf we are to reduce the inequitable costs of gun rights, it’s not enough\nto tighten licensing requirements, expand background checks to private\ngun sales or ban assault weapons. In addition to such national measures,\nmeaningful reform must include initiatives directed to where gun\nviolence is worst: the inner cities. Aggressive interventions by police\nand social workers focused on gang gun violence, coupled with economic\ninvestment, better schools and more after-school and job training\nprograms, are all necessary if we are to reduce the violence that gun\nrights entail.\nTo tweak the National Rifle Association’s refrain, “guns don’t kill\npeople; indifference to poverty kills people.” We can’t in good\nconscience keep making young black men pay the cost of our right to bear\narms.\nHowever, Cole assumes a causation that simply is not supported by the facts at hand.  Below is a chart I prepared based on the state-by-state offense rates, per 100k population, comparing black homicide to non-black homicide.  The source was the commenter Silver’s comment on\na recent Steve Sailer post\n, derived from a 2009 FBI report.  The average state homicide rate is 17.3 per 100k for the black population and 2.5 per 100k for the non-black population.\nAs Silver notes, the FBI information cannot be used to directly compare black and white homicide rates, since the non-black rate combines the white, Hispanic, Asian, and American Indian rates.  I will attempt to sort out some of those rates in the next post on this subject, but even a casual glance will suffice to show that the states with the highest non-black homicide rates, the District of Columbia (9.1), Nevada (5.2), Arizona (4.4), and California (4.3) tends to coincide with higher levels of Hispanic population.\nIf Cole’s thesis was correct, we would have to find that gun ownership and poverty are vastly higher among the black population than among the other U.S. populations.  But this is clearly not the case with regards to gun ownership, since 44% of whites own guns compared to 27% of blacks, and the Hispanic poverty rate is 26.6%, nearly equal to the black poverty rate of 27.4%.  Therefore, we can not only refute his argument that gun rights entail violence\nby comparing international crime statistics\n, but also conclusively show that his “necessary” recommendations for reducing violence are unrelated to the causal problem at hand, and as a result, extremely unlikely to reduce it in any substantive manner.",
  "tags": [
    "gun control",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-07T11:34:00+00:00"
}