{
  "url": "https://voxday.net/2013/01/01/reading-list-2012/",
  "scraped_at": "2025-12-14T22:16:32.625167",
  "title": "Reading List 2012",
  "date_display": "January 1, 2013",
  "date_iso": "2013-01-01T10:23:00+00:00",
  "date_from_url": "2013-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The book I enjoyed most of the 66 I read this year was China Mieville’s <i>The City and the City</i>, followed by Charles Stross’s <i>The Apocalypse Codex </i>and Hugh Howey’s <i>Wool</i>. The<br> worst thing I read this year was Charlaine Harris’s <i>Deadlocked</i>,<br> which demonstrated to me that it is a very good thing HBO’s <i>True Blood</i> is increasingly diverging from the books that inspired it.  Easily the most disappointing book, however, was the collective effort that is <i>The Mongoliad</i>.  I thought the idea and the subject matter sounded brilliant, but it turned out to be surprisingly tedious.</br></br></p><p>On the non-fiction side, while I quite enjoyed both Machiavelli’s <i>Discourses </i>and Keen’s <i>Debunking Economics</i>, (and got more than a few chuckles out of Krugman’s latest), <i>Game Mechanics, Advanced Game Design</i> was actually very useful to me this year.  Sam Harris’s <i>Free Will</i>, on the other hand, was a short and poorly-reasoned extended essay that fell well short of his previous effort in the subject matter.</p><p>Keep in mind these ratings are not necessarily statements about a book’s literary quality, they are merely casual observations of how much I happened to enjoy reading the book at the time.  When I review a book and rate it for quality as well as enjoyment, I rate it out of ten.</p><p><b>FIVE STARS</b><br> The City and the City, China Mieville<br> The Apocalypse Codex, Charles Stross<br> Discourses on the First Decade of Titus Livius, Niccolo Machiavelli <br> Kraken, China Mieville<br> Pegasus Bridge, Stephen Ambrose <br> Debunking Economics, Steve Keen<br> Wool Omnibus, Hugh Howey <br> Game Mechanics: Advanced Game Design, Adams and Dormans<br> A Swiftly Tilting Planet, Madeleine L’Engle</br></br></br></br></br></br></br></br></br></p><p><b>FOUR STARS</b><br> Cold Days, Jim Butcher<br> War Room, Michael Holley<br> Feast of Souls, Celia Friedman<br> Wings of Wrath, Celia Friedman<br> The Discoverers, Daniel Boorstin<br> The Devil’s Brood, Sharon K. Penman<br> A Shadow in Summer, Daniel Abraham <br> With the Old Breed, E.B. Sledge<br> Stalingrad, Anthony Beevor<br> Till We Have Faces, C.S. Lewis<br> The Conglomeroid Cocktail Party, Robert Silverberg<br> Vanished Kingdoms, Norman Davies<br> Jeeves and the Feudal Spirit, PG Wodehouse<br> End This Depression Now!, Paul Krugman</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><b>THREE STARS</b><br> Absolute Monarchs, John Julius Norwich<br> The Way of Kings, Brandon Sanderson <br> Lionheart, Sharon K. Penman<br> A Betrayal in Winter, Daniel Abraham<br> An Autumn War, Daniel Abraham<br> The Price of Spring, Daniel Abraham<br> Legacy of Kings, Celia Friedman <br> NFIB v. Sebelius: Five Takes, Reynolds and Denning<br> White Moon, Red Dragon, David Wingrove<br> I Shall Wear Midnight, Terry Pratchett <br> Unseen Academicals, Terry Pratchett<br> A Wind in the Door, Madeleine L’Engle <br> Faded Steel Heat, Glen Cook<br> Whispering Nickel Idols, Glen Cook<br> Cruel Zinc Melodies, Glen Cook<br> Sharpe’s Tiger, Bernard Cornwell<br> Sharpe’s Triumph, Bernard Cornwell<br> Sharpe’s Fortress, Bernard Cornwell<br> Sharpe’s Prey, Bernard Cornwell<br> Sharpe’s Rifles, Bernard Cornwell<br> Sharpe’s Gold, Bernard Cornwell<br> Sharpe’s Escape, Bernard Cornwell<br> Sharpe’s Fury, Bernard Cornwell<br> Sharpe’s Trafalgar, Bernard Cornwell<br> Sharper than a Serpent’s Tooth, Simon Green<br> Hell to Pay, Simon Green<br> The Unnatural Inquirer, Simon Green<br> Just Another Judgment Day, Simon Green<br> The Good, The Bad, and The Uncanny, Simon Green<br> A Hard Day’s Knight, Simon Green<br> The Bride Wore Black Leather, Simon Green</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><b>TWO STARS</b><br> Tongues of Serpents, Naomi Novik<br> The 100-Yard War, Greg Emmanuel <br> The Mongoliad: Book One, Neal Stephenson<br> Songs of Love and Death, George RR Martin, ed. <br> Bobby Singer’s Guide to Hunting, David Reed<br> Diplomatic Immunity, Lois McMaster Bujold<br> Cryoburn, Lois McMaster Bujold<br> Deflation and Depression: Is There an Empirical Link, Atkeson and Kehoe<br> Beneath the Tree of Heaven, David Wingrove<br/> An Acceptable Time, Madeleine L’Engle</br></br></br></br></br></br></br></br></br></p><p><b>ONE STAR</b><br/> Deadlocked, Charlaine Harris<br/> Free Will, Sam Harris</p></div>",
  "content_text": "The book I enjoyed most of the 66 I read this year was China Mieville’s\nThe City and the City\n, followed by Charles Stross’s\nThe Apocalypse Codex\nand Hugh Howey’s\nWool\n. The\nworst thing I read this year was Charlaine Harris’s\nDeadlocked\n,\nwhich demonstrated to me that it is a very good thing HBO’s\nTrue Blood\nis increasingly diverging from the books that inspired it.  Easily the most disappointing book, however, was the collective effort that is\nThe Mongoliad\n.  I thought the idea and the subject matter sounded brilliant, but it turned out to be surprisingly tedious.\nOn the non-fiction side, while I quite enjoyed both Machiavelli’s\nDiscourses\nand Keen’s\nDebunking Economics\n, (and got more than a few chuckles out of Krugman’s latest),\nGame Mechanics, Advanced Game Design\nwas actually very useful to me this year.  Sam Harris’s\nFree Will\n, on the other hand, was a short and poorly-reasoned extended essay that fell well short of his previous effort in the subject matter.\nKeep in mind these ratings are not necessarily statements about a book’s literary quality, they are merely casual observations of how much I happened to enjoy reading the book at the time.  When I review a book and rate it for quality as well as enjoyment, I rate it out of ten.\nFIVE STARS\nThe City and the City, China Mieville\nThe Apocalypse Codex, Charles Stross\nDiscourses on the First Decade of Titus Livius, Niccolo Machiavelli\nKraken, China Mieville\nPegasus Bridge, Stephen Ambrose\nDebunking Economics, Steve Keen\nWool Omnibus, Hugh Howey\nGame Mechanics: Advanced Game Design, Adams and Dormans\nA Swiftly Tilting Planet, Madeleine L’Engle\nFOUR STARS\nCold Days, Jim Butcher\nWar Room, Michael Holley\nFeast of Souls, Celia Friedman\nWings of Wrath, Celia Friedman\nThe Discoverers, Daniel Boorstin\nThe Devil’s Brood, Sharon K. Penman\nA Shadow in Summer, Daniel Abraham\nWith the Old Breed, E.B. Sledge\nStalingrad, Anthony Beevor\nTill We Have Faces, C.S. Lewis\nThe Conglomeroid Cocktail Party, Robert Silverberg\nVanished Kingdoms, Norman Davies\nJeeves and the Feudal Spirit, PG Wodehouse\nEnd This Depression Now!, Paul Krugman\nTHREE STARS\nAbsolute Monarchs, John Julius Norwich\nThe Way of Kings, Brandon Sanderson\nLionheart, Sharon K. Penman\nA Betrayal in Winter, Daniel Abraham\nAn Autumn War, Daniel Abraham\nThe Price of Spring, Daniel Abraham\nLegacy of Kings, Celia Friedman\nNFIB v. Sebelius: Five Takes, Reynolds and Denning\nWhite Moon, Red Dragon, David Wingrove\nI Shall Wear Midnight, Terry Pratchett\nUnseen Academicals, Terry Pratchett\nA Wind in the Door, Madeleine L’Engle\nFaded Steel Heat, Glen Cook\nWhispering Nickel Idols, Glen Cook\nCruel Zinc Melodies, Glen Cook\nSharpe’s Tiger, Bernard Cornwell\nSharpe’s Triumph, Bernard Cornwell\nSharpe’s Fortress, Bernard Cornwell\nSharpe’s Prey, Bernard Cornwell\nSharpe’s Rifles, Bernard Cornwell\nSharpe’s Gold, Bernard Cornwell\nSharpe’s Escape, Bernard Cornwell\nSharpe’s Fury, Bernard Cornwell\nSharpe’s Trafalgar, Bernard Cornwell\nSharper than a Serpent’s Tooth, Simon Green\nHell to Pay, Simon Green\nThe Unnatural Inquirer, Simon Green\nJust Another Judgment Day, Simon Green\nThe Good, The Bad, and The Uncanny, Simon Green\nA Hard Day’s Knight, Simon Green\nThe Bride Wore Black Leather, Simon Green\nTWO STARS\nTongues of Serpents, Naomi Novik\nThe 100-Yard War, Greg Emmanuel\nThe Mongoliad: Book One, Neal Stephenson\nSongs of Love and Death, George RR Martin, ed.\nBobby Singer’s Guide to Hunting, David Reed\nDiplomatic Immunity, Lois McMaster Bujold\nCryoburn, Lois McMaster Bujold\nDeflation and Depression: Is There an Empirical Link, Atkeson and Kehoe\nBeneath the Tree of Heaven, David Wingrove\nAn Acceptable Time, Madeleine L’Engle\nONE STAR\nDeadlocked, Charlaine Harris\nFree Will, Sam Harris",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-01T10:23:00+00:00"
}