{
  "url": "https://voxday.net/2013/01/24/rush-and-bifactional-ruling-party/",
  "scraped_at": "2025-12-14T22:18:31.155437",
  "title": "Rush and the bifactional ruling party",
  "date_display": "January 24, 2013",
  "date_iso": "2013-01-24T14:00:00+00:00",
  "date_from_url": "2013-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a little late, but Rush Limbaugh has finally begun to realize that <a href=\"http://www.rushlimbaugh.com/daily/2013/01/23/the_cleansing_of_mrs_clinton_s_record\">he’s been played for decades</a> by the Republican branch:</p><blockquote class=\"tr_bq\"><p> You know what this was? This was perhaps, folks, one of the best<br> illustrations of the whole concept that we’ve spoken here about on<br> numerous occasions of the ruling class, the political class. It doesn’t<br> matter what party, they’re all part of the ruling class, the political<br> class in DC, and when the rubber hits the road, they all circle the<br> wagons around each other. Well, the Republicans join in circling the<br> wagons. The Democrats never do when it’s a Republican involved, but for<br> the most part they do. They close ranks, and they protect one another<br> because what they’re protecting is themselves.</br></br></br></br></br></br></br></br></p><p>They’re protecting the ruling class, the political elites, and they’re maintaining the status quo….  So what we had here, folks, was the ruling class circling the wagons<br> and protecting each other. Party affiliation did not matter. We’re<br> always hoping at hearings like this that somebody on our side is gonna<br> stand up and give the Democrats what-for, somebody is gonna stand up and<br> nail ’em to the cross or whatever, ask the tough questions, get to the<br> bottom of it just as the Democrats do with our judicial nominees or<br> anybody in our party who falls in the crosshairs.<br> We keep waiting for it, and it never happens. They never do it. </br></br></br></br></br></br></br></p></blockquote><p>Now, I have no idea if he is right about setting the stage for Hilary in 2016.  I don’t care.  After the last election showed that I have been too long gone to have any ability to correctly read the US electorate, I am officially out of the business of political predictions.  But it is interesting to see the man who was once Mr. Republican finally beginning to understand that there is not a real two-party system in the USA, there is merely one ruling party with two cooperative factions.</p></div>",
  "content_text": "It’s a little late, but Rush Limbaugh has finally begun to realize that\nhe’s been played for decades\nby the Republican branch:\nYou know what this was? This was perhaps, folks, one of the best\nillustrations of the whole concept that we’ve spoken here about on\nnumerous occasions of the ruling class, the political class. It doesn’t\nmatter what party, they’re all part of the ruling class, the political\nclass in DC, and when the rubber hits the road, they all circle the\nwagons around each other. Well, the Republicans join in circling the\nwagons. The Democrats never do when it’s a Republican involved, but for\nthe most part they do. They close ranks, and they protect one another\nbecause what they’re protecting is themselves.\nThey’re protecting the ruling class, the political elites, and they’re maintaining the status quo….  So what we had here, folks, was the ruling class circling the wagons\nand protecting each other. Party affiliation did not matter. We’re\nalways hoping at hearings like this that somebody on our side is gonna\nstand up and give the Democrats what-for, somebody is gonna stand up and\nnail ’em to the cross or whatever, ask the tough questions, get to the\nbottom of it just as the Democrats do with our judicial nominees or\nanybody in our party who falls in the crosshairs.\nWe keep waiting for it, and it never happens. They never do it.\nNow, I have no idea if he is right about setting the stage for Hilary in 2016.  I don’t care.  After the last election showed that I have been too long gone to have any ability to correctly read the US electorate, I am officially out of the business of political predictions.  But it is interesting to see the man who was once Mr. Republican finally beginning to understand that there is not a real two-party system in the USA, there is merely one ruling party with two cooperative factions.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-24T14:00:00+00:00"
}