{
  "url": "https://voxday.net/2013/01/04/sane-to-poin/",
  "scraped_at": "2025-12-14T22:16:52.447936",
  "title": "Perceptive to a point",
  "date_display": "January 4, 2013",
  "date_iso": "2013-01-04T17:01:00+00:00",
  "date_from_url": "2013-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Harris writes what is <a href=\"http://www.samharris.org/blog/item/the-riddle-of-the-gun\">a surprisingly good article</a> on guns and gun control, at least for the first three-quarters of the article:</p><blockquote class=\"tr_bq\"><p> Coverage of the Newtown tragedy and its aftermath has been generally<br> abysmal. In fact, I have never seen the “liberal media” conform to<br> right-wing caricatures of itself with such alacrity. I have read<br> articles in which literally everything said about firearms and<br> ballistics has been wrong. I have heard major newscasters mispronounce<br> the names of every weapon and weapons manufacturer more challenging than<br> “Colt.” I can only imagine the mirth it has brought gun-rights zealots<br> to see “automatic” and “semi-automatic” routinely confused, or to hear a<br> major news anchor ominously declare that the shooter had been armed<br> with a “Sig Sauzer” pistol. This has been more than embarrassing. It has<br> offered a thousand points of proof that “liberal elites” don’t know<br> anything about what matters when bullets start flying….</br></br></br></br></br></br></br></br></br></br></br></p><p>Most liberals responded derisively to the NRA’s suggestion that having<br> armed and vetted men and women in our schools could save lives.  Some<br> pointed to a public-service announcement put out by the city of Houston<br> (funded by the Department of Homeland Security), in which the<br> possibility of having guns on the scene was never discussed. Several<br> commentators held up this training video in support of the creed “More<br> guns are not the answer.” Please take a few minutes to <a href=\"https://www.youtube.com/watch?v=5VcSwejU2D0&amp;feature=youtu.be\">watch this footage</a>. Then try to imagine how a few armed civilians could respond during an attack of this kind. To help your imagination along, <a href=\"https://www.youtube.com/watch?v=3AA_dgRdDhk\">watch this short video</a>,<br> in which a motel clerk carrying a concealed weapon shoots an armed<br> robber. The situation isn’t perfectly analogous—the wisdom of using<br> deadly force in what might be only a robbery is at least debatable. But<br> is it really so difficult to believe that the shooter might have been<br> helpful during an incident of the sort depicted in Houston?</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p> Unfortunately, after that very good start, he then hits the home stretch and goes badly awry with regards to the Second Amendment:</p><blockquote class=\"tr_bq\"><p> One of the greatest impediments to actually solving the riddle of guns<br> in our society is the pious concern that many people have about the<br> intent of the Second Amendment. It should hardly need to be said that<br> despite its brilliance and utility, the Constitution of the United<br> States was written by men who could not possibly have foreseen every<br> change that would occur in American society in the ensuing centuries.<br> Even if the Second Amendment guaranteed everyone the right to possess<br> whatever weapon he or she desired (it doesn’t), we have since invented<br> weapons that no civilian should be allowed to own. In fact, it can be<br> easily argued that original intent of the Second Amendment had nothing<br> to do with the right of self-defense—which remains the ethical case to<br> be made for owning a firearm. The amendment seems to have been written<br> to allow the states to check the power of the federal government by<br> maintaining their militias. Given the changes that have occurred in our<br> military, and even in our politics, the idea that a few pistols and an<br> AR 15 in every home constitutes a necessary bulwark against<br> totalitarianism is fairly ridiculous. If you believe that the armed<br> forces of the United States might one day come for you—and you think<br> your cache of small arms will suffice to defend you if they do—I’ve got a<br> black helicopter to sell you.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>It never ceases to astonish me that a document written by a group of individuals who successfully engaged in an armed rebellion against their own government is so often interpreted to mean literally everything but what it quite clearly means. Harris reveals his customary ignorance of history here; I would recommend that he consider more closely the complete inability of the US military to confiscate the weaponry of the Afghan people and its relative vulnerability in the USA compared to its bases in Afghanistan.</p><p>I’d also recommend that he think hard about the obvious lesson of Oslo.  The hundreds of thousands of caches of small arms throughout America will not suffice to defend any one individual from the armed forces of the United States, but then, what is defending the armed forces of the United States from millions of armed individuals?</p></div>",
  "content_text": "Sam Harris writes what is\na surprisingly good article\non guns and gun control, at least for the first three-quarters of the article:\nCoverage of the Newtown tragedy and its aftermath has been generally\nabysmal. In fact, I have never seen the “liberal media” conform to\nright-wing caricatures of itself with such alacrity. I have read\narticles in which literally everything said about firearms and\nballistics has been wrong. I have heard major newscasters mispronounce\nthe names of every weapon and weapons manufacturer more challenging than\n“Colt.” I can only imagine the mirth it has brought gun-rights zealots\nto see “automatic” and “semi-automatic” routinely confused, or to hear a\nmajor news anchor ominously declare that the shooter had been armed\nwith a “Sig Sauzer” pistol. This has been more than embarrassing. It has\noffered a thousand points of proof that “liberal elites” don’t know\nanything about what matters when bullets start flying….\nMost liberals responded derisively to the NRA’s suggestion that having\narmed and vetted men and women in our schools could save lives.  Some\npointed to a public-service announcement put out by the city of Houston\n(funded by the Department of Homeland Security), in which the\npossibility of having guns on the scene was never discussed. Several\ncommentators held up this training video in support of the creed “More\nguns are not the answer.” Please take a few minutes to\nwatch this footage\n. Then try to imagine how a few armed civilians could respond during an attack of this kind. To help your imagination along,\nwatch this short video\n,\nin which a motel clerk carrying a concealed weapon shoots an armed\nrobber. The situation isn’t perfectly analogous—the wisdom of using\ndeadly force in what might be only a robbery is at least debatable. But\nis it really so difficult to believe that the shooter might have been\nhelpful during an incident of the sort depicted in Houston?\nUnfortunately, after that very good start, he then hits the home stretch and goes badly awry with regards to the Second Amendment:\nOne of the greatest impediments to actually solving the riddle of guns\nin our society is the pious concern that many people have about the\nintent of the Second Amendment. It should hardly need to be said that\ndespite its brilliance and utility, the Constitution of the United\nStates was written by men who could not possibly have foreseen every\nchange that would occur in American society in the ensuing centuries.\nEven if the Second Amendment guaranteed everyone the right to possess\nwhatever weapon he or she desired (it doesn’t), we have since invented\nweapons that no civilian should be allowed to own. In fact, it can be\neasily argued that original intent of the Second Amendment had nothing\nto do with the right of self-defense—which remains the ethical case to\nbe made for owning a firearm. The amendment seems to have been written\nto allow the states to check the power of the federal government by\nmaintaining their militias. Given the changes that have occurred in our\nmilitary, and even in our politics, the idea that a few pistols and an\nAR 15 in every home constitutes a necessary bulwark against\ntotalitarianism is fairly ridiculous. If you believe that the armed\nforces of the United States might one day come for you—and you think\nyour cache of small arms will suffice to defend you if they do—I’ve got a\nblack helicopter to sell you.\nIt never ceases to astonish me that a document written by a group of individuals who successfully engaged in an armed rebellion against their own government is so often interpreted to mean literally everything but what it quite clearly means. Harris reveals his customary ignorance of history here; I would recommend that he consider more closely the complete inability of the US military to confiscate the weaponry of the Afghan people and its relative vulnerability in the USA compared to its bases in Afghanistan.\nI’d also recommend that he think hard about the obvious lesson of Oslo.  The hundreds of thousands of caches of small arms throughout America will not suffice to defend any one individual from the armed forces of the United States, but then, what is defending the armed forces of the United States from millions of armed individuals?",
  "tags": [
    "gun control"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-04T17:01:00+00:00"
}