{
  "url": "https://voxday.net/2013/01/04/sfwa-platform-first-five-points/",
  "scraped_at": "2025-12-14T22:16:50.597332",
  "title": "SFWA Platform: the first five points",
  "date_display": "January 4, 2013",
  "date_iso": "2013-01-04T13:47:00+00:00",
  "date_from_url": "2013-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As some of you already know, I have declared myself to be a candidate for the SFWA president in the next election, which takes place this spring.  Here are the first five points of my platform; I’m interested in any ideas for improving them:</p><ol><li><div style=\"margin-bottom: 0in;\"> SPLIT THE NEBULA AWARDS: Science<br> fiction is not fantasy.  Fantasy is not science fiction.  I propose<br> doubling the number of Nebula Awards, and presenting awards for Best<br> Novel, Best Novella, Best Novellette, Best Short Story, and Best<br> Script in two categories, Science Fiction and Fantasy.</br></br></br></br></div></li><li><div style=\"margin-bottom: 0in;\"> AWARD A CASH PRIZE FOR BOTH BEST<br> NOVEL AWARDS: A $5,000 prize will be awarded to the winner of Best<br> Novel:Science Fiction as well as to the winner of Best<br> Novel:Fantasy.  The long term goal will be to work towards making<br> the winning of a Nebula a more prestigious and financially valuable<br> event than winning the Man Booker Prize.</br></br></br></br></br></div></li><li><div style=\"margin-bottom: 0in;\"> EXPAND THE MEMBERSHIP: The right<br> to SFWA membership will be granted to all self-published and small<br> press-published authors who have sold more than a specified number<br> of ebooks to be determined, eligibility number to be confirmed via<br> official Amazon report.  It will also be granted to all SF/F-related<br> computer game lead designers, senior designers, and writers with<br> primary credits on two or more SF/F-related games.</br></br></br></br></br></br></div></li><li><div style=\"margin-bottom: 0in;\"> ELIMINATE THE APPEARANCE OF<br> CORRUPTION IN THE AWARD PROCESS: Closing the nomination process to<br> the membership and the public made the appearance of corruption<br> worse, not better.  Reducing the number of recommendations to reduce<br> logrolling was a good idea, hiding the results from the membership<br> created more harm than good.</br></br></br></br></br></div></li><li><div style=\"margin-bottom: 0in;\"> EMPOWERING THE NEBULA JURIES: The<br> most prestigious and lucrative literary prizes are awarded by<br> juries.  The Nebulas should be no different if they are to attain<br> equal prestige.  I am entirely open to a debate about the best way<br> to ensure jury integrity, but my initial thought is to randomly<br> select the juries from the membership, with jurors barred from<br> voting for works published by their publishers. In situations where<br> the latter bar would lead to an obvious injustice being done, the<br> SFWA President and Vice-President would have the ability to release<br> a juror from the bar on a case-by-case basis if they both agreed<br> such an act was justified by the quality of the work in question.</br></br></br></br></br></br></br></br></br></br></div></li></ol></div>",
  "content_text": "As some of you already know, I have declared myself to be a candidate for the SFWA president in the next election, which takes place this spring.  Here are the first five points of my platform; I’m interested in any ideas for improving them:\nSPLIT THE NEBULA AWARDS: Science\nfiction is not fantasy.  Fantasy is not science fiction.  I propose\ndoubling the number of Nebula Awards, and presenting awards for Best\nNovel, Best Novella, Best Novellette, Best Short Story, and Best\nScript in two categories, Science Fiction and Fantasy.\nAWARD A CASH PRIZE FOR BOTH BEST\nNOVEL AWARDS: A $5,000 prize will be awarded to the winner of Best\nNovel:Science Fiction as well as to the winner of Best\nNovel:Fantasy.  The long term goal will be to work towards making\nthe winning of a Nebula a more prestigious and financially valuable\nevent than winning the Man Booker Prize.\nEXPAND THE MEMBERSHIP: The right\nto SFWA membership will be granted to all self-published and small\npress-published authors who have sold more than a specified number\nof ebooks to be determined, eligibility number to be confirmed via\nofficial Amazon report.  It will also be granted to all SF/F-related\ncomputer game lead designers, senior designers, and writers with\nprimary credits on two or more SF/F-related games.\nELIMINATE THE APPEARANCE OF\nCORRUPTION IN THE AWARD PROCESS: Closing the nomination process to\nthe membership and the public made the appearance of corruption\nworse, not better.  Reducing the number of recommendations to reduce\nlogrolling was a good idea, hiding the results from the membership\ncreated more harm than good.\nEMPOWERING THE NEBULA JURIES: The\nmost prestigious and lucrative literary prizes are awarded by\njuries.  The Nebulas should be no different if they are to attain\nequal prestige.  I am entirely open to a debate about the best way\nto ensure jury integrity, but my initial thought is to randomly\nselect the juries from the membership, with jurors barred from\nvoting for works published by their publishers. In situations where\nthe latter bar would lead to an obvious injustice being done, the\nSFWA President and Vice-President would have the ability to release\na juror from the bar on a case-by-case basis if they both agreed\nsuch an act was justified by the quality of the work in question.",
  "tags": [
    "SFWA",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-04T13:47:00+00:00"
}