{
  "url": "https://voxday.net/2013/01/05/spenglerian-decline/",
  "scraped_at": "2025-12-14T22:16:55.734200",
  "title": "Spenglerian decline",
  "date_display": "January 5, 2013",
  "date_iso": "2013-01-05T10:19:00+00:00",
  "date_from_url": "2013-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Robert Merry writes of the decline of the West as prophesied by Oswald Spengler 91 years ago in <a href=\"http://nationalinterest.org/article/spenglers-ominous-prophecy-7878?page=show\">The National Interest</a>:</p><blockquote class=\"tr_bq\"><p> But modern Westerners—and Americans in particular—might want to<br> ponder the implications of Spengler’s prediction that the first nation<br> of the West would lead that civilization into an era of imperialism in<br> corollary with serious erosions in its democratic structures. Is it<br> possible that the mystical German thinker was right about that, just as<br> he was right in so many other predictions regarding Western behavioral<br> and cultural patterns? And isn’t the great foreign-policy debate of our<br> time—whether America should continue its post–Cold War policy of<br> interventionism in the name of American exceptionalism and Western<br> universalism; or whether it should abandon that mission in favor of a<br> more measured exercise of its military and economic power—fundamentally a<br> debate over whether Spengler had it right?</br></br></br></br></br></br></br></br></br></br></br></p><p>What’s interesting about today’s foreign-policy debates is the<br> disconnection between the country’s national leaders and the populace at<br> large. The Republican Party is dominated by a neoconservative<br> sensibility that favors widespread American involvement in overseas<br> places such as Iraq, Afghanistan, Libya, Syria and Iran, while the<br> Democratic Party is influenced heavily by a Wilsonian sensibility of<br> moral imperative that often leads to the same interventionist advocacy,<br> though sometimes for different reasons. And yet public-opinion surveys<br> show that the American people harbor strong reservations about such<br> interventionist vigor of either stripe.</br></br></br></br></br></br></br></br></br></p><p>Thus, it sometimes seems as if America is on autopilot as it moves<br> haltingly but with seemingly inexorable force toward ever-greater<br> involvement in the world even as discomfort increases within the<br> electorate. But what about Spengler’s corollary prediction that the<br> West’s democratic forms will erode as it fulfills its civilizational<br> push to empire? Certainly, there is no popular sentiment for such a<br> thing. Yet here too we see signs that the country is headed in that<br> direction, reflected in a growing tendency toward arrogation of power on<br> the part of the nation’s executive, at the expense of Congress, and<br> Congress’s supine acquiescence in this trend. It’s seen also in the<br> Federal Reserve’s remarkable power grab of recent years whereby it has<br> circumvented the congressional appropriations process in making funds<br> available to banks to execute its “quantitative easing” policies of<br> loose money. Again, Congress has quietly accepted this incursion into<br> its constitutional domain without so much as a whimper.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>And so we come to the truly haunting question that confronts America<br> in these times of growing global instability—whether, as the last nation<br> of the West, America is destined to fulfill Spengler’s vision of<br> hegemonic zeal mixed with a push toward dictatorship. Here’s where the<br> natural aversion to Spengler’s dogmatic determinism will likely come<br> into play. The answer is no, America’s future is in American hands. But<br> Spengler’s audacious work stands as a great warning to Americans bent on<br> protecting the hallowed civic institutions established at the founding<br> of their Republic. The era of Western cultural health is dead, and it<br> died pretty much as Spengler predicted it would. And no doubt his study<br> of previous great civilizations did in fact accurately identify<br> pressures and forces that emerge at particular points in civilizational<br> development and push toward empire and Caesarism. This push can be<br> resisted by a free people dedicated to the protection of their<br> institutions of old. But they won’t be protected if events are placed on<br> autopilot. The American impulse toward imperialism will prevail if it<br> is not rebuffed consciously by the American people and their leaders.<br> And if it prevails it will leave a tattered democratic republic in its<br> wake. Then Oswald Spengler will have the last laugh.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I haven’t read Spengler’s magnum opus yet, although I intend to do so once I finish the very good Waugh novel that I am presently reading.  (<i>Scoop </i>is, in its own small way, a chronicle of decline too.) However, it will come as no surprise to most of you that I have reached similar conclusions; it is always a little disconcerting to discover that one’s legitimately original theses were not only anticipated before one was born, but anticipated by a man who didn’t have the advantage of literal decades of events from which to judge.  Spengler was on the other side of the Western civilizational peak from us, and yet from what I read in Merry’s long article, many of the conclusions he reached based on logic are quite similar to the observations I and various others have made based on events.</p><p>Even the most die-hard feminist should be at least a little troubled by the way a man from the pre-feminist era was able to correctly predict the way feminism has led to increased authoritarianism and concerned that he will be similarly correct about its link to civilizational decline. I doubt this will be enough to cause any of them to rethink their devotion to their poisonous ideology; feminists are not known for their introspection so much as their solipsisim, after all.</p><p>And besides, feminism is less the cause than the symptom.  It may happen to be the particular mechanism by which the West falls, but given the fate of the past great civilizations, if it had not been that mechanism, it would simply have been another.</p><p>I do find Merry’s declaration that “America’s future is in American hands” to be more than a little facile, however.  This is manifestly not the case, not with all three branches of government increasingly and disproportionately populated by second- and third-generation immigrants, and an electorate that has never had less cultural and intellectual connection to the American political tradition.  I don’t know yet what Spengler has to say about alien governance and mass immigration, but based on my own knowledge of civilizational decline, I suspect the fact that America’s future is not actually in American hands will tend to support the applicability of his theory of decline to the present situation.</p></div>",
  "content_text": "Robert Merry writes of the decline of the West as prophesied by Oswald Spengler 91 years ago in\nThe National Interest\n:\nBut modern Westerners—and Americans in particular—might want to\nponder the implications of Spengler’s prediction that the first nation\nof the West would lead that civilization into an era of imperialism in\ncorollary with serious erosions in its democratic structures. Is it\npossible that the mystical German thinker was right about that, just as\nhe was right in so many other predictions regarding Western behavioral\nand cultural patterns? And isn’t the great foreign-policy debate of our\ntime—whether America should continue its post–Cold War policy of\ninterventionism in the name of American exceptionalism and Western\nuniversalism; or whether it should abandon that mission in favor of a\nmore measured exercise of its military and economic power—fundamentally a\ndebate over whether Spengler had it right?\nWhat’s interesting about today’s foreign-policy debates is the\ndisconnection between the country’s national leaders and the populace at\nlarge. The Republican Party is dominated by a neoconservative\nsensibility that favors widespread American involvement in overseas\nplaces such as Iraq, Afghanistan, Libya, Syria and Iran, while the\nDemocratic Party is influenced heavily by a Wilsonian sensibility of\nmoral imperative that often leads to the same interventionist advocacy,\nthough sometimes for different reasons. And yet public-opinion surveys\nshow that the American people harbor strong reservations about such\ninterventionist vigor of either stripe.\nThus, it sometimes seems as if America is on autopilot as it moves\nhaltingly but with seemingly inexorable force toward ever-greater\ninvolvement in the world even as discomfort increases within the\nelectorate. But what about Spengler’s corollary prediction that the\nWest’s democratic forms will erode as it fulfills its civilizational\npush to empire? Certainly, there is no popular sentiment for such a\nthing. Yet here too we see signs that the country is headed in that\ndirection, reflected in a growing tendency toward arrogation of power on\nthe part of the nation’s executive, at the expense of Congress, and\nCongress’s supine acquiescence in this trend. It’s seen also in the\nFederal Reserve’s remarkable power grab of recent years whereby it has\ncircumvented the congressional appropriations process in making funds\navailable to banks to execute its “quantitative easing” policies of\nloose money. Again, Congress has quietly accepted this incursion into\nits constitutional domain without so much as a whimper.\nAnd so we come to the truly haunting question that confronts America\nin these times of growing global instability—whether, as the last nation\nof the West, America is destined to fulfill Spengler’s vision of\nhegemonic zeal mixed with a push toward dictatorship. Here’s where the\nnatural aversion to Spengler’s dogmatic determinism will likely come\ninto play. The answer is no, America’s future is in American hands. But\nSpengler’s audacious work stands as a great warning to Americans bent on\nprotecting the hallowed civic institutions established at the founding\nof their Republic. The era of Western cultural health is dead, and it\ndied pretty much as Spengler predicted it would. And no doubt his study\nof previous great civilizations did in fact accurately identify\npressures and forces that emerge at particular points in civilizational\ndevelopment and push toward empire and Caesarism. This push can be\nresisted by a free people dedicated to the protection of their\ninstitutions of old. But they won’t be protected if events are placed on\nautopilot. The American impulse toward imperialism will prevail if it\nis not rebuffed consciously by the American people and their leaders.\nAnd if it prevails it will leave a tattered democratic republic in its\nwake. Then Oswald Spengler will have the last laugh.\nI haven’t read Spengler’s magnum opus yet, although I intend to do so once I finish the very good Waugh novel that I am presently reading.  (\nScoop\nis, in its own small way, a chronicle of decline too.) However, it will come as no surprise to most of you that I have reached similar conclusions; it is always a little disconcerting to discover that one’s legitimately original theses were not only anticipated before one was born, but anticipated by a man who didn’t have the advantage of literal decades of events from which to judge.  Spengler was on the other side of the Western civilizational peak from us, and yet from what I read in Merry’s long article, many of the conclusions he reached based on logic are quite similar to the observations I and various others have made based on events.\nEven the most die-hard feminist should be at least a little troubled by the way a man from the pre-feminist era was able to correctly predict the way feminism has led to increased authoritarianism and concerned that he will be similarly correct about its link to civilizational decline. I doubt this will be enough to cause any of them to rethink their devotion to their poisonous ideology; feminists are not known for their introspection so much as their solipsisim, after all.\nAnd besides, feminism is less the cause than the symptom.  It may happen to be the particular mechanism by which the West falls, but given the fate of the past great civilizations, if it had not been that mechanism, it would simply have been another.\nI do find Merry’s declaration that “America’s future is in American hands” to be more than a little facile, however.  This is manifestly not the case, not with all three branches of government increasingly and disproportionately populated by second- and third-generation immigrants, and an electorate that has never had less cultural and intellectual connection to the American political tradition.  I don’t know yet what Spengler has to say about alien governance and mass immigration, but based on my own knowledge of civilizational decline, I suspect the fact that America’s future is not actually in American hands will tend to support the applicability of his theory of decline to the present situation.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-05T10:19:00+00:00"
}