{
  "url": "https://voxday.net/2013/01/03/the-left-side-of-arc/",
  "scraped_at": "2025-12-14T22:16:43.292268",
  "title": "The left side of the arc",
  "date_display": "January 3, 2013",
  "date_iso": "2013-01-03T10:56:00+00:00",
  "date_from_url": "2013-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A number of readers have commented that A THRONE OF BONES is significantly improved, in terms of their perception of its literary quality, over my previous novels.  I myself have the sense that I know what I’m doing now in a way that I simply did not 10 years ago, and that while I feel too jaded and indifferent to be writing what could be described as “angry young man” commentary anymore – hence the column retirement – I feel extraordinarily energetic with regards to the novel writing.  Producing 7,500 words of fiction per week comes relatively easily now, whereas the weekly 750-word columns that used to flow like water had increasingly become difficult.</p><p>So, I found Steve Sailer’s analysis of PG Wodehouse to be very interesting in this regard, as it seems to indicates that one’s forties, fifties, and even sixties are the writer’s prime novel-writing season.</p><blockquote class=\"tr_bq\"><p> The consistency of ratings over time is the most striking fact. But a<br> few temporal patterns can be discerned due to the huge sample sizes of<br> raters. <i>My Man Jeeves</i> at age 37 was a rookie effort, falling 0.13<br> points below his career mean. Wodehouse hit a long peak from his early<br> 40s into his early 60s with six straight Jeeves novels rated above his<br> career average, but his ratings slip only marginally in his old age….</br></br></br></br></br></p><div align=\"left\"></div><div align=\"left\"> The peak is probably 1938’s (age 56) <i>The Code of the Woosters. </i>The<br> topical political satire of Oswald Mosley, leader of the British Union<br> of Fascist Blackshirts, as Bertie’s nemesis Sir Roderick Spode, leader<br> of the Blackshorts, makes the book stand out. </br></br></br></div><div align=\"left\"></div><div align=\"left\"> The next novel was 1946’s (age 64)<i> Jeeves in the Morning</i> (formerly <i>Joy in the Morning</i>),<br> which Wodehouse had a lot of time to work on while he was interned by<br> the Nazis (he was caught at his beach home in France in 1940). It has<br> equally high ratings as <i>Code of the Woosters</i>, although fewer raters. In <a href=\"http://www.nybooks.com/articles/archives/1982/sep/23/the-natural-artificer/?pagination=false\">1982</a>, Alexander Cockburn designated <i>Code</i> and <i>Morning</i> to be the peaks of the series.</br></br></br></div><div align=\"left\"></div><div align=\"left\"> <i>Ring for Jeeves</i> (age 71) is the most obvious dud, but Wodehouse rebounded well. For example, <i>Stiff Upper Lip, Jeeves</i>, published when he was about age 81, garnered above average ratings from over 3,000 raters. That’s pretty extraordinary.</div></blockquote><p>On the one hand, one could argue that I started writing novels too early.  Or, at least, <i>publishing </i>them too early.  Wasn’t it Hemingway who said that everyone had a million worthless words inside them that they had to get out before writing anything decent?  I’m finally past that point now, and it is encouraging to know that I’m likely on the left side of the career arc, and so long as I put in the effort, can anticipate continued improvement over the next twenty years.</p></div>",
  "content_text": "A number of readers have commented that A THRONE OF BONES is significantly improved, in terms of their perception of its literary quality, over my previous novels.  I myself have the sense that I know what I’m doing now in a way that I simply did not 10 years ago, and that while I feel too jaded and indifferent to be writing what could be described as “angry young man” commentary anymore – hence the column retirement – I feel extraordinarily energetic with regards to the novel writing.  Producing 7,500 words of fiction per week comes relatively easily now, whereas the weekly 750-word columns that used to flow like water had increasingly become difficult.\nSo, I found Steve Sailer’s analysis of PG Wodehouse to be very interesting in this regard, as it seems to indicates that one’s forties, fifties, and even sixties are the writer’s prime novel-writing season.\nThe consistency of ratings over time is the most striking fact. But a\nfew temporal patterns can be discerned due to the huge sample sizes of\nraters.\nMy Man Jeeves\nat age 37 was a rookie effort, falling 0.13\npoints below his career mean. Wodehouse hit a long peak from his early\n40s into his early 60s with six straight Jeeves novels rated above his\ncareer average, but his ratings slip only marginally in his old age….\nThe peak is probably 1938’s (age 56)\nThe Code of the Woosters.\nThe\ntopical political satire of Oswald Mosley, leader of the British Union\nof Fascist Blackshirts, as Bertie’s nemesis Sir Roderick Spode, leader\nof the Blackshorts, makes the book stand out.\nThe next novel was 1946’s (age 64)\nJeeves in the Morning\n(formerly\nJoy in the Morning\n),\nwhich Wodehouse had a lot of time to work on while he was interned by\nthe Nazis (he was caught at his beach home in France in 1940). It has\nequally high ratings as\nCode of the Woosters\n, although fewer raters. In\n1982\n, Alexander Cockburn designated\nCode\nand\nMorning\nto be the peaks of the series.\nRing for Jeeves\n(age 71) is the most obvious dud, but Wodehouse rebounded well. For example,\nStiff Upper Lip, Jeeves\n, published when he was about age 81, garnered above average ratings from over 3,000 raters. That’s pretty extraordinary.\nOn the one hand, one could argue that I started writing novels too early.  Or, at least,\npublishing\nthem too early.  Wasn’t it Hemingway who said that everyone had a million worthless words inside them that they had to get out before writing anything decent?  I’m finally past that point now, and it is encouraging to know that I’m likely on the left side of the career arc, and so long as I put in the effort, can anticipate continued improvement over the next twenty years.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-03T10:56:00+00:00"
}