{
  "url": "https://voxday.net/2013/01/25/the-uk-and-triple-dip/",
  "scraped_at": "2025-12-14T22:18:34.914001",
  "title": "The UK and the “triple-dip”",
  "date_display": "January 25, 2013",
  "date_iso": "2013-01-25T07:46:00+00:00",
  "date_from_url": "2013-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Forget the “double-dip”.  Now we’re expected to believe that <a href=\"http://www.guardian.co.uk/business/2013/jan/11/economy-triple-dip-recession-niesr\">a “triple-dip” recession is nigh</a>:</p><blockquote class=\"tr_bq\"><p> Economists believe the chances of such a scenario are high, given<br> that there has been no let up in the pressure on consumers and<br> businesses and snow disruption threatens to cost the economy an<br> estimated £500 million a day.</br></br></br></p><p>There is no official definition of a<br> triple dip, but it is widely accepted to mean that the economy has<br> fallen into recession three times without returning to a period of<br> robust growth in between. The UK plunged into a double dip<br> recession last year, contracting for three quarters in a row before<br> bouncing back with growth of 0.9% in the three months to September.</br></br></br></br></br></p><p>According<br> to the Office for National Statistics, there has not been a triple dip<br> recession since its records began in 1955, with Britain last suffering<br> such economic gloom in the Great Depression. </br></br></br></p></blockquote><p>There is no triple-dip recession.  There was no double-dip recession.  This is, as I have been saying since 2008, the Great Depression 2.0.  It is larger in scope than its predecessor and it is gradually revealing the concrete shortcomings of the reported economics statistics.</p><p>It is also interesting how we don’t hear much about the ongoing “economic recovery” in the USA anymore even though the GDP numbers are still nominally positive.</p></div>",
  "content_text": "Forget the “double-dip”.  Now we’re expected to believe that\na “triple-dip” recession is nigh\n:\nEconomists believe the chances of such a scenario are high, given\nthat there has been no let up in the pressure on consumers and\nbusinesses and snow disruption threatens to cost the economy an\nestimated £500 million a day.\nThere is no official definition of a\ntriple dip, but it is widely accepted to mean that the economy has\nfallen into recession three times without returning to a period of\nrobust growth in between. The UK plunged into a double dip\nrecession last year, contracting for three quarters in a row before\nbouncing back with growth of 0.9% in the three months to September.\nAccording\nto the Office for National Statistics, there has not been a triple dip\nrecession since its records began in 1955, with Britain last suffering\nsuch economic gloom in the Great Depression.\nThere is no triple-dip recession.  There was no double-dip recession.  This is, as I have been saying since 2008, the Great Depression 2.0.  It is larger in scope than its predecessor and it is gradually revealing the concrete shortcomings of the reported economics statistics.\nIt is also interesting how we don’t hear much about the ongoing “economic recovery” in the USA anymore even though the GDP numbers are still nominally positive.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-25T07:46:00+00:00"
}