{
  "url": "https://voxday.net/2013/01/30/triple-dip/",
  "scraped_at": "2025-12-14T22:19:08.095755",
  "title": "Triple-dip",
  "date_display": "January 30, 2013",
  "date_iso": "2013-01-30T20:00:00+00:00",
  "date_from_url": "2013-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not that the BEA figures actually matter any more than any other fiction being published these days, but now that Obama has been safely re-elected, <a href=\"http://www.zerohedge.com/news/2013-01-30/shrinkage-us-economy-declined-01-q4\">the economic bad news can be released</a> again:</p><blockquote class=\"tr_bq\"><p> A stunner <a href=\"http://www.bea.gov/newsreleases/national/gdp/2013/pdf/gdp4q12_adv.pdf\">out of the BEA </a>which <b>just reported a Q4 GDP of -0.1% </b>that<br> was leaps and bounds below the 1.1% estimate, and a plunge from Q3’s<br> 3.1%. The factors: Private Inventories, Exports and Government<br> Expenditures all of which contracted, by -1.27%, -0.81%, and -1.33%. The<br> silver lining was in Personal Consumption Expenditures which added<br> 1.52% to the negative print, most of it however driven by a surge in<br> spending ahead of the fiscal cliff. Ironically, this was the biggest<br> government-driven detraction from growth since Q1 2011, when GDP led to a<br> -1.49% cut in the GDP, same in Q4 when government spending on defense<br> fell the most since 1972. The solution is simple: <i>print moar drones</i>. Enter Mali. And since everything is now AMZN-ing, we can’t wait for the spin that the GDP’s <i>margins </i>were actually better than expected, leading to a 200 point surge in the DJIA.</br></br></br></br></br></br></br></br></br></p></blockquote><p>How many recessionary dips will it take before the mainstream financial media admits that we’ve been in a depression since 2008?  My guess is five.</p></div>",
  "content_text": "Not that the BEA figures actually matter any more than any other fiction being published these days, but now that Obama has been safely re-elected,\nthe economic bad news can be released\nagain:\nA stunner\nout of the BEA\nwhich\njust reported a Q4 GDP of -0.1%\nthat\nwas leaps and bounds below the 1.1% estimate, and a plunge from Q3’s\n3.1%. The factors: Private Inventories, Exports and Government\nExpenditures all of which contracted, by -1.27%, -0.81%, and -1.33%. The\nsilver lining was in Personal Consumption Expenditures which added\n1.52% to the negative print, most of it however driven by a surge in\nspending ahead of the fiscal cliff. Ironically, this was the biggest\ngovernment-driven detraction from growth since Q1 2011, when GDP led to a\n-1.49% cut in the GDP, same in Q4 when government spending on defense\nfell the most since 1972. The solution is simple:\nprint moar drones\n. Enter Mali. And since everything is now AMZN-ing, we can’t wait for the spin that the GDP’s\nmargins\nwere actually better than expected, leading to a 200 point surge in the DJIA.\nHow many recessionary dips will it take before the mainstream financial media admits that we’ve been in a depression since 2008?  My guess is five.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-30T20:00:00+00:00"
}