{
  "url": "https://voxday.net/2013/01/10/why-girls-get-better-grades/",
  "scraped_at": "2025-12-14T22:17:22.586620",
  "title": "Why girls get better grades",
  "date_display": "January 10, 2013",
  "date_iso": "2013-01-10T18:26:00+00:00",
  "date_from_url": "2013-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It isn’t because they actually know the material better, but because <a href=\"http://www.hookingupsmart.com/2013/01/10/politics-and-feminism/the-shameful-truth-about-our-treatment-of-boys/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+HookingUpSmart+%28Hooking+Up+Smart%29\">they don’t annoy the teacher</a>:</p><blockquote class=\"tr_bq\"><p> Despite having higher scores on standardized tests, boys get lower<br> grades than girls. Why? Because teachers are basing grades at least<br> partly on classroom behavior, and the standards are very much geared to<br> female norms….</br></br></br></p><p>“Boys in all racial categories across all subject areas are not<br> represented in grade distributions where their test scores would<br> predict. Even those boys who perform equally as well as girls on<br> reading, math and science tests are nevertheless graded less favorably<br> by their teachers.”</br></br></br></br></p></blockquote><p>In summary, girls are able to substitute apple-polishing and classroom etiquette for an amount of knowing the material, and they are being rewarded for it, beginning in kindergarten.  Their better grades are eventually used to give them priority of place in college, thereby leading observers to erroneously conclude that they are “outperforming” men. </p><p>Unsurprisingly, the boys who are smart enough to figure out the deck is stacked against them lose all respect for the system and opt out in varying degrees.</p></div>",
  "content_text": "It isn’t because they actually know the material better, but because\nthey don’t annoy the teacher\n:\nDespite having higher scores on standardized tests, boys get lower\ngrades than girls. Why? Because teachers are basing grades at least\npartly on classroom behavior, and the standards are very much geared to\nfemale norms….\n“Boys in all racial categories across all subject areas are not\nrepresented in grade distributions where their test scores would\npredict. Even those boys who perform equally as well as girls on\nreading, math and science tests are nevertheless graded less favorably\nby their teachers.”\nIn summary, girls are able to substitute apple-polishing and classroom etiquette for an amount of knowing the material, and they are being rewarded for it, beginning in kindergarten.  Their better grades are eventually used to give them priority of place in college, thereby leading observers to erroneously conclude that they are “outperforming” men.\nUnsurprisingly, the boys who are smart enough to figure out the deck is stacked against them lose all respect for the system and opt out in varying degrees.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-10T18:26:00+00:00"
}