{
  "url": "https://voxday.net/2013/01/28/women-ruin-everything/",
  "scraped_at": "2025-12-14T22:18:52.504879",
  "title": "Women ruin everything",
  "date_display": "January 28, 2013",
  "date_iso": "2013-01-28T08:48:00+00:00",
  "date_from_url": "2013-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even, ironically enough, <a href=\"http://www.post-gazette.com/stories/sports/high-school-other/families-try-to-prevent-boys-playing-girls-sports-672174/\">TITLE IX</a>.  I’m skeptical that even the most confirmed cynic could have seen this one coming.  This isn’t fourth- or fifth-wave feminism, we have clearly progressed all the way into the fantastic realm of metafeminism.</p><blockquote class=\"tr_bq\"><p> In fall 2011, faced with the prospect of another season watching<br> their daughter, Rose, play field hockey against boys, the Grenens had<br> finally had enough. They wrote to the PIAA, which invited them to come<br> to its offices in Mechanicsburg and give a PowerPoint presentation. At<br> the meeting, in January 2012, Mrs. Grenen figured that she would have to<br> persuade the PIAA to be on her side. But in the middle of the meeting,<br> someone interrupted her.</br></br></br></br></br></br></p><p>“You’re preaching to the choir,” a man said.</p><p>The<br> PIAA had been discussing the issue for years, but it felt that its<br> hands were tied because of a Commonwealth Court order that was nearly<br> four decades old.  In 1973, the PIAA had a bylaw which stated,<br> “Girls shall not compete or practice against boys in any athletic<br> contest.” The attorney general asserted that this provision violated the<br> new Pennsylvania Equal Rights Amendment, which stated, “Equality of<br> rights under the law shall not be denied or abridged in the Commonwealth<br> of Pennsylvania because of the sex of the individual.”</br></br></br></br></br></br></br></br></p><p>In 1975,<br> Commonwealth Court entered an order that declared the PIAA bylaw<br> unconstitutional, saying, “The Pennsylvania Interscholastic Athletic<br> Association is hereby ordered to permit girls to practice and compete<br> with boys in interscholastic athletics … .”</br></br></br></br></p><p>At the time of the<br> order, few girls-only sports were offered. The order was meant to give<br> girls who wanted to play sports offered only for boys the opportunity to<br> do so. As the years passed, and more girls teams were created, the<br> order began to be interpreted so that boys could also play on girls<br> teams if the sport was offered only for girls — which had the opposite<br> effect of the order’s original intent.  The only way for the PIAA<br> to change the interpretation of the order was to have the case reopened<br> — a task that would take legal man-hours and resources that the PIAA<br> didn’t feel it had. Basically, the PIAA needed people like the Grenens<br> to fight the battle, and the organization would be glad to offer its<br> support.</br></br></br></br></br></br></br></br></br></br></br></p><p>“It could be a large expense, and we still don’t know the<br> outcome,” said Bob Lombardi, the PIAA executive director. “The Grenens<br> have provided a great opportunity because they are attorneys to work on<br> this.”</br></br></br></p><p>Key to the Grenens’ hope for reopening the case was a 1985<br> interpretation of the Pennsylvania ERA that said the ERA “does not<br> prohibit differential treatment among the sexes when that treatment is<br> reasonable and genuinely based on physical characteristics unique to one<br> sex.”</br></br></br></br></p><p>In fall 2012, the Grenens filed a petition with<br> Commonwealth Court to reopen the 1975 case. The court granted the<br> request — a huge victory and likely the only hope to change the status<br> quo.</br></br></br></p><p>On Feb. 26, the Grenens, the PIAA and representatives from<br> the attorney general’s office will meet in Harrisburg for a status<br> conference. The Grenens and the PIAA’s hope is that they will agree on a<br> common-sense bylaw that will outlaw boys playing on girls’ teams while<br> staying in accordance with the ERA.</br></br></br></br></p></blockquote><p>In other words, we are expected to believe that legal equality means girls being able to play on boys teams, whether there are girls teams or not, but boys cannot play on girls teams, even if there are no boys teams upon which they can play.</p><p>Even if you think, well, what does it matter, it’s just sports, keep this in mind: Title IX is now being applied to science.  Orwell put it beautifully.  All animals are equal, but some animals are more equal than others.  And the Sports Guy put it even better: women ruin everything.</p><p>Do you really think it was an accident that women were never permitted any voice in the governance of the Roman Republic or the great historical democracies such as Athens, Thebes, Imperial Britain, and Revolutionary America?  Do you really believe it to be a mere coincidence that many modern democracies, including Germany, Italy, and the member states of the European Union, were not able to survive even 100 years of female suffrage?</p></div>",
  "content_text": "Even, ironically enough,\nTITLE IX\n.  I’m skeptical that even the most confirmed cynic could have seen this one coming.  This isn’t fourth- or fifth-wave feminism, we have clearly progressed all the way into the fantastic realm of metafeminism.\nIn fall 2011, faced with the prospect of another season watching\ntheir daughter, Rose, play field hockey against boys, the Grenens had\nfinally had enough. They wrote to the PIAA, which invited them to come\nto its offices in Mechanicsburg and give a PowerPoint presentation. At\nthe meeting, in January 2012, Mrs. Grenen figured that she would have to\npersuade the PIAA to be on her side. But in the middle of the meeting,\nsomeone interrupted her.\n“You’re preaching to the choir,” a man said.\nThe\nPIAA had been discussing the issue for years, but it felt that its\nhands were tied because of a Commonwealth Court order that was nearly\nfour decades old.  In 1973, the PIAA had a bylaw which stated,\n“Girls shall not compete or practice against boys in any athletic\ncontest.” The attorney general asserted that this provision violated the\nnew Pennsylvania Equal Rights Amendment, which stated, “Equality of\nrights under the law shall not be denied or abridged in the Commonwealth\nof Pennsylvania because of the sex of the individual.”\nIn 1975,\nCommonwealth Court entered an order that declared the PIAA bylaw\nunconstitutional, saying, “The Pennsylvania Interscholastic Athletic\nAssociation is hereby ordered to permit girls to practice and compete\nwith boys in interscholastic athletics … .”\nAt the time of the\norder, few girls-only sports were offered. The order was meant to give\ngirls who wanted to play sports offered only for boys the opportunity to\ndo so. As the years passed, and more girls teams were created, the\norder began to be interpreted so that boys could also play on girls\nteams if the sport was offered only for girls — which had the opposite\neffect of the order’s original intent.  The only way for the PIAA\nto change the interpretation of the order was to have the case reopened\n— a task that would take legal man-hours and resources that the PIAA\ndidn’t feel it had. Basically, the PIAA needed people like the Grenens\nto fight the battle, and the organization would be glad to offer its\nsupport.\n“It could be a large expense, and we still don’t know the\noutcome,” said Bob Lombardi, the PIAA executive director. “The Grenens\nhave provided a great opportunity because they are attorneys to work on\nthis.”\nKey to the Grenens’ hope for reopening the case was a 1985\ninterpretation of the Pennsylvania ERA that said the ERA “does not\nprohibit differential treatment among the sexes when that treatment is\nreasonable and genuinely based on physical characteristics unique to one\nsex.”\nIn fall 2012, the Grenens filed a petition with\nCommonwealth Court to reopen the 1975 case. The court granted the\nrequest — a huge victory and likely the only hope to change the status\nquo.\nOn Feb. 26, the Grenens, the PIAA and representatives from\nthe attorney general’s office will meet in Harrisburg for a status\nconference. The Grenens and the PIAA’s hope is that they will agree on a\ncommon-sense bylaw that will outlaw boys playing on girls’ teams while\nstaying in accordance with the ERA.\nIn other words, we are expected to believe that legal equality means girls being able to play on boys teams, whether there are girls teams or not, but boys cannot play on girls teams, even if there are no boys teams upon which they can play.\nEven if you think, well, what does it matter, it’s just sports, keep this in mind: Title IX is now being applied to science.  Orwell put it beautifully.  All animals are equal, but some animals are more equal than others.  And the Sports Guy put it even better: women ruin everything.\nDo you really think it was an accident that women were never permitted any voice in the governance of the Roman Republic or the great historical democracies such as Athens, Thebes, Imperial Britain, and Revolutionary America?  Do you really believe it to be a mere coincidence that many modern democracies, including Germany, Italy, and the member states of the European Union, were not able to survive even 100 years of female suffrage?",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-01-28T08:48:00+00:00"
}