{
  "url": "https://voxday.net/2018/04/15/a-flood-of-disinformation/",
  "scraped_at": "2025-12-19T20:57:38.988054",
  "title": "A flood of disinformation",
  "date_display": "April 15, 2018",
  "date_iso": "2018-04-15T17:00:22+00:00",
  "date_from_url": "2018-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The US ambassador insists that <a href=\"https://www.rt.com/usa/424204-us-troops-syria-pull-haley/\">the USA will not withdraw</a> from Syria soon, contra the President’s previous statements. The objectives have officially evolved.</p><blockquote><p>The US will not pull its troops out of Syria until its goals are accomplished there, ambassador to UN Nikki Haley said. This comes after Washington carried out airstrikes in Syria in response for an alleged chemical attack. US currently has over 2,000 troops in Syria and a number of contractors.</p><p>While it is America’s goals to see the troops come home, “we are not going to leave until we know we have accomplished those things,” she told Fox News Sunday.</p><p>Haley added the United States wants to ensure that chemical weapons are not used in a way that is of risk to US interests, the Islamic State (IS, formerly ISIS) is defeated and Iran’s actions are monitored.</p><p>US officials were previously saying that their goal in Syria is just defeating ISIS. President Donald Trump said earlier that US would withdraw from Syria “soon”  and Washington would “let the other people take care of it now,” but no deadline for any such move has been announced.</p></blockquote><p>That’s obviously not good. But then, if <a href=\"http://82.221.129.208/.zb0q.html\">these rumors</a> are true, the US will probably be withdrawing sooner rather than later, and there will be no more air strikes either.</p><blockquote><p>It appears Russia was going to attack, and the U.S. was threatened into stopping the attack. This is probably the case. When this started, it was “going to be sustained, lasting days”. Then a large number of Russian planes took off, and suddenly America stopped attacking after only about an hour….</p><p>How do you go from “we are going to attack in waves, for days” to “an hour into the battle let’s call it quits”? And it is now confirmed that the Russian missile systems knocked out virtually ALL American cruise missiles, resulting in a totally failed missile attack. A few planes dropped bombs and then went home, with nothing returning. I think America quit because:</p><ol><li>Russian defenses worked perfect, and America was watching its missiles go POOF on computer screens before they reached their targets, and</li><li>Russian war planes took off after the air defenses were very well proven, with confirmed destruction of practically all cruise missiles. That alone would not stop an American attack, but if any planes were carrying nukes it sure would, if it was proven Russian air defenses would escort those planes to their targets unscathed.</li></ol><p>The big proof: the “days long attack” lasted about an hour. SOMETHING HAPPENED.</p></blockquote><p>That’s not proof, let alone “big proof”. I haven’t seen any information that any Russian planes were launched anywhere, but we were told that Britain reports two hunter-killer subs <a href=\"http://www.dailymail.co.uk/news/article-5617799/Royal-Navy-submarine-hunted-Russia-cat-mouse-pursuit.html\">were stalking one of its submarines</a> carrying Tomahawk missiles, and that no missiles were launched from subs. In any event, the only way to determine who is telling the truth now is by watching to see what happens next. If there are more air strikes, that will be a strong indication that the Russians are seriously exaggerating. If there are not, that will be an indication, though less conclusive , that they are telling the truth now and the US has suffered a major blow to its military credibility.</p><p>It does seem a little strange that there should be so much sabre-rattling and posturing over a grand total of three targets in Syria, though. That offers minor support to the Russian account.</p></div>",
  "content_text": "The US ambassador insists that\nthe USA will not withdraw\nfrom Syria soon, contra the President’s previous statements. The objectives have officially evolved.\nThe US will not pull its troops out of Syria until its goals are accomplished there, ambassador to UN Nikki Haley said. This comes after Washington carried out airstrikes in Syria in response for an alleged chemical attack. US currently has over 2,000 troops in Syria and a number of contractors.\nWhile it is America’s goals to see the troops come home, “we are not going to leave until we know we have accomplished those things,” she told Fox News Sunday.\nHaley added the United States wants to ensure that chemical weapons are not used in a way that is of risk to US interests, the Islamic State (IS, formerly ISIS) is defeated and Iran’s actions are monitored.\nUS officials were previously saying that their goal in Syria is just defeating ISIS. President Donald Trump said earlier that US would withdraw from Syria “soon”  and Washington would “let the other people take care of it now,” but no deadline for any such move has been announced.\nThat’s obviously not good. But then, if\nthese rumors\nare true, the US will probably be withdrawing sooner rather than later, and there will be no more air strikes either.\nIt appears Russia was going to attack, and the U.S. was threatened into stopping the attack. This is probably the case. When this started, it was “going to be sustained, lasting days”. Then a large number of Russian planes took off, and suddenly America stopped attacking after only about an hour….\nHow do you go from “we are going to attack in waves, for days” to “an hour into the battle let’s call it quits”? And it is now confirmed that the Russian missile systems knocked out virtually ALL American cruise missiles, resulting in a totally failed missile attack. A few planes dropped bombs and then went home, with nothing returning. I think America quit because:\nRussian defenses worked perfect, and America was watching its missiles go POOF on computer screens before they reached their targets, and\nRussian war planes took off after the air defenses were very well proven, with confirmed destruction of practically all cruise missiles. That alone would not stop an American attack, but if any planes were carrying nukes it sure would, if it was proven Russian air defenses would escort those planes to their targets unscathed.\nThe big proof: the “days long attack” lasted about an hour. SOMETHING HAPPENED.\nThat’s not proof, let alone “big proof”. I haven’t seen any information that any Russian planes were launched anywhere, but we were told that Britain reports two hunter-killer subs\nwere stalking one of its submarines\ncarrying Tomahawk missiles, and that no missiles were launched from subs. In any event, the only way to determine who is telling the truth now is by watching to see what happens next. If there are more air strikes, that will be a strong indication that the Russians are seriously exaggerating. If there are not, that will be an indication, though less conclusive , that they are telling the truth now and the US has suffered a major blow to its military credibility.\nIt does seem a little strange that there should be so much sabre-rattling and posturing over a grand total of three targets in Syria, though. That offers minor support to the Russian account.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-15T16:00:22+00:00"
}