{
  "url": "https://voxday.net/2018/04/05/a-negative-asset/",
  "scraped_at": "2025-12-19T20:56:04.806570",
  "title": "A negative asset",
  "date_display": "April 5, 2018",
  "date_iso": "2018-04-05T22:27:46+00:00",
  "date_from_url": "2018-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What goes around <a href=\"https://www.thewrap.com/kevin-williamson-fired-atlantic-abortion-podcast-conservative-commentator/\">comes around</a>. The truth about the dysfunctional, downscale writer Kevin Williamson is that <a href=\"http://nymag.com/daily/intelligencer/2016/03/conservatives-to-white-working-class-drop-dead.html\">he deserves to die</a>. Economically, he is a negative asset.</p><blockquote><p>Conservative commentator Kevin Williamson was fired from The Atlantic, just weeks after being hired, the magazine told TheWrap.</p><p>“Kevin is a gifted writer, and he has been nothing but professional in all of our interactions. But I have come to the conclusion that The Atlantic is not the best fit for his talents, and so we are parting ways,” said editor-in-chief Jeffrey Goldberg in an email to staff on Thursday.</p><p>In his memo, obtained by TheWrap, Goldberg explained that Williamson was being terminated over his views on abortion, which have come to wide attention in recent days.</p><p>“Late yesterday afternoon, information came to our attention that has caused us to reconsider this relationship. Specifically, the subject of one of Kevin’s most controversial tweets was also a centerpiece of a podcast discussion in which Kevin explained his views on the subject of the death penalty and abortion,” wrote Goldberg.</p></blockquote><p>Williamson even appears to have been fired despite lacking the courage to stand by his previous convictions. There was no “errant tweet”, as the podcast footage subsequently demonstrated. So, who led Jeffrey Goldberg to believe that there was? Did he come up with that on his own, or was that an excuse that was given to him?</p><blockquote class=\"tr_bq\"><p>While Goldberg himself once trumpeted Williamson’s hire from the National Review, the writer immediately drew outrage — particularly over a tweet in which he argued that women who had had an abortion should face the death penalty. Williamson defenders — and Goldberg himself — had argued that his career should not be judged on an errant tweet.</p></blockquote><p>Some on the Right <a href=\"http://thezman.com/wordpress/?p=13425\">still don’t get it</a>. The Left is not fixable. The time for worrying about “the heckler’s veto” is long past. There is no public square anymore because there is no common ground. The Left is fighting a cultural war by any means necessary, and even if you’re not willing to do the same, it is reprehensibly foolish to expect them to do otherwise, much less mend their ways for fear of handwringing moderate right-wingers following through on ominously implied threats which they are manifestly unwilling to even articulate.</p><p>And we are supposed to imagine what happens to us in light of Williamson’s rapid ejection from <i>The Atlantic</i>? Where have you been for the last ten years? We don’t have to imagine anything. We’ve already experienced it.</p></div>",
  "content_text": "What goes around\ncomes around\n. The truth about the dysfunctional, downscale writer Kevin Williamson is that\nhe deserves to die\n. Economically, he is a negative asset.\nConservative commentator Kevin Williamson was fired from The Atlantic, just weeks after being hired, the magazine told TheWrap.\n“Kevin is a gifted writer, and he has been nothing but professional in all of our interactions. But I have come to the conclusion that The Atlantic is not the best fit for his talents, and so we are parting ways,” said editor-in-chief Jeffrey Goldberg in an email to staff on Thursday.\nIn his memo, obtained by TheWrap, Goldberg explained that Williamson was being terminated over his views on abortion, which have come to wide attention in recent days.\n“Late yesterday afternoon, information came to our attention that has caused us to reconsider this relationship. Specifically, the subject of one of Kevin’s most controversial tweets was also a centerpiece of a podcast discussion in which Kevin explained his views on the subject of the death penalty and abortion,” wrote Goldberg.\nWilliamson even appears to have been fired despite lacking the courage to stand by his previous convictions. There was no “errant tweet”, as the podcast footage subsequently demonstrated. So, who led Jeffrey Goldberg to believe that there was? Did he come up with that on his own, or was that an excuse that was given to him?\nWhile Goldberg himself once trumpeted Williamson’s hire from the National Review, the writer immediately drew outrage — particularly over a tweet in which he argued that women who had had an abortion should face the death penalty. Williamson defenders — and Goldberg himself — had argued that his career should not be judged on an errant tweet.\nSome on the Right\nstill don’t get it\n. The Left is not fixable. The time for worrying about “the heckler’s veto” is long past. There is no public square anymore because there is no common ground. The Left is fighting a cultural war by any means necessary, and even if you’re not willing to do the same, it is reprehensibly foolish to expect them to do otherwise, much less mend their ways for fear of handwringing moderate right-wingers following through on ominously implied threats which they are manifestly unwilling to even articulate.\nAnd we are supposed to imagine what happens to us in light of Williamson’s rapid ejection from\nThe Atlantic\n? Where have you been for the last ten years? We don’t have to imagine anything. We’ve already experienced it.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-05T21:27:46+00:00"
}