{
  "url": "https://voxday.net/2018/04/19/a-reliable-evil-detector/",
  "scraped_at": "2025-12-19T20:58:15.627590",
  "title": "A reliable evil-detector",
  "date_display": "April 19, 2018",
  "date_iso": "2018-04-19T15:00:07+00:00",
  "date_from_url": "2018-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>FN postulates an explanation for legalistic religious sophistry:</p><blockquote class=\"tr_bq\"><p>I think these crazy-seeming reinterpretations of the plain meaning of the Old Testament are partly motivated by a desire to seem clever. “Look how smart I am, I can understand it better than anyone else! No, it doesn’t really mean what the words say, it means this subtle thing that nobody but I can see!”</p></blockquote><p>I have no doubt that is partly true, but mostly it comes down to wanting to have sex with children. Evil <i>always </i>comes up with some way to rationalize that. Here is a reliable heuristic for evil: does it justify, rationalize, excuse, defend, encourage, advocate, or require sex with children in any way, openly or covertly, directly or indirectly? Then it is evil, topped by an evil sauce, with a side of evil.</p></div>",
  "content_text": "FN postulates an explanation for legalistic religious sophistry:\nI think these crazy-seeming reinterpretations of the plain meaning of the Old Testament are partly motivated by a desire to seem clever. “Look how smart I am, I can understand it better than anyone else! No, it doesn’t really mean what the words say, it means this subtle thing that nobody but I can see!”\nI have no doubt that is partly true, but mostly it comes down to wanting to have sex with children. Evil\nalways\ncomes up with some way to rationalize that. Here is a reliable heuristic for evil: does it justify, rationalize, excuse, defend, encourage, advocate, or require sex with children in any way, openly or covertly, directly or indirectly? Then it is evil, topped by an evil sauce, with a side of evil.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-19T14:00:07+00:00"
}