{
  "url": "https://voxday.net/2018/04/15/afraid-to-hope/",
  "scraped_at": "2025-12-19T20:57:35.278231",
  "title": "Afraid to hope",
  "date_display": "April 15, 2018",
  "date_iso": "2018-04-15T14:36:57+00:00",
  "date_from_url": "2018-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SF explains why more and more Trump supporters are showing a tendency to freak out when they are disappointed by his statements and actions:</p><blockquote class=\"tr_bq\"><p>I think the reason lots of people are panicking is because they have been burned and burned repeatedly by people they elected who were “their guy.” They are suffering from political “attachment disorder.” They want to be the ones to terminate their loyalty to the President on their own terms rather than feel like they got screwed again after trusting yet another political leader who tells them what they want them to hear only to turn on them.</p></blockquote><p>For those who are suffering from this disorder and genuinely feel frightened that the God-Emperor will betray them sooner or later, allow me to suggest the following litany, which, like the Bene Gesseret Litany Against Fear, may prove soothing.</p><p>Trump is not the answer.<br>Trump is not the salvation.<br>Trump is not the last and final hope.<br>Mistakes will be made.<br>Decisions will prove suboptimal.<br>Failure is likely. Disaster is possible.<br>The world is fallen and ruled by evil.<br>Republics and empires always fall.<br>Gideon only needed 300.<br>Jesus only needed 12.<br>Don’t be afraid.<br>This is just the first level.<br>There is always hope.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>If we get screwed again, we get screwed again. So what? What is the alternative, go back to the Jebs and Hillarys? Put our trust in the Romneys and Ryans? Trump was just the message. Trump is not the Second Coming of Charles Martel, the Defender of the West. He never promised to be. The time is not yet ripe. It cannot be, not when more than half the self-professed Right still firmly clings to the equality of race and religion, to multiculturalism, to civic nationalism, and to Judeo-Christianity, to the very deceits that are actively destroying everything they claim to cherish.</p><p>Before he comes, the statues of Stonewall Jackson and Thomas Jefferson and George Washington and Woodrow Wilson will fall. Perhaps even Abraham Lincoln. Before he comes, the South Africaust will take place. Before he comes, even the cucks and conservatives, even the identity-complicated and the civic nationalists, will be crying out to St. Breivik to save the harried remnants of their peoples from the barbarians they welcomed inside the gates as equals.</p><p>Only then, like Alfred the Great defending Anglo-Saxon England from the Great Heathen Army, will the people of the West be ready for the return of the Hammer. Only then will they be <i>worthy </i>of him.</p><p>Do not despair. Do not be afraid to hope. Remember, the Alt-Right is inevitable because the Alt-Right is the only political philosophy that is soundly based on a foundation of truth, history, logic, science, and Scripture. That is why not only the Left, but the cucks and cons and churchians as well, are observably <i>terrified </i>of debating us, listening to us, or even just <i>accurately characterizing</i> our views. They literally cannot handle the truth yet. And they will not be able to handle it, much less accept it, until the feelbads of their observed reality exceeds their feelbads caused by the truth.</p></div>",
  "content_text": "SF explains why more and more Trump supporters are showing a tendency to freak out when they are disappointed by his statements and actions:\nI think the reason lots of people are panicking is because they have been burned and burned repeatedly by people they elected who were “their guy.” They are suffering from political “attachment disorder.” They want to be the ones to terminate their loyalty to the President on their own terms rather than feel like they got screwed again after trusting yet another political leader who tells them what they want them to hear only to turn on them.\nFor those who are suffering from this disorder and genuinely feel frightened that the God-Emperor will betray them sooner or later, allow me to suggest the following litany, which, like the Bene Gesseret Litany Against Fear, may prove soothing.\nTrump is not the answer.\nTrump is not the salvation.\nTrump is not the last and final hope.\nMistakes will be made.\nDecisions will prove suboptimal.\nFailure is likely. Disaster is possible.\nThe world is fallen and ruled by evil.\nRepublics and empires always fall.\nGideon only needed 300.\nJesus only needed 12.\nDon’t be afraid.\nThis is just the first level.\nThere is always hope.\nIf we get screwed again, we get screwed again. So what? What is the alternative, go back to the Jebs and Hillarys? Put our trust in the Romneys and Ryans? Trump was just the message. Trump is not the Second Coming of Charles Martel, the Defender of the West. He never promised to be. The time is not yet ripe. It cannot be, not when more than half the self-professed Right still firmly clings to the equality of race and religion, to multiculturalism, to civic nationalism, and to Judeo-Christianity, to the very deceits that are actively destroying everything they claim to cherish.\nBefore he comes, the statues of Stonewall Jackson and Thomas Jefferson and George Washington and Woodrow Wilson will fall. Perhaps even Abraham Lincoln. Before he comes, the South Africaust will take place. Before he comes, even the cucks and conservatives, even the identity-complicated and the civic nationalists, will be crying out to St. Breivik to save the harried remnants of their peoples from the barbarians they welcomed inside the gates as equals.\nOnly then, like Alfred the Great defending Anglo-Saxon England from the Great Heathen Army, will the people of the West be ready for the return of the Hammer. Only then will they be\nworthy\nof him.\nDo not despair. Do not be afraid to hope. Remember, the Alt-Right is inevitable because the Alt-Right is the only political philosophy that is soundly based on a foundation of truth, history, logic, science, and Scripture. That is why not only the Left, but the cucks and cons and churchians as well, are observably\nterrified\nof debating us, listening to us, or even just\naccurately characterizing\nour views. They literally cannot handle the truth yet. And they will not be able to handle it, much less accept it, until the feelbads of their observed reality exceeds their feelbads caused by the truth.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-15T13:36:57+00:00"
}