{
  "url": "https://voxday.net/2018/04/02/binary-thinking/",
  "scraped_at": "2025-12-19T20:55:27.533057",
  "title": "Binary thinking",
  "date_display": "April 2, 2018",
  "date_iso": "2018-04-02T00:17:42+00:00",
  "date_from_url": "2018-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you read here regularly, you’ve probably encountered me dismissing those prone to attempting to divide everything into very simple conceptual poles. This is not to say that pure right and wrong do not exist, or that it is always inappropriate to apply Abelard’s straightforward heuristic of “It is so or it is not so”, merely that one cannot reduce all complex matters to such a simple binary equation.</p><p>So, it was interesting to discover, when re-reading a relatively new translation of <i>Siddhartha</i>, to see Herman Hesse portraying the protagonist referring to a concept that is not entirely dissimilar.</p><p><i>I have found a thought, Govinda, that you will think neither a joke nor foolishness, it is my best thought. It says: the opposite of every truth is just as true! For this is so: A truth can always only be uttered and cloaked in words when it is one-sided. Everything is one-sided that can be thought in thoughts and said with words, everything one-sided, everything half, everything is lacking wholeness, roundness, oneness. When the sublime Gautama spoke of the world in his doctrine, he had to divide it into Sansara and Nirvana, into illusion and truth, into suffering and redemption. This is the only way to go about it; there is no other way for a person who would teach. The world itself, however, the Being all around us and within us, is never one-sided.</i></p><p>Now, I certainly disagree with the surface meaning of the original thought; the opposite of every truth is simply not true or it would not be the opposite. But while that particular meaning is obviously incorrect, I think the subsequent statements are true in a slightly different sense than Hesse may have intended… or perhaps the translator messed it up somehow. I will have to review the original German to reach an opinion one way or the other. Regardless, that is neither here nor there, the point is that the world observably contains <i>both </i>the truth and the falsehood; to speak of what is necessarily implies the conceptual existence of what is not.</p><p>This is the true multiverse; it is conceptual, it is not material. There may be various levels of reality, there may be multitudes of realities in the way that even in our single material reality contains millions of simulated sub-realities and we are no more capable of proving that ours is the bottom turtle any more than an AI-controlled character in <i>World of Warcraft</i> can. But this conceptual whole is relevant for deeper understanding, for just as one cannot understand the concept of white when one has no ability to perceive the not-white of black, one cannot understand the concept of truth unless one is familiar with the not-truth of falsehood.</p><p>In the same way, we cannot grasp the essence of grace without an awareness of the not-grace of being sinful, and we cannot understand the importance of Jesus Christ or the reason for his sacrifice without an awareness of evil, both our own and the world’s. This need to know both the truth and the various not-truths in order to understand something is why binary thinking is not merely limited, it is crippling.</p></div>",
  "content_text": "If you read here regularly, you’ve probably encountered me dismissing those prone to attempting to divide everything into very simple conceptual poles. This is not to say that pure right and wrong do not exist, or that it is always inappropriate to apply Abelard’s straightforward heuristic of “It is so or it is not so”, merely that one cannot reduce all complex matters to such a simple binary equation.\nSo, it was interesting to discover, when re-reading a relatively new translation of\nSiddhartha\n, to see Herman Hesse portraying the protagonist referring to a concept that is not entirely dissimilar.\nI have found a thought, Govinda, that you will think neither a joke nor foolishness, it is my best thought. It says: the opposite of every truth is just as true! For this is so: A truth can always only be uttered and cloaked in words when it is one-sided. Everything is one-sided that can be thought in thoughts and said with words, everything one-sided, everything half, everything is lacking wholeness, roundness, oneness. When the sublime Gautama spoke of the world in his doctrine, he had to divide it into Sansara and Nirvana, into illusion and truth, into suffering and redemption. This is the only way to go about it; there is no other way for a person who would teach. The world itself, however, the Being all around us and within us, is never one-sided.\nNow, I certainly disagree with the surface meaning of the original thought; the opposite of every truth is simply not true or it would not be the opposite. But while that particular meaning is obviously incorrect, I think the subsequent statements are true in a slightly different sense than Hesse may have intended… or perhaps the translator messed it up somehow. I will have to review the original German to reach an opinion one way or the other. Regardless, that is neither here nor there, the point is that the world observably contains\nboth\nthe truth and the falsehood; to speak of what is necessarily implies the conceptual existence of what is not.\nThis is the true multiverse; it is conceptual, it is not material. There may be various levels of reality, there may be multitudes of realities in the way that even in our single material reality contains millions of simulated sub-realities and we are no more capable of proving that ours is the bottom turtle any more than an AI-controlled character in\nWorld of Warcraft\ncan. But this conceptual whole is relevant for deeper understanding, for just as one cannot understand the concept of white when one has no ability to perceive the not-white of black, one cannot understand the concept of truth unless one is familiar with the not-truth of falsehood.\nIn the same way, we cannot grasp the essence of grace without an awareness of the not-grace of being sinful, and we cannot understand the importance of Jesus Christ or the reason for his sacrifice without an awareness of evil, both our own and the world’s. This need to know both the truth and the various not-truths in order to understand something is why binary thinking is not merely limited, it is crippling.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-01T23:17:42+00:00"
}