{
  "url": "https://voxday.net/2018/04/18/conservatism-and-immigration/",
  "scraped_at": "2025-12-19T20:58:04.678762",
  "title": "Conservatism and immigration",
  "date_display": "April 18, 2018",
  "date_iso": "2018-04-18T12:38:29+00:00",
  "date_from_url": "2018-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This earlier exchange epitomizes the result of all that legal, merit-based immigration that conservatives been championing since the rhetorical failure of their focus on “illegal immigration”.</p><blockquote><p>Raghav Hegde<br>LOL….I don’t know whether to be outraged at some of the stuff you lot say about my people or laugh. Anyway, I will say just one thing. Microsoft market cap when the company was “less Indian” in 2009: $138 billion. Microsoft market cap now that it is a company of Indians, in 2018, $738 billion. Anyway, keep up with your silly rants against those “curries”, “apus” or whateveer it is you call us ?</br></p><p>Sherwood family<br>Raghav Hegde: you just said it yourself. They are your people. Which is fine. Everyone has a people and should support them the best they can. But they are not our people. You have to go back. Make India Great Again.</br></p><p>Raghav Hegde<br>Sherwood family: Sure we will. But first we are gonna take over “your” companies and make them “our” companies. Microsoft, Google, Facebook, Adobe, Apple, IBM…you name it, we dominate. LOL…I bet you prefer the Mexicans or Latinos to us smelly Apus. At best, they work as your gardeners or house help or whatever. The little smelly ugly effete Indians, LOL, we are basically replacing you from your best jobs ? Go on, rant away ?</br></p><p>Sherwood family<br>So…Raghav Hegde’s response is summed up as: <i>all those things you say don’t like about us…yeah…we are actually doing them and plan to do them a lot more and your noticing that is ‘ranting’.</i> Even Raghav Hegde’s threats are parasitic at best: “we are gonna take over “your” companies and make them “our” companies.” Don’t be a parasite. Go Make India Great Again.</br></p></blockquote><p>You see, conservatives have never understood that no one else in the world gives a damn about their high-minded principles. Which is ironic, given that conservatism, as it was originally conceived, was about the triumph of history and tradition over ideology and reason-based principles. Remember the phrase, “the democracy of the dead?” But what pass for conservatives today resolutely turn their face from the traditions of the past in favor of <i>liberte</i>, <i>egalite</i>, <i>fraternite</i>.</p><p>They have more in common with the French Revolution than the American one.</p><p>Recent conservative rhetoric has resorted to trying to equate the SJW Left with the Alt-Right. I suppose that’s fair enough if you’re talking about the anti-nationalist Fake Right cartoon version of Obama voters and EU supporters portrayed as the Alt-Right by the media. But any straightforward comparison of the 16 Points of the Alt-Right, or with the rising European nationalism, with the globalist, anti-American, and equalitarian values espoused by today’s conservatives will clearly show that it is the conservative movement that is considerably far to our Left.</p><p>Every generation of Man prior to the Greatest Generation understood that a nation exists to benefit its posterity, even at the expense of all other nations. That is the traditional and true Right principle, and the perverted “conservatism” of today is the result of 120 years of virulent ahistorical, anti-American, anti-Christian, and anti-nationalist propaganda by self-serving immigrants. The Greatest Generation, the Baby Boomers, Generation X, and the Millennials are the only generations to have ever generally bought into the nonsense.</p><p>The exchange above illustrates what I mean when I say that European anti-Semitism is an accident of history. There is nothing special about the adversarial historical relationship between the two parties, it is simply what happens when low-trust cultures and high-trust cultures collide. Neither Jews nor Europeans understand its true nature or that the results would have been much the same if it had been a Chinese, an Indian, or any other high-performance, self-serving minority living parasitically in a high-trust, high-performance society. And almost everyone, on all sides, is going to be astonished by the eventual outcome, due to this failure to understand the nature of the historical situation.</p><p>For example, the Jews are already alarmed that the Chinese are successfully challenging their control over Hollywood and the Ivy League admissions offices. Do they really think they are going to be able to withstand the Indian plan to take over technology companies like Microsoft and Google or believe they will be able to hold onto the media, or even Wall Street when the Chinese decide to take it over with a double-envelopment from within and without.</p><p>That’s the long-term logistical problem with permitting a parasitical, self-serving minority to take control of the societal high ground of a large nation. The influential minority simply doesn’t have the numbers or the power to hold onto it when another, larger and more powerful, but equally self-serving minority decides to take it from them. As for relying on the canard of the supposedly superior intelligence explaining Jewish success, which mysteriously did not appear until the 20th century, keep in mind that there are <i>several orders of magnitude</i> more high-IQ Chinese and Indians than Jews.</p><p>The 21st century is not only going to be a historically interesting one, I believe it is going to turn out very, very different than almost anyone is imagining.</p></div>",
  "content_text": "This earlier exchange epitomizes the result of all that legal, merit-based immigration that conservatives been championing since the rhetorical failure of their focus on “illegal immigration”.\nRaghav Hegde\nLOL….I don’t know whether to be outraged at some of the stuff you lot say about my people or laugh. Anyway, I will say just one thing. Microsoft market cap when the company was “less Indian” in 2009: $138 billion. Microsoft market cap now that it is a company of Indians, in 2018, $738 billion. Anyway, keep up with your silly rants against those “curries”, “apus” or whateveer it is you call us ?\nSherwood family\nRaghav Hegde: you just said it yourself. They are your people. Which is fine. Everyone has a people and should support them the best they can. But they are not our people. You have to go back. Make India Great Again.\nRaghav Hegde\nSherwood family: Sure we will. But first we are gonna take over “your” companies and make them “our” companies. Microsoft, Google, Facebook, Adobe, Apple, IBM…you name it, we dominate. LOL…I bet you prefer the Mexicans or Latinos to us smelly Apus. At best, they work as your gardeners or house help or whatever. The little smelly ugly effete Indians, LOL, we are basically replacing you from your best jobs ? Go on, rant away ?\nSherwood family\nSo…Raghav Hegde’s response is summed up as:\nall those things you say don’t like about us…yeah…we are actually doing them and plan to do them a lot more and your noticing that is ‘ranting’.\nEven Raghav Hegde’s threats are parasitic at best: “we are gonna take over “your” companies and make them “our” companies.” Don’t be a parasite. Go Make India Great Again.\nYou see, conservatives have never understood that no one else in the world gives a damn about their high-minded principles. Which is ironic, given that conservatism, as it was originally conceived, was about the triumph of history and tradition over ideology and reason-based principles. Remember the phrase, “the democracy of the dead?” But what pass for conservatives today resolutely turn their face from the traditions of the past in favor of\nliberte\n,\negalite\n,\nfraternite\n.\nThey have more in common with the French Revolution than the American one.\nRecent conservative rhetoric has resorted to trying to equate the SJW Left with the Alt-Right. I suppose that’s fair enough if you’re talking about the anti-nationalist Fake Right cartoon version of Obama voters and EU supporters portrayed as the Alt-Right by the media. But any straightforward comparison of the 16 Points of the Alt-Right, or with the rising European nationalism, with the globalist, anti-American, and equalitarian values espoused by today’s conservatives will clearly show that it is the conservative movement that is considerably far to our Left.\nEvery generation of Man prior to the Greatest Generation understood that a nation exists to benefit its posterity, even at the expense of all other nations. That is the traditional and true Right principle, and the perverted “conservatism” of today is the result of 120 years of virulent ahistorical, anti-American, anti-Christian, and anti-nationalist propaganda by self-serving immigrants. The Greatest Generation, the Baby Boomers, Generation X, and the Millennials are the only generations to have ever generally bought into the nonsense.\nThe exchange above illustrates what I mean when I say that European anti-Semitism is an accident of history. There is nothing special about the adversarial historical relationship between the two parties, it is simply what happens when low-trust cultures and high-trust cultures collide. Neither Jews nor Europeans understand its true nature or that the results would have been much the same if it had been a Chinese, an Indian, or any other high-performance, self-serving minority living parasitically in a high-trust, high-performance society. And almost everyone, on all sides, is going to be astonished by the eventual outcome, due to this failure to understand the nature of the historical situation.\nFor example, the Jews are already alarmed that the Chinese are successfully challenging their control over Hollywood and the Ivy League admissions offices. Do they really think they are going to be able to withstand the Indian plan to take over technology companies like Microsoft and Google or believe they will be able to hold onto the media, or even Wall Street when the Chinese decide to take it over with a double-envelopment from within and without.\nThat’s the long-term logistical problem with permitting a parasitical, self-serving minority to take control of the societal high ground of a large nation. The influential minority simply doesn’t have the numbers or the power to hold onto it when another, larger and more powerful, but equally self-serving minority decides to take it from them. As for relying on the canard of the supposedly superior intelligence explaining Jewish success, which mysteriously did not appear until the 20th century, keep in mind that there are\nseveral orders of magnitude\nmore high-IQ Chinese and Indians than Jews.\nThe 21st century is not only going to be a historically interesting one, I believe it is going to turn out very, very different than almost anyone is imagining.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-18T11:38:29+00:00"
}