{
  "url": "https://voxday.net/2018/04/21/cuck-they-cucked-cuckingly/",
  "scraped_at": "2025-12-19T20:58:27.305524",
  "title": "“Cuck!” they cucked, cuckingly",
  "date_display": "April 21, 2018",
  "date_iso": "2018-04-21T10:53:13+00:00",
  "date_from_url": "2018-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David French urges conservatives <a href=\"https://www.nationalreview.com/2018/04/conservatives-offensive-speech-from-professors-dont-punish/\">to refrain from going on the offensive</a> against a left-wing professor. It would be unseemly, don’t you know.</p><blockquote><p>No, Conservatives Shouldn’t Try to Punish Radical Professors for Offensive Speech</p><p>We’re reaching a disturbing point in American discourse where increasingly both sides of the national debate (it’s not the Left that’s driving the firestorm against Jarrar) are looking for ways to justify and rationalize censorship and suppression of offensive views. If the censorship comes through a public employer or government entity, then the Twitterati transforms into a squad of hapless law students, hunting through the results of hasty Google searches to find just the right exceptions to the relevant First Amendment jurisprudence — exceptions that allow for the infamous phrase, “I believe in free speech, but . . .”</p><p>If the suppression comes through private employers, then it’s easier to justify. From the left — “Sure, The Atlantic can fire a conservative.” From the right — “Get those damn football players off their knees.” Both sides eagerly obliterate the culture of free speech in the quest to cleanse the marketplace of ideas we don’t like.</p><p>But culture drives law, and law drives culture. Every time that we refuse to tolerate offensive expression, we incentivize the culture of crocodile tears. We motivate government officials to expand state power over speech until the silencing exceptions swallow the free-speech rule. California’s recent efforts to compel crisis-pregnancy centers to advertise for free or low-cost abortions represents what happens when the people, to borrow my friend Greg Lukianoff’s excellent phrase, “unlearn liberty.” Periodic conservative efforts to expel radical professors from the academy demonstrate the pernicious effects of a “fight fire with fire” mentality. In both cases, a culture of coercion triumphs and liberty loses.</p><p>Here’s an alternative: Leave the trolls alone. Let the radicals rant. Then, rebut the bad speech with better speech, or — sometimes better yet — rebut it with silence. Does anyone really care what Randa Jarrar thinks of Barbara Bush? Or is she now mainly useful as a foil, as clickbait, as the latest pawn in the culture war? I think we know the answer.</p><p>If you truly hate the offensive speech in question — if you truly believe it’s hurtful — why share it far and wide? Why amplify the offensive voice? Arguably, the worst rebuke for a troll, the worst punishment for the self-promoting radical, is indifference. I have my own standard for engaging bad ideas — First, I wait. I ask myself: Are these ideas gaining traction? Do they threaten to make a material difference in the marketplace of ideas? If the answer is yes, then I engage. If the answer is no, I let the offensive speech die a natural death.</p><p>But killing an idea through censorship? That’s not what free people do.</p></blockquote><p>Actually, it’s what people who are not free, but would like to be free, <i>have to do</i>. It’s called “reprisal”. It’s remarkable how these cuckservative idiots are <i>still </i>relying on the same tactics that have uniformly failed for the last 50 years. Why, it’s almost as if they <i>want </i>to fail….</p><p>Rod Dreher, of course, <a href=\"https://www.theamericanconservative.com/dreher/randa-jarrar-privilege-fresno-prof/\">agrees that nothing should be done</a>. The most important thing when the Left attacks is to not respond, not in kind, and not in any way. Because as long as you keep your eyes shut and pretend it isn’t happening, it will eventually stop.</p><blockquote><p>My job here at TAC involves opinion writing. I have been paid for most of my career to state my opinion. Yet no employer of mine — no newspaper, no magazine — would keep me on if I tweeted something as vile as what Jarrar tweeted. It would be devastating to the institutional reputation of these newspapers and magazines. TAC would lose donors left and right, and would take a real hit in terms of its credibility. Any magazine or publication would. I would never abuse the privilege I have. With that privilege comes responsibility.</p><p>So, today, I am much less sympathetic to Randa Jarrar than I was when she first spouted off. I still lean towards not firing her. But boy, is she ever a poster child for left-wing academic privilege and arrogance. If the university president fires her for pranking the crisis hotline, I won’t be sorry.</p></blockquote><p>That will show her! Now, I can’t help but wonder, do these two gentlemen of principle and champions of free speech also counsel indifference to the Boycott, Divest, and Sanction movement?</p></div>",
  "content_text": "David French urges conservatives\nto refrain from going on the offensive\nagainst a left-wing professor. It would be unseemly, don’t you know.\nNo, Conservatives Shouldn’t Try to Punish Radical Professors for Offensive Speech\nWe’re reaching a disturbing point in American discourse where increasingly both sides of the national debate (it’s not the Left that’s driving the firestorm against Jarrar) are looking for ways to justify and rationalize censorship and suppression of offensive views. If the censorship comes through a public employer or government entity, then the Twitterati transforms into a squad of hapless law students, hunting through the results of hasty Google searches to find just the right exceptions to the relevant First Amendment jurisprudence — exceptions that allow for the infamous phrase, “I believe in free speech, but . . .”\nIf the suppression comes through private employers, then it’s easier to justify. From the left — “Sure, The Atlantic can fire a conservative.” From the right — “Get those damn football players off their knees.” Both sides eagerly obliterate the culture of free speech in the quest to cleanse the marketplace of ideas we don’t like.\nBut culture drives law, and law drives culture. Every time that we refuse to tolerate offensive expression, we incentivize the culture of crocodile tears. We motivate government officials to expand state power over speech until the silencing exceptions swallow the free-speech rule. California’s recent efforts to compel crisis-pregnancy centers to advertise for free or low-cost abortions represents what happens when the people, to borrow my friend Greg Lukianoff’s excellent phrase, “unlearn liberty.” Periodic conservative efforts to expel radical professors from the academy demonstrate the pernicious effects of a “fight fire with fire” mentality. In both cases, a culture of coercion triumphs and liberty loses.\nHere’s an alternative: Leave the trolls alone. Let the radicals rant. Then, rebut the bad speech with better speech, or — sometimes better yet — rebut it with silence. Does anyone really care what Randa Jarrar thinks of Barbara Bush? Or is she now mainly useful as a foil, as clickbait, as the latest pawn in the culture war? I think we know the answer.\nIf you truly hate the offensive speech in question — if you truly believe it’s hurtful — why share it far and wide? Why amplify the offensive voice? Arguably, the worst rebuke for a troll, the worst punishment for the self-promoting radical, is indifference. I have my own standard for engaging bad ideas — First, I wait. I ask myself: Are these ideas gaining traction? Do they threaten to make a material difference in the marketplace of ideas? If the answer is yes, then I engage. If the answer is no, I let the offensive speech die a natural death.\nBut killing an idea through censorship? That’s not what free people do.\nActually, it’s what people who are not free, but would like to be free,\nhave to do\n. It’s called “reprisal”. It’s remarkable how these cuckservative idiots are\nstill\nrelying on the same tactics that have uniformly failed for the last 50 years. Why, it’s almost as if they\nwant\nto fail….\nRod Dreher, of course,\nagrees that nothing should be done\n. The most important thing when the Left attacks is to not respond, not in kind, and not in any way. Because as long as you keep your eyes shut and pretend it isn’t happening, it will eventually stop.\nMy job here at TAC involves opinion writing. I have been paid for most of my career to state my opinion. Yet no employer of mine — no newspaper, no magazine — would keep me on if I tweeted something as vile as what Jarrar tweeted. It would be devastating to the institutional reputation of these newspapers and magazines. TAC would lose donors left and right, and would take a real hit in terms of its credibility. Any magazine or publication would. I would never abuse the privilege I have. With that privilege comes responsibility.\nSo, today, I am much less sympathetic to Randa Jarrar than I was when she first spouted off. I still lean towards not firing her. But boy, is she ever a poster child for left-wing academic privilege and arrogance. If the university president fires her for pranking the crisis hotline, I won’t be sorry.\nThat will show her! Now, I can’t help but wonder, do these two gentlemen of principle and champions of free speech also counsel indifference to the Boycott, Divest, and Sanction movement?",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-21T09:53:13+00:00"
}