{
  "url": "https://voxday.net/2018/04/26/digital-maoism/",
  "scraped_at": "2025-12-19T20:59:08.019994",
  "title": "Digital Maoism",
  "date_display": "April 26, 2018",
  "date_iso": "2018-04-26T12:09:35+00:00",
  "date_from_url": "2018-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is a really good interview with Jaron Lanier which hits on three important concepts:</p><blockquote><p><b>This dovetails with something you’ve said in the past that’s with me, which is your phrase Digital Maoism. Do you think that the Digital Maoism that you described years ago — are those the people who run Silicon Valley today?</b></p><p>I was talking about a few different things at the time I wrote “<a href=\"https://www.edge.org/conversation/jaron_lanier-digital-maoism-the-hazards-of-the-new-online-collectivism\">Digital Maoism</a>.” One of them was the way that we were centralizing culture, even though the rhetoric was that we were distributing it. Before Wikipedia, I think it would have been viewed as being this horrible thing to say that there could only be one encyclopedia, and that there would be one dominant entry for a given topic. Instead, there were different encyclopedias. There would be variations not so much in what facts were presented, but in the way they were presented. That voice was a real thing.</p><p>And then we moved to this idea that we have a single dominant encyclopedia that was supposed to be the truth for the global AI or something like that. But there’s something deeply pernicious about that. So we’re saying anybody can write for Wikipedia, so it’s, like, purely democratic and it’s this wonderful open thing, and yet the bizarreness is that that open democratic process is on the surface of something that struck me as being Maoist, which is that there’s this one point of view that’s then gonna be the official one.</p><p>And then I also noticed that that process of people being put into a global system in which they’re supposed to work together toward some sort of dominating megabrain that’s the one truth didn’t seem to bring out the best in people, that people turned aggressive and mean-spirited when they interacted in that context. I had worked on some content for Britannica years and years ago, and I never experienced the kind of just petty meanness that’s just commonplace in everything about the internet. Among many other places, on Wikipedia.</p><p>On the one hand, you have this very open collective process actually in the service of this very domineering global brain, destroyer of local interpretation, destroyer of individual voice process. And then you also have this thing that seems to bring out this meanness in people, where people get into this kind of mob mentality and they become unkind to each other. And those two things have happened all over the internet; they’re both very present in Facebook, everywhere. And it’s a bit of a subtle debate, and it takes a while to work through it with somebody who doesn’t see what I’m talking about. That was what I was talking about.</p><p>But then there’s this other thing about the centralization of economic power. What happened with Maoists and with communists in general, and neo-Marxists and all kinds of similar movements, is that on the surface, you say everybody shares, everybody’s equal, we’re not gonna have this capitalist concentration. But then there’s some other entity that might not look like traditional capitalism, but is effectively some kind of robber baron that actually owns everything, some kind of Communist Party actually controls everything, and you have just a very small number of individuals who become hyperempowered and everybody else loses power.</p><p>And exactly the same thing has happened with the supposed openness of the internet, where you say, “Isn’t it wonderful, with Facebook and Twitter anybody can express themselves. Everybody’s an equal, everybody’s empowered.” But in fact, we’re in a period of time of extreme concentration of wealth and power, and it’s precisely around those who run the biggest computers. So the truth and the effect is just the opposite of what the rhetoric is and the immediate experience.</p><p>A lot of people were furious with me over Digital Maoism and felt that I had betrayed our cause or something, and I lost some friends over it. And some of it was actually hard. But I fail to see how it was anything but accurate.</p></blockquote><p>This guy is sharing some important insights into the intrinsic danger of centralization, even when it is unintentional and inadvertent. It also underlines the importance of the Infogalactic approach, which rejects the concept of the One True Page that defines objective reality for everyone on the basis of the opinions of the information gatekeepers.</p></div>",
  "content_text": "This is a really good interview with Jaron Lanier which hits on three important concepts:\nThis dovetails with something you’ve said in the past that’s with me, which is your phrase Digital Maoism. Do you think that the Digital Maoism that you described years ago — are those the people who run Silicon Valley today?\nI was talking about a few different things at the time I wrote “\nDigital Maoism\n.” One of them was the way that we were centralizing culture, even though the rhetoric was that we were distributing it. Before Wikipedia, I think it would have been viewed as being this horrible thing to say that there could only be one encyclopedia, and that there would be one dominant entry for a given topic. Instead, there were different encyclopedias. There would be variations not so much in what facts were presented, but in the way they were presented. That voice was a real thing.\nAnd then we moved to this idea that we have a single dominant encyclopedia that was supposed to be the truth for the global AI or something like that. But there’s something deeply pernicious about that. So we’re saying anybody can write for Wikipedia, so it’s, like, purely democratic and it’s this wonderful open thing, and yet the bizarreness is that that open democratic process is on the surface of something that struck me as being Maoist, which is that there’s this one point of view that’s then gonna be the official one.\nAnd then I also noticed that that process of people being put into a global system in which they’re supposed to work together toward some sort of dominating megabrain that’s the one truth didn’t seem to bring out the best in people, that people turned aggressive and mean-spirited when they interacted in that context. I had worked on some content for Britannica years and years ago, and I never experienced the kind of just petty meanness that’s just commonplace in everything about the internet. Among many other places, on Wikipedia.\nOn the one hand, you have this very open collective process actually in the service of this very domineering global brain, destroyer of local interpretation, destroyer of individual voice process. And then you also have this thing that seems to bring out this meanness in people, where people get into this kind of mob mentality and they become unkind to each other. And those two things have happened all over the internet; they’re both very present in Facebook, everywhere. And it’s a bit of a subtle debate, and it takes a while to work through it with somebody who doesn’t see what I’m talking about. That was what I was talking about.\nBut then there’s this other thing about the centralization of economic power. What happened with Maoists and with communists in general, and neo-Marxists and all kinds of similar movements, is that on the surface, you say everybody shares, everybody’s equal, we’re not gonna have this capitalist concentration. But then there’s some other entity that might not look like traditional capitalism, but is effectively some kind of robber baron that actually owns everything, some kind of Communist Party actually controls everything, and you have just a very small number of individuals who become hyperempowered and everybody else loses power.\nAnd exactly the same thing has happened with the supposed openness of the internet, where you say, “Isn’t it wonderful, with Facebook and Twitter anybody can express themselves. Everybody’s an equal, everybody’s empowered.” But in fact, we’re in a period of time of extreme concentration of wealth and power, and it’s precisely around those who run the biggest computers. So the truth and the effect is just the opposite of what the rhetoric is and the immediate experience.\nA lot of people were furious with me over Digital Maoism and felt that I had betrayed our cause or something, and I lost some friends over it. And some of it was actually hard. But I fail to see how it was anything but accurate.\nThis guy is sharing some important insights into the intrinsic danger of centralization, even when it is unintentional and inadvertent. It also underlines the importance of the Infogalactic approach, which rejects the concept of the One True Page that defines objective reality for everyone on the basis of the opinions of the information gatekeepers.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-26T11:09:35+00:00"
}