{
  "url": "https://voxday.net/2018/04/12/evil-in-high-places-2/",
  "scraped_at": "2025-12-19T20:57:01.533802",
  "title": "Evil in high places",
  "date_display": "April 12, 2018",
  "date_iso": "2018-04-12T11:30:26+00:00",
  "date_from_url": "2018-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s intriguing to see that the elite pizza-eating pagans are increasingly inclined <a href=\"https://www.fulcrumnews.com/blog/2018/4/6/hillary-clinton-joins-international-elite-coven-yes-really\">to show their evil faces to the public</a>. Apparently they are taking the “purloined letter” approach to their devil worship, hoping that three decades of irony will provide them with effective cover. <i>“Oh, we’re just bored rich and powerful people having so much fun with all our spirit-cooking, fake cannibalism, and dining in Hell… doesn’t it sound like a hoot?”</i> That, or they are getting increasingly desperate as the God-Emperor’s vengeful net continues to close in around them and <a href=\"https://www.mirror.co.uk/news/uk-news/police-ordered-hunt-paedophile-hunters-11858909\">amateur pedophile hunters</a> routinely expose those lower on the pyramid.</p><blockquote><p>Earlier this week, Hillary Clinton made an appearance in New York City at an exclusive women’s club called The Wing. The event was put together by co-founders Audrey Gelman and Lauren Kassan in honor of Hillary. They were able to converse on her new book <i>What Happened</i>, her legacy, and (unsurprisingly) Russian meddling. It was quite the typical post-election conversation to be expected from Hillary. However, on this occasion, there was one significant difference. This time Hillary was speaking to a group of women who practice witchcraft and openly call themselves a coven. According to The Wing’s Instagram page: “We’re a coven, not a sorority.” </p><p>During the event, Hillary was awarded an honorary lifetime Wing membership and was welcomed by the interviewers as the “newest member of our coven” in front of a room filled with cheering members.</p><p>For decades it has been rumored that Hillary Clinton practiced witchcraft and was involved with various covens throughout the years. Most famously, former Clinton employee Larry Nichols described numerous times in which Hillary would practice witchcraft with a Californian-based coven one week and the next she would be going to church as if nothing happened. Up until Hillary lost the election, there was thought to be a concerted effort to hide her visits to these covens. Yet, she seems to be joining self-proclaimed covens right in the open and the media.</p></blockquote><p>As Moira Greyland detailed in <i><b><a href=\"http://amzn.to/2C8tpQl\">The Last Closet</a></b></i>, these pagan things are almost always much worse than the whispers that normal, decent people find so hard to credit. I note that the two (((founders))), both of whom are 30, recently raised over $30 million for their “women’s club”. Probably just a really great business plan, right? Those must have been some spectacular Powerpoint slides.</p></div>",
  "content_text": "It’s intriguing to see that the elite pizza-eating pagans are increasingly inclined\nto show their evil faces to the public\n. Apparently they are taking the “purloined letter” approach to their devil worship, hoping that three decades of irony will provide them with effective cover.\n“Oh, we’re just bored rich and powerful people having so much fun with all our spirit-cooking, fake cannibalism, and dining in Hell… doesn’t it sound like a hoot?”\nThat, or they are getting increasingly desperate as the God-Emperor’s vengeful net continues to close in around them and\namateur pedophile hunters\nroutinely expose those lower on the pyramid.\nEarlier this week, Hillary Clinton made an appearance in New York City at an exclusive women’s club called The Wing. The event was put together by co-founders Audrey Gelman and Lauren Kassan in honor of Hillary. They were able to converse on her new book\nWhat Happened\n, her legacy, and (unsurprisingly) Russian meddling. It was quite the typical post-election conversation to be expected from Hillary. However, on this occasion, there was one significant difference. This time Hillary was speaking to a group of women who practice witchcraft and openly call themselves a coven. According to The Wing’s Instagram page: “We’re a coven, not a sorority.”\nDuring the event, Hillary was awarded an honorary lifetime Wing membership and was welcomed by the interviewers as the “newest member of our coven” in front of a room filled with cheering members.\nFor decades it has been rumored that Hillary Clinton practiced witchcraft and was involved with various covens throughout the years. Most famously, former Clinton employee Larry Nichols described numerous times in which Hillary would practice witchcraft with a Californian-based coven one week and the next she would be going to church as if nothing happened. Up until Hillary lost the election, there was thought to be a concerted effort to hide her visits to these covens. Yet, she seems to be joining self-proclaimed covens right in the open and the media.\nAs Moira Greyland detailed in\nThe Last Closet\n, these pagan things are almost always much worse than the whispers that normal, decent people find so hard to credit. I note that the two (((founders))), both of whom are 30, recently raised over $30 million for their “women’s club”. Probably just a really great business plan, right? Those must have been some spectacular Powerpoint slides.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-12T10:30:26+00:00"
}