{
  "url": "https://voxday.net/2018/04/30/further-to-the-indictment/",
  "scraped_at": "2025-12-19T20:59:46.705772",
  "title": "Further to the indictment",
  "date_display": "April 30, 2018",
  "date_iso": "2018-04-30T16:03:30+00:00",
  "date_from_url": "2018-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I suspected Jordan Peterson not only lacked intellectual integrity, but was not even on the side of Western civilization at all. Yesterday, he contributed more documentation to the growing pile of evidence that he is an enemy of the truth and the West alike.</p><blockquote><p><a href=\"https://twitter.com/jordanbpeterson/status/990795450642034688\">Jordan B Peterson@jordanbpeterson</a><br>Heavens to Murgatroyd! as Bugs Bunny had it: A misogynistic antisemitic right-wing identity-politics ideologue disapproves of me…</br></p></blockquote><p>He’s referring to <a href=\"https://pushingrubberdownhill.com/2018/04/28/not-only-is-jordan-peterson-not-an-alpha-male-hes-a-member-of-the-left-intelligentsia/#more-3947\">this piece by Adam Piggot</a>, a soon-to-be former fan of his:</p><blockquote><p>I have been an advocate of Peterson for a while and he speaks a great deal of truth. But on reflection I am beginning to reappraise my position on him. Did the alt right embrace him so readily because we thought we had finally found someone who taught in progressive universities who wasn’t a foaming at the mouth liberal? Peterson is most certainly not foaming at the mouth; but is it true that he is not a liberal? The assumption has been that but perhaps he is merely a liberal whom we find palatable.</p><p>Peterson seems to be the real deal because we desperately want him to be the real deal.</p><p>Another thing that I have noticed in his discussions and speeches, and particularly in the Q&amp;A sessions, is that he constantly skirts around the subject of biological reality. Once again the assumption on our part has been that he doesn’t want to go there because it would make his position untenable within the prog system in which he works. But that is a comfortable and convenient assumption on our part. Perhaps the truth is that he doesn’t go there because he himself is a believer of the magic dirt theory of race.</p></blockquote><p>Peterson’s fans have done their best to try to excuse his behavior, to little avail, as his generic and false accusation quoted above could have just as easily been produced by any other Canadian feminist left-wing academic globalist. Furthermore, we now know that Peterson is aware of my post addressing his inept appeal to the mythical “115 IQ”, as it is cited in the article to which he linked.</p><blockquote><p>Recently Peterson wrote a piece titled On the so-called Jewish question. There was a good deal of push-back in the comments, but the real push-back he encountered was from Vox Day – <a href=\"http://voxday.blogspot.nl/2018/04/the-myth-of-jordan-petersons-integrity.html\">The myth of Jordan Peterson’s integrity</a>.</p><p><i>“I do not know Jordan Peterson, but his incorrect and deceitful arguments and his unfair, unjustified attacks on his critics show him to be an inept and integrity-challenged coward who lacks commitment to the truth. The combination of his sudden success with his observable intellectual ineptitude suggests that he has been elevated by the mainstream media in order to provide a harmless, toothless, and non-Christian alternative to the failed conservative movement of William F. Buckley and the failed neoconservative movement of Bill Kristol and Ben Shapiro.”</i></p><p>As of this time Peterson has not responded to Day’s demolition of his article. A live debate between the two will most probably not eventuate as Day would be too great a risk and the topics at hand are as we know are verboten for Peterson.</p><p>Ultimately I believe that Peterson is an elaborate and very clever deception to prevent young men from inadvertently straying off the progressive reservation.</p></blockquote><p>It does rather look as if Peterson is little more than the newest member of the Approved Opposition to be anointed by the mainstream media, to go with “whip-smart” Benny Shapiro, George “now, that twists my bowtie” Will, and the Official Conservative of the Washington Post, Megan McCardle, collectively known as the Washington Generals, media edition. Don’t forget, William F. Buckley became the pope of the conservative movement back in the day on the basis of his show <i>Firing Line</i> and his public demolition of various leftist patsies such as Gore Vidal.</p><p>Yes, Peterson speaks certain truths, but only the easy and uncontroversial ones. From what I see, he is treading the broad and easy path that leads to public acclamation as well as other destinations. But the real problem with Peterson is that he is strategically irrelevant. The societal problems caused by modernism simply cannot be solved by a modernist fighting postmodernism.</p><p>At this point it is still possible that Peterson will take action to salvage his intellectual integrity. But I think it is increasingly unlikely, as this is the second time in a row that he has doubled-down and resorted to childish attempts to discredit and disqualify his critics rather than responding substantively to them. So, I anticipate that his future behavior, and his continued engagement of other lightweight leftists further to his left in lieu of the growing number of substantial critics to his right, will serve to confirm the opinion of skeptics like NN Taleb and me.</p><blockquote class=\"tr_bq\"><p>Jordan B Peterson@jordanbpeterson<br>And you call me a fascist? You sanctimonious prick. If you were in my room at the moment, I’d slap you happily. </br></p></blockquote><p>How very fierce. Truly the epitome of the courageous intellectual warrior. I find myself wondering this: if Jordan Peterson believes calling someone else “a fascist” makes one a sanctimonious prick, then what does calling someone “a misogynistic antisemitic right-wing identity-politics ideologue” make him?</p><p><i>“I’m worried always that I’ll make a mistake in what I say… impulsive mistake, careless mistake, that I won’t be on top of things in a combative interview, that sort of thing, that I’ll make a mistake. I’ve been worried about that, almost to the exclusion of everything else for the last 15 months.” </i><br>– <a href=\"https://medium.com/the-abs-tract-organization/the-resolution-of-jordan-peterson-99bee709b2b2\">Jordan Peterson</a></br></p><p>Interesting. I am far more inclined to worry about the state of the nation and the survival of the West myself; if I make a mistake, then I will simply own up to it and correct it. In any event, you have made a big mistake, Dr. Peterson. And you’ve doubled down on it twice already.</p><p>UPDATE: Another informative Peterson quote demonstrating that he is not on the side of the West.<br><i><br/></i><i>“I’m not anti-feminist.”</i><br>Facebook, August 10, 2017</br></br></p></div>",
  "content_text": "I suspected Jordan Peterson not only lacked intellectual integrity, but was not even on the side of Western civilization at all. Yesterday, he contributed more documentation to the growing pile of evidence that he is an enemy of the truth and the West alike.\nJordan B Peterson@jordanbpeterson\nHeavens to Murgatroyd! as Bugs Bunny had it: A misogynistic antisemitic right-wing identity-politics ideologue disapproves of me…\nHe’s referring to\nthis piece by Adam Piggot\n, a soon-to-be former fan of his:\nI have been an advocate of Peterson for a while and he speaks a great deal of truth. But on reflection I am beginning to reappraise my position on him. Did the alt right embrace him so readily because we thought we had finally found someone who taught in progressive universities who wasn’t a foaming at the mouth liberal? Peterson is most certainly not foaming at the mouth; but is it true that he is not a liberal? The assumption has been that but perhaps he is merely a liberal whom we find palatable.\nPeterson seems to be the real deal because we desperately want him to be the real deal.\nAnother thing that I have noticed in his discussions and speeches, and particularly in the Q&A sessions, is that he constantly skirts around the subject of biological reality. Once again the assumption on our part has been that he doesn’t want to go there because it would make his position untenable within the prog system in which he works. But that is a comfortable and convenient assumption on our part. Perhaps the truth is that he doesn’t go there because he himself is a believer of the magic dirt theory of race.\nPeterson’s fans have done their best to try to excuse his behavior, to little avail, as his generic and false accusation quoted above could have just as easily been produced by any other Canadian feminist left-wing academic globalist. Furthermore, we now know that Peterson is aware of my post addressing his inept appeal to the mythical “115 IQ”, as it is cited in the article to which he linked.\nRecently Peterson wrote a piece titled On the so-called Jewish question. There was a good deal of push-back in the comments, but the real push-back he encountered was from Vox Day –\nThe myth of Jordan Peterson’s integrity\n.\n“I do not know Jordan Peterson, but his incorrect and deceitful arguments and his unfair, unjustified attacks on his critics show him to be an inept and integrity-challenged coward who lacks commitment to the truth. The combination of his sudden success with his observable intellectual ineptitude suggests that he has been elevated by the mainstream media in order to provide a harmless, toothless, and non-Christian alternative to the failed conservative movement of William F. Buckley and the failed neoconservative movement of Bill Kristol and Ben Shapiro.”\nAs of this time Peterson has not responded to Day’s demolition of his article. A live debate between the two will most probably not eventuate as Day would be too great a risk and the topics at hand are as we know are verboten for Peterson.\nUltimately I believe that Peterson is an elaborate and very clever deception to prevent young men from inadvertently straying off the progressive reservation.\nIt does rather look as if Peterson is little more than the newest member of the Approved Opposition to be anointed by the mainstream media, to go with “whip-smart” Benny Shapiro, George “now, that twists my bowtie” Will, and the Official Conservative of the Washington Post, Megan McCardle, collectively known as the Washington Generals, media edition. Don’t forget, William F. Buckley became the pope of the conservative movement back in the day on the basis of his show\nFiring Line\nand his public demolition of various leftist patsies such as Gore Vidal.\nYes, Peterson speaks certain truths, but only the easy and uncontroversial ones. From what I see, he is treading the broad and easy path that leads to public acclamation as well as other destinations. But the real problem with Peterson is that he is strategically irrelevant. The societal problems caused by modernism simply cannot be solved by a modernist fighting postmodernism.\nAt this point it is still possible that Peterson will take action to salvage his intellectual integrity. But I think it is increasingly unlikely, as this is the second time in a row that he has doubled-down and resorted to childish attempts to discredit and disqualify his critics rather than responding substantively to them. So, I anticipate that his future behavior, and his continued engagement of other lightweight leftists further to his left in lieu of the growing number of substantial critics to his right, will serve to confirm the opinion of skeptics like NN Taleb and me.\nJordan B Peterson@jordanbpeterson\nAnd you call me a fascist? You sanctimonious prick. If you were in my room at the moment, I’d slap you happily.\nHow very fierce. Truly the epitome of the courageous intellectual warrior. I find myself wondering this: if Jordan Peterson believes calling someone else “a fascist” makes one a sanctimonious prick, then what does calling someone “a misogynistic antisemitic right-wing identity-politics ideologue” make him?\n“I’m worried always that I’ll make a mistake in what I say… impulsive mistake, careless mistake, that I won’t be on top of things in a combative interview, that sort of thing, that I’ll make a mistake. I’ve been worried about that, almost to the exclusion of everything else for the last 15 months.”\n–\nJordan Peterson\nInteresting. I am far more inclined to worry about the state of the nation and the survival of the West myself; if I make a mistake, then I will simply own up to it and correct it. In any event, you have made a big mistake, Dr. Peterson. And you’ve doubled down on it twice already.\nUPDATE: Another informative Peterson quote demonstrating that he is not on the side of the West.\n“I’m not anti-feminist.”\nFacebook, August 10, 2017",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-30T15:03:30+00:00"
}