{
  "url": "https://voxday.net/2018/04/22/inadvertent-special-edition/",
  "scraped_at": "2025-12-19T20:58:38.290011",
  "title": "Inadvertent special edition",
  "date_display": "April 22, 2018",
  "date_iso": "2018-04-22T21:10:19+00:00",
  "date_from_url": "2018-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We made a minor error and a slightly more serious one on the initial printing of the <i>Rebel Dead Revenge</i> teaser. You can see the former <a href=\"http://forum.altherocomics.com/download/file.php?id=35&amp;sid=dfeacf991d8a7459d8e20f93c2508795\">in this photo</a> from a happy Arkhaven supporter. Another Arkhaven supporter shared his thoughts.</p><blockquote class=\"tr_bq\"><p>The postman took his sweet time, but I am finally able to comment on the second issue of Arkhaven’s Dixon/Kwapisz adaptation of Wodehouse, and I continue to be impressed. Margins are better this time out (my only quibble last time, IIRC), coloring remains marvelous (no page 1 credit for the colorist, or is that Gary doing double duty?), Chuck’s script hits all the right notes, and Gary’s art is absolutely delightful. I think I may prefer Cartoony Gary to Representational Gary – the exaggerated body language is fantastic. There’s a meatiness to these comics – I don’t sail through them like I used to with a Mark Millar Wolverine (a three-minute read, maybe), and they’re worth going back over. And of course – Gold Logo. Can’t beat owning a collector’s item. Or three.</p></blockquote><p>Now, if you look at the gold logo on RDR in the picture linked above, you can see there is a sliver of the main image in between it and the black border. That is a mistake and we corrected it almost immediately, but 64 copies were sold and shipped before we caught it. The image now <a href=\"https://aerbook.com/maker/productcard-3739431-1875.html\">on the store</a>, and <a href=\"https://www.amazon.com/Rebel-Dead-Revenge-Stonewalls-Arm/dp/9527065488\">on Amazon</a>, correctly displays the cover the way it is now.</p><p>That initial set also printed with a slightly higher than optimal ink density, which can cause some very slight warping or wrinkling on the interior pages. This has also been fixed. In any event, if you’ve got one of them, you now have confirmation that you own one of the first 64 copies of <i>Rebel Dead Revenge</i>.</p></div>",
  "content_text": "We made a minor error and a slightly more serious one on the initial printing of the\nRebel Dead Revenge\nteaser. You can see the former\nin this photo\nfrom a happy Arkhaven supporter. Another Arkhaven supporter shared his thoughts.\nThe postman took his sweet time, but I am finally able to comment on the second issue of Arkhaven’s Dixon/Kwapisz adaptation of Wodehouse, and I continue to be impressed. Margins are better this time out (my only quibble last time, IIRC), coloring remains marvelous (no page 1 credit for the colorist, or is that Gary doing double duty?), Chuck’s script hits all the right notes, and Gary’s art is absolutely delightful. I think I may prefer Cartoony Gary to Representational Gary – the exaggerated body language is fantastic. There’s a meatiness to these comics – I don’t sail through them like I used to with a Mark Millar Wolverine (a three-minute read, maybe), and they’re worth going back over. And of course – Gold Logo. Can’t beat owning a collector’s item. Or three.\nNow, if you look at the gold logo on RDR in the picture linked above, you can see there is a sliver of the main image in between it and the black border. That is a mistake and we corrected it almost immediately, but 64 copies were sold and shipped before we caught it. The image now\non the store\n, and\non Amazon\n, correctly displays the cover the way it is now.\nThat initial set also printed with a slightly higher than optimal ink density, which can cause some very slight warping or wrinkling on the interior pages. This has also been fixed. In any event, if you’ve got one of them, you now have confirmation that you own one of the first 64 copies of\nRebel Dead Revenge\n.",
  "tags": [
    "DLC"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-22T20:10:19+00:00"
}