{
  "url": "https://voxday.net/2018/04/16/liar-ban-watyf/",
  "scraped_at": "2025-12-19T20:57:42.684245",
  "title": "Liar ban: WATYF",
  "date_display": "April 16, 2018",
  "date_iso": "2018-04-16T01:48:00+00:00",
  "date_from_url": "2018-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve never been impressed by WATYF’s incessant posturing, but since he usually remained within more or less within the boundaries of the rules. I mostly ignored him. However, seeing how he was blatantly misrepresenting my positions at John Wright’s blog, I am now banning him from commenting here.</p><p>It’s really rather remarkable how dishonest so many self-professed Christian conservatives are about the Alt-Right, particularly the Christian Alt-Right, which they prefer to pretend does not even exist. Because they cannot rationally or scripturally defend either their theological positions or their commitments to various forms of equality, they usually resort to lying about us when they can’t simply ignore us. I’ve indicated WAYTF’s false statements in bold text and his omission of the necessary context in italics.</p><blockquote><p>WATYF<br>To be fair, Vox’s emphasis on Christianity is just a bit offset by the fact that <b>he says Christ preaches hatred as a virtue</b> and that <b>murder is totes OK</b> (because war).</br></p><p>Benjamin Wheeler<br>Care to quote him on that? Or did you just think that because he says that not all men are equal that he preaches hatred? That, because he hates war, he wants to prevent it? I didn’t realize that peoples who never meet each other still war.</br></p><p>WATYF<br>No, I’m not misunderstanding him nor am I drawing an inference from something he said. <i>He has said directly and with no equivocation that hatred is morally good (according to Christianity)</i> and that <i>murder is permissible because we’re in a culture war.</i></br></p><p>Here is the latest “hatred is good” post where he invokes God to justify his position. Remember, this isn’t just “we should oppose this view”, it’s “we should actively hate these people”.</p><p>Benjamin Wheeler<br>Strange, because all I got from that was the hatred of sin. The rhetoric is merely a vehicle. “I am proud of my wife for refusing to respect Jack and the social mores enforced by his little Safety Council. What is better than a hot blonde hater? Hate is human, and hatred is a human right. God hates deceit, God hates the wicked, and so should we.”</br></p><p>I didn’t realize I shouldn’t hate evil. I should start loving it! Thank you! I didn’t realize how wicked I was not hating sin.</p><p>WATYF<br><b>Yeah, your rhetoric isn’t going to work on me so don’t bother.</b> I’m obviously not saying anything in your last sentence.</br></p><p>If all you got from that was the hatred of sin then you should read more carefully. He observably *isn’t* just saying, “hate evil”. He’s saying, “<i>hate these PEOPLE because they do evil</i> (<b>or rather, belong to a group that is disproportionately likely to do evil</b>)”. It’s right there in the text you quoted.</p><p>Benjamin Wheeler<br>I know. I’ve got so long to go before I can match Vox.</br></p><p>WATYF<br><b>His doesn’t work either. Rhetoric is generally only useful on the stupid and those who can’t control their emotions. It also makes the user stupider the more they use it.</b></br></p><p>So as I was saying, <b>Vox openly advocates for a version of Christianity that preaches the hatred of entire groups</b> (and individuals) as well as some other rather <i>unchristian “virtues”</i>. Yes, he repeatedly points out how Christianity is a pillar of Western Civilization (which I agree with), but I wouldn’t go to him to find out exactly what Christianity is.</p><p>Benjamin Wheeler<br>Right, but he gets a reaction out of you, since you’re both emotionally offended by him and unable to think past his rhetoric to any points underneath. I’m pretty sure you ignore any dialectic because it’s easier to paint him with a brush thanks to rhetoric.</br></p><p>WATYF<br>Are you reading anything I’m writing? I’m trying to figure out if you’re still trying to use rhetoric or if you just can’t understand the argument.</br></p><p><b>I’m not “reacting” to what he’s saying. I’m analyzing it (rather coldly and dispassionately). I’m quite able to “think past his rhetoric” which is why I can present the points underneath, and the points are explicit.</b> People have asked him directly on his own blog to clarify and he has. At first, I assumed it must be some kind of tactic involving irony or whatever, but after enough times where he said it, explained his defense of the position, and confirmed it to people who asked, I saw no utility in assuming the opposite of what was obviously true.</p><p>But if you like, you can keep telling yourself that “God says it’s OK to hate people” doesn’t actually mean “God says it’s OK to hate people”. That just strikes me as a decidedly self-deluded way to approach the matter.</p><p>You’re not “pretty sure” of anything here. Nothing you’ve said has actually addressed anything I’m actually saying. I started reading Vox over a decade ago when he mostly avoided rhetoric and engaged in dialectic debates on a regular basis. That’s what attracted me to it. Now, it’s almost non-stop rhetoric, all day every day. It’s his blog, so whatever, but the change in the quality of the commenters there is a pretty good indicator of how that shift has affected his readership.</p></blockquote><p>It’s amusing that WATYF claims that it is non-stop rhetoric here. That’s simply not the case. As for the intellectual quality of the commenters, it has naturally gone down as the readership has grown from 3,000 daily to 100,000 daily, but due to my consistently weeding out posers, gammas, trolls, and liars, it is a considerably more honest discourse than one will find elsewhere.</p><p>I would much rather have 10 honest commenters of average intelligence than 100 highly intelligent dissemblers and deceivers all trying to push their false narratives on the readers here.</p><p>As usual, WATYF is flat-out wrong. God does not just hate sin. God does not just hate wickedness.<i> God hates the wicked. </i>The wicked are clearly <i>people</i>, a subset of the human race set apart by their thoughts and their actions. Now, to the best of my understanding, the wicked are <i>individuals </i>who are not merely sinful, who are not merely weak, who have not merely given into temptation, but are those who have actively and purposefully set themselves against God and hate Jesus Christ. They are described as liars and deceivers and slanderers, among other things.</p><p>Should the Christian hate the wicked or should he love them? That is the question that I have yet to see a Churchian answer directly, without equivocation or dissembling or substituting words. And I also have an important follow-up question: is there a difference between sin and wickedness?</p></div>",
  "content_text": "I’ve never been impressed by WATYF’s incessant posturing, but since he usually remained within more or less within the boundaries of the rules. I mostly ignored him. However, seeing how he was blatantly misrepresenting my positions at John Wright’s blog, I am now banning him from commenting here.\nIt’s really rather remarkable how dishonest so many self-professed Christian conservatives are about the Alt-Right, particularly the Christian Alt-Right, which they prefer to pretend does not even exist. Because they cannot rationally or scripturally defend either their theological positions or their commitments to various forms of equality, they usually resort to lying about us when they can’t simply ignore us. I’ve indicated WAYTF’s false statements in bold text and his omission of the necessary context in italics.\nWATYF\nTo be fair, Vox’s emphasis on Christianity is just a bit offset by the fact that\nhe says Christ preaches hatred as a virtue\nand that\nmurder is totes OK\n(because war).\nBenjamin Wheeler\nCare to quote him on that? Or did you just think that because he says that not all men are equal that he preaches hatred? That, because he hates war, he wants to prevent it? I didn’t realize that peoples who never meet each other still war.\nWATYF\nNo, I’m not misunderstanding him nor am I drawing an inference from something he said.\nHe has said directly and with no equivocation that hatred is morally good (according to Christianity)\nand that\nmurder is permissible because we’re in a culture war.\nHere is the latest “hatred is good” post where he invokes God to justify his position. Remember, this isn’t just “we should oppose this view”, it’s “we should actively hate these people”.\nBenjamin Wheeler\nStrange, because all I got from that was the hatred of sin. The rhetoric is merely a vehicle. “I am proud of my wife for refusing to respect Jack and the social mores enforced by his little Safety Council. What is better than a hot blonde hater? Hate is human, and hatred is a human right. God hates deceit, God hates the wicked, and so should we.”\nI didn’t realize I shouldn’t hate evil. I should start loving it! Thank you! I didn’t realize how wicked I was not hating sin.\nWATYF\nYeah, your rhetoric isn’t going to work on me so don’t bother.\nI’m obviously not saying anything in your last sentence.\nIf all you got from that was the hatred of sin then you should read more carefully. He observably *isn’t* just saying, “hate evil”. He’s saying, “\nhate these PEOPLE because they do evil\n(\nor rather, belong to a group that is disproportionately likely to do evil\n)”. It’s right there in the text you quoted.\nBenjamin Wheeler\nI know. I’ve got so long to go before I can match Vox.\nWATYF\nHis doesn’t work either. Rhetoric is generally only useful on the stupid and those who can’t control their emotions. It also makes the user stupider the more they use it.\nSo as I was saying,\nVox openly advocates for a version of Christianity that preaches the hatred of entire groups\n(and individuals) as well as some other rather\nunchristian “virtues”\n. Yes, he repeatedly points out how Christianity is a pillar of Western Civilization (which I agree with), but I wouldn’t go to him to find out exactly what Christianity is.\nBenjamin Wheeler\nRight, but he gets a reaction out of you, since you’re both emotionally offended by him and unable to think past his rhetoric to any points underneath. I’m pretty sure you ignore any dialectic because it’s easier to paint him with a brush thanks to rhetoric.\nWATYF\nAre you reading anything I’m writing? I’m trying to figure out if you’re still trying to use rhetoric or if you just can’t understand the argument.\nI’m not “reacting” to what he’s saying. I’m analyzing it (rather coldly and dispassionately). I’m quite able to “think past his rhetoric” which is why I can present the points underneath, and the points are explicit.\nPeople have asked him directly on his own blog to clarify and he has. At first, I assumed it must be some kind of tactic involving irony or whatever, but after enough times where he said it, explained his defense of the position, and confirmed it to people who asked, I saw no utility in assuming the opposite of what was obviously true.\nBut if you like, you can keep telling yourself that “God says it’s OK to hate people” doesn’t actually mean “God says it’s OK to hate people”. That just strikes me as a decidedly self-deluded way to approach the matter.\nYou’re not “pretty sure” of anything here. Nothing you’ve said has actually addressed anything I’m actually saying. I started reading Vox over a decade ago when he mostly avoided rhetoric and engaged in dialectic debates on a regular basis. That’s what attracted me to it. Now, it’s almost non-stop rhetoric, all day every day. It’s his blog, so whatever, but the change in the quality of the commenters there is a pretty good indicator of how that shift has affected his readership.\nIt’s amusing that WATYF claims that it is non-stop rhetoric here. That’s simply not the case. As for the intellectual quality of the commenters, it has naturally gone down as the readership has grown from 3,000 daily to 100,000 daily, but due to my consistently weeding out posers, gammas, trolls, and liars, it is a considerably more honest discourse than one will find elsewhere.\nI would much rather have 10 honest commenters of average intelligence than 100 highly intelligent dissemblers and deceivers all trying to push their false narratives on the readers here.\nAs usual, WATYF is flat-out wrong. God does not just hate sin. God does not just hate wickedness.\nGod hates the wicked.\nThe wicked are clearly\npeople\n, a subset of the human race set apart by their thoughts and their actions. Now, to the best of my understanding, the wicked are\nindividuals\nwho are not merely sinful, who are not merely weak, who have not merely given into temptation, but are those who have actively and purposefully set themselves against God and hate Jesus Christ. They are described as liars and deceivers and slanderers, among other things.\nShould the Christian hate the wicked or should he love them? That is the question that I have yet to see a Churchian answer directly, without equivocation or dissembling or substituting words. And I also have an important follow-up question: is there a difference between sin and wickedness?",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-16T00:48:00+00:00"
}