{
  "url": "https://voxday.net/2018/04/19/mailvox-googlers-exit-google/",
  "scraped_at": "2025-12-19T20:58:13.792955",
  "title": "Mailvox: Googlers exit Google",
  "date_display": "April 19, 2018",
  "date_iso": "2018-04-19T12:52:56+00:00",
  "date_from_url": "2018-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was aware that more people are leaving Google because they don’t want to deal with the lunatic SJWs that are running the asylum any longer. The hapless Sundar Pikachu simply cannot control them, despite them being a very small, very vocal, very crazy minority of the employees. This email from a reader confirms what I’d already been hearing.</p><blockquote><p>I had an interesting encounter with an ex-Googler this afternoon. A man overheard me and a colleague talking about Fortran at a coffee shop, and he started chatting with us about computer programming. Turns out, he’s an ex-Google developer.</p><p>My colleague asked him what he thought of the James Damore situation, and he surprised us a little by responding that that was the main reason he’d quit Google. He said he didn’t want to be part of an environment where people were not free to express reasonable opinions. When I asked him if there were others at Google who felt the same way, he said, yes, most of them. <i>Most of them.</i> It may look like all of Google has gone insane, but it’s really a minority of loud, obnoxious SJWs ruling things there.</p><p>It sounds crazy that a few mentally ill tyrants could dominate a place like Google, but this dovetails with something Jordan Peterson points out in a recent interview with Australian ex-deputy PM John Anderson. Peterson says that tyrants, whether petty or large, are not psychologically equipped to deal with resistance. I believe you’ve said something to this effect in your SJW books. If anyone needs more convincing, well, we have a man whose expertise is human behavior and who has extensively studied the great tyrannies of the 20th century telling us that tyrants will cave most of the time when they are resisted. But most people don’t resist, because they figure it will cost them too much. Peterson counters that resistance costs comparatively little when you consider what will happen if you don’t do anything.</p><p>This was underscored by my ex-Google acquaintance’s parting comment, that if even 10{a538f03b5e5ee5fdc03407ba0ca231ac78bf6d75a4715bce2458722af48b01e9} of people in the tech world actively resisted the SJWs, that nonsense would come to an end very quickly.</p></blockquote><p>Of course, this is true of SJWs and the larger culture as well. Look at how the Alt-Right’s resistance has made significant inroads into the SJWs’ ability to intimidate and destroy their targets. The conservative strategy of retreat, complain, condemn, and cry does not and will never work; it is intrinsically and inevitably defeatist.</p><p>As with most bullies, a metaphorical punch or two in the mouth is sufficient to dissuade the average SJW. As evidence, I offer the observation that SJWs have tended to steer well clear of me ever since I published SJWAL.</p><p>Speaking of punching bullies in the mouth, three more men have joined <a href=\"http://www.breitbart.com/tech/2018/04/18/three-new-plaintiffs-join-james-damores-discrimination-lawsuit-google/\">the lawsuit against Google</a>:</p><blockquote class=\"tr_bq\"><p>Three new plaintiffs have joined former Google employee James Damore’s lawsuit against the company, alleging gender, racial, and political discrimination. Manuel Amador, Stephen McPherson, and Michael Burns, who were all job applicants turned down by Google, have joined the lawsuit.</p></blockquote><p>Given what we know about Microsoft and Pikachu’s background, the lawyers for the plaintiffs should dig deep for any potential unlawful favoritism being shown to applicants with Indian backgrounds.</p></div>",
  "content_text": "I was aware that more people are leaving Google because they don’t want to deal with the lunatic SJWs that are running the asylum any longer. The hapless Sundar Pikachu simply cannot control them, despite them being a very small, very vocal, very crazy minority of the employees. This email from a reader confirms what I’d already been hearing.\nI had an interesting encounter with an ex-Googler this afternoon. A man overheard me and a colleague talking about Fortran at a coffee shop, and he started chatting with us about computer programming. Turns out, he’s an ex-Google developer.\nMy colleague asked him what he thought of the James Damore situation, and he surprised us a little by responding that that was the main reason he’d quit Google. He said he didn’t want to be part of an environment where people were not free to express reasonable opinions. When I asked him if there were others at Google who felt the same way, he said, yes, most of them.\nMost of them.\nIt may look like all of Google has gone insane, but it’s really a minority of loud, obnoxious SJWs ruling things there.\nIt sounds crazy that a few mentally ill tyrants could dominate a place like Google, but this dovetails with something Jordan Peterson points out in a recent interview with Australian ex-deputy PM John Anderson. Peterson says that tyrants, whether petty or large, are not psychologically equipped to deal with resistance. I believe you’ve said something to this effect in your SJW books. If anyone needs more convincing, well, we have a man whose expertise is human behavior and who has extensively studied the great tyrannies of the 20th century telling us that tyrants will cave most of the time when they are resisted. But most people don’t resist, because they figure it will cost them too much. Peterson counters that resistance costs comparatively little when you consider what will happen if you don’t do anything.\nThis was underscored by my ex-Google acquaintance’s parting comment, that if even 10{a538f03b5e5ee5fdc03407ba0ca231ac78bf6d75a4715bce2458722af48b01e9} of people in the tech world actively resisted the SJWs, that nonsense would come to an end very quickly.\nOf course, this is true of SJWs and the larger culture as well. Look at how the Alt-Right’s resistance has made significant inroads into the SJWs’ ability to intimidate and destroy their targets. The conservative strategy of retreat, complain, condemn, and cry does not and will never work; it is intrinsically and inevitably defeatist.\nAs with most bullies, a metaphorical punch or two in the mouth is sufficient to dissuade the average SJW. As evidence, I offer the observation that SJWs have tended to steer well clear of me ever since I published SJWAL.\nSpeaking of punching bullies in the mouth, three more men have joined\nthe lawsuit against Google\n:\nThree new plaintiffs have joined former Google employee James Damore’s lawsuit against the company, alleging gender, racial, and political discrimination. Manuel Amador, Stephen McPherson, and Michael Burns, who were all job applicants turned down by Google, have joined the lawsuit.\nGiven what we know about Microsoft and Pikachu’s background, the lawyers for the plaintiffs should dig deep for any potential unlawful favoritism being shown to applicants with Indian backgrounds.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-19T11:52:56+00:00"
}