{
  "url": "https://voxday.net/2018/04/13/mensch-vs-day-anti-semitism-debate/",
  "scraped_at": "2025-12-19T20:57:18.623976",
  "title": "Mensch vs Day: Anti-Semitism Debate",
  "date_display": "April 13, 2018",
  "date_iso": "2018-04-13T17:10:49+00:00",
  "date_from_url": "2018-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Alt-Right Anti-Semitism Debate: Vox Day vs Louise Mensch</b><br>By Vox Day and Louise Mensch<br><a href=\"https://archive.fo/21N0i\">11:43 am, May 28, 2016</a></br></br></p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>This may surprise the people that have been following our debate thus far, but, I feel like those were all small, little, light-hearted warm up debates, because now we’re going to get into it. Because we’re going to debate anti-Semitism.</p><p>I want to get a bit granular, because I was surprised and disappointed to see you flaming a very good friend of mine, Cathy Young – who is an equity-based feminist, for those of you that don’t know her, reading this debate – and a long time ally of Gamergate and has worked extremely hard to separate genuine feminism from the kind of “fauxminism” that bullies men for no good reason.</p><p>I can’t remember the exact tweet so you can correct me if I’ve got this wrong, but: “…as she would know if she were a real American,” as though she were not an American, or she were less American that you are, which I think is a) racist; b) completely ridiculous; c) unbecoming of an alpha-male who ought to show some loyalty to a tried and tested ally.</p><p>What I don’t like about this, apart from racism in general, and I say it with reverence, because you of all people know that I’ve been #notyourshield forever, is that it seems to give quite a lot of comfort to those fauxminist harridans, who’ve always said that Gamergate is just about abuse etc … This is a woman who stood strongly with movement forever, and the first sign of disagreement on anti-Semitism and you guys throw her under the bus. So I’ll let you come back, what do you have to say?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Well, I’m perfectly prepared for things to get hardcore, I’ve been listening to Ministry all afternoon in preparation for this. By the way, I did not know Cathy’s work on Gamergate. We are loyal; until now I did not know.</p><p><span style=\"white-space: pre;\"><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span> </span>(Laughs) OK, now I’m scared. Go on.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>First of all, let me point out that, in terms of feminism, Cathy Young committed something that is, in the eyes of the alt-right a significant error of the sort that removes any right to avoid criticism. She, very very publicly, and very very vehemently, attacked Ann Coulter. The response that she got was a direct result of that, from me and from others. You can even, if you wish to, portray it as the alt-right white knighting for Ann Coulter. I don’t think that would be accurate but you certainly could do that if you wanted to.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Well Ann Coulter’s been … I mean, you know, please, she attacks herself. She’s been attacked by me and others. She’s said some rabidly anti-Semitic things, about the Jews etc.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>I don’t think Ann Coulter’s said anything that can reasonably be considered anti-Semitic.</p><p><span style=\"white-space: pre;\"><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span> </span>How many goddamn Jews do they think there are in America, that kind of thing.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>There’s a difference between … Anti-Semitism, in its historic form, means hatred of Jews.</p><p><span style=\"white-space: pre;\"><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span> </span>Yes.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>And there’s a huge difference between hating Jews and wondering why the hell everyone is babbling about them, again, when the subject really has nothing to do with them.</p><p><span style=\"white-space: pre;\"><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span> </span>Well in this case Ann Coulter used the words “Jews.” “How many goddamn Jews does he think there are in America,” quote unquote.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Well yeah, because polls show Americans think that 33{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of Americans are gay, and certainly there … I don’t know what the exact figure is, I don’t recall a similar study being performed with regards to what percentage of Americans other Americans believe are Jews. I don’t know. But I would guess that the perceived percentage is seriously overestimated, due to the constant discussion of Jews, by American Jews, in the media, because American Jews in the media are prone to navel-gazing.</p><p><span style=\"white-space: pre;\"><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span> </span>Vox, Vox, this was Ann Coulter who brought it up herself, who made the remark, herself. Really, as an “Ayn Randian radical,” don’t you recognize this is entirely Ann Coulter’s own fault? She brought it up, nobody else did, she ranted on about the Jews. She outed herself! Nobody else was talking to her about the Jews. On the left it’s people like Ken Livingston in London. He doesn’t seem to be able to go into any interview in London without mentioning the word ‘Hitler’ five times a second. And it was Coulter’s own fault. No one was talking to her about the Jews in Israel. She was commenting on the first Republican debate, and she brought it up, herself, entirely herself, unprompted.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Correct me if I’m wrong, but wasn’t she discussing the fact that the candidates were discussing Israel, or Jews or something like that?</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>They aren’t the same, are they?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>They’re not the same but it’s certainly related. I’ll be the first to point out that they’re not the same at all.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> B</span>ecause you said basically you owe no loyalty to Cathy Young despite an extraordinarily long time defending Gamergate in general, or Gamergate in particular I should say and men in general from the false persecution of the bating fauxminist movement. Now she insulted your girl Coulter – by the way, I consider Coulter as something lower than the stuff I find to scrape off my shoes – and all of a sudden, you more or less said that she deserves all the anti-Semitism that she gets.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>No, what I’m saying is that Cathy Young has made it necessary for people to choose between her and Ann Coulter, and people like Milo and I made it very clear that we choose Ann. That’s all.</p><p><a name=\"more\"></a><br><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>So basically, I’m looking at it here now, so this is the tweet, it’s 17th of September 2015.  And Coulter says, “How many fucking Jews do these people think there are in the United States?” That’s on her. There’s really nobody who’s brought it up except her, that’s her.</br></p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>But that sounds like a response to something, to me, and I don’t know what it’s a response to.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>The debate.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Yeah, I didn’t watch the debate. (Laughs)</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Well they were talking about Israel … and she says, “How many effing Jews do people think there are in America?”</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Well, right, and I think she thinks that there’s … I guess what I don’t understand is … I don’t think that using the term “fucking Jews” indicates that you hate them. I think that it sounds to me very exasperated, like why are we … For example, you read the New York Times, right?</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Not really. Well, my husband reads it because he’s a liberal, so occasionally it’s lying around the house and I have nothing else to read …</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Every time I forget that your background being British, you wouldn’t have grown up reading it. Anyhow, the thing is that for the average American, who doesn’t live in New York City, we simply do not understand why the media is constantly discussing Jews. It makes no sense to us. When I was growing up in Minnesota, I did not know a single Jewish person. Obviously I still read the Bible and that sort of thing, and when I went to school on the East Coast and then … Now I know, I wouldn’t say a lot, but I know a fair number, I’m quite good friends with a few. But, if I did not understand the makeup of the media, I would still personally be very confused about why the media is constantly talking about them, for good or for ill. For example, I’m Native American. How often do you see newspaper articles – other than something to do with the Redskins, these days – how often do you see articles about what we Native Americans think? You don’t.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Mostly because people aren’t going around Twitter, your Donald Trump’s fans, and you re-tweeted again – I was sorry to see it – you re-tweeted at a troll that goes by the name – who I really should hunt down – a troll that goes by the name of Ricky Vaughn, who came up with such epic classics as … Cathy wrote about his tweets for us … you know, Negroes, Jews, the Holocaust, you’re going to get what you deserve, threats of the Holocaust, etc. He used the term Negroes. This is a guy that you re-tweet.</p><p>Now, I have you on a higher plane, I believe you to be an intelligent man. You are factually an intelligent man, whether I believe it or not, that’s quite clear, in the way that you conduct your arguments. One doesn’t want to sonorously shake one’s head and say “You’re better than this,” but I must say I was surprised. When you get somebody using base racial abuse like the troll behind the Ricky Vaughn account and you’re re-tweeting him, giving him air … Difficult, because it kind of makes – I really don’t want Zoe Quinn to be able to go, “Told you so,” and I see the sort of “alt-right takeover” – and of course I don’t want to suggest in any way that Gamergate is alt-right, that would be terrible …</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>No.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>I mean it is not, it is not. To my mind, you’re giving them points, when you re-tweet a guy like that. You come back at me while I go to look up tweets from this guy. Of course there’s too many to talk about because he’s so unbelievably racist, but I will pick out a couple.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Well there’s a couple things. First of all, I overtly reject the concept of guilt-by-association, and I don’t shy away from it. I get called … I’ve been getting called racist and anti-Semitic and white supremacist and homophobic and everything, for literally fifteen years.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Are you? Are you? But Vox, are you any of those things?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>No. I’m not. In fact I’m probably one of the very few people who can say that the Jewish Defense League has actually talked to me and concluded that I’m not anti-Semitic. Certainly, you know, Martin van Creveld, the illustrious Israeli military historian, would not be terribly inclined to choose me as his editor and his publisher if I had any hatred for Jews, and I don’t. That’s quite simple.</p><p>On the other hand, I point out that I’m not one of those conservatives that somehow feels that the Jewish people are any more virtuous or anything else that anyone else. I’m just not terribly concerned … First of all, I grew up in the American Midwest and I’ve lived in Europe for most of my adult life. It has no personal relevance to me one way or the other, with the exception of some of my personal friends and some of my authors. Obviously, I would not wish to personally offend any of them in any way that I would wish to personally offend any of my other friends. But on the other hand, I don’t really care about what some alt-right flamethrower … They’re not upset about him … why should I be?</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>You’re re-tweeting this guy Ricky Vaughn, frequently, so I want to read you three tweets that Cathy singled out for her piece on the anti-Semitism of Trump alt-right supporters.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Mm-hmm (affirmative).</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Here’s the first one: “Germany had two choices: genocide by Bolshevik Jews, or Hitler. If Trump isn’t elected, we will face a similar situation.” There Vaughn says that Communist Jews will kill everyone in America, if Trump isn’t elected. He also appears to be favorably comparing Trump to Hitler in that tweet.</p><p>Here’s another one: “Hitler said the Jews wanted to bring Negroes [sic: I apologize to our readers] Hitler said that the jews wanted to bring negroes into the Rhineland, and history has vindicated him on this point.”</p><p>Three: “The jews fear that Donald Trump is Hitler because they know that they have done great evil in America. They fear justice will be done.”</p><p>Again now on those few things he is a) comparing Trump favorably to Hitler; b) saying that the Jews are going to kill everybody; and c) denigrating not only the Jewish people but African-Americans for he only uses a really disgusting racial slur.</p><p>How can you? It’s not really guilt-by-association, I think guilt-by-association is when for example somebody says to me, “Well Louise Mensch, you’re followed by such-and-such a person.” You and I have got tens of thousands of followers, we cannot possibly vet all our followers.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Right.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>And by the way, once in awhile I will re-tweet somebody, I have re-tweeted a far right person by mistake, you know, not having checked that person’s entire TL. But I’m going to assume that you know who Ricky Vaughn is. You re-tweet him enough times, I’m going to assume you know exactly who he is …</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Yes, of course.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>… and what he says, and when you re-tweet him it isn’t by accident, so in this case, I don’t think it’s mere association, because the acts of tweeting him often and amplifying a voice that is as racist and and sick as that, isn’t just as a mere association, it’s a serious act.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Well I think that it would be a serious act that you could criticize me for if I was re-tweeting those specific things. Let me give you an example: There’s a gentleman by the name of Popehat …</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Yeah.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>He’s actually two people and  I don’t think it would be too …</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>I’m a big fan.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>… too much of an exaggeration to say that he absolutely loathes me. And I have been exceedingly cruel to him by repeatedly pointing out that the guy’s a nutcase.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Well, you just said he’s two people, why aren’t you using the plural?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Popehat is actually two individuals.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Yeah, so why didn’t you say “them”? It’s confusing, you say “he hates me,” do you mean “they hate me”?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>What’s that?</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>You’re saying “he hates me” but do you not mean “they hate me”?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Actually I’m pretty sure they both do.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Right.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>But the Ken White part, particularly dislikes me. But that’s OK, that’s fine, that’s his prerogative. I re-tweet him on occasion, simply because, despite the fact that he hates me, he occasionally says something that’s funny and perspicacious. And so, Ricky Vaughn, I don’t agree with him on everything, but I certainly agree with him on some things. He’s a Trump supporter, he’s been an important Trump supporter, and so … I’ve no qualms whatsoever about … I’m not responsible for … I’m responsible for what I say and for what I do. You might say or do something reprehensible at some point, and that wouldn’t stop me from re-tweeting you either.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>So you’re saying that your re-tweeting of a guy who is racist is OK as long as you don’t re-tweet specifically racist things that he says?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>I wouldn’t say OK, I would say that it is not racist to re-tweet non-racist things from a racist. I’ll go further. I’ll give you some more information. I think that people have an absolute right to be racist. Or to be anti-Semitic, or to be anti-German, or to be anti-Native American for that matter. Not that anyone is anymore, but that’s part of what the freedom of thought … I think that’s Martin Luther but … the development’s inside, thoughts are free. We can’t simply tell people to not hate people, or not dislike people. Maybe their reasons are good, maybe their reasons are stupid. But clearly they feel what they feel, they think what the think. For example, there are some Jews that I know that are, overtly, anti-German. Now, I understand that. I don’t blame them at all for refusing to buy Mercedes because of what happened seventy years ago, that’s fine. But I don’t think that’s logical. I don’t think that that really makes a whole lot of sense, but that’s how they feel and I respect that. In the same way…</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>There’s no reason to respect feelings that are stupid. And I think there’s a difference between … Would you not agree that the idea of free speech – we both support free speech, I’m perhaps not as absolutist as you – but free speech has always has the “get-outs” of the “fire in a crowded theater” clause. You know, free speech doesn’t mean I can tell everybody your bank account, your social security number, or give them nuclear launch codes, or shout “Fire!” in a crowded theater, so there’s always some pragmatic limits to the idea of free speech.</p><p>Now in this case if you’re right, and Ricky Vaughn is one person, he has not just said “I hate the Jews,” which is social discourse within the range of protected free public expression. But he has said things that are going to incite people to hurt the Jews, and he’s threatened them, saying “You’re going to kill everybody, you’re going to get the punishment that’s coming to you.” Cathy Young has had tweeted to her something the alt-right have as a macro,  a themed anti-Semitic cartoon from Nazi Germany of a hook-nosed Jew, rubbing his hands in some sort of a Shylockian pose. She’s been tweeted pictures of a smiling Donald Trump pushing the button on the gas chambers as he ushered Jews into it, and so have a bunch of other Jews. In fact I’m going to do a bit of work on this, because I don’t know that there’s all that many of them, I’m pretty sure I recognize … I’m quite quite good at Twitter, I recognize a bot when I see one.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>What?</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>One of these guys runs a bot, it’s really quite obvious, and I’ve seen the bots at work, so I’d love to know how many of them there actually are. But the similarity of the anti-Semitism and the images, these are grossly upsetting, in some cases, like the journalist who interviewed Melania Trump. Melania Trump said the anti-Semitism against that Jewish woman was provoked, they took it off social media –  calls to her house, other threats, etc. Now I have to assume that if somebody called your wife and threatened to kill her, you wouldn’t be OK with that, and you’d be on the phone to the police.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>I’m pretty sure I wouldn’t, because we’ve gotten tons of death threats over the years. I mean, to be honest, I don’t really … It’s not like I enjoy the various death threats and death wishes and all that sort of thing, but I don’t them very seriously either. I’ve literally never … I’ve gotten hundreds and possibly thousands of death threats, if you count death wishes as well, and I’ve never called the police about it.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Well these are death threats and these are death threats against their women.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>But it’s not … First of all there’s two things: Number one, what I call Holocaustianity, is a secular religion in the United States, is preached by the media. And, we’ve all been … Every kid who’s grown up in the US has been subjected to it. And, what you’re seeing, with a lot of the various anti-Semitic themes and memes and all that sort of thing, is basically a rebellion against that.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Why, why would you rebel against being taught about one of history’s most appalling massacres, which happened in the modern age and for which rarely therefore, as opposed to in historic massacres, we have photographic evidence?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Because it happened seventy years ago and nobody under forty gives a damn. I mean that was part of what Milo …</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>You’ve got to be kidding me. You think nobody under forty gives a damn? you are way out of touch man, yes they do. You think nobody under forty gives a damn …ask somebody whose grandparents are survivors.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>I know they don’t. I know they don’t. I went around as asked a bunch of teenagers, and on a scale of one to ten, they rated the Holocaust a one.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>That’s a symptom … Well you must have some terrible teachers in your area, some really terrible teachers.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>The thing that people are forgetting, is that that was seventy years ago.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>So what?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>And nobody cares seventy years after the Taiping Rebellion, that an estimated thirty to fifty million people died, nobody cared about the Taiping Rebellion. We are now as far from the Holocaust – and I don’t deny it, I believe it happened, I think it’s absurd to pretend that it didn’t happen – but, for example … Let me give you an example from my own history: Obviously the American Indians were mistreated in a variety of ways, right? But, nobody cares about them anymore because it happened … Even we American Indians don’t really get that upset about it anymore because it happened so long ago. Now, obviously the Holocaust is more recent than the Trail of Tears, but that same process that has rendered the Trail of Tears an indifferent, ancient history to young people today, that process is now happening … There’s going to come a time, whether it’s tomorrow or in a hundred years, there’s going to come a time when nobody gives a damn.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Yeah but that’s not now Vox, because people’s grandparents, it happened to people’s grandparents that are still living today. If you think that people don’t care, young people don’t care, I would say that anecdote is not evidence, and it just is that the young people that you spoke to have zero compassion or zero education. My children care, they all care very much. They’ve been educated about the Holocaust and none of them are Jewish …</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>But you live in an area that is heavily Jewish, I’d expect them to care, of course they care.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>By the way, they cared in Britain too, where the area in which I lived was not Jewish at all.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>How much do you care about what happened in Cambodia for example? Or, The Great Leap Forward killed considerably more people than the Holocaust did, it happened more recently, and yet I don’t see people being very upset about that either.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>As I said to you before, the Holocaust, amongst the great massacres of history, is distinguished partly by the tortures, the specifically sadistic tortures, not just the straight up killing, which accompanied it. Generally exquisite tortures, medical experiments – I won’t go into them because I don’t want to – the utter lack of compassion, and barbarity, but mostly, because, as I said, photographic, and towards the end of it, even some film evidence exists so that it is made emotionally real. As someone said, a hundred thousand dead is a statistic, three dead is a tragedy  – because you can relate to three, whereas you can’t to, as an example, millions starved to death in Stalin’s Russia. But I have an awful lot more videographic evidence and photographic evidence of the suffering of the Jewish people, in front of me, and therefore our natural humanity is excited by that. Is there not something odious, really odious about going “This bad thing happens, so your bad thing doesn’t count?” I mean, what is the point?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>No, I think it’s totally normal, and I think that the Holocaust has been an outlier, in that people, in the United States particularly, did care about it for a much longer period of time than is normal.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>And they still do.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>But I think there’s two things that you need to keep in mind here: Number one, the passage of time, so, the more time that passes, the less people care about what happened, in general. Secondly: The demographic changes to the United States means that there are considerably more Americans that don’t give a damn, one way or the other, about World War Two, about Germany, about the Holocaust, about any of it. It has nothing to do with … Hispanics. It has nothing to do with Asians. It has nothing to do with Africans.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Sure it does.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>And they just don’t care.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Yes it does, you know why? Yes it has to do with all three of those groups, and you know why? Because they’re all Americans. And for a man who, in our last debate, when we were talking about history, was giving reference to culture throughout history and seemed to have a great reverence for history, I think you underestimate the American people insofar as you think that they cannot derive a large part of the their identity – as well they should – from the heroism of the greatest generation of Americans, who along with the British, saved the world in World Wars One and Two, and particularly in World War Two from the intense evil of the Nazis. If you think that I cannot take pride, for example because I was born in 1971, take great pride in knowing the fact that both my grandfather’s served and my maternal grandfather was a gunner on a naval ship. It gives me immense pride. For that matter, I take an awful lot of pride in the victories of Henry the Fifth at Agincourt. The history of a nation is what makes up its warp and weft, its fabric. You don’t have to have been there to care. What an amazing failure of imagination, from a man that appears to reverence history.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>It’s not a history of imagination, it’s the fact that I know perfectly well that most of the generations probably couldn’t tell you who we went to war with in World War Two, that’s why I say that they don’t give a damn, because they don’t even know.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>That’s an argument for better education. I think they know about the Germans, it’s an argument for better education.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>But it doesn’t. First of all, that’s a whole other can of worms, there are significant problems with the American education system and I’m sure we both agree with that, but …</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Mm-hmm (affirmative).</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> W</span>hat I’m saying is that whether you can explain why it is or not, it doesn’t change the fact that the more time passes and the more that the American population demographic changes, the less interest those various populations are going to have in the Holocaust narrative and the American obsession with World War Two and everything surrounding it and all that sort of thing.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>I don’t agree with you because as population become American, they will take pride in the history of America and the history of America is the history of liberation.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>I’ve written a bestseller, <i>Cuckservative</i>, which addresses those very points and indicates that’s not the case, it’s just not the case anymore.</p><p><b>Louise Mensch</b>:<span style=\"white-space: pre;\"> </span>Let’s get onto whether or not the youth of America can relate or take pride in any part of American history. You’d better hope so, because the Constitution and the Founding Fathers, to whom you referred in your last debate, were around considerably earlier than any part of World War Two, including the horrors of the Holocaust.</p><p>Now let me get back at you with one more thing before we … You know, you can come at me if you like and then we can wrap it up. As always, I enjoy these debates with you and when I look down at my phone we’ve been on the phone for half an hour even though it seems like five minutes.<br>Obviously, what you’re arguing there is that you’re making an argument for indifference. You’re saying that the younger generation, because they are far removed in time, and also because they don’t come from traditional white American backgrounds, you’re saying two things about them: Both that they don’t care because it was so long ago and b) they don’t care because they are more into their own ethnic groups than they are into being Americans, so they have no pride in the shared history of the nation. It’s an argument for indifference. I don’t believe it, as I’ve just said. However, the anti-Semitism that is getting tweeted at Cathy Young, and John Podhoretz and often at myself – because of my surname, they assume that I have the honor to be Jewish, although I do not – is not indifference to the Holocaust, it is using the specific tortures against the Jewish people and specific anti-Semitic slurs used by Hitler, re-employing them to make points for Donald Trump, who of course welcomed his Jewish grandchild into the world just recently, his daughter of course is converted to Judaism. It’s clearly they’re not indifferent about the Holocaust, and in a way, although as shameful as that would be, that would be better than what we are faced with. They are cheerleading for the Holocaust, like Ricky Vaughn. Ricky Vaughn is cheerleading for the Holocaust.  They’re sending African-Americans photographs of black men being lynched and hung from trees. This is not something that the alt-right should be proud of, Vox, it’s something the alt-right should be ashamed of, and they do care about the Holocaust very much, because they use the horrors of it and its hatred as weapons against Jews.</br></p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>First, I agree with you that those two things are totally separate. They are totally separate. But what I think that you’re failing to recognize is that the alt-right rejects shame. And the alt-right will never be ashamed of anything and the alt-right will never back down from anything, because we have learned from the example of the left, which is, you always, you never disavow your extremists, because they’re the ones who will clear the way.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Clear the way how? What does that mean? How is somebody tweeting a picture of African-Americans being hung, as slaves, to a black person, or how is somebody tweeting to a Jew a picture of children being shoved into a gas oven, how is that clearing the way for anything? How do they help you? How are they your fore-soldiers?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Because it’s rhetoric. Rhetoric is designed to manipulate emotions, it persuades by manipulating emotions, and so the same way that … What it does is that it demoralizes those who have relied for decades on pointing and shrieking “racist,” pointing and shrieking “anti-Semitic” etc. Whatever …</p><p><b>Louise Mensch</b>:<span style=\"white-space: pre;\"> </span>So what a minute, it demoralizes people that believe in racism and anti-Semitism, by being racists and anti-Semitic to the nth degree, and almost everybody reading this blog who might consider voting for Donald Trump, would consider it to be beneath contempt.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>No they won’t.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>They won’t?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>It’s a very straightforward … It’s actually a game technique, called agree and amplify, and so basically what they are doing … And this is why Milo was careful to distinguish between what he called the “meme police” and what he called the “1488ers.” The “1488ers” are the actual male neo-Nazis, etc. etc. The “meme police,” I suspect, – I don’t know, because I have no way of knowing – but I suspect that the most offensive stuff that you see out there, is almost certainly the “meme police” who could not possibly … Who really don’t care, they probably don’t have any position whatsoever on racism, anti-Semitism, homophobia, whatever. What they know, is that that is a emotional trigger point for the other side, and so they are pushing it and they are going to keep pushing it as long as people react to it.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Yeah, but you know what, really saying “I’ve got a bunch of trolls …” I mean, is that a strategy, Vox? I mean come on. This is not alpha, it’s totally gamma, and may I say …</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>No no no</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>… evidence, by the use of the alt-right’s word, what could be more telling about such a desperately gamma strategy, as a use of the alt-right’s word, “cuckservatives?” Why are the alt-right so obsessed with being cuckolded? Have all their girlfriends cheated on them?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>No, actually, again it’s the exact opposite. The alt-right is not sensitive to it, the people that are very sensitive to it are the people that called that because they recognize the analogy and they’re sensitive to it. The way that it works … You need to look at it in context. For decades, the left managed to manipulate the right very effectively by sowing the various labels – racist, sexist, whatever – and they managed to manipulate and control the conservative movement by using those terms. And so, the big difference between the conservative movement and the alt-right movement is that the alt-right has adopted, in general, a number of … I wouldn’t call them principles, I would call them more tactics, and they have adopted things basically so, no shame, we don’t care and we have no leaders.  That’s where you see the similarity with Gamergate, because Gamergate used similar tactics.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>No they didn’t.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>They were extremely effective.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Hold on, they didn’t. Gamergate, for example, Gamergate – I want to draw a really clear distinction, in order to defend, as I always have done, the Gamergate movement – Gamergate would not dream of sending an African American person pictures of a terrified man being hung by a bunch of whites. That’s a real person in the photograph, it’s not a meme.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Of course, no of course.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>It’s not a meme, that’s somebody’s great-great-grandfather. Now, Gamergate, to the contrary, Gamergate had a harassment patrol. They wanted to show that they were being lied about – which they were – by fauxminist trolls and as a result, if there was somebody who was being genuinely harassed, as the alt-right now do with African Americans and Jewish people, then Gamergate would get on that person, report that person. As a bloc, they had the harassment patrol and they took care of it, which really, as noted in several mainstream publications, gave the lie to the idea that they just existed to harass women. They took care of business, Gamergate. This bunch of trolls is … It’s, I don’t know … If somebody were to … There was not so many photographs around, but I think that if they showed you, or your children, or sent to you and your children and your wife, pictures of Native Americans being gang-raped, women being gang-raped, children being tortured by white settlers, you would find it pretty disgusting, and in the case of the Holocaust of course, and the anti-Semitic memes that these people throw around. Donald Trump should really disassociate himself – and in the long run I suppose it’s good in that it’ll keep him out of the White House, but the fact is, to my mind, in a way it goes right back to Gamergate because Zoe Quinn and Anita Sarkeesian sitting on the Trust and Safety Council, and Twitter has done absolutely nothing about Ricky Vaughn – I’m going to pursue this next week – about Ricky Vaughn and about the meme Bot Army, being run by the alt-right guy who calls himself Mike. I’m going to be all over this, it’s pretty obvious.</p><p>If Twitter had a real Trust and Safety concern, and it wasn’t just about being anti-men, they would do something about this, but they allow this hook-nosed cartoon of a Jew and Jews being chucked into the ovens to proliferate on Twitter. Even when people write about it, they just do nothing about it. So much for the Trust and Safety Council. Now we can see it was not really about Trust and Safety on Twitter, it was just about anti-gaming. If your strategy is we have no shame, well you know, shame is good, shame is excellent, shame is the opposite of pride. People should be ashamed. When people are weak, they should be ashamed. You are asking cucks, as you say it, to be ashamed.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>I think you’re looking at this at such a basic level. I think that first of all you need to … it’s useful to understand that the various myths that we talked about – the racist, sexist, whatever – that has been an effective rhetorical weapon of the left for decades if not generations, right? And what you’re seeing, whether you find it disgusting or not, whether you find it horrifying or not, what you are seeing is a reaction, and what you’re seeing is a rhetorical … You could call it rhetorical counter-terrorism if you wanted. Or rhetorical terrorism, if you preferred. But the point is that what it has done is it had completely de-fanged the effective use of the terms racist, sexist, anti-Semitic etc.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>How do you figure? How do you figure? On the contrary, everybody is now writing about Trump’s anti-Semitic supporters. Not only has it not de-fanged it, it’s made it into a campaign issue again. When Melania Trump said that the reporter provoked the anti-Semitism she got from these trolls, it was covered everywhere. Even CNN that normally couldn’t give a damn about this. Even CNN covered it, so no, you haven’t, you’re going in exactly the opposite direction.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>And what’s going to happen when Trump’s polls continue to go up?</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>I don’t know. I don’t think personally I don’t think Trump’s polls will continue to go up, but perhaps Trump’s Jewish daughter will come out with her Jewish child and lead the fight against the anti-Semitism of some of these trolls.</p><p>Now listen, we mustn’t put all of Trump’s supporters with these alt-right people. These alt-right people are just scumbags. And I want to be clear that, whilst I myself may not like Donald Trump, in no way whatsoever would I try to taint his support with this kind of racist – and anti-Semitism is just a subspecies of racism – but this overall racist crap. He was very very keen to welcome his Jewish grandchild, I don’t think he’s going to be in favor of Holocaust cartoons,so you’ve got to be careful about that. But it will be despite and not because of you guys, who are an absolute gift to Hillary. If you think you’re de-fanging racism and sexism, you’re not, you’re proving the point. You’re making these people right. All these people that you said were liars, you’re making them right. So you don’t care that the left was correct about your racism and sexism?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>We don’t care what they say or what they think, at all.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>You obviously do care because you’re employing tactics against this, you’ve just described.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>No, we don’t care what they do or what they think, but we are certainly engaged in a cultural rhetorical war against them, but we don’t care what they think about us. We’re their enemy, they’re our enemy, and that’s fine.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>But you’re not employing this against the enemy. I never see these memes employed against the left, ever. I only see them employed against people on the right. John Podhoretz, Ben Shapiro, Cathy Young, people who are 100{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} on the right. You don’t seem to bother with anyone of the left. Not that … By the way, God forbid that should be taken as an encouragement to go off to burn Hillary supporters with this stuff, but it’s red on red fire.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>I’m pretty sure they get sent to anyone who attacks them.<br><b><br/></b><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>You’ve put Ann Coulter in a difficult position, because she has said, not convincingly at all, that she isn’t anti-Semitic. And you’ve just described how …</br></p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>I don’t believe she is anti-Semitic.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Right …</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>She’s not anti-Semitic.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>… but then a whole bunch of anti-Semites are running to her defense by tweeting Holocaust cartoons at Jews?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>That’s what you’re not understanding is that the fact that one is not anti-Semitic does not mean that you have any obligation whatsoever to disavow anyone.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Ann Coulter though, is being defended by a bunch of anti-Semites who as their weapon use anti-Semitism. In order to try and prove she’s not anti-Semitic, that’s not very helpful, is it?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Well, but again I don’t think that that’s the objective or the concern.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Do you guys even have an objective?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Absolutely.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>What is it?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>The chief objective…. I don’t speak for the entire alt-right because the alt-right doesn’t have leaders, but I am alt-right, and my objective is the preservation of Western civilization.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>How? How do you think you’re going to preserve Western civilization by tweeting out memes of African Americans getting hung?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Because right now we are subject to the largest invasion in human history, since post-1965.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>What’s that got to do with African Americans getting hung?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>(Laughs) We’d have to trace back through all the rhetoric, but what that has to do with it is the myth of America as a proposition nation, and the myth of a melting pot, is absolutely false. America is now a multi-ethnic empire, which is headed for the fate of all multi-ethnic empires, and the only way that Western civilization is going to survive, is if it gives up the multiculturalism, globalism and anti-nationalism that has been dominant for the past … fifty, sixty years.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Well, since the founding of the United States shall we say? You were founded with help from the French. You yourself are Native American. You were multicultural as soon as the first pilgrims landed from Plymouth. You’ve never been uni-cultural except when your people held the land and there was nobody else here. After that time you guys were messed up, you know? As soon as the English came along, on the Mayflower, you were multicultural.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>No, but with the exception of admitting the existence of people who were already there, the Naturalization Act of 1790 made it very clear that the only people who could become American citizens were white people of good character. Now America was specifically a white country. That’s what it was.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>So then you’re not an American.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>What’s that?</p><p>Louise Mensch:<span style=\"white-space: pre;\"> </span>You’re not white.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>No, but, if it weren’t for the exception that was made for slaves and Native Americans, you’d be correct.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>You’re saying that it’s so … Let’s get into it. First of all, I don’t know why you would privilege one Act over a later Act that reforms it, but, you’re saying that you can be white, Native American, or black.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>I believe that was the intention. Certainly the language was very clear. You could only become American if you were white.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>But that Act has been superseded, has it not?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Oh yeah, eventually, I think it was finally completely overturned … I don’t know exactly when it was overturned but certainly by 1965.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Why is a law that has long since been overturned of any particular interest or relevance?</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Because it indicates to us what the choice of the historical foundation was, and it proves the lie of America as a proposition nation, and it proves the lie of the melting pot, which is completely absurd. The melting pot was from a poem written by somebody who was … I believe it was a Russian Jew who lived in Britain, so it had nothing to do with America whatsoever, so …</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>What of it?</p><p><b>Vox Day: </b>The fact that we have historical facts demonstrating that America was, at one point in time, founded and intended to be a predominantly white nation. With this idea of the proposition nation and this idea of the melting pot – both of which are fictional –</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>But they’re not fictional. Give me your tired, your poor, you huddled masses, they’re just literally not fictional. Americans themselves brought in African Americans, as slaves, and later fought a war to emancipate them. Native Americans, who are not “white” by your light, existed on your continent before the white settlers came. And then there were plenty of immigrants, coming from the South, coming from the North, coming from everywhere. So there have always been. After all, take Louisiana, you have the Creole, you have people who’s second language for a long long time was French. There’s been a melting pot literally forever, and indeed your country is named after a bloody Spaniard, so what’s your problem?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>The problem is that the small minorities and exceptions are very very different than turning the entire system into a giant tribal power, a tribal political spoils game. And that is the problem that the United States is facing, that is the problem that some countries in Europe are going to be facing in the next fifty years or so. I think that what has happened is arguably going to be as historically traumatic as some of the awful examples that we were talking about before. And to me that’s the lesson.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Sorry, can I just talk for a second?<br><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Of course.</br></p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>You said to Cathy that if she were an American, of course she’s as American as you are, and as American as I hope to become next year, is she … Do you regard the Jewish people as somehow not white? I am married to a Jew and honestly, if you had to pick the two of us out of a lineup, I may be a little paler than most because I’m a fair-skinned Anglo-Saxon Englishwoman of undiluted ancestry, but in general, there is no way  that you could tell the difference. The skin is white, the skin is pale. What are these imaginary racial differences that you see?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>But they’re not imaginary. First of all, there are two primary types of differences that matter. Number one is obviously the DNA differences. However, in the case of Jews that doesn’t even apply, because frankly, most Jews are not really even that different in terms of intelligence. If I recall correctly, the latest DNA evidence indicates that they’re about 80{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} Italian. Second, that’s just the Ashkenazi Jews. Obviously the Mizrahi and the Sephardi are considerably more Near Eastern in descent. I think that the entire context of the … I think that genetic science is going to completely revolutionize the way that the Jewish people are regarded, including by themselves. It’s possible that they’re considerably more white than I am.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Going by your bell curve, that you believe in, that we talked about last time, as you said, Jewish intelligence is in a high median, I’m quoting you now, above white intelligence. According to you therefore-</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>But wait a minute, let me back up though. That’s Ashkenazi Jewish intelligence. I went and did a little bit more homework and I ran the numbers and actually overall Jewish intelligence is not that spectacular. If you put the three populations together, Sephardic, Mizrahi and Ashkenazi, their average IQ is only 105.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Where’s your source data from?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>What’s that?</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>You said you ran the numbers, where did you run them from?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>I got the three main population numbers from Wikipedia, and the intelligence numbers were from … I don’t remember the source, exactly, but if you Google the information, it all comes out pretty much the same. The Ashkenazi at 115, the Sephardi at 94, and the Mizrahi at 91. So if you simply factor in …</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>I won’t give the impression that I subscribe to any of these theories, but start with this, the Ashkenazi Jews as the benchmark. By your guess 115, that’s higher than the white population …</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Absolutely.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>By your bell curve rule, they should be in positions of power and dominance over whites, according to your theories of race intelligence.<br><b><br/></b><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>No.</br></p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Because they are more intelligent than whites. And therefore, you should be trying to attract them to the country.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>But you’re forgetting something.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>What’s that?</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>There’s not very many of them. And so despite the fact that they’ve got …</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>So we should advertise in Israel for more.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>What’s that?</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>I said, we should try and get some more then, by your light. We should try and attract as many as we can.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>First of all, there’s two things. Number one: The fact that they’re such a small percentage of the US population means that there are considerably more very highly intelligent European whites than there are Ashkenazi Jews. That’s just the math. Secondly, with the new DNA evidence that is coming out, the Ashkenazi Jewish intelligence advantage is actually the result of their admixture with European populations under the selection process that some of the Jewish intelligence theorists have proposed.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>Whatever the result of it, whatever the cause of it – the putative cause of it, I don’t want to be seen to be agreeing – whatever the putative cause of it, that’s where we are, that’s where we are on the stats, so by your light, we should be trying to attract as many Ashkenazi Jews as we possibly can to come in and save a country of more stupid white people.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>No, because first of all there aren’t anymore, and secondly … Let’s get back to anti-Semitism here, because here’s where it starts to get very interesting. I would argue – keeping in mind that I’m coming at this from an abstract point of view, not a personal one – I would argue that the biggest single danger to the Jewish population in America, is actually insufficient anti-Semitism.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Oh, that’s a new one. Go on.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Because, if you look at the numbers and you look at the population, the fastest way to eliminate the Jewish population in America is intermarriage. You talk about, for example, Ivanka Trump and Trump’s Jewish granddaughter …</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Mm-hmm (affirmative).</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> Th</span>e reality is that despite the conversion and all that sort of thing, his granddaughter’s only, at most, could only be 50{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} Jewish.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>His granddaughter’s 100{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} Jewish because her mother has converted. The Jews are both, uniquely, in the United Nations, both a racial and a religious group. Her mother has converted to Judaism, therefore by the Orthodox Jewish light, the children are all Jews. They’re children born to a Jewish mother, all of them. They’re 100{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} Jewish. The Jewish people has not been diluted, but strengthened by Ivanka Trump’s conversion to Judaism.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>And that’s very true, when it comes to Jewish law, but it has nothing to do with science, it has nothing to do with genetics. For example, my Native Americanness is diluted. I’m not as Native American as my mother.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Everything is diluted. That’s the whole point I don’t get about the alt-right. Apart from outliers like me – and I am an outlier – but apart from outliers like me, almost everybody’s ancestry is mixed race, don’t you guys get that? There’s nobody pure, hardly anybody has a pure anything, anymore. Everybody has mixed-race ancestry and … I just find it so childish. Apart from the hatred, it’s just so childish.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Well I do think it’s pointless to hate people for it, but the fact of the matter is that genes are genes and if you’re looking at the …</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>The President’s mother was a white woman.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>Maybe Jews don’t care if their genetics go extinct as long as their religion and culture survive. That’s a legitimate point of view. I don’t know what their perspective is on that. I simply think that it’s very interesting that a lot of the debates and argument on hatred between Europeans and Jews almost appears to be …</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>You make a false distinction.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>… completely groundless if it does turn out in fact that Ashkenazi Jews are more Italian than anything else.</p><p><b>Louise Mensch:<span style=\"white-space: pre;\"> </span></b>You make a completely false distinction. There is no distinction between Europeans and Jews. The house of Rothschild – and I thank them for it – financed Britain’s wars against Napoleon, for example, in the eighteenth century. There were Jews in Britain as early as the 1100s. They’re mentioned in the Canterbury Tales, they’ve always been a part of European life. There is no contradiction between being European and being Jewish or being American and being Jewish. Absolutely no contradiction.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>There goes their claim to Israel then.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>No. It doesn’t.</p><p><b>Vox Day:</b><span style=\"white-space: pre;\"> </span>Well, if they’re European, then they have no more claim on Israel than the British did.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Well, we had the same claim that the Americans have over America. Right of conquest. The Palestinians or whoever drove the Israelis from their ancestral home and they were replaced in their ancestral home. I think that you must be careful by the way, I don’t really want to get into a discussion about Israel because I think it is noxious to bring in discussions about Israel and Israel’s position in the world into discussions about anti-Semitism, and it’s straight up anti-Semitism that the alt-right has failed itself completely as a force by dragging out these kinds of cartoons that make them, as Jane Austen would say, “the contempt of the world.”</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>What I would encourage you to consider is that rather than look at the alt-right as an outburst that needs to be dealt with in itself, I would encourage you to look at it as something more akin to the canary in the coal mine, because I think that we are at a very important nexus. I think that it is potentially an existential nexus for Western civilization and I think that the context, the conventional context that you are viewing this from, may be outdated and irrelevant.</p><p><b>Louise Mensch:</b><span style=\"white-space: pre;\"> </span>Well, you know, they say, “Cry some more,” and I say to them, “I’ll say cry havoc and let slip the dogs of war.” Because the only thing I’m interested in is hunting them all down like dogs.</p><p><b>Vox Day:<span style=\"white-space: pre;\"> </span></b>That’s one of the things I like about you.</p></div>",
  "content_text": "Alt-Right Anti-Semitism Debate: Vox Day vs Louise Mensch\nBy Vox Day and Louise Mensch\n11:43 am, May 28, 2016\nLouise Mensch:\nThis may surprise the people that have been following our debate thus far, but, I feel like those were all small, little, light-hearted warm up debates, because now we’re going to get into it. Because we’re going to debate anti-Semitism.\nI want to get a bit granular, because I was surprised and disappointed to see you flaming a very good friend of mine, Cathy Young – who is an equity-based feminist, for those of you that don’t know her, reading this debate – and a long time ally of Gamergate and has worked extremely hard to separate genuine feminism from the kind of “fauxminism” that bullies men for no good reason.\nI can’t remember the exact tweet so you can correct me if I’ve got this wrong, but: “…as she would know if she were a real American,” as though she were not an American, or she were less American that you are, which I think is a) racist; b) completely ridiculous; c) unbecoming of an alpha-male who ought to show some loyalty to a tried and tested ally.\nWhat I don’t like about this, apart from racism in general, and I say it with reverence, because you of all people know that I’ve been #notyourshield forever, is that it seems to give quite a lot of comfort to those fauxminist harridans, who’ve always said that Gamergate is just about abuse etc … This is a woman who stood strongly with movement forever, and the first sign of disagreement on anti-Semitism and you guys throw her under the bus. So I’ll let you come back, what do you have to say?\nVox Day:\nWell, I’m perfectly prepared for things to get hardcore, I’ve been listening to Ministry all afternoon in preparation for this. By the way, I did not know Cathy’s work on Gamergate. We are loyal; until now I did not know.\nLouise Mensch:\n(Laughs) OK, now I’m scared. Go on.\nVox Day:\nFirst of all, let me point out that, in terms of feminism, Cathy Young committed something that is, in the eyes of the alt-right a significant error of the sort that removes any right to avoid criticism. She, very very publicly, and very very vehemently, attacked Ann Coulter. The response that she got was a direct result of that, from me and from others. You can even, if you wish to, portray it as the alt-right white knighting for Ann Coulter. I don’t think that would be accurate but you certainly could do that if you wanted to.\nLouise Mensch:\nWell Ann Coulter’s been … I mean, you know, please, she attacks herself. She’s been attacked by me and others. She’s said some rabidly anti-Semitic things, about the Jews etc.\nVox Day:\nI don’t think Ann Coulter’s said anything that can reasonably be considered anti-Semitic.\nLouise Mensch:\nHow many goddamn Jews do they think there are in America, that kind of thing.\nVox Day:\nThere’s a difference between … Anti-Semitism, in its historic form, means hatred of Jews.\nLouise Mensch:\nYes.\nVox Day:\nAnd there’s a huge difference between hating Jews and wondering why the hell everyone is babbling about them, again, when the subject really has nothing to do with them.\nLouise Mensch:\nWell in this case Ann Coulter used the words “Jews.” “How many goddamn Jews does he think there are in America,” quote unquote.\nVox Day:\nWell yeah, because polls show Americans think that 33{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of Americans are gay, and certainly there … I don’t know what the exact figure is, I don’t recall a similar study being performed with regards to what percentage of Americans other Americans believe are Jews. I don’t know. But I would guess that the perceived percentage is seriously overestimated, due to the constant discussion of Jews, by American Jews, in the media, because American Jews in the media are prone to navel-gazing.\nLouise Mensch:\nVox, Vox, this was Ann Coulter who brought it up herself, who made the remark, herself. Really, as an “Ayn Randian radical,” don’t you recognize this is entirely Ann Coulter’s own fault? She brought it up, nobody else did, she ranted on about the Jews. She outed herself! Nobody else was talking to her about the Jews. On the left it’s people like Ken Livingston in London. He doesn’t seem to be able to go into any interview in London without mentioning the word ‘Hitler’ five times a second. And it was Coulter’s own fault. No one was talking to her about the Jews in Israel. She was commenting on the first Republican debate, and she brought it up, herself, entirely herself, unprompted.\nVox Day:\nCorrect me if I’m wrong, but wasn’t she discussing the fact that the candidates were discussing Israel, or Jews or something like that?\nLouise Mensch:\nThey aren’t the same, are they?\nVox Day:\nThey’re not the same but it’s certainly related. I’ll be the first to point out that they’re not the same at all.\nLouise Mensch:\nB\necause you said basically you owe no loyalty to Cathy Young despite an extraordinarily long time defending Gamergate in general, or Gamergate in particular I should say and men in general from the false persecution of the bating fauxminist movement. Now she insulted your girl Coulter – by the way, I consider Coulter as something lower than the stuff I find to scrape off my shoes – and all of a sudden, you more or less said that she deserves all the anti-Semitism that she gets.\nVox Day:\nNo, what I’m saying is that Cathy Young has made it necessary for people to choose between her and Ann Coulter, and people like Milo and I made it very clear that we choose Ann. That’s all.\nLouise Mensch:\nSo basically, I’m looking at it here now, so this is the tweet, it’s 17th of September 2015.  And Coulter says, “How many fucking Jews do these people think there are in the United States?” That’s on her. There’s really nobody who’s brought it up except her, that’s her.\nVox Day:\nBut that sounds like a response to something, to me, and I don’t know what it’s a response to.\nLouise Mensch:\nThe debate.\nVox Day:\nYeah, I didn’t watch the debate. (Laughs)\nLouise Mensch:\nWell they were talking about Israel … and she says, “How many effing Jews do people think there are in America?”\nVox Day:\nWell, right, and I think she thinks that there’s … I guess what I don’t understand is … I don’t think that using the term “fucking Jews” indicates that you hate them. I think that it sounds to me very exasperated, like why are we … For example, you read the New York Times, right?\nLouise Mensch:\nNot really. Well, my husband reads it because he’s a liberal, so occasionally it’s lying around the house and I have nothing else to read …\nVox Day:\nEvery time I forget that your background being British, you wouldn’t have grown up reading it. Anyhow, the thing is that for the average American, who doesn’t live in New York City, we simply do not understand why the media is constantly discussing Jews. It makes no sense to us. When I was growing up in Minnesota, I did not know a single Jewish person. Obviously I still read the Bible and that sort of thing, and when I went to school on the East Coast and then … Now I know, I wouldn’t say a lot, but I know a fair number, I’m quite good friends with a few. But, if I did not understand the makeup of the media, I would still personally be very confused about why the media is constantly talking about them, for good or for ill. For example, I’m Native American. How often do you see newspaper articles – other than something to do with the Redskins, these days – how often do you see articles about what we Native Americans think? You don’t.\nLouise Mensch:\nMostly because people aren’t going around Twitter, your Donald Trump’s fans, and you re-tweeted again – I was sorry to see it – you re-tweeted at a troll that goes by the name – who I really should hunt down – a troll that goes by the name of Ricky Vaughn, who came up with such epic classics as … Cathy wrote about his tweets for us … you know, Negroes, Jews, the Holocaust, you’re going to get what you deserve, threats of the Holocaust, etc. He used the term Negroes. This is a guy that you re-tweet.\nNow, I have you on a higher plane, I believe you to be an intelligent man. You are factually an intelligent man, whether I believe it or not, that’s quite clear, in the way that you conduct your arguments. One doesn’t want to sonorously shake one’s head and say “You’re better than this,” but I must say I was surprised. When you get somebody using base racial abuse like the troll behind the Ricky Vaughn account and you’re re-tweeting him, giving him air … Difficult, because it kind of makes – I really don’t want Zoe Quinn to be able to go, “Told you so,” and I see the sort of “alt-right takeover” – and of course I don’t want to suggest in any way that Gamergate is alt-right, that would be terrible …\nVox Day:\nNo.\nLouise Mensch:\nI mean it is not, it is not. To my mind, you’re giving them points, when you re-tweet a guy like that. You come back at me while I go to look up tweets from this guy. Of course there’s too many to talk about because he’s so unbelievably racist, but I will pick out a couple.\nVox Day:\nWell there’s a couple things. First of all, I overtly reject the concept of guilt-by-association, and I don’t shy away from it. I get called … I’ve been getting called racist and anti-Semitic and white supremacist and homophobic and everything, for literally fifteen years.\nLouise Mensch:\nAre you? Are you? But Vox, are you any of those things?\nVox Day:\nNo. I’m not. In fact I’m probably one of the very few people who can say that the Jewish Defense League has actually talked to me and concluded that I’m not anti-Semitic. Certainly, you know, Martin van Creveld, the illustrious Israeli military historian, would not be terribly inclined to choose me as his editor and his publisher if I had any hatred for Jews, and I don’t. That’s quite simple.\nOn the other hand, I point out that I’m not one of those conservatives that somehow feels that the Jewish people are any more virtuous or anything else that anyone else. I’m just not terribly concerned … First of all, I grew up in the American Midwest and I’ve lived in Europe for most of my adult life. It has no personal relevance to me one way or the other, with the exception of some of my personal friends and some of my authors. Obviously, I would not wish to personally offend any of them in any way that I would wish to personally offend any of my other friends. But on the other hand, I don’t really care about what some alt-right flamethrower … They’re not upset about him … why should I be?\nLouise Mensch:\nYou’re re-tweeting this guy Ricky Vaughn, frequently, so I want to read you three tweets that Cathy singled out for her piece on the anti-Semitism of Trump alt-right supporters.\nVox Day:\nMm-hmm (affirmative).\nLouise Mensch:\nHere’s the first one: “Germany had two choices: genocide by Bolshevik Jews, or Hitler. If Trump isn’t elected, we will face a similar situation.” There Vaughn says that Communist Jews will kill everyone in America, if Trump isn’t elected. He also appears to be favorably comparing Trump to Hitler in that tweet.\nHere’s another one: “Hitler said the Jews wanted to bring Negroes [sic: I apologize to our readers] Hitler said that the jews wanted to bring negroes into the Rhineland, and history has vindicated him on this point.”\nThree: “The jews fear that Donald Trump is Hitler because they know that they have done great evil in America. They fear justice will be done.”\nAgain now on those few things he is a) comparing Trump favorably to Hitler; b) saying that the Jews are going to kill everybody; and c) denigrating not only the Jewish people but African-Americans for he only uses a really disgusting racial slur.\nHow can you? It’s not really guilt-by-association, I think guilt-by-association is when for example somebody says to me, “Well Louise Mensch, you’re followed by such-and-such a person.” You and I have got tens of thousands of followers, we cannot possibly vet all our followers.\nVox Day:\nRight.\nLouise Mensch:\nAnd by the way, once in awhile I will re-tweet somebody, I have re-tweeted a far right person by mistake, you know, not having checked that person’s entire TL. But I’m going to assume that you know who Ricky Vaughn is. You re-tweet him enough times, I’m going to assume you know exactly who he is …\nVox Day:\nYes, of course.\nLouise Mensch:\n… and what he says, and when you re-tweet him it isn’t by accident, so in this case, I don’t think it’s mere association, because the acts of tweeting him often and amplifying a voice that is as racist and and sick as that, isn’t just as a mere association, it’s a serious act.\nVox Day:\nWell I think that it would be a serious act that you could criticize me for if I was re-tweeting those specific things. Let me give you an example: There’s a gentleman by the name of Popehat …\nLouise Mensch:\nYeah.\nVox Day:\nHe’s actually two people and  I don’t think it would be too …\nLouise Mensch:\nI’m a big fan.\nVox Day:\n… too much of an exaggeration to say that he absolutely loathes me. And I have been exceedingly cruel to him by repeatedly pointing out that the guy’s a nutcase.\nLouise Mensch:\nWell, you just said he’s two people, why aren’t you using the plural?\nVox Day:\nPopehat is actually two individuals.\nLouise Mensch:\nYeah, so why didn’t you say “them”? It’s confusing, you say “he hates me,” do you mean “they hate me”?\nVox Day:\nWhat’s that?\nLouise Mensch:\nYou’re saying “he hates me” but do you not mean “they hate me”?\nVox Day:\nActually I’m pretty sure they both do.\nLouise Mensch:\nRight.\nVox Day:\nBut the Ken White part, particularly dislikes me. But that’s OK, that’s fine, that’s his prerogative. I re-tweet him on occasion, simply because, despite the fact that he hates me, he occasionally says something that’s funny and perspicacious. And so, Ricky Vaughn, I don’t agree with him on everything, but I certainly agree with him on some things. He’s a Trump supporter, he’s been an important Trump supporter, and so … I’ve no qualms whatsoever about … I’m not responsible for … I’m responsible for what I say and for what I do. You might say or do something reprehensible at some point, and that wouldn’t stop me from re-tweeting you either.\nLouise Mensch:\nSo you’re saying that your re-tweeting of a guy who is racist is OK as long as you don’t re-tweet specifically racist things that he says?\nVox Day:\nI wouldn’t say OK, I would say that it is not racist to re-tweet non-racist things from a racist. I’ll go further. I’ll give you some more information. I think that people have an absolute right to be racist. Or to be anti-Semitic, or to be anti-German, or to be anti-Native American for that matter. Not that anyone is anymore, but that’s part of what the freedom of thought … I think that’s Martin Luther but … the development’s inside, thoughts are free. We can’t simply tell people to not hate people, or not dislike people. Maybe their reasons are good, maybe their reasons are stupid. But clearly they feel what they feel, they think what the think. For example, there are some Jews that I know that are, overtly, anti-German. Now, I understand that. I don’t blame them at all for refusing to buy Mercedes because of what happened seventy years ago, that’s fine. But I don’t think that’s logical. I don’t think that that really makes a whole lot of sense, but that’s how they feel and I respect that. In the same way…\nLouise Mensch:\nThere’s no reason to respect feelings that are stupid. And I think there’s a difference between … Would you not agree that the idea of free speech – we both support free speech, I’m perhaps not as absolutist as you – but free speech has always has the “get-outs” of the “fire in a crowded theater” clause. You know, free speech doesn’t mean I can tell everybody your bank account, your social security number, or give them nuclear launch codes, or shout “Fire!” in a crowded theater, so there’s always some pragmatic limits to the idea of free speech.\nNow in this case if you’re right, and Ricky Vaughn is one person, he has not just said “I hate the Jews,” which is social discourse within the range of protected free public expression. But he has said things that are going to incite people to hurt the Jews, and he’s threatened them, saying “You’re going to kill everybody, you’re going to get the punishment that’s coming to you.” Cathy Young has had tweeted to her something the alt-right have as a macro,  a themed anti-Semitic cartoon from Nazi Germany of a hook-nosed Jew, rubbing his hands in some sort of a Shylockian pose. She’s been tweeted pictures of a smiling Donald Trump pushing the button on the gas chambers as he ushered Jews into it, and so have a bunch of other Jews. In fact I’m going to do a bit of work on this, because I don’t know that there’s all that many of them, I’m pretty sure I recognize … I’m quite quite good at Twitter, I recognize a bot when I see one.\nVox Day:\nWhat?\nLouise Mensch:\nOne of these guys runs a bot, it’s really quite obvious, and I’ve seen the bots at work, so I’d love to know how many of them there actually are. But the similarity of the anti-Semitism and the images, these are grossly upsetting, in some cases, like the journalist who interviewed Melania Trump. Melania Trump said the anti-Semitism against that Jewish woman was provoked, they took it off social media –  calls to her house, other threats, etc. Now I have to assume that if somebody called your wife and threatened to kill her, you wouldn’t be OK with that, and you’d be on the phone to the police.\nVox Day:\nI’m pretty sure I wouldn’t, because we’ve gotten tons of death threats over the years. I mean, to be honest, I don’t really … It’s not like I enjoy the various death threats and death wishes and all that sort of thing, but I don’t them very seriously either. I’ve literally never … I’ve gotten hundreds and possibly thousands of death threats, if you count death wishes as well, and I’ve never called the police about it.\nLouise Mensch:\nWell these are death threats and these are death threats against their women.\nVox Day:\nBut it’s not … First of all there’s two things: Number one, what I call Holocaustianity, is a secular religion in the United States, is preached by the media. And, we’ve all been … Every kid who’s grown up in the US has been subjected to it. And, what you’re seeing, with a lot of the various anti-Semitic themes and memes and all that sort of thing, is basically a rebellion against that.\nLouise Mensch:\nWhy, why would you rebel against being taught about one of history’s most appalling massacres, which happened in the modern age and for which rarely therefore, as opposed to in historic massacres, we have photographic evidence?\nVox Day:\nBecause it happened seventy years ago and nobody under forty gives a damn. I mean that was part of what Milo …\nLouise Mensch:\nYou’ve got to be kidding me. You think nobody under forty gives a damn? you are way out of touch man, yes they do. You think nobody under forty gives a damn …ask somebody whose grandparents are survivors.\nVox Day:\nI know they don’t. I know they don’t. I went around as asked a bunch of teenagers, and on a scale of one to ten, they rated the Holocaust a one.\nLouise Mensch:\nThat’s a symptom … Well you must have some terrible teachers in your area, some really terrible teachers.\nVox Day:\nThe thing that people are forgetting, is that that was seventy years ago.\nLouise Mensch:\nSo what?\nVox Day:\nAnd nobody cares seventy years after the Taiping Rebellion, that an estimated thirty to fifty million people died, nobody cared about the Taiping Rebellion. We are now as far from the Holocaust – and I don’t deny it, I believe it happened, I think it’s absurd to pretend that it didn’t happen – but, for example … Let me give you an example from my own history: Obviously the American Indians were mistreated in a variety of ways, right? But, nobody cares about them anymore because it happened … Even we American Indians don’t really get that upset about it anymore because it happened so long ago. Now, obviously the Holocaust is more recent than the Trail of Tears, but that same process that has rendered the Trail of Tears an indifferent, ancient history to young people today, that process is now happening … There’s going to come a time, whether it’s tomorrow or in a hundred years, there’s going to come a time when nobody gives a damn.\nLouise Mensch:\nYeah but that’s not now Vox, because people’s grandparents, it happened to people’s grandparents that are still living today. If you think that people don’t care, young people don’t care, I would say that anecdote is not evidence, and it just is that the young people that you spoke to have zero compassion or zero education. My children care, they all care very much. They’ve been educated about the Holocaust and none of them are Jewish …\nVox Day:\nBut you live in an area that is heavily Jewish, I’d expect them to care, of course they care.\nLouise Mensch:\nBy the way, they cared in Britain too, where the area in which I lived was not Jewish at all.\nVox Day:\nHow much do you care about what happened in Cambodia for example? Or, The Great Leap Forward killed considerably more people than the Holocaust did, it happened more recently, and yet I don’t see people being very upset about that either.\nLouise Mensch:\nAs I said to you before, the Holocaust, amongst the great massacres of history, is distinguished partly by the tortures, the specifically sadistic tortures, not just the straight up killing, which accompanied it. Generally exquisite tortures, medical experiments – I won’t go into them because I don’t want to – the utter lack of compassion, and barbarity, but mostly, because, as I said, photographic, and towards the end of it, even some film evidence exists so that it is made emotionally real. As someone said, a hundred thousand dead is a statistic, three dead is a tragedy  – because you can relate to three, whereas you can’t to, as an example, millions starved to death in Stalin’s Russia. But I have an awful lot more videographic evidence and photographic evidence of the suffering of the Jewish people, in front of me, and therefore our natural humanity is excited by that. Is there not something odious, really odious about going “This bad thing happens, so your bad thing doesn’t count?” I mean, what is the point?\nVox Day:\nNo, I think it’s totally normal, and I think that the Holocaust has been an outlier, in that people, in the United States particularly, did care about it for a much longer period of time than is normal.\nLouise Mensch:\nAnd they still do.\nVox Day:\nBut I think there’s two things that you need to keep in mind here: Number one, the passage of time, so, the more time that passes, the less people care about what happened, in general. Secondly: The demographic changes to the United States means that there are considerably more Americans that don’t give a damn, one way or the other, about World War Two, about Germany, about the Holocaust, about any of it. It has nothing to do with … Hispanics. It has nothing to do with Asians. It has nothing to do with Africans.\nLouise Mensch:\nSure it does.\nVox Day:\nAnd they just don’t care.\nLouise Mensch:\nYes it does, you know why? Yes it has to do with all three of those groups, and you know why? Because they’re all Americans. And for a man who, in our last debate, when we were talking about history, was giving reference to culture throughout history and seemed to have a great reverence for history, I think you underestimate the American people insofar as you think that they cannot derive a large part of the their identity – as well they should – from the heroism of the greatest generation of Americans, who along with the British, saved the world in World Wars One and Two, and particularly in World War Two from the intense evil of the Nazis. If you think that I cannot take pride, for example because I was born in 1971, take great pride in knowing the fact that both my grandfather’s served and my maternal grandfather was a gunner on a naval ship. It gives me immense pride. For that matter, I take an awful lot of pride in the victories of Henry the Fifth at Agincourt. The history of a nation is what makes up its warp and weft, its fabric. You don’t have to have been there to care. What an amazing failure of imagination, from a man that appears to reverence history.\nVox Day:\nIt’s not a history of imagination, it’s the fact that I know perfectly well that most of the generations probably couldn’t tell you who we went to war with in World War Two, that’s why I say that they don’t give a damn, because they don’t even know.\nLouise Mensch:\nThat’s an argument for better education. I think they know about the Germans, it’s an argument for better education.\nVox Day:\nBut it doesn’t. First of all, that’s a whole other can of worms, there are significant problems with the American education system and I’m sure we both agree with that, but …\nLouise Mensch:\nMm-hmm (affirmative).\nVox Day:\nW\nhat I’m saying is that whether you can explain why it is or not, it doesn’t change the fact that the more time passes and the more that the American population demographic changes, the less interest those various populations are going to have in the Holocaust narrative and the American obsession with World War Two and everything surrounding it and all that sort of thing.\nLouise Mensch:\nI don’t agree with you because as population become American, they will take pride in the history of America and the history of America is the history of liberation.\nVox Day:\nI’ve written a bestseller,\nCuckservative\n, which addresses those very points and indicates that’s not the case, it’s just not the case anymore.\nLouise Mensch\n:\nLet’s get onto whether or not the youth of America can relate or take pride in any part of American history. You’d better hope so, because the Constitution and the Founding Fathers, to whom you referred in your last debate, were around considerably earlier than any part of World War Two, including the horrors of the Holocaust.\nNow let me get back at you with one more thing before we … You know, you can come at me if you like and then we can wrap it up. As always, I enjoy these debates with you and when I look down at my phone we’ve been on the phone for half an hour even though it seems like five minutes.\nObviously, what you’re arguing there is that you’re making an argument for indifference. You’re saying that the younger generation, because they are far removed in time, and also because they don’t come from traditional white American backgrounds, you’re saying two things about them: Both that they don’t care because it was so long ago and b) they don’t care because they are more into their own ethnic groups than they are into being Americans, so they have no pride in the shared history of the nation. It’s an argument for indifference. I don’t believe it, as I’ve just said. However, the anti-Semitism that is getting tweeted at Cathy Young, and John Podhoretz and often at myself – because of my surname, they assume that I have the honor to be Jewish, although I do not – is not indifference to the Holocaust, it is using the specific tortures against the Jewish people and specific anti-Semitic slurs used by Hitler, re-employing them to make points for Donald Trump, who of course welcomed his Jewish grandchild into the world just recently, his daughter of course is converted to Judaism. It’s clearly they’re not indifferent about the Holocaust, and in a way, although as shameful as that would be, that would be better than what we are faced with. They are cheerleading for the Holocaust, like Ricky Vaughn. Ricky Vaughn is cheerleading for the Holocaust.  They’re sending African-Americans photographs of black men being lynched and hung from trees. This is not something that the alt-right should be proud of, Vox, it’s something the alt-right should be ashamed of, and they do care about the Holocaust very much, because they use the horrors of it and its hatred as weapons against Jews.\nVox Day:\nFirst, I agree with you that those two things are totally separate. They are totally separate. But what I think that you’re failing to recognize is that the alt-right rejects shame. And the alt-right will never be ashamed of anything and the alt-right will never back down from anything, because we have learned from the example of the left, which is, you always, you never disavow your extremists, because they’re the ones who will clear the way.\nLouise Mensch:\nClear the way how? What does that mean? How is somebody tweeting a picture of African-Americans being hung, as slaves, to a black person, or how is somebody tweeting to a Jew a picture of children being shoved into a gas oven, how is that clearing the way for anything? How do they help you? How are they your fore-soldiers?\nVox Day:\nBecause it’s rhetoric. Rhetoric is designed to manipulate emotions, it persuades by manipulating emotions, and so the same way that … What it does is that it demoralizes those who have relied for decades on pointing and shrieking “racist,” pointing and shrieking “anti-Semitic” etc. Whatever …\nLouise Mensch\n:\nSo what a minute, it demoralizes people that believe in racism and anti-Semitism, by being racists and anti-Semitic to the nth degree, and almost everybody reading this blog who might consider voting for Donald Trump, would consider it to be beneath contempt.\nVox Day:\nNo they won’t.\nLouise Mensch:\nThey won’t?\nVox Day:\nIt’s a very straightforward … It’s actually a game technique, called agree and amplify, and so basically what they are doing … And this is why Milo was careful to distinguish between what he called the “meme police” and what he called the “1488ers.” The “1488ers” are the actual male neo-Nazis, etc. etc. The “meme police,” I suspect, – I don’t know, because I have no way of knowing – but I suspect that the most offensive stuff that you see out there, is almost certainly the “meme police” who could not possibly … Who really don’t care, they probably don’t have any position whatsoever on racism, anti-Semitism, homophobia, whatever. What they know, is that that is a emotional trigger point for the other side, and so they are pushing it and they are going to keep pushing it as long as people react to it.\nLouise Mensch:\nYeah, but you know what, really saying “I’ve got a bunch of trolls …” I mean, is that a strategy, Vox? I mean come on. This is not alpha, it’s totally gamma, and may I say …\nVox Day:\nNo no no\nLouise Mensch:\n… evidence, by the use of the alt-right’s word, what could be more telling about such a desperately gamma strategy, as a use of the alt-right’s word, “cuckservatives?” Why are the alt-right so obsessed with being cuckolded? Have all their girlfriends cheated on them?\nVox Day:\nNo, actually, again it’s the exact opposite. The alt-right is not sensitive to it, the people that are very sensitive to it are the people that called that because they recognize the analogy and they’re sensitive to it. The way that it works … You need to look at it in context. For decades, the left managed to manipulate the right very effectively by sowing the various labels – racist, sexist, whatever – and they managed to manipulate and control the conservative movement by using those terms. And so, the big difference between the conservative movement and the alt-right movement is that the alt-right has adopted, in general, a number of … I wouldn’t call them principles, I would call them more tactics, and they have adopted things basically so, no shame, we don’t care and we have no leaders.  That’s where you see the similarity with Gamergate, because Gamergate used similar tactics.\nLouise Mensch:\nNo they didn’t.\nVox Day:\nThey were extremely effective.\nLouise Mensch:\nHold on, they didn’t. Gamergate, for example, Gamergate – I want to draw a really clear distinction, in order to defend, as I always have done, the Gamergate movement – Gamergate would not dream of sending an African American person pictures of a terrified man being hung by a bunch of whites. That’s a real person in the photograph, it’s not a meme.\nVox Day:\nOf course, no of course.\nLouise Mensch:\nIt’s not a meme, that’s somebody’s great-great-grandfather. Now, Gamergate, to the contrary, Gamergate had a harassment patrol. They wanted to show that they were being lied about – which they were – by fauxminist trolls and as a result, if there was somebody who was being genuinely harassed, as the alt-right now do with African Americans and Jewish people, then Gamergate would get on that person, report that person. As a bloc, they had the harassment patrol and they took care of it, which really, as noted in several mainstream publications, gave the lie to the idea that they just existed to harass women. They took care of business, Gamergate. This bunch of trolls is … It’s, I don’t know … If somebody were to … There was not so many photographs around, but I think that if they showed you, or your children, or sent to you and your children and your wife, pictures of Native Americans being gang-raped, women being gang-raped, children being tortured by white settlers, you would find it pretty disgusting, and in the case of the Holocaust of course, and the anti-Semitic memes that these people throw around. Donald Trump should really disassociate himself – and in the long run I suppose it’s good in that it’ll keep him out of the White House, but the fact is, to my mind, in a way it goes right back to Gamergate because Zoe Quinn and Anita Sarkeesian sitting on the Trust and Safety Council, and Twitter has done absolutely nothing about Ricky Vaughn – I’m going to pursue this next week – about Ricky Vaughn and about the meme Bot Army, being run by the alt-right guy who calls himself Mike. I’m going to be all over this, it’s pretty obvious.\nIf Twitter had a real Trust and Safety concern, and it wasn’t just about being anti-men, they would do something about this, but they allow this hook-nosed cartoon of a Jew and Jews being chucked into the ovens to proliferate on Twitter. Even when people write about it, they just do nothing about it. So much for the Trust and Safety Council. Now we can see it was not really about Trust and Safety on Twitter, it was just about anti-gaming. If your strategy is we have no shame, well you know, shame is good, shame is excellent, shame is the opposite of pride. People should be ashamed. When people are weak, they should be ashamed. You are asking cucks, as you say it, to be ashamed.\nVox Day:\nI think you’re looking at this at such a basic level. I think that first of all you need to … it’s useful to understand that the various myths that we talked about – the racist, sexist, whatever – that has been an effective rhetorical weapon of the left for decades if not generations, right? And what you’re seeing, whether you find it disgusting or not, whether you find it horrifying or not, what you are seeing is a reaction, and what you’re seeing is a rhetorical … You could call it rhetorical counter-terrorism if you wanted. Or rhetorical terrorism, if you preferred. But the point is that what it has done is it had completely de-fanged the effective use of the terms racist, sexist, anti-Semitic etc.\nLouise Mensch:\nHow do you figure? How do you figure? On the contrary, everybody is now writing about Trump’s anti-Semitic supporters. Not only has it not de-fanged it, it’s made it into a campaign issue again. When Melania Trump said that the reporter provoked the anti-Semitism she got from these trolls, it was covered everywhere. Even CNN that normally couldn’t give a damn about this. Even CNN covered it, so no, you haven’t, you’re going in exactly the opposite direction.\nVox Day:\nAnd what’s going to happen when Trump’s polls continue to go up?\nLouise Mensch:\nI don’t know. I don’t think personally I don’t think Trump’s polls will continue to go up, but perhaps Trump’s Jewish daughter will come out with her Jewish child and lead the fight against the anti-Semitism of some of these trolls.\nNow listen, we mustn’t put all of Trump’s supporters with these alt-right people. These alt-right people are just scumbags. And I want to be clear that, whilst I myself may not like Donald Trump, in no way whatsoever would I try to taint his support with this kind of racist – and anti-Semitism is just a subspecies of racism – but this overall racist crap. He was very very keen to welcome his Jewish grandchild, I don’t think he’s going to be in favor of Holocaust cartoons,so you’ve got to be careful about that. But it will be despite and not because of you guys, who are an absolute gift to Hillary. If you think you’re de-fanging racism and sexism, you’re not, you’re proving the point. You’re making these people right. All these people that you said were liars, you’re making them right. So you don’t care that the left was correct about your racism and sexism?\nVox Day:\nWe don’t care what they say or what they think, at all.\nLouise Mensch:\nYou obviously do care because you’re employing tactics against this, you’ve just described.\nVox Day:\nNo, we don’t care what they do or what they think, but we are certainly engaged in a cultural rhetorical war against them, but we don’t care what they think about us. We’re their enemy, they’re our enemy, and that’s fine.\nLouise Mensch:\nBut you’re not employing this against the enemy. I never see these memes employed against the left, ever. I only see them employed against people on the right. John Podhoretz, Ben Shapiro, Cathy Young, people who are 100{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} on the right. You don’t seem to bother with anyone of the left. Not that … By the way, God forbid that should be taken as an encouragement to go off to burn Hillary supporters with this stuff, but it’s red on red fire.\nVox Day:\nI’m pretty sure they get sent to anyone who attacks them.\nLouise Mensch:\nYou’ve put Ann Coulter in a difficult position, because she has said, not convincingly at all, that she isn’t anti-Semitic. And you’ve just described how …\nVox Day:\nI don’t believe she is anti-Semitic.\nLouise Mensch:\nRight …\nVox Day:\nShe’s not anti-Semitic.\nLouise Mensch:\n… but then a whole bunch of anti-Semites are running to her defense by tweeting Holocaust cartoons at Jews?\nVox Day:\nThat’s what you’re not understanding is that the fact that one is not anti-Semitic does not mean that you have any obligation whatsoever to disavow anyone.\nLouise Mensch:\nAnn Coulter though, is being defended by a bunch of anti-Semites who as their weapon use anti-Semitism. In order to try and prove she’s not anti-Semitic, that’s not very helpful, is it?\nVox Day:\nWell, but again I don’t think that that’s the objective or the concern.\nLouise Mensch:\nDo you guys even have an objective?\nVox Day:\nAbsolutely.\nLouise Mensch:\nWhat is it?\nVox Day:\nThe chief objective…. I don’t speak for the entire alt-right because the alt-right doesn’t have leaders, but I am alt-right, and my objective is the preservation of Western civilization.\nLouise Mensch:\nHow? How do you think you’re going to preserve Western civilization by tweeting out memes of African Americans getting hung?\nVox Day:\nBecause right now we are subject to the largest invasion in human history, since post-1965.\nLouise Mensch:\nWhat’s that got to do with African Americans getting hung?\nVox Day:\n(Laughs) We’d have to trace back through all the rhetoric, but what that has to do with it is the myth of America as a proposition nation, and the myth of a melting pot, is absolutely false. America is now a multi-ethnic empire, which is headed for the fate of all multi-ethnic empires, and the only way that Western civilization is going to survive, is if it gives up the multiculturalism, globalism and anti-nationalism that has been dominant for the past … fifty, sixty years.\nLouise Mensch:\nWell, since the founding of the United States shall we say? You were founded with help from the French. You yourself are Native American. You were multicultural as soon as the first pilgrims landed from Plymouth. You’ve never been uni-cultural except when your people held the land and there was nobody else here. After that time you guys were messed up, you know? As soon as the English came along, on the Mayflower, you were multicultural.\nVox Day:\nNo, but with the exception of admitting the existence of people who were already there, the Naturalization Act of 1790 made it very clear that the only people who could become American citizens were white people of good character. Now America was specifically a white country. That’s what it was.\nLouise Mensch:\nSo then you’re not an American.\nVox Day:\nWhat’s that?\nLouise Mensch:\nYou’re not white.\nVox Day:\nNo, but, if it weren’t for the exception that was made for slaves and Native Americans, you’d be correct.\nLouise Mensch:\nYou’re saying that it’s so … Let’s get into it. First of all, I don’t know why you would privilege one Act over a later Act that reforms it, but, you’re saying that you can be white, Native American, or black.\nVox Day:\nI believe that was the intention. Certainly the language was very clear. You could only become American if you were white.\nLouise Mensch:\nBut that Act has been superseded, has it not?\nVox Day:\nOh yeah, eventually, I think it was finally completely overturned … I don’t know exactly when it was overturned but certainly by 1965.\nLouise Mensch:\nWhy is a law that has long since been overturned of any particular interest or relevance?\nVox Day:\nBecause it indicates to us what the choice of the historical foundation was, and it proves the lie of America as a proposition nation, and it proves the lie of the melting pot, which is completely absurd. The melting pot was from a poem written by somebody who was … I believe it was a Russian Jew who lived in Britain, so it had nothing to do with America whatsoever, so …\nLouise Mensch:\nWhat of it?\nVox Day:\nThe fact that we have historical facts demonstrating that America was, at one point in time, founded and intended to be a predominantly white nation. With this idea of the proposition nation and this idea of the melting pot – both of which are fictional –\nLouise Mensch:\nBut they’re not fictional. Give me your tired, your poor, you huddled masses, they’re just literally not fictional. Americans themselves brought in African Americans, as slaves, and later fought a war to emancipate them. Native Americans, who are not “white” by your light, existed on your continent before the white settlers came. And then there were plenty of immigrants, coming from the South, coming from the North, coming from everywhere. So there have always been. After all, take Louisiana, you have the Creole, you have people who’s second language for a long long time was French. There’s been a melting pot literally forever, and indeed your country is named after a bloody Spaniard, so what’s your problem?\nVox Day:\nThe problem is that the small minorities and exceptions are very very different than turning the entire system into a giant tribal power, a tribal political spoils game. And that is the problem that the United States is facing, that is the problem that some countries in Europe are going to be facing in the next fifty years or so. I think that what has happened is arguably going to be as historically traumatic as some of the awful examples that we were talking about before. And to me that’s the lesson.\nLouise Mensch:\nSorry, can I just talk for a second?\nVox Day:\nOf course.\nLouise Mensch:\nYou said to Cathy that if she were an American, of course she’s as American as you are, and as American as I hope to become next year, is she … Do you regard the Jewish people as somehow not white? I am married to a Jew and honestly, if you had to pick the two of us out of a lineup, I may be a little paler than most because I’m a fair-skinned Anglo-Saxon Englishwoman of undiluted ancestry, but in general, there is no way  that you could tell the difference. The skin is white, the skin is pale. What are these imaginary racial differences that you see?\nVox Day:\nBut they’re not imaginary. First of all, there are two primary types of differences that matter. Number one is obviously the DNA differences. However, in the case of Jews that doesn’t even apply, because frankly, most Jews are not really even that different in terms of intelligence. If I recall correctly, the latest DNA evidence indicates that they’re about 80{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} Italian. Second, that’s just the Ashkenazi Jews. Obviously the Mizrahi and the Sephardi are considerably more Near Eastern in descent. I think that the entire context of the … I think that genetic science is going to completely revolutionize the way that the Jewish people are regarded, including by themselves. It’s possible that they’re considerably more white than I am.\nLouise Mensch:\nGoing by your bell curve, that you believe in, that we talked about last time, as you said, Jewish intelligence is in a high median, I’m quoting you now, above white intelligence. According to you therefore-\nVox Day:\nBut wait a minute, let me back up though. That’s Ashkenazi Jewish intelligence. I went and did a little bit more homework and I ran the numbers and actually overall Jewish intelligence is not that spectacular. If you put the three populations together, Sephardic, Mizrahi and Ashkenazi, their average IQ is only 105.\nLouise Mensch:\nWhere’s your source data from?\nVox Day:\nWhat’s that?\nLouise Mensch:\nYou said you ran the numbers, where did you run them from?\nVox Day:\nI got the three main population numbers from Wikipedia, and the intelligence numbers were from … I don’t remember the source, exactly, but if you Google the information, it all comes out pretty much the same. The Ashkenazi at 115, the Sephardi at 94, and the Mizrahi at 91. So if you simply factor in …\nLouise Mensch:\nI won’t give the impression that I subscribe to any of these theories, but start with this, the Ashkenazi Jews as the benchmark. By your guess 115, that’s higher than the white population …\nVox Day:\nAbsolutely.\nLouise Mensch:\nBy your bell curve rule, they should be in positions of power and dominance over whites, according to your theories of race intelligence.\nVox Day:\nNo.\nLouise Mensch:\nBecause they are more intelligent than whites. And therefore, you should be trying to attract them to the country.\nVox Day:\nBut you’re forgetting something.\nLouise Mensch:\nWhat’s that?\nVox Day:\nThere’s not very many of them. And so despite the fact that they’ve got …\nLouise Mensch:\nSo we should advertise in Israel for more.\nVox Day:\nWhat’s that?\nLouise Mensch:\nI said, we should try and get some more then, by your light. We should try and attract as many as we can.\nVox Day:\nFirst of all, there’s two things. Number one: The fact that they’re such a small percentage of the US population means that there are considerably more very highly intelligent European whites than there are Ashkenazi Jews. That’s just the math. Secondly, with the new DNA evidence that is coming out, the Ashkenazi Jewish intelligence advantage is actually the result of their admixture with European populations under the selection process that some of the Jewish intelligence theorists have proposed.\nLouise Mensch:\nWhatever the result of it, whatever the cause of it – the putative cause of it, I don’t want to be seen to be agreeing – whatever the putative cause of it, that’s where we are, that’s where we are on the stats, so by your light, we should be trying to attract as many Ashkenazi Jews as we possibly can to come in and save a country of more stupid white people.\nVox Day:\nNo, because first of all there aren’t anymore, and secondly … Let’s get back to anti-Semitism here, because here’s where it starts to get very interesting. I would argue – keeping in mind that I’m coming at this from an abstract point of view, not a personal one – I would argue that the biggest single danger to the Jewish population in America, is actually insufficient anti-Semitism.\nLouise Mensch:\nOh, that’s a new one. Go on.\nVox Day:\nBecause, if you look at the numbers and you look at the population, the fastest way to eliminate the Jewish population in America is intermarriage. You talk about, for example, Ivanka Trump and Trump’s Jewish granddaughter …\nLouise Mensch:\nMm-hmm (affirmative).\nVox Day:\nTh\ne reality is that despite the conversion and all that sort of thing, his granddaughter’s only, at most, could only be 50{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} Jewish.\nLouise Mensch:\nHis granddaughter’s 100{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} Jewish because her mother has converted. The Jews are both, uniquely, in the United Nations, both a racial and a religious group. Her mother has converted to Judaism, therefore by the Orthodox Jewish light, the children are all Jews. They’re children born to a Jewish mother, all of them. They’re 100{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} Jewish. The Jewish people has not been diluted, but strengthened by Ivanka Trump’s conversion to Judaism.\nVox Day:\nAnd that’s very true, when it comes to Jewish law, but it has nothing to do with science, it has nothing to do with genetics. For example, my Native Americanness is diluted. I’m not as Native American as my mother.\nLouise Mensch:\nEverything is diluted. That’s the whole point I don’t get about the alt-right. Apart from outliers like me – and I am an outlier – but apart from outliers like me, almost everybody’s ancestry is mixed race, don’t you guys get that? There’s nobody pure, hardly anybody has a pure anything, anymore. Everybody has mixed-race ancestry and … I just find it so childish. Apart from the hatred, it’s just so childish.\nVox Day:\nWell I do think it’s pointless to hate people for it, but the fact of the matter is that genes are genes and if you’re looking at the …\nLouise Mensch:\nThe President’s mother was a white woman.\nVox Day:\nMaybe Jews don’t care if their genetics go extinct as long as their religion and culture survive. That’s a legitimate point of view. I don’t know what their perspective is on that. I simply think that it’s very interesting that a lot of the debates and argument on hatred between Europeans and Jews almost appears to be …\nLouise Mensch:\nYou make a false distinction.\nVox Day:\n… completely groundless if it does turn out in fact that Ashkenazi Jews are more Italian than anything else.\nLouise Mensch:\nYou make a completely false distinction. There is no distinction between Europeans and Jews. The house of Rothschild – and I thank them for it – financed Britain’s wars against Napoleon, for example, in the eighteenth century. There were Jews in Britain as early as the 1100s. They’re mentioned in the Canterbury Tales, they’ve always been a part of European life. There is no contradiction between being European and being Jewish or being American and being Jewish. Absolutely no contradiction.\nVox Day:\nThere goes their claim to Israel then.\nLouise Mensch:\nNo. It doesn’t.\nVox Day:\nWell, if they’re European, then they have no more claim on Israel than the British did.\nLouise Mensch:\nWell, we had the same claim that the Americans have over America. Right of conquest. The Palestinians or whoever drove the Israelis from their ancestral home and they were replaced in their ancestral home. I think that you must be careful by the way, I don’t really want to get into a discussion about Israel because I think it is noxious to bring in discussions about Israel and Israel’s position in the world into discussions about anti-Semitism, and it’s straight up anti-Semitism that the alt-right has failed itself completely as a force by dragging out these kinds of cartoons that make them, as Jane Austen would say, “the contempt of the world.”\nVox Day:\nWhat I would encourage you to consider is that rather than look at the alt-right as an outburst that needs to be dealt with in itself, I would encourage you to look at it as something more akin to the canary in the coal mine, because I think that we are at a very important nexus. I think that it is potentially an existential nexus for Western civilization and I think that the context, the conventional context that you are viewing this from, may be outdated and irrelevant.\nLouise Mensch:\nWell, you know, they say, “Cry some more,” and I say to them, “I’ll say cry havoc and let slip the dogs of war.” Because the only thing I’m interested in is hunting them all down like dogs.\nVox Day:\nThat’s one of the things I like about you.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-13T16:10:49+00:00"
}