{
  "url": "https://voxday.net/2018/04/17/merit-based-immigration-is-no-solution/",
  "scraped_at": "2025-12-19T20:57:57.343586",
  "title": "Merit-based immigration is no solution",
  "date_display": "April 17, 2018",
  "date_iso": "2018-04-17T16:48:23+00:00",
  "date_from_url": "2018-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s merely a different and <a href=\"http://www.unz.com/article/colonization-by-indian-leftists-the-downside-of-merit-based-immigration/\">more intractable problem</a>:</p><blockquote><p>“Merit-based immigration” is seen as the gold standard of immigration reform by many Republicans and conservative policy wonks. But it could lead to their political ruin.</p><p>We already have a clear window into what a merit-based policy could bring to the political landscape: look at the Indian colonization of Seattle’s Eastside—the area across Lake Washington from Seattle which stretches from Sammamish in the south to Bothell in the north. It has been transformed, in roughly 25 years, from a region that leaned Republican into a cesspool of socialism.</p><p>It all started with the rise of Bill Gates’ Microsoft in Redmond, followed by likeminded corporate titans who gorged themselves on the delights of Indian staffing agencies that exploit the H1-B visa program. Once a foreign worker’s H1B status expires in six years, them it’s time for an employment-based green card. These green cards have for years been handed out like popcorn with curry on top to almost any Indian techie who agrees to work for, on average, one-third lower pay than American tech workers.</p><p><i>Microsoft was an American-led company for many years until its upper leadership became Indian, beginning with the head of personnel some 20 or so years ago. Although the data released by the company is hard to interpret, employees note that the firm is a plurality Indian company in employees, as well as in leadership.</i></p></blockquote><p>I always find the desperate attempts of conservatives to avoid the obvious consequences of the truth about immigration to be more than a little funny. First, “all immigration is beneficial.” Second, “it’s not the immigration, it’s the illegality”. Third, “it’s about the <i>quality </i>of the immigration.” Now that high-caste Indians are doing in the Pacific Northwest what high-caste Indians have done in India for thousands of years, conservatives will be forced to face the fact that their fourth line of intellectual retreat is just as false as the previous three.</p><p>How did “high-quality immigration” work out for the American Indian? Low-quality means your people are replaced on the low end. High-quality means your people are replaced on the high end. Either way, your people are going to be replaced, conquered, and disenfranchised.</p><p>There is one and only one metric that matters with regards to immigration: quantity. And even a relatively small quantity is considerably more destructive to a society than most social scientists realize yet.<br><i><br/></i><i>“Indians can only think in terms of might is right, street-smartness and political connections. Such a society cannot have any understanding of the principles of the Ten Commandments, or have respect for the individual and liberty.”</i><br>– Jayant Bhandari</br></br></p><p>Sounds familiar, does it not? I believe it is informative to note that those who claim I am incorrect about the inability of the vast majority of post-18th century immigrants to adapt to or adopt historical Anglo-American norms are usually untraveled monolingual whites who have literally no experience living in any culture or society outside the United States.</p></div>",
  "content_text": "It’s merely a different and\nmore intractable problem\n:\n“Merit-based immigration” is seen as the gold standard of immigration reform by many Republicans and conservative policy wonks. But it could lead to their political ruin.\nWe already have a clear window into what a merit-based policy could bring to the political landscape: look at the Indian colonization of Seattle’s Eastside—the area across Lake Washington from Seattle which stretches from Sammamish in the south to Bothell in the north. It has been transformed, in roughly 25 years, from a region that leaned Republican into a cesspool of socialism.\nIt all started with the rise of Bill Gates’ Microsoft in Redmond, followed by likeminded corporate titans who gorged themselves on the delights of Indian staffing agencies that exploit the H1-B visa program. Once a foreign worker’s H1B status expires in six years, them it’s time for an employment-based green card. These green cards have for years been handed out like popcorn with curry on top to almost any Indian techie who agrees to work for, on average, one-third lower pay than American tech workers.\nMicrosoft was an American-led company for many years until its upper leadership became Indian, beginning with the head of personnel some 20 or so years ago. Although the data released by the company is hard to interpret, employees note that the firm is a plurality Indian company in employees, as well as in leadership.\nI always find the desperate attempts of conservatives to avoid the obvious consequences of the truth about immigration to be more than a little funny. First, “all immigration is beneficial.” Second, “it’s not the immigration, it’s the illegality”. Third, “it’s about the\nquality\nof the immigration.” Now that high-caste Indians are doing in the Pacific Northwest what high-caste Indians have done in India for thousands of years, conservatives will be forced to face the fact that their fourth line of intellectual retreat is just as false as the previous three.\nHow did “high-quality immigration” work out for the American Indian? Low-quality means your people are replaced on the low end. High-quality means your people are replaced on the high end. Either way, your people are going to be replaced, conquered, and disenfranchised.\nThere is one and only one metric that matters with regards to immigration: quantity. And even a relatively small quantity is considerably more destructive to a society than most social scientists realize yet.\n“Indians can only think in terms of might is right, street-smartness and political connections. Such a society cannot have any understanding of the principles of the Ten Commandments, or have respect for the individual and liberty.”\n– Jayant Bhandari\nSounds familiar, does it not? I believe it is informative to note that those who claim I am incorrect about the inability of the vast majority of post-18th century immigrants to adapt to or adopt historical Anglo-American norms are usually untraveled monolingual whites who have literally no experience living in any culture or society outside the United States.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-17T15:48:23+00:00"
}