{
  "url": "https://voxday.net/2018/04/28/of-criticism-and-envy/",
  "scraped_at": "2025-12-19T20:59:26.356593",
  "title": "Of criticism and envy",
  "date_display": "April 28, 2018",
  "date_iso": "2018-04-28T09:59:45+00:00",
  "date_from_url": "2018-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here is something you should probably consider before resorting to the same stupid equation of criticism with envy that I have literally witnessed a certain type of individual making here on this blog for 15 years. It tells everyone that envy is a particular weakness of your own. In fact, when you criticize someone, or when you accuse someone of something, you are betraying information about yourself that others can read very clearly.</p><p>For some reason, this always seems to escape the gammas and the alphas of the world.</p><p>The strange thing, from my perspective, is that if you follow the logic of some of my critics, I should never criticize anyone for anything. If I criticize someone who is less well-known, then I am engaged in bullying and directed social media mobbing. If I criticize someone who is better-known, then I am merely exhibiting envy and am inspired solely by jealousy.</p><p>Now, what sort of individual habitually tries to set up this “heads I win, tails you lose” scenario? The delusional secret kings, of course. The telling thing, of course, is that there is never any attempt to even consider if the criticism is correct, let alone justified, it’s always “do not pass go, do not collect $200, go direct to discredit and disqualify”. It is pure gamma rhetoric.</p><p>There is literally not a single individual I have criticized, from PZ Myers to John Scalzi to George RR Martin to Ben Shapiro to Sam Harris to Richard Dawkins to Richard Spencer, of whom I have not been immediately accused of being jealous or envious.</p><p>As one observer recently noted:</p><blockquote class=\"tr_bq\"><p>Interesting to see the litany of tactics they used to try to discredit you or trick you into making a mistake. They go to them because against the average person they work very well. They’re trying to bait you into something they can latch onto then discredit you.</p></blockquote><p>But here is the thing. I’ve had different people attempting to use the same tactics for 15 years. They didn’t work then. They won’t work now. What these inept little anklebiters engaged on their never-ending crusade of futility do not grasp is that intellectual integrity is its own reward. To paraphrase Liam Neeson in <i>Rob Roy</i>, it is a man’s gift to himself.</p><p>I am not saying that I am innocent of envy. But you do not understand me if you think I envy any e-celebrity, media figure, popular author, or talking head. You do not understand me at all.</p></div>",
  "content_text": "Here is something you should probably consider before resorting to the same stupid equation of criticism with envy that I have literally witnessed a certain type of individual making here on this blog for 15 years. It tells everyone that envy is a particular weakness of your own. In fact, when you criticize someone, or when you accuse someone of something, you are betraying information about yourself that others can read very clearly.\nFor some reason, this always seems to escape the gammas and the alphas of the world.\nThe strange thing, from my perspective, is that if you follow the logic of some of my critics, I should never criticize anyone for anything. If I criticize someone who is less well-known, then I am engaged in bullying and directed social media mobbing. If I criticize someone who is better-known, then I am merely exhibiting envy and am inspired solely by jealousy.\nNow, what sort of individual habitually tries to set up this “heads I win, tails you lose” scenario? The delusional secret kings, of course. The telling thing, of course, is that there is never any attempt to even consider if the criticism is correct, let alone justified, it’s always “do not pass go, do not collect $200, go direct to discredit and disqualify”. It is pure gamma rhetoric.\nThere is literally not a single individual I have criticized, from PZ Myers to John Scalzi to George RR Martin to Ben Shapiro to Sam Harris to Richard Dawkins to Richard Spencer, of whom I have not been immediately accused of being jealous or envious.\nAs one observer recently noted:\nInteresting to see the litany of tactics they used to try to discredit you or trick you into making a mistake. They go to them because against the average person they work very well. They’re trying to bait you into something they can latch onto then discredit you.\nBut here is the thing. I’ve had different people attempting to use the same tactics for 15 years. They didn’t work then. They won’t work now. What these inept little anklebiters engaged on their never-ending crusade of futility do not grasp is that intellectual integrity is its own reward. To paraphrase Liam Neeson in\nRob Roy\n, it is a man’s gift to himself.\nI am not saying that I am innocent of envy. But you do not understand me if you think I envy any e-celebrity, media figure, popular author, or talking head. You do not understand me at all.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-28T08:59:45+00:00"
}