{
  "url": "https://voxday.net/2018/04/16/physiognomy-is-more-than-real/",
  "scraped_at": "2025-12-19T20:57:44.517267",
  "title": "Physiognomy is more than real",
  "date_display": "April 16, 2018",
  "date_iso": "2018-04-16T09:36:35+00:00",
  "date_from_url": "2018-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.unz.com/article/can-we-judge-people-by-what-they-look-like-in-fact-yes/\">It is science</a>. And Martin Luther King’s dream remains just that, a dream that is not based on reality:</p><blockquote><p>Unless it involves mocking President Trump’s supposedly “small hands,” there is nothing that horrifies our multiculturalist masters more than judging by appearances.</p><p>It is impossible, they claim, to infer anything about how someone is likely to behave by their gender or because they are from a particular ethnic group. Everyone is unique (but also, somehow, equal). Judging by appearances is not just superficial but plain evil.</p><p>It will be fascinating to see what they’ll make of the recently-published book by British academic Dr. Edward Dutton titled <i>How To Judge People By What They Look Like</i>, which argues that even within races and sexes you can, with a fair degree of accuracy, infer people’s personalities from appearances. You may even get an inside track on how smart they are by taking a good look at their physical characteristics, according to Dutton.</p><p>“You can’t judge people by what they look like! It’s drummed into us as children,” writes Dutton, an adjunct professor of anthropology at Oulu University in northern Finland. “It is utterly false.”</p><p>But Dutton makes a provocative case for resurrecting the ancient art of physiognomy—judging character from the face. He argues it should never have been dismissed as pseudo-science. Indeed, his research goes way beyond making inferences from the face. He writes:</p><p><i>We are evolved to judge people’s psychology from what they look like; we can accurately work out people’s personality and intelligence from how they look, and (quite often) we have to if we want to survive. Body shape, hairiness, eye width, finger length, even how big a woman’s breasts are . . . these and much else are windows into personality, intelligence or both.</i></p></blockquote><p>So many people fail to understand that when I say the Alt-Right is inevitable, I am not merely engaging in rhetoric. I mean that quite literally and I am speaking in unvarnished dialectic. Just as communism is unviable because it denies economics and feminism is unviable because it denies biology, conservatism is unviable because it denies inequality. All of these unviable political identities have set themselves against science, history, and observable reality.</p><p>Remember, the red pill is reality.</p><blockquote class=\"tr_bq\"><p>As Dutton says in his book, the relevant research has been published in top psychology journals, such as <i>Intelligence</i>, <i>Personality and Individual Differences</i> and <i>Evolutionary Psychological Science</i>, as has his own research. This includes a study asserting that atheists tend to be less physically attractive and more likely to be left-handed than religious people and that they have objectively worse skin. Dutton, ever the evolutionist, opines that this is because we have been selected to be religious over thousands of years of evolution. Hence, those who are atheists reflect mutant genes in the brain and people with mental mutations are more likely to have physical ones. This explains their asymmetrical features and asymmetrical brains, leading to left-handedness.</p></blockquote><p>You may recall that I was among the first to observe that atheists are neurologically atypical and that atheism is essentially a particular characteristic of being on the autism spectrum. It’s not a coincidence that you can often pick out an atheist by his appearance.</p><p>However, the link between psychology, personality, and intelligence on the one hand and appearance on the other involves considerably more than our genes, it also involves our choices and behavior. When we see a man who is slender and clear-eyed at 60, we can safely conclude that he is both intelligent and self-disciplined, just as we can reliably reach the opposite conclusion of a child who is obese at the age of 12.</p></div>",
  "content_text": "It is science\n. And Martin Luther King’s dream remains just that, a dream that is not based on reality:\nUnless it involves mocking President Trump’s supposedly “small hands,” there is nothing that horrifies our multiculturalist masters more than judging by appearances.\nIt is impossible, they claim, to infer anything about how someone is likely to behave by their gender or because they are from a particular ethnic group. Everyone is unique (but also, somehow, equal). Judging by appearances is not just superficial but plain evil.\nIt will be fascinating to see what they’ll make of the recently-published book by British academic Dr. Edward Dutton titled\nHow To Judge People By What They Look Like\n, which argues that even within races and sexes you can, with a fair degree of accuracy, infer people’s personalities from appearances. You may even get an inside track on how smart they are by taking a good look at their physical characteristics, according to Dutton.\n“You can’t judge people by what they look like! It’s drummed into us as children,” writes Dutton, an adjunct professor of anthropology at Oulu University in northern Finland. “It is utterly false.”\nBut Dutton makes a provocative case for resurrecting the ancient art of physiognomy—judging character from the face. He argues it should never have been dismissed as pseudo-science. Indeed, his research goes way beyond making inferences from the face. He writes:\nWe are evolved to judge people’s psychology from what they look like; we can accurately work out people’s personality and intelligence from how they look, and (quite often) we have to if we want to survive. Body shape, hairiness, eye width, finger length, even how big a woman’s breasts are . . . these and much else are windows into personality, intelligence or both.\nSo many people fail to understand that when I say the Alt-Right is inevitable, I am not merely engaging in rhetoric. I mean that quite literally and I am speaking in unvarnished dialectic. Just as communism is unviable because it denies economics and feminism is unviable because it denies biology, conservatism is unviable because it denies inequality. All of these unviable political identities have set themselves against science, history, and observable reality.\nRemember, the red pill is reality.\nAs Dutton says in his book, the relevant research has been published in top psychology journals, such as\nIntelligence\n,\nPersonality and Individual Differences\nand\nEvolutionary Psychological Science\n, as has his own research. This includes a study asserting that atheists tend to be less physically attractive and more likely to be left-handed than religious people and that they have objectively worse skin. Dutton, ever the evolutionist, opines that this is because we have been selected to be religious over thousands of years of evolution. Hence, those who are atheists reflect mutant genes in the brain and people with mental mutations are more likely to have physical ones. This explains their asymmetrical features and asymmetrical brains, leading to left-handedness.\nYou may recall that I was among the first to observe that atheists are neurologically atypical and that atheism is essentially a particular characteristic of being on the autism spectrum. It’s not a coincidence that you can often pick out an atheist by his appearance.\nHowever, the link between psychology, personality, and intelligence on the one hand and appearance on the other involves considerably more than our genes, it also involves our choices and behavior. When we see a man who is slender and clear-eyed at 60, we can safely conclude that he is both intelligent and self-disciplined, just as we can reliably reach the opposite conclusion of a child who is obese at the age of 12.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-16T08:36:35+00:00"
}