{
  "url": "https://voxday.net/2018/04/29/put-not-your-faith-in-men/",
  "scraped_at": "2025-12-19T20:59:35.730680",
  "title": "Put not your faith in men",
  "date_display": "April 29, 2018",
  "date_iso": "2018-04-29T11:42:57+00:00",
  "date_from_url": "2018-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have been let down by all of my heroes and role models. Not some of them. Not most of them. All of them. Except one.</p><p>I was taught to save by my father. When I bought my first house, he very generously wanted to help me and even offered to contribute something to the down payment. I declined when I found out that I had more money in the bank than he did. He joked that his companies were his savings account; we all know how that turned out.</p><p>I was taught character, courage, and taking responsibility by my grandfather. Towards the end of his life, having exhausted his resources on caring for my grandmother, he walked away from the beautiful, twice-mortgaged house he had owned for three decades and left it for the bank.</p><p>I was taught leadership and personal sacrifice by my uncle. After attaining fame and great power, he was awarded an important position at one of the most corrupt organizations in the world. He did not resign from it when its crimes were revealed to the public.</p><p>I revered Umberto Eco for his great learning and his intellectual insight. When I read <i>Belief or Nonbelief</i>, his debate on religion and God with Carlo Maria Martini, the Roman Catholic cardinal of Milan, I was astonished and bitterly disappointed by the shallow, superficial, and petty nature of his arguments.</p><p>I admired and looked up to one of my father’s friends of more than thirty years. I considered him to be the epitome of a good, smart, successful, civilized man. I could not believe it when my father asked him to be a character witness at his trial, and he demurred for fear of how it might look and what people might say.</p><p>I always considered <i>The Meditations</i> of Marcus Aurelius to be the philosophical gold standard and Aurelius himself to be an exemplary man. Then I read more human history and realized that his son and successor was Commodus, and that he had uncharacteristically failed to prepare an adequate succession plan for the empire over which he ruled.</p><p>I cannot tell you how many authors I perceived to be great, only to learn that they were charlatans, conceptual plagiarists, plodders, experts in literary sleight-of-hand, learned historians rather than brilliantly original creators, and in some cases, the apparent beneficiaries of a sprinkling of pixie dust by a flighty passing muse.</p><p>Do I look down on any of these men because they lacked the perfection that I naively perceived in them? Do I reject their teachings? By no means! To the contrary, their failings only served to teach me that they were mortal men, not demigods, and that I, too, can hope to surmount my own failings and character flaws. They remain my heroes and my role models today, I merely see them in a more mature and realistic light that shows their strengths in contrast with their weaknesses.</p><p>The fact that your heroes are not perfect does not make them any less heroic. It actually makes them <i>more </i>heroic, because their failings are a glimpse into the struggle they faced, every day, with the manifold temptations of a fallen world.</p><p>Who was the one hero who never let me down? JRR Tolkien. I loved his books deeply and passionately from the time I read the first page of <i>The Two Towers</i>, and everything I have since read of his, and everything I have subsequently learned about the man has only given me more cause to admire him. One reason that it takes me so much longer to write <i>Arts of Dark and Light</i> than other fiction and non-fiction is that I am always striving to write something I consider worthy of Tolkien’s influence, and of which he would approve if he were ever to read it.</p></div>",
  "content_text": "I have been let down by all of my heroes and role models. Not some of them. Not most of them. All of them. Except one.\nI was taught to save by my father. When I bought my first house, he very generously wanted to help me and even offered to contribute something to the down payment. I declined when I found out that I had more money in the bank than he did. He joked that his companies were his savings account; we all know how that turned out.\nI was taught character, courage, and taking responsibility by my grandfather. Towards the end of his life, having exhausted his resources on caring for my grandmother, he walked away from the beautiful, twice-mortgaged house he had owned for three decades and left it for the bank.\nI was taught leadership and personal sacrifice by my uncle. After attaining fame and great power, he was awarded an important position at one of the most corrupt organizations in the world. He did not resign from it when its crimes were revealed to the public.\nI revered Umberto Eco for his great learning and his intellectual insight. When I read\nBelief or Nonbelief\n, his debate on religion and God with Carlo Maria Martini, the Roman Catholic cardinal of Milan, I was astonished and bitterly disappointed by the shallow, superficial, and petty nature of his arguments.\nI admired and looked up to one of my father’s friends of more than thirty years. I considered him to be the epitome of a good, smart, successful, civilized man. I could not believe it when my father asked him to be a character witness at his trial, and he demurred for fear of how it might look and what people might say.\nI always considered\nThe Meditations\nof Marcus Aurelius to be the philosophical gold standard and Aurelius himself to be an exemplary man. Then I read more human history and realized that his son and successor was Commodus, and that he had uncharacteristically failed to prepare an adequate succession plan for the empire over which he ruled.\nI cannot tell you how many authors I perceived to be great, only to learn that they were charlatans, conceptual plagiarists, plodders, experts in literary sleight-of-hand, learned historians rather than brilliantly original creators, and in some cases, the apparent beneficiaries of a sprinkling of pixie dust by a flighty passing muse.\nDo I look down on any of these men because they lacked the perfection that I naively perceived in them? Do I reject their teachings? By no means! To the contrary, their failings only served to teach me that they were mortal men, not demigods, and that I, too, can hope to surmount my own failings and character flaws. They remain my heroes and my role models today, I merely see them in a more mature and realistic light that shows their strengths in contrast with their weaknesses.\nThe fact that your heroes are not perfect does not make them any less heroic. It actually makes them\nmore\nheroic, because their failings are a glimpse into the struggle they faced, every day, with the manifold temptations of a fallen world.\nWho was the one hero who never let me down? JRR Tolkien. I loved his books deeply and passionately from the time I read the first page of\nThe Two Towers\n, and everything I have since read of his, and everything I have subsequently learned about the man has only given me more cause to admire him. One reason that it takes me so much longer to write\nArts of Dark and Light\nthan other fiction and non-fiction is that I am always striving to write something I consider worthy of Tolkien’s influence, and of which he would approve if he were ever to read it.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-29T10:42:57+00:00"
}