{
  "url": "https://voxday.net/2018/04/20/re-opening-the-closed-door/",
  "scraped_at": "2025-12-19T20:58:25.478367",
  "title": "Re-opening the closed door",
  "date_display": "April 20, 2018",
  "date_iso": "2018-04-20T15:31:17+00:00",
  "date_from_url": "2018-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>How immigrants and their allies <a href=\"http://npg.org/library/forum-series/a-vast-social-experiment-the-immigration-act-of-1965.html\">conspired to end the national origins system</a> that made America great in the 20th century.</p><blockquote><p>The demographic consequences of ending the open door cannot be known with certainty, since no one can be sure what immigration would have been in the absence of restriction. Demographer Leon Bouvier has estimated that, assuming no restriction and pre-war levels of one million a year for the rest of the century, the American population would have reached 400 million by the year 2000. This would have meant 120 million more American high-consumption lifestyles piled upon the roughly 280 million reported in the census of 2000, making far worse the dismal figures on species extinction, wetland loss, soil erosion, and the accumulation of climate-changing and health-impairing pollutants that are being tallied up as the new century unfolds.</p><p>The chief goals of the national origins system, shrinking the incoming numbers and tilting the sources of the immigration stream back toward northern Europe, were less decisively achieved. Numbers entering legally but outside the quotas (“non-quota immigrants,” mostly relatives of those recently arrived and Europeans entering through Latin American and Caribbean countries) surprised policymakers by matching and in time exceeding those governed by quotas. Yet with overall numbers so low, ethnic composition did not agitate the public.</p><p>International economic maladies, war, and the new American system of restriction had thus combined to reduce immigration numbers to levels more in line with the long course of American history, and to some observers seemed to have ended the role of immigration as a major force in American life. Apparently the nation would henceforth grow and develop, as Thomas Jefferson had preferred, from natural increase and the cultural assets of its people.</p><p>The curbing of the Great Wave created a forty-year breathing space of relatively low immigration, with effects favorable to assimilation. The pressures toward joining the American mainstream did not have to contend with continual massive replenishment of foreigners.</p><p>The new immigration system was widely popular, and the immigration committees of Congress quickly became backwaters of minor tinkering or inactivity. The 1930s arrived with vast and chronic unemployment, and the American people wanted nothing from immigration. War in Europe would bring unprecedented refugee issues, but dealing with these — or avoiding them — did not require any rethinking of the basic system for deciding on the few thousand people who would be given immigration papers.</p><p>But American immigration policy in the postwar years attracted a small but growing body of opponents. The political core of a coalition pressing for a new, more “liberalized” policy regime was composed of ethnic lobbyists (“professional immigrant-handlers,” Rep. Francis Walter called them) claiming to speak for nationalities migrating prior to the National Origins Act of 1924, the most effective being Jews from central and eastern Europe who were deeply concerned with the rise of fascism and anti-semitism on the continent and eternally interested in haven. Unable by themselves to interest many politicians or the media in the settled issue of America’s immigration law, these groups hoped for new circumstances in which restrictions could be discredited and the old regime of open doors restored. The arrival of the Civil Rights Movement thrust (racial) “discrimination” into the center of national self-examination. The enemy everywhere at the bottom of virtually every national blemish seemed to be Discrimination, the historic, now intolerable subordinating classification of groups on the basis of inherited characteristics. The nation’s national origins-grounded immigration laws could not escape an assault by these reformist passions, and critics of the national origins system found the liberal wing of the Democratic Party receptive to their demand that immigration reform should be a part of the civil rights agenda.</p><p>Who would lead, and formulate what alternatives? Massachusetts Senator John F. Kennedy cautiously stepped out on the issue in the 1950s, sensing that a liberalization stance would gather vital ethnic voting blocs for his long-planned run for the presidency. His work on a refugee bill caught the attention of officials of the Anti-Defamation League of B’nai B’rith, who convinced Kennedy to become an author of a pamphlet on immigration, with the help of an ADL supplied historian, Arthur Mann, and Kennedy’s staff. The result was <i>A Nation of Immigrants</i>, a 1958 bouquet of praise for the contributions of immigrants and a call for an end to the racist, morally embarrassing national origins system. The little book was initially ignored, but its arguments would dominate the emerging debate. The ADL, part of a Jewish coalition whose agenda included opening wider the American gates so that increasing U.S. ethnic heterogeneity would reduce the chances of a populist mass movement embracing anti-semitism, had made a golden alliance. John F. Kennedy was no crusader on immigration (or anything else), but he was an activist young President by 1961, comfortable with immigration reform as part of his agenda, elected on a party platform that pledged elimination of the national origins system.</p></blockquote><p>What comes next? The USA is again on course to reach 400 million imperial subjects sometime between 2043 and 2051, depending upon which UN report you credit. Its population is unlikely to ever reach that size, of course, but it should be apparent that the forty-year breathing space created by the national origins system is the primary reason the empire has not collapsed already.</p><p>Barring a mass repatriation program for all post-1965 immigrants and their descendants, which appears extremely unlikely at the moment, the political breakup should begin by the early 2030s. Every empire is destroyed by immigration of one sort or another in the end, but it is the cultural decadence and lack of confidence that permits such immigration to take place that is the true cause of the collapse.</p><p>Had American politicians possessed the wisdom to arrest and deport the seditious ethnic lobbyists who agitated for ending the national origins system, the collapse of the empire would not be rapidly approaching. Now the necessary surgery is even more difficult and considerably less politically palatable. So, we can safely conclude that it will not be performed.</p></div>",
  "content_text": "How immigrants and their allies\nconspired to end the national origins system\nthat made America great in the 20th century.\nThe demographic consequences of ending the open door cannot be known with certainty, since no one can be sure what immigration would have been in the absence of restriction. Demographer Leon Bouvier has estimated that, assuming no restriction and pre-war levels of one million a year for the rest of the century, the American population would have reached 400 million by the year 2000. This would have meant 120 million more American high-consumption lifestyles piled upon the roughly 280 million reported in the census of 2000, making far worse the dismal figures on species extinction, wetland loss, soil erosion, and the accumulation of climate-changing and health-impairing pollutants that are being tallied up as the new century unfolds.\nThe chief goals of the national origins system, shrinking the incoming numbers and tilting the sources of the immigration stream back toward northern Europe, were less decisively achieved. Numbers entering legally but outside the quotas (“non-quota immigrants,” mostly relatives of those recently arrived and Europeans entering through Latin American and Caribbean countries) surprised policymakers by matching and in time exceeding those governed by quotas. Yet with overall numbers so low, ethnic composition did not agitate the public.\nInternational economic maladies, war, and the new American system of restriction had thus combined to reduce immigration numbers to levels more in line with the long course of American history, and to some observers seemed to have ended the role of immigration as a major force in American life. Apparently the nation would henceforth grow and develop, as Thomas Jefferson had preferred, from natural increase and the cultural assets of its people.\nThe curbing of the Great Wave created a forty-year breathing space of relatively low immigration, with effects favorable to assimilation. The pressures toward joining the American mainstream did not have to contend with continual massive replenishment of foreigners.\nThe new immigration system was widely popular, and the immigration committees of Congress quickly became backwaters of minor tinkering or inactivity. The 1930s arrived with vast and chronic unemployment, and the American people wanted nothing from immigration. War in Europe would bring unprecedented refugee issues, but dealing with these — or avoiding them — did not require any rethinking of the basic system for deciding on the few thousand people who would be given immigration papers.\nBut American immigration policy in the postwar years attracted a small but growing body of opponents. The political core of a coalition pressing for a new, more “liberalized” policy regime was composed of ethnic lobbyists (“professional immigrant-handlers,” Rep. Francis Walter called them) claiming to speak for nationalities migrating prior to the National Origins Act of 1924, the most effective being Jews from central and eastern Europe who were deeply concerned with the rise of fascism and anti-semitism on the continent and eternally interested in haven. Unable by themselves to interest many politicians or the media in the settled issue of America’s immigration law, these groups hoped for new circumstances in which restrictions could be discredited and the old regime of open doors restored. The arrival of the Civil Rights Movement thrust (racial) “discrimination” into the center of national self-examination. The enemy everywhere at the bottom of virtually every national blemish seemed to be Discrimination, the historic, now intolerable subordinating classification of groups on the basis of inherited characteristics. The nation’s national origins-grounded immigration laws could not escape an assault by these reformist passions, and critics of the national origins system found the liberal wing of the Democratic Party receptive to their demand that immigration reform should be a part of the civil rights agenda.\nWho would lead, and formulate what alternatives? Massachusetts Senator John F. Kennedy cautiously stepped out on the issue in the 1950s, sensing that a liberalization stance would gather vital ethnic voting blocs for his long-planned run for the presidency. His work on a refugee bill caught the attention of officials of the Anti-Defamation League of B’nai B’rith, who convinced Kennedy to become an author of a pamphlet on immigration, with the help of an ADL supplied historian, Arthur Mann, and Kennedy’s staff. The result was\nA Nation of Immigrants\n, a 1958 bouquet of praise for the contributions of immigrants and a call for an end to the racist, morally embarrassing national origins system. The little book was initially ignored, but its arguments would dominate the emerging debate. The ADL, part of a Jewish coalition whose agenda included opening wider the American gates so that increasing U.S. ethnic heterogeneity would reduce the chances of a populist mass movement embracing anti-semitism, had made a golden alliance. John F. Kennedy was no crusader on immigration (or anything else), but he was an activist young President by 1961, comfortable with immigration reform as part of his agenda, elected on a party platform that pledged elimination of the national origins system.\nWhat comes next? The USA is again on course to reach 400 million imperial subjects sometime between 2043 and 2051, depending upon which UN report you credit. Its population is unlikely to ever reach that size, of course, but it should be apparent that the forty-year breathing space created by the national origins system is the primary reason the empire has not collapsed already.\nBarring a mass repatriation program for all post-1965 immigrants and their descendants, which appears extremely unlikely at the moment, the political breakup should begin by the early 2030s. Every empire is destroyed by immigration of one sort or another in the end, but it is the cultural decadence and lack of confidence that permits such immigration to take place that is the true cause of the collapse.\nHad American politicians possessed the wisdom to arrest and deport the seditious ethnic lobbyists who agitated for ending the national origins system, the collapse of the empire would not be rapidly approaching. Now the necessary surgery is even more difficult and considerably less politically palatable. So, we can safely conclude that it will not be performed.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-20T14:31:17+00:00"
}