{
  "url": "https://voxday.net/2018/04/13/the-upside-of-holocaustianity/",
  "scraped_at": "2025-12-19T20:57:12.507454",
  "title": "The upside of Holocaustianity",
  "date_display": "April 13, 2018",
  "date_iso": "2018-04-13T13:03:20+00:00",
  "date_from_url": "2018-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We can use it to jail all the Millennials. Or at least <a href=\"http://www.powerlineblog.com/archives/2018/04/millenials-havent-heard-of-the-holocaust-true-or-false.php\">one-fifth of them</a>.</p><blockquote><p>22{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of millennials say they have never heard of the Holocaust, or aren’t sure whether they have heard of it. That is rather shocking, but the ignorance isn’t confined to millennials: 11{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of all respondents gave the same answer.</p><p>49{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of millennials couldn’t identify any concentration camps or ghettos. That seems appalling, but 45{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of all respondents couldn’t name any, either. Two-thirds of millennials can’t say what Auschwitz was. I think at least part of what is happening here is that American high schools are so obsessed with social justice, race, etc., that they don’t teach much about actual facts. Like history.</p><p>Most survey respondents say that there is anti-Semitism in the U.S., which of course is true. But many Americans vastly over-rate, in my judgment, the number of neo-Nazis. 34{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of respondents say there are “many neo-Nazis in the U.S.,” while 17{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} say there are “a great deal of Neo-Nazis in the US.” These are people, I suspect, who have been systematically misled by the education system and the news media. Some of our high schools seem to devote much of their efforts to combatting neo-Nazis, notwithstanding that in all likelihood, no one associated with the school has ever seen one.</p><p>As usual when such questions are asked in polls, the lack of support for free speech rights is discouraging. Only 15{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of respondents agree that “People should be allowed to use Nazi slogans or symbols.”</p></blockquote><p>Don’t be discouraged by the lack of support for free speech, utilize it! Anyhow, I find this poll to be tremendously amusing in light of my past debates on a related subject with Louise Mensch, <a href=\"https://archive.fo/21N0i\">which, but for archive, have been memory-holed</a>, and the increasingly irrelevant Jonah Goldberg.</p><blockquote><p>Jonah Goldberg ‏@JonahNRO<br>1. Apologize for racist &amp; Jew-hating, “kids” as they celebrate murder etc. 2. ????? 3. Total GOP victory. @Nero’s grand 2016 strategy.</br></p><p>Supreme Dark Lord ‏@voxday<br>Jonah, no one under the age of 40 gives a damn about Holocaustianity anymore than they do about the Sicilian Vespers.</br></p><p>Jonah Goldberg ‏@JonahNRO<br>Vox, 1. That’s horseshit 2. Even if it wasn’t, that’s not an argument for saying disgusting and bigoted things for laughs.</br></p><p>Supreme Dark Lord ‏@voxday<br>How much do you care about the Left calling you racist? That’s how much #AltRight cares about being called anti-semitic.</br></p><p>Supreme Dark Lord ‏@voxday<br>What do those called anti-semites for supporting Trump have to fear? They’ll be called anti-semites a second time? So what?</br></p><p>Hank Coates ‏@hankhank30<br>complete and utter horseshit. I went to school with holocaust survivor grandkids. Fuck that fascist.</br></p><p>Supreme Dark Lord ‏@voxday<br>Nobody cares. The Hispanics don’t care. The blacks don’t care. The Asians don’t care. Most whites don’t anymore.</br></p><p>Milo Yiannopoulos ✘ ‏@Nero<br>The left robbed racist, sexist and homophobic of meaning. The right did the same to anti-semitic. No one under 40 cares about any of them.</br></p><p>Nunuya Bizinizz ‏@wahrbear<br>I’m confirming @voxday’s assertion here. Early Millennail Jew and I really find holocaust whiners embarrassing.</br></p><p>AltRightJew ‏@AltRightJew<br>agreed. Unless you lived through it and endured it, not really interested in hearing you whine about it.</br></p><p>Jonah Goldberg ‏@JonahNRO<br>All day this crap. Thanks @nero and @voxday your friends get your back</br></p></blockquote><p>It’s rather remarkable how cuckservatives always cling to the idea that reality is what they wish it to be rather than what objective observation reports that it actually is. The cucks are insisting that everyone under 40 worships Judeo-Christ and believes the Holocaust to be the worstest and most evilist crime in human history ever while Jewish organizations are wringing their hands over the inevitable fact that younger generations increasingly don’t even know what the Holocaustian preachers are banging on about in the first place, much less care about it.</p><p>If I were a Jew, I wouldn’t worry about the events of 73 years ago. Instead, I’d worry about the fact that, based on the historical pattern, the West is considerably closer to the next pogrom than the previous one. Given the way in which Prime Minister Netanyahu has repeatedly called on the diasporans to return to Israel and <a href=\"http://www.haaretz.com/questions-of-survival-1.191164\">the Learned Elders of Wye</a> have been discussing when to jump ship for over a decade, I am confident that I am far from the only one who recognizes the pattern.</p><p>I note, in passing, that the GOP did indeed win big in 2016, thanks to Trump and others ignoring the advice of Jonah Goldberg. I was wrong about one thing, however. We care considerably less about being called anti-semitic than Jonah cares about being called racist.</p></div>",
  "content_text": "We can use it to jail all the Millennials. Or at least\none-fifth of them\n.\n22{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of millennials say they have never heard of the Holocaust, or aren’t sure whether they have heard of it. That is rather shocking, but the ignorance isn’t confined to millennials: 11{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of all respondents gave the same answer.\n49{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of millennials couldn’t identify any concentration camps or ghettos. That seems appalling, but 45{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of all respondents couldn’t name any, either. Two-thirds of millennials can’t say what Auschwitz was. I think at least part of what is happening here is that American high schools are so obsessed with social justice, race, etc., that they don’t teach much about actual facts. Like history.\nMost survey respondents say that there is anti-Semitism in the U.S., which of course is true. But many Americans vastly over-rate, in my judgment, the number of neo-Nazis. 34{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of respondents say there are “many neo-Nazis in the U.S.,” while 17{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} say there are “a great deal of Neo-Nazis in the US.” These are people, I suspect, who have been systematically misled by the education system and the news media. Some of our high schools seem to devote much of their efforts to combatting neo-Nazis, notwithstanding that in all likelihood, no one associated with the school has ever seen one.\nAs usual when such questions are asked in polls, the lack of support for free speech rights is discouraging. Only 15{5d01cb5ba07024ac0de3b9d1fbf6cc8231453f95977a82b19bad56561434ea06} of respondents agree that “People should be allowed to use Nazi slogans or symbols.”\nDon’t be discouraged by the lack of support for free speech, utilize it! Anyhow, I find this poll to be tremendously amusing in light of my past debates on a related subject with Louise Mensch,\nwhich, but for archive, have been memory-holed\n, and the increasingly irrelevant Jonah Goldberg.\nJonah Goldberg ‏@JonahNRO\n1. Apologize for racist & Jew-hating, “kids” as they celebrate murder etc. 2. ????? 3. Total GOP victory. @Nero’s grand 2016 strategy.\nSupreme Dark Lord ‏@voxday\nJonah, no one under the age of 40 gives a damn about Holocaustianity anymore than they do about the Sicilian Vespers.\nJonah Goldberg ‏@JonahNRO\nVox, 1. That’s horseshit 2. Even if it wasn’t, that’s not an argument for saying disgusting and bigoted things for laughs.\nSupreme Dark Lord ‏@voxday\nHow much do you care about the Left calling you racist? That’s how much #AltRight cares about being called anti-semitic.\nSupreme Dark Lord ‏@voxday\nWhat do those called anti-semites for supporting Trump have to fear? They’ll be called anti-semites a second time? So what?\nHank Coates ‏@hankhank30\ncomplete and utter horseshit. I went to school with holocaust survivor grandkids. Fuck that fascist.\nSupreme Dark Lord ‏@voxday\nNobody cares. The Hispanics don’t care. The blacks don’t care. The Asians don’t care. Most whites don’t anymore.\nMilo Yiannopoulos ✘ ‏@Nero\nThe left robbed racist, sexist and homophobic of meaning. The right did the same to anti-semitic. No one under 40 cares about any of them.\nNunuya Bizinizz ‏@wahrbear\nI’m confirming @voxday’s assertion here. Early Millennail Jew and I really find holocaust whiners embarrassing.\nAltRightJew ‏@AltRightJew\nagreed. Unless you lived through it and endured it, not really interested in hearing you whine about it.\nJonah Goldberg ‏@JonahNRO\nAll day this crap. Thanks @nero and @voxday your friends get your back\nIt’s rather remarkable how cuckservatives always cling to the idea that reality is what they wish it to be rather than what objective observation reports that it actually is. The cucks are insisting that everyone under 40 worships Judeo-Christ and believes the Holocaust to be the worstest and most evilist crime in human history ever while Jewish organizations are wringing their hands over the inevitable fact that younger generations increasingly don’t even know what the Holocaustian preachers are banging on about in the first place, much less care about it.\nIf I were a Jew, I wouldn’t worry about the events of 73 years ago. Instead, I’d worry about the fact that, based on the historical pattern, the West is considerably closer to the next pogrom than the previous one. Given the way in which Prime Minister Netanyahu has repeatedly called on the diasporans to return to Israel and\nthe Learned Elders of Wye\nhave been discussing when to jump ship for over a decade, I am confident that I am far from the only one who recognizes the pattern.\nI note, in passing, that the GOP did indeed win big in 2016, thanks to Trump and others ignoring the advice of Jonah Goldberg. I was wrong about one thing, however. We care considerably less about being called anti-semitic than Jonah cares about being called racist.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-13T12:03:20+00:00"
}