{
  "url": "https://voxday.net/2018/04/28/the-suicide-of-the-west/",
  "scraped_at": "2025-12-19T20:59:28.386679",
  "title": "The suicide of the West",
  "date_display": "April 28, 2018",
  "date_iso": "2018-04-28T20:38:35+00:00",
  "date_from_url": "2018-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s the title of Jonah Goldberg’s new book, which I expect will be primarily interesting for how Jonah tries to dance around the obvious, based on <a href=\"http://www.econtalk.org/archives/2018/04/jonah_goldberg.html\">this extensive interview about it with Russell Moore</a>. I’ll be posting my review of it after I finish reading it.</p><p>It tends to strike me as an attempt to defend the West while simultaneously de-Christianizing it. The core thesis strikes me as being fundamentally wrong, because “the fundamental form of human corruption” is most certainly not “I don’t like your artificial constraints on my human desires and my desire for my group to be victorious.”</p><div style=\"text-align: center;\">—</div><p>Russ Roberts: It’s a fascinating book. It’s a disturbing book. It’s a somewhat depressing book, at times; and maybe we’ll look for some bright spots on the horizon and in our conversation. But I want to start with a paragraph from near the beginning of the book. You say the following</p><p><i>My argument begins with some assertions. Capitalism is unnatural. Democracy is unnatural. Human rights are unnatural. The world we live in today is unnatural, and we stumbled into it more or less by accident. The natural state of mankind is grinding poverty punctuated by horrific violence, terminating with an early death. It was like this for a very, very long time.</i></p><p>Elaborate on that. And talk about what you mean by the Miracle, which is the unnaturalness that we’re in the middle of.</p><p>Jonah Goldberg: Right. So, what I mean–I’ll just start with what I mean by ‘unnatural.’ If you took a jar of ants and you dumped them on a planet very much like ours, with our atmosphere, ants would do what ants do. And they would build little colonies and they would dig their little ant tunnels. If you took a pack of dogs and you put them in the wild, they would very quickly become a natural pack like they would. If you took human beings, absent all of the stuff that they learned from culture and education today and put them in the wild, they would not all of a sudden start building houses and schools and have startups. They would take to the trees, and have spears, and it would take a long time to discover spears. And they would behave the way that we are wired to behave. One of the core beliefs I have about a definition of–at the heart of conservatism–is this idea that human nature has no history.</p><p>And so, when I say that ‘capitalism is unnatural’: if it were natural, if it were the way human beings, like ants or dogs or any other creature naturally behaves in its natural environment, we would have developed capitalism a little earlier in the evolutionary history of man. We would have developed democracy a little earlier in the evolutionary history of man. In the 250,000 years, give or take, since we split off from the Neanderthals, the amount of time where we had any conception of natural rights–particularly for strangers, right? People within the tribe, that’s different. But for strangers, the idea that someone we just met has any dignity or any claim on justice–that is an astoundingly new idea in human history. And, this whole world that we live in–so, a big inspiration for this book is this idea you talk a lot about on EconTalk, which is: Hayek’s distinction between the microcosm or the microcosmos, and the macrocosm. And, I take Hayek–I think Hayek is absolutely correct, where he says that we evolved to live in small bands of people–troops, tribes, whatever label you want to call them. And that’s how our brains are structured. And our brains haven’t changed very much in the last 10-, 11,000 years since the agricultural revolution. And so, this entire extended order of liberty and contracts and the monopoly on violence of the state–all of these things are really new. They don’t come to us naturally. We have to be taught them. We have to be civilized–as a verb–into believing in these things.</p><p>And this Economic Miracle–and so the Miracle is–and I was heavily influenced by Deirdre McCloskey; and I think she gets a lot right. We can talk about one of the things she might get wrong, later. But, you know, for, what is it, 7500 generations? For 200-, 300,000 years, the average human being everywhere in the world lived on average on about $3 a day. I think it’s Todd Buchholz who says that man lived no better for most of man’s existence he lived no better on two legs than he had on four. And, it is only when you get this radical change in ideas that comes from the bottom up–what I call the Lockean Revolution, but I don’t think Locke gets credit for it. He just simply sort of represents it. For the first in all of human history basically in one place, this little corner of Europe, human prosperity, human wealth starts to explode. And that explosion radiates out around the world and is still doing so today. And that is a miracle. And the reason I call it a Miracle is not because I think God delivered it–the first sentence of the book is, “There is no God in this book.”</p><p>Russ Roberts: A promise you don’t quite keep; but, I know what you meant.</p><p>Jonah Goldberg: We can talk about it.</p><p>Russ Roberts: That’s all right.</p><p>Jonah Goldberg: But, what I’m saying is, it’s not providential. Right? God didn’t suddenly decide to give us all of this bounty. It’s a miracle because you people, you, you know, you witches and warlocks of the economics profession have not reached a consensus about why the hell it happened. You know, there is a consensus about the $3 a day stuff. But there is not a consensus about why this miracle or this explosion of rights, liberties, and prosperity happened. And, no one planned it. We stumbled into it by accident. And, my argument is that we should be incredibly grateful for it. And, therefore, protective of it. You only protect those things you are grateful for. And, that’s what I–that’s sort of the opening precis of the book, I guess.</p><p>Russ Roberts: Yeah. Just a couple of comments. I always think of it as the goose that lays the golden egg. If you have a goose that–all of sudden you get this goose that happens to be laying golden eggs instead of regular ones–you’d kind of want to be interested in what keeps the goose healthy and alive, and how this came to happen, as you keep it going. And we seem to be somewhat oblivious of it. I think it’s a human trait to be–take things for granted, and to think that tomorrow will be like yesterday. And so, the era of progress we presume is just a natural thing. And, as you point out–it’s hard to accept, but it’s not so natural.</p><p>Jonah Goldberg: Right.</p><p>Russ Roberts: And just to expand on the Hayek point, in The Fatal Conceit, he says: This micro-cosmos and macro-cosmos, we have two –we have to have two ways of thinking about the world. In our small families or our bands or our tribes or our communities, we have a more socialist–what you and I would call a Socialist–enterprise. We don’t sell stuff to our kids: typically, we share. It’s top down, not bottom up. In the family, the parents tend to run things. And, that’s very appropriate in a small group that’s held together by bonds of love, for genetics–whatever keeps it together. And, he says, we have to have a different mindset when we go out to the extended order–when we are traders and commercial actors. And he said, we have a tendency to try to take the beautiful and poetic ethos of the family and extend it into the larger order. And he says that leads to tyranny.</p><p>Jonah Goldberg: Right.</p><p>Russ Roberts: In a way, that’s–that’s what I want to–you might–it’s one of the things you are worried about in your book. Which is that the tribalism that we are hardwired for seems to be spreading beyond the immediate family.</p><p>Jonah Goldberg: That’s right. I think it’s worth pointing out: It is disastrous going both ways.</p><p>Russ Roberts: Hayek makes that point, yeah.</p><p>Jonah Goldberg: Right. Right. It’s disastrous to treat the larger society like a family or tribe. But it’s also disastrous–getting your g’mindschaft[?] and your Gesellschaft is always a problem. And treating your family like a contractual society destroys the family. And, both are really, really bad. And I agree that it’s not just that we are Socialist. I mean, the way I always put it is: We are literally Communist, in the sense that in my family it is: From each according to his ability, to each according to his need. You have a sick kid, you don’t do any kind of calculus about what their contribution to the family is. You just do whatever they need. And, yeah. So, part of my argument is that–you know, the Roman philosopher Horus has this line where he says, ‘You can chase nature without–you can chase nature out with a pitchfork, but it always comes running back in.’ And, so, part of my argument is that human nature is always with us. Right? We are born with it. That is the preloaded software of the human condition, and you can’t erase that hard-drive. All you can do is channel and harness human nature towards productive ends as best you can. And when you don’t do that, human nature will assert itself.</p><p>And I think of this in terms of corruption: That, just as if you don’t maintain their upkeep–a car, a boat, or a house–the Second Law of Thermodynamics or entropy or just rust will–you know, rust never sleeps. Eventually, nature reclaims everything. And that’s true of civilizations, too. And if we don’t civilize people to understand this distinction between the micro- and the macro-cosm, what inevitably happens is that the logic of the microcosm, the desire to live tribally which we’re all born with, starts to infect politics. And if you are not on guard for it, it can swamp politics. And this is why I would argue that virtually every form of authoritarianism, totalitarianism–whether you want to call it right-wing or left-wing–doesn’t really matter to me any more. They are all reactionary. Because they are all trying to restore that tribal sense of social solidarity–whether, you know, it’s a monarchy or treating the leader of the country as the father of the country or the Fuehrer or whatever you want to call it. Or whether you are just saying that the entire society is just one family.</p><p>Whether it’s nationalism, or socialism, or populism–all of these things are basically the reassertion of human nature, which says: I don’t like your artificial constraints on my human desires and my desire for my group to be victorious. And that is the fundamental form of human corruption.</p></div>",
  "content_text": "That’s the title of Jonah Goldberg’s new book, which I expect will be primarily interesting for how Jonah tries to dance around the obvious, based on\nthis extensive interview about it with Russell Moore\n. I’ll be posting my review of it after I finish reading it.\nIt tends to strike me as an attempt to defend the West while simultaneously de-Christianizing it. The core thesis strikes me as being fundamentally wrong, because “the fundamental form of human corruption” is most certainly not “I don’t like your artificial constraints on my human desires and my desire for my group to be victorious.”\n—\nRuss Roberts: It’s a fascinating book. It’s a disturbing book. It’s a somewhat depressing book, at times; and maybe we’ll look for some bright spots on the horizon and in our conversation. But I want to start with a paragraph from near the beginning of the book. You say the following\nMy argument begins with some assertions. Capitalism is unnatural. Democracy is unnatural. Human rights are unnatural. The world we live in today is unnatural, and we stumbled into it more or less by accident. The natural state of mankind is grinding poverty punctuated by horrific violence, terminating with an early death. It was like this for a very, very long time.\nElaborate on that. And talk about what you mean by the Miracle, which is the unnaturalness that we’re in the middle of.\nJonah Goldberg: Right. So, what I mean–I’ll just start with what I mean by ‘unnatural.’ If you took a jar of ants and you dumped them on a planet very much like ours, with our atmosphere, ants would do what ants do. And they would build little colonies and they would dig their little ant tunnels. If you took a pack of dogs and you put them in the wild, they would very quickly become a natural pack like they would. If you took human beings, absent all of the stuff that they learned from culture and education today and put them in the wild, they would not all of a sudden start building houses and schools and have startups. They would take to the trees, and have spears, and it would take a long time to discover spears. And they would behave the way that we are wired to behave. One of the core beliefs I have about a definition of–at the heart of conservatism–is this idea that human nature has no history.\nAnd so, when I say that ‘capitalism is unnatural’: if it were natural, if it were the way human beings, like ants or dogs or any other creature naturally behaves in its natural environment, we would have developed capitalism a little earlier in the evolutionary history of man. We would have developed democracy a little earlier in the evolutionary history of man. In the 250,000 years, give or take, since we split off from the Neanderthals, the amount of time where we had any conception of natural rights–particularly for strangers, right? People within the tribe, that’s different. But for strangers, the idea that someone we just met has any dignity or any claim on justice–that is an astoundingly new idea in human history. And, this whole world that we live in–so, a big inspiration for this book is this idea you talk a lot about on EconTalk, which is: Hayek’s distinction between the microcosm or the microcosmos, and the macrocosm. And, I take Hayek–I think Hayek is absolutely correct, where he says that we evolved to live in small bands of people–troops, tribes, whatever label you want to call them. And that’s how our brains are structured. And our brains haven’t changed very much in the last 10-, 11,000 years since the agricultural revolution. And so, this entire extended order of liberty and contracts and the monopoly on violence of the state–all of these things are really new. They don’t come to us naturally. We have to be taught them. We have to be civilized–as a verb–into believing in these things.\nAnd this Economic Miracle–and so the Miracle is–and I was heavily influenced by Deirdre McCloskey; and I think she gets a lot right. We can talk about one of the things she might get wrong, later. But, you know, for, what is it, 7500 generations? For 200-, 300,000 years, the average human being everywhere in the world lived on average on about $3 a day. I think it’s Todd Buchholz who says that man lived no better for most of man’s existence he lived no better on two legs than he had on four. And, it is only when you get this radical change in ideas that comes from the bottom up–what I call the Lockean Revolution, but I don’t think Locke gets credit for it. He just simply sort of represents it. For the first in all of human history basically in one place, this little corner of Europe, human prosperity, human wealth starts to explode. And that explosion radiates out around the world and is still doing so today. And that is a miracle. And the reason I call it a Miracle is not because I think God delivered it–the first sentence of the book is, “There is no God in this book.”\nRuss Roberts: A promise you don’t quite keep; but, I know what you meant.\nJonah Goldberg: We can talk about it.\nRuss Roberts: That’s all right.\nJonah Goldberg: But, what I’m saying is, it’s not providential. Right? God didn’t suddenly decide to give us all of this bounty. It’s a miracle because you people, you, you know, you witches and warlocks of the economics profession have not reached a consensus about why the hell it happened. You know, there is a consensus about the $3 a day stuff. But there is not a consensus about why this miracle or this explosion of rights, liberties, and prosperity happened. And, no one planned it. We stumbled into it by accident. And, my argument is that we should be incredibly grateful for it. And, therefore, protective of it. You only protect those things you are grateful for. And, that’s what I–that’s sort of the opening precis of the book, I guess.\nRuss Roberts: Yeah. Just a couple of comments. I always think of it as the goose that lays the golden egg. If you have a goose that–all of sudden you get this goose that happens to be laying golden eggs instead of regular ones–you’d kind of want to be interested in what keeps the goose healthy and alive, and how this came to happen, as you keep it going. And we seem to be somewhat oblivious of it. I think it’s a human trait to be–take things for granted, and to think that tomorrow will be like yesterday. And so, the era of progress we presume is just a natural thing. And, as you point out–it’s hard to accept, but it’s not so natural.\nJonah Goldberg: Right.\nRuss Roberts: And just to expand on the Hayek point, in The Fatal Conceit, he says: This micro-cosmos and macro-cosmos, we have two –we have to have two ways of thinking about the world. In our small families or our bands or our tribes or our communities, we have a more socialist–what you and I would call a Socialist–enterprise. We don’t sell stuff to our kids: typically, we share. It’s top down, not bottom up. In the family, the parents tend to run things. And, that’s very appropriate in a small group that’s held together by bonds of love, for genetics–whatever keeps it together. And, he says, we have to have a different mindset when we go out to the extended order–when we are traders and commercial actors. And he said, we have a tendency to try to take the beautiful and poetic ethos of the family and extend it into the larger order. And he says that leads to tyranny.\nJonah Goldberg: Right.\nRuss Roberts: In a way, that’s–that’s what I want to–you might–it’s one of the things you are worried about in your book. Which is that the tribalism that we are hardwired for seems to be spreading beyond the immediate family.\nJonah Goldberg: That’s right. I think it’s worth pointing out: It is disastrous going both ways.\nRuss Roberts: Hayek makes that point, yeah.\nJonah Goldberg: Right. Right. It’s disastrous to treat the larger society like a family or tribe. But it’s also disastrous–getting your g’mindschaft[?] and your Gesellschaft is always a problem. And treating your family like a contractual society destroys the family. And, both are really, really bad. And I agree that it’s not just that we are Socialist. I mean, the way I always put it is: We are literally Communist, in the sense that in my family it is: From each according to his ability, to each according to his need. You have a sick kid, you don’t do any kind of calculus about what their contribution to the family is. You just do whatever they need. And, yeah. So, part of my argument is that–you know, the Roman philosopher Horus has this line where he says, ‘You can chase nature without–you can chase nature out with a pitchfork, but it always comes running back in.’ And, so, part of my argument is that human nature is always with us. Right? We are born with it. That is the preloaded software of the human condition, and you can’t erase that hard-drive. All you can do is channel and harness human nature towards productive ends as best you can. And when you don’t do that, human nature will assert itself.\nAnd I think of this in terms of corruption: That, just as if you don’t maintain their upkeep–a car, a boat, or a house–the Second Law of Thermodynamics or entropy or just rust will–you know, rust never sleeps. Eventually, nature reclaims everything. And that’s true of civilizations, too. And if we don’t civilize people to understand this distinction between the micro- and the macro-cosm, what inevitably happens is that the logic of the microcosm, the desire to live tribally which we’re all born with, starts to infect politics. And if you are not on guard for it, it can swamp politics. And this is why I would argue that virtually every form of authoritarianism, totalitarianism–whether you want to call it right-wing or left-wing–doesn’t really matter to me any more. They are all reactionary. Because they are all trying to restore that tribal sense of social solidarity–whether, you know, it’s a monarchy or treating the leader of the country as the father of the country or the Fuehrer or whatever you want to call it. Or whether you are just saying that the entire society is just one family.\nWhether it’s nationalism, or socialism, or populism–all of these things are basically the reassertion of human nature, which says: I don’t like your artificial constraints on my human desires and my desire for my group to be victorious. And that is the fundamental form of human corruption.",
  "tags": [
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-28T19:38:35+00:00"
}