{
  "url": "https://voxday.net/2018/04/22/the-fake-right-is-collapsing/",
  "scraped_at": "2025-12-19T20:58:32.811457",
  "title": "The Fake Right is collapsing",
  "date_display": "April 22, 2018",
  "date_iso": "2018-04-22T16:32:28+00:00",
  "date_from_url": "2018-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And yet, the Alt-Right remains inevitable. Now that it is of no further use to them, the media is finally <a href=\"http://www.richmond.com/washingtonpost/uncategorized/imploding-lawsuits-fundraising-troubles-trailer-park-brawls-has-the-alt/article_532720ad-44a7-5d0a-9b3c-c75c76c1f8ca.html\">killing off its cartoon parody</a> of the Right. But the Right is not, and never was, based on races or states, but rather, on nations. The material distinction between nationalism and imperialism is the easiest way to distinguish between true Right and Fake Right. Meanwhile, the genuine nationalists are growing steadily in popularity and influence, and taking over entire nations:</p><blockquote><p>Eight months after a white nationalist rally in Charlottesville, Virginia ended in the death of a counterprotester, the loose collection of disaffected young white men known as the alt-right is in disarray.</p><p>The problems have been mounting: lawsuits and arrests, fundraising difficulties, tepid recruitment, widespread infighting, fierce counterprotests and banishment on social media platforms. Taken together, they’ve exhausted even some of the staunchest members.</p><p>One of the movement’s biggest groups, the Traditionalist Worker Party, dissolved in March. Andrew Anglin, founder of the Daily Stormer, the largest alt-right website, has gone into hiding, chased by a harassment lawsuit. And Richard Spencer, the alt-right’s most public figure, cancelled a college speaking tour and was abandoned by his attorney last month.</p><p>“Things have become a lot harder, and we paid a price for what happened in Charlottesville. . . . The question is whether there is going to be a third act,” said Spencer, who coined the name of the movement, which rose to prominence during the 2016 presidential campaign, advocates a whites-only ethno-state, and has posted racist, anti-Semitic and misogynistic memes across the internet.</p></blockquote><p>This is why it is vital for nationalists to adhere religiously to the philosophical truth rather than to various dogmas and ideologies. Any departure from the truth and the media will adroitly exploit that gap and use it to discredit and disqualify you. Speak the clear and unvarnished truth and they will fear to even mention your name because there is little they can do to effectively spin what you are saying into something that it observably is not. They really, really, really do not want to permit any discussion of which narrative is closer to the observable truth, because that calls their own veracity and legitimacy into question.</p><p>Reject the Fake Right. Reject the neoconservatives. Reject the cuckservatives. Reject the conservatives. They are all fakes. They are all frauds. None of them are able to speak the truth reliably, and that is why the media is always able to successfully exploit the vulnerabilities exposed by their dishonesty.</p><p>UPDATE: Yes, in the unlikely event you still take any of them seriously, reject the libertarians, the communists, and while we’re at it, the Whigs.</p></div>",
  "content_text": "And yet, the Alt-Right remains inevitable. Now that it is of no further use to them, the media is finally\nkilling off its cartoon parody\nof the Right. But the Right is not, and never was, based on races or states, but rather, on nations. The material distinction between nationalism and imperialism is the easiest way to distinguish between true Right and Fake Right. Meanwhile, the genuine nationalists are growing steadily in popularity and influence, and taking over entire nations:\nEight months after a white nationalist rally in Charlottesville, Virginia ended in the death of a counterprotester, the loose collection of disaffected young white men known as the alt-right is in disarray.\nThe problems have been mounting: lawsuits and arrests, fundraising difficulties, tepid recruitment, widespread infighting, fierce counterprotests and banishment on social media platforms. Taken together, they’ve exhausted even some of the staunchest members.\nOne of the movement’s biggest groups, the Traditionalist Worker Party, dissolved in March. Andrew Anglin, founder of the Daily Stormer, the largest alt-right website, has gone into hiding, chased by a harassment lawsuit. And Richard Spencer, the alt-right’s most public figure, cancelled a college speaking tour and was abandoned by his attorney last month.\n“Things have become a lot harder, and we paid a price for what happened in Charlottesville. . . . The question is whether there is going to be a third act,” said Spencer, who coined the name of the movement, which rose to prominence during the 2016 presidential campaign, advocates a whites-only ethno-state, and has posted racist, anti-Semitic and misogynistic memes across the internet.\nThis is why it is vital for nationalists to adhere religiously to the philosophical truth rather than to various dogmas and ideologies. Any departure from the truth and the media will adroitly exploit that gap and use it to discredit and disqualify you. Speak the clear and unvarnished truth and they will fear to even mention your name because there is little they can do to effectively spin what you are saying into something that it observably is not. They really, really, really do not want to permit any discussion of which narrative is closer to the observable truth, because that calls their own veracity and legitimacy into question.\nReject the Fake Right. Reject the neoconservatives. Reject the cuckservatives. Reject the conservatives. They are all fakes. They are all frauds. None of them are able to speak the truth reliably, and that is why the media is always able to successfully exploit the vulnerabilities exposed by their dishonesty.\nUPDATE: Yes, in the unlikely event you still take any of them seriously, reject the libertarians, the communists, and while we’re at it, the Whigs.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-22T15:32:28+00:00"
}