{
  "url": "https://voxday.net/2018/04/29/the-myth-of-jewish-intelligence/",
  "scraped_at": "2025-12-19T20:59:33.865288",
  "title": "The myth of Jewish intelligence",
  "date_display": "April 29, 2018",
  "date_iso": "2018-04-29T09:49:02+00:00",
  "date_from_url": "2018-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Allow me to demonstrate why it is a bad idea to try to bullshit those who are considerably smarter than you are. We are often told that Jews are the smartest ethnic group in the world and that this explains their current position of cultural and socio-economic dominance in the United States. However, the core claim is observably false, and readily and conclusively disproved.</p><p>First, what is the basis for the claim that Jews are highly intelligent?</p><blockquote class=\"tr_bq\"><p>Researchers who study the Ashkenazim agree that the children of Abraham are on top of the IQ chart. Steven Pinker – who lectured on “Jews, Genes, and Intelligence” in 2007 – says “their average IQ has been measured at 108-115.” Richard Lynn, author of “The Intelligence of American Jews” in 2004, says it is “only” a half-standard higher: 107.5.  Henry Harpending, Jason Hardy, and Gregory Cochran, University of Utah authors of the 2005 research report, “Natural History of Ashkenazi Intelligence,” state that their subjects, “score .75 to 1.0 standard deviations above the general European average, corresponding to an IQ of 112-115.” Charles Murray, in his 2007 essay “Jewish Genius,” says “their mean is somewhere in the range of 107-115, with 110 being a plausible compromise.” A Jewish average IQ of 115 is 8 points higher than the generally accepted IQ of their closest rivals—Northeast Asians—and approximately 40{9777635cfa82a0aab621d7111c7b7154d6356e0eedfaecd5a3ca30be59699a9a} higher than the global average IQ of 79.1 calculated by Richard Lynn and Tatu Vanhanen in IQ and Global Inequity.</p></blockquote><p>First, you will note the usual definitional switch we’ve learned to anticipate. A subset – Ashkenazim – is substituted for the full set of Jews. Second, if one takes the trouble to look up and read these studies that are often referenced but never cited, one is immediately struck by the fact that the studies are a) misrepresented, b) old and outdated, c) invariably authored by those with an observable bias, and d) the samples reported are always limited to a very small subset of the subset of the set. For example, the primary source of the “115 IQ” claim appears to be a 1957 study by Boris Levinson entitled “The Intelligence of Applicants for Admission to Jewish Day Schools” published in <i>Jewish Social Studies</i>,Vol. 19, No. 3/4 (Jul. – Oct., 1957), pp. 129-140.</p><p>Right in the study, which reported a 114.88 mean IQ for the 2083 students sampled, the author notes its intrinsic limitations.</p><blockquote class=\"tr_bq\"><p>This study is limited to applicants for Day Schools adhering to the principles of the National Commission for Yeshiva Education. This sampling does not claim to represent the entire Jewish school population or even those children attending yeshiva Day Schools with a different educational emphasis. </p></blockquote><p>Levinson further admits that the students sampled only represented 38 percent of the 5494 students attending the 16 Day Schools, raising the possibility that the sampled scores were cherry-picked. Now, are we seriously expected to believe that the mean of a partial subset of a wealthy private school subset of a half-European subset is <i>even remotely representational</i> of the average of the complete population set? This is so utterly absurd on its face that for the logically inclined, it alone should suffice to conclusively refute the claim.</p><p>In the study, Levinson refers to a 1956 study by Robert D. North concerning American fourth-graders from 16 independent private school, and noted the following:</p><blockquote class=\"tr_bq\"><p>Many of these schools select their pupils on the basis of mental ability and achievement. Because these schools charge tuition fees, most of their pupils come from higher socio-economic levels. These children had a mean IQ of 119.3.</p></blockquote><p>Shall we therefore conclude that the average white American is more intelligent than the average Jew because one very small group of elite private-schooled white Americans outperformed another very small group of elite private-schooled Jews? Of course not, that would be nonsensical, right? The samples are not representative, right? There are numerous other statistical idiosyncracies that demonstrate the irrelevance of these post-WWII IQ studies to average population IQs; for example, one study reported that the average IQ of the boys was 112.8 and of the girls was 113.6. If we are to take these particular IQ studies as definitive, then we must conclude that girls are more intelligent than boys, all other subsequent studies and observations to the contrary.</p><p>Third, given the average reported Israeli IQ of 95, and the average reported Jordanian IQ of 84, the claim of an average 115 IQ for Ashkenazi Jews would necessarily require all other Jews to have an average IQ of 84.2. This means that <i>even if</i> Ashkenazi Jews <i><u>did</u> </i>have a mean IQ of 115, then the average global Jewish IQ would be 107.0. However, on the basis of the original studies pointing out that the reported IQ scores are <u>not</u> indicative of mean or average Ashkenazi IQ, we can be 100 percent certain that this estimated 107 IQ is higher than the real Jewish average.</p><p>For example, if Lynn is correct and the Ashkenazi mean is 107.5, then the average global Jewish IQ is 103.2. Not bad, certainly, but considerably lower than 115 and an insufficient foundation on which to construct a believable narrative of intellectual superiority and inevitable success.</p><p>There are many other reasons to be dubious of the myth of Jewish intelligence. Consider Israel, for example. It is a successful quasi-European society, superior in most respects to the lower-IQ Arab societies surrounding it, but it is no more technologically advanced or socio-economically successful than most Western or East Asian societies, and it remains economically dependent upon regular handouts from Germany and the USA. Even after 70 years, it is not the advanced society that one would expect a uniquely high average IQ society to be. The reason, of course, is that <i>it is not</i>.</p><p>Moreover, where was this disproportional high-IQ success in Roman times, in the Middle Ages and in the Renaissance? Where was it in the Napoleonic era? Why did it only appear when and where a sufficient degree of societal influence in certain societies had been obtained? And most of all, how did various European countries observably benefit so greatly from reducing their average IQs through the various expulsions?</p><p>The good news for those who are interested in the truth is that despite the reproducibility crisis in science, the relentless advancement of scientage means it is no longer possible to utilize dishonest citations of biased studies of limited relevance from 62 years ago to deceive the general public. The advancement of genetic science and the confirmed links between genetics and intelligence will soon scientifically explode this outdated and self-serving myth that has been relentlessly pushed upon the unsuspecting American public along with similar myths such as the Zeroth Amendment, “a nation of immigrants”, “the melting pot”, and Judeo-Christianity.</p><p>Now, it is remotely possible that I am wrong and there is a factual basis to the myth. More likely, however, we will learn that Flynn is too generous and the correct average is below 103. Regardless, the facts of the subject will soon be known and they will be beyond the possibility of reasonable dispute. If I am right, however, you can expect to see the previous link between average IQ and societal success to be played down, just as Ivy League admissions officers are now attempting to play down the importance of test scores and merits in the university admissions process.</p></div>",
  "content_text": "Allow me to demonstrate why it is a bad idea to try to bullshit those who are considerably smarter than you are. We are often told that Jews are the smartest ethnic group in the world and that this explains their current position of cultural and socio-economic dominance in the United States. However, the core claim is observably false, and readily and conclusively disproved.\nFirst, what is the basis for the claim that Jews are highly intelligent?\nResearchers who study the Ashkenazim agree that the children of Abraham are on top of the IQ chart. Steven Pinker – who lectured on “Jews, Genes, and Intelligence” in 2007 – says “their average IQ has been measured at 108-115.” Richard Lynn, author of “The Intelligence of American Jews” in 2004, says it is “only” a half-standard higher: 107.5.  Henry Harpending, Jason Hardy, and Gregory Cochran, University of Utah authors of the 2005 research report, “Natural History of Ashkenazi Intelligence,” state that their subjects, “score .75 to 1.0 standard deviations above the general European average, corresponding to an IQ of 112-115.” Charles Murray, in his 2007 essay “Jewish Genius,” says “their mean is somewhere in the range of 107-115, with 110 being a plausible compromise.” A Jewish average IQ of 115 is 8 points higher than the generally accepted IQ of their closest rivals—Northeast Asians—and approximately 40{9777635cfa82a0aab621d7111c7b7154d6356e0eedfaecd5a3ca30be59699a9a} higher than the global average IQ of 79.1 calculated by Richard Lynn and Tatu Vanhanen in IQ and Global Inequity.\nFirst, you will note the usual definitional switch we’ve learned to anticipate. A subset – Ashkenazim – is substituted for the full set of Jews. Second, if one takes the trouble to look up and read these studies that are often referenced but never cited, one is immediately struck by the fact that the studies are a) misrepresented, b) old and outdated, c) invariably authored by those with an observable bias, and d) the samples reported are always limited to a very small subset of the subset of the set. For example, the primary source of the “115 IQ” claim appears to be a 1957 study by Boris Levinson entitled “The Intelligence of Applicants for Admission to Jewish Day Schools” published in\nJewish Social Studies\n,Vol. 19, No. 3/4 (Jul. – Oct., 1957), pp. 129-140.\nRight in the study, which reported a 114.88 mean IQ for the 2083 students sampled, the author notes its intrinsic limitations.\nThis study is limited to applicants for Day Schools adhering to the principles of the National Commission for Yeshiva Education. This sampling does not claim to represent the entire Jewish school population or even those children attending yeshiva Day Schools with a different educational emphasis.\nLevinson further admits that the students sampled only represented 38 percent of the 5494 students attending the 16 Day Schools, raising the possibility that the sampled scores were cherry-picked. Now, are we seriously expected to believe that the mean of a partial subset of a wealthy private school subset of a half-European subset is\neven remotely representational\nof the average of the complete population set? This is so utterly absurd on its face that for the logically inclined, it alone should suffice to conclusively refute the claim.\nIn the study, Levinson refers to a 1956 study by Robert D. North concerning American fourth-graders from 16 independent private school, and noted the following:\nMany of these schools select their pupils on the basis of mental ability and achievement. Because these schools charge tuition fees, most of their pupils come from higher socio-economic levels. These children had a mean IQ of 119.3.\nShall we therefore conclude that the average white American is more intelligent than the average Jew because one very small group of elite private-schooled white Americans outperformed another very small group of elite private-schooled Jews? Of course not, that would be nonsensical, right? The samples are not representative, right? There are numerous other statistical idiosyncracies that demonstrate the irrelevance of these post-WWII IQ studies to average population IQs; for example, one study reported that the average IQ of the boys was 112.8 and of the girls was 113.6. If we are to take these particular IQ studies as definitive, then we must conclude that girls are more intelligent than boys, all other subsequent studies and observations to the contrary.\nThird, given the average reported Israeli IQ of 95, and the average reported Jordanian IQ of 84, the claim of an average 115 IQ for Ashkenazi Jews would necessarily require all other Jews to have an average IQ of 84.2. This means that\neven if\nAshkenazi Jews\ndid\nhave a mean IQ of 115, then the average global Jewish IQ would be 107.0. However, on the basis of the original studies pointing out that the reported IQ scores are\nnot\nindicative of mean or average Ashkenazi IQ, we can be 100 percent certain that this estimated 107 IQ is higher than the real Jewish average.\nFor example, if Lynn is correct and the Ashkenazi mean is 107.5, then the average global Jewish IQ is 103.2. Not bad, certainly, but considerably lower than 115 and an insufficient foundation on which to construct a believable narrative of intellectual superiority and inevitable success.\nThere are many other reasons to be dubious of the myth of Jewish intelligence. Consider Israel, for example. It is a successful quasi-European society, superior in most respects to the lower-IQ Arab societies surrounding it, but it is no more technologically advanced or socio-economically successful than most Western or East Asian societies, and it remains economically dependent upon regular handouts from Germany and the USA. Even after 70 years, it is not the advanced society that one would expect a uniquely high average IQ society to be. The reason, of course, is that\nit is not\n.\nMoreover, where was this disproportional high-IQ success in Roman times, in the Middle Ages and in the Renaissance? Where was it in the Napoleonic era? Why did it only appear when and where a sufficient degree of societal influence in certain societies had been obtained? And most of all, how did various European countries observably benefit so greatly from reducing their average IQs through the various expulsions?\nThe good news for those who are interested in the truth is that despite the reproducibility crisis in science, the relentless advancement of scientage means it is no longer possible to utilize dishonest citations of biased studies of limited relevance from 62 years ago to deceive the general public. The advancement of genetic science and the confirmed links between genetics and intelligence will soon scientifically explode this outdated and self-serving myth that has been relentlessly pushed upon the unsuspecting American public along with similar myths such as the Zeroth Amendment, “a nation of immigrants”, “the melting pot”, and Judeo-Christianity.\nNow, it is remotely possible that I am wrong and there is a factual basis to the myth. More likely, however, we will learn that Flynn is too generous and the correct average is below 103. Regardless, the facts of the subject will soon be known and they will be beyond the possibility of reasonable dispute. If I am right, however, you can expect to see the previous link between average IQ and societal success to be played down, just as Ivy League admissions officers are now attempting to play down the importance of test scores and merits in the university admissions process.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-29T08:49:02+00:00"
}