{
  "url": "https://voxday.net/2018/04/30/the-myth-of-jordan-petersons-integrity/",
  "scraped_at": "2025-12-19T20:59:43.062095",
  "title": "The myth of Jordan Peterson’s integrity",
  "date_display": "April 30, 2018",
  "date_iso": "2018-04-30T12:58:57+00:00",
  "date_from_url": "2018-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://cdn.idka.com/8a86ed25-0896-46f6-98e2-9d99584e2865\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"341\" data-original-width=\"512\" decoding=\"async\" src=\"https://cdn.idka.com/8a86ed25-0896-46f6-98e2-9d99584e2865\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"341\" data-original-width=\"512\" data-src=\"https://cdn.idka.com/8a86ed25-0896-46f6-98e2-9d99584e2865\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20341%22%3E%3C/svg%3E\"/></a></div><p>yclepedbobali observes that Jordan Peterson not only cannot answer my critique in a for summarized by someone else, he is downright afraid of his readers encountering it and exposing his posturing on a subject he refuses to honestly address.</p><blockquote><p>I’m a midwit, at very best. Just synthesising your arguments, with a little embellishment, blew his grand ‘arithmetic triumph over the bucko Nazgul’ into a million tiny leaves on the Canadian breeze.</p><p>He can publicise and flaunt his flawless victory over the lead comment, so ‘representative’ of the apparent poor intellectual stock of right wing thugs. Just another conspiracy theorist helpless before the isolate and trinity of that ‘irrefutable’ average IQ of 115, the bell curve tail distribution, and openness to experience and liberalism. But he knows, and he knows we know.</p><p>I see why no one debates you. Even a midwit like me becomes something formidable armed with your mental tools and pugilist approach.</p></blockquote><p>Here is my articulated critique of Jordan Peterson’s argument. First, I suggest reading Jordan Peterson’s actual argument in full: <a href=\"https://archive.fo/8ZJj9\">“On the so-called Jewish Question”</a> as well as his subsequent response to a critic who did a reasonable job of showing how Peterson’s argument did not hold up given the population demographics. I linked to the archive as well as <a href=\"https://jordanbpeterson.com/psychology/on-the-so-called-jewish-question/\">to his site</a> because I anticipate Peterson will memory-hole it once he realizes how hapless and dishonest it makes him look to an unbiased reader. His argument is summarized as follows:</p><ol><li>One requires a victim and a perpetrator in order to play identity politics.</li><li>The Far Right has chosen European culture as a victim due to its unrecognized resentment and cowardly and incompetent failure to deal with the world forthrightly, and have incorrectly selected the Jews as perpetrator due to Jewish overrepresentation in positions of authority, competence and influence. </li><li>Jewish people are overrepresented in positions of competence and authority because, as a group, they have a higher mean IQ.</li><li>Jews have a mean IQ of 115.</li><li>“40.8{c2bf88dee429485d3b0f61325a10c26cb2e215274027e21905ef5aec05bbd0e7} of the 145+ IQ population is Jewish.”</li><li>“There is no evidence whatsoever that Ashkenazi Jews are over-represented in any occupations/interests for reasons other than intelligence and the associated effects of intelligence on personality and political belief. Thus, no conspiratorial claims based on ethnic identity need to be given credence.”</li></ol><p>Peterson’s argument is not merely incorrect, literally every single aspect of it is false. It is so resolutely and demonstrably false that it is not possible for Jordan Peterson to have constructed it in innocence by mistake. In my opinion, it clearly represents a purposeful intent to deceive his audience and falsely accuse those he labels “the far right”. My responses to those six points, with the numbers updated to reflect the most recent population demographics.</p><ol><li>One does not require a victim or a perpetrator in order to play identity politics. One does not need to be aware of identity politics or even to believe they exist to find oneself engulfed in them. To quote Lee Kwan Yew, “In multiracial societies, you don’t vote in accordance with your economic interests and social interests, you vote in accordance with race and religion.” All a society requires is multiracial, multiethnic, or multireligious components and identity politics will inevitably appear once the minority populations become sufficiently numerous or influential.</li><li>European culture and the European nations are observably victims of mass immigration. This is a fact that is no more disputable than the fact that the indigenous American populations were victims of mass immigration in the 16th and 17th centuries and Asian populations were victims of colonization and imperialism in the 18th and 19th centuries. The perpetrators are, by definition, the immigrants, as well as those who worked to alter the various laws to permit the immigrants entry.</li><li>Jews are not overrepresented in positions of competence and authority because, as a group, they have a higher mean IQ, because a) IQs over 145 do not tend to help, but rather tend to hinder, an individual’s ability to attain such positions, and b) their higher mean IQ is not high enough to compensate for their much smaller population.</li><li>Jews do not have an average mean IQ of 115. Globally, <a href=\"http://voxday.blogspot.com/2018/04/the-myth-of-jewish-intelligence.html\">they have an average mean IQ that is a maximum of 103.2</a>. In the US, where the percentage of high-IQ Ashkenazim is higher, they have a maximum average mean IQ of 105.1.</li><li>Less than 4 percent of the 145+ IQ population in the USA is Jewish.</li><li>Thus, conspiratorial claims based on ethnic identity remain a valid potential explanation for Jewish overrepresentation in positions of competence and authority. Jordan Peterson is at best an inept intellectual disputant, and at worst an intentional deceiver.</li></ol><p>Now I will proceed to prove responses 3, 4, and 5 in detail. Response 6 follows naturally from them.</p><p><b>On point 3.</b></p><p>There is a linear relationship between intelligence and effective leadership, but only up to 120 IQ. This association reverses at IQ 120. This is primarily due to the IQ communication gap which prevents effective communication across 2 standard deviations (30 IQ points) of intelligence. This negative effect of high IQ is further compounded by <a href=\"http://voxday.blogspot.com/2015/05/the-excluded.html\">the statistical exclusion of the cognitive elite</a> from intellectually elite professions.</p><div></div><div><i>The probability of entering and remaining in an intellectually elite profession such as Physician, Judge, Professor, Scientist, Corporate Executive, etc. increases with IQ to about 133. It then falls about 1/3 by 140. By 150 IQ the probability has fallen by 97{c2bf88dee429485d3b0f61325a10c26cb2e215274027e21905ef5aec05bbd0e7}! In other words, a significant percentage of people with IQs over 140 are being systematically and, most likely inappropriately, excluded from the population that addresses the biggest problems of our time or who are responsible for assuring the efficient operation of social, scientific, political and economic institutions.</i><p>Jordan Peterson’s explanation for Jewish success is not only wrong, but, ironically, even if it had been factually based his argument would have proven precisely the opposite of that which he was attempting to demonstrate. The fact that Jews are overrepresented in positions of competence and authority is actually conclusive statistical evidence that their average mean IQ <i><u>cannot</u> </i>be uniquely and extraordinarily high.</p><p><b>On point 4</b></p><p>The primary and oft-cited source of the “115 mean IQ” claim is the 1957 study by Boris Levinson entitled “The Intelligence of Applicants for Admission to Jewish Day Schools” published in Jewish Social Studies,Vol. 19, No. 3/4 (Jul. – Oct., 1957), pp. 129-140.</p><p>In the study, which reported a 114.88 mean IQ for the 2083 very young students sampled, the author duly noted its intrinsic limitations.</p><p><i>“This study is limited to applicants for Day Schools adhering to the principles of the National Commission for Yeshiva Education. This sampling does not claim to represent the entire Jewish school population or even those children attending yeshiva Day Schools with a different educational emphasis.”</i></p><p>The 114.88 mean IQ did not represent the entire U.S. Jewish population in 1956 and therefore cannot possibly represent the entire U.S. Jewish population 61 years later. Furthermore, <i>even if it did</i> correctly represent the entire Jewish Ashkenazi population in the USA <i>then</i>, it would not do so <i>now</i>, due to the fact that what used to be a relatively pure Ashkenazi population is now 44 percent genetically adulterated by the mainstream population due to intermarriage. The current US population of 5,425,000 Jews is now made up of the following genetic groups:</p><ul><li>51.6 Ashkenazi</li><li>40.6 Half-Ashkenazi, Half-European (Which really means three-quarters European ancestry.)</li><li>07.8 Sephardic, Mizrahi, and other backgrounds</li></ul><p>Remember, it’s not the ethnic identity that magically conveys intelligence on an individual, intelligence is primarily a consequence of the individual’s genetic ancestry. Even if individuals in the second category consider themselves to be every bit as Jewish as their immigrant Jewish grandparents in a cultural, ethnic, or religious sense, it is not true from a genetic perspective and the studies on mean Ashkenazi IQ therefore cannot apply to them. I suspect that this is an unintentional focus on identity instead of genetics on Peterson’s part, (an ironic one, given his attack on identity politics), and it is a mistake that he makes it twice. Now, given that the 107.5 mean Ashkenazi IQ given by Lynn is at least possibly correct (unlike the false 115 claim which cannot be) and the 102 mean IQ for white Americans, we can reasonably estimate the Half-Ashkenazi mean IQ to be halfway between the two population groups, or 104.8.</p><p>Since the non-Ashkenazi Jewish mean IQ is somewhere between 84.2 (if A-IQ=115) and 91 (if A-IQ=107.5) given the reported average IQ of Israel being 95, this means that the maximum mean IQ of the U.S. Jewish population is 105.1, 3.1 points higher than the mean White IQ of 102 but below the reported mean East Asian-American IQ of 106.</p><p><b>On point 5</b></p><p>Peterson’s claim that 40.8 percent of the 145+ IQ population in the USA is Jewish is not merely wrong, <i>it is off by more than an order of magnitude!</i> First, he omits the Asian and Black populations, second, he exaggerates the US Jewish population by 10 percent and fails to account for the fact that 48.4 percent of that population is either part-Ashkenazi or non-Ashkenazi, and third, he again makes the mistake of relying upon identity rather than genetics for the White population. Use of the White, Non-Hispanic population is not correct here, because the White Hispanic population is defined as being <i>genetically </i>white and therefore cannot be excluded from the relevant White population numbers.</p><p>With a mean IQ of 105.1 and a population of 5,425,000, the standard distribution curve indicates 21,158 Jews with 145+ IQs in the United States. In addition to this, the mean IQ of 102 for the White population of 246,660,710 indicates 517,987 Whites with 145+ IQs, plus another 31,913 equally high-IQ Chinese, Japanese, and Koreans resident in the United States.</p><p>Jews therefore account for 3.7 percent of the 145+ IQ set in the United States, not 40.8 percent of it. Jordan Peterson was off by more than an order of magnitude, his argument is completely incorrect, and his public charges of cowardice and “incompetent failure to deal with the world forthrightly” appear to be emotional projections of Peterson’s own cowardice and incompetent failure.</p><p><b>On point 6</b></p><p>I do not know Jordan Peterson, but his incorrect and deceitful arguments and his unfair, unjustified attacks on his critics show him to be an inept and integrity-challenged coward who lacks commitment to the truth. The combination of his sudden success with his observable intellectual ineptitude suggests that he has been elevated by the mainstream media in order to provide a harmless, toothless, and non-Christian alternative to the failed conservative movement of William F. Buckley and the failed neoconservative movement of Bill Kristol and Ben Shapiro.</p></div></div>",
  "content_text": "yclepedbobali observes that Jordan Peterson not only cannot answer my critique in a for summarized by someone else, he is downright afraid of his readers encountering it and exposing his posturing on a subject he refuses to honestly address.\nI’m a midwit, at very best. Just synthesising your arguments, with a little embellishment, blew his grand ‘arithmetic triumph over the bucko Nazgul’ into a million tiny leaves on the Canadian breeze.\nHe can publicise and flaunt his flawless victory over the lead comment, so ‘representative’ of the apparent poor intellectual stock of right wing thugs. Just another conspiracy theorist helpless before the isolate and trinity of that ‘irrefutable’ average IQ of 115, the bell curve tail distribution, and openness to experience and liberalism. But he knows, and he knows we know.\nI see why no one debates you. Even a midwit like me becomes something formidable armed with your mental tools and pugilist approach.\nHere is my articulated critique of Jordan Peterson’s argument. First, I suggest reading Jordan Peterson’s actual argument in full:\n“On the so-called Jewish Question”\nas well as his subsequent response to a critic who did a reasonable job of showing how Peterson’s argument did not hold up given the population demographics. I linked to the archive as well as\nto his site\nbecause I anticipate Peterson will memory-hole it once he realizes how hapless and dishonest it makes him look to an unbiased reader. His argument is summarized as follows:\nOne requires a victim and a perpetrator in order to play identity politics.\nThe Far Right has chosen European culture as a victim due to its unrecognized resentment and cowardly and incompetent failure to deal with the world forthrightly, and have incorrectly selected the Jews as perpetrator due to Jewish overrepresentation in positions of authority, competence and influence.\nJewish people are overrepresented in positions of competence and authority because, as a group, they have a higher mean IQ.\nJews have a mean IQ of 115.\n“40.8{c2bf88dee429485d3b0f61325a10c26cb2e215274027e21905ef5aec05bbd0e7} of the 145+ IQ population is Jewish.”\n“There is no evidence whatsoever that Ashkenazi Jews are over-represented in any occupations/interests for reasons other than intelligence and the associated effects of intelligence on personality and political belief. Thus, no conspiratorial claims based on ethnic identity need to be given credence.”\nPeterson’s argument is not merely incorrect, literally every single aspect of it is false. It is so resolutely and demonstrably false that it is not possible for Jordan Peterson to have constructed it in innocence by mistake. In my opinion, it clearly represents a purposeful intent to deceive his audience and falsely accuse those he labels “the far right”. My responses to those six points, with the numbers updated to reflect the most recent population demographics.\nOne does not require a victim or a perpetrator in order to play identity politics. One does not need to be aware of identity politics or even to believe they exist to find oneself engulfed in them. To quote Lee Kwan Yew, “In multiracial societies, you don’t vote in accordance with your economic interests and social interests, you vote in accordance with race and religion.” All a society requires is multiracial, multiethnic, or multireligious components and identity politics will inevitably appear once the minority populations become sufficiently numerous or influential.\nEuropean culture and the European nations are observably victims of mass immigration. This is a fact that is no more disputable than the fact that the indigenous American populations were victims of mass immigration in the 16th and 17th centuries and Asian populations were victims of colonization and imperialism in the 18th and 19th centuries. The perpetrators are, by definition, the immigrants, as well as those who worked to alter the various laws to permit the immigrants entry.\nJews are not overrepresented in positions of competence and authority because, as a group, they have a higher mean IQ, because a) IQs over 145 do not tend to help, but rather tend to hinder, an individual’s ability to attain such positions, and b) their higher mean IQ is not high enough to compensate for their much smaller population.\nJews do not have an average mean IQ of 115. Globally,\nthey have an average mean IQ that is a maximum of 103.2\n. In the US, where the percentage of high-IQ Ashkenazim is higher, they have a maximum average mean IQ of 105.1.\nLess than 4 percent of the 145+ IQ population in the USA is Jewish.\nThus, conspiratorial claims based on ethnic identity remain a valid potential explanation for Jewish overrepresentation in positions of competence and authority. Jordan Peterson is at best an inept intellectual disputant, and at worst an intentional deceiver.\nNow I will proceed to prove responses 3, 4, and 5 in detail. Response 6 follows naturally from them.\nOn point 3.\nThere is a linear relationship between intelligence and effective leadership, but only up to 120 IQ. This association reverses at IQ 120. This is primarily due to the IQ communication gap which prevents effective communication across 2 standard deviations (30 IQ points) of intelligence. This negative effect of high IQ is further compounded by\nthe statistical exclusion of the cognitive elite\nfrom intellectually elite professions.\nThe probability of entering and remaining in an intellectually elite profession such as Physician, Judge, Professor, Scientist, Corporate Executive, etc. increases with IQ to about 133. It then falls about 1/3 by 140. By 150 IQ the probability has fallen by 97{c2bf88dee429485d3b0f61325a10c26cb2e215274027e21905ef5aec05bbd0e7}! In other words, a significant percentage of people with IQs over 140 are being systematically and, most likely inappropriately, excluded from the population that addresses the biggest problems of our time or who are responsible for assuring the efficient operation of social, scientific, political and economic institutions.\nJordan Peterson’s explanation for Jewish success is not only wrong, but, ironically, even if it had been factually based his argument would have proven precisely the opposite of that which he was attempting to demonstrate. The fact that Jews are overrepresented in positions of competence and authority is actually conclusive statistical evidence that their average mean IQ\ncannot\nbe uniquely and extraordinarily high.\nOn point 4\nThe primary and oft-cited source of the “115 mean IQ” claim is the 1957 study by Boris Levinson entitled “The Intelligence of Applicants for Admission to Jewish Day Schools” published in Jewish Social Studies,Vol. 19, No. 3/4 (Jul. – Oct., 1957), pp. 129-140.\nIn the study, which reported a 114.88 mean IQ for the 2083 very young students sampled, the author duly noted its intrinsic limitations.\n“This study is limited to applicants for Day Schools adhering to the principles of the National Commission for Yeshiva Education. This sampling does not claim to represent the entire Jewish school population or even those children attending yeshiva Day Schools with a different educational emphasis.”\nThe 114.88 mean IQ did not represent the entire U.S. Jewish population in 1956 and therefore cannot possibly represent the entire U.S. Jewish population 61 years later. Furthermore,\neven if it did\ncorrectly represent the entire Jewish Ashkenazi population in the USA\nthen\n, it would not do so\nnow\n, due to the fact that what used to be a relatively pure Ashkenazi population is now 44 percent genetically adulterated by the mainstream population due to intermarriage. The current US population of 5,425,000 Jews is now made up of the following genetic groups:\n51.6 Ashkenazi\n40.6 Half-Ashkenazi, Half-European (Which really means three-quarters European ancestry.)\n07.8 Sephardic, Mizrahi, and other backgrounds\nRemember, it’s not the ethnic identity that magically conveys intelligence on an individual, intelligence is primarily a consequence of the individual’s genetic ancestry. Even if individuals in the second category consider themselves to be every bit as Jewish as their immigrant Jewish grandparents in a cultural, ethnic, or religious sense, it is not true from a genetic perspective and the studies on mean Ashkenazi IQ therefore cannot apply to them. I suspect that this is an unintentional focus on identity instead of genetics on Peterson’s part, (an ironic one, given his attack on identity politics), and it is a mistake that he makes it twice. Now, given that the 107.5 mean Ashkenazi IQ given by Lynn is at least possibly correct (unlike the false 115 claim which cannot be) and the 102 mean IQ for white Americans, we can reasonably estimate the Half-Ashkenazi mean IQ to be halfway between the two population groups, or 104.8.\nSince the non-Ashkenazi Jewish mean IQ is somewhere between 84.2 (if A-IQ=115) and 91 (if A-IQ=107.5) given the reported average IQ of Israel being 95, this means that the maximum mean IQ of the U.S. Jewish population is 105.1, 3.1 points higher than the mean White IQ of 102 but below the reported mean East Asian-American IQ of 106.\nOn point 5\nPeterson’s claim that 40.8 percent of the 145+ IQ population in the USA is Jewish is not merely wrong,\nit is off by more than an order of magnitude!\nFirst, he omits the Asian and Black populations, second, he exaggerates the US Jewish population by 10 percent and fails to account for the fact that 48.4 percent of that population is either part-Ashkenazi or non-Ashkenazi, and third, he again makes the mistake of relying upon identity rather than genetics for the White population. Use of the White, Non-Hispanic population is not correct here, because the White Hispanic population is defined as being\ngenetically\nwhite and therefore cannot be excluded from the relevant White population numbers.\nWith a mean IQ of 105.1 and a population of 5,425,000, the standard distribution curve indicates 21,158 Jews with 145+ IQs in the United States. In addition to this, the mean IQ of 102 for the White population of 246,660,710 indicates 517,987 Whites with 145+ IQs, plus another 31,913 equally high-IQ Chinese, Japanese, and Koreans resident in the United States.\nJews therefore account for 3.7 percent of the 145+ IQ set in the United States, not 40.8 percent of it. Jordan Peterson was off by more than an order of magnitude, his argument is completely incorrect, and his public charges of cowardice and “incompetent failure to deal with the world forthrightly” appear to be emotional projections of Peterson’s own cowardice and incompetent failure.\nOn point 6\nI do not know Jordan Peterson, but his incorrect and deceitful arguments and his unfair, unjustified attacks on his critics show him to be an inept and integrity-challenged coward who lacks commitment to the truth. The combination of his sudden success with his observable intellectual ineptitude suggests that he has been elevated by the mainstream media in order to provide a harmless, toothless, and non-Christian alternative to the failed conservative movement of William F. Buckley and the failed neoconservative movement of Bill Kristol and Ben Shapiro.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-30T11:58:57+00:00"
}