{
  "url": "https://voxday.net/2018/04/14/the-symbolic-strike-option/",
  "scraped_at": "2025-12-19T20:57:24.233702",
  "title": "The symbolic strike option",
  "date_display": "April 14, 2018",
  "date_iso": "2018-04-14T11:21:16+00:00",
  "date_from_url": "2018-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears that my expectations were more or less correct. But now that the US has opted for the symbolic strike, what are the implications? The Saker <a href=\"http://www.unz.com/tsaker/what-price-for-collapse-of-the-empire/\">discussed this very possibility</a> three days ago, even as he worried about mutual escalation:</p><blockquote><p>The truth is that Russia would never be a credible threat to the AngloZionist Hegemony if it was not for the innumerable self-inflicted disasters the Empire has been absorbing year after year after year. In reality, Russia is no threat to anybody at all. And even China would not be a threat to the Empire if the latter was not so arrogant, so over-stretched, so ignorant, reckless and incompetent in its actions.</p><p>Let me just give one simple, but stark, example: not only does the US not have anything remotely resembling a consistent foreign policy, it does not even have any ministry of foreign affairs. The Department of State does not deal with diplomacy simply because the US leaders don’t believe in diplomacy as a concept. All the DoS does is issue threats, sanctions, ultimatums, make demands, deliver score-cards (on human rights and the like, of all things!) and explain to the public why the US is almost constantly at war with somebody. That is not “diplomacy” and the likes of Nikki Haley are not diplomats. In fact, the US has no use for International Law either, hence the self-same Nikki Haley openly declaring at a UNSC meeting that the US is willing to ignore the decisions of the UNSC and act in complete violation of the UN Charter. Simply put: thugs have no need for any diplomacy. They don’t understand the concept.</p><p>Just like their Israeli masters and mentors, the Americans have convinced themselves that all they need to be successful on the international scene is to either threaten the use of force or actually use force. This works great (or so it seems) in Gaza or Grenada, but when dealing with China, Russia or Iran, this monomaniacal approach rapidly shows its limitations, especially when your force is really limited to shooting missiles from afar or murdering civilians (neither the US nor Israel nor, for that matter, the KSA has a credible “boots on the ground” capability, hence their reliance on proxies).</p><p>The Empire is failing, fast, and for all the talk about “Animal Assad” or “Rocket Man” being in need of AngloZionist punishment, the stakes are the survival of Hegemony imposed upon mankind at the end of WWII and, again, at the end of the Cold War, and the future of our planet. There cannot be one World Hegemon and a multipolar world order regulated by international law. It’s an either-or situation. And in that sense, this is all much bigger than Syria or even Russia.</p><p>There is still a chance that the AngloZionists will decide to strike Syria symbolically, as they did last year following the previous chemical false flag in Khan Sheikhoun (Trump has now probably tweeted himself into a corner which makes some kind of attack almost inevitable). Should that happen though, we should not celebrate too soon as this will just be a minor course change, the 21st-century anti-Russia Crusade will continue, most likely in the form of a Ukronazi attack on the Donbass.</p></blockquote><p>While I think the Saker misses the point that Trump is not a creature of the Empire and is probably the primary target of its attempts to wield its influence, I suspect that he is correct that the neocons’ anti-Russian campaign will continue, although I expect its focus to shift to Iran next, rather than Ukraine.</p><p>And this commenter has it right: <i>In its essence, U.S. foreign policy boils down to someone’s attempt to establish Satan’s kingdom on earth as per Isaiah 14:13,14.</i><br><i><br/></i>But not just U.S. foreign policy. As another commenter observed, Russia appears to be placing the blame for both recent false flags squarely on Britain. And Britain was also involved in the attacks, which may indicate that any Russian retaliation is going to be directed at British interests.</br></p><p>Israeli military historian Martin van Creveld has a more regional and historical <a href=\"http://www.martin-van-creveld.com/a-thirty-years-war-2/\">take on the situation</a>:</p><blockquote><p>With so many interests, native and foreign, involved, a way out does not seem in sight. Nor can the outcome be foreseen any more than that of the Thirty Years’ War could be four years after the beginning of the conflict, i.e. 1622. In fact there is good reason to believe that the hostilities have just begun. Additional players such as Lebanon and Jordan may well be drawn in. That in turn will almost certainly bring in Israel as well. Some right-wing Israelis, including several ministers, actually dream of such a scenario. They hope that the fall of the Hashemite Dynasty and the disintegration of Jordan will provide them with an opportunity to repeat the events of 1948 by throwing the Palestinians out of the West Bank and into Jordan.</p><p>That, however, is <i>Zukunftmusik</i>, future music as the Germans say. As of the present, the greatest losers are going to be Syria and Iraq. Neither really exists any longer as organized entities, and neither seems to have a future as such an entity. The greatest winner is going to be Iran. Playing the role once reserved for Richelieu, the great 17th century French statesman, the Mullahs are watching the entire vast area from the Persian Gulf to Latakia on the eastern shore of the Mediterranean turn into a maelstrom of conflicting interests they can play with. Nor are they at all sorry to see Turks and Kurds kill each other to their hearts’ contents.</p></blockquote><p>What is most interesting, to me, is that despite their very different perspectives, both the Saker and van Creveld recognize that the “liberal factions” in Syria were false fronts for ISIS.</p><p>UPDATE: Russia Insider <a href=\"https://russia-insider.com/en/trump-blinking-syria-russian-ability-hit-back-too-risky-him/ri23099\">called it correctly</a> ahead of time.</p><blockquote class=\"tr_bq\"><p>The latest news is that now the Russian and American militaries are frantically talking, helped by Israelis (Netanyahu himself!), and the Turks (NATO members after all, but de facto Russian allies), trying to figure a way out of this Mexican standoff. Some experts are saying that it will go down like last time: the Americans will notify the Russians in advance of the targets, the Russians (and most Syrians whom the Russians will inform) will leave them, the strikes will be all for show, and the Russians and Syrians will get on with pulverizing Al Qaeda. The Syrians have already moved their planes to Russian bases, so, no, Syria will not lose its air force. Everyone saves face, and the world moves on.</p></blockquote><p>Interesting, though not surprising, that <a href=\"https://russia-insider.com/en/out-whimper-trump-blinks-delivers-limited-strikes/ri23132\">Mad Dog Mattis is credited</a> as being the voice of reason responsible for the “de-conflicting” on the US side. And I note that he does have blue eyes.</p></div>",
  "content_text": "It appears that my expectations were more or less correct. But now that the US has opted for the symbolic strike, what are the implications? The Saker\ndiscussed this very possibility\nthree days ago, even as he worried about mutual escalation:\nThe truth is that Russia would never be a credible threat to the AngloZionist Hegemony if it was not for the innumerable self-inflicted disasters the Empire has been absorbing year after year after year. In reality, Russia is no threat to anybody at all. And even China would not be a threat to the Empire if the latter was not so arrogant, so over-stretched, so ignorant, reckless and incompetent in its actions.\nLet me just give one simple, but stark, example: not only does the US not have anything remotely resembling a consistent foreign policy, it does not even have any ministry of foreign affairs. The Department of State does not deal with diplomacy simply because the US leaders don’t believe in diplomacy as a concept. All the DoS does is issue threats, sanctions, ultimatums, make demands, deliver score-cards (on human rights and the like, of all things!) and explain to the public why the US is almost constantly at war with somebody. That is not “diplomacy” and the likes of Nikki Haley are not diplomats. In fact, the US has no use for International Law either, hence the self-same Nikki Haley openly declaring at a UNSC meeting that the US is willing to ignore the decisions of the UNSC and act in complete violation of the UN Charter. Simply put: thugs have no need for any diplomacy. They don’t understand the concept.\nJust like their Israeli masters and mentors, the Americans have convinced themselves that all they need to be successful on the international scene is to either threaten the use of force or actually use force. This works great (or so it seems) in Gaza or Grenada, but when dealing with China, Russia or Iran, this monomaniacal approach rapidly shows its limitations, especially when your force is really limited to shooting missiles from afar or murdering civilians (neither the US nor Israel nor, for that matter, the KSA has a credible “boots on the ground” capability, hence their reliance on proxies).\nThe Empire is failing, fast, and for all the talk about “Animal Assad” or “Rocket Man” being in need of AngloZionist punishment, the stakes are the survival of Hegemony imposed upon mankind at the end of WWII and, again, at the end of the Cold War, and the future of our planet. There cannot be one World Hegemon and a multipolar world order regulated by international law. It’s an either-or situation. And in that sense, this is all much bigger than Syria or even Russia.\nThere is still a chance that the AngloZionists will decide to strike Syria symbolically, as they did last year following the previous chemical false flag in Khan Sheikhoun (Trump has now probably tweeted himself into a corner which makes some kind of attack almost inevitable). Should that happen though, we should not celebrate too soon as this will just be a minor course change, the 21st-century anti-Russia Crusade will continue, most likely in the form of a Ukronazi attack on the Donbass.\nWhile I think the Saker misses the point that Trump is not a creature of the Empire and is probably the primary target of its attempts to wield its influence, I suspect that he is correct that the neocons’ anti-Russian campaign will continue, although I expect its focus to shift to Iran next, rather than Ukraine.\nAnd this commenter has it right:\nIn its essence, U.S. foreign policy boils down to someone’s attempt to establish Satan’s kingdom on earth as per Isaiah 14:13,14.\nBut not just U.S. foreign policy. As another commenter observed, Russia appears to be placing the blame for both recent false flags squarely on Britain. And Britain was also involved in the attacks, which may indicate that any Russian retaliation is going to be directed at British interests.\nIsraeli military historian Martin van Creveld has a more regional and historical\ntake on the situation\n:\nWith so many interests, native and foreign, involved, a way out does not seem in sight. Nor can the outcome be foreseen any more than that of the Thirty Years’ War could be four years after the beginning of the conflict, i.e. 1622. In fact there is good reason to believe that the hostilities have just begun. Additional players such as Lebanon and Jordan may well be drawn in. That in turn will almost certainly bring in Israel as well. Some right-wing Israelis, including several ministers, actually dream of such a scenario. They hope that the fall of the Hashemite Dynasty and the disintegration of Jordan will provide them with an opportunity to repeat the events of 1948 by throwing the Palestinians out of the West Bank and into Jordan.\nThat, however, is\nZukunftmusik\n, future music as the Germans say. As of the present, the greatest losers are going to be Syria and Iraq. Neither really exists any longer as organized entities, and neither seems to have a future as such an entity. The greatest winner is going to be Iran. Playing the role once reserved for Richelieu, the great 17th century French statesman, the Mullahs are watching the entire vast area from the Persian Gulf to Latakia on the eastern shore of the Mediterranean turn into a maelstrom of conflicting interests they can play with. Nor are they at all sorry to see Turks and Kurds kill each other to their hearts’ contents.\nWhat is most interesting, to me, is that despite their very different perspectives, both the Saker and van Creveld recognize that the “liberal factions” in Syria were false fronts for ISIS.\nUPDATE: Russia Insider\ncalled it correctly\nahead of time.\nThe latest news is that now the Russian and American militaries are frantically talking, helped by Israelis (Netanyahu himself!), and the Turks (NATO members after all, but de facto Russian allies), trying to figure a way out of this Mexican standoff. Some experts are saying that it will go down like last time: the Americans will notify the Russians in advance of the targets, the Russians (and most Syrians whom the Russians will inform) will leave them, the strikes will be all for show, and the Russians and Syrians will get on with pulverizing Al Qaeda. The Syrians have already moved their planes to Russian bases, so, no, Syria will not lose its air force. Everyone saves face, and the world moves on.\nInteresting, though not surprising, that\nMad Dog Mattis is credited\nas being the voice of reason responsible for the “de-conflicting” on the US side. And I note that he does have blue eyes.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-14T10:21:16+00:00"
}