{
  "url": "https://voxday.net/2018/04/08/video-update/",
  "scraped_at": "2025-12-19T20:56:24.653490",
  "title": "Video update",
  "date_display": "April 8, 2018",
  "date_iso": "2018-04-08T13:41:21+00:00",
  "date_from_url": "2018-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There have been a few recent developments in the Voxiversity department:</p><ul><li>The new camera has been released and I have ordered it. Voxiversity Episode Six should show a distinct improvement in video quality.</li><li>The March video of the month will be released on Tuesday. Episode Five is part 1 of 2 on <i>Christianity and Western Civilization</i>. It will hit on at least one point that should prove at least somewhat surprising.</li><li>YouTube has now removed <i>Episode One: Immigration and War</i> from the Voxiversity channel. They initially restricted it, but as thousands of people were continuing to watch it despite the restrictions, they finally resorted to removing it from the channel listing.</li><li>Even without the deleted video and not counting Facebook, Voxiversity has recorded 46,985 views, for an average of 11,746 views per video. This is but a small fraction of the average views that Jordan Peterson’s (230k) and Stefan Molyneux’s videos (112k) currently receive, but it is a respectable start considering that I have only 1,372 subscribers compared to their 1,018,963 and 766,557, respectively. These things take time and persistence.</li><li>The annual Foundation event will be in Spain this year.</li><li>Now that I am on track with Voxiversity, I will resume doing Periscopes on a regular basis. Since I’m not on Twitter, it’s a good idea to subscribe on Periscope if you want to receive alerts.</li></ul><p>I am reliably informed that the backers are pleased with the start of Voxiversity even though we haven’t fully hit our stride yet. My goal is for the videos to be averaging 25,000 views by the end of 2018 and 85,000 by the end of 2019. If you’d like to be a part of that, <a href=\"https://www.bitchute.com/channel/voxiversity/\">please subscribe</a> to the Bitchute channel or consider <a href=\"https://freestartr.com/project/voxiversity/\">becoming a backer</a>.</p><p>Speaking of video, I’m very pleased to announce that Castalia House has released Chuck Dixon’s zombie novel, <a href=\"https://amzn.to/2qgnG6y\"><i>Gomers</i>, in audio</a>. Narrated by Jon Mollison, it is 6 hours and 33 minutes long. You can listen to the first hour of it <a href=\"https://www.youtube.com/watch?v=EGK396AbHvc\">via YouTube</a>.</p><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/EGK396AbHvc\" width=\"512\"></iframe></div></div>",
  "content_text": "There have been a few recent developments in the Voxiversity department:\nThe new camera has been released and I have ordered it. Voxiversity Episode Six should show a distinct improvement in video quality.\nThe March video of the month will be released on Tuesday. Episode Five is part 1 of 2 on\nChristianity and Western Civilization\n. It will hit on at least one point that should prove at least somewhat surprising.\nYouTube has now removed\nEpisode One: Immigration and War\nfrom the Voxiversity channel. They initially restricted it, but as thousands of people were continuing to watch it despite the restrictions, they finally resorted to removing it from the channel listing.\nEven without the deleted video and not counting Facebook, Voxiversity has recorded 46,985 views, for an average of 11,746 views per video. This is but a small fraction of the average views that Jordan Peterson’s (230k) and Stefan Molyneux’s videos (112k) currently receive, but it is a respectable start considering that I have only 1,372 subscribers compared to their 1,018,963 and 766,557, respectively. These things take time and persistence.\nThe annual Foundation event will be in Spain this year.\nNow that I am on track with Voxiversity, I will resume doing Periscopes on a regular basis. Since I’m not on Twitter, it’s a good idea to subscribe on Periscope if you want to receive alerts.\nI am reliably informed that the backers are pleased with the start of Voxiversity even though we haven’t fully hit our stride yet. My goal is for the videos to be averaging 25,000 views by the end of 2018 and 85,000 by the end of 2019. If you’d like to be a part of that,\nplease subscribe\nto the Bitchute channel or consider\nbecoming a backer\n.\nSpeaking of video, I’m very pleased to announce that Castalia House has released Chuck Dixon’s zombie novel,\nGomers\n, in audio\n. Narrated by Jon Mollison, it is 6 hours and 33 minutes long. You can listen to the first hour of it\nvia YouTube\n.",
  "tags": [
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-08T12:41:21+00:00"
}