{
  "url": "https://voxday.net/2018/04/24/what-were-up-against/",
  "scraped_at": "2025-12-19T20:58:51.775754",
  "title": "What we’re up against",
  "date_display": "April 24, 2018",
  "date_iso": "2018-04-24T14:36:23+00:00",
  "date_from_url": "2018-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hard not to be stirred by the new SJW anthem, <a href=\"https://www.youtube.com/watch?v=CjxugyZCfuw\"><i>THIS IS ME</i></a>. It hits all the right rhetorical chords. Only if you understand what the composer and lyricist are doing, and what their underlying purpose is, can you grasp the pure and unapologetic evil of the song. It is literally a celebration of sin and an assault on Western civilization.</p><p>And yet, most of those who consider themselves firmly anti-SJW will be tempted to deny the possibility of any ill-intent and to defend it, in much the same way they defend <i>Hamilton</i>, <i>Let It Go</i>, and other weapons of cultural mass destruction, despite the fact that the message of hatred, defiance, and opposition is openly declared.</p><p><i>Another round of bullets hits my skin</i><br><i>Well, fire away ’cause today, I won’t let the shame sink in</i><br><i>We are bursting through the barricades and</i><br><i>Reaching for the sun (we are warriors)</i><br><i>Yeah, that’s what we’ve become</i></br></br></br></br></p><p>My first response to hearing the song and seeing the video was to feel the profound and programmed emotional stirring. My second response was to put that emotional effect in intellectual context, and think, <i>kill it with fire</i>. And my third response was to reflect upon how good these evil rhetoricians are, and realize how far we have to go in order to effectively counteract their influence on the mass culture.</p><p>Don’t be surprised if you find yourself feeling oddly defensive of the song. That defensiveness you are feeling is testimony to the power of the rhetoric. But review the lyrics and analyze the imagery. It is powerful cultural programming, but it loses its power and becomes transparent when viewed through coldly dialectic analytical eye. “Reaching for the sun” indeed…..</p><p>Just remember that we’re the ones with the guns. We’re the side with no reason for shame. We are servants of the King and the defenders of the West. They know they are guilty, they know they are damned, and they are openly flaunting their sin. They are warriors and they are at war with our God, our civilization, our faith, and our nation.</p><p>I knew nothing about the lyricist, so I looked him up. Disney, check. Gay, check. Jewish, check. He even admits that “we were tasked with writing an anthemic identity song.” Quelle surprise.</p><p>Whatever. Their satanic hymns will not save them from the justice of the Almighty God in the end. Deus vult.</p></div>",
  "content_text": "It’s hard not to be stirred by the new SJW anthem,\nTHIS IS ME\n. It hits all the right rhetorical chords. Only if you understand what the composer and lyricist are doing, and what their underlying purpose is, can you grasp the pure and unapologetic evil of the song. It is literally a celebration of sin and an assault on Western civilization.\nAnd yet, most of those who consider themselves firmly anti-SJW will be tempted to deny the possibility of any ill-intent and to defend it, in much the same way they defend\nHamilton\n,\nLet It Go\n, and other weapons of cultural mass destruction, despite the fact that the message of hatred, defiance, and opposition is openly declared.\nAnother round of bullets hits my skin\nWell, fire away ’cause today, I won’t let the shame sink in\nWe are bursting through the barricades and\nReaching for the sun (we are warriors)\nYeah, that’s what we’ve become\nMy first response to hearing the song and seeing the video was to feel the profound and programmed emotional stirring. My second response was to put that emotional effect in intellectual context, and think,\nkill it with fire\n. And my third response was to reflect upon how good these evil rhetoricians are, and realize how far we have to go in order to effectively counteract their influence on the mass culture.\nDon’t be surprised if you find yourself feeling oddly defensive of the song. That defensiveness you are feeling is testimony to the power of the rhetoric. But review the lyrics and analyze the imagery. It is powerful cultural programming, but it loses its power and becomes transparent when viewed through coldly dialectic analytical eye. “Reaching for the sun” indeed…..\nJust remember that we’re the ones with the guns. We’re the side with no reason for shame. We are servants of the King and the defenders of the West. They know they are guilty, they know they are damned, and they are openly flaunting their sin. They are warriors and they are at war with our God, our civilization, our faith, and our nation.\nI knew nothing about the lyricist, so I looked him up. Disney, check. Gay, check. Jewish, check. He even admits that “we were tasked with writing an anthemic identity song.” Quelle surprise.\nWhatever. Their satanic hymns will not save them from the justice of the Almighty God in the end. Deus vult.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-24T13:36:23+00:00"
}