{
  "url": "https://voxday.net/2018/04/06/what-he-said-4/",
  "scraped_at": "2025-12-19T20:56:08.485286",
  "title": "What he said",
  "date_display": "April 6, 2018",
  "date_iso": "2018-04-06T12:44:48+00:00",
  "date_from_url": "2018-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An astute comment at Steve Sailer’s about the Kevin Williamson firing:</p><blockquote class=\"tr_bq\"><p>The NR staff currently wailing on twitter about the injustice of dumping a talented writer for being provocative on an independent website can show it’s not just crocodile tears by apologizing to Derbyshire.</p></blockquote><p>Apologizing? They should offer to rehire him with a raise as well. Consider David French’s <a href=\"https://www.nationalreview.com/corner/kevin-williamson-firing-by-the-atlantic-cowardly/\">wailing about “the cowardly firing”</a> with just a few changes to it.</p><blockquote class=\"tr_bq\"><p><i><strike>The Atlantic</strike>National Review</i> has caved to the intolerant mob and fired <strike>Kevin Williamson</strike>John Derbyshire, and in so doing has contributed to a slanderous fiction — that <strike>Kevin</strike>John is so beyond the pale that he has no place at one of the nation’s premiere <strike>mainstream</strike>conservative publications. His millions of words, his countless interviews, and his personal character were reduced to nothing — inconsequential in the face of <strike>deleted tweets and a five-minute podcast dialogue</strike>a single column. Look, I know it’s easy for some to dismiss <strike>Kevin</strike>John’s termination as mere inside-baseball media drama. But it’s more than that. It’s a declaration by one of America’s most powerful <strike>media</strike>conservative entities that it can’t even coexist with a man like <strike>Kevin</strike>John. If he wants to write, he should run along to his <strike>conservative</strike>Alt-Right home. His <strike>new</strike>long-time colleagues simply couldn’t abide his presence.</p></blockquote><p>These cuckservative Never Trumpians simply do not realize that their time is past. They have been exposed for hypocrites and fools. They do not lead opinions, they are led by the Left instead, following it slavishly from one societally destructive policy to the next. Give them a little more time and they’ll be dutifully laying out the conservative cases for cannibalism, child sacrifice, and Satan worship.</p><p>Hence the real reason for their wailing. They know they are losing the right-wing audience that is increasingly rejecting their soft leftism, and now they are beginning to realize that the hard Left has no use for them either.</p><p>The Littlest Chickenhawk <a href=\"https://twitchy.com/sarahd-313035/2018/04/05/must-read-ben-shapiro-drops-stone-cold-truth-about-kevin-williamsons-firing-and-the-left-wont-like-it/\">has been crying about that on Twitter</a>, in addition to issuing the conventional dire warnings of consequences never being the same. He thinks he is one of the “virtuous people” to decide who is acceptable and who is not, to decide who is chased down and disemployed and who is not, intstead of the overt Left.</p><p>This is, we are told, the “stone cold truth” and “the Left won’t like it”.</p><blockquote><p>The Left continues to radically narrow the Overton Window – the spectrum of acceptable discourse. They separate discourse into two categories: the acceptable and the unacceptable. Then they shrink the acceptable down to the opinions located between Hillary Clinton and Bernie Sanders. This necessarily places Kevin Williamson and @bariweiss and @SamHarrisOrg and me and everyone else the Left finds unpalatable into the “excluded” category. But the unacceptable category is already populated by those who are actually unacceptable: alt-right trolls, for example. This means that the population of opinion in the unacceptable category – let’s call them Deplorables, since the Left does – come to be a majority by way of exclusion. Unless, that is, virtuous people who have been excluded by the Left draw distinctions among themselves. Which they should, of course – Kevin and @bariweiss and I and @SamHarrisOrg all get lumped in as Nazis by the Left, but we all fight the actual alt-right Nazis.</p><p>But counting on the virtue of people you’ve just deemed unacceptable not to band together against you is both stupid and unrealistic over time. Which means the Left is doing something unethical here, and deeply dishonest – and something that is likely to foster polarization that results in the mainstreaming of truly gross opinions. This is how you get a reactionary movement willing to countenance alt-right evil: you tell people they’re part of the alt-right when they’re not, and treat them as such no matter how much of a lie that is. What just happened to Kevin Williamson leads conservatives to side with anyone the Left casts out, good or bad, merely as a form of protection. That shouldn’t happen. But it does. And the Left causes it with this bulls***.</p></blockquote><p>Demonstrating, once more, that Ben Shapiro is not of the Right at all, but of the soft Left. That’s why they are always trying to a) disassociate from the Right and b) fix the Left.</p><p>Glenn Reynolds and Kurt Schlichter have similar takes. From Instapundit:</p><blockquote class=\"tr_bq\"><p>What really happened is that women at <i>The Atlantic</i> complained that Kevin’s abortion views upset them. And since making women feel bad about their life choices is a mortal sin, he had to go.</p></blockquote><p>The difference between progressives and conservatives is that progressives assert that making women or blacks or gays or Jews feel bad is sufficient reason to lose your job. Conservatives, on the other hand, argue that only making blacks or Jews feel bad is enough to justify disemployment.</p></div>",
  "content_text": "An astute comment at Steve Sailer’s about the Kevin Williamson firing:\nThe NR staff currently wailing on twitter about the injustice of dumping a talented writer for being provocative on an independent website can show it’s not just crocodile tears by apologizing to Derbyshire.\nApologizing? They should offer to rehire him with a raise as well. Consider David French’s\nwailing about “the cowardly firing”\nwith just a few changes to it.\nThe Atlantic\nNational Review\nhas caved to the intolerant mob and fired\nKevin Williamson\nJohn Derbyshire, and in so doing has contributed to a slanderous fiction — that\nKevin\nJohn is so beyond the pale that he has no place at one of the nation’s premiere\nmainstream\nconservative publications. His millions of words, his countless interviews, and his personal character were reduced to nothing — inconsequential in the face of\ndeleted tweets and a five-minute podcast dialogue\na single column. Look, I know it’s easy for some to dismiss\nKevin\nJohn’s termination as mere inside-baseball media drama. But it’s more than that. It’s a declaration by one of America’s most powerful\nmedia\nconservative entities that it can’t even coexist with a man like\nKevin\nJohn. If he wants to write, he should run along to his\nconservative\nAlt-Right home. His\nnew\nlong-time colleagues simply couldn’t abide his presence.\nThese cuckservative Never Trumpians simply do not realize that their time is past. They have been exposed for hypocrites and fools. They do not lead opinions, they are led by the Left instead, following it slavishly from one societally destructive policy to the next. Give them a little more time and they’ll be dutifully laying out the conservative cases for cannibalism, child sacrifice, and Satan worship.\nHence the real reason for their wailing. They know they are losing the right-wing audience that is increasingly rejecting their soft leftism, and now they are beginning to realize that the hard Left has no use for them either.\nThe Littlest Chickenhawk\nhas been crying about that on Twitter\n, in addition to issuing the conventional dire warnings of consequences never being the same. He thinks he is one of the “virtuous people” to decide who is acceptable and who is not, to decide who is chased down and disemployed and who is not, intstead of the overt Left.\nThis is, we are told, the “stone cold truth” and “the Left won’t like it”.\nThe Left continues to radically narrow the Overton Window – the spectrum of acceptable discourse. They separate discourse into two categories: the acceptable and the unacceptable. Then they shrink the acceptable down to the opinions located between Hillary Clinton and Bernie Sanders. This necessarily places Kevin Williamson and @bariweiss and @SamHarrisOrg and me and everyone else the Left finds unpalatable into the “excluded” category. But the unacceptable category is already populated by those who are actually unacceptable: alt-right trolls, for example. This means that the population of opinion in the unacceptable category – let’s call them Deplorables, since the Left does – come to be a majority by way of exclusion. Unless, that is, virtuous people who have been excluded by the Left draw distinctions among themselves. Which they should, of course – Kevin and @bariweiss and I and @SamHarrisOrg all get lumped in as Nazis by the Left, but we all fight the actual alt-right Nazis.\nBut counting on the virtue of people you’ve just deemed unacceptable not to band together against you is both stupid and unrealistic over time. Which means the Left is doing something unethical here, and deeply dishonest – and something that is likely to foster polarization that results in the mainstreaming of truly gross opinions. This is how you get a reactionary movement willing to countenance alt-right evil: you tell people they’re part of the alt-right when they’re not, and treat them as such no matter how much of a lie that is. What just happened to Kevin Williamson leads conservatives to side with anyone the Left casts out, good or bad, merely as a form of protection. That shouldn’t happen. But it does. And the Left causes it with this bulls***.\nDemonstrating, once more, that Ben Shapiro is not of the Right at all, but of the soft Left. That’s why they are always trying to a) disassociate from the Right and b) fix the Left.\nGlenn Reynolds and Kurt Schlichter have similar takes. From Instapundit:\nWhat really happened is that women at\nThe Atlantic\ncomplained that Kevin’s abortion views upset them. And since making women feel bad about their life choices is a mortal sin, he had to go.\nThe difference between progressives and conservatives is that progressives assert that making women or blacks or gays or Jews feel bad is sufficient reason to lose your job. Conservatives, on the other hand, argue that only making blacks or Jews feel bad is enough to justify disemployment.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-06T11:44:48+00:00"
}