{
  "url": "https://voxday.net/2018/04/27/why-the-dread-ilk-are-so-superior/",
  "scraped_at": "2025-12-19T20:59:13.522911",
  "title": "Why the Dread Ilk are so superior",
  "date_display": "April 27, 2018",
  "date_iso": "2018-04-27T00:57:01+00:00",
  "date_from_url": "2018-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To Jordan Peterson’s milquetoast millennials.</p><p>All I can say is that if I ever screwed up as thoroughly, and as publicly, and demonstrated such a flagrant lack of intellectual integrity as Peterson has, I would damn well expect every single member of the Dread Ilk to jump down my throat with sharpened spurs on.</p><p>Instead, what do we see here? Oh, poor Jordie, it’s just <i>so difficult</i> for him? It’s so <i>hard</i>! How can a philosopher be expected to simply <i>tell the truth</i>? He’s done so much good that we shouldn’t criticize him when he’s running around calling people cowards and failures because they point out the obvious to him! Don’t be mean to Jordie and make him cry!</p><p>Excuses. Complaints. Rationalizations. Whining. Accusing. Anything but holding the man accountable for his deceitful words and his lack of intellectual integrity. I’m unimpressed enough with the man, but it’s his followers that really have me rolling my eyes.</p><p>WTF? Is the guy such a delicate depressed flower that he’s going to kill himself over being called on acting like an uncharitable and uninformed jackass? I thought this was supposed to be the fearsome debater, the formidable man of principle who isn’t afraid to go into the belly of the beast to tell it like it is?</p><p>Let me make one thing clear. I do not give a fragment of a flying fuck about poor little Jordie or any other public figure with whom I am not personally acquainted. I have not read his books nor watched his videos. I care about the truth and the Truth, and I do not cut any intellectual figure any slack in that regard, including myself. I ask for neither quarter nor mercy from anyone, least of all my supporters.</p><p>When I get it wrong and you can conclusively prove it, then show me! If you’re correct, I won’t attack you, much less call you a coward and a failure like Peterson did, to the contrary, I will be grateful to you for helping me get back on the correct path of true understanding.</p></div>",
  "content_text": "To Jordan Peterson’s milquetoast millennials.\nAll I can say is that if I ever screwed up as thoroughly, and as publicly, and demonstrated such a flagrant lack of intellectual integrity as Peterson has, I would damn well expect every single member of the Dread Ilk to jump down my throat with sharpened spurs on.\nInstead, what do we see here? Oh, poor Jordie, it’s just\nso difficult\nfor him? It’s so\nhard\n! How can a philosopher be expected to simply\ntell the truth\n? He’s done so much good that we shouldn’t criticize him when he’s running around calling people cowards and failures because they point out the obvious to him! Don’t be mean to Jordie and make him cry!\nExcuses. Complaints. Rationalizations. Whining. Accusing. Anything but holding the man accountable for his deceitful words and his lack of intellectual integrity. I’m unimpressed enough with the man, but it’s his followers that really have me rolling my eyes.\nWTF? Is the guy such a delicate depressed flower that he’s going to kill himself over being called on acting like an uncharitable and uninformed jackass? I thought this was supposed to be the fearsome debater, the formidable man of principle who isn’t afraid to go into the belly of the beast to tell it like it is?\nLet me make one thing clear. I do not give a fragment of a flying fuck about poor little Jordie or any other public figure with whom I am not personally acquainted. I have not read his books nor watched his videos. I care about the truth and the Truth, and I do not cut any intellectual figure any slack in that regard, including myself. I ask for neither quarter nor mercy from anyone, least of all my supporters.\nWhen I get it wrong and you can conclusively prove it, then show me! If you’re correct, I won’t attack you, much less call you a coward and a failure like Peterson did, to the contrary, I will be grateful to you for helping me get back on the correct path of true understanding.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-04-26T23:57:01+00:00"
}