{
  "url": "https://voxday.net/2021/07/23/al-governor-effectively-resigns/",
  "scraped_at": "2026-01-08T12:43:59.692736",
  "title": "AL governor effectively resigns",
  "date_display": "July 23, 2021",
  "date_iso": "2021-07-23T15:30:04+00:00",
  "date_from_url": "2021-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think we can be confident that Alabama Gov. Kate Ivey <a href=\"https://summit.news/2021/07/23/alabama-governor-its-time-to-blame-unvaccinated-for-covid/\" rel=\"noopener\" target=\"_blank\">will be defeated in the Republican primary</a> next year:</p><blockquote><p>The governor of Alabama stated Thursday that it is “time to start blaming the unvaccinated folks” for rising cases of COVID in the state, adding that “These folks are choosing a horrible lifestyle of self-inflicted pain.”</p><p>Governor Kay Ivey made the comments during a press briefing, declaring “Let’s be crystal clear about this issue. The new cases of Covid are because of unvaccinated folks.”</p><p>“Almost 100{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of the new hospitalizations are with unvaccinated folks. And the deaths are certainly occurring with the unvaccinated folks,” Ivey added.</p><p>She continued, “We got to get folks to take the shot. The vaccine is the greatest weapon we have to fight COVID. There is no question about that the data proves it. I’ve taken the shot back in December, both shots. It’s just the thing to do. The unvaccinated is who we need to focus on.”</p><p>“Folks are supposed to have common sense. But it’s time to start blaming the unvaccinated folks, not the regular folks. It’s the unvaccinated folks that are letting us down,” Ivey further proclaimed.</p></blockquote><p>This is anti-scientific retardery piled upon retardery. It’s already confirmed everywhere from England to Singapore that it is predominantly the <i>vaccinated </i>who are contracting Covid. Either this woman is literally retarded or she’s taken the ticket.</p><p>The vaccine isn’t a weapon against Covid at all. It doesn’t immunise against it. It doesn’t reduce the symptoms. The whole reason for this full-court press from the governments and the media and the sports leagues is because the vaccines don’t work, they aren’t safe, and they aren’t effective. And everyone with even a modicum of common sense and an IQ over 115 knows it.</p><p><b>REMINDER</b>: heard from another medical professional. Covid cases are on the rise in their area, but ALL of the infected are vaccinated. Not some, not most, all of them.</p><p><b>REMINDER</b>: Reuters reports that three-quarters of the Covid cases in Singapore are vaccinated people.</p><p><b>REMINDER</b>: 84 percent of the new cases of COVID in Israel are vaccinated individuals.</p></div>",
  "content_text": "I think we can be confident that Alabama Gov. Kate Ivey\nwill be defeated in the Republican primary\nnext year:\nThe governor of Alabama stated Thursday that it is “time to start blaming the unvaccinated folks” for rising cases of COVID in the state, adding that “These folks are choosing a horrible lifestyle of self-inflicted pain.”\nGovernor Kay Ivey made the comments during a press briefing, declaring “Let’s be crystal clear about this issue. The new cases of Covid are because of unvaccinated folks.”\n“Almost 100{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of the new hospitalizations are with unvaccinated folks. And the deaths are certainly occurring with the unvaccinated folks,” Ivey added.\nShe continued, “We got to get folks to take the shot. The vaccine is the greatest weapon we have to fight COVID. There is no question about that the data proves it. I’ve taken the shot back in December, both shots. It’s just the thing to do. The unvaccinated is who we need to focus on.”\n“Folks are supposed to have common sense. But it’s time to start blaming the unvaccinated folks, not the regular folks. It’s the unvaccinated folks that are letting us down,” Ivey further proclaimed.\nThis is anti-scientific retardery piled upon retardery. It’s already confirmed everywhere from England to Singapore that it is predominantly the\nvaccinated\nwho are contracting Covid. Either this woman is literally retarded or she’s taken the ticket.\nThe vaccine isn’t a weapon against Covid at all. It doesn’t immunise against it. It doesn’t reduce the symptoms. The whole reason for this full-court press from the governments and the media and the sports leagues is because the vaccines don’t work, they aren’t safe, and they aren’t effective. And everyone with even a modicum of common sense and an IQ over 115 knows it.\nREMINDER\n: heard from another medical professional. Covid cases are on the rise in their area, but ALL of the infected are vaccinated. Not some, not most, all of them.\nREMINDER\n: Reuters reports that three-quarters of the Covid cases in Singapore are vaccinated people.\nREMINDER\n: 84 percent of the new cases of COVID in Israel are vaccinated individuals.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-23T14:30:04+00:00"
}