{
  "url": "https://voxday.net/2021/07/29/christianity-is-not-the-tradition-of-the-elders/",
  "scraped_at": "2026-01-08T12:44:53.057497",
  "title": "Christianity is not “the tradition of the elders”",
  "date_display": "July 29, 2021",
  "date_iso": "2021-07-29T14:24:40+00:00",
  "date_from_url": "2021-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Judeochristianity is, and has always been, an ahistorical deception targeting naive American Christians. Unlike Europeans, most 20th-Century Americans knew nothing about Jews or their history, which is why <a href=\"https://books.google.com/ngrams/graph?content=judeochristian&amp;year_start=1800&amp;year_end=2019&amp;corpus=26&amp;smoothing=3&amp;direct_url=t1{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6}3B{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6}2Cjudeochristian{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6}3B{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6}2Cc0#t1{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6}3B{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6}2Cjudeochristian{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6}3B{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6}2Cc0\" rel=\"noopener\" target=\"_blank\">the post-1945 propaganda campaign</a> to convince American Christians that they shared a common faith heritage with Jews rather than a completely antithetical one was mostly successful.</p><p>However, Judaism is not, <i>and has never been</i>, the religion of the Old Testament as followed – however haphazardly – by the Biblical 12 Tribes of Israel. In fact, rabbis such as Stephen Wise, the founder of the NAACP and president of the American Jewish Congress when it declared war on Germany in 1933, customarily referred to the Old Testament religion as “Hebrewism” in order to distinguish it from “the tradition of the elders” which began to take shape in 538 BC. This tradition continued to evolve into and beyond Jesus Christ’s day, and is specifically referred to in the New Testament, as the followers of Jesus Christ rejected it from the literal beginning of Christianity.</p><p><i>“Then the Pharisees and scribes asked him, Why walk not thy disciples according to the tradition of the elders…?”</i></p><p>– Mark 7:5, also Matthew 15:2</p><p>The tradition of the elders was completed in its written form around 475 AD and the oldest extant manuscript dates back to 1342 AD. This tradition is the religion of the Pharisees that is today known as “Judaism” and it has less in common with the religion of the Hebrews of the Old Testament than Mormons and Muslims do with the Greek Orthodox Church.</p><p><i>“The return from Babylon and the adoption of the Babylonian Talmud marked the end of Hebrewism and the beginning of Judaism.”</i></p><p>– Stephen Samuel Wise</p><p><i>The Babylonian Talmud comprises the Mishnah and the Babylonian Gemara, the latter representing the culmination of more than 300 years of analysis of the Mishnah in the Talmudic Academies in Babylonia. The foundations of this process of analysis were laid by Abba Arika (175–247), a disciple of Judah ha-Nasi. Tradition ascribes the compilation of the Babylonian Talmud in its present form to two Babylonian sages, Rav Ashi and Ravina II. Rav Ashi was president of the Sura Academy from 375–427. The work begun by Rav Ashi was completed by Ravina, who is traditionally regarded as the final Amoraic expounder. Accordingly, traditionalists argue that Ravina’s death in 475 is the latest possible date for the completion of the redaction of the Talmud. </i></p><p>– Wikipedia</p><p>Regardless of what you may happen to think of either religion, the fact is that anyone who claims Christianity is an offshoot of Judaism is hopelessly incorrect and his level of knowledge of the subject does not even rise to <a href=\"https://en.wikipedia.org/wiki/Talmud\" rel=\"noopener\" target=\"_blank\">that of Wikipedia</a>.</p><p><i>Jews and Christians differ on every single fundamental principle—even on the meaning of core Scriptural texts. More crucially, Christians rely on the Old Testament for legal delineation; whereas Jews rely solely upon our rabbinic tradition. We never, ever turn to our Bible for legal guidance, only to our rabbinic literature. To suggest that our Sages had anything at all in common with the likes of Jerry Falwell, Jimmy Carter or Pat Robertson is a slap in the face of 2500 years of scholarship.</i></p><p>– The Jewish Press</p></div>",
  "content_text": "Judeochristianity is, and has always been, an ahistorical deception targeting naive American Christians. Unlike Europeans, most 20th-Century Americans knew nothing about Jews or their history, which is why\nthe post-1945 propaganda campaign\nto convince American Christians that they shared a common faith heritage with Jews rather than a completely antithetical one was mostly successful.\nHowever, Judaism is not,\nand has never been\n, the religion of the Old Testament as followed – however haphazardly – by the Biblical 12 Tribes of Israel. In fact, rabbis such as Stephen Wise, the founder of the NAACP and president of the American Jewish Congress when it declared war on Germany in 1933, customarily referred to the Old Testament religion as “Hebrewism” in order to distinguish it from “the tradition of the elders” which began to take shape in 538 BC. This tradition continued to evolve into and beyond Jesus Christ’s day, and is specifically referred to in the New Testament, as the followers of Jesus Christ rejected it from the literal beginning of Christianity.\n“Then the Pharisees and scribes asked him, Why walk not thy disciples according to the tradition of the elders…?”\n– Mark 7:5, also Matthew 15:2\nThe tradition of the elders was completed in its written form around 475 AD and the oldest extant manuscript dates back to 1342 AD. This tradition is the religion of the Pharisees that is today known as “Judaism” and it has less in common with the religion of the Hebrews of the Old Testament than Mormons and Muslims do with the Greek Orthodox Church.\n“The return from Babylon and the adoption of the Babylonian Talmud marked the end of Hebrewism and the beginning of Judaism.”\n– Stephen Samuel Wise\nThe Babylonian Talmud comprises the Mishnah and the Babylonian Gemara, the latter representing the culmination of more than 300 years of analysis of the Mishnah in the Talmudic Academies in Babylonia. The foundations of this process of analysis were laid by Abba Arika (175–247), a disciple of Judah ha-Nasi. Tradition ascribes the compilation of the Babylonian Talmud in its present form to two Babylonian sages, Rav Ashi and Ravina II. Rav Ashi was president of the Sura Academy from 375–427. The work begun by Rav Ashi was completed by Ravina, who is traditionally regarded as the final Amoraic expounder. Accordingly, traditionalists argue that Ravina’s death in 475 is the latest possible date for the completion of the redaction of the Talmud.\n– Wikipedia\nRegardless of what you may happen to think of either religion, the fact is that anyone who claims Christianity is an offshoot of Judaism is hopelessly incorrect and his level of knowledge of the subject does not even rise to\nthat of Wikipedia\n.\nJews and Christians differ on every single fundamental principle—even on the meaning of core Scriptural texts. More crucially, Christians rely on the Old Testament for legal delineation; whereas Jews rely solely upon our rabbinic tradition. We never, ever turn to our Bible for legal guidance, only to our rabbinic literature. To suggest that our Sages had anything at all in common with the likes of Jerry Falwell, Jimmy Carter or Pat Robertson is a slap in the face of 2500 years of scholarship.\n– The Jewish Press",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-29T13:24:40+00:00"
}