{
  "url": "https://voxday.net/2021/07/29/conspiracy-theory-spoiler-alert/",
  "scraped_at": "2026-01-08T12:44:54.912313",
  "title": "Conspiracy theory = spoiler alert",
  "date_display": "July 29, 2021",
  "date_iso": "2021-07-29T14:58:35+00:00",
  "date_from_url": "2021-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Dr. Robert Malone <a href=\"https://meaninginhistory.blogspot.com/2021/07/second-transcript-dr-robert-malone.html\" rel=\"noopener\" target=\"_blank\">saw the ADE problem coming</a> as well as the need for booster shots to try to avoid the breakthrough infections that are affecting an increasing number of the vaccinated:</p><p><b></b></p><blockquote><p><b>Bannon:</b> Does the Pfizer situation with the booster, the difference between a conspiracy theory and a fact is about six months, because remember, a couple of months ago, anybody who would bring up the fact that we’re gonna need a booster, another shot, was a conspiracy theorist. Does that get to your point about the noble lie? Remember, they trashed everybody who even brought it up, because …</p><p><b>Malone: </b>Yeah, Tony [Fauci] jumped on Pfizer right away, right? and said, No, you can’t say that! It’s an amazing demonstration of this in real time, where the leadership of Pfizer says, We’re gonna need a booster in six months because the durability of our vaccines is waning. By the way, that’s exactly the window when Antibody Dependent Enhancement (ADE) becomes the greatest risk, is during the waning phase of a vaccine. The Pfizer guy says, We gotta do this to protect people! Tony jumps on him and says, I didn’t allow you to say that! </p></blockquote><p>The verdict is still out on how bad it’s going to be, but suffice it to say that the skeptics, not the vaccine scientists, have repeatedly proven to be utilizing the more accurate predictive model. </p><p>Speaking of breakthrough infections, the NFL is almost certainly going to have to rethink its Covid policies once the league discovers that vaccinated players are more likely to infect others than unvaccinated players.</p><blockquote><p>Rams offensive line coach Kevin Carberry absent with COVID, despite being vaccinated. Rams coach Sean McVay told reporters on Wednesday that Carberry was absent from practice due to the positive result. For vaccinated players and staff, return to action occurs after a pair of negative tests at least 24 hours apart, with no minimum absence. For unvaccinated players and staff, a mandatory 10-day break remains in place.</p></blockquote></div>",
  "content_text": "Dr. Robert Malone\nsaw the ADE problem coming\nas well as the need for booster shots to try to avoid the breakthrough infections that are affecting an increasing number of the vaccinated:\nBannon:\nDoes the Pfizer situation with the booster, the difference between a conspiracy theory and a fact is about six months, because remember, a couple of months ago, anybody who would bring up the fact that we’re gonna need a booster, another shot, was a conspiracy theorist. Does that get to your point about the noble lie? Remember, they trashed everybody who even brought it up, because …\nMalone:\nYeah, Tony [Fauci] jumped on Pfizer right away, right? and said, No, you can’t say that! It’s an amazing demonstration of this in real time, where the leadership of Pfizer says, We’re gonna need a booster in six months because the durability of our vaccines is waning. By the way, that’s exactly the window when Antibody Dependent Enhancement (ADE) becomes the greatest risk, is during the waning phase of a vaccine. The Pfizer guy says, We gotta do this to protect people! Tony jumps on him and says, I didn’t allow you to say that!\nThe verdict is still out on how bad it’s going to be, but suffice it to say that the skeptics, not the vaccine scientists, have repeatedly proven to be utilizing the more accurate predictive model.\nSpeaking of breakthrough infections, the NFL is almost certainly going to have to rethink its Covid policies once the league discovers that vaccinated players are more likely to infect others than unvaccinated players.\nRams offensive line coach Kevin Carberry absent with COVID, despite being vaccinated. Rams coach Sean McVay told reporters on Wednesday that Carberry was absent from practice due to the positive result. For vaccinated players and staff, return to action occurs after a pair of negative tests at least 24 hours apart, with no minimum absence. For unvaccinated players and staff, a mandatory 10-day break remains in place.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-29T13:58:35+00:00"
}