{
  "url": "https://voxday.net/2021/07/07/freaking-midwits/",
  "scraped_at": "2026-01-08T12:41:11.959697",
  "title": "Freaking midwits",
  "date_display": "July 7, 2021",
  "date_iso": "2021-07-07T13:36:30+00:00",
  "date_from_url": "2021-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you don’t understand the difference between VHQ/UHQ and mere Mensa intelligence, perhaps this might help. Pewdiepie and millions of others have been amused <a href=\"https://youtu.be/eBUubfkc7kg\" rel=\"noopener\" target=\"_blank\">by a video</a> in which the arrogant and credentialed erroneously rate themselves as possessing higher intelligence than a military man who never went to college.</p><p>But no one should have been even remotely surprised, nor should any of the people in the video rated the man lower than everyone else, <i>because the guy literally told them what his tested approximate IQ percentile was </i>during the discussion period.</p><p>He actually tested a little higher on whatever IQ test they took – 97th instead of 94th, which indicates the military test takers are slightly above the norm – but no one should have rated him below third. I would have rated him second, below Asian Harvard guy. And note that even what is generally considered the educational elite peaks at a standard deviation below genuine high IQ levels.</p></div>",
  "content_text": "If you don’t understand the difference between VHQ/UHQ and mere Mensa intelligence, perhaps this might help. Pewdiepie and millions of others have been amused\nby a video\nin which the arrogant and credentialed erroneously rate themselves as possessing higher intelligence than a military man who never went to college.\nBut no one should have been even remotely surprised, nor should any of the people in the video rated the man lower than everyone else,\nbecause the guy literally told them what his tested approximate IQ percentile was\nduring the discussion period.\nHe actually tested a little higher on whatever IQ test they took – 97th instead of 94th, which indicates the military test takers are slightly above the norm – but no one should have rated him below third. I would have rated him second, below Asian Harvard guy. And note that even what is generally considered the educational elite peaks at a standard deviation below genuine high IQ levels.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-07T12:36:30+00:00"
}