{
  "url": "https://voxday.net/2021/07/17/god-is-not-an-idiot/",
  "scraped_at": "2026-01-08T12:42:50.624766",
  "title": "God is not an idiot",
  "date_display": "July 17, 2021",
  "date_iso": "2021-07-17T12:07:02+00:00",
  "date_from_url": "2021-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neither is Jesus Christ. Ruralcounsel is a Boomer who fears the pillow, but would do better to fear Divine judgement on both him and his wicked generation:</p><p><i></i></p><blockquote><p><i>Almost none of them are “sorry my generation let this happen” or even “we did do xyz right which should help.”</i></p><p>Because I’m only responsible for myself, not a generation. So STFU, you witless whining twatwaffle.</p><p><i>It’s nasty “haha well you guys are all going to die in the coming collapse” or “well the millennials and gen z are just as bad as us.”</i></p><p>The first is probably true, and I don’t care about any of you. I’ll be laughing when I see your rotting corpses in the roadside ditch. You deserve it, because you are proving yourselves to be as evil as everyone else. The second is just ridiculous nonsense because judging generations is a idiot’s game.</p></blockquote><p>First, we again see that Boomers reliably reveal themselves to be nasty, disgusting narcissists the moment their generation is criticized. They believe they’re somehow hurting our feelings when they declare “I don’t care about any of you.” But we already knew that, in fact, that very narcissism is one of the primary charges against them. We’ve known they don’t care about anyone else since it became necessary to coin the phrase “latchkey children”. All the Boomer is doing is pleading guilty to the charge without realizing he has done so.</p><p>Second, <i>“He does not leave the guilty unpunished; He punishes the children and their children for the sin of the parents to the third and fourth generation.” </i>So, four generations of Americans are going to suffer for the sins of the Boomers, three of which are already suffering for them, but the Boomer insists that it is wildly unfair to criticize him for the sins of his generation, even when he committed them himself.</p><p>Third,  Jesus said, <i>“This is a wicked generation. It asks for a sign, but none will be given it except the sign of Jonah.”</i></p><p>The insistence that they are only responsible for themselves is one of the Boomers’ favorite lies, which is bizarre in light of the way in which they simply won’t accept responsibility for their own actions. But the way they cling to the lie explains why they never hesitated to eat the seed corn, why they refused to build a better future for their children and grandchildren, and why they are determined to die as hedonists amidst their toys and pleasures and drugs. Each Boomer believed in his heart that life was always and only about himself.</p><p>Reject the Boomer way. </p><p>Get married. Stay married. Have more than four children. Support your own. Build for future generations. Plant the acorns that will become mighty oaks for the benefit of your great-grandchildren, even though you will never sit in their shade. Write down your knowledge. Pass on your experience. Pursue that which lasts. Live for the Good, the Beautiful, and the True. And in doing so, you will move on to the next level surrounded by love and gratitude instead of dying like a Boomer, confused, alone, and smothered by an indifferent stranger.</p></div>",
  "content_text": "Neither is Jesus Christ. Ruralcounsel is a Boomer who fears the pillow, but would do better to fear Divine judgement on both him and his wicked generation:\nAlmost none of them are “sorry my generation let this happen” or even “we did do xyz right which should help.”\nBecause I’m only responsible for myself, not a generation. So STFU, you witless whining twatwaffle.\nIt’s nasty “haha well you guys are all going to die in the coming collapse” or “well the millennials and gen z are just as bad as us.”\nThe first is probably true, and I don’t care about any of you. I’ll be laughing when I see your rotting corpses in the roadside ditch. You deserve it, because you are proving yourselves to be as evil as everyone else. The second is just ridiculous nonsense because judging generations is a idiot’s game.\nFirst, we again see that Boomers reliably reveal themselves to be nasty, disgusting narcissists the moment their generation is criticized. They believe they’re somehow hurting our feelings when they declare “I don’t care about any of you.” But we already knew that, in fact, that very narcissism is one of the primary charges against them. We’ve known they don’t care about anyone else since it became necessary to coin the phrase “latchkey children”. All the Boomer is doing is pleading guilty to the charge without realizing he has done so.\nSecond,\n“He does not leave the guilty unpunished; He punishes the children and their children for the sin of the parents to the third and fourth generation.”\nSo, four generations of Americans are going to suffer for the sins of the Boomers, three of which are already suffering for them, but the Boomer insists that it is wildly unfair to criticize him for the sins of his generation, even when he committed them himself.\nThird,  Jesus said,\n“This is a wicked generation. It asks for a sign, but none will be given it except the sign of Jonah.”\nThe insistence that they are only responsible for themselves is one of the Boomers’ favorite lies, which is bizarre in light of the way in which they simply won’t accept responsibility for their own actions. But the way they cling to the lie explains why they never hesitated to eat the seed corn, why they refused to build a better future for their children and grandchildren, and why they are determined to die as hedonists amidst their toys and pleasures and drugs. Each Boomer believed in his heart that life was always and only about himself.\nReject the Boomer way.\nGet married. Stay married. Have more than four children. Support your own. Build for future generations. Plant the acorns that will become mighty oaks for the benefit of your great-grandchildren, even though you will never sit in their shade. Write down your knowledge. Pass on your experience. Pursue that which lasts. Live for the Good, the Beautiful, and the True. And in doing so, you will move on to the next level surrounded by love and gratitude instead of dying like a Boomer, confused, alone, and smothered by an indifferent stranger.",
  "tags": [
    "BabyBoomers"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-17T11:07:02+00:00"
}