{
  "url": "https://voxday.net/2021/07/22/mailvox-a-dialogue-with-a-doctor/",
  "scraped_at": "2026-01-08T12:43:46.797093",
  "title": "Mailvox: a dialogue with a doctor",
  "date_display": "July 22, 2021",
  "date_iso": "2021-07-22T14:59:52+00:00",
  "date_from_url": "2021-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Dear Sir:</i></p><p><i>Like you, I am disgusted with how this epidemic has been politicized.  After being managed very well medically, it has been denied by those who now plan a Gestapo-like invasion of privacy to confirm vaccination.  (But what would I know as I have only been a doc for a mere half-century and have no brothers in high office), nevertheless, I think your blog is in error.</i></p><p><i>Numbers of my friends have and have relations who have died from this disease. Indeed, 509 ppl have died in the AL since April.</i></p><p><i>While I am no longer practicing since last October due to unrelated medical problems, I nevertheless thought it prudent, at 72, to get the vaccine the day it first became available. I hold no opinion about people who choose not to be vaccinated, just as long as they do not invent stupid narratives in an attempt to get others to validate their poor decision by making worse decisions <a href=\"https://dothaneagle.com/news/local/unvaccinated-account-for-96-of-covid-deaths-in-alabama-since-april-area-vaccine-rates-still/article_8cd3bf46-e427-11eb-8d67-3bb1ada99048.html\" rel=\"noopener\" target=\"_blank\">based on bad data</a>.</i></p><p><i>Walter C Boutwell, MD</i></p><p><i>[Redacted], Alabama</i></p><p>The mRNA fake vaccines are complete bullshit. If you understood either statistics or science, you would know that. If you have an issue with Denninger’s chart, take it up with the reporting agency.</p><p>I could not care less if people over 70 take the vaccines or not. They’re going to die of something sooner or later, and if it makes them feel better, so be it. But it is a heinous crime against humanity to encourage anyone under the age of 40 to take it when it a) won’t protect them against a disease that is very, very unlikely to harm them, b) won’t protect anyone else, and c) will harm them.</p><p>You doctors are not the causal problem, but you’re certainly part of the practical one due to your collective inability to be reasonably skeptical of what the drug companies tell you. For example, how many people did you personally harm by prescribing Vioxx to them? And what’s your excuse going to be when it becomes clear that the Covid vaccines are killing more Americans than guns are?</p><p>Finally, even if 509 people died in Alabama, you know damn well that not a single one of them was a “healthy young person” died of Covid at a Birmingham hospital in 2021. <u>Not one</u>. I happen to know a nurse who worked on the Covid ward of a large hospital during the height of the pandemic, I specifically asked her about the age range of those who were on the ward, and the youngest person she saw who required hospitalization during the entire six-month period was over 65.</p><p><i>Prove any of your contentions.</i></p><p><i><br/></i></p><p>Hush, Boomer.</p><p><i>So, after all the hyperbole and shit storm you are reduced to ad hominem argument. Run away, little blogger. But next time, be seen and not heard.</i></p><div></div><div>What part of “Hush, Boomer” was hard for you to understand? Ask not for whom the pillow fluffs, Herr Doktor Boomer, it fluffs for thee. </div><div></div><div></div><div><b>You know this jackass of an ex-doctor never bothered to ask the pharmaceutical companies to prove any of their contentions when they gave him various substances to inject into his uninformed and unsuspecting patients over the decades. But the minute that someone challenges the obvious absurdities, incoherencies, and obvious falsehoods of the current mainstream narrative, suddenly the Boomer requires a gold-plated, peer-reviewed study published by <i>Nature </i>and personally attested by the sworn statements of no less than six Nobel Prize winners before he’ll even consider the possibility that it’s false.</b></div></div>",
  "content_text": "Dear Sir:\nLike you, I am disgusted with how this epidemic has been politicized.  After being managed very well medically, it has been denied by those who now plan a Gestapo-like invasion of privacy to confirm vaccination.  (But what would I know as I have only been a doc for a mere half-century and have no brothers in high office), nevertheless, I think your blog is in error.\nNumbers of my friends have and have relations who have died from this disease. Indeed, 509 ppl have died in the AL since April.\nWhile I am no longer practicing since last October due to unrelated medical problems, I nevertheless thought it prudent, at 72, to get the vaccine the day it first became available. I hold no opinion about people who choose not to be vaccinated, just as long as they do not invent stupid narratives in an attempt to get others to validate their poor decision by making worse decisions\nbased on bad data\n.\nWalter C Boutwell, MD\n[Redacted], Alabama\nThe mRNA fake vaccines are complete bullshit. If you understood either statistics or science, you would know that. If you have an issue with Denninger’s chart, take it up with the reporting agency.\nI could not care less if people over 70 take the vaccines or not. They’re going to die of something sooner or later, and if it makes them feel better, so be it. But it is a heinous crime against humanity to encourage anyone under the age of 40 to take it when it a) won’t protect them against a disease that is very, very unlikely to harm them, b) won’t protect anyone else, and c) will harm them.\nYou doctors are not the causal problem, but you’re certainly part of the practical one due to your collective inability to be reasonably skeptical of what the drug companies tell you. For example, how many people did you personally harm by prescribing Vioxx to them? And what’s your excuse going to be when it becomes clear that the Covid vaccines are killing more Americans than guns are?\nFinally, even if 509 people died in Alabama, you know damn well that not a single one of them was a “healthy young person” died of Covid at a Birmingham hospital in 2021.\nNot one\n. I happen to know a nurse who worked on the Covid ward of a large hospital during the height of the pandemic, I specifically asked her about the age range of those who were on the ward, and the youngest person she saw who required hospitalization during the entire six-month period was over 65.\nProve any of your contentions.\nHush, Boomer.\nSo, after all the hyperbole and shit storm you are reduced to ad hominem argument. Run away, little blogger. But next time, be seen and not heard.\nWhat part of “Hush, Boomer” was hard for you to understand? Ask not for whom the pillow fluffs, Herr Doktor Boomer, it fluffs for thee.\nYou know this jackass of an ex-doctor never bothered to ask the pharmaceutical companies to prove any of their contentions when they gave him various substances to inject into his uninformed and unsuspecting patients over the decades. But the minute that someone challenges the obvious absurdities, incoherencies, and obvious falsehoods of the current mainstream narrative, suddenly the Boomer requires a gold-plated, peer-reviewed study published by\nNature\nand personally attested by the sworn statements of no less than six Nobel Prize winners before he’ll even consider the possibility that it’s false.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-22T13:59:52+00:00"
}