{
  "url": "https://voxday.net/2021/07/30/minimizing-the-digital/",
  "scraped_at": "2026-01-08T12:45:02.228609",
  "title": "Minimizing the digital",
  "date_display": "July 30, 2021",
  "date_iso": "2021-07-30T12:00:03+00:00",
  "date_from_url": "2021-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Nick Krauser <a href=\"https://krauserpua.com/2021/07/17/digital-minimalism/\" rel=\"noopener\" target=\"_blank\">embraces digital minimalism</a>:</p><blockquote><p>1: “Digital minimalists recognize that cluttering their time and attention with too many devices, apps, and services creates an overall negative cost that can swamp the small benefits that each individual item provides in isolation.”</p><p>2: “Digital minimalists believe that deciding a particular technology supports something they value is only the first step. To truly extract its full potential benefit, it’s necessary to think carefully about how they’ll use the technology.”</p><p>3: “Digital minimalists derive significant satisfaction from their general commitment to being more intentional about how they engage with new technologies. This source of satisfaction is independent of the specific decisions they make and is one of the biggest reasons that minimalism tends to be immensely meaningful to its practitioners.”</p><p>I’d already pared my work down to three hours a week in a Thoreau-esque manner, figuring that what really matters is disposing of my precious life hours on things I enjoy doing. Newport advises that as a digital minimalist “you’ll take walks, talk to friends in person, engage your community, read books, and stare at the clouds.” Well, sir, I think you just described the entirety of my life. </p></blockquote><p>I’ll readily admit to wasting far too much of my time on news-surfing, although it is possible that I need to do it in order to utilize my pattern recognition and anticipate future events. I simply don’t see how one can reasonably hope to filter the useful bits of information from the mass data flow without permitting oneself to be inundated by the data. But if pattern recognition is not one of your gifts, then there really isn’t much point in permitting yourself to be showered with nonsense on a regular basis.</p><p>In any event, I’m pleased to learn that of all the sites that survived Krauser’s brutal paring down, VP was one of the two.</p><p><i>I only read two websites ever, being Vox every day for about ten minutes and then Anonymous Conservative twice a week or so. There’s just nothing on the internet to interest me.</i></p><p>However, I think I’m on track with regards to the taking walks and reading books elements. After indulging in the completion of the Discworld and Laundry novels, I’m now reading <i>The Long Game</i>, which is the mainstream spin on the strategic rise of China at the expense of the USA. I’m reading it for the spin rather than the information it purports to contain, because the rather glaring omission of one of the more important elements involved in the process indicates that the book is intended more as establishing the Official Story than providing substantive analysis.</p></div>",
  "content_text": "Nick Krauser\nembraces digital minimalism\n:\n1: “Digital minimalists recognize that cluttering their time and attention with too many devices, apps, and services creates an overall negative cost that can swamp the small benefits that each individual item provides in isolation.”\n2: “Digital minimalists believe that deciding a particular technology supports something they value is only the first step. To truly extract its full potential benefit, it’s necessary to think carefully about how they’ll use the technology.”\n3: “Digital minimalists derive significant satisfaction from their general commitment to being more intentional about how they engage with new technologies. This source of satisfaction is independent of the specific decisions they make and is one of the biggest reasons that minimalism tends to be immensely meaningful to its practitioners.”\nI’d already pared my work down to three hours a week in a Thoreau-esque manner, figuring that what really matters is disposing of my precious life hours on things I enjoy doing. Newport advises that as a digital minimalist “you’ll take walks, talk to friends in person, engage your community, read books, and stare at the clouds.” Well, sir, I think you just described the entirety of my life.\nI’ll readily admit to wasting far too much of my time on news-surfing, although it is possible that I need to do it in order to utilize my pattern recognition and anticipate future events. I simply don’t see how one can reasonably hope to filter the useful bits of information from the mass data flow without permitting oneself to be inundated by the data. But if pattern recognition is not one of your gifts, then there really isn’t much point in permitting yourself to be showered with nonsense on a regular basis.\nIn any event, I’m pleased to learn that of all the sites that survived Krauser’s brutal paring down, VP was one of the two.\nI only read two websites ever, being Vox every day for about ten minutes and then Anonymous Conservative twice a week or so. There’s just nothing on the internet to interest me.\nHowever, I think I’m on track with regards to the taking walks and reading books elements. After indulging in the completion of the Discworld and Laundry novels, I’m now reading\nThe Long Game\n, which is the mainstream spin on the strategic rise of China at the expense of the USA. I’m reading it for the spin rather than the information it purports to contain, because the rather glaring omission of one of the more important elements involved in the process indicates that the book is intended more as establishing the Official Story than providing substantive analysis.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-30T11:00:03+00:00"
}