{
  "url": "https://voxday.net/2021/07/03/portugals-fake-pandemic/",
  "scraped_at": "2026-01-08T12:40:27.177693",
  "title": "Portugal’s fake pandemic",
  "date_display": "July 3, 2021",
  "date_iso": "2021-07-03T09:42:58+00:00",
  "date_from_url": "2021-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>COVID-19 was never the threat it was portrayed to be, as official Portuguese government documents <a href=\"https://greatgameindia.com/lisbon-court-death-covid-cases/\" rel=\"noopener\" target=\"_blank\">have conclusively proved</a>:</p><blockquote><p>As per a ruling by the Lisbon court, only 0.9{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of ‘verified cases’ died of COVID, numbering 152, and not 17,000 as claimed by the government. The ruling has proved that the government faked COVID-19 death statistics.</p><p>Following a citizen’s petition, a Lisbon court was forced to provide verified COVID-19 mortality data.</p><p>According to the ruling, the number of verified COVID-19 deaths from January 2020 to April 2021 is only 152, not about 17,000 as claimed by government ministries.</p><p>All the “others” died for various reasons, although their PCR test was positive.</p></blockquote><p>Dying with a cold, or diabetes, or high blood pressure, is not the same thing as dying <i>of </i>it. This means that the actual US Covid death toll is probably closer to 5,365 than the 600,000 publicly claimed. In the meantime, it’s getting harder to hide the significant adverse affects of the sterilization shots, as daily flight cancellations rose to 2704, nearly one thousand more than the 1753 first reported one week ago.</p><p>The statistical chicanery is also getting more and more obvious to even the most gullible observer as various 2020 numbers are reported. Somehow, despite the flu having been almost eliminated due to masks and lockdown, the CDC reported more than 50,000 flu deaths in 2020, which is normal for the USA.</p></div>",
  "content_text": "COVID-19 was never the threat it was portrayed to be, as official Portuguese government documents\nhave conclusively proved\n:\nAs per a ruling by the Lisbon court, only 0.9{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of ‘verified cases’ died of COVID, numbering 152, and not 17,000 as claimed by the government. The ruling has proved that the government faked COVID-19 death statistics.\nFollowing a citizen’s petition, a Lisbon court was forced to provide verified COVID-19 mortality data.\nAccording to the ruling, the number of verified COVID-19 deaths from January 2020 to April 2021 is only 152, not about 17,000 as claimed by government ministries.\nAll the “others” died for various reasons, although their PCR test was positive.\nDying with a cold, or diabetes, or high blood pressure, is not the same thing as dying\nof\nit. This means that the actual US Covid death toll is probably closer to 5,365 than the 600,000 publicly claimed. In the meantime, it’s getting harder to hide the significant adverse affects of the sterilization shots, as daily flight cancellations rose to 2704, nearly one thousand more than the 1753 first reported one week ago.\nThe statistical chicanery is also getting more and more obvious to even the most gullible observer as various 2020 numbers are reported. Somehow, despite the flu having been almost eliminated due to masks and lockdown, the CDC reported more than 50,000 flu deaths in 2020, which is normal for the USA.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-03T08:42:58+00:00"
}