{
  "url": "https://voxday.net/2021/07/05/the-case-against-bill-gates/",
  "scraped_at": "2026-01-08T12:40:55.980608",
  "title": "The case against Bill Gates",
  "date_display": "July 5, 2021",
  "date_iso": "2021-07-05T21:17:30+00:00",
  "date_from_url": "2021-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Chris Langan <a href=\"https://gab.com/ChrisLangan/posts/106528805551615791\" rel=\"noopener\" target=\"_blank\">makes it</a> on Gab:</p><blockquote><p>Some people question my use of the phrase “definitive proof” in my previous post regarding Bill Gates and reengineering the coronavirus.</p><p>They have a point – “proof” is often misused in the context of empirical induction, where it does not mean what it means in, say, mathematics. Nevertheless, it is often used in such contexts. Let me try to explain why many people connect Bill Gates to the Covid 19 pandemic and its sequelae. It involves legal concepts like premeditation and “means, motive, and opportunity”.</p><p><b>1. Premeditation: </b>Mr. Gates and his foundation sponsored Event 201 (October 2019), which simulated an outbreak of a “hypothetical” zoonotic coronavirus transmitted from bats to people by way of pigs.</p><p><b>2. Means:</b> Bill Gates was involved in reengineering the coronavirus for various purposes. In the Covid 19 plandemic, an engineered coronavirus was the means of infection. Clearly, if anyone has at his disposal people with the facilities and know-how to, e.g., graft HIV spike proteins onto a coronavirus, it is Mr. Gates.</p><p><b>3. Motive:</b> Mr. Gates has a longstanding concern with overpopulation. He is also heavily involved in experimental vaccine distribution, being connected with a polio catastrophe in India and the “vaccine”-related sterilization of women in Africa.</p><p><b>4. Opportunity: </b>Through his “philanthropy”, Mr. Gates plays a dominant role in the world health system, from research to vaccine development and delivery and everything in between. If the entire pandemic were a 9/11 style false-flag power-grab, no one would be better situated to pull it off.</p><p><b>5. Foreknowledge:</b> Mr. Gates was even the leading proponent for legal immunity for vaccine manufacturers, which suggests foreknowledge that the “vaccines” would turn out to be more deadly and debilitating than “Covid 19” itself.</p><p>We could go on. If you like, you can chalk all this up to accident, coincidence, synchronicity, and righteous concern on the part of an innocent software mogul. But as an exercise in sheer inductive probability, Mr. Gates “looks good enough for it” to make him the lead suspect, and perhaps even to convince a jury.</p></blockquote><p>Gates was just the errand boy, in my opinion. And it appears that he didn’t do a sufficiently good job, since he’s losing some of his privileges and a few of his past indiscretions are suddenly being revealed to the public. </p></div>",
  "content_text": "Chris Langan\nmakes it\non Gab:\nSome people question my use of the phrase “definitive proof” in my previous post regarding Bill Gates and reengineering the coronavirus.\nThey have a point – “proof” is often misused in the context of empirical induction, where it does not mean what it means in, say, mathematics. Nevertheless, it is often used in such contexts. Let me try to explain why many people connect Bill Gates to the Covid 19 pandemic and its sequelae. It involves legal concepts like premeditation and “means, motive, and opportunity”.\n1. Premeditation:\nMr. Gates and his foundation sponsored Event 201 (October 2019), which simulated an outbreak of a “hypothetical” zoonotic coronavirus transmitted from bats to people by way of pigs.\n2. Means:\nBill Gates was involved in reengineering the coronavirus for various purposes. In the Covid 19 plandemic, an engineered coronavirus was the means of infection. Clearly, if anyone has at his disposal people with the facilities and know-how to, e.g., graft HIV spike proteins onto a coronavirus, it is Mr. Gates.\n3. Motive:\nMr. Gates has a longstanding concern with overpopulation. He is also heavily involved in experimental vaccine distribution, being connected with a polio catastrophe in India and the “vaccine”-related sterilization of women in Africa.\n4. Opportunity:\nThrough his “philanthropy”, Mr. Gates plays a dominant role in the world health system, from research to vaccine development and delivery and everything in between. If the entire pandemic were a 9/11 style false-flag power-grab, no one would be better situated to pull it off.\n5. Foreknowledge:\nMr. Gates was even the leading proponent for legal immunity for vaccine manufacturers, which suggests foreknowledge that the “vaccines” would turn out to be more deadly and debilitating than “Covid 19” itself.\nWe could go on. If you like, you can chalk all this up to accident, coincidence, synchronicity, and righteous concern on the part of an innocent software mogul. But as an exercise in sheer inductive probability, Mr. Gates “looks good enough for it” to make him the lead suspect, and perhaps even to convince a jury.\nGates was just the errand boy, in my opinion. And it appears that he didn’t do a sufficiently good job, since he’s losing some of his privileges and a few of his past indiscretions are suddenly being revealed to the public.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-05T20:17:30+00:00"
}