{
  "url": "https://voxday.net/2021/07/09/the-destruction-of-literature/",
  "scraped_at": "2026-01-08T12:41:30.593634",
  "title": "The destruction of literature",
  "date_display": "July 9, 2021",
  "date_iso": "2021-07-09T12:09:33+00:00",
  "date_from_url": "2021-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve always been bewildered by the supposed excellence of Ernest Hemingway. Like later supposedly great writers like Saul Bellow and Joseph Heller, and earlier writers such as James Joyce, I’ve always found his work to fall considerably short of the regard in which it is supposedly held. Miles Mathis explains <a href=\"http://mileswmathis.com/papa.pdf\" rel=\"noopener\" target=\"_blank\">why Hemingway’s overrated work has been pushed so hard</a>, as the usual suspects apparently did to literature what they’ve done to painting, science, and more recently, comics and computer games:</p><div><div></div></div><blockquote><div><div>Again, we can’t understand without knowing who is behind Pound.  The picture above tells us, literally, since the man standing behind Pound is our clue.  Yes, we finally have clear evidence in 1924, when Pound secures funding for Ford Madox Ford’s Transatlantic Review—which contained works from Pound, Joyce, Stein, and Hemingway.  We are told the money came from John Quinn.  Who is John Quinn?  According to Wikipedia, </div><div></div><div><i>He worked for British Intelligence services before, during and after World War I.  In this role he acted as case officer for, among others, Aleister Crowley, who was an agent provocateur posing as an Irish nationalist in order to infiltrate anti-British groups of Irish and Germans in the United States.</i></div><div></div><div>Wow.  We have, at one swoop, connected Hemingway, Crowley, Stein, Joyce, Ford and Pound to Intelligence, and we have done it without leaving the whitewashed pages of Wikipedia.  We also have to look back to <i>A Moveable Feast</i> in a new way.  Aleister Crowley makes an appearance in <i>A Moveable Feast</i>, to the astonishment of most people.  It is only a cameo, but still.  Why would Hemingway  mention in 1957 passing by Crowley on the street in the early 1920’s?  Of all the things he experienced in that period, of all the things mentioned in “his notebooks saved in old steamer trunks,” why that mention of Crowley?</div></div><div></div><div><div>The role of Intelligence in the rise of Modernism has been missed by most people for the same reason I missed it for so long: we forget how far back the Agencies go.  Most people know the CIA wasn’t created until 1947, and since it came out of the Office of Strategic Service—which was an agency of the Second World War, we then take Intelligence only back to 1938 or so.  But there was Intelligence in the Civil War and the Revolutionary War.  There was Intelligence in Caesar’s armies and in the armies of Alexander.  Like prostitution, it is as old as the race itself.  Cain and Abel were spying on one another, and plotting, and before that the snake—the first agent—was watching Eve from the tree, trying to insert himself in the place given to Adam.  </div><div></div><div>Although the evidence for the central role of Intelligence has always been there, it of course hasn’t been promoted, and it has retreated into the shadows.  The evidence can even be found in the works of the Moderns themselves, as I showed previously  with Burrough’s Naked Lunch.  The same is easy to show with <i>Ulysses </i>and <i>Portrait of the Artist</i>, in which Joyce talks about the British spies in Dublin Castle.</div><div></div><div>And in <i>Dubliners </i>(p. 96), Mr. Henchy “knows for a fact” that half the Radical Nationalists in Dublin are “in the pay of the Castle.”  Who would have thought that Joyce himself was among them, or soon would be?  I haven’t (yet) found any evidence Joyce was subverting the Irish causes, but since he was certainly promoting the Modernist causes, he was in the service of one of the main Intelligence programs of his time.  Since this program served the rich families at the expense of art history, we see that Joyce is an anti-hero in a different way that you have thought.  Although he showed real early talent in both poetry and novel writing, he chose instead to sell out his birthright as a real artist for the money and fame of a bought one.  Ulysses is the public record of that sell-out.  </div></div></blockquote><p>I will confess to being a little disappointed to learn that F. Scott Fitzgerald was also manufactured, as I think quite a bit of his work is genuinely good, although I can’t say that I’m shocked. There was always something a little bit odd about his career, and the idea that he sold out explains his very rapid early success, as well as his apparent self-hatred and decline into alcoholism. And it’s certainly in keeping with the dangerous combination of his grandiose ambitions with his insecurity complex.</p><p>But I would be remiss if I didn’t quote this glorious dismissal of Hemingway from <a href=\"http://mileswmathis.com/fitz.pdf\" rel=\"noopener\" target=\"_blank\">the Fitzgerald paper</a>:</p><blockquote><p>These people will steer you toward anything but the truth.  You are allowed to theorize about anything but the truth, that being that Hemingway was a shitty writer who wrote boring books, promoted fascist causes, and whose fame rests on a mountain of lies.  </p></blockquote><div><div></div></div></div>",
  "content_text": "I’ve always been bewildered by the supposed excellence of Ernest Hemingway. Like later supposedly great writers like Saul Bellow and Joseph Heller, and earlier writers such as James Joyce, I’ve always found his work to fall considerably short of the regard in which it is supposedly held. Miles Mathis explains\nwhy Hemingway’s overrated work has been pushed so hard\n, as the usual suspects apparently did to literature what they’ve done to painting, science, and more recently, comics and computer games:\nAgain, we can’t understand without knowing who is behind Pound.  The picture above tells us, literally, since the man standing behind Pound is our clue.  Yes, we finally have clear evidence in 1924, when Pound secures funding for Ford Madox Ford’s Transatlantic Review—which contained works from Pound, Joyce, Stein, and Hemingway.  We are told the money came from John Quinn.  Who is John Quinn?  According to Wikipedia,\nHe worked for British Intelligence services before, during and after World War I.  In this role he acted as case officer for, among others, Aleister Crowley, who was an agent provocateur posing as an Irish nationalist in order to infiltrate anti-British groups of Irish and Germans in the United States.\nWow.  We have, at one swoop, connected Hemingway, Crowley, Stein, Joyce, Ford and Pound to Intelligence, and we have done it without leaving the whitewashed pages of Wikipedia.  We also have to look back to\nA Moveable Feast\nin a new way.  Aleister Crowley makes an appearance in\nA Moveable Feast\n, to the astonishment of most people.  It is only a cameo, but still.  Why would Hemingway  mention in 1957 passing by Crowley on the street in the early 1920’s?  Of all the things he experienced in that period, of all the things mentioned in “his notebooks saved in old steamer trunks,” why that mention of Crowley?\nThe role of Intelligence in the rise of Modernism has been missed by most people for the same reason I missed it for so long: we forget how far back the Agencies go.  Most people know the CIA wasn’t created until 1947, and since it came out of the Office of Strategic Service—which was an agency of the Second World War, we then take Intelligence only back to 1938 or so.  But there was Intelligence in the Civil War and the Revolutionary War.  There was Intelligence in Caesar’s armies and in the armies of Alexander.  Like prostitution, it is as old as the race itself.  Cain and Abel were spying on one another, and plotting, and before that the snake—the first agent—was watching Eve from the tree, trying to insert himself in the place given to Adam.\nAlthough the evidence for the central role of Intelligence has always been there, it of course hasn’t been promoted, and it has retreated into the shadows.  The evidence can even be found in the works of the Moderns themselves, as I showed previously  with Burrough’s Naked Lunch.  The same is easy to show with\nUlysses\nand\nPortrait of the Artist\n, in which Joyce talks about the British spies in Dublin Castle.\nAnd in\nDubliners\n(p. 96), Mr. Henchy “knows for a fact” that half the Radical Nationalists in Dublin are “in the pay of the Castle.”  Who would have thought that Joyce himself was among them, or soon would be?  I haven’t (yet) found any evidence Joyce was subverting the Irish causes, but since he was certainly promoting the Modernist causes, he was in the service of one of the main Intelligence programs of his time.  Since this program served the rich families at the expense of art history, we see that Joyce is an anti-hero in a different way that you have thought.  Although he showed real early talent in both poetry and novel writing, he chose instead to sell out his birthright as a real artist for the money and fame of a bought one.  Ulysses is the public record of that sell-out.\nI will confess to being a little disappointed to learn that F. Scott Fitzgerald was also manufactured, as I think quite a bit of his work is genuinely good, although I can’t say that I’m shocked. There was always something a little bit odd about his career, and the idea that he sold out explains his very rapid early success, as well as his apparent self-hatred and decline into alcoholism. And it’s certainly in keeping with the dangerous combination of his grandiose ambitions with his insecurity complex.\nBut I would be remiss if I didn’t quote this glorious dismissal of Hemingway from\nthe Fitzgerald paper\n:\nThese people will steer you toward anything but the truth.  You are allowed to theorize about anything but the truth, that being that Hemingway was a shitty writer who wrote boring books, promoted fascist causes, and whose fame rests on a mountain of lies.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-09T11:09:33+00:00"
}