{
  "url": "https://voxday.net/2021/07/10/water-and-gummi-bears/",
  "scraped_at": "2026-01-08T12:41:37.497060",
  "title": "Water and Gummi Bears",
  "date_display": "July 10, 2021",
  "date_iso": "2021-07-10T11:00:07+00:00",
  "date_from_url": "2021-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The central vaccination center in Vienna sees dozens of young people <a href=\"https://freewestmedia.com/2021/07/07/vienna-up-to-50-people-per-day-collapse-after-vaccination/\" rel=\"noopener\" target=\"_blank\">collapsing every day</a>:</p><blockquote><p>The Austria Center Vienna (Donaustadt) is of crucial importance for the city’s vaccination strategy. Around 5000 Viennese are vaccinated against the Corona here every day. But unfortunately there are always side effects. An Impfstrasse employee told Austrian daily <i>Heute </i>that around 50 people per day collapsed last weekend. Almost all of them had previously received a dose of the Johnson &amp; Johnson vaccine.</p><p>Younger people were particularly affected; Johnson &amp; Johnson is used from the age of 18. The city confirmed this, but spoke of “30 to 40” people affected for the whole weekend. Unfortunately, it happens again and again that “a few” collapse after the vaccination. That is why the rest period after vaccination is said to be important. The paramedics of the Samaritan Association were then instructed to pay particular attention to “young and slim” people.</p><p>The reason is that these people in particular drink and eat too little before the vaccination. The city is now distributing water and gummy bears.</p></blockquote><p>They’re just dehydrated. And when people start collapsing permanently over the next few weeks and months, no doubt their deaths will be blamed on gluten allergies or desucrosation. </p><p>Seriously, they’re trying to push “food allergies” as a substitute explanation for why otherwise healthy vaccinated people <a href=\"https://thecovidblog.com/2021/07/08/ayesha-k-faines-35-year-old-journalist-and-grapevine-show-panelist-dead-14-weeks-after-experimental-pfizer-mrna-shot/\" rel=\"noopener\" target=\"_blank\">are dropping dead</a>:</p><blockquote><p>Ayesha K. Faines: 35-year-old journalist and “Grapevine Show” panelist dead 14 weeks after experimental Pfizer mRNA shot. Family tells Faines’ former employer, News4Jax, that she died from “food allergies”</p></blockquote><p>This may sound credible at first glance, but it isn’t in light of the fact that between 5 and 15 people die from severe reactions to food allergies on an annual basis. It’s still early days, but it won’t surprise me to subsequently learn that we have been witnessing the greatest crime against humanity ever committed. </p><p> </p></div>",
  "content_text": "The central vaccination center in Vienna sees dozens of young people\ncollapsing every day\n:\nThe Austria Center Vienna (Donaustadt) is of crucial importance for the city’s vaccination strategy. Around 5000 Viennese are vaccinated against the Corona here every day. But unfortunately there are always side effects. An Impfstrasse employee told Austrian daily\nHeute\nthat around 50 people per day collapsed last weekend. Almost all of them had previously received a dose of the Johnson & Johnson vaccine.\nYounger people were particularly affected; Johnson & Johnson is used from the age of 18. The city confirmed this, but spoke of “30 to 40” people affected for the whole weekend. Unfortunately, it happens again and again that “a few” collapse after the vaccination. That is why the rest period after vaccination is said to be important. The paramedics of the Samaritan Association were then instructed to pay particular attention to “young and slim” people.\nThe reason is that these people in particular drink and eat too little before the vaccination. The city is now distributing water and gummy bears.\nThey’re just dehydrated. And when people start collapsing permanently over the next few weeks and months, no doubt their deaths will be blamed on gluten allergies or desucrosation.\nSeriously, they’re trying to push “food allergies” as a substitute explanation for why otherwise healthy vaccinated people\nare dropping dead\n:\nAyesha K. Faines: 35-year-old journalist and “Grapevine Show” panelist dead 14 weeks after experimental Pfizer mRNA shot. Family tells Faines’ former employer, News4Jax, that she died from “food allergies”\nThis may sound credible at first glance, but it isn’t in light of the fact that between 5 and 15 people die from severe reactions to food allergies on an annual basis. It’s still early days, but it won’t surprise me to subsequently learn that we have been witnessing the greatest crime against humanity ever committed.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-10T10:00:07+00:00"
}