{
  "url": "https://voxday.net/2021/07/07/wednesday-am-arktoons-5/",
  "scraped_at": "2026-01-08T12:41:10.407811",
  "title": "Wednesday AM Arktoons",
  "date_display": "July 7, 2021",
  "date_iso": "2021-07-07T10:18:51+00:00",
  "date_from_url": "2021-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>ALT★HERO</b> Episode 11: <a href=\"https://www.arkhaven.com/comics/superhero/alt-hero\" rel=\"noopener\" target=\"_blank\">Fudgesticks!</a></p><p><b>DEUS VULT</b> Episode 11: <a href=\"https://www.arkhaven.com/comics/fantasy/deus-vult\" rel=\"noopener\" target=\"_blank\">Bow Before the Demon King – or Die</a></p><p>This marks the final episode of <i>Deus Vult</i> for the time being. Next week it will be replaced by <i>Something Big</i>, a brand new series from Chuck Dixon and Frank Fosco. And if you need a reminder of why Arktoons is important and why it is worth subscribing to support it, this news that no comic or cartoon from the past <a href=\"https://cosmicbook.news/he-man-black-kevin-smith-masters-universe-revelation\" rel=\"noopener\" target=\"_blank\">is safe from SJW convergence</a> should suffice.</p><blockquote><p>It’s learned that He-Man is now black in the Kevin Smith <i>Masters of The Universe: Revelation</i> series coming to Netflix where it has also become known they passed on using an original black character.</p><p>Before we continue, it should actually be noted all the ideas for the <i>Masters of the Universe: Revelation</i> series are coming from Netflix exec Ted Biaselli, as Smith was simply hired to develop and promote the series (Kevin Smith isn’t even a He-Man fan).</p><p>So apparently Ted Biaselli’s big idea for He-Man is to make the character as woke as possible, as it already appears Teela will become the new He-Man based on the trailers and official series descriptions.</p><p>But Ted Biaselli didn’t stop there as He-Man’s grandfather has been race-swapped, changed from a white dude to a black dude.</p><p>Recall how I have said Hollywood would never allow He-Man – a blond white male – to be made out to look good in the series, and now we see the character is changed to have black ancestors and get replaced by the woke Teela.</p></blockquote><p>The Hellmouth is determined to eradicate every last vestige of the West, right down to <i>The Iliad</i>, <i>Beowulf</i>, and the Bible. So it falls to us to maintain our stories, defend our culture, and make new ones. When you subscribe to Arktoons, you help us do that.</p><p>And they’re not going to stop <a href=\"https://www.insider.com/queer-women-transgender-nonbinary-kids-animation-cartoons-2021-6\" rel=\"noopener\" target=\"_blank\">with mere blackwashing and race-swapping</a>:</p><blockquote><p>The rise of gender-diverse representation isn’t a coincidence. Shows created and run by queer women, trans, and nonbinary showrunners are largely responsible for the influx of nonbinary and trans characters in kids’ animation. Among the 10 animated kids series that feature the most LGBTQ characters, trans, nonbinary and queer creators account for 65{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of that representation alone.</p></blockquote></div>",
  "content_text": "ALT★HERO\nEpisode 11:\nFudgesticks!\nDEUS VULT\nEpisode 11:\nBow Before the Demon King – or Die\nThis marks the final episode of\nDeus Vult\nfor the time being. Next week it will be replaced by\nSomething Big\n, a brand new series from Chuck Dixon and Frank Fosco. And if you need a reminder of why Arktoons is important and why it is worth subscribing to support it, this news that no comic or cartoon from the past\nis safe from SJW convergence\nshould suffice.\nIt’s learned that He-Man is now black in the Kevin Smith\nMasters of The Universe: Revelation\nseries coming to Netflix where it has also become known they passed on using an original black character.\nBefore we continue, it should actually be noted all the ideas for the\nMasters of the Universe: Revelation\nseries are coming from Netflix exec Ted Biaselli, as Smith was simply hired to develop and promote the series (Kevin Smith isn’t even a He-Man fan).\nSo apparently Ted Biaselli’s big idea for He-Man is to make the character as woke as possible, as it already appears Teela will become the new He-Man based on the trailers and official series descriptions.\nBut Ted Biaselli didn’t stop there as He-Man’s grandfather has been race-swapped, changed from a white dude to a black dude.\nRecall how I have said Hollywood would never allow He-Man – a blond white male – to be made out to look good in the series, and now we see the character is changed to have black ancestors and get replaced by the woke Teela.\nThe Hellmouth is determined to eradicate every last vestige of the West, right down to\nThe Iliad\n,\nBeowulf\n, and the Bible. So it falls to us to maintain our stories, defend our culture, and make new ones. When you subscribe to Arktoons, you help us do that.\nAnd they’re not going to stop\nwith mere blackwashing and race-swapping\n:\nThe rise of gender-diverse representation isn’t a coincidence. Shows created and run by queer women, trans, and nonbinary showrunners are largely responsible for the influx of nonbinary and trans characters in kids’ animation. Among the 10 animated kids series that feature the most LGBTQ characters, trans, nonbinary and queer creators account for 65{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of that representation alone.",
  "tags": [
    "Hellmouth"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-07T09:18:51+00:00"
}