{
  "url": "https://voxday.net/2021/07/26/when-vaxxing-makes-it-worse/",
  "scraped_at": "2026-01-08T12:44:24.444622",
  "title": "When vaxxing makes it worse",
  "date_display": "July 26, 2021",
  "date_iso": "2021-07-26T12:00:03+00:00",
  "date_from_url": "2021-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wish I could say that it’s astonishing how after a) coming down with Covid despite being vaccinated twice with the Pfizer not-vaccine and b) infecting his seven-year-old daughter, an NFL analyst somehow concludes this means it’s really important for everyone to be vaccinated. But I can’t, because it’s just more evidence that Most People Are Idiots.</p><blockquote><p>NFL Network’s Rich Eisen got COVID earlier this month despite being fully vaccinated with the double Pfizer shot early this year. He and his wife were in Boston on July 12, about to leave for a week’s vacation in Italy, when he felt a tickle in the back of his throat. Nothing serious. But he had to be tested to travel to Italy, and the test came back positive. A second test came back positive. Eisen had to quarantine in a Boston hotel room for 10 days. His wife, who tested negative, flew back to California—where their 7-year-old daughter was newly positive for COVID. Within a couple of days, Eisen told me, “The symptoms presented like a freight train—night sweats, chills, loss of appetite,” he said. “It hit me pretty hard for three or four days.”</p><p>Many would look at Eisen and say, What good is the vaccine if you get the disease after being vaccinated? Eisen looks at it this way:</p><p>“The vaccine is not 100 percent effective in preventing COVID,” he told me Saturday. “But it is very effective in keeping you out of the hospital—or worse. I believe getting the vaccine kept me off a ventilator. And getting the vaccine will not only improve your chances of not being infected, but if you’re infected, decrease your chance of dying.</p><p>“All I’ve heard from the unvaccinated is it’s time to just live with it and get back to normal. Well, I tried that, and I ended up in quarantine with COVID, and most likely I passed it to my 7-year-old daughter. So you not getting the vaccine makes COVID more prevalent in society, and could cause the next variant to be worse, and to pierce my immunity.”</p><p>Eisen’s voice was rising. “My wife and I, as parents, are supposed to protect our children. My 7-year-old gets it, probably from me, after I was vaccinated,” he said. “So now . . . it’s personal for me.”</p></blockquote><p>These utterly ignorant idiots don’t understand that it is the flawed vaccines that are causing the next variant to be worse, not the unvaccinated. If it had been left to progress naturally through the population, the virus would have become more infectious and less harmful, like every other virus in history. It’s already doing that, which is why the Delta variant is estimated to be 10x less lethal than the original one.</p><p>However, due to the Antibody Dependent Enhancement problem that is derived from how the mRNA vaccines operate, even these less lethal variants will be dangerous to the vaccinated. This is a problem that scientists were concerned about when the vaccines were first released; <a href=\"https://blogs.sciencemag.org/pipeline/archives/2021/02/12/antibody-dependent-enhancement-and-the-coronavirus-vaccines\" rel=\"noopener\" target=\"_blank\">read this selection from an article published in February 2021 very carefully</a>, then think about its implications in light of the Eisen case.</p><blockquote><p>The Moderna and Pfizer/BioNTech vaccines have been rolled out in many parts of the world, along with the AstraZeneca/Oxford, Gamaleya, and CanSino adenovirus vector vaccines. Those look to be joined soon by J&amp;J’s adenovirus vector and Novavax’s recombinant protein subunit vaccines, and likely more after that. So here’s the key question: did any of these show ADE hints during their development? And are any of them showing signs of it now?</p><p>The short answers: they did not. And they are not. Antibody-dependent enhancement was specifically tested for in the animal models as these candidates were being developed (re-exposure of vaccinated animals to coronavirus to see how protective the vaccine was). And no cases of more severe disease were seen – I’ve gone back through the reported preclinical studies, and I don’t think I’ve missed one, and what I’m seeing is not one single case of ADE for any of them. Indeed, as mentioned above, if something like that had shown up, it would have immediately released a bucket of clin-dev and regulatory sand into the gears of the whole project.</p><p>How about the human clinical trials? Again, no signs of ADE were seen. This is a bit less definitive, since we did not run deliberate “Here, have another blast of virus” challenges on the human participants the way we did in the preclinical studies. But at the same time, these trial participants were out there in the real world being monitored for signs of infection. The dramatic plots of the data after even one dose of the vaccines speak for themselves: the trials did hardly saw people getting infected at all after vaccination, and most certainly not with even more severe disease. To the contrary: one of the big features of the vaccines is that across the board they seem to almost totally wipe out the appearance of severe coronavirus symptoms. We’re still collecting data on transmissibility after vaccination and so on (things are looking good, though), <i>but what seems to be beyond doubt is that the vaccinated subjects, over and over, show up with no severe coronavirus cases and no hospitalizations.</i></p><p>That is the opposite of what you would expect if ADE were happening. Remember, the bad thing about antibody-dependent enhancement is that it leads to more severe disease when you’re exposed again to the pathogen (or when you’re exposed after being vaccinated for it). And we’re just not seeing that. At all. </p></blockquote><p>They weren’t seeing it back in February. But they certainly are starting to see it now. The best case is that it’s just variant cases against which the vaccines are no good, like getting the flu after getting a flu shot designed for a different flu strain. The worse case is that the increasing number of vaccinated subjects being hospitalized with Covid is evidence of ADE. The worst case, of course, is CASE NIGHTMARE KITTY, which would result in the death of everyone who is infected by Covid after being vaccinated, but fortunately, that does not appear to be the situation.</p><p>However, an older article by the same author, from December 2020, <a href=\"https://blogs.sciencemag.org/pipeline/archives/2020/12/18/antibody-dependent-enhancement\" rel=\"noopener\" target=\"_blank\">described the main worry</a> as something that is confirmed to have been observed.</p><blockquote><p>I would say that the main worry for any ADE effects would be if the coronavirus mutates to the point that the antibodies generated by the current vaccines become non-neutralizing. And honestly, I don’t see that happening.</p></blockquote><p>Except it already has. </p><p> </p></div>",
  "content_text": "I wish I could say that it’s astonishing how after a) coming down with Covid despite being vaccinated twice with the Pfizer not-vaccine and b) infecting his seven-year-old daughter, an NFL analyst somehow concludes this means it’s really important for everyone to be vaccinated. But I can’t, because it’s just more evidence that Most People Are Idiots.\nNFL Network’s Rich Eisen got COVID earlier this month despite being fully vaccinated with the double Pfizer shot early this year. He and his wife were in Boston on July 12, about to leave for a week’s vacation in Italy, when he felt a tickle in the back of his throat. Nothing serious. But he had to be tested to travel to Italy, and the test came back positive. A second test came back positive. Eisen had to quarantine in a Boston hotel room for 10 days. His wife, who tested negative, flew back to California—where their 7-year-old daughter was newly positive for COVID. Within a couple of days, Eisen told me, “The symptoms presented like a freight train—night sweats, chills, loss of appetite,” he said. “It hit me pretty hard for three or four days.”\nMany would look at Eisen and say, What good is the vaccine if you get the disease after being vaccinated? Eisen looks at it this way:\n“The vaccine is not 100 percent effective in preventing COVID,” he told me Saturday. “But it is very effective in keeping you out of the hospital—or worse. I believe getting the vaccine kept me off a ventilator. And getting the vaccine will not only improve your chances of not being infected, but if you’re infected, decrease your chance of dying.\n“All I’ve heard from the unvaccinated is it’s time to just live with it and get back to normal. Well, I tried that, and I ended up in quarantine with COVID, and most likely I passed it to my 7-year-old daughter. So you not getting the vaccine makes COVID more prevalent in society, and could cause the next variant to be worse, and to pierce my immunity.”\nEisen’s voice was rising. “My wife and I, as parents, are supposed to protect our children. My 7-year-old gets it, probably from me, after I was vaccinated,” he said. “So now . . . it’s personal for me.”\nThese utterly ignorant idiots don’t understand that it is the flawed vaccines that are causing the next variant to be worse, not the unvaccinated. If it had been left to progress naturally through the population, the virus would have become more infectious and less harmful, like every other virus in history. It’s already doing that, which is why the Delta variant is estimated to be 10x less lethal than the original one.\nHowever, due to the Antibody Dependent Enhancement problem that is derived from how the mRNA vaccines operate, even these less lethal variants will be dangerous to the vaccinated. This is a problem that scientists were concerned about when the vaccines were first released;\nread this selection from an article published in February 2021 very carefully\n, then think about its implications in light of the Eisen case.\nThe Moderna and Pfizer/BioNTech vaccines have been rolled out in many parts of the world, along with the AstraZeneca/Oxford, Gamaleya, and CanSino adenovirus vector vaccines. Those look to be joined soon by J&J’s adenovirus vector and Novavax’s recombinant protein subunit vaccines, and likely more after that. So here’s the key question: did any of these show ADE hints during their development? And are any of them showing signs of it now?\nThe short answers: they did not. And they are not. Antibody-dependent enhancement was specifically tested for in the animal models as these candidates were being developed (re-exposure of vaccinated animals to coronavirus to see how protective the vaccine was). And no cases of more severe disease were seen – I’ve gone back through the reported preclinical studies, and I don’t think I’ve missed one, and what I’m seeing is not one single case of ADE for any of them. Indeed, as mentioned above, if something like that had shown up, it would have immediately released a bucket of clin-dev and regulatory sand into the gears of the whole project.\nHow about the human clinical trials? Again, no signs of ADE were seen. This is a bit less definitive, since we did not run deliberate “Here, have another blast of virus” challenges on the human participants the way we did in the preclinical studies. But at the same time, these trial participants were out there in the real world being monitored for signs of infection. The dramatic plots of the data after even one dose of the vaccines speak for themselves: the trials did hardly saw people getting infected at all after vaccination, and most certainly not with even more severe disease. To the contrary: one of the big features of the vaccines is that across the board they seem to almost totally wipe out the appearance of severe coronavirus symptoms. We’re still collecting data on transmissibility after vaccination and so on (things are looking good, though),\nbut what seems to be beyond doubt is that the vaccinated subjects, over and over, show up with no severe coronavirus cases and no hospitalizations.\nThat is the opposite of what you would expect if ADE were happening. Remember, the bad thing about antibody-dependent enhancement is that it leads to more severe disease when you’re exposed again to the pathogen (or when you’re exposed after being vaccinated for it). And we’re just not seeing that. At all.\nThey weren’t seeing it back in February. But they certainly are starting to see it now. The best case is that it’s just variant cases against which the vaccines are no good, like getting the flu after getting a flu shot designed for a different flu strain. The worse case is that the increasing number of vaccinated subjects being hospitalized with Covid is evidence of ADE. The worst case, of course, is CASE NIGHTMARE KITTY, which would result in the death of everyone who is infected by Covid after being vaccinated, but fortunately, that does not appear to be the situation.\nHowever, an older article by the same author, from December 2020,\ndescribed the main worry\nas something that is confirmed to have been observed.\nI would say that the main worry for any ADE effects would be if the coronavirus mutates to the point that the antibodies generated by the current vaccines become non-neutralizing. And honestly, I don’t see that happening.\nExcept it already has.",
  "tags": [
    "MPAI"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-26T11:00:03+00:00"
}