{
  "url": "https://voxday.net/2021/07/11/yes-im-real/",
  "scraped_at": "2026-01-08T12:41:45.200220",
  "title": "Yes, I’m real",
  "date_display": "July 11, 2021",
  "date_iso": "2021-07-11T10:49:56+00:00",
  "date_from_url": "2021-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Apparently some Miles Mathis skeptics – whose skepticism is well-documented and justified – <a href=\"https://www.anonymousconservative.com/blog/news-briefs-07-09-2021/#comments\" rel=\"noopener\" target=\"_blank\">are similarly dubious</a> about me:</p><blockquote><p>The only MM I’ve read, his Wittgenstein piece, was basically “look at anything odd in W’s life and then say it’s obviously a lie”, coupled with “I don’t understand/like W’s philosophy so I’ll claim it’s gibberish”. You could write a similar hit piece on Vox Day, pointing out all the improbable coincidences, powerful friends/contacts, and conclude: “So this millionaire’s son who poses with a flaming sword, and apparently partied with Prince, just so happens to write a song for Mortal Kombat, oh and his dad went to prison for 10 years, and I’m supposed to believe he started his own software company as well as a band, and his grandfather was “the Marine’s Marine”, oh and he was a nationally-syndicated journalist at age 18, and a national athlete??? – and then he suddenly decides, whoops I’m going to Italy and there he just happens to start his own publishing company, oh and he’s friends with a leading Israeli military historian, and he somehow finds time to make 1 hour Darkstreams every night, AND to set up his own social media, AND to write 1000-page Fantasy novels. Right. Has anyone even SEEN him, in real life? Does he even exist?” – etc.</p></blockquote><p>Interesting. Usually it’s Spacebunny’s existence that is doubted. But I assure you, we’re both real and pretty much as advertised. Sure, I’ve lived all around the world, tried a lot of different things, and had at least a modicum of success at most of them. But what can I say? I bore easily.</p><p>Just to set the record straight:</p><ol style=\"text-align: left;\"><li>I never wrote a song for <i>Mortal Kombat</i>. Two Psykosonik songs were used for the first two movies and I didn’t have anything to do with writing either one of them. Dan wrote them both after Mike and I left the band. It’s really not hard to tell what I wrote and what I didn’t write, regardless of what the credits say, if you simply pay attention to the lyrics or the lack of them.</li><li>My father went to prison for 12 years, if I recall correctly.</li><li>I was nationally syndicated three times, the first time by Chronicle Features at the age of 25.</li><li>I would not describe the lowest level of NCAA D1 as being a national-class athlete. Conference champion state-class competitor would be more accurate.</li><li>I’m not a programmer. Dozens of people work on the products with which I’m involved in one capacity or another. I’m not even the producer or project leader on most of the projects. I’m just a designer and writer; what tends to distinguish me in the former capacity is that my designs always fundamentally work even if they sound far-fetched or are not especially brilliant in conception or application.</li></ol><div>So from the development perspective, I am a “collective” of the sort that some people believe Miles Mathis to be. The funny thing is that there are a number of far less credible encounters and events in my life than most of the known ones that people find suspicious or unusual. But I’ve never worked for any government in any capacity, I’ve never sought mainstream approval or prizes, and I’ve never had any interest in telling other people what to do or how to live their lives. </div><div>However, I think it’s unwise and mostly incorrect to dismiss the Mathis Committee’s conclusions about the essential fakery of so much art and science. Wittgenstein’s philosophy and Joyce’s writing and Darwin’s theory are not described as gibberish because no one understands them or likes them, but because they are genuinely gibberish. Even if one is incapable of recognizing those things for oneself, one need only inquire of an individual who claims to understand them to see that they are gibberish, or at the very least fundamentally incorrect.</div><div>Also, the fact that one knows what one is doing, or that one intends what one is doing, does not not make that which one is doing art, let alone great art. It’s just the inept execution of a bad idea. And one need only compare the results to the genuine article to see that the vast majority of the supposedly great works of the 20th century fall catastrophically short of the standard set by previous centuries. For all its flaws, <i>The Tale of Genji</i> is a far more worthwhile, far more original, and far more insightful novel than <i>Ulysse</i>s, which offers little more than can be found in reading a thesaurus while listening to an Alphaville album.</div></div>",
  "content_text": "Apparently some Miles Mathis skeptics – whose skepticism is well-documented and justified –\nare similarly dubious\nabout me:\nThe only MM I’ve read, his Wittgenstein piece, was basically “look at anything odd in W’s life and then say it’s obviously a lie”, coupled with “I don’t understand/like W’s philosophy so I’ll claim it’s gibberish”. You could write a similar hit piece on Vox Day, pointing out all the improbable coincidences, powerful friends/contacts, and conclude: “So this millionaire’s son who poses with a flaming sword, and apparently partied with Prince, just so happens to write a song for Mortal Kombat, oh and his dad went to prison for 10 years, and I’m supposed to believe he started his own software company as well as a band, and his grandfather was “the Marine’s Marine”, oh and he was a nationally-syndicated journalist at age 18, and a national athlete??? – and then he suddenly decides, whoops I’m going to Italy and there he just happens to start his own publishing company, oh and he’s friends with a leading Israeli military historian, and he somehow finds time to make 1 hour Darkstreams every night, AND to set up his own social media, AND to write 1000-page Fantasy novels. Right. Has anyone even SEEN him, in real life? Does he even exist?” – etc.\nInteresting. Usually it’s Spacebunny’s existence that is doubted. But I assure you, we’re both real and pretty much as advertised. Sure, I’ve lived all around the world, tried a lot of different things, and had at least a modicum of success at most of them. But what can I say? I bore easily.\nJust to set the record straight:\nI never wrote a song for\nMortal Kombat\n. Two Psykosonik songs were used for the first two movies and I didn’t have anything to do with writing either one of them. Dan wrote them both after Mike and I left the band. It’s really not hard to tell what I wrote and what I didn’t write, regardless of what the credits say, if you simply pay attention to the lyrics or the lack of them.\nMy father went to prison for 12 years, if I recall correctly.\nI was nationally syndicated three times, the first time by Chronicle Features at the age of 25.\nI would not describe the lowest level of NCAA D1 as being a national-class athlete. Conference champion state-class competitor would be more accurate.\nI’m not a programmer. Dozens of people work on the products with which I’m involved in one capacity or another. I’m not even the producer or project leader on most of the projects. I’m just a designer and writer; what tends to distinguish me in the former capacity is that my designs always fundamentally work even if they sound far-fetched or are not especially brilliant in conception or application.\nSo from the development perspective, I am a “collective” of the sort that some people believe Miles Mathis to be. The funny thing is that there are a number of far less credible encounters and events in my life than most of the known ones that people find suspicious or unusual. But I’ve never worked for any government in any capacity, I’ve never sought mainstream approval or prizes, and I’ve never had any interest in telling other people what to do or how to live their lives.\nHowever, I think it’s unwise and mostly incorrect to dismiss the Mathis Committee’s conclusions about the essential fakery of so much art and science. Wittgenstein’s philosophy and Joyce’s writing and Darwin’s theory are not described as gibberish because no one understands them or likes them, but because they are genuinely gibberish. Even if one is incapable of recognizing those things for oneself, one need only inquire of an individual who claims to understand them to see that they are gibberish, or at the very least fundamentally incorrect.\nAlso, the fact that one knows what one is doing, or that one intends what one is doing, does not not make that which one is doing art, let alone great art. It’s just the inept execution of a bad idea. And one need only compare the results to the genuine article to see that the vast majority of the supposedly great works of the 20th century fall catastrophically short of the standard set by previous centuries. For all its flaws,\nThe Tale of Genji\nis a far more worthwhile, far more original, and far more insightful novel than\nUlysse\ns, which offers little more than can be found in reading a thesaurus while listening to an Alphaville album.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-07-11T09:49:56+00:00"
}