{
  "url": "https://voxday.net/2022/04/02/an-economy-of-force/",
  "scraped_at": "2026-01-08T13:14:53.650492",
  "title": "An Economy of Force",
  "date_display": "April 2, 2022",
  "date_iso": "2022-04-02T23:13:38+00:00",
  "date_from_url": "2022-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://thesaker.is/sitrep-operation-z-3/\">A pro-Russian analyst explains</a> why the media keeps overreporting massive quantities of Russian casualties while the Russians control the battlespace and continue to take Ukrainian villages and cities. Note that BTG stands for “Battalion Tactical Group”, a combined-arms manoeuvre unit deployed by the Russian Army that comprises a mechanized infantry battalion of 2–4 companies reinforced with air-defence, artillery, engineering, and logistical support units.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I have counted every single brigade and BTG <a href=\"https://www.uawardata.com/\">listed on the map</a> and have come out with a startling find that correlates exactly with what I’ve been saying for a while, and have written in detail about in the last report. Namely: there appears to be only about 50-60 total Russian BTGs in Ukraine. Considering that a Russian BTG is listed as having an estimated 600-800 men, this would amount to 50,000 – 60,000 troops in total deployment. The author himself has stated these are all the confirmed groups in the country. You can check for yourself, every unit is listed typically as either regiment or brigade. A regiment is supposed to have around 1,000 men. A Russian brigade is typically composed of 2 BTGs but on the map if you click each ‘brigade’ the exact disposition is given, and many of them say 1 BTG while others are 2 BTG. And yes, the ‘expert’ behind this new map has stated that he believes Russian total BTGs is much less than was advertised, and he is a fully pro-western ‘analyst’. He believes Russia originally started with maybe in the ~80 BTGs range, but of course conveniently he never managed to track any of those missing 30 or so, and in fact attributes them to having been destroyed, since the current operative ‘narrative’ amongst the completely lost western “OSINT armchair analyst” crowd is that Russia has lost 20-30 BTGs – an extrapolation of the laughably inflated “official figures” from Kiev that list Russian losses as 30,000 KIA, etc. Like I said, it’s quite convenient that those ‘destroyed’ phantom BTGs were in fact never tracked or witnessed in theater by the experts, and the ones that ARE being tracked just so perfectly happen to fall into the 50 BTG range.</p><p>What’s interesting is that, prior to the onset of a major propaganda campaign on the eve of the military operation, when the CIA had to go into full fear-mongering mode, even sources like CNN were reporting the following last year: “In April and September this year, Russia pulled than 50 battalion tactical groups to our borders. Currently, 41 battalion tactical groups are in combat readiness around Ukraine and in the temporarily occupied Crimea. Of these, 33 stay on a permanent basis and eight have been additionally transferred to Crimea.”</p><p>This sounds remarkably similar to the troop disposition the military experts tracking every single unit in the theater are seeing. It seems the much vaunted “180 BTGs” bogeyman was all hype and propaganda.</p><p>More and more experts are now starting to backtrack and also opine that Russia might be using way less forces than initially suspected.</p></blockquote><p>This economy of force makes sense, particularly because it was obvious from the start that a) Russia wasn’t utilizing its best units and b) Russia was much more concerned about fighting a much larger conflict with NATO forces than it was about the Ukrainian forces with which it was already engaged.</p><p>Of course, in the aftermath of the successful Syrian operation, which was also performed with a minimal force, the economy of force utilized tends to indicate that Russia’s military capabilities are even more formidable than previously estimated if subsquently proven to be true.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a7113b3d-0dec-4da6-877b-5491a9e53693\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A pro-Russian analyst explains\nwhy the media keeps overreporting massive quantities of Russian casualties while the Russians control the battlespace and continue to take Ukrainian villages and cities. Note that BTG stands for “Battalion Tactical Group”, a combined-arms manoeuvre unit deployed by the Russian Army that comprises a mechanized infantry battalion of 2–4 companies reinforced with air-defence, artillery, engineering, and logistical support units.\nI have counted every single brigade and BTG\nlisted on the map\nand have come out with a startling find that correlates exactly with what I’ve been saying for a while, and have written in detail about in the last report. Namely: there appears to be only about 50-60 total Russian BTGs in Ukraine. Considering that a Russian BTG is listed as having an estimated 600-800 men, this would amount to 50,000 – 60,000 troops in total deployment. The author himself has stated these are all the confirmed groups in the country. You can check for yourself, every unit is listed typically as either regiment or brigade. A regiment is supposed to have around 1,000 men. A Russian brigade is typically composed of 2 BTGs but on the map if you click each ‘brigade’ the exact disposition is given, and many of them say 1 BTG while others are 2 BTG. And yes, the ‘expert’ behind this new map has stated that he believes Russian total BTGs is much less than was advertised, and he is a fully pro-western ‘analyst’. He believes Russia originally started with maybe in the ~80 BTGs range, but of course conveniently he never managed to track any of those missing 30 or so, and in fact attributes them to having been destroyed, since the current operative ‘narrative’ amongst the completely lost western “OSINT armchair analyst” crowd is that Russia has lost 20-30 BTGs – an extrapolation of the laughably inflated “official figures” from Kiev that list Russian losses as 30,000 KIA, etc. Like I said, it’s quite convenient that those ‘destroyed’ phantom BTGs were in fact never tracked or witnessed in theater by the experts, and the ones that ARE being tracked just so perfectly happen to fall into the 50 BTG range.\nWhat’s interesting is that, prior to the onset of a major propaganda campaign on the eve of the military operation, when the CIA had to go into full fear-mongering mode, even sources like CNN were reporting the following last year: “In April and September this year, Russia pulled than 50 battalion tactical groups to our borders. Currently, 41 battalion tactical groups are in combat readiness around Ukraine and in the temporarily occupied Crimea. Of these, 33 stay on a permanent basis and eight have been additionally transferred to Crimea.”\nThis sounds remarkably similar to the troop disposition the military experts tracking every single unit in the theater are seeing. It seems the much vaunted “180 BTGs” bogeyman was all hype and propaganda.\nMore and more experts are now starting to backtrack and also opine that Russia might be using way less forces than initially suspected.\nThis economy of force makes sense, particularly because it was obvious from the start that a) Russia wasn’t utilizing its best units and b) Russia was much more concerned about fighting a much larger conflict with NATO forces than it was about the Ukrainian forces with which it was already engaged.\nOf course, in the aftermath of the successful Syrian operation, which was also performed with a minimal force, the economy of force utilized tends to indicate that Russia’s military capabilities are even more formidable than previously estimated if subsquently proven to be true.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-04-02T23:13:41+00:00"
}