{
  "url": "https://voxday.net/2022/04/20/clown-world-as-crucible/",
  "scraped_at": "2026-01-08T13:16:41.332893",
  "title": "Clown World as Crucible",
  "date_display": "April 20, 2022",
  "date_iso": "2022-04-20T15:26:47+00:00",
  "date_from_url": "2022-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AC contemplates a thought that I, too, have thought before. What if we’re not the targets of clown world?</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>One of our greatest weaknesses is we tend to ascribe so much to stupidity. They have even fed us the meme, <em>“Never ascribe to malice that which can be ascribed to stupidity.</em>” But those we face have very smart people in very high places, telling all the idiot puppets in positions of power that we see what to do. More often than not, I think the planners and the puppet string pullers know exactly what they are doing. However if this is the case, it does not make sense in the context of the farmer looking to breed more docile, complacent sheep. It might make sense however if there were a farmer looking at the current crop of obese trannies, skinny manlets, and ultra-left NPCs, and deciding he needed to do some major selective breeding to salvage his herd’s reproductive viability.</p></blockquote><p>Why do we assume that the elite want the fat, mindless, degenerate, and self-sterilizing subhumans that their policies are producing in such quantities lately? Of what possible use can they be to anyone? If we are ruled by an arrogant and aesthetic elite that values bloodlines, intelligence, and talent, is it not at least possible that clown world is a crucible intentionally designed to eliminate the weak, the stupid, and the ugly?</p><p>And isn’t that more in keeping with the beliefs and behaviors of the pagan elites of the past? I’m not saying that’s necessarily the case, I’m simply observing that almost every aspect of clown world appears to be designed to lure the susceptible into the consensual destruction of their selves and their genetic lines.</p><p>Regardless, our responsibility to resist and refuse to submit to it remains the same.</p><p><em><a href=\"https://social.infogalactic.com/micropost/d6d8a019-bd12-4330-aae7-d75d578a8373\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "AC contemplates a thought that I, too, have thought before. What if we’re not the targets of clown world?\nOne of our greatest weaknesses is we tend to ascribe so much to stupidity. They have even fed us the meme,\n“Never ascribe to malice that which can be ascribed to stupidity.\n” But those we face have very smart people in very high places, telling all the idiot puppets in positions of power that we see what to do. More often than not, I think the planners and the puppet string pullers know exactly what they are doing. However if this is the case, it does not make sense in the context of the farmer looking to breed more docile, complacent sheep. It might make sense however if there were a farmer looking at the current crop of obese trannies, skinny manlets, and ultra-left NPCs, and deciding he needed to do some major selective breeding to salvage his herd’s reproductive viability.\nWhy do we assume that the elite want the fat, mindless, degenerate, and self-sterilizing subhumans that their policies are producing in such quantities lately? Of what possible use can they be to anyone? If we are ruled by an arrogant and aesthetic elite that values bloodlines, intelligence, and talent, is it not at least possible that clown world is a crucible intentionally designed to eliminate the weak, the stupid, and the ugly?\nAnd isn’t that more in keeping with the beliefs and behaviors of the pagan elites of the past? I’m not saying that’s necessarily the case, I’m simply observing that almost every aspect of clown world appears to be designed to lure the susceptible into the consensual destruction of their selves and their genetic lines.\nRegardless, our responsibility to resist and refuse to submit to it remains the same.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-04-20T15:26:50+00:00"
}