{
  "url": "https://voxday.net/2022/04/29/congress-goes-to-war/",
  "scraped_at": "2026-01-08T13:17:37.063833",
  "title": "Congress Goes to War",
  "date_display": "April 29, 2022",
  "date_iso": "2022-04-29T12:00:51+00:00",
  "date_from_url": "2022-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger points out that under long-established international law, the US Congress has effectively declared the United States <a href=\"https://market-ticker.org/akcs-www?post=245746\">to be in a state of war with Russia</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Congress has explicitly authorized, and Biden will sign, this bill that specifically permits the transfer to Ukraine of basically anything other than nuclear material. Seriously folks — that’s the only real exception found in the referenced definition.</p><p>By agreeing to provide direct weaponry that can be and will be used in the waging of war by one of the two parties to same <em>we have entered the conflict.</em> That our GIs are not directly involved there is of no consequence. This is no different than shipping arms to Britain during WWI in the Lusitania or the lend-lease provisions in early WWII that ultimately led us to get involved there in Europe. Indeed Pelosi directly referenced those early WWII provisions indicating that she knows damn well the implications of what Congress just did.</p><p>In fact it was lend-lease of March 1941 that led Hitler to come after the United States; we had entered the war as a belligerent by officially agreeing to supply war material to Britain.</p><p>In those two wars there was no realistic means for the Germans or other Axis powers to hit us directly on our own soil. But they did in fact do that in response when they sunk the Lusitania, which had a bunch of Americans on board. They could reach that ship, did reach it, and did sink it. They did so because we were supplying England with munitions.</p><p>We claimed at the time we were not, we were lying and that is now established as a historical fact.</p><p><em><strong>The Germans hit a legitimate military target despite our and Britain’s claims at the time otherwise.</strong></em></p><p>Today the situation is different. Russia can hit us here and not just with nukes. They can hit American assets that are by any reasonable international standard military targets all over the world and that includes military command and control which by our Constitution includes all members and facilities of both Houses of Congress along with the Executive, never mind obvious things like the Pentagon.</p><p>I don’t think Putin is crazy enough to do it right up front but do not mistake “doesn’t” tomorrow morning for “can’t” — the door is open.</p><p>Don’t kid yourselves folks; such a strike, if it occurs, is entirely legal from an international law perspective under the laws of war. <strong><em>It is legitimate for a belligerent to strike the military elements, direct and indirect, of an entity supplying its opposing military.</em></strong></p><p>We are now a belligerent in this conflict having crossed the line when we went from providing food, medical assistance and similar to military goods and the definition in this act does not draw a distinction, not that there really is one that is internationally recognized in the first place, between offensive and defensive arms.</p></blockquote><p>The neocons wanted their war with Russia. Looks like they’re getting it, and it won’t be even remotely surprising if they get it good and hard. It’s worth noting that it was just nine months from FDR’s establishment of Lend-Lease to formal war with Germany; if a similar time frame holds, the USA will be openly at war with Russia by January, just in time for General Winter.</p><p>But legalities and diplomacies aside, the USA is already observably at war with Russia, given that it is already spending 6x more on the Russo-NATO war than the entire Ukrainian military budget. All the endless word games and legal posturings about the expansive redefinition of neutrality and what is justified in response to the illegality of war aren’t going to prevent a single missile from being fired against a legitimate target in a belligerent state.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5d71c992-b173-4954-94a7-e8eb05902f99/comment/81b9df8d-4f7a-4206-ae19-ee3c9b708649\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Karl Denninger points out that under long-established international law, the US Congress has effectively declared the United States\nto be in a state of war with Russia\n:\nCongress has explicitly authorized, and Biden will sign, this bill that specifically permits the transfer to Ukraine of basically anything other than nuclear material. Seriously folks — that’s the only real exception found in the referenced definition.\nBy agreeing to provide direct weaponry that can be and will be used in the waging of war by one of the two parties to same\nwe have entered the conflict.\nThat our GIs are not directly involved there is of no consequence. This is no different than shipping arms to Britain during WWI in the Lusitania or the lend-lease provisions in early WWII that ultimately led us to get involved there in Europe. Indeed Pelosi directly referenced those early WWII provisions indicating that she knows damn well the implications of what Congress just did.\nIn fact it was lend-lease of March 1941 that led Hitler to come after the United States; we had entered the war as a belligerent by officially agreeing to supply war material to Britain.\nIn those two wars there was no realistic means for the Germans or other Axis powers to hit us directly on our own soil. But they did in fact do that in response when they sunk the Lusitania, which had a bunch of Americans on board. They could reach that ship, did reach it, and did sink it. They did so because we were supplying England with munitions.\nWe claimed at the time we were not, we were lying and that is now established as a historical fact.\nThe Germans hit a legitimate military target despite our and Britain’s claims at the time otherwise.\nToday the situation is different. Russia can hit us here and not just with nukes. They can hit American assets that are by any reasonable international standard military targets all over the world and that includes military command and control which by our Constitution includes all members and facilities of both Houses of Congress along with the Executive, never mind obvious things like the Pentagon.\nI don’t think Putin is crazy enough to do it right up front but do not mistake “doesn’t” tomorrow morning for “can’t” — the door is open.\nDon’t kid yourselves folks; such a strike, if it occurs, is entirely legal from an international law perspective under the laws of war.\nIt is legitimate for a belligerent to strike the military elements, direct and indirect, of an entity supplying its opposing military.\nWe are now a belligerent in this conflict having crossed the line when we went from providing food, medical assistance and similar to military goods and the definition in this act does not draw a distinction, not that there really is one that is internationally recognized in the first place, between offensive and defensive arms.\nThe neocons wanted their war with Russia. Looks like they’re getting it, and it won’t be even remotely surprising if they get it good and hard. It’s worth noting that it was just nine months from FDR’s establishment of Lend-Lease to formal war with Germany; if a similar time frame holds, the USA will be openly at war with Russia by January, just in time for General Winter.\nBut legalities and diplomacies aside, the USA is already observably at war with Russia, given that it is already spending 6x more on the Russo-NATO war than the entire Ukrainian military budget. All the endless word games and legal posturings about the expansive redefinition of neutrality and what is justified in response to the illegality of war aren’t going to prevent a single missile from being fired against a legitimate target in a belligerent state.\nDISCUSS ON SG",
  "tags": [
    "neocons",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-04-29T13:05:08+00:00"
}