{
  "url": "https://voxday.net/2022/04/28/global-nato-threatens-china/",
  "scraped_at": "2026-01-08T13:17:28.194110",
  "title": "Global NATO Threatens China",
  "date_display": "April 28, 2022",
  "date_iso": "2022-04-28T09:26:49+00:00",
  "date_from_url": "2022-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This proposal floated by the Foreign Secretary of the United Kingdom may be <a href=\"https://www.rt.com/news/554646-liz-truss-nato-ukraine-taiwan/\">one of the most shortsighted, suicidal geopolitical visions</a> ever articulated in the written history of Man, as the West is rapidly being replaced by the growing power of the NorthEast.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The world order created after the Second World War and the Cold War isn’t working anymore, so the West needs “a global NATO” to pursue geopolitics anew, UK Foreign Secretary Liz Truss argued, in a major foreign policy speech on Wednesday. Truss also urged the US-led bloc to send more “heavy weapons, tanks” and airplanes to Ukraine, and said China would face the same treatment as Russia if it doesn’t “play by the rules.”</p><p>“My vision is a world where free nations are assertive and in the ascendant. Where freedom and democracy are strengthened through a network of economic and security partnerships,” Truss said in a speech at a Mansion House banquet in London.</p><p>Dubbing this arrangement “the Network of Liberty,” Truss argued it was necessary because the economic and security structures developed after 1945 – such as the UN Security Council – “have been bent out of shape so far, they have enabled rather than contained aggression.”</p><p>“Geopolitics is back,” she announced.</p><p>The collective West and its allies need to supply Kiev with “heavy weapons, tanks, aeroplanes – digging deep into our inventories, ramping up production,” Truss said, because the objective is to “push Russia out of the whole of Ukraine” and rebuild the country along the lines of a new Marshall Plan.</p><p>“The war in Ukraine is our war – it is everyone’s war because Ukraine’s victory is a strategic imperative for all of us. Beyond that, NATO must ensure that “the Western Balkans and countries like Moldova and Georgia have the resilience and the capabilities to maintain their sovereignty and freedom,” and uphold the “sacrosanct” open-door policy, Truss said.</p><p>Her ambitions went beyond Europe, though, as Truss denounced the “false choice between Euro-Atlantic security and Indo-Pacific security. In the modern world we need both. We need a global NATO,” she said. “And we must ensure that democracies like Taiwan are able to defend themselves.” Pointing to London’s unprecedented effort to embargo Russia, Truss insisted that “economic access is no longer a given. It has to be earned,” and that countries who wish to earn it “must play by the rules. And that includes China.”</p></blockquote><p>In other worlds, the New World Order aka the neo-liberal rules-based world order aka Globohomo has failed, so naturally what is needed is more of that which has failed. This response isn’t even remotely surprising in the abstract, as doubling down is what idiots and fools always do instead of examining the reasons for their failure and rethinking both their assumptions and their approach.</p><p>But it is surprising in the particular, as Russia, China, Iran, Saudi Arabia, <a href=\"https://www.rt.com/news/554653-spain-algeria-morocco-gas/\">and now Algeria</a> have made it clear that they will not submit to the globalists’ demands that they deliver natural resources to their Western customers on demand while simultaneously being subject to having their economic access to those same customers controlled by the globalists.</p><p>Indeed, if they are given a choice, many in the West will choose the growing economic system of the NorthEast over the collapsing system of the West. But they will not be given a choice if the globalists have anything to say about it.</p><p>This tends to strongly support something I have repeatedly pointed out, the Russian Special Military Operation has very little to do with Ukraine per se; it is merely the opening battle in the NorthEast’s war with the globalists who rule over the West. This will be confirmed when the second battle begins, though whether that will be in Taiwan, Western Europe, Russia, or somewhere in the Middle East is yet to be seen.</p><p><em><a href=\"https://social.infogalactic.com/micropost/54358361-40d7-4b2a-ac56-852c65312741\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This proposal floated by the Foreign Secretary of the United Kingdom may be\none of the most shortsighted, suicidal geopolitical visions\never articulated in the written history of Man, as the West is rapidly being replaced by the growing power of the NorthEast.\nThe world order created after the Second World War and the Cold War isn’t working anymore, so the West needs “a global NATO” to pursue geopolitics anew, UK Foreign Secretary Liz Truss argued, in a major foreign policy speech on Wednesday. Truss also urged the US-led bloc to send more “heavy weapons, tanks” and airplanes to Ukraine, and said China would face the same treatment as Russia if it doesn’t “play by the rules.”\n“My vision is a world where free nations are assertive and in the ascendant. Where freedom and democracy are strengthened through a network of economic and security partnerships,” Truss said in a speech at a Mansion House banquet in London.\nDubbing this arrangement “the Network of Liberty,” Truss argued it was necessary because the economic and security structures developed after 1945 – such as the UN Security Council – “have been bent out of shape so far, they have enabled rather than contained aggression.”\n“Geopolitics is back,” she announced.\nThe collective West and its allies need to supply Kiev with “heavy weapons, tanks, aeroplanes – digging deep into our inventories, ramping up production,” Truss said, because the objective is to “push Russia out of the whole of Ukraine” and rebuild the country along the lines of a new Marshall Plan.\n“The war in Ukraine is our war – it is everyone’s war because Ukraine’s victory is a strategic imperative for all of us. Beyond that, NATO must ensure that “the Western Balkans and countries like Moldova and Georgia have the resilience and the capabilities to maintain their sovereignty and freedom,” and uphold the “sacrosanct” open-door policy, Truss said.\nHer ambitions went beyond Europe, though, as Truss denounced the “false choice between Euro-Atlantic security and Indo-Pacific security. In the modern world we need both. We need a global NATO,” she said. “And we must ensure that democracies like Taiwan are able to defend themselves.” Pointing to London’s unprecedented effort to embargo Russia, Truss insisted that “economic access is no longer a given. It has to be earned,” and that countries who wish to earn it “must play by the rules. And that includes China.”\nIn other worlds, the New World Order aka the neo-liberal rules-based world order aka Globohomo has failed, so naturally what is needed is more of that which has failed. This response isn’t even remotely surprising in the abstract, as doubling down is what idiots and fools always do instead of examining the reasons for their failure and rethinking both their assumptions and their approach.\nBut it is surprising in the particular, as Russia, China, Iran, Saudi Arabia,\nand now Algeria\nhave made it clear that they will not submit to the globalists’ demands that they deliver natural resources to their Western customers on demand while simultaneously being subject to having their economic access to those same customers controlled by the globalists.\nIndeed, if they are given a choice, many in the West will choose the growing economic system of the NorthEast over the collapsing system of the West. But they will not be given a choice if the globalists have anything to say about it.\nThis tends to strongly support something I have repeatedly pointed out, the Russian Special Military Operation has very little to do with Ukraine per se; it is merely the opening battle in the NorthEast’s war with the globalists who rule over the West. This will be confirmed when the second battle begins, though whether that will be in Taiwan, Western Europe, Russia, or somewhere in the Middle East is yet to be seen.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics",
    "globalism",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-04-28T09:31:36+00:00"
}