{
  "url": "https://voxday.net/2022/04/26/rhetoric-by-castalia-library/",
  "scraped_at": "2026-01-08T13:17:30.066088",
  "title": "RHETORIC by Castalia Library",
  "date_display": "April 26, 2022",
  "date_iso": "2022-04-26T18:00:00+00:00",
  "date_from_url": "2022-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-53202\" decoding=\"async\" fetchpriority=\"high\" height=\"372\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2022/04/image-8.png\" srcset=\"https://voxday.net/wp-content/uploads/2022/04/image-8.png 512w, https://voxday.net/wp-content/uploads/2022/04/image-8-300x218.png 300w\" width=\"512\"><figcaption><em>Castalia vs Franklin: A Tale of Two Libraries</em></figcaption></img></figure></div><p><em>RHETORIC </em>by Aristlotle is now available from Castalia Library in both <a href=\"https://arkhavencomics.com/product/aristotle-rhetoric-library/\">Castalia Librar</a>y and <a href=\"https://arkhavencomics.com/product/rhetoric-libraria-edition/\">Libraria Castalia </a>editions. It’s one of our fastest-selling books, as we’d already be sold out if we hadn’t boosted the print run to 850. There are currently just <s>93</s> <s>79</s> <s>53</s> 30 copies <a href=\"https://arkhavencomics.com/product/aristotle-rhetoric-library/\">left in stock</a>. In addition to featuring our most Franklinesque spine – which you can see above in between<em> SUMMA ELVETICA </em>and <em>HEIDI </em>on the left – it also features a preface by yours truly.</p><h2 class=\"wp-block-heading\">Preface to <em>Rhetoric</em></h2><p>Aristotle’s <em>Rhetoric</em> is one of the most useful and important analyses of human communication ever written. It is also one of the great philosopher’s least appreciated works, as it is easily mistaken for a mere technical breakdown of the various forms of persuasion rather than what it truly is, a brilliant conceptual guide to understanding and anticipating human behavior.</p><p>While a considerable portion of the text is devoted to the mechanics of the syllogism and the enthymeme, as well as the presentation of the inevitable lists which Aristotle characteristically constructs, by far the most important element of this little book is the philosopher’s division of humanity into two fundamental classes: those who are capable of learning through information and those who are not.</p><p>This is such an important distinction that it is remarkable for its complete absence from the schools and universities today. The distinction calls into question everything from modern pedagogical systems to personal conversations while simultaneously explaining the mystery that has confounded every intelligent individual who has ever tried, and failed, to explain the obvious to another person.</p><p>Indeed, it is comforting to have one’s long-held suspicions about the intrinsic limitations of one’s fellow man confirmed so comprehensively. More importantly, Aristotle’s rhetorical framework provides those who understand and apply it the ability to effectively communicate to the full spectrum of humanity, in effect permitting the reader to transcend his natural psycho-linguistic instincts and attain true intellectual polylingualism.</p><p>It must be admitted that <em>Rhetoric</em> would be considerably more accessible if the terminology utilized was a little more expansive and a little less imitated. Even though his definition makes sense when the relevant terms are analyzed in detail, it is not exactly conducive to comprehension for Aristotle to define the two subsets of rhetoric to be dialectic and rhetoric, therein requiring a casual distinction between rhetoric and rhetoric-rhetoric, or capital-R Rhetoric and lowercase-r rhetoric. Adding to the confusion is the fact that both Hegel and Marx subsequently attempted to redefine the term dialectic, although there is precious little in common between Aristotelian dialectic, Hegelian dialectic, Marxian dialectic, and the current dictionary term.</p><p>However, once the reader grasps that in this context, Rhetoric simply means persuasion, which is divided into a) fact-and-reason based persuasion, or dialectic, and b) emotion-based persuasion, or rhetoric, the basic framework becomes clear. The philosopher explains that while some people can be persuaded by information and logical demonstrations, people are most readily persuaded by emotional manipulation. Moreover, some people can only be persuaded by emotional manipulation, as Aristotle observes in what may be the most important sentence in the book.</p><p><em>Before some audiences not even the possession of the exactest knowledge will make it easy for what we say to produce conviction. For argument based on knowledge implies instruction, and there are people whom one cannot instruct.</em></p><p>What Aristotle is observing is that some of those who are limited to rhetoric are immune to dialectic. Such individuals cannot be swayed by facts or reason, no matter how exact the knowledge provided, no matter how impeccable the logic presented. Those who are immune to dialectic can only be reached through rhetoric, which is to say by manipulation that plays upon their emotions more effectively than whatever feelings inspired them to be convicted of their current beliefs.</p><p>While this manipulation may strike some readers as unethical, it is justified by necessity, as the duty of rhetoric requires addressing those “who cannot take in at a glance a complicated argument, or follow a long chain of reasoning.” While the enthymeme resembles the logical syllogism, it is not, in fact, logic, and the truths that it proves are only apparent truths.</p><p>Which, of course, is another way of saying that they are literal untruths.</p><p>This is why people whose natural preferences incline toward dialectic have a strong tendency to regard rhetoric as being fundamentally dishonest, and to consider the emotional manipulation involved in utilizing rhetoric to be intrinsically wrong. This distaste for rhetoric among those capable of utilizing dialectic is common, but it is nevertheless false. First, because even the most logically correct dialectic can be entirely false if the premises upon which the syllogisms are constructed are false. Second, because the more that the rhetoric incorporates and points toward the truth, the more effective it tends to be.</p><p>Neither dialectic nor rhetoric are inherently true or false; the very attempt to distinguish them in this manner is to make a category error. It might help to think of them as languages; just as one could not reasonably describe English as honest while insisting that German is deceptive and morally wrong, one should not assign morality to either of the two subsets of Rhetoric.</p><p>It is more correct, more practical, and more effective to apply the principle of utilizing the form of communication best understood by the listener. Just as one would not speak Chinese to an individual who only understands English, one should not rely upon rhetoric when speaking to a dialectic-speaker, or expect a rhetoric-speaker to be persuaded by dialectical arguments.</p><p>Aristotle himself believed it was vital for a man to be able to employ both arts, not so much for the purposes of persuasion, but rather, to avoid being deceived.</p><p><em>We must be able to employ persuasion, just as strict reasoning can be employed, on opposite sides of a question, not in order that we may in practice employ it in both ways (for we must not make people believe what is wrong), but in order that we may see clearly what the facts are, and that, if another man argues unfairly, we on our part may be able to confute him. No other of the arts draws opposite conclusions: dialectic and rhetoric alone do this. Both these arts draw opposite conclusions impartially. Nevertheless, the underlying facts do not lend themselves equally well to the contrary views. No; things that are true and things that are better are, by their nature, practically always easier to prove and easier to believe in.</em></p><p>Aristotle’s <em>Rhetoric</em> is every bit as useful and valid today as it was when it was first written more than 2,300 years ago. It is less a work of philosophy than a treasure chest of practical information for the individual who seeks to pursue the Good, the Beautiful, and the True.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e811a310-640c-4a07-a5ae-115dac1e6f71\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Castalia vs Franklin: A Tale of Two Libraries\nRHETORIC\nby Aristlotle is now available from Castalia Library in both\nCastalia Librar\ny and\nLibraria Castalia\neditions. It’s one of our fastest-selling books, as we’d already be sold out if we hadn’t boosted the print run to 850. There are currently just\n93\n79\n53\n30 copies\nleft in stock\n. In addition to featuring our most Franklinesque spine – which you can see above in between\nSUMMA ELVETICA\nand\nHEIDI\non the left – it also features a preface by yours truly.\nPreface to\nRhetoric\nAristotle’s\nRhetoric\nis one of the most useful and important analyses of human communication ever written. It is also one of the great philosopher’s least appreciated works, as it is easily mistaken for a mere technical breakdown of the various forms of persuasion rather than what it truly is, a brilliant conceptual guide to understanding and anticipating human behavior.\nWhile a considerable portion of the text is devoted to the mechanics of the syllogism and the enthymeme, as well as the presentation of the inevitable lists which Aristotle characteristically constructs, by far the most important element of this little book is the philosopher’s division of humanity into two fundamental classes: those who are capable of learning through information and those who are not.\nThis is such an important distinction that it is remarkable for its complete absence from the schools and universities today. The distinction calls into question everything from modern pedagogical systems to personal conversations while simultaneously explaining the mystery that has confounded every intelligent individual who has ever tried, and failed, to explain the obvious to another person.\nIndeed, it is comforting to have one’s long-held suspicions about the intrinsic limitations of one’s fellow man confirmed so comprehensively. More importantly, Aristotle’s rhetorical framework provides those who understand and apply it the ability to effectively communicate to the full spectrum of humanity, in effect permitting the reader to transcend his natural psycho-linguistic instincts and attain true intellectual polylingualism.\nIt must be admitted that\nRhetoric\nwould be considerably more accessible if the terminology utilized was a little more expansive and a little less imitated. Even though his definition makes sense when the relevant terms are analyzed in detail, it is not exactly conducive to comprehension for Aristotle to define the two subsets of rhetoric to be dialectic and rhetoric, therein requiring a casual distinction between rhetoric and rhetoric-rhetoric, or capital-R Rhetoric and lowercase-r rhetoric. Adding to the confusion is the fact that both Hegel and Marx subsequently attempted to redefine the term dialectic, although there is precious little in common between Aristotelian dialectic, Hegelian dialectic, Marxian dialectic, and the current dictionary term.\nHowever, once the reader grasps that in this context, Rhetoric simply means persuasion, which is divided into a) fact-and-reason based persuasion, or dialectic, and b) emotion-based persuasion, or rhetoric, the basic framework becomes clear. The philosopher explains that while some people can be persuaded by information and logical demonstrations, people are most readily persuaded by emotional manipulation. Moreover, some people can only be persuaded by emotional manipulation, as Aristotle observes in what may be the most important sentence in the book.\nBefore some audiences not even the possession of the exactest knowledge will make it easy for what we say to produce conviction. For argument based on knowledge implies instruction, and there are people whom one cannot instruct.\nWhat Aristotle is observing is that some of those who are limited to rhetoric are immune to dialectic. Such individuals cannot be swayed by facts or reason, no matter how exact the knowledge provided, no matter how impeccable the logic presented. Those who are immune to dialectic can only be reached through rhetoric, which is to say by manipulation that plays upon their emotions more effectively than whatever feelings inspired them to be convicted of their current beliefs.\nWhile this manipulation may strike some readers as unethical, it is justified by necessity, as the duty of rhetoric requires addressing those “who cannot take in at a glance a complicated argument, or follow a long chain of reasoning.” While the enthymeme resembles the logical syllogism, it is not, in fact, logic, and the truths that it proves are only apparent truths.\nWhich, of course, is another way of saying that they are literal untruths.\nThis is why people whose natural preferences incline toward dialectic have a strong tendency to regard rhetoric as being fundamentally dishonest, and to consider the emotional manipulation involved in utilizing rhetoric to be intrinsically wrong. This distaste for rhetoric among those capable of utilizing dialectic is common, but it is nevertheless false. First, because even the most logically correct dialectic can be entirely false if the premises upon which the syllogisms are constructed are false. Second, because the more that the rhetoric incorporates and points toward the truth, the more effective it tends to be.\nNeither dialectic nor rhetoric are inherently true or false; the very attempt to distinguish them in this manner is to make a category error. It might help to think of them as languages; just as one could not reasonably describe English as honest while insisting that German is deceptive and morally wrong, one should not assign morality to either of the two subsets of Rhetoric.\nIt is more correct, more practical, and more effective to apply the principle of utilizing the form of communication best understood by the listener. Just as one would not speak Chinese to an individual who only understands English, one should not rely upon rhetoric when speaking to a dialectic-speaker, or expect a rhetoric-speaker to be persuaded by dialectical arguments.\nAristotle himself believed it was vital for a man to be able to employ both arts, not so much for the purposes of persuasion, but rather, to avoid being deceived.\nWe must be able to employ persuasion, just as strict reasoning can be employed, on opposite sides of a question, not in order that we may in practice employ it in both ways (for we must not make people believe what is wrong), but in order that we may see clearly what the facts are, and that, if another man argues unfairly, we on our part may be able to confute him. No other of the arts draws opposite conclusions: dialectic and rhetoric alone do this. Both these arts draw opposite conclusions impartially. Nevertheless, the underlying facts do not lend themselves equally well to the contrary views. No; things that are true and things that are better are, by their nature, practically always easier to prove and easier to believe in.\nAristotle’s\nRhetoric\nis every bit as useful and valid today as it was when it was first written more than 2,300 years ago. It is less a work of philosophy than a treasure chest of practical information for the individual who seeks to pursue the Good, the Beautiful, and the True.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-04-28T14:07:27+00:00"
}