{
  "url": "https://voxday.net/2022/04/13/russo-nato-war-phase-2/",
  "scraped_at": "2026-01-08T13:15:59.716565",
  "title": "Russo-NATO War, Phase 2",
  "date_display": "April 13, 2022",
  "date_iso": "2022-04-13T09:45:46+00:00",
  "date_from_url": "2022-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears that once Mariupol falls, <a href=\"https://thesaker.is/sitrep-operation-z-8/\">the second phase</a> of the Russo-NATO war will begin.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Too many people have now been propagandized by the west to believe Russia somehow “failed” and is incapable of taking the western part of the country, but that is not even close to reality. Russia is not capable of taking it all <em>at the same time from 5 different fronts</em>. There’s a huge difference and distinction there. But once Donbass and everything east of the Dnieper is cleared, Russia can and likely will take the rest with concentrated forces. There will likely then be only 2 fronts, one coming up from the south that will cut off Odessa and take Nikolayev and one that returns from the north into Kiev. But we’ll save that for another time as either way that’s far off in the future.</p><p>In logistical news, Poland has reportedly begun its shipment of 100 T-72 tanks and BMP-1s to Ukraine. While Australia ships Bushmasters.</p><p>In other interesting news which shows that Turkey’s “closing of the Bosphorous” straits was not what it seemed, and was in fact a more than subtle blow against NATO, Turkish defense minister has confirmed that Turkey is strictly prohibiting any NATO ships from passing the straits as well.</p><p>“Turkey will not let NATO warships into the Black Sea,” said Minister of Defense of this country Hulusi Akar. At the same time, he referred to the Montreux Convention and said that the passage would be closed to warships of countries that do not have access to the Black Sea.. Akar also admitted that the presence of mines in the sea could be deliberate: they could have been fired as part of a plan to pressure Ankara to let NATO minesweepers into the Black Sea, which is contrary to the Montreux Convention. “We have a suspicion that the mines were deliberately introduced. Perhaps they were fired as part of some plan to put pressure on us in order to let NATO minesweepers [through the straits] into the Black Sea. But we are committed to the rules of the Montreux [Convention] and do not let warships enter the Black Sea,” the minister said.</p><p>So much for NATO solidarity.</p><p>Also, the first formal appeal for the following: “In the State Duma of Russia, Crimean deputy Mikhail Sheremet today proposed to unite the Republic of Crimea with the Zaporizhia and Kherson regions into the Tauride province within the Russian Federation. “Residents of the regions do not seem to mind – they raise Russian flags everywhere and complain about the attitude of the Ukrainian authorities.”</p><p>American Secretary of Defense Lloyd <a href=\"https://twitter.com/SecDef/status/1513205552700174340\">addresses Ukrainian troops</a>.</p><p>This comes on the heels of new revelations of how deeply embedded U.S. and NATO command structures (and troops) are in Ukraine. A French journalist here <a href=\"https://www.bitchute.com/video/aVZeyycQgXBk/\">describes what he saw</a> in his time in Ukraine. In short, he says he was shocked to see American generals running the entire show on the ground, and he says the names of them will be revealed in his new exposé in the French <em>Figaro </em>newspaper this week.</p><p>This is further proof that this conflict is truly NATO vs. Russia, and NATO is losing badly.</p><p>Another report states: “the United States is moving its advanced headquarters units to the western borders of Ukraine. In particular, the 5th Corps is being relocated. This suggests that it is not the General Staff of the Armed Forces of Ukraine that controls military operations, but NATO officers. And we are at war not with some puppet regime in Kiev, but with the collective West.”</p></blockquote><p>I couldn’t help but notice that the Tory Party’s defense of Boris Johnson for Partygate, and explanation for why he should not be forced to resign despite a) being found guilty of breaking the law, b) lying to Parliament, and c) facing calls to resign from the First Ministers of Scotland and Wales, among many others,, is that Britain is at war. This is a fascinating statement, in light of the fact that the UK has not actually declared war on anyone since Johnson took office.</p><p><em>Mr Johnson faced more calls to resign over his fine from the leaders of the devolved administrations – but Tory backbenchers hit back at criticism, asking: ‘Don’t they know there’s a war on?’</em></p><p>But it’s true. NATO is very actively involved in waging war against Russia, and both the USA and the UK are the most observably belligerent, with personnel, intel, and equipment all being actively engaged against Russian forces. And it’s also obvious that all of the media’s claims that Russia was running out of men and ammunition were completely false, as instead of being forced to conclude operations within two weeks, the media is now reporting that “Russian President Vladimir Putin has massed troops on Ukraine’s eastern flank for fresh offensive on the area.”</p><p>And it looks like the third phase of the war may well include Finland and Sweden in addition to Poland, as both formerly neutral countries appear to be on the verge of joining NATO. And if the multiple reports I’ve heard on the topic are correct, Russia will be making use of its first-rate troops equipped with the latest hardware and supported by its best air, armor, and artillery in the third phase.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1dce89d5-e193-40a3-856e-613c52d5c2d2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It appears that once Mariupol falls,\nthe second phase\nof the Russo-NATO war will begin.\nToo many people have now been propagandized by the west to believe Russia somehow “failed” and is incapable of taking the western part of the country, but that is not even close to reality. Russia is not capable of taking it all\nat the same time from 5 different fronts\n. There’s a huge difference and distinction there. But once Donbass and everything east of the Dnieper is cleared, Russia can and likely will take the rest with concentrated forces. There will likely then be only 2 fronts, one coming up from the south that will cut off Odessa and take Nikolayev and one that returns from the north into Kiev. But we’ll save that for another time as either way that’s far off in the future.\nIn logistical news, Poland has reportedly begun its shipment of 100 T-72 tanks and BMP-1s to Ukraine. While Australia ships Bushmasters.\nIn other interesting news which shows that Turkey’s “closing of the Bosphorous” straits was not what it seemed, and was in fact a more than subtle blow against NATO, Turkish defense minister has confirmed that Turkey is strictly prohibiting any NATO ships from passing the straits as well.\n“Turkey will not let NATO warships into the Black Sea,” said Minister of Defense of this country Hulusi Akar. At the same time, he referred to the Montreux Convention and said that the passage would be closed to warships of countries that do not have access to the Black Sea.. Akar also admitted that the presence of mines in the sea could be deliberate: they could have been fired as part of a plan to pressure Ankara to let NATO minesweepers into the Black Sea, which is contrary to the Montreux Convention. “We have a suspicion that the mines were deliberately introduced. Perhaps they were fired as part of some plan to put pressure on us in order to let NATO minesweepers [through the straits] into the Black Sea. But we are committed to the rules of the Montreux [Convention] and do not let warships enter the Black Sea,” the minister said.\nSo much for NATO solidarity.\nAlso, the first formal appeal for the following: “In the State Duma of Russia, Crimean deputy Mikhail Sheremet today proposed to unite the Republic of Crimea with the Zaporizhia and Kherson regions into the Tauride province within the Russian Federation. “Residents of the regions do not seem to mind – they raise Russian flags everywhere and complain about the attitude of the Ukrainian authorities.”\nAmerican Secretary of Defense Lloyd\naddresses Ukrainian troops\n.\nThis comes on the heels of new revelations of how deeply embedded U.S. and NATO command structures (and troops) are in Ukraine. A French journalist here\ndescribes what he saw\nin his time in Ukraine. In short, he says he was shocked to see American generals running the entire show on the ground, and he says the names of them will be revealed in his new exposé in the French\nFigaro\nnewspaper this week.\nThis is further proof that this conflict is truly NATO vs. Russia, and NATO is losing badly.\nAnother report states: “the United States is moving its advanced headquarters units to the western borders of Ukraine. In particular, the 5th Corps is being relocated. This suggests that it is not the General Staff of the Armed Forces of Ukraine that controls military operations, but NATO officers. And we are at war not with some puppet regime in Kiev, but with the collective West.”\nI couldn’t help but notice that the Tory Party’s defense of Boris Johnson for Partygate, and explanation for why he should not be forced to resign despite a) being found guilty of breaking the law, b) lying to Parliament, and c) facing calls to resign from the First Ministers of Scotland and Wales, among many others,, is that Britain is at war. This is a fascinating statement, in light of the fact that the UK has not actually declared war on anyone since Johnson took office.\nMr Johnson faced more calls to resign over his fine from the leaders of the devolved administrations – but Tory backbenchers hit back at criticism, asking: ‘Don’t they know there’s a war on?’\nBut it’s true. NATO is very actively involved in waging war against Russia, and both the USA and the UK are the most observably belligerent, with personnel, intel, and equipment all being actively engaged against Russian forces. And it’s also obvious that all of the media’s claims that Russia was running out of men and ammunition were completely false, as instead of being forced to conclude operations within two weeks, the media is now reporting that “Russian President Vladimir Putin has massed troops on Ukraine’s eastern flank for fresh offensive on the area.”\nAnd it looks like the third phase of the war may well include Finland and Sweden in addition to Poland, as both formerly neutral countries appear to be on the verge of joining NATO. And if the multiple reports I’ve heard on the topic are correct, Russia will be making use of its first-rate troops equipped with the latest hardware and supported by its best air, armor, and artillery in the third phase.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-04-13T09:45:50+00:00"
}