{
  "url": "https://voxday.net/2022/04/12/subservient-to-satan/",
  "scraped_at": "2026-01-08T13:15:55.102551",
  "title": "“Subservient to Satan”",
  "date_display": "April 12, 2022",
  "date_iso": "2022-04-12T13:00:00+00:00",
  "date_from_url": "2022-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Archbishop Viganò <a href=\"https://www.lifesitenews.com/opinion/abp-vigano-both-society-and-church-infiltrated-by-people-who-want-to-destroy-these-institutions/\">doesn’t pull any punches</a> about the evil of the Deep State, the globalist establishment,  Fake Pope Francis, or the infiltration of what is now the Judeo-Catholic Church.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Dr<em>. </em>Manocchia:<em> The Catholic Church, which has for some time now been committed to ecumenism, and in line with the logic of approval advocated by the globalist oligarchies, seems today to aim at the creation of a single religion, a syncretism that mixes monotheistic doctrines and pagan beliefs, such as the Andean cult of the Pachamama: is this an act of homicide or is it rather a suicidal gesture?</em></strong></p><p><strong>Archbishop Viganò</strong>: Both. On the one hand, the corrupt part of the Hierarchy – which for the sake of brevity I call the <em>deep church</em> – since it is subservient to Satan, hates the Church as the Mystical Body of Christ and intends to kill Her, just as happened to the Church’s Head. But we know that just as Christ is risen, so His Mystical Body will also be resurrected after Her Passion. So yes: those who serve the devil carry out a murderous operation, however crazy and doomed to failure.</p><p>On the other hand, the healthy portion of the hierarchy is mostly composed of bishops and clerics who nevertheless accept the ideological premises of the present apostasy, since they accept the Council and the new liturgy that conveys its errors to the masses. They do not want the Church to succumb, but they are deluding themselves, against all the evidence and after sixty years of failure, by thinking that the Council has merely been misinterpreted, that the new Mass is celebrated badly but that we can return to a certain dignity in the liturgy, that ecumenism is good as long as it is only with the [Eastern] Orthodox but not with idolaters.</p><p>But if they are not convinced that the crisis began with Vatican II, if they do not understand that it was the Council that caused this disaster, and that to remedy it, it is necessary to return to the faith, morals and liturgy that existed before the Council, they are unwittingly part of the problem. They, although with the best intentions, represent that part of the moderates who, in the face of an attack on all fronts, if they do not fight, constitute an obstacle to the solution of the crisis. Their support for the Council and the secularized mentality of the deep church makes their gesture certainly suicidal.</p><p><strong>Dr<em>. </em>Manocchia:<em> Bergoglio has policed the most traditionalist orders: the Franciscans of the Immaculate, the Little Sisters of Mary Mother of the Redeemer. Is he perhaps allergic to authentic vocations or are the goods of these congregations tempting to someone?</em></strong></p><p><strong>Archbishop Viganò</strong>: At a time when the Church is suffering the drastic reduction in the offerings and donations made by the faithful due to the economic crisis caused by the psychopandemic, the closure of churches, and the disgust of many Catholics for the work of Bergoglio and the bishops, it is evident that gathering a little money and real estate is a convenient way to pad the disastrous Vatican coffers.</p><p>But the real reason, the one that motivates every action of the Bergoglian Church, is the relentless hatred for Tradition, of which the contemplative and conservative orders are an eloquent manifestation. Imagine the anger of these modernists who – at the same time that the most progressive communities are dying out and religious orders are disappearing in the crisis of vocations, and the loss of many who have abandoned religious life – witness monasteries and institutes flourish again in which there is discipline, fidelity to the rule of the founder, true poverty, penance, the spirit of recollection and the Tridentine Liturgy. All this makes their [the Bergoglian’s] failure evident and therefore it must be eliminated, so that it may not be seen that Tradition has a much greater following (and would have enormously more, if it were not systematically boycotted) than the post-conciliar religion with its priests without cassocks, its nuns without veils, its religious who do not pray, and its empty churches.</p><p>In Bergoglio’s mind, the only vocations that deserve his approval are those that are modernist, inclusive, aimed at the existential peripheries, and composed of doctrinal nothingness, moral emptiness, and trite humanitarian slogans. As soon as a vocation shows even vague signs of being genuinely Catholic and animated by the desire to give glory to God and save souls, it is attacked as being an expression of clericalism, intolerance, fundamentalism, rigidity … with all the Bergoglian repertoire of more or less offensive words that is one of the techniques used to criminalize the adversary, a method already successfully tested ever since the Council.</p></blockquote><p>There can be no compromise with such wickedness. And even if you find it hard to believe in anything beyond the physical world, the material evil of these men simply cannot be denied.</p><p><em><a href=\"https://social.infogalactic.com/micropost/07ef160a-358b-4670-a0e8-4b9c22f33bbe\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Archbishop Viganò\ndoesn’t pull any punches\nabout the evil of the Deep State, the globalist establishment,  Fake Pope Francis, or the infiltration of what is now the Judeo-Catholic Church.\nDr\n.\nManocchia:\nThe Catholic Church, which has for some time now been committed to ecumenism, and in line with the logic of approval advocated by the globalist oligarchies, seems today to aim at the creation of a single religion, a syncretism that mixes monotheistic doctrines and pagan beliefs, such as the Andean cult of the Pachamama: is this an act of homicide or is it rather a suicidal gesture?\nArchbishop Viganò\n: Both. On the one hand, the corrupt part of the Hierarchy – which for the sake of brevity I call the\ndeep church\n– since it is subservient to Satan, hates the Church as the Mystical Body of Christ and intends to kill Her, just as happened to the Church’s Head. But we know that just as Christ is risen, so His Mystical Body will also be resurrected after Her Passion. So yes: those who serve the devil carry out a murderous operation, however crazy and doomed to failure.\nOn the other hand, the healthy portion of the hierarchy is mostly composed of bishops and clerics who nevertheless accept the ideological premises of the present apostasy, since they accept the Council and the new liturgy that conveys its errors to the masses. They do not want the Church to succumb, but they are deluding themselves, against all the evidence and after sixty years of failure, by thinking that the Council has merely been misinterpreted, that the new Mass is celebrated badly but that we can return to a certain dignity in the liturgy, that ecumenism is good as long as it is only with the [Eastern] Orthodox but not with idolaters.\nBut if they are not convinced that the crisis began with Vatican II, if they do not understand that it was the Council that caused this disaster, and that to remedy it, it is necessary to return to the faith, morals and liturgy that existed before the Council, they are unwittingly part of the problem. They, although with the best intentions, represent that part of the moderates who, in the face of an attack on all fronts, if they do not fight, constitute an obstacle to the solution of the crisis. Their support for the Council and the secularized mentality of the deep church makes their gesture certainly suicidal.\nDr\n.\nManocchia:\nBergoglio has policed the most traditionalist orders: the Franciscans of the Immaculate, the Little Sisters of Mary Mother of the Redeemer. Is he perhaps allergic to authentic vocations or are the goods of these congregations tempting to someone?\nArchbishop Viganò\n: At a time when the Church is suffering the drastic reduction in the offerings and donations made by the faithful due to the economic crisis caused by the psychopandemic, the closure of churches, and the disgust of many Catholics for the work of Bergoglio and the bishops, it is evident that gathering a little money and real estate is a convenient way to pad the disastrous Vatican coffers.\nBut the real reason, the one that motivates every action of the Bergoglian Church, is the relentless hatred for Tradition, of which the contemplative and conservative orders are an eloquent manifestation. Imagine the anger of these modernists who – at the same time that the most progressive communities are dying out and religious orders are disappearing in the crisis of vocations, and the loss of many who have abandoned religious life – witness monasteries and institutes flourish again in which there is discipline, fidelity to the rule of the founder, true poverty, penance, the spirit of recollection and the Tridentine Liturgy. All this makes their [the Bergoglian’s] failure evident and therefore it must be eliminated, so that it may not be seen that Tradition has a much greater following (and would have enormously more, if it were not systematically boycotted) than the post-conciliar religion with its priests without cassocks, its nuns without veils, its religious who do not pray, and its empty churches.\nIn Bergoglio’s mind, the only vocations that deserve his approval are those that are modernist, inclusive, aimed at the existential peripheries, and composed of doctrinal nothingness, moral emptiness, and trite humanitarian slogans. As soon as a vocation shows even vague signs of being genuinely Catholic and animated by the desire to give glory to God and save souls, it is attacked as being an expression of clericalism, intolerance, fundamentalism, rigidity … with all the Bergoglian repertoire of more or less offensive words that is one of the techniques used to criminalize the adversary, a method already successfully tested ever since the Council.\nThere can be no compromise with such wickedness. And even if you find it hard to believe in anything beyond the physical world, the material evil of these men simply cannot be denied.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2022-04-12T13:36:02+00:00"
}