{
  "url": "https://voxday.net/2022/04/03/the-five-fronts-of-imperial-collapse/",
  "scraped_at": "2026-01-08T13:14:58.807120",
  "title": "The Five Fronts of Imperial Collapse",
  "date_display": "April 3, 2022",
  "date_iso": "2022-04-03T17:48:34+00:00",
  "date_from_url": "2022-04-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A fascinating <a href=\"https://thesaker.is/events-like-these-only-happen-once-every-century-sergey-glazyev/\">interview with Sergey Glazyev</a>, who points out that events of the sort we are witnessing “only happen once a century”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Among the Russian elite there are many opponents of an alliance with China. At least, before the special operation in Ukraine, it seemed to these people that American and Western culture is more understandable and closer to us than hieroglyphic Chinese wisdom, and that we will always find a common language with our “Western partners”.</strong></p><p>– You know, back in 2015 I wrote the book <em>The Last World War. The USA is Starting and Losing</em>, which you mentioned at the beginning of the conversation – everything was thought out and justified there. The United States embarked on a worldwide hybrid war – started with the Orange Revolutions to disrupt regions of the world it did not control – in order to strengthen its position and weaken the position of geopolitical rivals. After the famous Munich speech of President Putin in February 2007, they realized that they had lost control over Yeltsin’s Russia, and this seriously worried them. In 2008, the financial crisis broke out and it became clear that the transition to a new technological order was beginning, and the old world economic order and the previous management system no longer ensured sustainable economic development. China was now leading the way. Well, then afterwards the logic of deploying of a world war happens, only not in the forms that existed 100 years ago, but on three conditional fronts – monetary-financial (where the United States still dominates the world), trade-economic (where they have already lost superiority to China) and information-cognitive (where the Americans also have technologies that are superior to ours). They use all three of these fronts in an attempt to keep the initiative and maintain the hegemony of their corporations.</p><p>Well and finally, the fourth front is the biological one, which opened with the advent of the coronavirus from the US-Chinese laboratory in Wuhan. Today we see that a whole network of biological laboratories existed in Ukraine. So the United States has long been preparing to open the biological front of the world war.</p><p>The fifth, and most obvious, front is, in fact, the front of combat fighting – as the last tool for forcing the states that they control into unquestioning obedience. Today, the situation on this front is also escalating. That is, active operations are underway on all five fronts of the world hybrid war, and the result can be predicted. The Americans will not be able to win, just as the British did not succeed in their time. Although Britain formally won World War II, they lost politically and economically. The British lost their entire empire, losing more than 90 percent of the territory and 95 percent of the population. Two years after World War II, where they were the winners, their empire collapsed like a house of cards, because the other two winners – the USSR and the USA – did not need this empire and viewed it as an anachronism. Also, the world will not need American transnational corporations, the American dollar, American monetary and financial technologies and financial pyramids. All this will be a thing of the past in the near future. Southeast Asia will become the obvious leader in world economic development, and a new world economic order will be formed before our very eyes.</p></blockquote><p>God blessed America, and Americans threw away that blessing in favor of hedonism, sin, tolerance, and world domination. Now Americans are ruled by women and foreigners, and the world is passing it by, just as it has always forgotten the past hosts of The Empire That Never Ended.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0ff77d75-6f5c-4d9c-9a07-0fe23f6ec467\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A fascinating\ninterview with Sergey Glazyev\n, who points out that events of the sort we are witnessing “only happen once a century”.\nAmong the Russian elite there are many opponents of an alliance with China. At least, before the special operation in Ukraine, it seemed to these people that American and Western culture is more understandable and closer to us than hieroglyphic Chinese wisdom, and that we will always find a common language with our “Western partners”.\n– You know, back in 2015 I wrote the book\nThe Last World War. The USA is Starting and Losing\n, which you mentioned at the beginning of the conversation – everything was thought out and justified there. The United States embarked on a worldwide hybrid war – started with the Orange Revolutions to disrupt regions of the world it did not control – in order to strengthen its position and weaken the position of geopolitical rivals. After the famous Munich speech of President Putin in February 2007, they realized that they had lost control over Yeltsin’s Russia, and this seriously worried them. In 2008, the financial crisis broke out and it became clear that the transition to a new technological order was beginning, and the old world economic order and the previous management system no longer ensured sustainable economic development. China was now leading the way. Well, then afterwards the logic of deploying of a world war happens, only not in the forms that existed 100 years ago, but on three conditional fronts – monetary-financial (where the United States still dominates the world), trade-economic (where they have already lost superiority to China) and information-cognitive (where the Americans also have technologies that are superior to ours). They use all three of these fronts in an attempt to keep the initiative and maintain the hegemony of their corporations.\nWell and finally, the fourth front is the biological one, which opened with the advent of the coronavirus from the US-Chinese laboratory in Wuhan. Today we see that a whole network of biological laboratories existed in Ukraine. So the United States has long been preparing to open the biological front of the world war.\nThe fifth, and most obvious, front is, in fact, the front of combat fighting – as the last tool for forcing the states that they control into unquestioning obedience. Today, the situation on this front is also escalating. That is, active operations are underway on all five fronts of the world hybrid war, and the result can be predicted. The Americans will not be able to win, just as the British did not succeed in their time. Although Britain formally won World War II, they lost politically and economically. The British lost their entire empire, losing more than 90 percent of the territory and 95 percent of the population. Two years after World War II, where they were the winners, their empire collapsed like a house of cards, because the other two winners – the USSR and the USA – did not need this empire and viewed it as an anachronism. Also, the world will not need American transnational corporations, the American dollar, American monetary and financial technologies and financial pyramids. All this will be a thing of the past in the near future. Southeast Asia will become the obvious leader in world economic development, and a new world economic order will be formed before our very eyes.\nGod blessed America, and Americans threw away that blessing in favor of hedonism, sin, tolerance, and world domination. Now Americans are ruled by women and foreigners, and the world is passing it by, just as it has always forgotten the past hosts of The Empire That Never Ended.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "economics",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-04-03T17:49:03+00:00"
}