{
  "url": "https://voxday.net/2020/10/31/2020-as-1850-2/",
  "scraped_at": "2025-12-21T13:13:47.774189",
  "title": "2020 as 1850",
  "date_display": "October 31, 2020",
  "date_iso": "2020-10-31T15:58:42+00:00",
  "date_from_url": "2020-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The idea here is considerably less interesting than the source, as it appears that even the converged champions of diversity are beginning to understand that the future is unlikely to bring smooth sailing into their imagined utopia of tolerance, equality, progress, inclusion, and diversity, as <i>The Atlantic</i> explains <a href=\"https://www.msn.com/en-us/news/opinion/why-the-2020s-could-be-as-dangerous-as-the-1850s/ar-BB1axkV2\" rel=\"noopener noreferrer\" target=\"_blank\">“Why the 2020s Could Be as Dangerous as the 1850s”</a>:</p><blockquote><p>If Joe Biden beats Donald Trump decisively next week, this election may be remembered as a hinge point in American history: the moment when a clear majority of voters acknowledged that there’s no turning back from America’s transformation into a nation of kaleidoscopic diversity, a future that doesn’t rely on a backward-facing promise to make America great again. But that doesn’t mean the voters who embody the nation’s future are guaranteed a lasting victory over those who feel threatened by it.</p><p>With Biden embracing America’s evolution and Trump appealing unrestrainedly to the white voters most fearful of it, the 2020 campaign marks a new peak in the most powerful trend shaping politics in this century. Over the past two decades, and especially since Barack Obama’s election in 2008, voters have re-sorted among the parties and thus reconfigured the central fault line between them. Today Republicans and Democrats are divided less by class or region than by attitudes toward the propulsive demographic, cultural, and economic shifts remaking 21st-century America. On one side, Republicans now mobilize what I’ve called a “coalition of restoration”; on the other, Democrats assemble a “coalition of transformation.”</p></blockquote><p>So far so good. The only two errors so far is the suggestion that Joe Biden will win the election; not only will he not decisively beat Donald Trump, he will be decisively beaten, as well as the assumption that the “coalition of restoration” is necessarily shrinking. <i>The Atlantic</i> is making the usual left-wing error of the Ricardian Vice, in which all variables save one are held constant. Just as leftists never understand that people’s behavior changes in response to tax hikes, it also changes in response to demographic changes.</p><p>The next section is where it all goes awry. It is downright comical to posit that California, of all places, is the “hopeful vision” for the way forward for a victorious coalition of transformation. Then again, what does <i>The Atlantic</i> know about the West Coast or the ruthless preferences of the increasingly powerful second coming of the Aztec Empire? Would the return of the Mexica to the Southwest be better characterized as restoration or transformation?</p><blockquote><p>The inexorable change coming to the Democratic Party could make the GOP even more reactionary. Biden has defined himself as a “transitional” figure, and demands are already building for a Democratic leadership corps that reflects the party’s increasing reliance on young people and people of color. It’s not hard to imagine that by 2024, Democrats will be led by presidential nominee Kamala Harris, who is of Jamaican and Indian descent; vice-presidential nominee Pete Buttigieg, an openly gay man; and House Speaker Hakeem Jeffries, who would be the first Black person to hold that post. Much like Obama did in 2008, such a roster would symbolize a changing America in a way that inspires the coalition of transformation—but terrifies many in the coalition of restoration. “It would touch on everything that a lot of Trump supporters were reacting to when they supported him in 2016—this sense of feeling threatened by the [challenge] to white supremacy in the U.S.,” Schaffner told me.</p><p>California over the past 30 years may offer a hopeful vision of how America could work through these coming conflicts. During the 1990s, as minorities were slowly becoming a majority of the state’s population, racial tension soared. With preponderant support from white voters, conservatives passed a series of ballot initiatives targeting those minority groups, including Proposition 187, which cut off services for undocumented immigrants; a ban on bilingual education; and tougher criminal-sentencing laws. But once California passed the racial tipping point and the sky didn’t fall, tensions dramatically eased. In years since, the state has repealed much of the hard-line agenda it approved during the 1990s. If that’s the nation’s path, the next few years may be rocky, but today’s political fault lines could slowly dissolve. Americans could re-sort themselves around less volatile differences over taxes and spending, instead of their feelings about racial and cultural change.</p><p>The alternative is the 1850s scenario. On that path, the Republican coalition remains centered on culturally conservative white Americans who grow more embittered and radical as evidence mounts that they cannot stop the emerging majority from instituting its agenda. If this many non-college-educated and Christian white voters are receptive to a Trump-style racial-identity message when they constitute a little more than 40 percent of the population, there’s little reason to believe fewer of them will respond to it when they fall to 38 or 36 percent as the decade proceeds. Already, research by the Vanderbilt University political scientist Larry Bartels has found that a stunningly high percentage of Republican voters express sympathy for an array of antidemocratic sentiments, such as the half who agreed that the “traditional American way of life is disappearing so fast that we may have to use force to save it.”</p></blockquote><p>There is no alternative. The nation has already been defeated and the state is now in the same process of partition and separation that Eastern Europe and the former Soviet Union have gone through, although there is little reason to believe that the dissolution of the United States empire will be anywhere nearly as peaceful, given that the various peoples are far more distinct than the Czechs and the Slovaks or the Serbs and the Croats.</p><p>It is interesting, though, to see how more and more people on both sides of the political aisle are beginning to recognize that the endgame for empire is in sight.</p></div>",
  "content_text": "The idea here is considerably less interesting than the source, as it appears that even the converged champions of diversity are beginning to understand that the future is unlikely to bring smooth sailing into their imagined utopia of tolerance, equality, progress, inclusion, and diversity, as\nThe Atlantic\nexplains\n“Why the 2020s Could Be as Dangerous as the 1850s”\n:\nIf Joe Biden beats Donald Trump decisively next week, this election may be remembered as a hinge point in American history: the moment when a clear majority of voters acknowledged that there’s no turning back from America’s transformation into a nation of kaleidoscopic diversity, a future that doesn’t rely on a backward-facing promise to make America great again. But that doesn’t mean the voters who embody the nation’s future are guaranteed a lasting victory over those who feel threatened by it.\nWith Biden embracing America’s evolution and Trump appealing unrestrainedly to the white voters most fearful of it, the 2020 campaign marks a new peak in the most powerful trend shaping politics in this century. Over the past two decades, and especially since Barack Obama’s election in 2008, voters have re-sorted among the parties and thus reconfigured the central fault line between them. Today Republicans and Democrats are divided less by class or region than by attitudes toward the propulsive demographic, cultural, and economic shifts remaking 21st-century America. On one side, Republicans now mobilize what I’ve called a “coalition of restoration”; on the other, Democrats assemble a “coalition of transformation.”\nSo far so good. The only two errors so far is the suggestion that Joe Biden will win the election; not only will he not decisively beat Donald Trump, he will be decisively beaten, as well as the assumption that the “coalition of restoration” is necessarily shrinking.\nThe Atlantic\nis making the usual left-wing error of the Ricardian Vice, in which all variables save one are held constant. Just as leftists never understand that people’s behavior changes in response to tax hikes, it also changes in response to demographic changes.\nThe next section is where it all goes awry. It is downright comical to posit that California, of all places, is the “hopeful vision” for the way forward for a victorious coalition of transformation. Then again, what does\nThe Atlantic\nknow about the West Coast or the ruthless preferences of the increasingly powerful second coming of the Aztec Empire? Would the return of the Mexica to the Southwest be better characterized as restoration or transformation?\nThe inexorable change coming to the Democratic Party could make the GOP even more reactionary. Biden has defined himself as a “transitional” figure, and demands are already building for a Democratic leadership corps that reflects the party’s increasing reliance on young people and people of color. It’s not hard to imagine that by 2024, Democrats will be led by presidential nominee Kamala Harris, who is of Jamaican and Indian descent; vice-presidential nominee Pete Buttigieg, an openly gay man; and House Speaker Hakeem Jeffries, who would be the first Black person to hold that post. Much like Obama did in 2008, such a roster would symbolize a changing America in a way that inspires the coalition of transformation—but terrifies many in the coalition of restoration. “It would touch on everything that a lot of Trump supporters were reacting to when they supported him in 2016—this sense of feeling threatened by the [challenge] to white supremacy in the U.S.,” Schaffner told me.\nCalifornia over the past 30 years may offer a hopeful vision of how America could work through these coming conflicts. During the 1990s, as minorities were slowly becoming a majority of the state’s population, racial tension soared. With preponderant support from white voters, conservatives passed a series of ballot initiatives targeting those minority groups, including Proposition 187, which cut off services for undocumented immigrants; a ban on bilingual education; and tougher criminal-sentencing laws. But once California passed the racial tipping point and the sky didn’t fall, tensions dramatically eased. In years since, the state has repealed much of the hard-line agenda it approved during the 1990s. If that’s the nation’s path, the next few years may be rocky, but today’s political fault lines could slowly dissolve. Americans could re-sort themselves around less volatile differences over taxes and spending, instead of their feelings about racial and cultural change.\nThe alternative is the 1850s scenario. On that path, the Republican coalition remains centered on culturally conservative white Americans who grow more embittered and radical as evidence mounts that they cannot stop the emerging majority from instituting its agenda. If this many non-college-educated and Christian white voters are receptive to a Trump-style racial-identity message when they constitute a little more than 40 percent of the population, there’s little reason to believe fewer of them will respond to it when they fall to 38 or 36 percent as the decade proceeds. Already, research by the Vanderbilt University political scientist Larry Bartels has found that a stunningly high percentage of Republican voters express sympathy for an array of antidemocratic sentiments, such as the half who agreed that the “traditional American way of life is disappearing so fast that we may have to use force to save it.”\nThere is no alternative. The nation has already been defeated and the state is now in the same process of partition and separation that Eastern Europe and the former Soviet Union have gone through, although there is little reason to believe that the dissolution of the United States empire will be anywhere nearly as peaceful, given that the various peoples are far more distinct than the Czechs and the Slovaks or the Serbs and the Croats.\nIt is interesting, though, to see how more and more people on both sides of the political aisle are beginning to recognize that the endgame for empire is in sight.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-31T15:58:42+00:00"
}