{
  "url": "https://voxday.net/2020/10/08/a-moment-of-surreality/",
  "scraped_at": "2025-12-21T13:10:32.088928",
  "title": "A moment of surreality",
  "date_display": "October 8, 2020",
  "date_iso": "2020-10-08T22:53:09+00:00",
  "date_from_url": "2020-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> As Darkstream viewers know, I think rather highly of the marketing book<i> In Search of Stupidity</i>. I’ve read the 2nd edition twice – I borrowed the paperback from Farley at his recommendation – and after discovering that <a href=\"https://softletter.com/product/in-search-of-stupidity-3rd-ed/\" rel=\"noopener noreferrer\" target=\"_blank\">an updated 3rd edition</a> had been released, I went and picked up a copy. I’m about halfway through it, and you can probably understand I was a little startled by the following passage from the chapter on Amazon and its war with the Big Five publishers.</p><blockquote><p>Another problem with Karnivorous is that it seems he has a distinct political bias. In March 2018, members of the Conservative Libertarian Fiction Alliance (CLFA) began reporting that many of their book reviews were disappearing from Amazon; in some cases, all reviews were pulled down. As always, Amazon refused to say why. Progressive and liberal authors writing on topics similar to the conservatives and libertarians did not have their reviews purged. The CFLA begin to push back publicly, and some authors such as sci-fi author Jon Del Arroz had their reviews restored. Arroz had his own theory on what had happened: </p><p><i>“I believe the CLFA was targeted by an extreme alt-left troll mob running an email harassment campaign to Amazon who were enabled by a rogue Amazon employee.”</i></p><p>This was not paranoia on Arroz’s part. In 2017, an Amazon employee had temporarily succeeded in having a book released by conservative publisher Castalia House kicked off Kindle until their behavior was uncovered.</p></blockquote><p>As readers here will recall, the SJWs in the KDP department <a href=\"http://voxday.blogspot.com/2019/01/amazon-takes-down-castalia-house.html\" rel=\"noopener noreferrer\" target=\"_blank\">behaved even more egregoiusly</a> in 2019. While their customer service first told <a href=\"http://voxday.blogspot.com/2019/01/lies-lies-lies.html\" rel=\"noopener noreferrer\" target=\"_blank\">a bunch of lies</a>, the KDP department’s actions <a href=\"http://voxday.blogspot.com/2019/01/reinstated.html\" rel=\"noopener noreferrer\" target=\"_blank\">were subsequently determined</a> to have been based on “incorrect” information and Castalia’s account was quickly reinstated. While we did manage to get everything sorted out in only 18 hours, the incident served to confirm the importance of the strategic shift we had already begun. Now we’re moving off of Audible in favor of the Arkhaven store and it may not be long before we abandon KDP as well.</p></div>",
  "content_text": "As Darkstream viewers know, I think rather highly of the marketing book\nIn Search of Stupidity\n. I’ve read the 2nd edition twice – I borrowed the paperback from Farley at his recommendation – and after discovering that\nan updated 3rd edition\nhad been released, I went and picked up a copy. I’m about halfway through it, and you can probably understand I was a little startled by the following passage from the chapter on Amazon and its war with the Big Five publishers.\nAnother problem with Karnivorous is that it seems he has a distinct political bias. In March 2018, members of the Conservative Libertarian Fiction Alliance (CLFA) began reporting that many of their book reviews were disappearing from Amazon; in some cases, all reviews were pulled down. As always, Amazon refused to say why. Progressive and liberal authors writing on topics similar to the conservatives and libertarians did not have their reviews purged. The CFLA begin to push back publicly, and some authors such as sci-fi author Jon Del Arroz had their reviews restored. Arroz had his own theory on what had happened:\n“I believe the CLFA was targeted by an extreme alt-left troll mob running an email harassment campaign to Amazon who were enabled by a rogue Amazon employee.”\nThis was not paranoia on Arroz’s part. In 2017, an Amazon employee had temporarily succeeded in having a book released by conservative publisher Castalia House kicked off Kindle until their behavior was uncovered.\nAs readers here will recall, the SJWs in the KDP department\nbehaved even more egregoiusly\nin 2019. While their customer service first told\na bunch of lies\n, the KDP department’s actions\nwere subsequently determined\nto have been based on “incorrect” information and Castalia’s account was quickly reinstated. While we did manage to get everything sorted out in only 18 hours, the incident served to confirm the importance of the strategic shift we had already begun. Now we’re moving off of Audible in favor of the Arkhaven store and it may not be long before we abandon KDP as well.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-08T21:53:09+00:00"
}