{
  "url": "https://voxday.net/2020/10/08/bye-gamma/",
  "scraped_at": "2025-12-21T13:10:30.256388",
  "title": "Bye, Gamma",
  "date_display": "October 8, 2020",
  "date_iso": "2020-10-08T12:45:23+00:00",
  "date_from_url": "2020-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I understand that in this age of direct communications, it is sometimes easier to go directly to someone you know happens to have the information than proceed through the conventional channels, which can be slow and inefficient. That’s suboptimal, but it’s more or less fine. And I understand that not everyone reads every email, or post, or SocialGalactic update; despite our best efforts to keep everyone informed, someone is always going to fall through the cracks. </p><p>But I am neither sales support nor technical support. If you send an email to my personal address, then you are going to get a personal response. You will not receive a professional or a corporate one. It may be helpful and informative, or it may not be. </p><p>Translation: if you’re expecting some sort of “the customer is always right” posture from me, you’re in for a serious surprise. You’re not my customer and I’m not whatever the Hell you appear to think I am. If you suspect you’re inclined to flounce away in a snit because you think my failure to sufficiently kowtow to the Blessed and Thrice-Sanctified Customer is some sort of insult, just save us all the trouble and go away now. And if you have a problem with that, I suggest sending an email to Bill Gates about your problem printing from OpenOffice Writer in Windows 10, or to Scott Shannon at Penguin Random House about your inability to open your newly purchased ebook, for the sake of comparison.</p><p>Forget Pareto, one thing I’ve learned over 30+ years in the workforce is that one percent of the customers cause 95 percent of the trouble. Let this be henceforth known as the Day Principle of Customer Service. Logic dictates that an operation should seek to get rid of that one percent as expeditiously as possible in order to focus on making the products and services better for the 99 percent who just want quality goods and functional services.</p><p>What is particularly annoying about this to me is that this sort of idiot customer <i>invariably </i>expects a much higher standard of sales and technical support from startups with few hands on deck and limited resources than they do from giant corporations with tens of thousands of employees and near-infinite financial resources. Would they actually prefer it if we imitated the tech giants, hid our emails, and directed all communications to a call center staffed with third-worlders who have no information and no hope of being able to resolve any problem?</p></div>",
  "content_text": "Now, I understand that in this age of direct communications, it is sometimes easier to go directly to someone you know happens to have the information than proceed through the conventional channels, which can be slow and inefficient. That’s suboptimal, but it’s more or less fine. And I understand that not everyone reads every email, or post, or SocialGalactic update; despite our best efforts to keep everyone informed, someone is always going to fall through the cracks.\nBut I am neither sales support nor technical support. If you send an email to my personal address, then you are going to get a personal response. You will not receive a professional or a corporate one. It may be helpful and informative, or it may not be.\nTranslation: if you’re expecting some sort of “the customer is always right” posture from me, you’re in for a serious surprise. You’re not my customer and I’m not whatever the Hell you appear to think I am. If you suspect you’re inclined to flounce away in a snit because you think my failure to sufficiently kowtow to the Blessed and Thrice-Sanctified Customer is some sort of insult, just save us all the trouble and go away now. And if you have a problem with that, I suggest sending an email to Bill Gates about your problem printing from OpenOffice Writer in Windows 10, or to Scott Shannon at Penguin Random House about your inability to open your newly purchased ebook, for the sake of comparison.\nForget Pareto, one thing I’ve learned over 30+ years in the workforce is that one percent of the customers cause 95 percent of the trouble. Let this be henceforth known as the Day Principle of Customer Service. Logic dictates that an operation should seek to get rid of that one percent as expeditiously as possible in order to focus on making the products and services better for the 99 percent who just want quality goods and functional services.\nWhat is particularly annoying about this to me is that this sort of idiot customer\ninvariably\nexpects a much higher standard of sales and technical support from startups with few hands on deck and limited resources than they do from giant corporations with tens of thousands of employees and near-infinite financial resources. Would they actually prefer it if we imitated the tech giants, hid our emails, and directed all communications to a call center staffed with third-worlders who have no information and no hope of being able to resolve any problem?",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-08T11:45:23+00:00"
}