{
  "url": "https://voxday.net/2020/10/05/coinbase-cleans-house/",
  "scraped_at": "2025-12-21T13:10:08.625836",
  "title": "Coinbase cleans house",
  "date_display": "October 5, 2020",
  "date_iso": "2020-10-05T08:54:39+00:00",
  "date_from_url": "2020-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.revolver.news/2020/10/did-coinbase-ceo-just-launch-the-anti-woke-counterrevolution/\">And the SJWs are panicked</a> at the thought that other CEOs will follow the example set by Coinbase CEO Brian Armstrong:</p><blockquote><p>It’s obvious what is motivating Armstrong. For years, activists concentrated in dead-weight departments like HR and advertising have assimilated functional, profitable companies into the left’s totalitarian borg. They demand racial hiring quotas, corporate censorship, and the propagation of sickening transgender propaganda.</p><p>Armstrong saw that a revolution like this was coming to his own company. According to Coindesk, “Armstrong began to plan for the company’s new position after several Coinbase engineers closed their laptops one day over the summer after Armstrong wouldn’t say ‘black lives matter’ externally amid social unrest over police killings of unarmed black men and women.”</p><p>Armstrong decided he wouldn’t be threatened. He’d heard the maxim “get woke, go broke” and bravely decided to quash the revolution before it happened. He didn’t pledge support for Donald Trump. He didn’t rename his company Coinbased. He merely said his company would abstain from politics, both publicly and in the workplace. But in 2020, even this is a revolutionary act, and Armstrong knows it. On Wednesday, he sent a follow-up letter to employees announcing that if any weren’t up for keeping politics and work separate, he’d pay them to go away. Six months of severance pay, it turns out, is a small price to purge far-left extremists from one’s company.</p><p>It is no wonder then that Armstrong’s defiant stand has the press and woke capital in a panic. It’s obvious that the vast majority of people, and in particular the vast majority of productive workers, prefer Armstrong’s corporate vision. They want to work at a business, not a gulag. If Armstrong can thrive while vocally rejecting the left’s political demands, then other corporate leaders will be emboldened to do the same.</p></blockquote><p>While some people have theorized that Armstrong read <i>Corporate Cancer</i>, there is no reason to assume that’s the case. The connection between convergence and corporate losses is both obvious and undeniable – the NBA has lost 15.2 million viewers per Finals game, 77 percent of its TV audience, in the three years since 2017 – and Armstrong’s measures are very mild compared to those recommended in the book.</p><p>Imagine how terrified the reaction would be if corporations actually began eliminating their HR departments, hunting down their SJWs, and actively firing anyone who engaged in infracorporate activism in lieu of doing their jobs.</p></div>",
  "content_text": "And the SJWs are panicked\nat the thought that other CEOs will follow the example set by Coinbase CEO Brian Armstrong:\nIt’s obvious what is motivating Armstrong. For years, activists concentrated in dead-weight departments like HR and advertising have assimilated functional, profitable companies into the left’s totalitarian borg. They demand racial hiring quotas, corporate censorship, and the propagation of sickening transgender propaganda.\nArmstrong saw that a revolution like this was coming to his own company. According to Coindesk, “Armstrong began to plan for the company’s new position after several Coinbase engineers closed their laptops one day over the summer after Armstrong wouldn’t say ‘black lives matter’ externally amid social unrest over police killings of unarmed black men and women.”\nArmstrong decided he wouldn’t be threatened. He’d heard the maxim “get woke, go broke” and bravely decided to quash the revolution before it happened. He didn’t pledge support for Donald Trump. He didn’t rename his company Coinbased. He merely said his company would abstain from politics, both publicly and in the workplace. But in 2020, even this is a revolutionary act, and Armstrong knows it. On Wednesday, he sent a follow-up letter to employees announcing that if any weren’t up for keeping politics and work separate, he’d pay them to go away. Six months of severance pay, it turns out, is a small price to purge far-left extremists from one’s company.\nIt is no wonder then that Armstrong’s defiant stand has the press and woke capital in a panic. It’s obvious that the vast majority of people, and in particular the vast majority of productive workers, prefer Armstrong’s corporate vision. They want to work at a business, not a gulag. If Armstrong can thrive while vocally rejecting the left’s political demands, then other corporate leaders will be emboldened to do the same.\nWhile some people have theorized that Armstrong read\nCorporate Cancer\n, there is no reason to assume that’s the case. The connection between convergence and corporate losses is both obvious and undeniable – the NBA has lost 15.2 million viewers per Finals game, 77 percent of its TV audience, in the three years since 2017 – and Armstrong’s measures are very mild compared to those recommended in the book.\nImagine how terrified the reaction would be if corporations actually began eliminating their HR departments, hunting down their SJWs, and actively firing anyone who engaged in infracorporate activism in lieu of doing their jobs.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-05T07:54:39+00:00"
}