{
  "url": "https://voxday.net/2020/10/11/dr-jordan-peterson-plagiarist/",
  "scraped_at": "2025-12-21T13:10:53.260049",
  "title": "Dr. Jordan Peterson, plagiarist",
  "date_display": "October 11, 2020",
  "date_iso": "2020-10-11T16:33:34+00:00",
  "date_from_url": "2020-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The accusation strikes me as bordering on the impossible, given how incoherent Dr. Peterson’s writing is. But what is much more remarkable than the accusation of plagiarism is the identity of the author Jordan Peterson is supposedly plagiarizing:</p><p><i></i></p><blockquote><p><i>The Devil and His Due: How Jordan Peterson Plagiarizes Adolf Hitler</i> by Troy Parfitt offers into evidence some 3,100 instances of Dr. Jordan B. Peterson allegedly copying the written and spoken text of Adolf Hitler. Volume One of a two-volume series will be released on November 1, 2020 in e-book and paperback edition. Its length is 460 pages.</p><p>Jordan Peterson is a professor of psychology at the University of Toronto, best-selling author of <i>12 Rules for Life</i>, and pop-psych guru whose YouTube channel boasts 2.87 million subscribers. Often described as controversial, Peterson shot to fame after challenging Canada’s Bill C-16, which made it illegal to deny employment to or discriminate against people based on their gender identity or expression.</p><p>In <i>The Devil and His Due</i>, Parfitt argues that “the Jordan Peterson Phenomenon” is a mainstream cult whose leader identifies as “the saviour,” feigns Christian beliefs, glorifies Satan, discusses “the Jewish question,” encourages converts to slaughter goats in backyard sacrifices that ought to be “sufficiently bloody,” suggests that suicide can be an effective method for achieving revenge, touts banned substances as “miracle cures,” and teaches that the alt-right project is “incomplete.” Parfitt also asserts that Peterson employs Hitlerite speech to communicate in a crypto-fascist code, but that his supporters seem generally unaware of this.</p><p>Parfitt wondered if Peterson might have been borrowing from Hitler after noticing that he frequently complimented the dictator. “He says he’s rescuing people from the clutches of the far-right, but tells his followers that Hitler was a genius who was good at nearly everything, so I read <i>Mein Kampf </i>to see if he had found it inspiring. What I discovered was blatant academic theft.” Parfitt claims that Peterson’s <i>12 Rules for Life</i> and<i> Maps of Meaning</i> are riddled with language and ideas from Hitler’s <i>Mein Kampf</i>, <i>Second Book</i>, <i>Table Talk,</i> and speeches. </p></blockquote><p>Do you know what this means? It means Jordan Peterson is <i>literally </i>Hitler. We are amused. </p><p>Nevertheless, color me very, very dubious indeed. Because as awful as Jordan Peterson is, those who have read <i>Jordanetics </i>will know that Jordan Peterson didn’t even manage to get Hitler’s description of “the Big Lie” correct. </p><p>Don’t bother asking for a link. This is from a press release from the publisher.</p><p><b>UPDATE:</b> Interesting. Speaking of those who have read <i>Jordanetics</i>, the author may not be anywhere nearly as out there as the press release makes it sound. If nothing else, Parfitt correctly picked up <a href=\"https://www.iheart.com/podcast/269-digital-defector-65271721/episode/vox-day-confirmed-troy-parfitts-bizarre-67704613/\" rel=\"noopener noreferrer\" target=\"_blank\">on the occult elements</a> of Peterson’s philosophy.</p><blockquote><p>As author Troy Parfitt began to doubt his own sanity with his discoveries of Jordan Peterson’s freakish love affair with the occult, Vox Day’s book “Jordanetics: A Journey Into the Mind of Humanity’s Greatest Thinker” provided a welcome validation that it was not Parfitt who had lost his marbles, but Peterson.</p><p>It is impossible that Day’s and Parfitt’s revelations about Jordan Peterson’s infatuation with the occult–and indeed the Great Beast himself, Aleister Crowley–could be mere coincidence.</p><p>Despite having opposing political views, Parfitt maintains that Day deserves a lot of praise for his book, and says “Jordanetics” was largely ignored because of Day’s far-right political views, and that even left-leaning JP critics have bashed Parfitt for even mentioning Vox Day. The media has a lot of explaining to do, Parfitt says. Vox Day gave them the evidence and they ignored it. Peterson critics are so blinkered by their own political hang-ups that they refused to read or even discuss Day’s book.</p></blockquote><p><i>Eppure le idee, si circolano…</i></p></div>",
  "content_text": "The accusation strikes me as bordering on the impossible, given how incoherent Dr. Peterson’s writing is. But what is much more remarkable than the accusation of plagiarism is the identity of the author Jordan Peterson is supposedly plagiarizing:\nThe Devil and His Due: How Jordan Peterson Plagiarizes Adolf Hitler\nby Troy Parfitt offers into evidence some 3,100 instances of Dr. Jordan B. Peterson allegedly copying the written and spoken text of Adolf Hitler. Volume One of a two-volume series will be released on November 1, 2020 in e-book and paperback edition. Its length is 460 pages.\nJordan Peterson is a professor of psychology at the University of Toronto, best-selling author of\n12 Rules for Life\n, and pop-psych guru whose YouTube channel boasts 2.87 million subscribers. Often described as controversial, Peterson shot to fame after challenging Canada’s Bill C-16, which made it illegal to deny employment to or discriminate against people based on their gender identity or expression.\nIn\nThe Devil and His Due\n, Parfitt argues that “the Jordan Peterson Phenomenon” is a mainstream cult whose leader identifies as “the saviour,” feigns Christian beliefs, glorifies Satan, discusses “the Jewish question,” encourages converts to slaughter goats in backyard sacrifices that ought to be “sufficiently bloody,” suggests that suicide can be an effective method for achieving revenge, touts banned substances as “miracle cures,” and teaches that the alt-right project is “incomplete.” Parfitt also asserts that Peterson employs Hitlerite speech to communicate in a crypto-fascist code, but that his supporters seem generally unaware of this.\nParfitt wondered if Peterson might have been borrowing from Hitler after noticing that he frequently complimented the dictator. “He says he’s rescuing people from the clutches of the far-right, but tells his followers that Hitler was a genius who was good at nearly everything, so I read\nMein Kampf\nto see if he had found it inspiring. What I discovered was blatant academic theft.” Parfitt claims that Peterson’s\n12 Rules for Life\nand\nMaps of Meaning\nare riddled with language and ideas from Hitler’s\nMein Kampf\n,\nSecond Book\n,\nTable Talk,\nand speeches.\nDo you know what this means? It means Jordan Peterson is\nliterally\nHitler. We are amused.\nNevertheless, color me very, very dubious indeed. Because as awful as Jordan Peterson is, those who have read\nJordanetics\nwill know that Jordan Peterson didn’t even manage to get Hitler’s description of “the Big Lie” correct.\nDon’t bother asking for a link. This is from a press release from the publisher.\nUPDATE:\nInteresting. Speaking of those who have read\nJordanetics\n, the author may not be anywhere nearly as out there as the press release makes it sound. If nothing else, Parfitt correctly picked up\non the occult elements\nof Peterson’s philosophy.\nAs author Troy Parfitt began to doubt his own sanity with his discoveries of Jordan Peterson’s freakish love affair with the occult, Vox Day’s book “Jordanetics: A Journey Into the Mind of Humanity’s Greatest Thinker” provided a welcome validation that it was not Parfitt who had lost his marbles, but Peterson.\nIt is impossible that Day’s and Parfitt’s revelations about Jordan Peterson’s infatuation with the occult–and indeed the Great Beast himself, Aleister Crowley–could be mere coincidence.\nDespite having opposing political views, Parfitt maintains that Day deserves a lot of praise for his book, and says “Jordanetics” was largely ignored because of Day’s far-right political views, and that even left-leaning JP critics have bashed Parfitt for even mentioning Vox Day. The media has a lot of explaining to do, Parfitt says. Vox Day gave them the evidence and they ignored it. Peterson critics are so blinkered by their own political hang-ups that they refused to read or even discuss Day’s book.\nEppure le idee, si circolano…",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-11T15:33:34+00:00"
}