{
  "url": "https://voxday.net/2020/10/13/even-sjws-are-revolted/",
  "scraped_at": "2025-12-21T13:11:05.768620",
  "title": "Even SJWs are revolted",
  "date_display": "October 13, 2020",
  "date_iso": "2020-10-13T12:00:03+00:00",
  "date_from_url": "2020-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>NIGHT WATCH</i> is Terry Pratchett’s best book. It’s very, very good, conveying genuine emotion and adding considerable depth to characters that in previous and subsequent books are little more than vehicles for passing humor. I consider it to be one of the best 25 fantasy novels ever written. Which, no doubt, is why everyone, even his SJW fans, are horrified by what the BBC has done to the book in “boldly reimagining” it for film. The Dark Herald knew it was going to be bad, but even he <a href=\"https://darkherald.net/2020/10/12/i-need-eye-bleeeeeech/\" rel=\"noopener noreferrer\" target=\"_blank\">couldn’t anticipate just how bad</a> it looks to be:</p><blockquote><p>I’ve been dreading the BBC’s <i>The Watch</i> for a while. It had the words “A bold reimagining by the BBC” in front of it, so I knew it would be bad but…</p><p>Oh, my fucking fuckity fuck!!! This is much more horrible than I could have ever imagined it to be. This isn’t a just a try at an adaption that misses the mark. There was nothing well meaning about this at all. This is the deliberate and hideous destruction of a man’s life’s work.</p><p>I would sit through <i>The Last Jedi</i> for a week straight without bathroom breaks rather than watch this trailer again.</p><p>Even Disney couldn’t have screwed this one up any worse. No, I’m serious!</p></blockquote><p>It’s not hard to know where to start. Ankh-Morpork is a low fantasy city inspired by Lankhmar, the core city in the <i>Fafhrd and the Gray Mouser</i> stories by Fritz Leiber, it is not a steampunk city. Sam Vines is a world-weary beat cop who unexpectedly marries into the nobility, not a Johnny Depp <i>Pirates of the Caribbean</i> wannabe. And Lord Havelock Vetinari, the Patrician of Ankh-Morpork, is the living embodiment of Machiavelli’s <i>The Prince</i>, not a woman.</p><p>And dwarves have beards….</p></div>",
  "content_text": "NIGHT WATCH\nis Terry Pratchett’s best book. It’s very, very good, conveying genuine emotion and adding considerable depth to characters that in previous and subsequent books are little more than vehicles for passing humor. I consider it to be one of the best 25 fantasy novels ever written. Which, no doubt, is why everyone, even his SJW fans, are horrified by what the BBC has done to the book in “boldly reimagining” it for film. The Dark Herald knew it was going to be bad, but even he\ncouldn’t anticipate just how bad\nit looks to be:\nI’ve been dreading the BBC’s\nThe Watch\nfor a while. It had the words “A bold reimagining by the BBC” in front of it, so I knew it would be bad but…\nOh, my fucking fuckity fuck!!! This is much more horrible than I could have ever imagined it to be. This isn’t a just a try at an adaption that misses the mark. There was nothing well meaning about this at all. This is the deliberate and hideous destruction of a man’s life’s work.\nI would sit through\nThe Last Jedi\nfor a week straight without bathroom breaks rather than watch this trailer again.\nEven Disney couldn’t have screwed this one up any worse. No, I’m serious!\nIt’s not hard to know where to start. Ankh-Morpork is a low fantasy city inspired by Lankhmar, the core city in the\nFafhrd and the Gray Mouser\nstories by Fritz Leiber, it is not a steampunk city. Sam Vines is a world-weary beat cop who unexpectedly marries into the nobility, not a Johnny Depp\nPirates of the Caribbean\nwannabe. And Lord Havelock Vetinari, the Patrician of Ankh-Morpork, is the living embodiment of Machiavelli’s\nThe Prince\n, not a woman.\nAnd dwarves have beards….",
  "tags": [
    "film"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-13T11:00:03+00:00"
}