{
  "url": "https://voxday.net/2020/10/16/four-game-designers-two-interviews/",
  "scraped_at": "2025-12-21T13:11:36.265352",
  "title": "Four game designers, two interviews",
  "date_display": "October 16, 2020",
  "date_iso": "2020-10-16T21:09:44+00:00",
  "date_from_url": "2020-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My recruitment efforts for high-quality additions to the DevGame site have already been rewarded beyond my reasonable expectations, as two veteran game developers have already agreed to become regular contributors. Restitutor Orbis, a game designer who is the newest contributor to DevGame, <a href=\"https://devgamecourse.blogspot.com/2020/10/a-conversation-with-chris-crawford-by.html\" rel=\"noopener noreferrer\" target=\"_blank\">interviewed Chris Crawford</a>, legendary game designer and founder of the Game Developers Conference, in 2005:</p><blockquote><p><i>Eastern Front (1941)</i> was one of Crawford’s most noteworthy creations so I decided to press him for details. “<i>Eastern Front</i> was a creative implementation of an obvious idea. ‘Let’s do a good wargame on a computer!’” he said. “Pulling it off involved an awful lot of creativity, but it required tactical creativity as opposed to strategic creativity.”</p><p>I was puzzled by what he meant. Crawford has a reputation for being outspoken, but it’s a cryptic sort of outspokenness, profound to the point of incomprehensibility. Talking to him can be like reading <i>A Brief History of Time</i> at 120 words a minute. You always feel like you’re missing something.</p><p>“Tactical creativity is implementation creativity. How do we build a good map? How do we move units around? How do we build a good AI system? You already know where you are going and you are just figuring out how to get there.”</p><p>“So would you say in today’s game industry we have a lot of tactical creativity and less strategic creativity?” I asked.</p><p>“Nowadays the stuff we call creative is tiny, tiny stuff. It’s hard to even call it creative at all. Technically, yes, I see a lot of creativity. But I see almost no design creativity in the stuff that’s coming out there.”</p></blockquote><p>What was beginning to become apparent in 2005 is now completely obvious to everyone 15 years later. <a href=\"https://devgamecourse.blogspot.com/2020/10/a-conversation-with-chris-crawford-by.html\" rel=\"noopener noreferrer\" target=\"_blank\">Read the whole thing</a>. For my part, I <a href=\"https://devgamecourse.blogspot.com/2020/10/interview-with-brad-wardell-of-stardock.html\" rel=\"noopener noreferrer\" target=\"_blank\">interviewed Brad Wardell</a>,  designer of <i>Galactic Civilizations</i> and publisher of <i>Sins of a Solar Empire</i> and <i>Sorceror King</i>, as part of the 2016 DevGame course:</p><blockquote><p>VD: You’ve moved from doing science fiction with <i>Galactic Civilizations</i> into doing 4X fantasy with <i>Fallen Enchantress</i> and <i>Sorcerer King</i>. What were some of the challenges that were involved in moving from science fiction to fantasy?</p><p>Brad: The biggest one for us was going from a space-based game like <i>Galactic Civilizations II </i>to a land-based game like <i>Fallen Enchantress</i>. Specifically, the terrain. You are dealing with the ground. And that turned out to be a huge challenge for us because we had never had to deal with it before. We had never really run up against things like video memory or the limitations of DirectX in terms of how to make a mountain. You think about it, of course, but how you make something like a mountain can be limiting based on DirectX, because there’s only so many points you can put on there. So that turned out to be a huge hurdle for us, and that really bit us in the butt, because, at the time, we didn’t do our homework on what we could and couldn’t do with the current technology.</p><p>VD: Interesting. That’s very timely because we’re going to be getting into things like polygon count and so forth when we talk about art later today. Now, in the publishing world, the market for fantasy is considerably larger than the one for science fiction. Is that true in games as well, or do you find that science fiction usually outsells fantasy?</p><p>Brad: I read mostly science fiction myself. In the game arena, I would say science fiction tends to be a bit ahead of fantasy, only because the problem people run into with fantasy is that they think fantasy means medieval Europe with magic. And that’s not a just a problem in terms of the designer’s limits, it’s more the expectations of the public. If you move too far outside the box, you are punished for it in the marketplace. Whereas in science fiction, you have a little bit more room to breathe.</p></blockquote><p>Even if you’re not a game developer, or a wannabe game developer, there is a good chance you’re going to learn a lot of interesting information from these interviews. And if you’re a gamer, you’re definitely going to want to add DevGame to your daily bookmarks list. </p></div>",
  "content_text": "My recruitment efforts for high-quality additions to the DevGame site have already been rewarded beyond my reasonable expectations, as two veteran game developers have already agreed to become regular contributors. Restitutor Orbis, a game designer who is the newest contributor to DevGame,\ninterviewed Chris Crawford\n, legendary game designer and founder of the Game Developers Conference, in 2005:\nEastern Front (1941)\nwas one of Crawford’s most noteworthy creations so I decided to press him for details. “\nEastern Front\nwas a creative implementation of an obvious idea. ‘Let’s do a good wargame on a computer!’” he said. “Pulling it off involved an awful lot of creativity, but it required tactical creativity as opposed to strategic creativity.”\nI was puzzled by what he meant. Crawford has a reputation for being outspoken, but it’s a cryptic sort of outspokenness, profound to the point of incomprehensibility. Talking to him can be like reading\nA Brief History of Time\nat 120 words a minute. You always feel like you’re missing something.\n“Tactical creativity is implementation creativity. How do we build a good map? How do we move units around? How do we build a good AI system? You already know where you are going and you are just figuring out how to get there.”\n“So would you say in today’s game industry we have a lot of tactical creativity and less strategic creativity?” I asked.\n“Nowadays the stuff we call creative is tiny, tiny stuff. It’s hard to even call it creative at all. Technically, yes, I see a lot of creativity. But I see almost no design creativity in the stuff that’s coming out there.”\nWhat was beginning to become apparent in 2005 is now completely obvious to everyone 15 years later.\nRead the whole thing\n. For my part, I\ninterviewed Brad Wardell\n,  designer of\nGalactic Civilizations\nand publisher of\nSins of a Solar Empire\nand\nSorceror King\n, as part of the 2016 DevGame course:\nVD: You’ve moved from doing science fiction with\nGalactic Civilizations\ninto doing 4X fantasy with\nFallen Enchantress\nand\nSorcerer King\n. What were some of the challenges that were involved in moving from science fiction to fantasy?\nBrad: The biggest one for us was going from a space-based game like\nGalactic Civilizations II\nto a land-based game like\nFallen Enchantress\n. Specifically, the terrain. You are dealing with the ground. And that turned out to be a huge challenge for us because we had never had to deal with it before. We had never really run up against things like video memory or the limitations of DirectX in terms of how to make a mountain. You think about it, of course, but how you make something like a mountain can be limiting based on DirectX, because there’s only so many points you can put on there. So that turned out to be a huge hurdle for us, and that really bit us in the butt, because, at the time, we didn’t do our homework on what we could and couldn’t do with the current technology.\nVD: Interesting. That’s very timely because we’re going to be getting into things like polygon count and so forth when we talk about art later today. Now, in the publishing world, the market for fantasy is considerably larger than the one for science fiction. Is that true in games as well, or do you find that science fiction usually outsells fantasy?\nBrad: I read mostly science fiction myself. In the game arena, I would say science fiction tends to be a bit ahead of fantasy, only because the problem people run into with fantasy is that they think fantasy means medieval Europe with magic. And that’s not a just a problem in terms of the designer’s limits, it’s more the expectations of the public. If you move too far outside the box, you are punished for it in the marketplace. Whereas in science fiction, you have a little bit more room to breathe.\nEven if you’re not a game developer, or a wannabe game developer, there is a good chance you’re going to learn a lot of interesting information from these interviews. And if you’re a gamer, you’re definitely going to want to add DevGame to your daily bookmarks list.",
  "tags": [
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-16T20:09:44+00:00"
}