{
  "url": "https://voxday.net/2020/10/10/labels-mean-nothing/",
  "scraped_at": "2025-12-21T13:10:42.541374",
  "title": "Labels mean nothing",
  "date_display": "October 10, 2020",
  "date_iso": "2020-10-10T12:00:02+00:00",
  "date_from_url": "2020-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the post-ideological age, a nominal affiliation with ideas does not serve as an accurate indication of genuine loyalties. Republican elder <a href=\"https://twitter.com/SenatorDole/status/1314657560994045952\" rel=\"noopener noreferrer\" target=\"_blank\">Bob Dole reveals</a> that the debate commission is 100 percent anti-Trump despite half of them being Republicans:</p><blockquote><p>The Commission on Presidential Debates is supposedly bipartisan w/ an equal number of Rs and Ds. I know all of the Republicans and most are friends of mine.  I am concerned that none of them support @realDonaldTrump. A biased Debate Commission is unfair.</p></blockquote><p>You are living in a post-ideological age. Understand this. Accept this. It is time to stop thinking in terms of Left and Right, of Liberal and Conservative, of Democrat and Republican, and think in terms of <i>identity </i>instead.</p><p><i>“In multiracial societies, you don’t vote in accordance with your economic interests and social interests, you vote in accordance with race and religion.” </i></p><p>—Lee Kuan Yew </p></div>",
  "content_text": "In the post-ideological age, a nominal affiliation with ideas does not serve as an accurate indication of genuine loyalties. Republican elder\nBob Dole reveals\nthat the debate commission is 100 percent anti-Trump despite half of them being Republicans:\nThe Commission on Presidential Debates is supposedly bipartisan w/ an equal number of Rs and Ds. I know all of the Republicans and most are friends of mine.  I am concerned that none of them support @realDonaldTrump. A biased Debate Commission is unfair.\nYou are living in a post-ideological age. Understand this. Accept this. It is time to stop thinking in terms of Left and Right, of Liberal and Conservative, of Democrat and Republican, and think in terms of\nidentity\ninstead.\n“In multiracial societies, you don’t vote in accordance with your economic interests and social interests, you vote in accordance with race and religion.”\n—Lee Kuan Yew",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-10T11:00:02+00:00"
}