{
  "url": "https://voxday.net/2020/10/15/media-whores-brave-sir-william/",
  "scraped_at": "2025-12-21T13:11:25.893750",
  "title": "MEDIA WHORES: Brave Sir William",
  "date_display": "October 15, 2020",
  "date_iso": "2020-10-15T15:00:01+00:00",
  "date_from_url": "2020-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>MEDIA WHORES: COURTESANS AND CHARLATANS OF THE AMERICAN COMMENTARIAT</i></p><p>CHAPTER THREE: Brave Sir William</p><p><i>“Say hello to my little friend.”</i></p><p>Even with the sound turned off, the baddest man on television is Bill O’Reilly.  From his bullying persona to his ever-jabbing pencil, he projects an aura of working class pugnacity.  Indeed, were it not for the studio lights, O’Reilly might well consider filming his show in a gorilla costume, for only in the depths of the Congo can one hope to see more enthusiastic chest-beating.  And he is not entirely unjustified in doing so, for he has toppled the long-reigning ruler of cable television news.  Larry King is dead(1), long live the king!</p><p>And Bill O’Reilly is more than a TV talking head, he is a dominant force in the broader media.  In addition to his top rated show, The O’Reilly Factor, he pens a column, hosts a radio show and has even, in the tradition of William F. Buckley and Newt Gingrich, written a thriller, Those Who Trespass.  While Al Franken cheaply, (though justifiably) mocks The Factor’s foolhardy venture into prose(2), Mr. O’Reilly is actually to be commended for daring to branch out artistically.  The fact that Hermann Hesse was a lousy painter doesn’t cheapen the value of his novels, after all, nor should one’s opinion of O’Reilly the novelist affect our view of O’Reilly, the king of conservative media.  Nor am I inclined to turn loose the Fourteen Investigators on a wild hunt dedicated to uncovering petty dichotomies such as the Mysterious Case of the Missing Peabody.</p><p>What should affect our view of him instead is the fact that the emperor wears no clothes.  For all his insistence that he is merely a populist representing traditional values, O’Reilly is popular primarily because he is considered a defender of the conservative faith.  When he first entered into the public’s consciousness with the Fox News Channel, the mere fact that he would have Republicans on his show without strapping them to their chairs and subjecting them to a penetrating inquisition worthy of the Star Chamber – metaphorically speaking – instantly won him the allegiance of conservatives across the nation.  Add to this the fact that he was willing to go after left-wing lunatics and celebrity shysters, and did not cower in fear from the ABCNNBCBS cabal but instead reveled in his maverick status; considering how starved the conservative masses were for a media hero, it is little wonder that he has found a large following.</p><p>And yet, Bill O’Reilly has stated on many occasions that he is not a conservative or a Republican, but is entirely independent.  This is technically true(3), but in any case, the vast majority of the viewing public, including his detractors on the left and his supporters on the right, still considers him to be a powerful conservative voice.  And indeed, he is far more supportive of President Bush than he was of President Clinton or of the leading Democratic presidential candidates, including Howard Dean and John Kerry.</p><p>But to conclude that because O’Reilly tends to support President Bush and the Republicans and take them at their word(4), he is therefore a conservative is to make a basic error in logic.  This makes the faulty assumption that President Bush is a conservative, a position with which many conservative Republicans would take great issue.  Rather than relying on politicians, a more reliable source is to consider the ideological views of the subject under scrutiny.  Consider, for example, the very small divergence between Bill O’Reilly’s views and the conservative position on the following subjects:</p><p><u>TOPIC </u>    <u>O’Reilly</u><span style=\"white-space: pre;\"> </span><u>Conservatives</u></p><p>Gay Rights<span style=\"white-space: pre;\"> </span>YES<span style=\"white-space: pre;\"> </span>NO</p><p>Gun Control<span style=\"white-space: pre;\"> </span>YES<span style=\"white-space: pre;\"> </span>NO</p><p>Abortion<span style=\"white-space: pre;\"> </span>YES<span style=\"white-space: pre;\"> </span>NO</p><p>Global Warming<span style=\"white-space: pre;\"> </span>YES<span style=\"white-space: pre;\"> </span>NO</p><p>Campaign Finance Reform<span style=\"white-space: pre;\"> </span>YES<span style=\"white-space: pre;\"> </span>NO</p><p>Indeed, the only political positions that are generally perceived as overtly conservative that O’Reilly currently advocates are tax cuts, support for the Iraqi War and the War on Terror, support for the War on Drugs, and immigration restrictions.  But what is conservative about a Wilsonian war, an undeclared and open-ended war-on-method, and the greatest expansion of federal power since LBJ’s Great Society?(5)</p><p>Even Michael Moore, the Great White Whale of American liberalism, recognizes Bill O’Reilly, if not quite as an ideological friend, as no enemy either.  In his best-selling book, <i>Dude, Where’s My Country</i>, he defended O’Reilly against unfounded charges of conservative Republicanism, stating his belief that O’Reilly was “indeed an independent”.  But there are others who see O’Reilly’s independent moderation as something else entirely.  Ann Coulter, whose conservative bona fides are impeccable, is openly unimpressed with O’Reilly’s perfectly balanced nuance.  In a column inspired by the media’s coverage of the Swift Boat veterans, she wrote:</p><p><i>“There is the Bill O’Reilly method, which is to abandon independent thinking and simply come out in the middle, irrespective of where the two sides are. In response to Newt Gingrich’s remark that the Swift Boat Veterans’ independent ads were “the conservative movement’s answer to Michael Moore,” O’Reilly said, “I don’t want either of them.”  In Nazi Germany, O’Reilly would have condemned both Hitler’s death camps and the Warsaw ghetto uprising. In Bill O’Reilly’s world, King Solomon would have actually cut the disputed baby in half.   The O’Reilly method of analysis works well about once a century. The last time was when Hitler invaded Russia in 1941.”</i></p><p>O’Reilly observers will note that the man has always had an unusual – I dare say unique – approach to ideology.  With regards to Miss Coulter herself, he once announced that she was not “far-right” because she was “friends with Bill Maher”.  I am familiar with a veritable cornucopia of methods for defining the political spectrum, but O’Reilly’s is the first to be predicated on amicable relationships.  Indeed, one has good cause to imagine that O’Reilly intends to not only redefine the political spectrum, but the very fabric of the space-time continuum itself!  Consider the following transcript of The O’Reilly Factor, when Bill Press, the host of CNN’s Crossfire, entered the no-spin zone after the release of his book, <i>Spin This</i>.</p><p>BILL O’REILLY, HOST: With us now from Washington is Bill Press, one of the hosts of the CNN program Crossfire. Mr. Press has written a new book called Spin This. In that book, he is none too friendly to your humble correspondent, me….  Wow, I guess we’re really terrible, huh, Bill? </p><p>BILL PRESS, CO-HOST, CROSSFIRE: Good evening, Bill O’Reilly. How are you? </p><p>O’REILLY: I’m all right. </p><p>PRESS: I wouldn’t say you’re so terrible. My point is simply that I think you should be honest and admit that we all spin. And you spin as much as I do or Bob Novak does or any of the other… </p><p>O’REILLY: I want you to give me one, since you’re concentrated in your book on The Factor, somewhat, give me one example of how I’ve spun a new story, one? </p><p>PRESS: Well, first of all, I do have to say in all honesty that my pages about you, I think, maybe there are three pages in a 220-page book.</p><p>Since I’m devoting this entire chapter to Bill O’Reilly’s favorite subject, Bill O’Reilly, I rather expect he’ll consider this book to be an unauthorized hagiography and file for a restraining order on the grounds that I’m stalking him.</p><p>Television is an inherently deceptive medium. It is much harder to deceive in text, where the reader has the opportunity to easily review something that might have been passed over in a casual first read. After reading Mr. Reilly’s first book, it was readily apparent that it was not the product of a logical, intellectual or conservative mind, but rather a haphazard collection of muddled opinions which reflected a strong government moderate’s typically hazy grasp of political reality. </p><p>For example, Mr. O’Reilly once attacked the president of the Gun Owners of America and labled him a a nutcase on the political fringe due to the GOA’s opposition to the assault weapons ban. This immediately demonstrated three things: </p><ol style=\"text-align: left;\"><li>The Factor does not understand the purpose of the Second Amendment, which is to ensure that the people are able to militarily resist their government.  One would think that a man educated in Boston would know that the battles of Lexington and Concord were fought by Americans resisting the attempt of their lawful and legitimate government to confiscate private weapon stores. </li><li>The Factor does not understand the Assault Weapons Ban, which does not concern itself with bazookas and machine guns, but pistol grips and magazine clips.  In fact, the very next night, the Factor made a laughable claim that his statement was born of hyperbole, not ignorance, presumably due to one of his interns filling him in on things after googling the matter.</li><li>The Factor has no intention of allowing open debate on his program. It’s his program, so he can do whatever he wishes, but it rather puts the lie to his “No-Spin” claim. Mr. O’Reilly is every bit the agitprop artist that Michael Moore is, which, no doubt, partially accounts for the success they have both enjoyed.</li></ol><p>From this evidence, the inexperienced observer might conclude at this point that he has spotted an exemplary specimen of <i>Scortus medius adlatus</i>.  After all, the four primary identifying characteristics are all manifestly present.</p><ul style=\"text-align: left;\"><li> Egomania</li><li> A severe case of rutilus lux addiction</li><li> Reliably principle-free</li><li> Dependably undependable</li></ul><p>But just as one would be mistaken to think that Bill O’Reilly is a conservative, one would also be wrong to view him as nothing more than an unbiased, self-centered media parasite interested in nothing but feeding off the political bloodstream.  Lately, The Factor has gloried in proclaiming that various individuals are “ducking” and “backing down” from him. This is rather ironic in the face of the following transcript from Fox News dated August 24, 2004: </p><p>The ACLU held its annual convention, but The Factor was not invited. However, The Factor said, “Colorado Gov. Bill Owens, a Republican, was, and he debated our pal Howard Dean, who remains too frightened to appear on [this show]. The debate dealt with the Patriot Act. Dean claimed it robs us of individual rights.” The Factor reminded, “If anybody has been abused by the Patriot Act, call us, please. We want to put them on the air.” </p><p>Upon hearing this challenge by Bill O’Reilly, Michael Badnarik, the Libertarian Party’s candidate for president, was quick to respond to Mr. O’Reilly’s challenge, apprising “The Factor” personnel of his victimized status.  When danger – in the form of a political candidate, who, unlike Bill’s pal, is not primary roadkill, but was on the ballot in all 50 states in the 2004 election – reared its ugly head, Bill O’Reilly bravely turned his tail and fled. One of The Factor’s minions sent the following e-mail: </p><p>According to producers, the “challenge” has apparently been misunderstood in terms of what Bill actually said on the air. There is no interest in having Mr. Badnarik on the show at this time. </p><p>A misunderstanding!  Did The Factor mean to say that he does not want to put someone abused by the Patriot Act on the air? Did he dispute or refute Badnarik’s claim to victim status?  No, actually, to both counts.  Now, it would be quite conceivable that this was nothing more than simple distaste for questionable grandstanding by a fringe political figure, except for the fact that O’Reilly had previously “postponed” the Libertarian candidate’s scheduled appearance on the show a month before so late that Badnarik was being driven on his way to the studio when he received the call.</p><p>But the third time, as they say, is the charm, and the real reason for O’Reilly’s turnabout was revealed by a similar disinvitation in August, when a Muslim-American by the name of Dr. I. Dean Ahmad was invited to take what was described as “the anti-Bush stance” against a Muslim-American supporter of President Bush. </p><p>As Dr. Ahmad recounts it: “The show is off! O’Reilly has pulled an O’Reilly.  I was actually in the car being driven to the show when his deputy called me and informed me that although they would identify me as a Muslim supporter of [Michael] Badnarik, that I was not allowed to mention Michael’s name on the show! I declined to accept those terms and they had the driver bring me back.”</p><p>A replacement for Dr. Ahmad was found at the very last minute, Khalid Turaani, the founder of Arab-American Republicans Against Bush, but it seems that despite The Factor’s best laid plans, things went agley.</p><p>“I just got off the phone with Khalid Turaani. Here’s what happened: They called him 30 minutes before taping and asked him if he would take the anti-Bush position on the show. He agreed and they rushed him down to the studio. They kept pressing him as to whom he would vote for and he kept dodging the question, saying he would say that on the show. Kerry? No, he said, I’m a conservative, I would never vote for Kerry. At the studio they pressed real hard and he admitted that he planned to vote for Badnarik. When he say the panic in their eyes he realized that despite their “fair and balanced” claims, they were Bush supporters. They tried to dissuade him from mentioning it on air, but by then it was too late to do to him what they did to me. He went on the air and said that a vote against Bush need not be a vote for Kerry and that he would vote for Badnarik, the Libertarian.” (6)</p><p>Mr Turaani’s actual statement that broke the ban on the Forbidden Words of Doom was: “I don’t want to cut off my nose to spite my face by not liking Bush and jumping in the lap of Kerry. No – I will vote Libertarian and I think Badnarik is going to be a good choice for people who don’t like Bush.”</p><p>But why does Brave Sir William fear the squamous terror of the B-word, the ghastly horror of the L-word (7)?  How can a complete unknown, sworn to a principle of no-first use of force, inspire such uncharacteristic pusillanimity in the pugnacious one?  Blogosphere rumor had it that subsequent to a visit to the Fox News Channel by Vice-President Cheney, it was understood that any mention of any candidate who might threaten the Vice-President’s continued employment by mentioning parties of potential appeal to otherwise Republican voters was not to be tolerated.  No spin there, just a quiet understanding of what would be considered outside the bounds of fair-and-balanced, independent media commentary.</p><p>So, for all that he is not a conservative, these election-year shenanigans demonstrate that Bill O’Reilly does have an interest in something bigger than his own oversized ego.  He is what some mistakenly call a RINO, Republican-In-Name-Only, but what Fred Barnes has more accurately characterized as a Big Government Conservative, which is to say, not a conservative at all. (8)  Not only does the emperor have no clothes, but he is flat on his back as well.  The king is a courtesan.</p><p>Both <i>Adlatus </i>and <i>Washingtonia</i>, Bill O’Reilly is truly a breed unto himself.  He is an inspiration, in fact, for like Bill O’Reilly, I too harbor aspirations toward Renaissance manhood.  In fact, I found that these repeated incidents of the pugnacious one’s unexpected cowardice actually inspired me to song.  And so with apologies to the greatest movie of all time, I present to you, gentle reader, a lyric dedicated to the fearless defender of the working man.</p><p>The Ballad of Brave Sir William (9)</p><p>Bravely bold Sir William strode forth from FNC.</p><p>He did not fear to debate, O brave Sir William!</p><p>He was not at all afraid to be humbled in nasty ways,</p><p>Brave, brave, brave, brave O’Reilly!</p><p>He was not in the least bit scared to be mashed into a pulp,</p><p>Or to have his lies exposed and his logic broken;</p><p>His infinitives all split, his opinions blown away;</p><p>And his facts all hacked and mangled, brave Sir William!</p><p>His case smashed in and its heart cut out</p><p>And his proofs disproved, his polemic unplugged</p><p>And his talking points raped, and his claims disembowled</p><p>And [radio edit](10)</p><p>Brave Sir William ran away.</p><p>He bravely ran away, away!</p><p>When danger reared its ugly head, </p><p>He bravely turned his tail and fled.</p><p>Yes, brave Sir William turned about</p><p>And gallantly he chickened out.</p><p>Bravely taking to his feet</p><p>He beat a very brave retreat,</p><p>Bravest of the brave, O’Reilly!</p><p><b>FOOTNOTES</b></p><p>(1) I have it on good authority that Larry King is not actually dead, he only looks like he’s an embalmed drag queen sans wig.</p><p>(2) Speaking as a writer who has published four novels and twice served on SFWA Nebula Award juries, let’s just say that America’s great triumvirate of literary lions, Tom Clancy, Stephen King and Michael Crichton, have little to fear and leave it at that.</p><p>(3) He was a registered Republican from 1994 through 2000.</p><p>(4) During his appearance on Good Morning America on May 18, 2004, O’Reilly assured the nation “I am much more skeptical of the Bush administration now than I was at that time.”  It would seem that the Masters of Broadcast Journalism program at Boston University doesn’t subscribe to the Society of Professional Journalist’s guidelines.</p><p>(5) I’ve never quite grasped the notion that the Democratic Party is anti-war.  Pop quiz: The President belonged to which party when America entered World War I, World War II, the Korean War and the Vietnam War.  Hint: the answer isn’t Republican.</p><p>(6) Dr. I. Dean Ahmad, email to Stephen Gordon, Communications Director of Badnarik/Campagna 2004 Headquarters.</p><p>(7) The Libertarian Party, not the sapphic show.</p><p>(8) Friedrich von Hayek, in his excellent essay on Social Justice, pointed out what should be immediately obvious to anyone with a basic knowledge of grammar.  If the concept requires modifying a noun with an adjective, the modified result necessarily diverges from the original concept.</p><p>(9) To be sung to the tune of Monte Python’s “The Ballad of Brave Sir Robin.”  And if you didn’t know that, why are you reading this book?  Now, go away or I shall taunt you a second time.</p><p>(10) For those of you who actually know the song, if I were Candide and this world were perfect, lacking evils such as war, poverty, crime, hate, violence and editors, there would have been a reference to the likelihood that something was very small indeed.</p></div>",
  "content_text": "MEDIA WHORES: COURTESANS AND CHARLATANS OF THE AMERICAN COMMENTARIAT\nCHAPTER THREE: Brave Sir William\n“Say hello to my little friend.”\nEven with the sound turned off, the baddest man on television is Bill O’Reilly.  From his bullying persona to his ever-jabbing pencil, he projects an aura of working class pugnacity.  Indeed, were it not for the studio lights, O’Reilly might well consider filming his show in a gorilla costume, for only in the depths of the Congo can one hope to see more enthusiastic chest-beating.  And he is not entirely unjustified in doing so, for he has toppled the long-reigning ruler of cable television news.  Larry King is dead(1), long live the king!\nAnd Bill O’Reilly is more than a TV talking head, he is a dominant force in the broader media.  In addition to his top rated show, The O’Reilly Factor, he pens a column, hosts a radio show and has even, in the tradition of William F. Buckley and Newt Gingrich, written a thriller, Those Who Trespass.  While Al Franken cheaply, (though justifiably) mocks The Factor’s foolhardy venture into prose(2), Mr. O’Reilly is actually to be commended for daring to branch out artistically.  The fact that Hermann Hesse was a lousy painter doesn’t cheapen the value of his novels, after all, nor should one’s opinion of O’Reilly the novelist affect our view of O’Reilly, the king of conservative media.  Nor am I inclined to turn loose the Fourteen Investigators on a wild hunt dedicated to uncovering petty dichotomies such as the Mysterious Case of the Missing Peabody.\nWhat should affect our view of him instead is the fact that the emperor wears no clothes.  For all his insistence that he is merely a populist representing traditional values, O’Reilly is popular primarily because he is considered a defender of the conservative faith.  When he first entered into the public’s consciousness with the Fox News Channel, the mere fact that he would have Republicans on his show without strapping them to their chairs and subjecting them to a penetrating inquisition worthy of the Star Chamber – metaphorically speaking – instantly won him the allegiance of conservatives across the nation.  Add to this the fact that he was willing to go after left-wing lunatics and celebrity shysters, and did not cower in fear from the ABCNNBCBS cabal but instead reveled in his maverick status; considering how starved the conservative masses were for a media hero, it is little wonder that he has found a large following.\nAnd yet, Bill O’Reilly has stated on many occasions that he is not a conservative or a Republican, but is entirely independent.  This is technically true(3), but in any case, the vast majority of the viewing public, including his detractors on the left and his supporters on the right, still considers him to be a powerful conservative voice.  And indeed, he is far more supportive of President Bush than he was of President Clinton or of the leading Democratic presidential candidates, including Howard Dean and John Kerry.\nBut to conclude that because O’Reilly tends to support President Bush and the Republicans and take them at their word(4), he is therefore a conservative is to make a basic error in logic.  This makes the faulty assumption that President Bush is a conservative, a position with which many conservative Republicans would take great issue.  Rather than relying on politicians, a more reliable source is to consider the ideological views of the subject under scrutiny.  Consider, for example, the very small divergence between Bill O’Reilly’s views and the conservative position on the following subjects:\nTOPIC\nO’Reilly\nConservatives\nGay Rights\nYES\nNO\nGun Control\nYES\nNO\nAbortion\nYES\nNO\nGlobal Warming\nYES\nNO\nCampaign Finance Reform\nYES\nNO\nIndeed, the only political positions that are generally perceived as overtly conservative that O’Reilly currently advocates are tax cuts, support for the Iraqi War and the War on Terror, support for the War on Drugs, and immigration restrictions.  But what is conservative about a Wilsonian war, an undeclared and open-ended war-on-method, and the greatest expansion of federal power since LBJ’s Great Society?(5)\nEven Michael Moore, the Great White Whale of American liberalism, recognizes Bill O’Reilly, if not quite as an ideological friend, as no enemy either.  In his best-selling book,\nDude, Where’s My Country\n, he defended O’Reilly against unfounded charges of conservative Republicanism, stating his belief that O’Reilly was “indeed an independent”.  But there are others who see O’Reilly’s independent moderation as something else entirely.  Ann Coulter, whose conservative bona fides are impeccable, is openly unimpressed with O’Reilly’s perfectly balanced nuance.  In a column inspired by the media’s coverage of the Swift Boat veterans, she wrote:\n“There is the Bill O’Reilly method, which is to abandon independent thinking and simply come out in the middle, irrespective of where the two sides are. In response to Newt Gingrich’s remark that the Swift Boat Veterans’ independent ads were “the conservative movement’s answer to Michael Moore,” O’Reilly said, “I don’t want either of them.”  In Nazi Germany, O’Reilly would have condemned both Hitler’s death camps and the Warsaw ghetto uprising. In Bill O’Reilly’s world, King Solomon would have actually cut the disputed baby in half.   The O’Reilly method of analysis works well about once a century. The last time was when Hitler invaded Russia in 1941.”\nO’Reilly observers will note that the man has always had an unusual – I dare say unique – approach to ideology.  With regards to Miss Coulter herself, he once announced that she was not “far-right” because she was “friends with Bill Maher”.  I am familiar with a veritable cornucopia of methods for defining the political spectrum, but O’Reilly’s is the first to be predicated on amicable relationships.  Indeed, one has good cause to imagine that O’Reilly intends to not only redefine the political spectrum, but the very fabric of the space-time continuum itself!  Consider the following transcript of The O’Reilly Factor, when Bill Press, the host of CNN’s Crossfire, entered the no-spin zone after the release of his book,\nSpin This\n.\nBILL O’REILLY, HOST: With us now from Washington is Bill Press, one of the hosts of the CNN program Crossfire. Mr. Press has written a new book called Spin This. In that book, he is none too friendly to your humble correspondent, me….  Wow, I guess we’re really terrible, huh, Bill?\nBILL PRESS, CO-HOST, CROSSFIRE: Good evening, Bill O’Reilly. How are you?\nO’REILLY: I’m all right.\nPRESS: I wouldn’t say you’re so terrible. My point is simply that I think you should be honest and admit that we all spin. And you spin as much as I do or Bob Novak does or any of the other…\nO’REILLY: I want you to give me one, since you’re concentrated in your book on The Factor, somewhat, give me one example of how I’ve spun a new story, one?\nPRESS: Well, first of all, I do have to say in all honesty that my pages about you, I think, maybe there are three pages in a 220-page book.\nSince I’m devoting this entire chapter to Bill O’Reilly’s favorite subject, Bill O’Reilly, I rather expect he’ll consider this book to be an unauthorized hagiography and file for a restraining order on the grounds that I’m stalking him.\nTelevision is an inherently deceptive medium. It is much harder to deceive in text, where the reader has the opportunity to easily review something that might have been passed over in a casual first read. After reading Mr. Reilly’s first book, it was readily apparent that it was not the product of a logical, intellectual or conservative mind, but rather a haphazard collection of muddled opinions which reflected a strong government moderate’s typically hazy grasp of political reality.\nFor example, Mr. O’Reilly once attacked the president of the Gun Owners of America and labled him a a nutcase on the political fringe due to the GOA’s opposition to the assault weapons ban. This immediately demonstrated three things:\nThe Factor does not understand the purpose of the Second Amendment, which is to ensure that the people are able to militarily resist their government.  One would think that a man educated in Boston would know that the battles of Lexington and Concord were fought by Americans resisting the attempt of their lawful and legitimate government to confiscate private weapon stores.\nThe Factor does not understand the Assault Weapons Ban, which does not concern itself with bazookas and machine guns, but pistol grips and magazine clips.  In fact, the very next night, the Factor made a laughable claim that his statement was born of hyperbole, not ignorance, presumably due to one of his interns filling him in on things after googling the matter.\nThe Factor has no intention of allowing open debate on his program. It’s his program, so he can do whatever he wishes, but it rather puts the lie to his “No-Spin” claim. Mr. O’Reilly is every bit the agitprop artist that Michael Moore is, which, no doubt, partially accounts for the success they have both enjoyed.\nFrom this evidence, the inexperienced observer might conclude at this point that he has spotted an exemplary specimen of\nScortus medius adlatus\n.  After all, the four primary identifying characteristics are all manifestly present.\nEgomania\nA severe case of rutilus lux addiction\nReliably principle-free\nDependably undependable\nBut just as one would be mistaken to think that Bill O’Reilly is a conservative, one would also be wrong to view him as nothing more than an unbiased, self-centered media parasite interested in nothing but feeding off the political bloodstream.  Lately, The Factor has gloried in proclaiming that various individuals are “ducking” and “backing down” from him. This is rather ironic in the face of the following transcript from Fox News dated August 24, 2004:\nThe ACLU held its annual convention, but The Factor was not invited. However, The Factor said, “Colorado Gov. Bill Owens, a Republican, was, and he debated our pal Howard Dean, who remains too frightened to appear on [this show]. The debate dealt with the Patriot Act. Dean claimed it robs us of individual rights.” The Factor reminded, “If anybody has been abused by the Patriot Act, call us, please. We want to put them on the air.”\nUpon hearing this challenge by Bill O’Reilly, Michael Badnarik, the Libertarian Party’s candidate for president, was quick to respond to Mr. O’Reilly’s challenge, apprising “The Factor” personnel of his victimized status.  When danger – in the form of a political candidate, who, unlike Bill’s pal, is not primary roadkill, but was on the ballot in all 50 states in the 2004 election – reared its ugly head, Bill O’Reilly bravely turned his tail and fled. One of The Factor’s minions sent the following e-mail:\nAccording to producers, the “challenge” has apparently been misunderstood in terms of what Bill actually said on the air. There is no interest in having Mr. Badnarik on the show at this time.\nA misunderstanding!  Did The Factor mean to say that he does not want to put someone abused by the Patriot Act on the air? Did he dispute or refute Badnarik’s claim to victim status?  No, actually, to both counts.  Now, it would be quite conceivable that this was nothing more than simple distaste for questionable grandstanding by a fringe political figure, except for the fact that O’Reilly had previously “postponed” the Libertarian candidate’s scheduled appearance on the show a month before so late that Badnarik was being driven on his way to the studio when he received the call.\nBut the third time, as they say, is the charm, and the real reason for O’Reilly’s turnabout was revealed by a similar disinvitation in August, when a Muslim-American by the name of Dr. I. Dean Ahmad was invited to take what was described as “the anti-Bush stance” against a Muslim-American supporter of President Bush.\nAs Dr. Ahmad recounts it: “The show is off! O’Reilly has pulled an O’Reilly.  I was actually in the car being driven to the show when his deputy called me and informed me that although they would identify me as a Muslim supporter of [Michael] Badnarik, that I was not allowed to mention Michael’s name on the show! I declined to accept those terms and they had the driver bring me back.”\nA replacement for Dr. Ahmad was found at the very last minute, Khalid Turaani, the founder of Arab-American Republicans Against Bush, but it seems that despite The Factor’s best laid plans, things went agley.\n“I just got off the phone with Khalid Turaani. Here’s what happened: They called him 30 minutes before taping and asked him if he would take the anti-Bush position on the show. He agreed and they rushed him down to the studio. They kept pressing him as to whom he would vote for and he kept dodging the question, saying he would say that on the show. Kerry? No, he said, I’m a conservative, I would never vote for Kerry. At the studio they pressed real hard and he admitted that he planned to vote for Badnarik. When he say the panic in their eyes he realized that despite their “fair and balanced” claims, they were Bush supporters. They tried to dissuade him from mentioning it on air, but by then it was too late to do to him what they did to me. He went on the air and said that a vote against Bush need not be a vote for Kerry and that he would vote for Badnarik, the Libertarian.” (6)\nMr Turaani’s actual statement that broke the ban on the Forbidden Words of Doom was: “I don’t want to cut off my nose to spite my face by not liking Bush and jumping in the lap of Kerry. No – I will vote Libertarian and I think Badnarik is going to be a good choice for people who don’t like Bush.”\nBut why does Brave Sir William fear the squamous terror of the B-word, the ghastly horror of the L-word (7)?  How can a complete unknown, sworn to a principle of no-first use of force, inspire such uncharacteristic pusillanimity in the pugnacious one?  Blogosphere rumor had it that subsequent to a visit to the Fox News Channel by Vice-President Cheney, it was understood that any mention of any candidate who might threaten the Vice-President’s continued employment by mentioning parties of potential appeal to otherwise Republican voters was not to be tolerated.  No spin there, just a quiet understanding of what would be considered outside the bounds of fair-and-balanced, independent media commentary.\nSo, for all that he is not a conservative, these election-year shenanigans demonstrate that Bill O’Reilly does have an interest in something bigger than his own oversized ego.  He is what some mistakenly call a RINO, Republican-In-Name-Only, but what Fred Barnes has more accurately characterized as a Big Government Conservative, which is to say, not a conservative at all. (8)  Not only does the emperor have no clothes, but he is flat on his back as well.  The king is a courtesan.\nBoth\nAdlatus\nand\nWashingtonia\n, Bill O’Reilly is truly a breed unto himself.  He is an inspiration, in fact, for like Bill O’Reilly, I too harbor aspirations toward Renaissance manhood.  In fact, I found that these repeated incidents of the pugnacious one’s unexpected cowardice actually inspired me to song.  And so with apologies to the greatest movie of all time, I present to you, gentle reader, a lyric dedicated to the fearless defender of the working man.\nThe Ballad of Brave Sir William (9)\nBravely bold Sir William strode forth from FNC.\nHe did not fear to debate, O brave Sir William!\nHe was not at all afraid to be humbled in nasty ways,\nBrave, brave, brave, brave O’Reilly!\nHe was not in the least bit scared to be mashed into a pulp,\nOr to have his lies exposed and his logic broken;\nHis infinitives all split, his opinions blown away;\nAnd his facts all hacked and mangled, brave Sir William!\nHis case smashed in and its heart cut out\nAnd his proofs disproved, his polemic unplugged\nAnd his talking points raped, and his claims disembowled\nAnd [radio edit](10)\nBrave Sir William ran away.\nHe bravely ran away, away!\nWhen danger reared its ugly head,\nHe bravely turned his tail and fled.\nYes, brave Sir William turned about\nAnd gallantly he chickened out.\nBravely taking to his feet\nHe beat a very brave retreat,\nBravest of the brave, O’Reilly!\nFOOTNOTES\n(1) I have it on good authority that Larry King is not actually dead, he only looks like he’s an embalmed drag queen sans wig.\n(2) Speaking as a writer who has published four novels and twice served on SFWA Nebula Award juries, let’s just say that America’s great triumvirate of literary lions, Tom Clancy, Stephen King and Michael Crichton, have little to fear and leave it at that.\n(3) He was a registered Republican from 1994 through 2000.\n(4) During his appearance on Good Morning America on May 18, 2004, O’Reilly assured the nation “I am much more skeptical of the Bush administration now than I was at that time.”  It would seem that the Masters of Broadcast Journalism program at Boston University doesn’t subscribe to the Society of Professional Journalist’s guidelines.\n(5) I’ve never quite grasped the notion that the Democratic Party is anti-war.  Pop quiz: The President belonged to which party when America entered World War I, World War II, the Korean War and the Vietnam War.  Hint: the answer isn’t Republican.\n(6) Dr. I. Dean Ahmad, email to Stephen Gordon, Communications Director of Badnarik/Campagna 2004 Headquarters.\n(7) The Libertarian Party, not the sapphic show.\n(8) Friedrich von Hayek, in his excellent essay on Social Justice, pointed out what should be immediately obvious to anyone with a basic knowledge of grammar.  If the concept requires modifying a noun with an adjective, the modified result necessarily diverges from the original concept.\n(9) To be sung to the tune of Monte Python’s “The Ballad of Brave Sir Robin.”  And if you didn’t know that, why are you reading this book?  Now, go away or I shall taunt you a second time.\n(10) For those of you who actually know the song, if I were Candide and this world were perfect, lacking evils such as war, poverty, crime, hate, violence and editors, there would have been a reference to the likelihood that something was very small indeed.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-15T14:00:01+00:00"
}