{
  "url": "https://voxday.net/2020/10/12/media-whores-building-the-brothel/",
  "scraped_at": "2025-12-21T13:11:00.610609",
  "title": "MEDIA WHORES: Building the Brothel",
  "date_display": "October 12, 2020",
  "date_iso": "2020-10-12T15:52:49+00:00",
  "date_from_url": "2020-10-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Back in 2004, an editor at Thomas Nelson contacted me with an idea for writing a book about the corruption of the mainstream media. I wrote four sample chapters and was signed to a contract to write <i>MEDIA WHORES: COURTESANS AND CHARLATANS OF THE AMERICAN COMMENTARIAT</i>, but they killed the book after discovering that I intended to write about media whores who were nominally on the Republican Right, such as Bill O’Reilly and Michelle Malkin, in addition to the various figures on the Democratic Left that they had expected me to target. This was one of several books I was paid to not write during that period of profitable unpublishability.</p><p>Since most readers were not reading this blog 15 years ago, when I posted two of the sample chapters (One and Two), I’ll repost them, along with the other two that were written back then (Three and Ten), over the next week. You can probably understand why Thomas Nelson decided not to publish the book after they ran the sample chapters and the following table of contents past Andrew Napolitano to see if Fox News would put its weight behind the book.</p><p>It’s interesting to see the hits and misses. Malkin, Shapiro, Hannity, and Franken were spot on. Hitchens zigged away from the media proper and zagged into New Atheist quasi-celebrity, and O’Reilly self-imploded while Alterman went from being viewed as The Next Big Left-Wing Thing and my primary competition for Universal Press syndication to being mostly irrelevant despite his high-profile positions at Brooklyn College, <i>The Nation</i>, and The Center for American Progress.</p><p><b>INTRODUCTION</b></p><ol style=\"text-align: left;\"><li>    Building the Brothel</li><li>    The Courtesans</li><li>    The Charlatans</li><li>    Me So Michelle: Michelle Malkin</li><li>    A Hedgehog, Deceased, On the Left Side of the Road: Eric Alterman</li><li>    MoDo’s Diary: Maureen Dowd</li><li>    The Littlest Chickenhawk: Ben Shapiro</li><li>    The Naked Economist: Paul Krugman</li><li>    Hunting the White Whale: Michael Moore</li><li>    Brave Sir William: Bill O’Reilly</li><li>    What a Friend We Have in Trotsky: Christopher Hitchens</li><li>    He-Man and Skeletor: Hannity and Colmes</li><li>    The Smears of a Clown: Al Franken</li></ol><p><i></i></p><p><b><i><br/></i></b></p><p><b><i>MEDIA WHORES: COURTESANS AND CHARLATANS OF THE AMERICAN COMMENTARIAT</i></b></p><p>CHAPTER ONE: Building the Brothel</p><p><i>Vir qui amat sapientiam laetificat patrem suum qui autem nutrit scorta perdet substantiam.</i></p><p>The Buggles were wrong. Video didn’t kill the radio star. The truth is precisely to the contrary. Video not only made the radio star huge, it also made him a best-selling author, and more often than not, a pop icon to boot. Radio, television, cable, the internet, and even traditional newspaper and book publishing have insensibly merged into one massive and amorphous entity, known to its consumers as simply “the media”. But it too is a consumer; it is a voracious beast, devouring all that come within its grasp, and only the strongest, most single-minded parasites can survive and thrive in its acidic maw.</p><p>With the gradual transformation of what was once news into infotainment, the requirements for the talking heads who serve as the primary conduit from the beast to its beholders changed too. In the early days of television, talking heads were reporters who had spent years in the field, researching, interviewing, writing and recording their own news stories. Murrow, Cronkite, and even the recently retired Dan Rather are examples of this sort. They feigned an Olympian objectivity, hid their political affiliations and projected the sort of deep and immobile gravitas that made the term “network anchor” seem so fitting.</p><p>As the producers became more sophisticated and technologically adept, it became less and less necessary to have an experienced reporter reading the news or even writing original stories in the newspaper. Gravitas went by the wayside as attractive, focus-tested women were added to the mix, and with the exception of the primary network news broadcasts – the majestic second triumvirate of Brokaw, Willams and Jennings – the two-headed bi-gendered news team came to the fore. Teleprompters and professional writers meant that the talking heads were no longer required to write or think, allowing producers to concentrate on what matters most to the television viewing audiences, namely, looking at attractive men and women.</p><p>This second generation of television news brought to the forefront men with chiseled jaws and names like porn stars(1), accompanied by blondes with journalism-lite backgrounds that often included acting credits and tasteful nude photography(2). This model quickly became de riguer for the local news format, which is now such a matter of rote that one cannot easily distinguish between the ABC affiliate’s newscast in Minneapolis and the CBS affiliate’s newscast in Albuquerque. The basic cast is always the same; the forty-something neo-patriarch with a full head of hair touched with gray at the temples, the thirty-something blonde co-anchor, (ethnic optional in cities with large Black and Hispanic populations), a weatherman who is either a sexless androgyne or a beta blonde, and last and least, the roguish sports anchor.</p><p>The first cable channel, CNN, was largely content to follow in the footsteps of its predecessors, although its expansion of the news spigot from one to 24 hours daily would insensibly make its effect known over time. However, the shift from journalism-free journalists to full-blown infotainers accelerated quickly with the appearance of the Fox News Channel, which like Athena sprang fully accoutered for battle from the head of Roger Ailes, wisely eschewing the leftist slant hidden behind the condescending pretense at objectivity of the ABCNNBCBS cabal.</p><p>Infotainment had long been present within the cabal, of course, but it was kept on the sidelines by an embarrassed media elite, in the context of crossover shows like 20/20 and Today. Barbara Walters became the unquestioned queen of the quasi-news with her infamous interviews on ABC, The Barbara Walters Specials, where she enlightened the American public by eliciting answers to insightful questions that no one else had ever dared to ask of international figures and celebrities.(3)</p><p>The terror of creeping infotainment at the networks during the early Eighties was such that Ms Walters managed to hold a co-anchor spot at ABC only briefly before being banished to matters arboreal. But it returned with vengeance in 1996, when the Fox News Channel burst onto the scene and in less than seven years, not only overturned the existing order but turned the cable news ratings war from a horse race into something bearing closer resemblance to a prison rape.(4)</p><p>The brilliance of Roger Ailes was two-fold. First, recognizing the iron law of supply and demand in a country evenly divided between what passes for “liberal” and “conservative” in the political spectrum, he offered a taste of what had hitherto been absent from the television screens of America. Where CNN was self-consciously international, Fox News was proudly patriotic. Where the ABCNNBCBS cabal inordinately consisted of those supporting Democrats(5), Fox dared to put self-proclaimed Republicans on the air without the accompanying soundtrack of The Imperial March(6) or pairing them with a polar opposite providing instant counterpoint.</p><p>Ailes’ logic was impeccable, demonstrating that alone among the executives of the media industry, only he understood the lessons of the talk radio phenomenon. Of the 105,405,100 votes cast in the 2000 presidential election, Al Gore and George Bush both received about 48 percent of the vote(7). But not only does the ABCNNBCBS news cabal market itself entirely towards the pro-Gore 48 percent, it is joined in doing so by PBS, MSNBC, and, to a lesser extent, CNBC. This abandonment of the opposite 48 percent equated to a wide-open market of epic proportions, which Ailes has exploited with ruthless abandon. The motto is “fair and balanced” and while the actual slant is only vaguely rightward, the symbolism is much more strongly so. Liberal-minded CNN cast-offs, such as Geraldo Rivera and Greta van Susteren, are forced to keep their inclinations firmly in check, while moderates are spun as conservatives at almost every opportunity.</p><p>Second, the Fox News chairman wholeheartedly embraced the concept of being the humble servant of the marketplace. The media has long had an inflated view of itself; it is nearly impossible to listen to a mainstream journalist recite a ponderous description of his ever-so-weighty responsibilities without bursting into laughter. The elite journalists see themselves as the Fourth Estate, asking the tough questions and dedicated to afflicting the comfortable and comforting the afflicted. If you have ever seen a journalist performing a Monica on a big celebrity get in what is apparently supposed to pass for an interview, it’s not hard to see that the media are not only deluded in this regard, but are also incredibly ill-suited to accurately observe human events.</p><p>Due to this delusional self-regard, executives at the ABCNNBCBS cabal have long considered themselves above the dirty and unpleasant realities of the market, while government-funded PBS actually is free to ignore the wishes of great unwashed as it fulfills its sacred mission of allowing liberals to pretend they are intellectuals and loftily look down their noses at those who prefer entertainment that offers a frisson of divertissement. Fox News, on the other hand, appears to have an interest in making money, which in a capitalist society tends to involve paying a certain amount of attention to what the consumer wants.</p><p>And what the cable news consumer wants, apparently, is pretty girls, in-depth coverage of murder trials, missing children(8) and car chases. Only eighteen months before the launch of the Fox News Channel, the famous O.J. Simpson car chase(9) and subsequent trial took place, and apparently it left an indelible impression on the soon-to-be Fox News Channel executives. It could be seen, in retrospect, as the perfect Foxian trifecta, combining a celebrity, a car chase and a murder trial. Had there only been an Amber Alert involved somewhere in the mix, it would have been the perfect story. And although the quattrocephalic news cabal flogged the O.J. trial mercilessly, no channel drew more useful conclusions from it than Fox News.</p><p>In the eight years since it made its debut, Fox News has covered 416 car chases, 42 missing children and 11 murder trials, which is approximately 469 more stories of the sort than PBS has covered(10). On a directly related note, the O.J. trial also marked the launch of the instant news celebrity. Greta van Susteren, Marcia Clark and Gloria Allred are now inescapable, appearing with wearisome regularity on the screen like the haggish handmaidens of Big Brother, three Erinyes convinced that Orestes is to be found hiding somewhere in a television studio.</p><p>But if O.J. got the ball rolling, it was the Monica Lewinsky scandal that cemented the instant news celebrity in the public consciousness. Not only do we owe Miss Lewinsky a linguistic debt(11), but without her and Paula Jones we would not have come to know and love Lucianne Goldberg, her lovable teddy bear of a son, Jonah, Ann Coulter, and interchangeable Republican Barbie.(12) But it was not only these perma-guests that were made by the scandal; shows such as the O’Reilly Factor and Hannity and Colmes also saw their popularity explode.</p><p>The reason was simple. There was continuing interest in a story in which very little was known and almost nothing was happening. Even if the ABCNNBCBS cabal had been inclined to cover the self-destruction of a Democratic president – they weren’t – there was very little that a show even half-heartedly committed to hard news could cover. Bill Clinton wasn’t talking, Monica Lewinsky wasn’t talking, Paul Jones wasn’t talking, and even those who weren’t directly involved in the two cases were claiming legal considerations that prevented them from speaking with reporters.</p><p>But it wasn’t possible to simply ignore a story that had more compelling elements than any three Hollywood movies. Was Bill Clinton’s penis really crooked? Were we really supposed to believe that a notoriously horny old dog would hook up with a ripening young 38DD and keep his hands off her most prominent assets? Had he really done THAT with a CIGAR… with Yasser Arafat was waiting in the next room? Add a bad rhythm guitar and a moustache, and you practically had a 70’s porn flick in the making. No wonder the world was captivated.</p><p>And yet, there was still really nothing to say. No one actually knew anything new until Matt Drudge unveiled some shocking tidbit of information, at which point everyone learned about it at the same time. But the camera abhors a vaccuum no less than nature, and thanks to the 24-hour cable news channels, more time than ever required filling. Enter the new talking head, who substituted wisecracks for written copy, who was quick enough to think and spar on her feet, and was entertaining enough to allow people to forget that they were no more informed at the end of a show than they were at the start.(13)</p><p>Conservatives excelled immediately at this game, partly because years of being shut out of the mainstream media had prepared them for an adversarial relationship with the television hosts, and partly, as was previously mentioned, because they were seldom permitted to appear alone on a ABCNNBCBS show without being accompanied by a liberal(14) Greek anti-Chorus. The fact that many of them had some degree of familiarity with the brutally combative arena of the conservative talk radio ghetto meant that they were seldom thrown off-balance when a deceitful host tried to set them up for an ambush or a bait-and-switch.(15)</p><p>In short, they were ready to rumble. And audiences fell in love with hand-to-hand combat long before the first gladiators were shouting “<i>morituri te salutamus!</i>”(16) No blood is shed in the televised arena, but the news shoutfests bear far more similarity to a gladitorial combat than to the somber pronouncements of Walter Cronkite. This isn’t necessarily a bad thing; certainly it is vastly preferable for half of the viewing public to see someone championing their point of view instead of being forced to sit through pompous neosocialist lectures condemning the many evils of their bourgeous perspective. Give and take will always hold the attention longer than a monologue, Shakespeare’s excellent soliloquoys notwithstanding.</p><p>However, there can be little question that despite the divergence of views on offer, the end result provides far more entertainment than information. There’s nothing inherently wrong with that, for as novelists as diverse as Umberto Eco(17), Rigoberta Menchu and Dan Brown have all discovered, few things sell better than a product that makes its consumers feel smarter. You may not actually be in possession of a single iota of new information after watching Bill O’Reilly thump his chest and shout down a guest or seeing Tim Russert delve into the minutae of the House Appropriations Committee with a congressman, but you will nevertheless be left with the vague impression that you are better informed than if you had instead tuned in to the third re-run of <i>Friends </i>that evening. After all, you’ve been watching the news!</p><p><b>FOOTNOTES:</b></p><p>1. Can’t you see Stone Philips fronting the list of names starring in “I Know Who You Did Last Summer”? Okay, maybe it’s just me.</p><p>2. “I did pose for ‘Black and White’ magazine, a prestigious, artistic publication, several years ago.” Former CNN Headline News anchor Andrea Thompson in The New York Post. In 2002, the Washington Post reported that the CNN anchor had also performed “clothing-challenged work for an Australian magazine and an Italian erotic flick….”</p><p>3. She reached the apex of her unique brand of unintentional comedy in 1981, when she asked actress Katherine Hepburn the question: “If you were a tree, what kind would you be?” It seems Kate saw herself as an oak. I think I’m more of a birch. But a really tough-barked, hard-core birch you wouldn’t want to mess with, you know what I’m saying? A son of a birch, if you will.</p><p>4. The August 11, 2004 ratings showed that Fox News Channel’s prime time ratings averaged 2.058 million viewers, almost double the ratings for CNN, MSNBC and CNBC combined. Fox’s top show, The O’Reilly Factor, almost tripled the viewership of its top rival, CNN’s Larry King Live, with 2.666 million viewers compared to 985 thousand. Hang onto that soap, Larry.</p><p>5. 89 percent of 130 Washington bureau chiefs and congressional correspondents reported voting for Bill Clinton in 1992, compared to 7 percent for George Bush, the elder. Twelve years later, it is still almost impossible to name a single anchor or reporter working for the cabal that does not openly or implicitely pledge allegiance to the Democratic Party.</p><p>6. Or, as it is known in the colloquial, Darth Vader’s Theme.</p><p>7. Al Gore received 50,999,897 votes, or 48.38 percent of the popular vote, while George W. Bush received 50,456,002 votes, 47.87 percent. However, since the United States of America is a constitutional republic and not a pure representative democracy, Bush’s 271-266 victory in the Electoral College made the popular results irrelevant. That’s all completely beside the point here, but it’s best to get it out of the way anyhow.</p><p>8. Missing children who happen to be pretty little girls, anyhow. I have no evidence that Fox News has a detailed system wherein a missing child is assigned 2 points for being white, 4 points for being blonde, and 10 points for having an attractive mother, but I am suspicious. And is it truly only little girls who go missing? I’m just curious.</p><p>9. The O.J. car chase was the greatest moment in live news history. Listening to “Robert Higgins” telling Peter Jennings in an outrageously fake black accent so obvious that only a lobotomized Canadian could think it was real: “Oh my Lord, this is quite tenses… Ah see… OJ! Ah see OJ, man!” was, beyond any shadow of a doubt, the ultimate in news entertainment. We were screaming with laughter almost from the start. The best part was how Jennings had no idea that the caller was a prankster until Al Michaels explained it to him. Yeah, they’re real sharp, our media elite.</p><p>10. Yeah, like I watched and counted. If you harbor a strict accuracy fetish, simply substitute “a lot” for each of the categories mentioned.</p><p>11. I would argue that she must be credited, not only with her inadvertent eponymous contribution, but also for popularizing the concept of “obtaining one’s kneepads” as a synonymous alternative.</p><p>12. Ann Coulter, Barbara Olsen and Kellyanne Fitzpatrick nee’ Conway were the original three. Since then, Laurie Dhue, Linda Vester, Rita Cosby, Heather Nauert and Michelle Malkin have followed in their footsteps, but none of them have yet demonstrated the unique combination of savage intelligence and eye-rolling, hair-tossing nonchalance of the original.</p><p>13. Being blonde and looking good in a miniskirt didn’t exactly hurt either.</p><p>14. For simplicity’s sake, I use the terms “liberal” and “conservative” in the sense of being largely synonymous with “Democrat” and “Republican”. The former indicating an orientation towards the political left, the latter indicating an orientation towards the political right. As the two major parties have merged into a single bi-factional big government ruling party, these terms have become increasingly meaningless. See Appendix B.</p><p>15. Thomas Sowell explained why he turns down 90 percent of his TV and radio invitations in an April 2004 column, entitled “Bait-and-switch media”. After being invited on the program to talk about his book on affirmative action, he found himself being grilled by a third party about minimum wage laws. The old lion, familiar with the trick, left the host in the lurch live on the air by simply hanging up the phone. Booyakasha!</p><p>16. “We who are about to die salute you!”</p><p>17. I once asked Dr. Eco about the characterization of his novels being extremely successful, but often unread. He replied: “I must confess, there are books that I love very much, and I didn’t read them completely. It happens. When “The Name of the Rose” came out, so difficult and full of Latin quotations, and it had the success, it started the legend that it was an unread book. I am content.” And yes, we were actually hanging out at a monastery that day… because nobody kicks it like the real old skool.</p></div>",
  "content_text": "Back in 2004, an editor at Thomas Nelson contacted me with an idea for writing a book about the corruption of the mainstream media. I wrote four sample chapters and was signed to a contract to write\nMEDIA WHORES: COURTESANS AND CHARLATANS OF THE AMERICAN COMMENTARIAT\n, but they killed the book after discovering that I intended to write about media whores who were nominally on the Republican Right, such as Bill O’Reilly and Michelle Malkin, in addition to the various figures on the Democratic Left that they had expected me to target. This was one of several books I was paid to not write during that period of profitable unpublishability.\nSince most readers were not reading this blog 15 years ago, when I posted two of the sample chapters (One and Two), I’ll repost them, along with the other two that were written back then (Three and Ten), over the next week. You can probably understand why Thomas Nelson decided not to publish the book after they ran the sample chapters and the following table of contents past Andrew Napolitano to see if Fox News would put its weight behind the book.\nIt’s interesting to see the hits and misses. Malkin, Shapiro, Hannity, and Franken were spot on. Hitchens zigged away from the media proper and zagged into New Atheist quasi-celebrity, and O’Reilly self-imploded while Alterman went from being viewed as The Next Big Left-Wing Thing and my primary competition for Universal Press syndication to being mostly irrelevant despite his high-profile positions at Brooklyn College,\nThe Nation\n, and The Center for American Progress.\nINTRODUCTION\nBuilding the Brothel\nThe Courtesans\nThe Charlatans\nMe So Michelle: Michelle Malkin\nA Hedgehog, Deceased, On the Left Side of the Road: Eric Alterman\nMoDo’s Diary: Maureen Dowd\nThe Littlest Chickenhawk: Ben Shapiro\nThe Naked Economist: Paul Krugman\nHunting the White Whale: Michael Moore\nBrave Sir William: Bill O’Reilly\nWhat a Friend We Have in Trotsky: Christopher Hitchens\nHe-Man and Skeletor: Hannity and Colmes\nThe Smears of a Clown: Al Franken\nMEDIA WHORES: COURTESANS AND CHARLATANS OF THE AMERICAN COMMENTARIAT\nCHAPTER ONE: Building the Brothel\nVir qui amat sapientiam laetificat patrem suum qui autem nutrit scorta perdet substantiam.\nThe Buggles were wrong. Video didn’t kill the radio star. The truth is precisely to the contrary. Video not only made the radio star huge, it also made him a best-selling author, and more often than not, a pop icon to boot. Radio, television, cable, the internet, and even traditional newspaper and book publishing have insensibly merged into one massive and amorphous entity, known to its consumers as simply “the media”. But it too is a consumer; it is a voracious beast, devouring all that come within its grasp, and only the strongest, most single-minded parasites can survive and thrive in its acidic maw.\nWith the gradual transformation of what was once news into infotainment, the requirements for the talking heads who serve as the primary conduit from the beast to its beholders changed too. In the early days of television, talking heads were reporters who had spent years in the field, researching, interviewing, writing and recording their own news stories. Murrow, Cronkite, and even the recently retired Dan Rather are examples of this sort. They feigned an Olympian objectivity, hid their political affiliations and projected the sort of deep and immobile gravitas that made the term “network anchor” seem so fitting.\nAs the producers became more sophisticated and technologically adept, it became less and less necessary to have an experienced reporter reading the news or even writing original stories in the newspaper. Gravitas went by the wayside as attractive, focus-tested women were added to the mix, and with the exception of the primary network news broadcasts – the majestic second triumvirate of Brokaw, Willams and Jennings – the two-headed bi-gendered news team came to the fore. Teleprompters and professional writers meant that the talking heads were no longer required to write or think, allowing producers to concentrate on what matters most to the television viewing audiences, namely, looking at attractive men and women.\nThis second generation of television news brought to the forefront men with chiseled jaws and names like porn stars(1), accompanied by blondes with journalism-lite backgrounds that often included acting credits and tasteful nude photography(2). This model quickly became de riguer for the local news format, which is now such a matter of rote that one cannot easily distinguish between the ABC affiliate’s newscast in Minneapolis and the CBS affiliate’s newscast in Albuquerque. The basic cast is always the same; the forty-something neo-patriarch with a full head of hair touched with gray at the temples, the thirty-something blonde co-anchor, (ethnic optional in cities with large Black and Hispanic populations), a weatherman who is either a sexless androgyne or a beta blonde, and last and least, the roguish sports anchor.\nThe first cable channel, CNN, was largely content to follow in the footsteps of its predecessors, although its expansion of the news spigot from one to 24 hours daily would insensibly make its effect known over time. However, the shift from journalism-free journalists to full-blown infotainers accelerated quickly with the appearance of the Fox News Channel, which like Athena sprang fully accoutered for battle from the head of Roger Ailes, wisely eschewing the leftist slant hidden behind the condescending pretense at objectivity of the ABCNNBCBS cabal.\nInfotainment had long been present within the cabal, of course, but it was kept on the sidelines by an embarrassed media elite, in the context of crossover shows like 20/20 and Today. Barbara Walters became the unquestioned queen of the quasi-news with her infamous interviews on ABC, The Barbara Walters Specials, where she enlightened the American public by eliciting answers to insightful questions that no one else had ever dared to ask of international figures and celebrities.(3)\nThe terror of creeping infotainment at the networks during the early Eighties was such that Ms Walters managed to hold a co-anchor spot at ABC only briefly before being banished to matters arboreal. But it returned with vengeance in 1996, when the Fox News Channel burst onto the scene and in less than seven years, not only overturned the existing order but turned the cable news ratings war from a horse race into something bearing closer resemblance to a prison rape.(4)\nThe brilliance of Roger Ailes was two-fold. First, recognizing the iron law of supply and demand in a country evenly divided between what passes for “liberal” and “conservative” in the political spectrum, he offered a taste of what had hitherto been absent from the television screens of America. Where CNN was self-consciously international, Fox News was proudly patriotic. Where the ABCNNBCBS cabal inordinately consisted of those supporting Democrats(5), Fox dared to put self-proclaimed Republicans on the air without the accompanying soundtrack of The Imperial March(6) or pairing them with a polar opposite providing instant counterpoint.\nAiles’ logic was impeccable, demonstrating that alone among the executives of the media industry, only he understood the lessons of the talk radio phenomenon. Of the 105,405,100 votes cast in the 2000 presidential election, Al Gore and George Bush both received about 48 percent of the vote(7). But not only does the ABCNNBCBS news cabal market itself entirely towards the pro-Gore 48 percent, it is joined in doing so by PBS, MSNBC, and, to a lesser extent, CNBC. This abandonment of the opposite 48 percent equated to a wide-open market of epic proportions, which Ailes has exploited with ruthless abandon. The motto is “fair and balanced” and while the actual slant is only vaguely rightward, the symbolism is much more strongly so. Liberal-minded CNN cast-offs, such as Geraldo Rivera and Greta van Susteren, are forced to keep their inclinations firmly in check, while moderates are spun as conservatives at almost every opportunity.\nSecond, the Fox News chairman wholeheartedly embraced the concept of being the humble servant of the marketplace. The media has long had an inflated view of itself; it is nearly impossible to listen to a mainstream journalist recite a ponderous description of his ever-so-weighty responsibilities without bursting into laughter. The elite journalists see themselves as the Fourth Estate, asking the tough questions and dedicated to afflicting the comfortable and comforting the afflicted. If you have ever seen a journalist performing a Monica on a big celebrity get in what is apparently supposed to pass for an interview, it’s not hard to see that the media are not only deluded in this regard, but are also incredibly ill-suited to accurately observe human events.\nDue to this delusional self-regard, executives at the ABCNNBCBS cabal have long considered themselves above the dirty and unpleasant realities of the market, while government-funded PBS actually is free to ignore the wishes of great unwashed as it fulfills its sacred mission of allowing liberals to pretend they are intellectuals and loftily look down their noses at those who prefer entertainment that offers a frisson of divertissement. Fox News, on the other hand, appears to have an interest in making money, which in a capitalist society tends to involve paying a certain amount of attention to what the consumer wants.\nAnd what the cable news consumer wants, apparently, is pretty girls, in-depth coverage of murder trials, missing children(8) and car chases. Only eighteen months before the launch of the Fox News Channel, the famous O.J. Simpson car chase(9) and subsequent trial took place, and apparently it left an indelible impression on the soon-to-be Fox News Channel executives. It could be seen, in retrospect, as the perfect Foxian trifecta, combining a celebrity, a car chase and a murder trial. Had there only been an Amber Alert involved somewhere in the mix, it would have been the perfect story. And although the quattrocephalic news cabal flogged the O.J. trial mercilessly, no channel drew more useful conclusions from it than Fox News.\nIn the eight years since it made its debut, Fox News has covered 416 car chases, 42 missing children and 11 murder trials, which is approximately 469 more stories of the sort than PBS has covered(10). On a directly related note, the O.J. trial also marked the launch of the instant news celebrity. Greta van Susteren, Marcia Clark and Gloria Allred are now inescapable, appearing with wearisome regularity on the screen like the haggish handmaidens of Big Brother, three Erinyes convinced that Orestes is to be found hiding somewhere in a television studio.\nBut if O.J. got the ball rolling, it was the Monica Lewinsky scandal that cemented the instant news celebrity in the public consciousness. Not only do we owe Miss Lewinsky a linguistic debt(11), but without her and Paula Jones we would not have come to know and love Lucianne Goldberg, her lovable teddy bear of a son, Jonah, Ann Coulter, and interchangeable Republican Barbie.(12) But it was not only these perma-guests that were made by the scandal; shows such as the O’Reilly Factor and Hannity and Colmes also saw their popularity explode.\nThe reason was simple. There was continuing interest in a story in which very little was known and almost nothing was happening. Even if the ABCNNBCBS cabal had been inclined to cover the self-destruction of a Democratic president – they weren’t – there was very little that a show even half-heartedly committed to hard news could cover. Bill Clinton wasn’t talking, Monica Lewinsky wasn’t talking, Paul Jones wasn’t talking, and even those who weren’t directly involved in the two cases were claiming legal considerations that prevented them from speaking with reporters.\nBut it wasn’t possible to simply ignore a story that had more compelling elements than any three Hollywood movies. Was Bill Clinton’s penis really crooked? Were we really supposed to believe that a notoriously horny old dog would hook up with a ripening young 38DD and keep his hands off her most prominent assets? Had he really done THAT with a CIGAR… with Yasser Arafat was waiting in the next room? Add a bad rhythm guitar and a moustache, and you practically had a 70’s porn flick in the making. No wonder the world was captivated.\nAnd yet, there was still really nothing to say. No one actually knew anything new until Matt Drudge unveiled some shocking tidbit of information, at which point everyone learned about it at the same time. But the camera abhors a vaccuum no less than nature, and thanks to the 24-hour cable news channels, more time than ever required filling. Enter the new talking head, who substituted wisecracks for written copy, who was quick enough to think and spar on her feet, and was entertaining enough to allow people to forget that they were no more informed at the end of a show than they were at the start.(13)\nConservatives excelled immediately at this game, partly because years of being shut out of the mainstream media had prepared them for an adversarial relationship with the television hosts, and partly, as was previously mentioned, because they were seldom permitted to appear alone on a ABCNNBCBS show without being accompanied by a liberal(14) Greek anti-Chorus. The fact that many of them had some degree of familiarity with the brutally combative arena of the conservative talk radio ghetto meant that they were seldom thrown off-balance when a deceitful host tried to set them up for an ambush or a bait-and-switch.(15)\nIn short, they were ready to rumble. And audiences fell in love with hand-to-hand combat long before the first gladiators were shouting “\nmorituri te salutamus!\n”(16) No blood is shed in the televised arena, but the news shoutfests bear far more similarity to a gladitorial combat than to the somber pronouncements of Walter Cronkite. This isn’t necessarily a bad thing; certainly it is vastly preferable for half of the viewing public to see someone championing their point of view instead of being forced to sit through pompous neosocialist lectures condemning the many evils of their bourgeous perspective. Give and take will always hold the attention longer than a monologue, Shakespeare’s excellent soliloquoys notwithstanding.\nHowever, there can be little question that despite the divergence of views on offer, the end result provides far more entertainment than information. There’s nothing inherently wrong with that, for as novelists as diverse as Umberto Eco(17), Rigoberta Menchu and Dan Brown have all discovered, few things sell better than a product that makes its consumers feel smarter. You may not actually be in possession of a single iota of new information after watching Bill O’Reilly thump his chest and shout down a guest or seeing Tim Russert delve into the minutae of the House Appropriations Committee with a congressman, but you will nevertheless be left with the vague impression that you are better informed than if you had instead tuned in to the third re-run of\nFriends\nthat evening. After all, you’ve been watching the news!\nFOOTNOTES:\n1. Can’t you see Stone Philips fronting the list of names starring in “I Know Who You Did Last Summer”? Okay, maybe it’s just me.\n2. “I did pose for ‘Black and White’ magazine, a prestigious, artistic publication, several years ago.” Former CNN Headline News anchor Andrea Thompson in The New York Post. In 2002, the Washington Post reported that the CNN anchor had also performed “clothing-challenged work for an Australian magazine and an Italian erotic flick….”\n3. She reached the apex of her unique brand of unintentional comedy in 1981, when she asked actress Katherine Hepburn the question: “If you were a tree, what kind would you be?” It seems Kate saw herself as an oak. I think I’m more of a birch. But a really tough-barked, hard-core birch you wouldn’t want to mess with, you know what I’m saying? A son of a birch, if you will.\n4. The August 11, 2004 ratings showed that Fox News Channel’s prime time ratings averaged 2.058 million viewers, almost double the ratings for CNN, MSNBC and CNBC combined. Fox’s top show, The O’Reilly Factor, almost tripled the viewership of its top rival, CNN’s Larry King Live, with 2.666 million viewers compared to 985 thousand. Hang onto that soap, Larry.\n5. 89 percent of 130 Washington bureau chiefs and congressional correspondents reported voting for Bill Clinton in 1992, compared to 7 percent for George Bush, the elder. Twelve years later, it is still almost impossible to name a single anchor or reporter working for the cabal that does not openly or implicitely pledge allegiance to the Democratic Party.\n6. Or, as it is known in the colloquial, Darth Vader’s Theme.\n7. Al Gore received 50,999,897 votes, or 48.38 percent of the popular vote, while George W. Bush received 50,456,002 votes, 47.87 percent. However, since the United States of America is a constitutional republic and not a pure representative democracy, Bush’s 271-266 victory in the Electoral College made the popular results irrelevant. That’s all completely beside the point here, but it’s best to get it out of the way anyhow.\n8. Missing children who happen to be pretty little girls, anyhow. I have no evidence that Fox News has a detailed system wherein a missing child is assigned 2 points for being white, 4 points for being blonde, and 10 points for having an attractive mother, but I am suspicious. And is it truly only little girls who go missing? I’m just curious.\n9. The O.J. car chase was the greatest moment in live news history. Listening to “Robert Higgins” telling Peter Jennings in an outrageously fake black accent so obvious that only a lobotomized Canadian could think it was real: “Oh my Lord, this is quite tenses… Ah see… OJ! Ah see OJ, man!” was, beyond any shadow of a doubt, the ultimate in news entertainment. We were screaming with laughter almost from the start. The best part was how Jennings had no idea that the caller was a prankster until Al Michaels explained it to him. Yeah, they’re real sharp, our media elite.\n10. Yeah, like I watched and counted. If you harbor a strict accuracy fetish, simply substitute “a lot” for each of the categories mentioned.\n11. I would argue that she must be credited, not only with her inadvertent eponymous contribution, but also for popularizing the concept of “obtaining one’s kneepads” as a synonymous alternative.\n12. Ann Coulter, Barbara Olsen and Kellyanne Fitzpatrick nee’ Conway were the original three. Since then, Laurie Dhue, Linda Vester, Rita Cosby, Heather Nauert and Michelle Malkin have followed in their footsteps, but none of them have yet demonstrated the unique combination of savage intelligence and eye-rolling, hair-tossing nonchalance of the original.\n13. Being blonde and looking good in a miniskirt didn’t exactly hurt either.\n14. For simplicity’s sake, I use the terms “liberal” and “conservative” in the sense of being largely synonymous with “Democrat” and “Republican”. The former indicating an orientation towards the political left, the latter indicating an orientation towards the political right. As the two major parties have merged into a single bi-factional big government ruling party, these terms have become increasingly meaningless. See Appendix B.\n15. Thomas Sowell explained why he turns down 90 percent of his TV and radio invitations in an April 2004 column, entitled “Bait-and-switch media”. After being invited on the program to talk about his book on affirmative action, he found himself being grilled by a third party about minimum wage laws. The old lion, familiar with the trick, left the host in the lurch live on the air by simply hanging up the phone. Booyakasha!\n16. “We who are about to die salute you!”\n17. I once asked Dr. Eco about the characterization of his novels being extremely successful, but often unread. He replied: “I must confess, there are books that I love very much, and I didn’t read them completely. It happens. When “The Name of the Rose” came out, so difficult and full of Latin quotations, and it had the success, it started the legend that it was an unread book. I am content.” And yes, we were actually hanging out at a monastery that day… because nobody kicks it like the real old skool.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-12T14:52:49+00:00"
}