{
  "url": "https://voxday.net/2020/10/06/the-nba-waves-the-white-flag/",
  "scraped_at": "2025-12-21T13:10:21.025871",
  "title": "The NBA waves the white flag",
  "date_display": "October 6, 2020",
  "date_iso": "2020-10-06T23:04:19+00:00",
  "date_from_url": "2020-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They haven’t learned anything. But they desperately <a href=\"https://www.outkick.com/adam-silver-nba-social-justice-messaging-will-be-largely-left-off-the-court-next-season/\">want the beatings to stop</a>.</p><blockquote><p><b>Rachel Nichols:</b> The NBA has certainly been the most visible billion-dollar organization championing social justice and civil rights. As you noted in your press conference the other day, though, that has not been universally popular. How committed are you to being that going forward?</p><p><b>Adam Silver: </b>We’re completely committed to standing for social justice and racial equality and that’s been the case going back decades. It’s part of the DNA of this league. How it gets manifested is something we’re gonna have to sit down with the players and discuss for next season. I would say, in terms of the messages you see on the court and our jerseys, this was an extraordinary moment in time when we began these discussions with the players and what we all lived through this summer. My sense is there’ll be somewhat a return to normalcy, that those messages will largely be left to be delivered off the floor. And I understand those people who are saying ‘I’m on your side, but I want to watch a basketball game.’</p></blockquote><p>Translation: “We still hate you and want to destroy your nation, your culture, and your faith. But we’ll stop rubbing that hatred in your face, for the time being, if you’ll just come back.” And the sports fans whispered, “no”.</p></div>",
  "content_text": "They haven’t learned anything. But they desperately\nwant the beatings to stop\n.\nRachel Nichols:\nThe NBA has certainly been the most visible billion-dollar organization championing social justice and civil rights. As you noted in your press conference the other day, though, that has not been universally popular. How committed are you to being that going forward?\nAdam Silver:\nWe’re completely committed to standing for social justice and racial equality and that’s been the case going back decades. It’s part of the DNA of this league. How it gets manifested is something we’re gonna have to sit down with the players and discuss for next season. I would say, in terms of the messages you see on the court and our jerseys, this was an extraordinary moment in time when we began these discussions with the players and what we all lived through this summer. My sense is there’ll be somewhat a return to normalcy, that those messages will largely be left to be delivered off the floor. And I understand those people who are saying ‘I’m on your side, but I want to watch a basketball game.’\nTranslation: “We still hate you and want to destroy your nation, your culture, and your faith. But we’ll stop rubbing that hatred in your face, for the time being, if you’ll just come back.” And the sports fans whispered, “no”.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-06T22:04:19+00:00"
}