{
  "url": "https://voxday.net/2020/10/31/the-war-that-was-lost-2/",
  "scraped_at": "2025-12-21T13:13:44.095636",
  "title": "The war that was lost",
  "date_display": "October 31, 2020",
  "date_iso": "2020-10-31T10:50:22+00:00",
  "date_from_url": "2020-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Immigration, as the great Israeli military historian Martin van Creveld has shown, is war. And that war, not WWI, WWII, or the Cold War, was the true existential war that America faced, and lost, <a href=\"https://www.unz.com/book/e_a_ross__the-old-world-in-the-new/\" rel=\"noopener noreferrer\" target=\"_blank\">as demonstrated by this selection</a> from <i>The Old World in the New: The Significance of Past and Present Immigration to the American People</i>, published in 1914 by sociologist E.A. Ross:</p><blockquote><p>If you should ask an Englishman whether the tone of political life in his country would remain unaffected by the admission to the electorate of a couple of million Cypriotes, Vlachs, and Bessarabians after five years’ residence, he would take you for a madman. Suggest to the German that the plane of political intelligence in reading and thinking Germany would not be lowered by the access to the ballot-box of multitudes of Serbs, Georgians, and Druses of Lebanon, and he will consign you to bedlam. Assure the son of Norway that the vote of the Persian or Yemenite, of sixty months’ residence in Norway, will be as often wise and right as his own, and he will be insulted. It is only we Americans who assume that the voting of the Middle Atlantic States, with their million of naturalized citizens, or of the East North Central States, with their million, is as sane, discriminating, and forward-looking as it would be without them.</p><p>The Italian historian and sociologist Ferrero, after reviewing our immigration policy, concludes that the Americans, far from being “practical,” are really the mystics of the modern world. He says: “To confer citizenship each year upon great numbers of men born and educated in foreign countries—men who come with ideas and sympathies totally out of spirit with the diverse conditions in the new country; to grant them political rights they do not want, and of which they have never thought; to compel them to declare allegiance to a political constitution which they often do not understand; to try to transform subjects of old European monarchies into free citizens of young American republics over night—is not all this to do violence to common sense?”</p><p>As I sought to show, near the end of my initial chapter, the conditions of settlement of this country caused those of uncommon energy and venturesomeness to outmultiply the rest of the population. Thus came into existence the pioneering breed; and this breed increased until it is safe to estimate that fully half of white Americans with native grandparents have one or more pioneers among their ancestors. Whatever valuable race traits distinguish the American people from the parent European stocks are due to the efflorescence of this breed. Without it there would have been little in the performance of our people to arrest the attention of the world. Now we confront the melancholy spectacle of this pioneer breed being swamped and submerged by an overwhelming tide of latecomers from the old-world hive. In Atlanta still seven out of eight white men had American parents; in Nashville and Richmond, four out of five; in Kansas City, two out of three; and in Los Angeles, one out of two; but in Detroit, Cleveland, and Paterson one man out of five had American parents; in Chicago and New York, one out of six; in Milwaukee, one out of seven; and in Fall River, one out of nine. Certainly never since the colonial era have the foreign-born and their children formed so large a proportion of the American people as at the present moment. I scanned 368 persons as they passed me in Union Square, New York, at a time when the garment-workers of the Fifth Avenue lofts were returning to their homes. Only thirty-eight of these passers-by had the type of face one would find at a county fair in the West or South.</p><p>In the six or seven hundred thousand strangers that yearly join themselves to us for good and all, there are to be found, of course, every talent and every beauty. Out of the steerage come persons as fine and noble as any who have trodden American soil. Any adverse characterization of an immigrant stream implies, then, only that the trait is relatively frequent, not that it is universal.</p><p>In this sense it is fair to say that the blood now being injected into the veins of our people is “sub-common.” To one accustomed to the aspect of the normal American population, the Caliban type shows up with a frequency that is startling. Observe immigrants not as they come travel-wan up the gang-plank, nor as they issue toil-begrimed from pit’s mouth or mill gate, but in their gatherings, washed, combed, and in their Sunday best. You are struck by the fact that from ten to twenty per cent. are hirsute, low-browed, big-faced persons of obviously low mentality. Not that they suggest evil. They simply look out of place in black clothes and stiff collar, since clearly they belong in skins, in wattled huts at the close of the Great Ice Age. These oxlike men are descendants of <i>those who always stayed behind</i>. Those in whom the soul burns with the dull, smoky flame of the pine-knot stuck to the soil, and are now thick in the sluiceways of immigration. Those in whom it burns with a clear, luminous flame have been attracted to the cities of the home land and, having prospects, have no motive to submit themselves to the hardships of the steerage.</p><p>To the practised eye, the physiognomy of certain groups unmistakably proclaims inferiority of type. I have seen gatherings of the foreign-born in which narrow and sloping foreheads were the rule. The shortness and smallness of the crania were very noticeable. There was much facial asymmetry. Among the women, beauty, aside from the fleeting, epidermal bloom of girlhood, was quite lacking. In every face there was something wrong—lips thick, mouth coarse, upper lip too long, cheek-bones too high, chin poorly formed, the bridge of the nose hollowed, the base of the nose tilted, or else the whole face prognathous. There were so many sugar-loaf heads, moon-faces, slit mouths, lantern-jaws, and goose-bill noses that one might imagine a malicious jinn had amused himself by casting human beings in a set of skew-molds discarded by the Creator.</p><p>Our captains of industry give a crowbar to the immigrant with a number nine face on a number six head, make a dividend out of him, and imagine that is the end of the matter. They overlook that this man will beget children in his image—two or three times as many as the American—and that these children will in turn beget children. They chuckle at having opened an inexhaustible store of cheap tools and, lo! the American people is being altered for all time by these tools. Once before, captains of industry took a hand in making this people. Colonial planters imported Africans to hoe in the sun, to “develop” the tobacco, indigo, and rice plantations. Then, as now, business-minded men met with contempt the protests of a few idealists against their way of “building up the country.”</p><p>Those promoters of prosperity are dust, but they bequeathed a situation which in four years wiped out more wealth than two hundred years of slavery had built up, and which presents to-day the one unsolvable problem in this country. Without likening immigrants to negroes, one may point out how the latter-day employer resembles the old-time planter in his blindness to the effects of his labor policy upon the blood of the nation.</p></blockquote><p>If America is to leave behind any historical legacy for the ages, it is this. First, pick your own damn cotton. Second, always sink the ships. Third, never let business-minded men set national policy, because for all their pragmatism, they are totally incapable of seeing anything beyond tomorrow’s pocketbook.</p><p>Seldom has a Cassandra foreseen coming catastrophe more clearly. It is small, though rather cold, comfort to know that the die was cast long before most of us were even born. Even so, Ross’s closing paragraph is a haunting one.</p><p><i>“The Roman world was laughing when it died.” Any couple or any people that does not feel it has anything to transmit to its children may well reason in such fashion. A couple may reflect, “It is simpler, speedier, and cheaper for us to adopt orphans than to produce children of our own.” A nation may reason, “Why burden ourselves with the rearing of children? Let them perish unborn in the womb of time. The immigrants will keep up the population.” A people that has no more respect for its ancestors and no more pride of race than this deserves the extinction that surely awaits it.</i></p></div>",
  "content_text": "Immigration, as the great Israeli military historian Martin van Creveld has shown, is war. And that war, not WWI, WWII, or the Cold War, was the true existential war that America faced, and lost,\nas demonstrated by this selection\nfrom\nThe Old World in the New: The Significance of Past and Present Immigration to the American People\n, published in 1914 by sociologist E.A. Ross:\nIf you should ask an Englishman whether the tone of political life in his country would remain unaffected by the admission to the electorate of a couple of million Cypriotes, Vlachs, and Bessarabians after five years’ residence, he would take you for a madman. Suggest to the German that the plane of political intelligence in reading and thinking Germany would not be lowered by the access to the ballot-box of multitudes of Serbs, Georgians, and Druses of Lebanon, and he will consign you to bedlam. Assure the son of Norway that the vote of the Persian or Yemenite, of sixty months’ residence in Norway, will be as often wise and right as his own, and he will be insulted. It is only we Americans who assume that the voting of the Middle Atlantic States, with their million of naturalized citizens, or of the East North Central States, with their million, is as sane, discriminating, and forward-looking as it would be without them.\nThe Italian historian and sociologist Ferrero, after reviewing our immigration policy, concludes that the Americans, far from being “practical,” are really the mystics of the modern world. He says: “To confer citizenship each year upon great numbers of men born and educated in foreign countries—men who come with ideas and sympathies totally out of spirit with the diverse conditions in the new country; to grant them political rights they do not want, and of which they have never thought; to compel them to declare allegiance to a political constitution which they often do not understand; to try to transform subjects of old European monarchies into free citizens of young American republics over night—is not all this to do violence to common sense?”\nAs I sought to show, near the end of my initial chapter, the conditions of settlement of this country caused those of uncommon energy and venturesomeness to outmultiply the rest of the population. Thus came into existence the pioneering breed; and this breed increased until it is safe to estimate that fully half of white Americans with native grandparents have one or more pioneers among their ancestors. Whatever valuable race traits distinguish the American people from the parent European stocks are due to the efflorescence of this breed. Without it there would have been little in the performance of our people to arrest the attention of the world. Now we confront the melancholy spectacle of this pioneer breed being swamped and submerged by an overwhelming tide of latecomers from the old-world hive. In Atlanta still seven out of eight white men had American parents; in Nashville and Richmond, four out of five; in Kansas City, two out of three; and in Los Angeles, one out of two; but in Detroit, Cleveland, and Paterson one man out of five had American parents; in Chicago and New York, one out of six; in Milwaukee, one out of seven; and in Fall River, one out of nine. Certainly never since the colonial era have the foreign-born and their children formed so large a proportion of the American people as at the present moment. I scanned 368 persons as they passed me in Union Square, New York, at a time when the garment-workers of the Fifth Avenue lofts were returning to their homes. Only thirty-eight of these passers-by had the type of face one would find at a county fair in the West or South.\nIn the six or seven hundred thousand strangers that yearly join themselves to us for good and all, there are to be found, of course, every talent and every beauty. Out of the steerage come persons as fine and noble as any who have trodden American soil. Any adverse characterization of an immigrant stream implies, then, only that the trait is relatively frequent, not that it is universal.\nIn this sense it is fair to say that the blood now being injected into the veins of our people is “sub-common.” To one accustomed to the aspect of the normal American population, the Caliban type shows up with a frequency that is startling. Observe immigrants not as they come travel-wan up the gang-plank, nor as they issue toil-begrimed from pit’s mouth or mill gate, but in their gatherings, washed, combed, and in their Sunday best. You are struck by the fact that from ten to twenty per cent. are hirsute, low-browed, big-faced persons of obviously low mentality. Not that they suggest evil. They simply look out of place in black clothes and stiff collar, since clearly they belong in skins, in wattled huts at the close of the Great Ice Age. These oxlike men are descendants of\nthose who always stayed behind\n. Those in whom the soul burns with the dull, smoky flame of the pine-knot stuck to the soil, and are now thick in the sluiceways of immigration. Those in whom it burns with a clear, luminous flame have been attracted to the cities of the home land and, having prospects, have no motive to submit themselves to the hardships of the steerage.\nTo the practised eye, the physiognomy of certain groups unmistakably proclaims inferiority of type. I have seen gatherings of the foreign-born in which narrow and sloping foreheads were the rule. The shortness and smallness of the crania were very noticeable. There was much facial asymmetry. Among the women, beauty, aside from the fleeting, epidermal bloom of girlhood, was quite lacking. In every face there was something wrong—lips thick, mouth coarse, upper lip too long, cheek-bones too high, chin poorly formed, the bridge of the nose hollowed, the base of the nose tilted, or else the whole face prognathous. There were so many sugar-loaf heads, moon-faces, slit mouths, lantern-jaws, and goose-bill noses that one might imagine a malicious jinn had amused himself by casting human beings in a set of skew-molds discarded by the Creator.\nOur captains of industry give a crowbar to the immigrant with a number nine face on a number six head, make a dividend out of him, and imagine that is the end of the matter. They overlook that this man will beget children in his image—two or three times as many as the American—and that these children will in turn beget children. They chuckle at having opened an inexhaustible store of cheap tools and, lo! the American people is being altered for all time by these tools. Once before, captains of industry took a hand in making this people. Colonial planters imported Africans to hoe in the sun, to “develop” the tobacco, indigo, and rice plantations. Then, as now, business-minded men met with contempt the protests of a few idealists against their way of “building up the country.”\nThose promoters of prosperity are dust, but they bequeathed a situation which in four years wiped out more wealth than two hundred years of slavery had built up, and which presents to-day the one unsolvable problem in this country. Without likening immigrants to negroes, one may point out how the latter-day employer resembles the old-time planter in his blindness to the effects of his labor policy upon the blood of the nation.\nIf America is to leave behind any historical legacy for the ages, it is this. First, pick your own damn cotton. Second, always sink the ships. Third, never let business-minded men set national policy, because for all their pragmatism, they are totally incapable of seeing anything beyond tomorrow’s pocketbook.\nSeldom has a Cassandra foreseen coming catastrophe more clearly. It is small, though rather cold, comfort to know that the die was cast long before most of us were even born. Even so, Ross’s closing paragraph is a haunting one.\n“The Roman world was laughing when it died.” Any couple or any people that does not feel it has anything to transmit to its children may well reason in such fashion. A couple may reflect, “It is simpler, speedier, and cheaper for us to adopt orphans than to produce children of our own.” A nation may reason, “Why burden ourselves with the rearing of children? Let them perish unborn in the womb of time. The immigrants will keep up the population.” A people that has no more respect for its ancestors and no more pride of race than this deserves the extinction that surely awaits it.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-31T10:50:22+00:00"
}