{
  "url": "https://voxday.net/2020/10/26/this-is-what-gatekeeping-looks-like/",
  "scraped_at": "2025-12-21T13:13:03.172778",
  "title": "This is what gatekeeping looks like",
  "date_display": "October 26, 2020",
  "date_iso": "2020-10-26T22:39:16+00:00",
  "date_from_url": "2020-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While whining about how Amazon won’t post his Very Important Review of <i>The Plot Against the President</i>, Powerline’s Scott Johnson <a href=\"https://www.powerlineblog.com/archives/2020/10/the-plot-against-the-president-my-rejected-amazon-review.php\" rel=\"noopener noreferrer\" target=\"_blank\">reveals his real imperative</a> as a conservative gatekeeper:</p><blockquote><p>I found three of the several talking heads in the film to be out of place: Mike Cernovich, Kimberly Guilfoyle, and Jack Posobiec. However, I appreciated the inclusion of the eminent historian Edward Luttwak. Among Luttwak’s many books is <i>Coup d’État: A Practical Handbook</i>. He brings scholarly expertise to the theme of the film. He knows what he is talking about.</p></blockquote><p>Keep in mind that the “eminent historian” is primarily known by historians for writing a book about Roman grand strategy while being clueless about Roman history, and is famous for wrongly predicting that Desert Storm was going to be a protracted and bloody campaign in which U.S. troops would suffer thousands of casualties. He has also written a book on the “grand strategy” of the Byzantine empire despite knowing no more about the Byzantine empire than you, me, or Kimberly Guifoyle.</p><p>Notice that Johnson doesn’t explain why three people who are active observers of U.S. politics are supposed to be more out of place than an obvious ticket-taking globalist who still doesn’t understand how Trump was elected in the first place, and whose referenced book is “a hilarious satire”.</p></div>",
  "content_text": "While whining about how Amazon won’t post his Very Important Review of\nThe Plot Against the President\n, Powerline’s Scott Johnson\nreveals his real imperative\nas a conservative gatekeeper:\nI found three of the several talking heads in the film to be out of place: Mike Cernovich, Kimberly Guilfoyle, and Jack Posobiec. However, I appreciated the inclusion of the eminent historian Edward Luttwak. Among Luttwak’s many books is\nCoup d’État: A Practical Handbook\n. He brings scholarly expertise to the theme of the film. He knows what he is talking about.\nKeep in mind that the “eminent historian” is primarily known by historians for writing a book about Roman grand strategy while being clueless about Roman history, and is famous for wrongly predicting that Desert Storm was going to be a protracted and bloody campaign in which U.S. troops would suffer thousands of casualties. He has also written a book on the “grand strategy” of the Byzantine empire despite knowing no more about the Byzantine empire than you, me, or Kimberly Guifoyle.\nNotice that Johnson doesn’t explain why three people who are active observers of U.S. politics are supposed to be more out of place than an obvious ticket-taking globalist who still doesn’t understand how Trump was elected in the first place, and whose referenced book is “a hilarious satire”.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-26T22:39:16+00:00"
}