{
  "url": "https://voxday.net/2020/10/14/upping-our-game/",
  "scraped_at": "2025-12-21T13:11:14.870143",
  "title": "Upping our game",
  "date_display": "October 14, 2020",
  "date_iso": "2020-10-14T13:49:54+00:00",
  "date_from_url": "2020-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For the last 17 years, I’ve done my best to keep my professional game development work separate from my political writing and my blog. But now that the SJWs have invaded and politicized my beloved game industry, there is no longer any need to keep these two areas of interest apart, in fact, one can reasonably argue on the basis of Castalia’s success in the publishing arena that my own uncloaking in this regard will tend to inspire others to do so, and may help establish sizable niche markets that are capable of not only surviving, but thriving.</p><p>The approach of a major milestone here inspired me to think about what has made VP successful over time when so many other blogs, even very popular, well-trafficked blogs, have disappeared. So, I’m going to increase my posting at DevGame and I’m also going to recruit other high-quality game developers, game reviewers, and comics creators to contribute regularly at both Arkhaven and DevGame. Comics writer Jon Del Arroz has already agreed to begin contributing posts at Arkhaven, and I’ve just put up my first post in a very long time at DevGame, which is an article published 13 years ago in <a href=\"https://en.wikipedia.org/wiki/Develop_(magazine)\" rel=\"noopener noreferrer\" target=\"_blank\">DEVELOP</a> magazine called <i><a href=\"https://devgamecourse.blogspot.com/2020/10/the-art-of-imitative-design.html\" rel=\"noopener noreferrer\" target=\"_blank\">The Art of Imitative Design</a></i>.</p><blockquote><p>Why does one game succeed brilliantly while another game vanishes into obscurity? Why is one game an absolute blast to play while another, very similar game, simply isn’t that much fun? It is often easy to understand why a game fails, but it is usually more difficult to ascertain why one game becomes a hit when another does not, epecially when the hit does not feature better features, prettier art, faster performance, or a most distinctive brand than other games in the same genre.</p><p>In most cases, success comes down to superior game design, by which I mean the use of game concepts and mechanics that provide the player with a more enjoyable gameplay experience. Game design should never be confused with game development or with production, as it is the aspect of game development that consists of conceiving and articulating ideas that are subsequently turned into functional reality through the process of production.</p><p>There are four types of game design.</p><ul style=\"text-align: left;\"><li>Original</li><li>Evolutionary</li><li>Synthetic</li><li>Imitative</li></ul></blockquote><p>Read the rest <a href=\"https://www.blogger.com/blog/post/edit/5604161/7014884849864496615#\" rel=\"noopener noreferrer\" target=\"_blank\">at DevGame</a>, which I would very much like to see gradually evolve into something more like a digital version of <i>Computer Gaming World</i> or a <i>Gamasutra.</i></p></div>",
  "content_text": "For the last 17 years, I’ve done my best to keep my professional game development work separate from my political writing and my blog. But now that the SJWs have invaded and politicized my beloved game industry, there is no longer any need to keep these two areas of interest apart, in fact, one can reasonably argue on the basis of Castalia’s success in the publishing arena that my own uncloaking in this regard will tend to inspire others to do so, and may help establish sizable niche markets that are capable of not only surviving, but thriving.\nThe approach of a major milestone here inspired me to think about what has made VP successful over time when so many other blogs, even very popular, well-trafficked blogs, have disappeared. So, I’m going to increase my posting at DevGame and I’m also going to recruit other high-quality game developers, game reviewers, and comics creators to contribute regularly at both Arkhaven and DevGame. Comics writer Jon Del Arroz has already agreed to begin contributing posts at Arkhaven, and I’ve just put up my first post in a very long time at DevGame, which is an article published 13 years ago in\nDEVELOP\nmagazine called\nThe Art of Imitative Design\n.\nWhy does one game succeed brilliantly while another game vanishes into obscurity? Why is one game an absolute blast to play while another, very similar game, simply isn’t that much fun? It is often easy to understand why a game fails, but it is usually more difficult to ascertain why one game becomes a hit when another does not, epecially when the hit does not feature better features, prettier art, faster performance, or a most distinctive brand than other games in the same genre.\nIn most cases, success comes down to superior game design, by which I mean the use of game concepts and mechanics that provide the player with a more enjoyable gameplay experience. Game design should never be confused with game development or with production, as it is the aspect of game development that consists of conceiving and articulating ideas that are subsequently turned into functional reality through the process of production.\nThere are four types of game design.\nOriginal\nEvolutionary\nSynthetic\nImitative\nRead the rest\nat DevGame\n, which I would very much like to see gradually evolve into something more like a digital version of\nComputer Gaming World\nor a\nGamasutra.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-14T12:49:54+00:00"
}