{
  "url": "https://voxday.net/2020/10/19/whatever-could-it-be/",
  "scraped_at": "2025-12-21T13:12:00.600968",
  "title": "Whatever could it be?",
  "date_display": "October 19, 2020",
  "date_iso": "2020-10-19T15:00:05+00:00",
  "date_from_url": "2020-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of sportswriters, Peter King is confused as to why people are watching less sports at a time when they’re spending more time at home with less to do.</p><blockquote><p>I think this poll, from the Marist (N.Y.) Center for Sports Communications/Marist Poll, really surprised me: Of 1,560 random Americans at the end of September, 46 percent say they are watching fewer live sports events on TV. That goes against anything we’d normally think. In a pandemic, when people are forced indoors and forced in many instances to be isolated, wouldn’t you figure people would be watching more sports, not less? There wasn’t one dominant reason for the decline, said Jane McManus, longtime sportswriter and director of the Marist Center for Sports Communication—though 35 percent of those polled said concern about gathering with friends to watch sports was a prime reason; “athletes speaking out on political issue” was 32 percent, with the interest in the flood of news/election coverage making respondents 20 percent less likely to watch live sports. “We live in complicated times,” McManus told me. “Viewership traditions have been upended. Say you might have a tradition of watching the football game with your elderly father. Maybe now you’re staying away from your elderly father because you’re being careful about COVID-19.”</p><p>I think the one other striking point of comparison was the decline of those who consider themselves fans of football. A 2017 Marist poll found that 67 percent of respondents were football fans. The 2020 poll found that only 52 percent were. (Baseball was down, from 51 to 37 percent; basketball down from 44 to 37 percent—odd considering the poll was taken this time in the midst of exciting playoffs.) McManus said: “I don’t think you can isolate on any one thing right now, except that it seems people just have less bandwidth to deal with sports. For instance, I don’t think 67 to 52 for football is forever. Maybe you lost your job, you’re dealing with unemployment, your life is totally different than it was. I just think people’s focus is fractured, and the erosion is happening for every reason.”</p></blockquote><p>The stubborn obtuseness of the social justice media is downright amusing at times. Readers have been telling Peter King <i>for years</i> to keep the politics out of his columns, and he has resolutely told them to take a hike if they don’t like his regular, though admittedly minimalistic, tangents about Trump, the coronavirus, gay rights, and BLM, to name a few. And to be fair, the size of his audience has not been reduced by these occasional little excursions, which may be why King finds it hard to believe that people are actually turning off the NFL due to all the anti-American political propaganda and BLM histrionics.</p><p>The key difference here is that King, although he’s never seen a left-wing cause he doesn’t instinctively support, has pretty much kept the political nonsense to a minimum. His columns are not only very much devoted to football and full of inside football detail, they are also extraordinarily long. He usually confines his political meanderings to one, or sometimes two, points in his 10 Things I Think I Think section, which is usually less than a tenth of his weekly column, and is located at the bottom. For example, in this week’s column, the overtly political content is largely limited to this:</p><p><i>o. Fifteen days till election day. From the sounds and looks of things, voting early is the best plan. It’s my plan.</i></p><p>And you know, if a veteran sportswriter wants to devote 21 words out of nearly 12,000 to his personal politics, he’s earned the right to indulge himself. Even if he was promulgating rank heresy about the God-Emperor, that little aside is nothing that can’t be easily skipped. But what King does, however irritating one finds it to be, is both qualitatively and quantitatively different than what the professional sports leagues are presently inflicting on their long-suffering and increasingly-distant fans. The non-stop political propaganda, the relentless insults to the flag and the anthem, and the ignorant chatter of the commentators completely ruins the experience for the average spectator.</p><p>Which, of course, is why, like more than a few other lifelong NFL fans, I haven’t watched a single minute of an NFL game or NFL coverage this year. Then again, from what I’ve read, this appears to be an excellent year for Vikings fans to assiduously avoid watching them play.</p></div>",
  "content_text": "Speaking of sportswriters, Peter King is confused as to why people are watching less sports at a time when they’re spending more time at home with less to do.\nI think this poll, from the Marist (N.Y.) Center for Sports Communications/Marist Poll, really surprised me: Of 1,560 random Americans at the end of September, 46 percent say they are watching fewer live sports events on TV. That goes against anything we’d normally think. In a pandemic, when people are forced indoors and forced in many instances to be isolated, wouldn’t you figure people would be watching more sports, not less? There wasn’t one dominant reason for the decline, said Jane McManus, longtime sportswriter and director of the Marist Center for Sports Communication—though 35 percent of those polled said concern about gathering with friends to watch sports was a prime reason; “athletes speaking out on political issue” was 32 percent, with the interest in the flood of news/election coverage making respondents 20 percent less likely to watch live sports. “We live in complicated times,” McManus told me. “Viewership traditions have been upended. Say you might have a tradition of watching the football game with your elderly father. Maybe now you’re staying away from your elderly father because you’re being careful about COVID-19.”\nI think the one other striking point of comparison was the decline of those who consider themselves fans of football. A 2017 Marist poll found that 67 percent of respondents were football fans. The 2020 poll found that only 52 percent were. (Baseball was down, from 51 to 37 percent; basketball down from 44 to 37 percent—odd considering the poll was taken this time in the midst of exciting playoffs.) McManus said: “I don’t think you can isolate on any one thing right now, except that it seems people just have less bandwidth to deal with sports. For instance, I don’t think 67 to 52 for football is forever. Maybe you lost your job, you’re dealing with unemployment, your life is totally different than it was. I just think people’s focus is fractured, and the erosion is happening for every reason.”\nThe stubborn obtuseness of the social justice media is downright amusing at times. Readers have been telling Peter King\nfor years\nto keep the politics out of his columns, and he has resolutely told them to take a hike if they don’t like his regular, though admittedly minimalistic, tangents about Trump, the coronavirus, gay rights, and BLM, to name a few. And to be fair, the size of his audience has not been reduced by these occasional little excursions, which may be why King finds it hard to believe that people are actually turning off the NFL due to all the anti-American political propaganda and BLM histrionics.\nThe key difference here is that King, although he’s never seen a left-wing cause he doesn’t instinctively support, has pretty much kept the political nonsense to a minimum. His columns are not only very much devoted to football and full of inside football detail, they are also extraordinarily long. He usually confines his political meanderings to one, or sometimes two, points in his 10 Things I Think I Think section, which is usually less than a tenth of his weekly column, and is located at the bottom. For example, in this week’s column, the overtly political content is largely limited to this:\no. Fifteen days till election day. From the sounds and looks of things, voting early is the best plan. It’s my plan.\nAnd you know, if a veteran sportswriter wants to devote 21 words out of nearly 12,000 to his personal politics, he’s earned the right to indulge himself. Even if he was promulgating rank heresy about the God-Emperor, that little aside is nothing that can’t be easily skipped. But what King does, however irritating one finds it to be, is both qualitatively and quantitatively different than what the professional sports leagues are presently inflicting on their long-suffering and increasingly-distant fans. The non-stop political propaganda, the relentless insults to the flag and the anthem, and the ignorant chatter of the commentators completely ruins the experience for the average spectator.\nWhich, of course, is why, like more than a few other lifelong NFL fans, I haven’t watched a single minute of an NFL game or NFL coverage this year. Then again, from what I’ve read, this appears to be an excellent year for Vikings fans to assiduously avoid watching them play.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-10-19T14:00:05+00:00"
}