{
  "url": "https://voxday.net/2013/05/28/100k-martyrs-annually/",
  "scraped_at": "2025-12-14T22:30:14.226427",
  "title": "100k martyrs annually",
  "date_display": "May 28, 2013",
  "date_iso": "2013-05-28T20:30:00+00:00",
  "date_from_url": "2013-05-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Don’t think <a href=\"http://www.breitbart.com/system/wire/CNG---4fd7225a1fea039d4d9f6435239389ed---6b1\">the world has progressed</a> past Christian persecution:</p><blockquote class=\"tr_bq\"><p> A top Vatican official has said around 100,000 Christians are killed<br> every year for reasons linked to their faith and pointed to the Middle<br> East, Africa and Asia as the biggest problem areas.</br></br></p><p>Monsignor<br> Silvano Maria Tomasi was quoted by Vatican radio on Tuesday as saying<br> that the figures were “shocking” and “incredible”.</br></br></p><p>Tomasi said<br> Christians were also forced to leave their homes and see their churches<br> destroyed in some parts of the world, and were often subjected to rapes,<br> kidnappings and discrimination. The Vatican official made particular reference to the kidnapping of two Orthodox bishops near Aleppo in Syria last month.</br></br></br></p></blockquote><p>Unless new Charles Martels arise, secular and pagan persecution will eventually come to infest what was once Christendom just as it plagues much of the rest of the world.  The world always hates and fears what it cannot control. </p><p>Christendom and the West were established by Christians willing to fight for their faith.  While there is room to discuss the theological correctness of their efforts, those who will give up their faith rather than die for it or fight for it have no place in the discussion.</p></div>",
  "content_text": "Don’t think\nthe world has progressed\npast Christian persecution:\nA top Vatican official has said around 100,000 Christians are killed\nevery year for reasons linked to their faith and pointed to the Middle\nEast, Africa and Asia as the biggest problem areas.\nMonsignor\nSilvano Maria Tomasi was quoted by Vatican radio on Tuesday as saying\nthat the figures were “shocking” and “incredible”.\nTomasi said\nChristians were also forced to leave their homes and see their churches\ndestroyed in some parts of the world, and were often subjected to rapes,\nkidnappings and discrimination. The Vatican official made particular reference to the kidnapping of two Orthodox bishops near Aleppo in Syria last month.\nUnless new Charles Martels arise, secular and pagan persecution will eventually come to infest what was once Christendom just as it plagues much of the rest of the world.  The world always hates and fears what it cannot control.\nChristendom and the West were established by Christians willing to fight for their faith.  While there is room to discuss the theological correctness of their efforts, those who will give up their faith rather than die for it or fight for it have no place in the discussion.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-28T19:30:00+00:00"
}