{
  "url": "https://voxday.net/2013/05/29/academia-needs-women/",
  "scraped_at": "2025-12-14T22:30:17.505113",
  "title": "Academia needs women!",
  "date_display": "May 29, 2013",
  "date_iso": "2013-05-29T13:12:00+00:00",
  "date_from_url": "2013-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or the survival of the university system <a href=\"http://www.guardian.co.uk/higher-education-network/blog/2012/may/24/why-women-leave-academia\">is at risk</a>!  Although I don’t quite see how either more or less female professors is going to stop universities from being able to overcharge indebted young men and women for useless degrees.  Stickwick, who is herself a female academic with a PhD, has a few thoughts:</p><blockquote class=\"tr_bq\"><p> Thought you might find this interesting, if only for the way people are trying to spin this old news.</p><p>Truth: Few PhD candidates, male or female, want to pursue an academic career once they get a taste of the life in graduate school.</p><p>Spin: Women are being driven out of academia!! The survival of academia is threatened!!!</p><p>By their third year in grad school, only 21% of men in grad school say they want to pursue an academic career. The number drops to 12% for<br> women, and it’s for the usual reasons — women see academia as very competitive and requiring a lot of personal sacrifice. There’s nothing<br> new here; but the spin is very silly. What I find preposterous, besides the notion that academia cannot survive without women, is the claim th academia is in any way threatened by the fact that relatively few people want academic careers. The last thing we need right now is more PhDs. I have friends who are on their third post-docs, because they can’t even find jobs at small liberal arts universities.</br></br></p><p>For every job offered at a halfway good institution, there are literally hundreds of applicants. On top of this, there is very little grant money available; soft-money people everywhere are scrambling to find any funding at all. Universities are cutting every position they possibly can. It makes no sense for the author of this article to claim that academia is in any way threatened by a smaller applicant pool.</p></blockquote><p>What I find amusing is this claim by the author of the article: “We will not survive because we have no reason to believe we are attracting the best and the brightest.”  But the fact is that the universities stopped doing that the moment they openly announced their intention to employ more women and minorities while at the same time blackballing Christians and political conservatives.  The best and the brightest at my university’s economics department were me and the White Buffalo.  He was the departmental award winner while I was permitted to do three independent studies with my professors rather than bothering with classes. And I’ve now published more books on economics than most of my professors had.  But neither of us ever considered, for a moment, an academic career, nor were we ever encouraged to pursue one.</p><p>The fundamental problem for the Left is that it is not possible to simultaneously pursue both equality and excellence.</p></div>",
  "content_text": "Or the survival of the university system\nis at risk\n!  Although I don’t quite see how either more or less female professors is going to stop universities from being able to overcharge indebted young men and women for useless degrees.  Stickwick, who is herself a female academic with a PhD, has a few thoughts:\nThought you might find this interesting, if only for the way people are trying to spin this old news.\nTruth: Few PhD candidates, male or female, want to pursue an academic career once they get a taste of the life in graduate school.\nSpin: Women are being driven out of academia!! The survival of academia is threatened!!!\nBy their third year in grad school, only 21% of men in grad school say they want to pursue an academic career. The number drops to 12% for\nwomen, and it’s for the usual reasons — women see academia as very competitive and requiring a lot of personal sacrifice. There’s nothing\nnew here; but the spin is very silly. What I find preposterous, besides the notion that academia cannot survive without women, is the claim th academia is in any way threatened by the fact that relatively few people want academic careers. The last thing we need right now is more PhDs. I have friends who are on their third post-docs, because they can’t even find jobs at small liberal arts universities.\nFor every job offered at a halfway good institution, there are literally hundreds of applicants. On top of this, there is very little grant money available; soft-money people everywhere are scrambling to find any funding at all. Universities are cutting every position they possibly can. It makes no sense for the author of this article to claim that academia is in any way threatened by a smaller applicant pool.\nWhat I find amusing is this claim by the author of the article: “We will not survive because we have no reason to believe we are attracting the best and the brightest.”  But the fact is that the universities stopped doing that the moment they openly announced their intention to employ more women and minorities while at the same time blackballing Christians and political conservatives.  The best and the brightest at my university’s economics department were me and the White Buffalo.  He was the departmental award winner while I was permitted to do three independent studies with my professors rather than bothering with classes. And I’ve now published more books on economics than most of my professors had.  But neither of us ever considered, for a moment, an academic career, nor were we ever encouraged to pursue one.\nThe fundamental problem for the Left is that it is not possible to simultaneously pursue both equality and excellence.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-29T12:12:00+00:00"
}