{
  "url": "https://voxday.net/2013/05/24/another-step-reaches-cabine/",
  "scraped_at": "2025-12-14T22:29:48.908025",
  "title": "Another step reaches the Cabinet",
  "date_display": "May 24, 2013",
  "date_iso": "2013-05-24T07:05:00+00:00",
  "date_from_url": "2013-05-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The dam is cracking:</p><blockquote class=\"tr_bq\"><p> Attorney General Eric Holder signed off on a controversial search<br> warrant that identified Fox News reporter James Rosen as a “possible<br> co-conspirator” in violations of the Espionage Act and authorized<br> seizure of his private emails, a law enforcement official told NBC News<br> on Thursday.</br></br></br></br></p><div class=\"inlineCode photo_align_right\" data-contentid=\"18451189\" id=\"vine-inlineCode__18451189\"></div><p>The<br> disclosure of the attorney general’s role came as President Barack<br> Obama, in a major speech on his counterterrorism policy, said Holder had<br> agreed to review Justice Department guidelines governing investigations<br> that involve journalists.</br></br></br></br></p></blockquote><p>Eric Holder’s ability to protect Obama <a href=\"http://openchannel.nbcnews.com/_news/2013/05/23/18451142-holder-okd-search-warrant-for-fox-news-reporters-private-emails-official-says?lite\">has just been compromised</a>.  Not necessarily destroyed, but compromised. Even the Obama defenders in the media are going to be nervous about permitting this sort of precedent, knowing it can be used against them.</p></div>",
  "content_text": "The dam is cracking:\nAttorney General Eric Holder signed off on a controversial search\nwarrant that identified Fox News reporter James Rosen as a “possible\nco-conspirator” in violations of the Espionage Act and authorized\nseizure of his private emails, a law enforcement official told NBC News\non Thursday.\nThe\ndisclosure of the attorney general’s role came as President Barack\nObama, in a major speech on his counterterrorism policy, said Holder had\nagreed to review Justice Department guidelines governing investigations\nthat involve journalists.\nEric Holder’s ability to protect Obama\nhas just been compromised\n.  Not necessarily destroyed, but compromised. Even the Obama defenders in the media are going to be nervous about permitting this sort of precedent, knowing it can be used against them.",
  "tags": [
    "law",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-24T06:05:00+00:00"
}