{
  "url": "https://voxday.net/2013/05/21/another-step-closer/",
  "scraped_at": "2025-12-14T22:29:32.773029",
  "title": "Another step closer",
  "date_display": "May 21, 2013",
  "date_iso": "2013-05-21T06:18:00+00:00",
  "date_from_url": "2013-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.politico.com/story/2013/05/the-white-houses-shifting-irs-account-91638.html\">There is evidence</a> connecting the White House to the IRS investigations after all.  But no proof that Obama knew about it or ordered it… yet:</p><blockquote class=\"tr_bq\"><p> The White House on Monday once again added to the list of people who<br> knew about the IRS investigation into its targeting of conservative<br> groups — saying White House chief of staff Denis McDonough had been<br> informed about a month ago.</br></br></br></p><p>Press secretary Jay Carney said again<br> that no one had told President Barack Obama ahead of the first news<br> reports: not his top aide McDonough, nor his chief counsel Kathy<br> Ruemmler, nor anyone from the Treasury Department.</br></br></br></p><div class=\"story-embed\"></div><div id=\"continue\"> Monday’s revelation amounts to the fifth iteration of<br> the Obama administration’s account of events, after initially saying<br> that the White House had first learned of the controversy from the<br> press.</br></br></br></div></blockquote><p>And the scandal grows….</p></div>",
  "content_text": "There is evidence\nconnecting the White House to the IRS investigations after all.  But no proof that Obama knew about it or ordered it… yet:\nThe White House on Monday once again added to the list of people who\nknew about the IRS investigation into its targeting of conservative\ngroups — saying White House chief of staff Denis McDonough had been\ninformed about a month ago.\nPress secretary Jay Carney said again\nthat no one had told President Barack Obama ahead of the first news\nreports: not his top aide McDonough, nor his chief counsel Kathy\nRuemmler, nor anyone from the Treasury Department.\nMonday’s revelation amounts to the fifth iteration of\nthe Obama administration’s account of events, after initially saying\nthat the White House had first learned of the controversy from the\npress.\nAnd the scandal grows….",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-21T05:18:00+00:00"
}