{
  "url": "https://voxday.net/2013/05/22/covering-up-false-flag/",
  "scraped_at": "2025-12-14T22:29:41.945068",
  "title": "Covering up the false flag",
  "date_display": "May 22, 2013",
  "date_iso": "2013-05-22T17:00:00+00:00",
  "date_from_url": "2013-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>State officials are secretly attempting <a href=\"http://www.courant.com/news/connecticut/hc-newtown-foi-0522-20130521,0,2316671.story\">to bury the public records</a> related to the Sandy Hook “shootings”:</p><blockquote class=\"tr_bq\"><p> The staffs of the state’s top prosecutor and the governor’s office have been working in secret with General Assembly leaders on legislation to withhold records related to the police investigation into the Dec. 14 Newtown elementary school massacre — including victims’ photos, tapes of 911 calls, and possibly more.</p><p>The behind-the-scenes legislative effort came to light Tuesday when The Courant obtained a copy of an email by a top assistant to Chief State’s Attorney Kevin Kane, Timothy J. Sugrue. Sugrue, an assistant state’s attorney, discussed options considered so far, including blocking release of statements “made by a minor.”</p><p>“There is complete agreement regarding photos etc., and audio tapes, although the act may allow the disclosure of audio transcripts,” Sugrue wrote to Kane, two other Kane subordinates and to Danbury State’s Attorney Stephen Sedensky, who is directing the investigation of the killings….</p><p>As envisioned by Kane, the bill wouldn’t be limited to the Newtown file.<br> “We are seeking legislation to protect crime scene photographs<br> protecting victims and certain 911 tapes,” Kane told The Courant<br> Tuesday. “It is something that I have been concerned about for years and<br> years and the situation in Newtown brings it to a head. I don’t want<br> family members seeing pictures of their loved ones publicized in a<br> manner in which these are subject to be published.”</br></br></br></br></br></br></p><p>He said as he sees the legislation, it would apply to “basically<br> crime scene photographs depicting injuries to victims and recordings,<br> 911 recordings displaying the mental anguish of victims. Things like<br> that, of that category. And it seems to me that the intrusion of the<br> privacy of the individuals outweighs any public interest in seeing<br> these.”</br></br></br></br></br></p></blockquote><p>No doubt anyone who is familiar with the government’s interest in “the privacy of individuals” will find this justification as ludicrous as I do.  One wonders what sparked the sudden need for this secretive legislative effort; did someone notice the forgotten Heinz bottle lying next to the “corpses” or was it the datestamp on the pictures taken three weeks before the scheduled event?</p></div>",
  "content_text": "State officials are secretly attempting\nto bury the public records\nrelated to the Sandy Hook “shootings”:\nThe staffs of the state’s top prosecutor and the governor’s office have been working in secret with General Assembly leaders on legislation to withhold records related to the police investigation into the Dec. 14 Newtown elementary school massacre — including victims’ photos, tapes of 911 calls, and possibly more.\nThe behind-the-scenes legislative effort came to light Tuesday when The Courant obtained a copy of an email by a top assistant to Chief State’s Attorney Kevin Kane, Timothy J. Sugrue. Sugrue, an assistant state’s attorney, discussed options considered so far, including blocking release of statements “made by a minor.”\n“There is complete agreement regarding photos etc., and audio tapes, although the act may allow the disclosure of audio transcripts,” Sugrue wrote to Kane, two other Kane subordinates and to Danbury State’s Attorney Stephen Sedensky, who is directing the investigation of the killings….\nAs envisioned by Kane, the bill wouldn’t be limited to the Newtown file.\n“We are seeking legislation to protect crime scene photographs\nprotecting victims and certain 911 tapes,” Kane told The Courant\nTuesday. “It is something that I have been concerned about for years and\nyears and the situation in Newtown brings it to a head. I don’t want\nfamily members seeing pictures of their loved ones publicized in a\nmanner in which these are subject to be published.”\nHe said as he sees the legislation, it would apply to “basically\ncrime scene photographs depicting injuries to victims and recordings,\n911 recordings displaying the mental anguish of victims. Things like\nthat, of that category. And it seems to me that the intrusion of the\nprivacy of the individuals outweighs any public interest in seeing\nthese.”\nNo doubt anyone who is familiar with the government’s interest in “the privacy of individuals” will find this justification as ludicrous as I do.  One wonders what sparked the sudden need for this secretive legislative effort; did someone notice the forgotten Heinz bottle lying next to the “corpses” or was it the datestamp on the pictures taken three weeks before the scheduled event?",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-22T16:00:00+00:00"
}