{
  "url": "https://voxday.net/2013/05/26/diversity-in-sweden-sixth-nig/",
  "scraped_at": "2025-12-14T22:30:03.254106",
  "title": "Diversity in Sweden: Sixth Night",
  "date_display": "May 26, 2013",
  "date_iso": "2013-05-26T17:00:00+00:00",
  "date_from_url": "2013-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently the real Swedes are <a href=\"http://www.cnbc.com/id/100766561\">getting tired of the violent antics</a> of the paper ones:</p><blockquote class=\"tr_bq\"><p> Rioting spread to several Swedish towns on Friday night as police<br> stepped up arrests during a sixth night of unrest and far-right<br> vigilantes chased non-whites in southern Stockholm. In Linköping,<br> central southern Sweden, police responded to 120 incidents as cars,<br> caravans and two schools were set alight. At one point a blazing truck<br> was rolled into a building, which caught fire.</br></br></br></br></br></p><p>In Orebro, 120km west of Stockholm, police were stoned after cars and a<br> school were torched. In Uppsalla, north of Stockholm, there was minor<br> violence.</br></br></p></blockquote><p>At this point, it should be obvious that my prediction of Anders Breivik being a harbinger of things to come was, at the very least, considerably less outlandish than many believed it to be at the time.  Nor are we seeing any sort of backlash in the form of more political support for the multicultural parties across Europe.</p><p>And if the police are stupid enough <a href=\"http://www.thegatewaypundit.com/2013/05/swedish-citizens-take-to-streets-to-defend-property-from-rioting-immigrants/?ModPagespeed=noscript\">to play quisling and take the side of the immigrants</a>, as they apparently are doing in Stockholm, then they’ll have to go too:</p><blockquote class=\"tr_bq\"><p> The number of police officers on the streets is simply staggering. The police appear to have focused all their resources on stopping the Swedes, Fredrik Becklin, spokesman for the nationalist youth organization Nordisk Ungdom (Nordic Youth), said Friday night. “It makes me sick to see the police clamp down on us Swedes with full force and without warning, using nightsticks and tear gas, while they don’t do a damn thing about the immigrants. We are only trying to help maintain order, while the immigrants set cars and buildings on fire,” said a young man who wished to remain anonymous.</p></blockquote></div>",
  "content_text": "Apparently the real Swedes are\ngetting tired of the violent antics\nof the paper ones:\nRioting spread to several Swedish towns on Friday night as police\nstepped up arrests during a sixth night of unrest and far-right\nvigilantes chased non-whites in southern Stockholm. In Linköping,\ncentral southern Sweden, police responded to 120 incidents as cars,\ncaravans and two schools were set alight. At one point a blazing truck\nwas rolled into a building, which caught fire.\nIn Orebro, 120km west of Stockholm, police were stoned after cars and a\nschool were torched. In Uppsalla, north of Stockholm, there was minor\nviolence.\nAt this point, it should be obvious that my prediction of Anders Breivik being a harbinger of things to come was, at the very least, considerably less outlandish than many believed it to be at the time.  Nor are we seeing any sort of backlash in the form of more political support for the multicultural parties across Europe.\nAnd if the police are stupid enough\nto play quisling and take the side of the immigrants\n, as they apparently are doing in Stockholm, then they’ll have to go too:\nThe number of police officers on the streets is simply staggering. The police appear to have focused all their resources on stopping the Swedes, Fredrik Becklin, spokesman for the nationalist youth organization Nordisk Ungdom (Nordic Youth), said Friday night. “It makes me sick to see the police clamp down on us Swedes with full force and without warning, using nightsticks and tear gas, while they don’t do a damn thing about the immigrants. We are only trying to help maintain order, while the immigrants set cars and buildings on fire,” said a young man who wished to remain anonymous.",
  "tags": [
    "EU",
    "NWA was right",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-26T16:00:00+00:00"
}