{
  "url": "https://voxday.net/2013/05/23/diversity-in-london/",
  "scraped_at": "2025-12-14T22:29:43.779874",
  "title": "Diversity in London",
  "date_display": "May 23, 2013",
  "date_iso": "2013-05-23T07:45:00+00:00",
  "date_from_url": "2013-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Piper’s Diversity Gospel demonstrably isn’t any more of God than<br> his Jesus tornadoes are.  The Diversity Gospel brings death and<br> devastation in its wake; it is the modern version of the Tower of<br> Babylon. Its fruits are undeniable; the advocates of the Diversity Gospel have much for which to answer.  They have blood on their tongues, including the death of the English soldier <a href=\"http://www.dailymail.co.uk/news/article-2329162/Woolwich-latest-Shocked-eyewitness-tells-horrific-machete-attack-soldier.html\">butchered by Africans in broad daylight</a> yesterday:</br></br></br></p><blockquote class=\"tr_bq\"><p> Another eyewitness revealed how he watched the two attackers behave like ‘crazed animals’. The man, known only as James, said he and his partner saw two black men attack a young man aged around 20 in a Help for Heroes T-shirt in Woolwich, south-east London, like he was ‘a piece of meat’.</p><p>Fighting back tears, he told LBC Radio: ‘They were hacking at this poor guy, literally. They were chopping him, cutting him. These two guys were crazed. They were just animals. They dragged him from the pavement, dumped his body in the middle of the road and left (it) there.’</p><p>He said that after the ‘horrendous’ attack, the two men, in their 20s, stood around, waving knives and a gun, even asking people nearby to take pictures of them ‘as if they wanted to be on TV’.</p><p>‘They were oblivious to anything, they were more worried about having their photo taken, running up and down the road,’ he said. ‘They had no intention of running off or leaving or anything.’</p></blockquote><p>And the blood of the diverse and vibrant they welcomed will soon be on their tongues as well.  Rivers of it. It won’t be long before the Saxon starts killing, and when he does, he won’t be doing it one vibrant at a time. Consider the following sub-headline: “Masked English Defence League supporters flood Woolwich: Far-Right clash with police near scene of killing”</p><p>It brings Kipling to mind.</p><p><i>“The Saxon is not like us Normans, His manners are not so polite. <br>But he never means anything serious till he talks about justice and right. <br>When he stands like an ox in the furrow with his sullen set eyes on your own, <br>And grumbles, “This isn’t fair dealings,” my son, leave the Saxon alone. </br></br></br></i></p><p><i> “You can horsewhip your Gascony archers, or torture your Picardy spears,<br>But don’t try that game on the Saxon; you’ll have the whole brood round your ears. <br>From the richest old Thane in the county to the poorest chained serf in the field, <br>They’ll be at you and on you like hornets, and, if you are wise, you will yield.” </br></br></br></i></p></div>",
  "content_text": "John Piper’s Diversity Gospel demonstrably isn’t any more of God than\nhis Jesus tornadoes are.  The Diversity Gospel brings death and\ndevastation in its wake; it is the modern version of the Tower of\nBabylon. Its fruits are undeniable; the advocates of the Diversity Gospel have much for which to answer.  They have blood on their tongues, including the death of the English soldier\nbutchered by Africans in broad daylight\nyesterday:\nAnother eyewitness revealed how he watched the two attackers behave like ‘crazed animals’. The man, known only as James, said he and his partner saw two black men attack a young man aged around 20 in a Help for Heroes T-shirt in Woolwich, south-east London, like he was ‘a piece of meat’.\nFighting back tears, he told LBC Radio: ‘They were hacking at this poor guy, literally. They were chopping him, cutting him. These two guys were crazed. They were just animals. They dragged him from the pavement, dumped his body in the middle of the road and left (it) there.’\nHe said that after the ‘horrendous’ attack, the two men, in their 20s, stood around, waving knives and a gun, even asking people nearby to take pictures of them ‘as if they wanted to be on TV’.\n‘They were oblivious to anything, they were more worried about having their photo taken, running up and down the road,’ he said. ‘They had no intention of running off or leaving or anything.’\nAnd the blood of the diverse and vibrant they welcomed will soon be on their tongues as well.  Rivers of it. It won’t be long before the Saxon starts killing, and when he does, he won’t be doing it one vibrant at a time. Consider the following sub-headline: “Masked English Defence League supporters flood Woolwich: Far-Right clash with police near scene of killing”\nIt brings Kipling to mind.\n“The Saxon is not like us Normans, His manners are not so polite.\nBut he never means anything serious till he talks about justice and right.\nWhen he stands like an ox in the furrow with his sullen set eyes on your own,\nAnd grumbles, “This isn’t fair dealings,” my son, leave the Saxon alone.\n“You can horsewhip your Gascony archers, or torture your Picardy spears,\nBut don’t try that game on the Saxon; you’ll have the whole brood round your ears.\nFrom the richest old Thane in the county to the poorest chained serf in the field,\nThey’ll be at you and on you like hornets, and, if you are wise, you will yield.”",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-23T06:45:00+00:00"
}