{
  "url": "https://voxday.net/2013/05/20/dont-blame-jenny-mccarthy/",
  "scraped_at": "2025-12-14T22:29:30.953686",
  "title": "Don’t blame Jenny McCarthy",
  "date_display": "May 20, 2013",
  "date_iso": "2013-05-20T21:41:00+00:00",
  "date_from_url": "2013-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not the unvaccinated causing the increase in the incidence of whooping cough, <a href=\"http://news.sciencemag.org/sciencenow/2013/05/uptick-in-whooping-cough-linked-.html?ref=hp\">it’s the vaccines</a>:</p><blockquote class=\"tr_bq\"><p> Whooping cough, or pertussis, has exploded in the United States in<br> recent years. A new study confirms what scientists have suspected for<br> some time: The<br> return of the disease is caused by the introduction of new, safer<br> vaccines 2 decades ago. Although they have far fewer side effects, the<br> new shots don’t<br> offer long-lived protection the way older vaccines do….</br></br></br></br></br></br></p><p>Researchers have long suspected that new vaccines might have something<br> to do with it. Until the 1990s, children routinely received a so-called<br> whole-cell<br> vaccine, made from pertussis bacteria, <em>Bordetella </em><em>pertussis</em>,<br> that were killed by exposure to formalin or other chemicals. These<br> vaccines were known to contain a toxin that can provoke powerful<br> side effects. Most vaccinated infants had fever and severe pain at the<br> injection site,<br> sometimes accompanied by febrile seizures or fainting fits in which<br> the infant turned pale, unresponsive, and “floppy.” </br></br></br></br></br></br></br></br></br></p></blockquote><p>Strange that while researchers “have long suspected” the new vaccines, the vaccine advocates writing in the media have constantly pointed at Hollywood actresses and vaccine skeptics.</p></div>",
  "content_text": "It’s not the unvaccinated causing the increase in the incidence of whooping cough,\nit’s the vaccines\n:\nWhooping cough, or pertussis, has exploded in the United States in\nrecent years. A new study confirms what scientists have suspected for\nsome time: The\nreturn of the disease is caused by the introduction of new, safer\nvaccines 2 decades ago. Although they have far fewer side effects, the\nnew shots don’t\noffer long-lived protection the way older vaccines do….\nResearchers have long suspected that new vaccines might have something\nto do with it. Until the 1990s, children routinely received a so-called\nwhole-cell\nvaccine, made from pertussis bacteria,\nBordetella\npertussis\n,\nthat were killed by exposure to formalin or other chemicals. These\nvaccines were known to contain a toxin that can provoke powerful\nside effects. Most vaccinated infants had fever and severe pain at the\ninjection site,\nsometimes accompanied by febrile seizures or fainting fits in which\nthe infant turned pale, unresponsive, and “floppy.”\nStrange that while researchers “have long suspected” the new vaccines, the vaccine advocates writing in the media have constantly pointed at Hollywood actresses and vaccine skeptics.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-20T20:41:00+00:00"
}