{
  "url": "https://voxday.net/2013/05/06/fred-reed-decides-on-apple/",
  "scraped_at": "2025-12-14T22:28:07.733996",
  "title": "Fred Reed bites the Apple",
  "date_display": "May 6, 2013",
  "date_iso": "2013-05-06T13:00:00+00:00",
  "date_from_url": "2013-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>His thought processes <a href=\"http://www.fredoneverything.net/Apple.shtml\">concerning his next computer</a> are entertaining, if not, in my opinion, even remotely convincing:</p><blockquote class=\"tr_bq\"><p> I had no particular feelings about the Mac, for or against. I knew<br> that people who had them also had a peculiar emotional attachment to<br> them. It  worried me, about the people, not the computer. I mean, a<br> carpenter doesn’t  bond with his claw hammer. A friend once described<br> the MacIntosh as “a fashion  accessory for the conforming<br> nonconformist.” Well, yeah. On the other hand, Mac-heads  were usually<br> well on the bright side.</br></br></br></br></br></br></p><p>I was not  interested in abnormal psychology, but in<br> computers, so I resolved to ask  practical-minded friends, not<br> Mac-heards, about these fructiform machines. Actual Mac-users had  the<br> chill objectivity I associate with Salafi terrorists. I started with a<br> buddy who does networking and data-base manage for medium-sized<br> companies. I  knew he had a MacBook Pro. Did he like it?</br></br></br></br></br></p><p>He said, “It’s  cute, well-designed, and I’d buy another one,<br> but when I have work to do, I  need a PC.” Ah. Why? “Because the<br> network analysis software I need doesn’t  exist for the Mac, and their<br> data-base and spread-sheet applications are toys.”</br></br></br></p><p>Hmmm. I didn’t  want to analyze networks or fiddle with data<br> bases, which left “cute and  well-designed.” Nothing wrong with that….</br></p><p>Meanwhile, I  talked to a few more of the Salafi terrorists. It<br> didn’t help. If you want  intelligent thoughts regarding the Mac, it is<br> better to talk to people who don’t  have one. Attempts to probe the<br> consciousness of Mac-heads usually went like  this:  Mac-head: “Mac  is better.” Me: OK, how is it better? “It<br> just is.” Ah, I see. How is it just  is? “It’s easier to use.” How is it<br> easier to use? “It just is.” “How is it  just is?” Round and round the<br> mulberry bush.</br></br></br></br></br></br></p><p>They said  things like “The Mac’s hardware is better than the<br> PC´s.” At this point I  realized that most Apple cultists didn’t know<br> much about computers. For  example, they didn’t understand that the<br> Macintosh is a product, while PC is a  specification. Only Apple can<br> make a Mac. Anybody can make a PC. Thus on one hand  you have<br> manufacturers on a level with back-alley abortionists who use cheap<br> power supplies that smoke like the audience at a Grateful Dead concert,<br> and  hard drives with a Mean Time Between Failure of five minutes or<br> until next  Wednesday, whichever comes first. On the other hand, you<br> have solidly built PCs  such as Delll’s Latitudes, serious boxes aimed<br> at businessmen.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Give him six months and he’ll either be parroting the very cultists he mocked, or, like Spacebunny and a few others of my acquaintance, he’ll regard his brief period of Macintosh ownership as being the techno-analog of surviving cancer or a stint in a concentration camp.  But Fred is right in discerning that there is no one correct and objective answer, because it completely depends upon what one’s individual requirements and preferences are.</p><p>None of this should be in any way taken for a defense, much less endorsement, of Windows 8, you understand.</p></div>",
  "content_text": "His thought processes\nconcerning his next computer\nare entertaining, if not, in my opinion, even remotely convincing:\nI had no particular feelings about the Mac, for or against. I knew\nthat people who had them also had a peculiar emotional attachment to\nthem. It  worried me, about the people, not the computer. I mean, a\ncarpenter doesn’t  bond with his claw hammer. A friend once described\nthe MacIntosh as “a fashion  accessory for the conforming\nnonconformist.” Well, yeah. On the other hand, Mac-heads  were usually\nwell on the bright side.\nI was not  interested in abnormal psychology, but in\ncomputers, so I resolved to ask  practical-minded friends, not\nMac-heards, about these fructiform machines. Actual Mac-users had  the\nchill objectivity I associate with Salafi terrorists. I started with a\nbuddy who does networking and data-base manage for medium-sized\ncompanies. I  knew he had a MacBook Pro. Did he like it?\nHe said, “It’s  cute, well-designed, and I’d buy another one,\nbut when I have work to do, I  need a PC.” Ah. Why? “Because the\nnetwork analysis software I need doesn’t  exist for the Mac, and their\ndata-base and spread-sheet applications are toys.”\nHmmm. I didn’t  want to analyze networks or fiddle with data\nbases, which left “cute and  well-designed.” Nothing wrong with that….\nMeanwhile, I  talked to a few more of the Salafi terrorists. It\ndidn’t help. If you want  intelligent thoughts regarding the Mac, it is\nbetter to talk to people who don’t  have one. Attempts to probe the\nconsciousness of Mac-heads usually went like  this:  Mac-head: “Mac  is better.” Me: OK, how is it better? “It\njust is.” Ah, I see. How is it just  is? “It’s easier to use.” How is it\neasier to use? “It just is.” “How is it  just is?” Round and round the\nmulberry bush.\nThey said  things like “The Mac’s hardware is better than the\nPC´s.” At this point I  realized that most Apple cultists didn’t know\nmuch about computers. For  example, they didn’t understand that the\nMacintosh is a product, while PC is a  specification. Only Apple can\nmake a Mac. Anybody can make a PC. Thus on one hand  you have\nmanufacturers on a level with back-alley abortionists who use cheap\npower supplies that smoke like the audience at a Grateful Dead concert,\nand  hard drives with a Mean Time Between Failure of five minutes or\nuntil next  Wednesday, whichever comes first. On the other hand, you\nhave solidly built PCs  such as Delll’s Latitudes, serious boxes aimed\nat businessmen.\nGive him six months and he’ll either be parroting the very cultists he mocked, or, like Spacebunny and a few others of my acquaintance, he’ll regard his brief period of Macintosh ownership as being the techno-analog of surviving cancer or a stint in a concentration camp.  But Fred is right in discerning that there is no one correct and objective answer, because it completely depends upon what one’s individual requirements and preferences are.\nNone of this should be in any way taken for a defense, much less endorsement, of Windows 8, you understand.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-06T12:00:00+00:00"
}