{
  "url": "https://voxday.net/2013/05/21/goldman-sachs-opposes-uk-independence/",
  "scraped_at": "2025-12-14T22:29:34.618794",
  "title": "Goldman Sachs opposes UK independence",
  "date_display": "May 21, 2013",
  "date_iso": "2013-05-21T13:00:00+00:00",
  "date_from_url": "2013-05-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In related news, Rapey McRaperson announced that he is opposed to women carrying handguns and pepper spray, saying that it would be a <a href=\"http://www.telegraph.co.uk/finance/economics/10069872/UK-exit-from-EU-would-be-lossloss-scenario-warns-Goldman-Sachs.html\">“loss/loss scenario”</a>:</p><blockquote class=\"tr_bq\"><div class=\"firstPar\"> Kevin Daly, part of the investment bank’s economic team, has concluded that a<br> British departure from the EU would result in a “loss/loss scenario” in<br> which both the UK and the rest of the bloc would be damaged.</br></br></div><div class=\"secondPar\"> But in a note to investors, Mr Daly added that Goldman does not expect an<br> in/out referendum because the Tories first need to win an outright majority<br> and, the bank reckons, “at this stage, this doesn’t appear likely”.</br></br></div><div class=\"thirdPar\"> Mr Daly said a UK exit would “come with a significant economic cost to the UK”<br> because it is “highly integrated” with the EU. The economist noted that<br> trade with the other 26 members of the EU accounts for 16pc of UK GDP.</br></br></div><p>He dismissed those who argue that Britain could negotiate a trade deal with<br> the EU once it had left. “Given the size and importance of the UK economy,<br> it is unlikely that the UK could negotiate the same access to the EU single<br> market that Switzerland and Norway have achieved,” he said.</br></br></br></p></blockquote><p>Goldman isn’t even trying to make sense of its pro-EU position here.  Britain not only sends billions of pounds into the Brussels sinkhole every year, but has nonsensical and tremendously wasteful regulatory regimes imposed upon it, to say nothing of millions of unwanted economic migrants.  And when has being bigger and more important ever made it HARDER for a nation to pursue what it wants in negotiation?</p></div>",
  "content_text": "In related news, Rapey McRaperson announced that he is opposed to women carrying handguns and pepper spray, saying that it would be a\n“loss/loss scenario”\n:\nKevin Daly, part of the investment bank’s economic team, has concluded that a\nBritish departure from the EU would result in a “loss/loss scenario” in\nwhich both the UK and the rest of the bloc would be damaged.\nBut in a note to investors, Mr Daly added that Goldman does not expect an\nin/out referendum because the Tories first need to win an outright majority\nand, the bank reckons, “at this stage, this doesn’t appear likely”.\nMr Daly said a UK exit would “come with a significant economic cost to the UK”\nbecause it is “highly integrated” with the EU. The economist noted that\ntrade with the other 26 members of the EU accounts for 16pc of UK GDP.\nHe dismissed those who argue that Britain could negotiate a trade deal with\nthe EU once it had left. “Given the size and importance of the UK economy,\nit is unlikely that the UK could negotiate the same access to the EU single\nmarket that Switzerland and Norway have achieved,” he said.\nGoldman isn’t even trying to make sense of its pro-EU position here.  Britain not only sends billions of pounds into the Brussels sinkhole every year, but has nonsensical and tremendously wasteful regulatory regimes imposed upon it, to say nothing of millions of unwanted economic migrants.  And when has being bigger and more important ever made it HARDER for a nation to pursue what it wants in negotiation?",
  "tags": [
    "economics",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-21T12:00:00+00:00"
}