{
  "url": "https://voxday.net/2013/05/07/halfway-to-reality/",
  "scraped_at": "2025-12-14T22:28:17.536585",
  "title": "Halfway to reality",
  "date_display": "May 7, 2013",
  "date_iso": "2013-05-07T17:08:00+00:00",
  "date_from_url": "2013-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Emily Asher-Perrin fails to think the matter <a href=\"http://www.tor.com/blogs/2013/05/boob-plate-armor-would-kill-you\">all the way through</a>:</p><blockquote class=\"tr_bq\"><p> Never mind the chainmail bikinis—what about those awkward breast plates<br> in armor that we see frequently in fantasy artwork and at the Ren Faire?<br> Whenever women complain about this convention, they are usually shot<br> down for trying to erase women’s true bodies, for insisting that women<br> make themselves more “male” in order to appear strong and capable…. Let’s begin by stating the simple purpose of plate armor—to deflect<br> blows from weaponry. Assuming that you are avoiding the blow of a sword,<br> your armor should be designed so that the blade glances off your body,<br> away from your chest. If your armor is breast-shaped, you are in fact<br> increasing the likelihood that a blade blow will slide inward, toward<br> the center of your chest, the very place you are trying to keep safe.</br></br></br></br></br></br></br></br></br></p><p>But that’s not all! Let’s say you even fall onto your boob-conscious<br> armor. The divet separating each breast will dig into your chest, doing<br> you injury. It might even break your breastbone. With a strong enough<br> blow to the chest, it could fracture your sternum entirely, destroying<br> your heart and lungs, instantly killing you. It is literally a death<br> trap—you are wearing armor that acts as a perpetual spear directed at<br> some of your most vulnerable body parts. It’s just not smart.</br></br></br></br></br></br></p><p> That’s not to say that female armor cannot be shaped differently—in fact, it should be to account for differences in shoulder-to-waist ratios and more, as the military recently discovered. Some films decide to provide women with a shelf of sorts in the chest region and that choice, if well-designed, can be flattering as well as functional. But it still isn’t logical or necessary by a longshot.</p><p>So if you want to wear some sculpted armor to the Ren Faire because you feel fabulous-looking in it, go forth and have fun! But if you’re drawing lady soldiers, or creating female characters who are depicted as actual warriors, please err on the side of reality when designing their armor. Science says your boob plates are killing the women you hoped they would protect.</p></blockquote><p>Of course, if we’re going to start bringing reality into swords and sorcery, we should probably also take into consideration the fact that even a large, well-trained woman couldn’t last thirty seconds against the average warrior.  The correct and realistic portrayal of an armor-era woman is either one who is dead and buried after her brief foray into warrior womanhood or at home, caring for the children that she started bearing in her teens.</p><p>Awkward and combat-inefficient breast plates are the least of the problem. What it is time to retire is the absurd and ahistorical “warrior woman”.</p><p>The amusing thing is that throughout the comments, no one even stops to realize that the entire premise of women attempting to fight with swords is physically ridiculous.  If you doubt me, just hand a sword to the closest woman the next time you’re in a medieval museum.</p></div>",
  "content_text": "Emily Asher-Perrin fails to think the matter\nall the way through\n:\nNever mind the chainmail bikinis—what about those awkward breast plates\nin armor that we see frequently in fantasy artwork and at the Ren Faire?\nWhenever women complain about this convention, they are usually shot\ndown for trying to erase women’s true bodies, for insisting that women\nmake themselves more “male” in order to appear strong and capable…. Let’s begin by stating the simple purpose of plate armor—to deflect\nblows from weaponry. Assuming that you are avoiding the blow of a sword,\nyour armor should be designed so that the blade glances off your body,\naway from your chest. If your armor is breast-shaped, you are in fact\nincreasing the likelihood that a blade blow will slide inward, toward\nthe center of your chest, the very place you are trying to keep safe.\nBut that’s not all! Let’s say you even fall onto your boob-conscious\narmor. The divet separating each breast will dig into your chest, doing\nyou injury. It might even break your breastbone. With a strong enough\nblow to the chest, it could fracture your sternum entirely, destroying\nyour heart and lungs, instantly killing you. It is literally a death\ntrap—you are wearing armor that acts as a perpetual spear directed at\nsome of your most vulnerable body parts. It’s just not smart.\nThat’s not to say that female armor cannot be shaped differently—in fact, it should be to account for differences in shoulder-to-waist ratios and more, as the military recently discovered. Some films decide to provide women with a shelf of sorts in the chest region and that choice, if well-designed, can be flattering as well as functional. But it still isn’t logical or necessary by a longshot.\nSo if you want to wear some sculpted armor to the Ren Faire because you feel fabulous-looking in it, go forth and have fun! But if you’re drawing lady soldiers, or creating female characters who are depicted as actual warriors, please err on the side of reality when designing their armor. Science says your boob plates are killing the women you hoped they would protect.\nOf course, if we’re going to start bringing reality into swords and sorcery, we should probably also take into consideration the fact that even a large, well-trained woman couldn’t last thirty seconds against the average warrior.  The correct and realistic portrayal of an armor-era woman is either one who is dead and buried after her brief foray into warrior womanhood or at home, caring for the children that she started bearing in her teens.\nAwkward and combat-inefficient breast plates are the least of the problem. What it is time to retire is the absurd and ahistorical “warrior woman”.\nThe amusing thing is that throughout the comments, no one even stops to realize that the entire premise of women attempting to fight with swords is physically ridiculous.  If you doubt me, just hand a sword to the closest woman the next time you’re in a medieval museum.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-07T16:08:00+00:00"
}