{
  "url": "https://voxday.net/2013/05/12/health-evaders-and-b-ark/",
  "scraped_at": "2025-12-14T22:28:45.895281",
  "title": "Health evaders and the B Ark",
  "date_display": "May 12, 2013",
  "date_iso": "2013-05-12T21:15:00+00:00",
  "date_from_url": "2013-05-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wonder what they’re going to call the millions of Americans <a href=\"http://www.atr.org/obamacare-taxpayers-must-report-personal-health-a7611\">who refuse to turn over their health information</a> to the IRS next year?  Health evaders?  Health protesters?</p><blockquote class=\"tr_bq\"><p> When Obamacare’s individual mandate takes effect in 2014, all Americans<br> who file income tax returns must complete an additional IRS tax form. The new form will require disclosure of a taxpayer’s personal identifying health information in order to determine compliance with the Affordable Care Act’s individual mandate. As confirmed by IRS testimony to the tax-writing House Committee on Ways and Means, “taxpayers will file their tax returns reporting their health insurance coverage, and/or making a payment”.</br></p></blockquote><p>Whatever they call them, I tend to imagine there are going to be a fair amount of them.  Honestly, I don’t see how this whole creaky system is going to survive much longer.  History shows that there is a lot of ruin in a nation, but at this rate, the entire business activity of the USA is soon going to be computers trading stocks with other computers and people filling out forms for the IRS and other government agencies.</p><p>Welcome to the B Ark economy.</p></div>",
  "content_text": "I wonder what they’re going to call the millions of Americans\nwho refuse to turn over their health information\nto the IRS next year?  Health evaders?  Health protesters?\nWhen Obamacare’s individual mandate takes effect in 2014, all Americans\nwho file income tax returns must complete an additional IRS tax form. The new form will require disclosure of a taxpayer’s personal identifying health information in order to determine compliance with the Affordable Care Act’s individual mandate. As confirmed by IRS testimony to the tax-writing House Committee on Ways and Means, “taxpayers will file their tax returns reporting their health insurance coverage, and/or making a payment”.\nWhatever they call them, I tend to imagine there are going to be a fair amount of them.  Honestly, I don’t see how this whole creaky system is going to survive much longer.  History shows that there is a lot of ruin in a nation, but at this rate, the entire business activity of the USA is soon going to be computers trading stocks with other computers and people filling out forms for the IRS and other government agencies.\nWelcome to the B Ark economy.",
  "tags": [
    "law",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-12T20:15:00+00:00"
}