{
  "url": "https://voxday.net/2013/05/31/intelligence-and-reaction-times/",
  "scraped_at": "2025-12-14T22:30:26.301184",
  "title": "Intelligence and reaction times",
  "date_display": "May 31, 2013",
  "date_iso": "2013-05-31T13:34:00+00:00",
  "date_from_url": "2013-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I tend to <a href=\"http://isteve.blogspot.com/2013/05/were-victorians-cleverer-than-us.html\">share Steve Sailer’s doubts</a> about Michael Woodley et al’s paper on how reaction times are slower now than when Galton first measured them:</p><blockquote class=\"tr_bq\"><p> <i>“It was an era of glorious scientific discovery. And the reason for the Victorians unprecedented success is simple – they were ‘substantially cleverer’ than us.  Researchers compared reaction times – a reliable indicator of general<br> intelligence – since the late 1800s to the present day and found our<br> fleetness of mind is diminishing. They claim our slowing reflexes suggest we are less smart than our<br> ancestors, with a loss of 1.23 IQ points per decade or 14 IQ points<br> since Victorian times. While an average man in 1889 had a reaction time of 183 milliseconds, this has slowed to 253ms in 2004. They found the same case with women, whose speed deteriorated from 188 to 261ms in the same period.” </br></br></br></br></i></p><p>Back in the 1990s, I read up on Arthur Jensen’s research on his reaction<br> time experiments, and … I don’t know. It seemed very, very<br> complicated, even more complicated than reading Jensen on IQ.</br></br></p><p>How about me? I’m a reasonably intelligent person. Do I have good reaction times? In general, I’d say no.</p></blockquote><p>I’m more than a bit dubious about this correlation between reaction time and intelligence myself.  While on the one hand, I am highly intelligent and have excellent reaction times – I’m a former NCAA D1 100m sprinter and can still outsprint most men 15 years younger –  on the other, I remember the sprinters against whom I ran.  Let’s just say many of them were not likely to be confused with rocket scientists.</p><p>Then again, I have no problem believing that the Victorian English were considerably brighter, on average, than the modern American.  A simple comparison of popular novels, then and now, should suffice to prove that.</p></div>",
  "content_text": "I tend to\nshare Steve Sailer’s doubts\nabout Michael Woodley et al’s paper on how reaction times are slower now than when Galton first measured them:\n“It was an era of glorious scientific discovery. And the reason for the Victorians unprecedented success is simple – they were ‘substantially cleverer’ than us.  Researchers compared reaction times – a reliable indicator of general\nintelligence – since the late 1800s to the present day and found our\nfleetness of mind is diminishing. They claim our slowing reflexes suggest we are less smart than our\nancestors, with a loss of 1.23 IQ points per decade or 14 IQ points\nsince Victorian times. While an average man in 1889 had a reaction time of 183 milliseconds, this has slowed to 253ms in 2004. They found the same case with women, whose speed deteriorated from 188 to 261ms in the same period.”\nBack in the 1990s, I read up on Arthur Jensen’s research on his reaction\ntime experiments, and … I don’t know. It seemed very, very\ncomplicated, even more complicated than reading Jensen on IQ.\nHow about me? I’m a reasonably intelligent person. Do I have good reaction times? In general, I’d say no.\nI’m more than a bit dubious about this correlation between reaction time and intelligence myself.  While on the one hand, I am highly intelligent and have excellent reaction times – I’m a former NCAA D1 100m sprinter and can still outsprint most men 15 years younger –  on the other, I remember the sprinters against whom I ran.  Let’s just say many of them were not likely to be confused with rocket scientists.\nThen again, I have no problem believing that the Victorian English were considerably brighter, on average, than the modern American.  A simple comparison of popular novels, then and now, should suffice to prove that.",
  "tags": [
    "science",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-31T12:34:00+00:00"
}