{
  "url": "https://voxday.net/2013/05/30/is-turnabout-not-fair-play/",
  "scraped_at": "2025-12-14T22:30:20.834662",
  "title": "Is turnabout not fair play?",
  "date_display": "May 30, 2013",
  "date_iso": "2013-05-30T09:23:00+00:00",
  "date_from_url": "2013-05-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Setting aside the absurd and provably unscientific attempt of many vaccine advocates to blame whooping cough deaths on vaccine critics, it is informative <a href=\"http://www.dailytelegraph.com.au/news/opinion/grieving-parents-speak-out-against-anti-vaccination-extremists/story-fni0cwl5-1226650422913\">to see the difference</a> in the way the media covers the death of a child killed by an infectious disease versus the way it covers the death of a child killed by a reaction to a vaccine:</p><blockquote class=\"tr_bq\"><p> On March 9, 2009, four-week-old Dana McCaffery’s heart stopped after whooping cough left her tiny lungs unable to breathe…. Little did they know then that Dana’s death from whooping cough, and the media coverage that followed, came to represent a very inconvenient truth to the anti-vaccination lobby – and thus began an extraordinary campaign against this grieving family.</p><p>The McCafferys are today breaking their silence on the cyber bullying,the anonymous letters and the cruelty of some members of the anti-vaccination movement.</p><p>The couple has been accused of being on the payroll of drug companies; they have had their daughter’s death questioned and mocked; they have even been told to “harden the f . . . up” by an opponent of vaccination.</p><p>“The venom directed at us has just been torture and it’s been frightening, abhorrent and insensitive in the extreme,” says Toni, who has not had the strength to talk about this until now.</p></blockquote><p>First, let’s do what the Australian Telegraph article failed to do and address the facts.  The child’s death from whooping cough was not likely the result of anti-vaccination campaigns or unvaccinated children.  The increased incidence of whooping cough in the United States, and therefore the death of Dana McCaffery, is primarily due to the reduced effectiveness of the current pertussis DTaP vaccine, which replaced the more effective, but less safe DTP vaccine in the 1990s.</p><p>As evidence, I <a href=\"http://news.sciencemag.org/sciencenow/2013/05/uptick-in-whooping-cough-linked-.html?ref=hp\">again cite Science magazine</a> to prove that the scientists, unlike the vaccine advocates, believe that it is the vaccines and not the anti-vaccination campaign that is responsible for what is described as “the return of the disease”.</p><blockquote class=\"tr_bq\"><p> Whooping cough, or pertussis, has exploded in the United States in recent years. A new study confirms what scientists have suspected for some time: The return of the disease is caused by the introduction of new, safer vaccines 2 decades ago. Although they have far fewer side effects, the new shots don’t offer long-lived protection the way older vaccines do.</p><p>Pertussis bacteria colonize the upper airways, causing a severe cough and shortness of breath that can be fatal in babies. The disease seemed to have mostly disappeared from the United States by the late 1970s—in fact, scientists believe, it continued to spread, undiagnosed, among adults—but over the past 2 decades the disease has bounced back with a vengeance, with strong outbreaks among school-aged children in 2010 and last year, when the United States reported 40,000 cases. Many European countries have also seen increases.</p><p>Researchers have long suspected that new vaccines might have something to do with it….  Physicians at Kaiser Permanente of Northern California compared the protective effects of these vaccines with the old ones when included in a four-dose series of shots called DTP (for diphtheria-tetanus-pertussis), given to children before the age of 2. They studied children born between 1994 and 1999, years in which Kaiser Permanente gradually introduced the new vaccines. As a result, some children had received only the old-style shots, some only the new ones, and some a mixture of both. Of the 1037 children included in the main part of the study, 138 got pertussis during a massive epidemic in California in 2010 to 2011.</p><p>Children who had received only the acellular vaccine were more than 5.6 times more likely to get sick than those who received the old, whole-cell vaccine, the team will report next month in Pediatrics. Those receiving one or more of each type had an intermediate risk.</p><p>The results confirm other recent research. In August, a study published in The Journal of the American Medical Association found that acellular vaccine-vaccinated children in Australia were six times more likely to get sick than those receiving the old vaccine. And a study of another California population, published online in March by Clinical Infectious Diseases, showed an eightfold increased risk of illness associated with the new vaccine.</p><p>“We’re now finding out that the acellular vaccine’s doesn’t offer protection for as long,” says the first author of the new study, pediatrician Nicola Klein. “It does work well in the short term. But there was definitely a tradeoff in phasing out the whole-cell vaccine.”</p></blockquote><p>Now, it is certainly impolitic to criticize, even by implication, grieving parents.  But that impolity and lack of respect for parental grief has been an aspect of the vaccine debate for years thanks to the vaccine advocates viciously attacking parents who have lost children to vaccine reactions.  Moreover, the media’s dishonest reaction to the McCaffery child’s death, including the linked Telegraph article, demonstrates that the vaccine critics were entirely correct to express their doubts about the child’s death and attempt to get more detailed information on it.</p><p>As the head of the Australian Vaccination Network stated: “To my mind, while an entire community of conscientious objectors<br> were being victimised by the government and the media and being blamed<br> for the death of a child who was too young to be vaccinated, I had every<br> right to ask for this information.”</br></br></br></p><p>The complaints of the mother, “they were just tearing apart everything we had just witnessed and lived through”, are totally misplaced.  She lost her right to private grief the moment that she permitted her child’s death to be used as pro-vaccine attack propaganda.</p><p>Every family, the McCafferys included, have the right to private grief so long as their grief remains private.  It does not have a right to use their grief as propaganda without expecting skepticism and criticism, much less to hide behind the emotional rhetoric of their child’s death to avoid legitimate, science-based criticism of their spurious attacks on vaccine skeptics.</p><p>And it is the height of hypocrisy for pro-vaccine advocates to object to the use of their very arguments against parents actively campaigning for vaccines:</p><blockquote class=\"tr_bq\"><p> Like the McCafferys, he went public to raise awareness about vaccination. In 2010 he did three television interviews and he left his phone number with each network for other parents to get in touch.  Soon after, he received a call from a woman who claimed she was from the AVN. He does not recall her name.</p><p>She accused him of doing the community a disservice, saying he should not be promoting immunisation.</p><p>“Then she went on saying my son was obviously weak and the weakest of the herd are not meant to survive, I should just get over it,” he says. Kokegei was gobsmacked. “I didn’t think someone could be that cold, to belittle what happened to my son in such a heartless way,” he says.</p></blockquote><p>And yet, is this not the very argument that pro-vaccine arguments implicitly make when they argue that it is worth permitting some children to die in the interest of herd immunity?  For every sob story the vaccine advocates have to offer, the anti-vaccine advocates can cite a dozen that are equally rhetorically effective.  And they will never be won over, because all the statistical studies in the world will never convince a parent who has seen, with his own eyes, an infant scream and slump unconscious in immediate reaction to a vaccine injection.</p></div>",
  "content_text": "Setting aside the absurd and provably unscientific attempt of many vaccine advocates to blame whooping cough deaths on vaccine critics, it is informative\nto see the difference\nin the way the media covers the death of a child killed by an infectious disease versus the way it covers the death of a child killed by a reaction to a vaccine:\nOn March 9, 2009, four-week-old Dana McCaffery’s heart stopped after whooping cough left her tiny lungs unable to breathe…. Little did they know then that Dana’s death from whooping cough, and the media coverage that followed, came to represent a very inconvenient truth to the anti-vaccination lobby – and thus began an extraordinary campaign against this grieving family.\nThe McCafferys are today breaking their silence on the cyber bullying,the anonymous letters and the cruelty of some members of the anti-vaccination movement.\nThe couple has been accused of being on the payroll of drug companies; they have had their daughter’s death questioned and mocked; they have even been told to “harden the f . . . up” by an opponent of vaccination.\n“The venom directed at us has just been torture and it’s been frightening, abhorrent and insensitive in the extreme,” says Toni, who has not had the strength to talk about this until now.\nFirst, let’s do what the Australian Telegraph article failed to do and address the facts.  The child’s death from whooping cough was not likely the result of anti-vaccination campaigns or unvaccinated children.  The increased incidence of whooping cough in the United States, and therefore the death of Dana McCaffery, is primarily due to the reduced effectiveness of the current pertussis DTaP vaccine, which replaced the more effective, but less safe DTP vaccine in the 1990s.\nAs evidence, I\nagain cite Science magazine\nto prove that the scientists, unlike the vaccine advocates, believe that it is the vaccines and not the anti-vaccination campaign that is responsible for what is described as “the return of the disease”.\nWhooping cough, or pertussis, has exploded in the United States in recent years. A new study confirms what scientists have suspected for some time: The return of the disease is caused by the introduction of new, safer vaccines 2 decades ago. Although they have far fewer side effects, the new shots don’t offer long-lived protection the way older vaccines do.\nPertussis bacteria colonize the upper airways, causing a severe cough and shortness of breath that can be fatal in babies. The disease seemed to have mostly disappeared from the United States by the late 1970s—in fact, scientists believe, it continued to spread, undiagnosed, among adults—but over the past 2 decades the disease has bounced back with a vengeance, with strong outbreaks among school-aged children in 2010 and last year, when the United States reported 40,000 cases. Many European countries have also seen increases.\nResearchers have long suspected that new vaccines might have something to do with it….  Physicians at Kaiser Permanente of Northern California compared the protective effects of these vaccines with the old ones when included in a four-dose series of shots called DTP (for diphtheria-tetanus-pertussis), given to children before the age of 2. They studied children born between 1994 and 1999, years in which Kaiser Permanente gradually introduced the new vaccines. As a result, some children had received only the old-style shots, some only the new ones, and some a mixture of both. Of the 1037 children included in the main part of the study, 138 got pertussis during a massive epidemic in California in 2010 to 2011.\nChildren who had received only the acellular vaccine were more than 5.6 times more likely to get sick than those who received the old, whole-cell vaccine, the team will report next month in Pediatrics. Those receiving one or more of each type had an intermediate risk.\nThe results confirm other recent research. In August, a study published in The Journal of the American Medical Association found that acellular vaccine-vaccinated children in Australia were six times more likely to get sick than those receiving the old vaccine. And a study of another California population, published online in March by Clinical Infectious Diseases, showed an eightfold increased risk of illness associated with the new vaccine.\n“We’re now finding out that the acellular vaccine’s doesn’t offer protection for as long,” says the first author of the new study, pediatrician Nicola Klein. “It does work well in the short term. But there was definitely a tradeoff in phasing out the whole-cell vaccine.”\nNow, it is certainly impolitic to criticize, even by implication, grieving parents.  But that impolity and lack of respect for parental grief has been an aspect of the vaccine debate for years thanks to the vaccine advocates viciously attacking parents who have lost children to vaccine reactions.  Moreover, the media’s dishonest reaction to the McCaffery child’s death, including the linked Telegraph article, demonstrates that the vaccine critics were entirely correct to express their doubts about the child’s death and attempt to get more detailed information on it.\nAs the head of the Australian Vaccination Network stated: “To my mind, while an entire community of conscientious objectors\nwere being victimised by the government and the media and being blamed\nfor the death of a child who was too young to be vaccinated, I had every\nright to ask for this information.”\nThe complaints of the mother, “they were just tearing apart everything we had just witnessed and lived through”, are totally misplaced.  She lost her right to private grief the moment that she permitted her child’s death to be used as pro-vaccine attack propaganda.\nEvery family, the McCafferys included, have the right to private grief so long as their grief remains private.  It does not have a right to use their grief as propaganda without expecting skepticism and criticism, much less to hide behind the emotional rhetoric of their child’s death to avoid legitimate, science-based criticism of their spurious attacks on vaccine skeptics.\nAnd it is the height of hypocrisy for pro-vaccine advocates to object to the use of their very arguments against parents actively campaigning for vaccines:\nLike the McCafferys, he went public to raise awareness about vaccination. In 2010 he did three television interviews and he left his phone number with each network for other parents to get in touch.  Soon after, he received a call from a woman who claimed she was from the AVN. He does not recall her name.\nShe accused him of doing the community a disservice, saying he should not be promoting immunisation.\n“Then she went on saying my son was obviously weak and the weakest of the herd are not meant to survive, I should just get over it,” he says. Kokegei was gobsmacked. “I didn’t think someone could be that cold, to belittle what happened to my son in such a heartless way,” he says.\nAnd yet, is this not the very argument that pro-vaccine arguments implicitly make when they argue that it is worth permitting some children to die in the interest of herd immunity?  For every sob story the vaccine advocates have to offer, the anti-vaccine advocates can cite a dozen that are equally rhetorically effective.  And they will never be won over, because all the statistical studies in the world will never convince a parent who has seen, with his own eyes, an infant scream and slump unconscious in immediate reaction to a vaccine injection.",
  "tags": [
    "media",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-30T08:23:00+00:00"
}