{
  "url": "https://voxday.net/2013/05/25/krugman-bets-on-japan/",
  "scraped_at": "2025-12-14T22:29:56.240165",
  "title": "Krugman bets on Japan",
  "date_display": "May 25, 2013",
  "date_iso": "2013-05-25T05:54:00+00:00",
  "date_from_url": "2013-05-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And yet, somehow I doubt he’ll admit that his neo-Keynesian advocacy of more government spending, more money printing, and more debt is incorrect when Abenomics, as <a href=\"http://www.nytimes.com/2013/05/24/opinion/krugman-japan-the-model.html?hp&amp;_r=1&amp;\">applied Keynesian stimulus in Japan</a> is known, fails.  We already know that when it fails, it will be for the same reason that Obama’s $787 billion stimulus package failed: it was too small.</p><blockquote class=\"tr_bq\"><p> These days we are, in economic terms, all<br> Japanese — which is why the ongoing economic experiment in the country<br> that started it all is so important, not just for Japan, but for the<br> world. In a sense, the really remarkable thing about “Abenomics” — the sharp<br> turn toward monetary and fiscal stimulus adopted by the government of<br> Prime Minster Shinzo Abe — is that nobody else in the advanced world is<br> trying anything similar. In fact, the Western world seems overtaken by<br> economic defeatism….</br></br></br></br></br></br></br></p><p>It would be easy for Japanese officials to make the same excuses for<br> inaction that we hear all around the North Atlantic: they are hamstrung<br> by a rapidly aging population; the economy is weighed down by structural<br> problems (and Japan’s structural problems, especially its<br> discrimination against women, are legendary); debt is too high (far<br> higher, as a share of the economy, than that of Greece). And in the<br> past, Japanese officials have, indeed, been very fond of making such<br> excuses.</br></br></br></br></br></br></br></p><p>The truth, however — a truth that the Abe government apparently gets —<br> is that all of these problems are made worse by economic stagnation. A<br> short-term boost to growth won’t cure all of Japan’s ills, but, if it<br> can be achieved, it can be the first step toward a much brighter future.</br></br></br></p><p>So, how is Abenomics working? The safe answer is that it’s too soon to tell. But the early signs are good — and, no, <a href=\"http://www.nytimes.com/2013/05/24/business/global/china-economy.html\" title=\"A Times article\">Thursday’s sudden drop in Japanese stocks</a> doesn’t change that story.</p></blockquote><p>What is the difference between Keynesianism and Neo-Keynesianism?  The true Keynesian believes that there is a time for government spending to contract.  The Neo-Keynesian says: in times of growth, spending must be maintained in order to preserve economic growth.  And in times of contraction, spending must be increased in order to kickstart it.</p></div>",
  "content_text": "And yet, somehow I doubt he’ll admit that his neo-Keynesian advocacy of more government spending, more money printing, and more debt is incorrect when Abenomics, as\napplied Keynesian stimulus in Japan\nis known, fails.  We already know that when it fails, it will be for the same reason that Obama’s $787 billion stimulus package failed: it was too small.\nThese days we are, in economic terms, all\nJapanese — which is why the ongoing economic experiment in the country\nthat started it all is so important, not just for Japan, but for the\nworld. In a sense, the really remarkable thing about “Abenomics” — the sharp\nturn toward monetary and fiscal stimulus adopted by the government of\nPrime Minster Shinzo Abe — is that nobody else in the advanced world is\ntrying anything similar. In fact, the Western world seems overtaken by\neconomic defeatism….\nIt would be easy for Japanese officials to make the same excuses for\ninaction that we hear all around the North Atlantic: they are hamstrung\nby a rapidly aging population; the economy is weighed down by structural\nproblems (and Japan’s structural problems, especially its\ndiscrimination against women, are legendary); debt is too high (far\nhigher, as a share of the economy, than that of Greece). And in the\npast, Japanese officials have, indeed, been very fond of making such\nexcuses.\nThe truth, however — a truth that the Abe government apparently gets —\nis that all of these problems are made worse by economic stagnation. A\nshort-term boost to growth won’t cure all of Japan’s ills, but, if it\ncan be achieved, it can be the first step toward a much brighter future.\nSo, how is Abenomics working? The safe answer is that it’s too soon to tell. But the early signs are good — and, no,\nThursday’s sudden drop in Japanese stocks\ndoesn’t change that story.\nWhat is the difference between Keynesianism and Neo-Keynesianism?  The true Keynesian believes that there is a time for government spending to contract.  The Neo-Keynesian says: in times of growth, spending must be maintained in order to preserve economic growth.  And in times of contraction, spending must be increased in order to kickstart it.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-25T04:54:00+00:00"
}