{
  "url": "https://voxday.net/2013/05/12/pulp-writer-review/",
  "scraped_at": "2025-12-14T22:28:44.074028",
  "title": "Pulp Writer review",
  "date_display": "May 12, 2013",
  "date_iso": "2013-05-12T15:04:00+00:00",
  "date_from_url": "2013-05-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonathan Moeller <a href=\"http://www.jonathanmoeller.com/writer/?p=3711\">reviews The Last Witchking</a>:</p><blockquote class=\"tr_bq\"><p> Last year, I read A THRONE OF BONES by Vox Day, and thought it was one of the more interesting new epic fantasy novels I’ve read. The author was kind enough to send me an advance copy of THE LAST WITCHKING, a group of three short stories set in A THRONE OF BONES’S setting of Selenoth. Specifically, THE LAST WITCHKING, THE HOBLETS OF WICCAM FENSBORO, and OPERA VITA AETERNA.</p><p>The first story deals with the titular LAST WITCHKING, and provides an origin story for one of the villains in A THRONE OF BONES. In Selenoth, the “Witchkings” were the pejorative name for a race of extremely powerful sorcerers that once ruled and tyrannized much of the world. The elves eventually destroyed the witchkings, but before they did, the last two witchkings conceived a child and hid him among the humans, intending that child to be the instrument of vengeance upon their enemies….</p><p>[T]he Selenoth books are a welcome breath of fresh air. SF/F publishing<br> has become too ossified and moribund (science fiction and fantasy are<br> supposed to be the literature of the speculative, yet every writer these<br> days seems to have the exact same standard-issue SWPL worldview) so<br> books from a writer who is capable of regarding organized religion as<br> something other than a peculiar superstition practiced by the peasantry<br> are most welcome.</br></br></br></br></br></br></p></blockquote><p>It’s always interesting to see which of the three stories contained in Witchking are preferred by various readers.  I also find it amusing that people who haven’t read Hoblets assume it is some sort of Shire ripoff – somewhat ironic in light of how Robert Jordan admitted he was intentionally ripping off The Shire in the first book of <i>The Wheel of Time</i> – whereas those who have read it have expressed some degree of frustration at the way in which it is not even possible to identify what they are.</p></div>",
  "content_text": "Jonathan Moeller\nreviews The Last Witchking\n:\nLast year, I read A THRONE OF BONES by Vox Day, and thought it was one of the more interesting new epic fantasy novels I’ve read. The author was kind enough to send me an advance copy of THE LAST WITCHKING, a group of three short stories set in A THRONE OF BONES’S setting of Selenoth. Specifically, THE LAST WITCHKING, THE HOBLETS OF WICCAM FENSBORO, and OPERA VITA AETERNA.\nThe first story deals with the titular LAST WITCHKING, and provides an origin story for one of the villains in A THRONE OF BONES. In Selenoth, the “Witchkings” were the pejorative name for a race of extremely powerful sorcerers that once ruled and tyrannized much of the world. The elves eventually destroyed the witchkings, but before they did, the last two witchkings conceived a child and hid him among the humans, intending that child to be the instrument of vengeance upon their enemies….\n[T]he Selenoth books are a welcome breath of fresh air. SF/F publishing\nhas become too ossified and moribund (science fiction and fantasy are\nsupposed to be the literature of the speculative, yet every writer these\ndays seems to have the exact same standard-issue SWPL worldview) so\nbooks from a writer who is capable of regarding organized religion as\nsomething other than a peculiar superstition practiced by the peasantry\nare most welcome.\nIt’s always interesting to see which of the three stories contained in Witchking are preferred by various readers.  I also find it amusing that people who haven’t read Hoblets assume it is some sort of Shire ripoff – somewhat ironic in light of how Robert Jordan admitted he was intentionally ripping off The Shire in the first book of\nThe Wheel of Time\n– whereas those who have read it have expressed some degree of frustration at the way in which it is not even possible to identify what they are.",
  "tags": [
    "books",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-12T14:04:00+00:00"
}