{
  "url": "https://voxday.net/2013/05/22/reviewing-men-on-strike/",
  "scraped_at": "2025-12-14T22:29:40.136296",
  "title": "Reviewing Men on Strike",
  "date_display": "May 22, 2013",
  "date_iso": "2013-05-22T12:54:00+00:00",
  "date_from_url": "2013-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dr. Helen Smith’s <a href=\"http://www.amazon.com/Men-Strike-Boycotting-Marriage-Fatherhood/dp/1594036756/ref=sr_1_1?ie=UTF8&amp;qid=1369227034&amp;sr=8-1&amp;keywords=men+on+strike\">Men on Strike</a> was released today.  I reviewed it at Alpha Game.  An excerpt:</p><blockquote class=\"tr_bq\"><p> With the publication of <i>Men on Strike</i>, Dr. Helen Smith<br> fires an important shot in the ongoing cultural war for the soul, and<br> indeed, the survival, of Western Civilization.  It is a shot she fires<br> in defense of the defenders, in defense of the barricades, in defense of<br> the gates, against the lawless barbarians marching under the banner of<br> the Female Imperative.</br></br></br></br></br></p><p>If the horror stories and red pill realities she chronicles will not be<br> unfamiliar to those who are regular readers of the androsphere, they are<br> nevertheless particularly effective when presented, largely<br> dispassionately, one after another in succession.  Dr. Helen does an<br> competent job of drawing clear links between a legal regime biased<br> towards women and the fearful behavior of men who no longer see<br> sufficient incentive to perform the roles that society has long expected<br> and required of them.</br></br></br></br></br></br></br></p></blockquote><p>Read the rest <a href=\"http://alphagameplan.blogspot.com/2013/05/book-review-men-on-strike.html\">at Alpha Game</a>.</p></div>",
  "content_text": "Dr. Helen Smith’s\nMen on Strike\nwas released today.  I reviewed it at Alpha Game.  An excerpt:\nWith the publication of\nMen on Strike\n, Dr. Helen Smith\nfires an important shot in the ongoing cultural war for the soul, and\nindeed, the survival, of Western Civilization.  It is a shot she fires\nin defense of the defenders, in defense of the barricades, in defense of\nthe gates, against the lawless barbarians marching under the banner of\nthe Female Imperative.\nIf the horror stories and red pill realities she chronicles will not be\nunfamiliar to those who are regular readers of the androsphere, they are\nnevertheless particularly effective when presented, largely\ndispassionately, one after another in succession.  Dr. Helen does an\ncompetent job of drawing clear links between a legal regime biased\ntowards women and the fearful behavior of men who no longer see\nsufficient incentive to perform the roles that society has long expected\nand required of them.\nRead the rest\nat Alpha Game\n.",
  "tags": [
    "Alpha Game",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-22T11:54:00+00:00"
}