{
  "url": "https://voxday.net/2013/05/11/spain-is-next-deposit-thef/",
  "scraped_at": "2025-12-14T22:28:36.751508",
  "title": "Spain is the next deposit theft",
  "date_display": "May 11, 2013",
  "date_iso": "2013-05-11T08:10:00+00:00",
  "date_from_url": "2013-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or, if you prefer the more genteel term, “bail-in”. Jeremy Warner warns: “Spain is officially insolvent: <a href=\"http://blogs.telegraph.co.uk/finance/jeremywarner/100024476/spain-is-officially-insolvent-get-your-money-out-while-you-still-can/\">get your money out</a> while you still can”</p><blockquote class=\"tr_bq\"><p> I’d not noticed this until someone drew my attention to it, but <a href=\"http://www.imf.org/external/pubs/ft/fm/2013/01/pdf/fm1301.pdf\">the latest IMF Fiscal Monitor</a>,<br> published last month, comes about as close to declaring Spain insolvent<br> as you are ever likely to see in official analysis of this sort. Of<br> course, it doesn’t actually say this outright. The IMF is far too<br> diplomatic for such language. But that’s the plain meaning of its latest<br> forecasts, which at last have an air of realism about them, rather than<br> being the usual dose of wishful thinking….</br></br></br></br></br></br></p><p>All this leads to the conclusion that a big Spanish debt restructuring is inevitable. Spanish sovereign bond yields have fallen sharply since announcement of the European Central Bank’s “outright monetary transactions” programme. The ECB has promised to print money without limit to counter the speculators. But in the end, no amount of liquidity can cover up for an underlying problem with solvency.</p><p>Europe said that Greece was the first and last such restructuring, but then there was Cyprus. Spain is holding off further recapitalisation of its banks in anticipation of the arrival of Europe’s banking union, which it hopes will do the job instead. But if the Cypriot precedent is anything to go by, a heavy price will be demanded by way of recompense. Bank creditors will be widely bailed in. Confiscation of deposits looks all too possible.</p><p>I don’t advise getting your money out lightly. Indeed, such advise is generally thought grossly irresponsible, for it risks inducing a self reinforcing panic. Yet looking at the IMF projections, it’s the only rational thing to do.</p></blockquote><p>The amazing thing about this isn’t that there are more deposit thefts in the works, or that a specific country has been identified.  No, the amazing thing is that this isn’t from Zerohedge, Max Keiser, or some other economic contrarian site, it’s the “assistant editor of The Daily Telegraph” and “one of Britain’s leading business and economics commentators”.</p><p>If you’ve got money in a Spanish bank, you can’t say you weren’t warned very clearly and specifically.  And if you’ve got your money in a bank in another country, such as the UK or the USA, be aware that your time is likely coming, sooner or later.  In the case of the latter, the Fed is already beginning to send signals that it is not going to “print” forever.</p></div>",
  "content_text": "Or, if you prefer the more genteel term, “bail-in”. Jeremy Warner warns: “Spain is officially insolvent:\nget your money out\nwhile you still can”\nI’d not noticed this until someone drew my attention to it, but\nthe latest IMF Fiscal Monitor\n,\npublished last month, comes about as close to declaring Spain insolvent\nas you are ever likely to see in official analysis of this sort. Of\ncourse, it doesn’t actually say this outright. The IMF is far too\ndiplomatic for such language. But that’s the plain meaning of its latest\nforecasts, which at last have an air of realism about them, rather than\nbeing the usual dose of wishful thinking….\nAll this leads to the conclusion that a big Spanish debt restructuring is inevitable. Spanish sovereign bond yields have fallen sharply since announcement of the European Central Bank’s “outright monetary transactions” programme. The ECB has promised to print money without limit to counter the speculators. But in the end, no amount of liquidity can cover up for an underlying problem with solvency.\nEurope said that Greece was the first and last such restructuring, but then there was Cyprus. Spain is holding off further recapitalisation of its banks in anticipation of the arrival of Europe’s banking union, which it hopes will do the job instead. But if the Cypriot precedent is anything to go by, a heavy price will be demanded by way of recompense. Bank creditors will be widely bailed in. Confiscation of deposits looks all too possible.\nI don’t advise getting your money out lightly. Indeed, such advise is generally thought grossly irresponsible, for it risks inducing a self reinforcing panic. Yet looking at the IMF projections, it’s the only rational thing to do.\nThe amazing thing about this isn’t that there are more deposit thefts in the works, or that a specific country has been identified.  No, the amazing thing is that this isn’t from Zerohedge, Max Keiser, or some other economic contrarian site, it’s the “assistant editor of The Daily Telegraph” and “one of Britain’s leading business and economics commentators”.\nIf you’ve got money in a Spanish bank, you can’t say you weren’t warned very clearly and specifically.  And if you’ve got your money in a bank in another country, such as the UK or the USA, be aware that your time is likely coming, sooner or later.  In the case of the latter, the Fed is already beginning to send signals that it is not going to “print” forever.",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-11T07:10:00+00:00"
}