{
  "url": "https://voxday.net/2013/05/08/the-conspiracy-theorists-were-rig/",
  "scraped_at": "2025-12-14T22:28:22.652224",
  "title": "The conspiracy theorists were right",
  "date_display": "May 8, 2013",
  "date_iso": "2013-05-08T17:00:00+00:00",
  "date_from_url": "2013-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I have repeatedly written, the Conspiracy Theory of History is the only one that stands up to critical analysis.  Not only that, but the closer you look, the more readily apparent the various conspiracies become.  Matt Taibbi, who has been doggedly investigating the world of high finance since the 2008 crisis began, finally <a href=\"http://www.rollingstone.com/politics/news/everything-is-rigged-the-biggest-financial-scandal-yet-20130425\">throws up his hands and admits</a> what was always readily apparent to the sufficiently logical:</p><blockquote class=\"tr_bq\"><p> Conspiracy theorists of the world, believers in the hidden hands of<br> the Rothschilds and the Masons and the Illuminati, we skeptics owe you<br> an apology. You were right. The players may be a little different, but<br> your basic premise is correct: The world is a rigged game. We found this<br> out in recent months, when a series of related corruption stories<br> spilled out of the financial sector, suggesting the world’s largest<br> banks may be fixing the prices of, well, just about everything.</br></br></br></br></br></br></p><p>You may have heard of the Libor scandal, in which at least three –<br> and perhaps as many as 16 – of the name-brand too-big-to-fail banks have<br> been manipulating global interest rates, in the process messing around<br> with the prices of upward of $500 trillion (that’s trillion, with a “t”)<br> worth of financial instruments. When that sprawling con burst into<br> public view last year, it was easily the biggest financial scandal in<br> history – MIT professor Andrew Lo even said it “dwarfs by orders of<br> magnitude any financial scam in the history of markets.”</br></br></br></br></br></br></br></p><p>That was bad enough, but now Libor may have a twin brother. Word has<br> leaked out that the London-based firm ICAP, the world’s largest broker<br> of interest-rate swaps, is being investigated by American authorities<br> for behavior that sounds eerily reminiscent of the Libor mess.<br> Regulators are looking into whether or not a small group of brokers at<br> ICAP may have worked with up to 15 of the world’s largest banks to<br> manipulate ISDAfix, a benchmark number used around the world to<br> calculate the prices of interest-rate swaps.</br></br></br></br></br></br></br></p><p>Interest-rate swaps are a tool used by big cities, major corporations<br> and sovereign governments to manage their debt, and the scale of their<br> use is almost unimaginably massive. It’s about a $379 trillion market,<br> meaning that any manipulation would affect a pile of assets about 100<br> times the size of the United States federal budget.</br></br></br></br></p><p>It should surprise no one that among the players implicated in this<br> scheme to fix the prices of interest-rate swaps are the same megabanks –<br> including Barclays, UBS, Bank of America, JPMorgan Chase and the Royal<br> Bank of Scotland – that serve on the Libor panel that sets global<br> interest rates. In fact, in recent years many of these banks have<br> already paid multimillion-dollar settlements for anti-competitive<br> manipulation of one form or another (in addition to Libor, some were<br> caught up in an anti-competitive scheme, <a href=\"http://www.rollingstone.com/politics/news/the-scam-wall-street-learned-from-the-mafia-20120620\" rel=\"noopener\" target=\"_blank\">detailed in <em>Rolling Stone</em> last year</a>,<br> to rig municipal-debt service auctions). Though the jumble of financial<br> acronyms sounds like gibberish to the layperson, the fact that there<br> may now be price-fixing scandals involving both Libor and ISDAfix<br> suggests a single, giant mushrooming conspiracy of collusion and<br> price-fixing hovering under the ostensibly competitive veneer of Wall<br> Street culture.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Nor should it come as any surprise that the chief role of government in all of this has been to enable and defend the conspirators.</p><p>“But the biggest shock came out of a federal courtroom at the end of<br> March – though if you follow these matters closely, it may not have been<br> so shocking at all – when a landmark class-action civil lawsuit against<br> the banks for Libor-related offenses was dismissed. In that case, a federal judge accepted the banker-defendants’<br> incredible argument: If cities and towns and other investors lost money<br> because of Libor manipulation, that was their own fault for ever<br> thinking the banks were competing in the first place.”</br></br></br></br></br></br></p><p>The reason all of this information is finally coming out is because the system is breaking down.  The scale of the efforts required to attempt salvaging the players precludes any ability to keep everything behind the veil of genteel respectability while the straightforward demands for access to taxpayer funds and bank deposits prevents any attempt to confuse matters by appealing to their complexity. </p></div>",
  "content_text": "As I have repeatedly written, the Conspiracy Theory of History is the only one that stands up to critical analysis.  Not only that, but the closer you look, the more readily apparent the various conspiracies become.  Matt Taibbi, who has been doggedly investigating the world of high finance since the 2008 crisis began, finally\nthrows up his hands and admits\nwhat was always readily apparent to the sufficiently logical:\nConspiracy theorists of the world, believers in the hidden hands of\nthe Rothschilds and the Masons and the Illuminati, we skeptics owe you\nan apology. You were right. The players may be a little different, but\nyour basic premise is correct: The world is a rigged game. We found this\nout in recent months, when a series of related corruption stories\nspilled out of the financial sector, suggesting the world’s largest\nbanks may be fixing the prices of, well, just about everything.\nYou may have heard of the Libor scandal, in which at least three –\nand perhaps as many as 16 – of the name-brand too-big-to-fail banks have\nbeen manipulating global interest rates, in the process messing around\nwith the prices of upward of $500 trillion (that’s trillion, with a “t”)\nworth of financial instruments. When that sprawling con burst into\npublic view last year, it was easily the biggest financial scandal in\nhistory – MIT professor Andrew Lo even said it “dwarfs by orders of\nmagnitude any financial scam in the history of markets.”\nThat was bad enough, but now Libor may have a twin brother. Word has\nleaked out that the London-based firm ICAP, the world’s largest broker\nof interest-rate swaps, is being investigated by American authorities\nfor behavior that sounds eerily reminiscent of the Libor mess.\nRegulators are looking into whether or not a small group of brokers at\nICAP may have worked with up to 15 of the world’s largest banks to\nmanipulate ISDAfix, a benchmark number used around the world to\ncalculate the prices of interest-rate swaps.\nInterest-rate swaps are a tool used by big cities, major corporations\nand sovereign governments to manage their debt, and the scale of their\nuse is almost unimaginably massive. It’s about a $379 trillion market,\nmeaning that any manipulation would affect a pile of assets about 100\ntimes the size of the United States federal budget.\nIt should surprise no one that among the players implicated in this\nscheme to fix the prices of interest-rate swaps are the same megabanks –\nincluding Barclays, UBS, Bank of America, JPMorgan Chase and the Royal\nBank of Scotland – that serve on the Libor panel that sets global\ninterest rates. In fact, in recent years many of these banks have\nalready paid multimillion-dollar settlements for anti-competitive\nmanipulation of one form or another (in addition to Libor, some were\ncaught up in an anti-competitive scheme,\ndetailed in\nRolling Stone\nlast year\n,\nto rig municipal-debt service auctions). Though the jumble of financial\nacronyms sounds like gibberish to the layperson, the fact that there\nmay now be price-fixing scandals involving both Libor and ISDAfix\nsuggests a single, giant mushrooming conspiracy of collusion and\nprice-fixing hovering under the ostensibly competitive veneer of Wall\nStreet culture.\nNor should it come as any surprise that the chief role of government in all of this has been to enable and defend the conspirators.\n“But the biggest shock came out of a federal courtroom at the end of\nMarch – though if you follow these matters closely, it may not have been\nso shocking at all – when a landmark class-action civil lawsuit against\nthe banks for Libor-related offenses was dismissed. In that case, a federal judge accepted the banker-defendants’\nincredible argument: If cities and towns and other investors lost money\nbecause of Libor manipulation, that was their own fault for ever\nthinking the banks were competing in the first place.”\nThe reason all of this information is finally coming out is because the system is breaking down.  The scale of the efforts required to attempt salvaging the players precludes any ability to keep everything behind the veil of genteel respectability while the straightforward demands for access to taxpayer funds and bank deposits prevents any attempt to confuse matters by appealing to their complexity.",
  "tags": [
    "banks",
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-08T16:00:00+00:00"
}