{
  "url": "https://voxday.net/2013/05/06/the-blessings-of-diversity-2/",
  "scraped_at": "2025-12-14T22:28:09.548577",
  "title": "The blessings of diversity",
  "date_display": "May 6, 2013",
  "date_iso": "2013-05-06T17:00:00+00:00",
  "date_from_url": "2013-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In a previous post, the Responsible Puppet commented that one area where he agrees with John Piper and disagrees with me is on the subject of “Race: is Diversity good?”</p><p>I find the idea that diversity of race is considered a positive attribute for a society to be a fascinating argument, considering that it more or less flies in the face of the entire written history of humanity.  Regardless of whether one considers the relatively small Italian immigration into Constantinople, the larger scale Mongolian immigration into Russia and Eastern Europe, the European colonization of the Americas, or the much more recent <a href=\"http://www.dailymail.co.uk/news/article-2320002/How-rise-white-flight-areas-dominated-ethnic-minorities-creating-segregated-UK.html\">immigration of the third world into Great Britain</a>, the results are inevitably bad for the native population.</p><p>As <a href=\"http://www.nypost.com/p/news/local/brooklyn/mailmen_deliver_us_from_evil_9TJh9RgtiTv1FGwOw05MOI\">this example from Brooklyn demonstrates</a>, one can’t even count on the most rudimentary aspects of civilized society to be preserved once the demographic makeup of that society shifts beyond a certain point.  The mail was reliably delivered across a Wild and homogenous West when the technology was limited to horses, and yet this is nevertheless more than diverse 21st century Brooklyn can manage.</p><blockquote class=\"tr_bq\"><p> Snow, rain and gloom of night might not slow Brownsville mailmen down — but gangbangers sure will. Postmen are too scared to deliver letters and packages to one of Brooklyn’s most crime-ravaged neighborhoods, a US Postal Service worker told The Post yesterday….</p><p>“The postal workers have a right to fear for their life,” said Quantanya White, 38, a home health-care worker. “It doesn’t give them the right not to deliver the mail. Just because this place is bad, you’re not going to deliver the mail?</p></blockquote><p>I should be very interested to hear the Puppet – or, for that matter, John Piper’s – explanation for why there is such a reliable correlation between the way in which a society functions and its demographic patterns.  Equality in Jesus Christ should not be confused with equality in anything else.  This should not be a difficult concept for anyone who isn’t willing to swap his heart surgeon for a fry cook with Down’s Syndrome on the basis of their mutual Christianity.</p></div>",
  "content_text": "In a previous post, the Responsible Puppet commented that one area where he agrees with John Piper and disagrees with me is on the subject of “Race: is Diversity good?”\nI find the idea that diversity of race is considered a positive attribute for a society to be a fascinating argument, considering that it more or less flies in the face of the entire written history of humanity.  Regardless of whether one considers the relatively small Italian immigration into Constantinople, the larger scale Mongolian immigration into Russia and Eastern Europe, the European colonization of the Americas, or the much more recent\nimmigration of the third world into Great Britain\n, the results are inevitably bad for the native population.\nAs\nthis example from Brooklyn demonstrates\n, one can’t even count on the most rudimentary aspects of civilized society to be preserved once the demographic makeup of that society shifts beyond a certain point.  The mail was reliably delivered across a Wild and homogenous West when the technology was limited to horses, and yet this is nevertheless more than diverse 21st century Brooklyn can manage.\nSnow, rain and gloom of night might not slow Brownsville mailmen down — but gangbangers sure will. Postmen are too scared to deliver letters and packages to one of Brooklyn’s most crime-ravaged neighborhoods, a US Postal Service worker told The Post yesterday….\n“The postal workers have a right to fear for their life,” said Quantanya White, 38, a home health-care worker. “It doesn’t give them the right not to deliver the mail. Just because this place is bad, you’re not going to deliver the mail?\nI should be very interested to hear the Puppet – or, for that matter, John Piper’s – explanation for why there is such a reliable correlation between the way in which a society functions and its demographic patterns.  Equality in Jesus Christ should not be confused with equality in anything else.  This should not be a difficult concept for anyone who isn’t willing to swap his heart surgeon for a fry cook with Down’s Syndrome on the basis of their mutual Christianity.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-06T16:00:00+00:00"
}