{
  "url": "https://voxday.net/2013/05/31/the-gatekeepers-strike-again/",
  "scraped_at": "2025-12-14T22:30:24.475965",
  "title": "The gatekeepers strike again",
  "date_display": "May 31, 2013",
  "date_iso": "2013-05-31T10:55:00+00:00",
  "date_from_url": "2013-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’d previously made some allusions to the interest of a European publisher in putting out the <i>Arts of Dark and Light</i> series in audiobook and paperback next year, however, after being informed this morning that the publisher changed their mind about publishing it, it has become clear that I have reached the point where I am officially unpublishable by conventional publishers.  C’est la vie.</p><p>It’s the usual political gatekeeping of course.  I was told that some of my public statements would make it hard for them to defend the decision to publish with me, despite how much they liked the first book in the series.  The annoying thing is that this is the SECOND time this has happened with this particular publisher; I was assured that this time, my idiosyncratic opinions would not be an issue….</p><p>What it comes down to in the end is that I haven’t sold enough books or built enough of a readership to be deemed worth the criticism that comes with my level of notoriety.  The risk/reward balance is too high. Orson Scott Card’s views are every bit as offensive to the gatekeepers as mine are, but Tor Books isn’t about to stop publishing their bestselling author on that basis.  At a mere one million pageviews per month and paltry sales of around 12,000 ebooks annually, the controversy that comes with my name simply isn’t worth it to the publishers.  Now, once I reach 5 million pageviews, I expect they’ll suddenly start sniffing around again.  At 10 million and a top 100 Amazon rank in the Fantasy category, even the most liberal gatekeeper will magically cease to have any problem with my public statements.</p><p>Will it take a while for me to get there?  Sure.  But I will.  Fortunately, this is precisely the “that which does not kill me makes me stronger” sort of thing that gives me the motivation to surmount my natural laziness and get things done.  Whether I’ll still see any benefit to working with conventional publishers is a question I’ll consider when the situation arises. In the meantime, my first order of business is to find a reader for the audiobooks I will be publishing next year.  My second order of business will be to begin finding authors who would like to publish electronically through in-game stores with direct access to millions of players.  And my third order of business will be to formally announce the new games we are presently developing.</p><p>I would have preferred to take the easy way and turn the book distribution aspects over to a publisher so that I could focus entirely on the writing and game development.  But that’s no longer an option for me due to the political correctness that pervades the publishing industry throughout the English-speaking world.  Since the traditional channels are closed, I’ll simply have to create new ones.  Necessity, after all, is the mother of invention.</p><p>I’m not whining or complaining; this is the path I chose.  I’m not looking for sympathy or support.  And I’m not upset with the publishers; they are certainly free to make their own choices and render themselves increasingly irrelevant to various demographics if they like. Yes, it’s certainly irritating to AGAIN find out that a publisher who knows perfectly well how controversial I am when they start talking to me, and who assures me that my notoriety isn’t a problem, ends up getting cold feet before the deal closes.  (Or, in two cases, AFTER it closes.) Still, other than being a minor waste of time, it’s not an actual problem. I’m only irritated with myself because I should have known better; Spacebunny was openly skeptical from the start.</p><p>But this isn’t merely a problem for me. The suspicions that publishers have a political agenda and refuse to publish writers solely due to their politically incorrect views are well-founded and are based in absolute, well-documented fact.  Most writers won’t talk about this because they hold out hopes for one day being allowed through the gates and they don’t want to burn any bridges.  However, one advantage of discovering one has already inadvertently nuked all the bridges is that one has carte blanche to speak the truths that would otherwise remain unspoken.</p><p>To quote <a href=\"http://accordingtohoyt.com/2013/05/29/pioneers-on-the-wild-frontier/\">Standout Author Sarah Hoyt</a>: <i>“Like most pioneers, you’re being forced onto it by circumstances and<br> by the status quo becoming untenable.  But it doesn’t mean you can’t<br> take the opportunity to build something better. Now go and do it.”</br></br></i></p><p>And that is exactly what I intend to do.</p></div>",
  "content_text": "I’d previously made some allusions to the interest of a European publisher in putting out the\nArts of Dark and Light\nseries in audiobook and paperback next year, however, after being informed this morning that the publisher changed their mind about publishing it, it has become clear that I have reached the point where I am officially unpublishable by conventional publishers.  C’est la vie.\nIt’s the usual political gatekeeping of course.  I was told that some of my public statements would make it hard for them to defend the decision to publish with me, despite how much they liked the first book in the series.  The annoying thing is that this is the SECOND time this has happened with this particular publisher; I was assured that this time, my idiosyncratic opinions would not be an issue….\nWhat it comes down to in the end is that I haven’t sold enough books or built enough of a readership to be deemed worth the criticism that comes with my level of notoriety.  The risk/reward balance is too high. Orson Scott Card’s views are every bit as offensive to the gatekeepers as mine are, but Tor Books isn’t about to stop publishing their bestselling author on that basis.  At a mere one million pageviews per month and paltry sales of around 12,000 ebooks annually, the controversy that comes with my name simply isn’t worth it to the publishers.  Now, once I reach 5 million pageviews, I expect they’ll suddenly start sniffing around again.  At 10 million and a top 100 Amazon rank in the Fantasy category, even the most liberal gatekeeper will magically cease to have any problem with my public statements.\nWill it take a while for me to get there?  Sure.  But I will.  Fortunately, this is precisely the “that which does not kill me makes me stronger” sort of thing that gives me the motivation to surmount my natural laziness and get things done.  Whether I’ll still see any benefit to working with conventional publishers is a question I’ll consider when the situation arises. In the meantime, my first order of business is to find a reader for the audiobooks I will be publishing next year.  My second order of business will be to begin finding authors who would like to publish electronically through in-game stores with direct access to millions of players.  And my third order of business will be to formally announce the new games we are presently developing.\nI would have preferred to take the easy way and turn the book distribution aspects over to a publisher so that I could focus entirely on the writing and game development.  But that’s no longer an option for me due to the political correctness that pervades the publishing industry throughout the English-speaking world.  Since the traditional channels are closed, I’ll simply have to create new ones.  Necessity, after all, is the mother of invention.\nI’m not whining or complaining; this is the path I chose.  I’m not looking for sympathy or support.  And I’m not upset with the publishers; they are certainly free to make their own choices and render themselves increasingly irrelevant to various demographics if they like. Yes, it’s certainly irritating to AGAIN find out that a publisher who knows perfectly well how controversial I am when they start talking to me, and who assures me that my notoriety isn’t a problem, ends up getting cold feet before the deal closes.  (Or, in two cases, AFTER it closes.) Still, other than being a minor waste of time, it’s not an actual problem. I’m only irritated with myself because I should have known better; Spacebunny was openly skeptical from the start.\nBut this isn’t merely a problem for me. The suspicions that publishers have a political agenda and refuse to publish writers solely due to their politically incorrect views are well-founded and are based in absolute, well-documented fact.  Most writers won’t talk about this because they hold out hopes for one day being allowed through the gates and they don’t want to burn any bridges.  However, one advantage of discovering one has already inadvertently nuked all the bridges is that one has carte blanche to speak the truths that would otherwise remain unspoken.\nTo quote\nStandout Author Sarah Hoyt\n:\n“Like most pioneers, you’re being forced onto it by circumstances and\nby the status quo becoming untenable.  But it doesn’t mean you can’t\ntake the opportunity to build something better. Now go and do it.”\nAnd that is exactly what I intend to do.",
  "tags": [
    "books",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-31T09:55:00+00:00"
}