{
  "url": "https://voxday.net/2013/05/08/the-diversity-gospe/",
  "scraped_at": "2025-12-14T22:28:24.469389",
  "title": "The Diversity Gospel",
  "date_display": "May 8, 2013",
  "date_iso": "2013-05-08T20:30:00+00:00",
  "date_from_url": "2013-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>WATYF pointed out one of the many problems with John Piper’s claim of a Biblical mandate for diversity:</p><blockquote class=\"tr_bq\"><p> I think the most logical argument against “diversity” is found in Paul’s admonishment in Romans 12 where he says, “As far as it depends on you, live at peace with all men”. He tells us that we should act in such a way that would promote peace. Well, we know from several studies that “diversity” leads to a LACK of peace amongst men. We know that it leads to less trust, more animosity, and in many cases of very high levels of diversity, outright violence. If we truly want to live at peace “as far as it concerns us”, we would seek to promote peace between us and others, and that would be by preferring a homogenous society.</p><p>The real question is, “Why should we promote diversity?” According to what Biblical standard should it be pursued? If we can’t come up with one (which, as far as I know, there isn’t one in scripture), then we should consider just accepting the simple facts of the matter and doing what’s prudent.</p></blockquote><p>There is another, related argument, which is Matthew 7:15-16.  “Beware of false prophets, who come to you in sheep’s clothing, but inwardly they are ravenous wolves. You will know them by their fruits. Do men gather grapes from thornbushes or figs from thistles?”</p><p>Consider the present fruits of <a href=\"http://www.nytimes.com/2013/05/08/world/africa/body-count-soars-as-nigerian-military-hunts-islamists.html?hp\">diversity in Nigeria</a>:</p><blockquote class=\"tr_bq\"><div itemprop=\"articleBody\"> A fresh load of battered corpses arrived, 29 of them in a routine<br> delivery by the Nigerian military to the hospital morgue here. </br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> Unexpectedly, three bodies started moving.</div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> “They were not properly shot,” recalled a security official here. “I had<br> to call the J.T.F.” — the military’s joint task force — “and they<br> gunned them down.” </br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> It was a rare oversight. Large numbers of bodies, sometimes more than 60<br> in a day, are being brought by the Nigerian military to the state<br> hospital, according to government, health and security officials,<br> hospital workers and human rights groups — the product of the military’s<br> brutal war against radical Islamists rooted in this northern city. </br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> The corpses were those of young men arrested in neighborhood sweeps by<br> the military and taken to a barracks nearby. Accused, often on flimsy or<br> no evidence, of being members or supporters of Boko Haram — the<br> Islamist militant group waging a bloody insurgency against the Nigerian<br> state — the detainees are beaten, starved, shot and even suffocated to<br> death, say the officials, employees and witnesses. </br></br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> Then, soldiers bring the bodies to the hospital and dump them at the<br> morgue, officials and workers say. The flood is so consistent that the<br> small morgue at the edge of the hospital grounds often has no room, with<br> corpses flung by the military in the sand around it. Residents say they<br> sometimes have to flee the neighborhood because of the fierce smell of<br> rotting flesh. </br></br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> From the outset of the battle between Boko Haram and the military, a dirty war on both sides that has cost nearly 4,000 lives since erupting in this city in 2009, security forces have been accused of extrajudicial killings and broad, often indiscriminate roundups of suspects and sympathizers in residential areas. </div></blockquote><p>That’s precisely what history teaches us diversity brings.  Social science, too, has very reluctantly concluded that diversity is a powerful societal negative:</p><blockquote class=\"tr_bq\"><p> In recent years, Putnam has been engaged in a comprehensive study of the relationship between trust within communities and their ethnic diversity. His conclusion based on over 40 cases and 30 000 people within the United States is that, other things being equal, more diversity in a community is associated with less trust both between and within ethnic groups. Although limited to American data, it puts into question both the contact hypothesis and conflict theory in inter-ethnic relations. According to conflict theory, distrust between the ethnic groups will rise with diversity, but not within a group. In contrast, contact theory proposes that distrust will decline as members of different ethnic groups get to know and interact with each other. Putnam describes people of all races, sex, socioeconomic statuses, and ages as “hunkering down,” avoiding engagement with their local community—both among different ethnic groups and within their own ethnic group. Even when controlling for income inequality and crime rates, two factors which conflict theory states should be the prime causal factors in declining inter-ethnic group trust, more diversity is still associated with less communal trust.</p><p>Lowered trust in areas with high diversity is also associated with:</p><ul><li>    Lower confidence in local government, local leaders and the local news media.</li><li>    Lower political efficacy – that is, confidence in one’s own influence.</li><li>    Lower frequency of registering to vote, but more interest and knowledge about politics and more participation in protest marches and social reform groups.</li><li>    Higher political advocacy, but lower expectations that it will bring about a desirable result.</li><li>    Less expectation that others will cooperate to solve dilemmas of collective action (e.g., voluntary conservation to ease a water or energy shortage).</li><li>    Less likelihood of working on a community project.</li><li>    Less likelihood of giving to charity or volunteering.</li><li>    Fewer close friends and confidants.</li><li>    Less happiness and lower perceived quality of life. </li></ul></blockquote><p>So, there is no Biblical justification for Piper’s invented mandate and a clear connection to massive, wide-scale violence as well as a whole host of observable evils.  Moreover, Piper’s teachings on the matter are contrary to that of his father and consistent with the beliefs of a broad spectrum of evil individuals from the African slave traders to the secular globalists.  It should be readily apparent at this point that “Christian Diversity” is a false and ascriptural teaching.</p><p>Moreover, in the discussion it was easy to see how The Responsible Puppet immediately resorted to evasive dishonesty in defense of his “Christian” position.  His claims to ignorance were remarkable given his insistence that diversity must be intrinsically good; a nonsensical position given his claims to know nothing about racial differences.  It took repeated questions before he would even admit to the utterly obvious fact that European civilization is superior to other civilizations, so great is his worldly fear of admitting that there are substantive differences between different human sub-species.  He openly declared that he had to be very careful about saying anything about the subject.  “What I’m doing is answering the question very carefully, which I think<br> is warranted in this situation. And I’ll continue being careful….”</br></p><p>This, too, is another relevant argument.  Why is such care warranted?  Why must he be so careful?  Why is he afraid? Something gave him that spirit of fear.  And yet, Timothy 1:7 says: “For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind.”</p><p>The Diversity Gospel asserted by Piper and exhibited by the Puppet is fearful, weak, and weak-minded.  And therefore we know it does not come from God.</p></div>",
  "content_text": "WATYF pointed out one of the many problems with John Piper’s claim of a Biblical mandate for diversity:\nI think the most logical argument against “diversity” is found in Paul’s admonishment in Romans 12 where he says, “As far as it depends on you, live at peace with all men”. He tells us that we should act in such a way that would promote peace. Well, we know from several studies that “diversity” leads to a LACK of peace amongst men. We know that it leads to less trust, more animosity, and in many cases of very high levels of diversity, outright violence. If we truly want to live at peace “as far as it concerns us”, we would seek to promote peace between us and others, and that would be by preferring a homogenous society.\nThe real question is, “Why should we promote diversity?” According to what Biblical standard should it be pursued? If we can’t come up with one (which, as far as I know, there isn’t one in scripture), then we should consider just accepting the simple facts of the matter and doing what’s prudent.\nThere is another, related argument, which is Matthew 7:15-16.  “Beware of false prophets, who come to you in sheep’s clothing, but inwardly they are ravenous wolves. You will know them by their fruits. Do men gather grapes from thornbushes or figs from thistles?”\nConsider the present fruits of\ndiversity in Nigeria\n:\nA fresh load of battered corpses arrived, 29 of them in a routine\ndelivery by the Nigerian military to the hospital morgue here.\nUnexpectedly, three bodies started moving.\n“They were not properly shot,” recalled a security official here. “I had\nto call the J.T.F.” — the military’s joint task force — “and they\ngunned them down.”\nIt was a rare oversight. Large numbers of bodies, sometimes more than 60\nin a day, are being brought by the Nigerian military to the state\nhospital, according to government, health and security officials,\nhospital workers and human rights groups — the product of the military’s\nbrutal war against radical Islamists rooted in this northern city.\nThe corpses were those of young men arrested in neighborhood sweeps by\nthe military and taken to a barracks nearby. Accused, often on flimsy or\nno evidence, of being members or supporters of Boko Haram — the\nIslamist militant group waging a bloody insurgency against the Nigerian\nstate — the detainees are beaten, starved, shot and even suffocated to\ndeath, say the officials, employees and witnesses.\nThen, soldiers bring the bodies to the hospital and dump them at the\nmorgue, officials and workers say. The flood is so consistent that the\nsmall morgue at the edge of the hospital grounds often has no room, with\ncorpses flung by the military in the sand around it. Residents say they\nsometimes have to flee the neighborhood because of the fierce smell of\nrotting flesh.\nFrom the outset of the battle between Boko Haram and the military, a dirty war on both sides that has cost nearly 4,000 lives since erupting in this city in 2009, security forces have been accused of extrajudicial killings and broad, often indiscriminate roundups of suspects and sympathizers in residential areas.\nThat’s precisely what history teaches us diversity brings.  Social science, too, has very reluctantly concluded that diversity is a powerful societal negative:\nIn recent years, Putnam has been engaged in a comprehensive study of the relationship between trust within communities and their ethnic diversity. His conclusion based on over 40 cases and 30 000 people within the United States is that, other things being equal, more diversity in a community is associated with less trust both between and within ethnic groups. Although limited to American data, it puts into question both the contact hypothesis and conflict theory in inter-ethnic relations. According to conflict theory, distrust between the ethnic groups will rise with diversity, but not within a group. In contrast, contact theory proposes that distrust will decline as members of different ethnic groups get to know and interact with each other. Putnam describes people of all races, sex, socioeconomic statuses, and ages as “hunkering down,” avoiding engagement with their local community—both among different ethnic groups and within their own ethnic group. Even when controlling for income inequality and crime rates, two factors which conflict theory states should be the prime causal factors in declining inter-ethnic group trust, more diversity is still associated with less communal trust.\nLowered trust in areas with high diversity is also associated with:\nLower confidence in local government, local leaders and the local news media.\nLower political efficacy – that is, confidence in one’s own influence.\nLower frequency of registering to vote, but more interest and knowledge about politics and more participation in protest marches and social reform groups.\nHigher political advocacy, but lower expectations that it will bring about a desirable result.\nLess expectation that others will cooperate to solve dilemmas of collective action (e.g., voluntary conservation to ease a water or energy shortage).\nLess likelihood of working on a community project.\nLess likelihood of giving to charity or volunteering.\nFewer close friends and confidants.\nLess happiness and lower perceived quality of life.\nSo, there is no Biblical justification for Piper’s invented mandate and a clear connection to massive, wide-scale violence as well as a whole host of observable evils.  Moreover, Piper’s teachings on the matter are contrary to that of his father and consistent with the beliefs of a broad spectrum of evil individuals from the African slave traders to the secular globalists.  It should be readily apparent at this point that “Christian Diversity” is a false and ascriptural teaching.\nMoreover, in the discussion it was easy to see how The Responsible Puppet immediately resorted to evasive dishonesty in defense of his “Christian” position.  His claims to ignorance were remarkable given his insistence that diversity must be intrinsically good; a nonsensical position given his claims to know nothing about racial differences.  It took repeated questions before he would even admit to the utterly obvious fact that European civilization is superior to other civilizations, so great is his worldly fear of admitting that there are substantive differences between different human sub-species.  He openly declared that he had to be very careful about saying anything about the subject.  “What I’m doing is answering the question very carefully, which I think\nis warranted in this situation. And I’ll continue being careful….”\nThis, too, is another relevant argument.  Why is such care warranted?  Why must he be so careful?  Why is he afraid? Something gave him that spirit of fear.  And yet, Timothy 1:7 says: “For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind.”\nThe Diversity Gospel asserted by Piper and exhibited by the Puppet is fearful, weak, and weak-minded.  And therefore we know it does not come from God.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-08T19:30:00+00:00"
}