{
  "url": "https://voxday.net/2013/05/27/the-infernal-dan-brown/",
  "scraped_at": "2025-12-14T22:30:05.064517",
  "title": "The infernal Dan Brown",
  "date_display": "May 27, 2013",
  "date_iso": "2013-05-27T09:42:00+00:00",
  "date_from_url": "2013-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have never read what passes for a Dan Brown novel, and it seems that this is probably for the best.  But I should note that the vast success of writers who write for idiots doesn’t bother me any more than the success of sixteen year-old pop stars who perform for teen girls does.  Given MPAI, it stands to reason that the writer whose primary goal is to sell as many books as possible should always cater to the lowest nominally literate consumer.</p><p>However, it is a bit much to be expected to also accept the intellectual pretensions of a man who is manifestly writing for the ignorati.  For not only is Brown’s “research” obviously incorrect, the fact that he confuses the ascents of the Purgatorio with the circles of the Inferno <a href=\"http://www.catholicworldreport.com/Item/2275/Dan_Browns_Infernal_Fiction.aspx?utm_source=feedly#.UZ-NGFHuiZR\">tends to suggest that it is entirely nonexistent</a>.  I wouldn’t be at all surprised to learn he’d never even read the entire <i>Inferno</i>, let alone the rest of <i>La Comedia</i>.</p><blockquote class=\"tr_bq\"><p> Dan Brown, author of <i>The Da Vinci Code, </i>having written what<br> for lack of a mightier term we must call a novel, a novel that proved that John<br> the Apostle was a girl, Mary Magdalene a helpless goddess, and a hypotenuse an<br> African water buffalo—having revealed for millions the lavish colors of the<br> frescoes in Notre Dame de Paris (there are no frescoes in Notre Dame de Paris),<br> the grim austerity of Spanish Cathedrals (Spanish Cathedrals are notorious for<br> baroque exuberance), and the deep mystery of the Golden Ratio (every schoolboy<br> knew about the Golden Ratio)—having shown the world that he could write a novel<br> about art, theology, and Christian history while knowing nothing about art,<br> theology, and Christian history, except what he could glean from the covers of<br> matchbooks and <i>obiter dicta </i>from Cher—having shown how much<br> you can do if you do not bother to open an ordinary encyclopedia, this Dan<br> Brown, I say, this man of our time and of no time, has now written a novel about<br> the greatest poet who ever lived, Dante.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Only it doesn’t have<br> a damned thing to do with Dante, just as <i>The<br> Da Vinci Code </br></i>didn’t have anything to do with Leonardo.  Dante is just<br> a quick needle used to inject the “story” into the reader’s head.  This<br> time, Mr. Brown has opened a lot of encyclopedias, deluging the reader with 400<br> pages of material that belongs in Michelin guides to Florence, Venice, and<br> Istanbul, none of it to the point.  Even at that, he gets details wrong as<br> soon as he veers away from something you might find in a guide book, especially<br> when he engages in an exceedingly rare moment of telling us something about<br> Dante’s poem.  He says it was called a <i>Comedy<br> </br></i>because it was written in the vernacular, “for the masses.”  No, a comedy,<br> according to the medieval definition, was a poem in which a character moves<br> from misery to happiness, regardless of what language it is written in, and<br> there were no “masses” to read it, since books were still costly to produce and<br> scarce.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>He says that Dante’s<br> Purgatory has nine circles of ascent; no, there are seven, one for each of the<br> deadly sins.  He says that Purgatory is the only way to get from the<br> Inferno to Paradise.  No, it isn’t; nobody but Dante visits Inferno and<br> leaves the place, and plenty of people do not have to ascend the<br> mountain.  Essentially, Dante’s poem is about the resurrection of a human<br> soul, by the grace of God, to turn from the lie of evil to the truth and beauty<br> of goodness.  Brown doesn’t get any of that, because he doesn’t care about<br> any of that.</br></br></br></br></br></br></br></br></p><p>What’s this book<br> about?  It’s 462 pages of bad prose.  Portentous sentence<br> fragments.  <i>Italics, for somber<br> emphasis.  </br></i>J—–, there are childish profanities!  Even childish<br> punctuation?!  Anticlimaxes, a good dollop of Most Favored Bigotry, for<br> sales; one dimensional characters, most of them pallid even in their one<br> dimension, and a message with all the sophistication of Sesame Street. </br></br></br></br></br></p></blockquote><div class=\"MsoNormal\"> I understand that Eco isn’t for everyone, let alone Calvino and Borges.  But it would be nice if someone in Brown’s position would be responsible enough, if not to actually bother reading Dante, to at least hire someone to read it for him and ensure that he isn’t actively misinforming the sort of people whose only exposure to the culture Brown is mining are his books.</div></div>",
  "content_text": "I have never read what passes for a Dan Brown novel, and it seems that this is probably for the best.  But I should note that the vast success of writers who write for idiots doesn’t bother me any more than the success of sixteen year-old pop stars who perform for teen girls does.  Given MPAI, it stands to reason that the writer whose primary goal is to sell as many books as possible should always cater to the lowest nominally literate consumer.\nHowever, it is a bit much to be expected to also accept the intellectual pretensions of a man who is manifestly writing for the ignorati.  For not only is Brown’s “research” obviously incorrect, the fact that he confuses the ascents of the Purgatorio with the circles of the Inferno\ntends to suggest that it is entirely nonexistent\n.  I wouldn’t be at all surprised to learn he’d never even read the entire\nInferno\n, let alone the rest of\nLa Comedia\n.\nDan Brown, author of\nThe Da Vinci Code,\nhaving written what\nfor lack of a mightier term we must call a novel, a novel that proved that John\nthe Apostle was a girl, Mary Magdalene a helpless goddess, and a hypotenuse an\nAfrican water buffalo—having revealed for millions the lavish colors of the\nfrescoes in Notre Dame de Paris (there are no frescoes in Notre Dame de Paris),\nthe grim austerity of Spanish Cathedrals (Spanish Cathedrals are notorious for\nbaroque exuberance), and the deep mystery of the Golden Ratio (every schoolboy\nknew about the Golden Ratio)—having shown the world that he could write a novel\nabout art, theology, and Christian history while knowing nothing about art,\ntheology, and Christian history, except what he could glean from the covers of\nmatchbooks and\nobiter dicta\nfrom Cher—having shown how much\nyou can do if you do not bother to open an ordinary encyclopedia, this Dan\nBrown, I say, this man of our time and of no time, has now written a novel about\nthe greatest poet who ever lived, Dante.\nOnly it doesn’t have\na damned thing to do with Dante, just as\nThe\nDa Vinci Code\ndidn’t have anything to do with Leonardo.  Dante is just\na quick needle used to inject the “story” into the reader’s head.  This\ntime, Mr. Brown has opened a lot of encyclopedias, deluging the reader with 400\npages of material that belongs in Michelin guides to Florence, Venice, and\nIstanbul, none of it to the point.  Even at that, he gets details wrong as\nsoon as he veers away from something you might find in a guide book, especially\nwhen he engages in an exceedingly rare moment of telling us something about\nDante’s poem.  He says it was called a\nComedy\nbecause it was written in the vernacular, “for the masses.”  No, a comedy,\naccording to the medieval definition, was a poem in which a character moves\nfrom misery to happiness, regardless of what language it is written in, and\nthere were no “masses” to read it, since books were still costly to produce and\nscarce.\nHe says that Dante’s\nPurgatory has nine circles of ascent; no, there are seven, one for each of the\ndeadly sins.  He says that Purgatory is the only way to get from the\nInferno to Paradise.  No, it isn’t; nobody but Dante visits Inferno and\nleaves the place, and plenty of people do not have to ascend the\nmountain.  Essentially, Dante’s poem is about the resurrection of a human\nsoul, by the grace of God, to turn from the lie of evil to the truth and beauty\nof goodness.  Brown doesn’t get any of that, because he doesn’t care about\nany of that.\nWhat’s this book\nabout?  It’s 462 pages of bad prose.  Portentous sentence\nfragments.\nItalics, for somber\nemphasis.\nJ—–, there are childish profanities!  Even childish\npunctuation?!  Anticlimaxes, a good dollop of Most Favored Bigotry, for\nsales; one dimensional characters, most of them pallid even in their one\ndimension, and a message with all the sophistication of Sesame Street.\nI understand that Eco isn’t for everyone, let alone Calvino and Borges.  But it would be nice if someone in Brown’s position would be responsible enough, if not to actually bother reading Dante, to at least hire someone to read it for him and ensure that he isn’t actively misinforming the sort of people whose only exposure to the culture Brown is mining are his books.",
  "tags": [
    "books",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-27T08:42:00+00:00"
}