{
  "url": "https://voxday.net/2013/05/01/the-last-witchking/",
  "scraped_at": "2025-12-14T22:27:41.704569",
  "title": "The Last Witchking",
  "date_display": "May 1, 2013",
  "date_iso": "2013-05-01T19:30:00+00:00",
  "date_from_url": "2013-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://4.bp.blogspot.com/-X_I8bh8-sHk/UYFrzk23UKI/AAAAAAAAAcw/gYH_PdKtUis/s1600/TLW_cover.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/05/TLW_cover.jpg\" width=\"266\"/></a></div><p>I am pleased to announce that Marcher Lord Hinterlands has released <a href=\"http://www.amazon.com/The-Last-Witchking-ebook/dp/B00CLTSKZU\">THE LAST WITCHKING</a>,<br> a 105-page ebook that consists of the title novelette and two short stories, all three of of which are set in Selenoth, the world of A THRONE OF BONES.  It<br> is now available from Amazon for $1.99.</br></br></p><p>The title story concerns the hidden heir to a fallen race of magicians,<br> the infamous Witchkings, who delves deep into his father’s dark lore as he pursues vengeance against the elves and men responsible for destroying his people.  The second story, “The Hoblets of Wiccam<br> Fensboro”, is a tale of survival and the triumph of simple human decency<br> in the face of brutality and defeat. The third story, “Opera Vita<br> Aeterna”, tells the story of the relationship between an elven sorcerer and a monk of the Ordo Sancti Dioscuri, and<br> how they discover that the transformational power of friendship can be the<br> highest and most potent magic of all.  The third story also features a brief appearance by one of the perspective characters from A THRONE OF BONES.</br></br></br></br></br></br></p><p>Thanks<br> to Jartstar, who did another excellent job on the cover.  We wanted to go for a different look this time, one that hinted at the broad spectrum of good and evil that is explored in the book.  To celebrate the new publication, Hinterlands will be giving away THE WARDOG’S COIN for free on Amazon tomorrow and Friday.</br></p></div>",
  "content_text": "I am pleased to announce that Marcher Lord Hinterlands has released\nTHE LAST WITCHKING\n,\na 105-page ebook that consists of the title novelette and two short stories, all three of of which are set in Selenoth, the world of A THRONE OF BONES.  It\nis now available from Amazon for $1.99.\nThe title story concerns the hidden heir to a fallen race of magicians,\nthe infamous Witchkings, who delves deep into his father’s dark lore as he pursues vengeance against the elves and men responsible for destroying his people.  The second story, “The Hoblets of Wiccam\nFensboro”, is a tale of survival and the triumph of simple human decency\nin the face of brutality and defeat. The third story, “Opera Vita\nAeterna”, tells the story of the relationship between an elven sorcerer and a monk of the Ordo Sancti Dioscuri, and\nhow they discover that the transformational power of friendship can be the\nhighest and most potent magic of all.  The third story also features a brief appearance by one of the perspective characters from A THRONE OF BONES.\nThanks\nto Jartstar, who did another excellent job on the cover.  We wanted to go for a different look this time, one that hinted at the broad spectrum of good and evil that is explored in the book.  To celebrate the new publication, Hinterlands will be giving away THE WARDOG’S COIN for free on Amazon tomorrow and Friday.",
  "tags": [
    "books",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-01T18:30:00+00:00"
}