{
  "url": "https://voxday.net/2013/05/18/the-scam-collapses/",
  "scraped_at": "2025-12-14T22:29:22.124263",
  "title": "The scam collapses",
  "date_display": "May 18, 2013",
  "date_iso": "2013-05-18T13:00:00+00:00",
  "date_from_url": "2013-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is becoming gradually clear, even to the True Believers in the Scientific Consensus, that <a href=\"http://esr.ibiblio.org/?p=4873#more-4873\">the Global Warming Fairy isn’t arriving</a> after all:</p><blockquote class=\"tr_bq\"><p> The Economist, which (despite a recent decline) remains probably the<br> best news magazine in the English language, now admits that (a) global<br> average temperature has been flat for 15 years even as CO2 levels have<br> been rising rapidly, (b) surface temperatures are at the lowest edge of<br> the range predicted by IPCC climate models, (c) on current trends, they<br> will soon fall clean outside and below the model predictions, (c)<br> estimates of climate sensitivity need revising downwards, and (d)<br> something, probably multiple things, is badly wrong with AGW climate<br> models.</br></br></br></br></br></br></br></br></p></blockquote><p>Something is badly wrong with AGW climate models?  You don’t say.  It won’t be long before they’ll be similarly admitting that there is something badly wrong with the TENS models… or at least, they would if such models even existed.</p><p>Talk of “global warming” and even “climate change” has become so sparse these days that I actually had to dust off the post label.</p></div>",
  "content_text": "It is becoming gradually clear, even to the True Believers in the Scientific Consensus, that\nthe Global Warming Fairy isn’t arriving\nafter all:\nThe Economist, which (despite a recent decline) remains probably the\nbest news magazine in the English language, now admits that (a) global\naverage temperature has been flat for 15 years even as CO2 levels have\nbeen rising rapidly, (b) surface temperatures are at the lowest edge of\nthe range predicted by IPCC climate models, (c) on current trends, they\nwill soon fall clean outside and below the model predictions, (c)\nestimates of climate sensitivity need revising downwards, and (d)\nsomething, probably multiple things, is badly wrong with AGW climate\nmodels.\nSomething is badly wrong with AGW climate models?  You don’t say.  It won’t be long before they’ll be similarly admitting that there is something badly wrong with the TENS models… or at least, they would if such models even existed.\nTalk of “global warming” and even “climate change” has become so sparse these days that I actually had to dust off the post label.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-18T12:00:00+00:00"
}