{
  "url": "https://voxday.net/2013/05/01/the-one-million-mon/",
  "scraped_at": "2025-12-14T22:27:39.876572",
  "title": "The One Million month",
  "date_display": "May 1, 2013",
  "date_iso": "2013-05-01T17:00:00+00:00",
  "date_from_url": "2013-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thanks very much to everyone who visited here in April, especially those who took the time to get involved in the various discussions in the comments.  I remember scoffing when ten years ago a reader predicted that this blog would one day have a million pageviews in a year, so it seems incredible to me that VP and AG now see that level of traffic in a single month. </p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://1.bp.blogspot.com/-QnsIcNtU7is/UYDRzluPHNI/AAAAAAAAAcg/KwaFDmcJ2Os/s1600/AG+VP_11-13.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"330\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/05/AG-VP_11-13.png\" width=\"640\"/></a></div><p>With a few notable exceptions, most blogs hide their traffic reports these days, but I think this is a tactical blunder.  The primary problem with doing so is that it allows the Left to dishonestly attempt to marginalize right-wing blogs in the eyes of others.  Recall that I have been portrayed for ten years as an extremist whack-job whose writing no one ever read even as the readership steadily grew, and I was regularly reminded that PZ Myers, John Scalzi, and a number of other left-wing bloggers had much bigger blog readerships than I did… until <a href=\"http://www.milobookclub.com/2013/01/02/how-you-like-them-sour-grapes/\">it was revealed late last year</a> that the traffic here alone, (never mind that of the  WND columns that those bloggers were reading and attacking), passed up some of those blogs <i>almost two years ago!</i>  Never forget, the Left is heavily dependent upon lies, and one of their biggest lies, perhaps the one to which they resort the most readily, concerns their pretense that their opinions enjoy much more popularity than they actually do.  Therefore, the more metrics that are visible to everyone, the less they can get away with it.</p><p>That is why I make my Sitemeter and Google Analytics statistics public.  (VP uses the old template, which is why there is no monthly traffic widget in the sidebar as is the case with AG.) That’s why I’ve begun a quarterly <a href=\"http://alphagameplan.blogspot.com/2013/04/top-10-game-blogs.html\">Top 10 Game blogs</a> report that I expect to expand to a Top 25 report in the second quarter. That’s why I encourage everyone who is in any way sympathetic to the neoreactionary traditional Relightenment to be open and public with their statistics. The truth is on our side. Victory through data!</p><p>Let’s face it, it is very difficult for the rabbits of Whatever to continue to claim that the Chief Gamma Rabbit of their warren is a vastly influential individual, or that their sick transquax-gendered view of human intersexual relations is the mainstream perspective, when everyone now realizes that Whatever has only two-thirds the traffic of my blogs and one-quarter that of the Great Prophet of the Crimson Arts.  Open metrics make it clear that it is the influential Cathedralites such as Jim Hines (Alexa Rank 729,110) and Making Light (375,254), who are actually the marginal ones. Despite their artificially elevated positions in the field of SF/F, they cannot maintain sizable blog readerships, not even with the benefit of occasional puffing by their ideological allies in the mainstream media.  They may be big fish, but they are big fish in a much smaller pond than the ocean they try to claim.</p><p>It’s not that their opinions aren’t relevant or that no one shares them, it is merely that their perspective is nowhere nearly as dominant as they are desperate to have you believe.  They can run from debate, they can refuse to permit substantive criticism, they can wield their banhammers to hide from even semblance of genuine discourse on their sites, but the one thing they cannot avoid is the harsh light of statistical reality exposing their pretensions.</p><p>It is ludicrous to imagine that it is popular writers such as Sarah Hoyt and Larry Correia who are the societal outsiders when their influence is an order of magnitude or more larger than most of the supposed “big names” in modern SF/F.   Sure, the Cathredralites sell more books and appear more often in the mainstream media, for the time being, because their capture of the genre’s gatekeepers means they control access to its media and distribution channels. But what we are seeing now is the early stages of a Fox News-style transformation in the SF/F industry, as new media outlets and new transmission channels is in the process of seriously upending the tilted playing field.  The cultural battle in SF/F isn’t over, as the self-appointed winners would have you believe, the heavy cavalry is just beginning to enter the field and the unarmored footmen without shields are quaking.</p><p>However, the fact that the Left is wrong about equality, wrong about economics, wrong about the past, and wrong about the future does not mean there is nothing that we of the Right cannot learn from them.  The one thing the Left does very, very well is the force-multiplication of its various assets, no matter how small and insignificant they truly are, and that is something that the neoreactionary Right will have to learn in order to mitigate the damage our progressive counterparts have inflicted upon us and upon themselves.  That’s why I’ve created the Standout Authors and Friends of Narnia, and I encourage other writers and bloggers of the Right to devote at least some effort to building up others of the Right even as they continue to pursue their own diverse and independent ambitions.</p><p>Consider that Prospect Magazine declared the top World Thinkers of 2013 on the basis of 10,000 votes.  10,000 votes!   That’s nothing, and yet the Left will gravely – and absurdly – pretend, on that basis, that Richard Dawkins is widely considered to be the greatest intellectual of our time. </p><p>We can do better. We should do better. We will do better.</p></div>",
  "content_text": "Thanks very much to everyone who visited here in April, especially those who took the time to get involved in the various discussions in the comments.  I remember scoffing when ten years ago a reader predicted that this blog would one day have a million pageviews in a year, so it seems incredible to me that VP and AG now see that level of traffic in a single month.\nWith a few notable exceptions, most blogs hide their traffic reports these days, but I think this is a tactical blunder.  The primary problem with doing so is that it allows the Left to dishonestly attempt to marginalize right-wing blogs in the eyes of others.  Recall that I have been portrayed for ten years as an extremist whack-job whose writing no one ever read even as the readership steadily grew, and I was regularly reminded that PZ Myers, John Scalzi, and a number of other left-wing bloggers had much bigger blog readerships than I did… until\nit was revealed late last year\nthat the traffic here alone, (never mind that of the  WND columns that those bloggers were reading and attacking), passed up some of those blogs\nalmost two years ago!\nNever forget, the Left is heavily dependent upon lies, and one of their biggest lies, perhaps the one to which they resort the most readily, concerns their pretense that their opinions enjoy much more popularity than they actually do.  Therefore, the more metrics that are visible to everyone, the less they can get away with it.\nThat is why I make my Sitemeter and Google Analytics statistics public.  (VP uses the old template, which is why there is no monthly traffic widget in the sidebar as is the case with AG.) That’s why I’ve begun a quarterly\nTop 10 Game blogs\nreport that I expect to expand to a Top 25 report in the second quarter. That’s why I encourage everyone who is in any way sympathetic to the neoreactionary traditional Relightenment to be open and public with their statistics. The truth is on our side. Victory through data!\nLet’s face it, it is very difficult for the rabbits of Whatever to continue to claim that the Chief Gamma Rabbit of their warren is a vastly influential individual, or that their sick transquax-gendered view of human intersexual relations is the mainstream perspective, when everyone now realizes that Whatever has only two-thirds the traffic of my blogs and one-quarter that of the Great Prophet of the Crimson Arts.  Open metrics make it clear that it is the influential Cathedralites such as Jim Hines (Alexa Rank 729,110) and Making Light (375,254), who are actually the marginal ones. Despite their artificially elevated positions in the field of SF/F, they cannot maintain sizable blog readerships, not even with the benefit of occasional puffing by their ideological allies in the mainstream media.  They may be big fish, but they are big fish in a much smaller pond than the ocean they try to claim.\nIt’s not that their opinions aren’t relevant or that no one shares them, it is merely that their perspective is nowhere nearly as dominant as they are desperate to have you believe.  They can run from debate, they can refuse to permit substantive criticism, they can wield their banhammers to hide from even semblance of genuine discourse on their sites, but the one thing they cannot avoid is the harsh light of statistical reality exposing their pretensions.\nIt is ludicrous to imagine that it is popular writers such as Sarah Hoyt and Larry Correia who are the societal outsiders when their influence is an order of magnitude or more larger than most of the supposed “big names” in modern SF/F.   Sure, the Cathredralites sell more books and appear more often in the mainstream media, for the time being, because their capture of the genre’s gatekeepers means they control access to its media and distribution channels. But what we are seeing now is the early stages of a Fox News-style transformation in the SF/F industry, as new media outlets and new transmission channels is in the process of seriously upending the tilted playing field.  The cultural battle in SF/F isn’t over, as the self-appointed winners would have you believe, the heavy cavalry is just beginning to enter the field and the unarmored footmen without shields are quaking.\nHowever, the fact that the Left is wrong about equality, wrong about economics, wrong about the past, and wrong about the future does not mean there is nothing that we of the Right cannot learn from them.  The one thing the Left does very, very well is the force-multiplication of its various assets, no matter how small and insignificant they truly are, and that is something that the neoreactionary Right will have to learn in order to mitigate the damage our progressive counterparts have inflicted upon us and upon themselves.  That’s why I’ve created the Standout Authors and Friends of Narnia, and I encourage other writers and bloggers of the Right to devote at least some effort to building up others of the Right even as they continue to pursue their own diverse and independent ambitions.\nConsider that Prospect Magazine declared the top World Thinkers of 2013 on the basis of 10,000 votes.  10,000 votes!   That’s nothing, and yet the Left will gravely – and absurdly – pretend, on that basis, that Richard Dawkins is widely considered to be the greatest intellectual of our time.\nWe can do better. We should do better. We will do better.",
  "tags": [
    "politics",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-01T16:00:00+00:00"
}