{
  "url": "https://voxday.net/2013/05/11/to-printers/",
  "scraped_at": "2025-12-14T22:28:38.580410",
  "title": "To the printers",
  "date_display": "May 11, 2013",
  "date_iso": "2013-05-11T13:00:00+00:00",
  "date_from_url": "2013-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am sorry for the delay in getting the new <i>Summa Elvetica</i> out the door.  We had some technical errors caused by a domain transfer problem, did an extra round of errata-hunting edits to ensure a much cleaner text than before, and since the book ended up being a few more pages than anticipated, another revision of the dustjacket turned out to be required.  But it is now off to the printers and should be reaching to those who preordered sometime the week after next.</p><p><a href=\"http://1.bp.blogspot.com/-hHdQQiDI6Mk/UY4AVBi9TgI/AAAAAAAAAdE/p1JX3o5ZFkg/s1600/SEjacket.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"281\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/05/SEjacket.png\" width=\"400\"/></a>We may or may not do an ebook version, as all of the stories the hardcover contains are already available in ebook format.  So, if you want the complete-to-date collection of Selenoth stories, this would be your book to go with <i>A THRONE OF BONES</i>.  Kirk redid the spine, so, although it is not part of the Arts of Dark and Light series proper, SE+ should at least look tangentially related next to them on the bookshelf.</p><p>The book is a 6×9 hardcover of 488 pages, priced at $25.99.  It contains <i>Summa Elvetica</i>, eight other novellas, novelettes, and short stories, and a very slightly updated map.</p><p>It’s been interesting to see how people’s opinion of SE has changed a little since the publication of <i>A THRONE OF BONES</i>, including my own. What didn’t necessarily work all that well as a full-fledged novel in its own right actually holds up rather nicely as a part of the larger series.  Even though I didn’t see it at the time, it seems Jamsco was correct to observe that it held the seeds of something bigger and better all along.</p><p>The thing that I find a little astonishing is that with the publication of SE+, the total page count of the complete Selenoth collection now exceeds that of <i>The Lord of the Rings</i>, 1,342 to 1,147.<i>(1)</i> Now, of course, that doesn’t include <i>The Hobbit</i>, <i>The Simarillion</i>, or the various lost tales.  And Selenoth will never rival Middle Earth, although I do hope it will eventually come to surpass Westeros, Malazan, Randland, and the Four Lands.</p><p><i>(1) Knowing that someone was bound to raise the typography issue, I went ahead and tabulated the word counts. They are virtually identical at this point, with a slight edge to LOTR at 475,202 as Selenoth is presently at 471,387.</i></p></div>",
  "content_text": "I am sorry for the delay in getting the new\nSumma Elvetica\nout the door.  We had some technical errors caused by a domain transfer problem, did an extra round of errata-hunting edits to ensure a much cleaner text than before, and since the book ended up being a few more pages than anticipated, another revision of the dustjacket turned out to be required.  But it is now off to the printers and should be reaching to those who preordered sometime the week after next.\nWe may or may not do an ebook version, as all of the stories the hardcover contains are already available in ebook format.  So, if you want the complete-to-date collection of Selenoth stories, this would be your book to go with\nA THRONE OF BONES\n.  Kirk redid the spine, so, although it is not part of the Arts of Dark and Light series proper, SE+ should at least look tangentially related next to them on the bookshelf.\nThe book is a 6×9 hardcover of 488 pages, priced at $25.99.  It contains\nSumma Elvetica\n, eight other novellas, novelettes, and short stories, and a very slightly updated map.\nIt’s been interesting to see how people’s opinion of SE has changed a little since the publication of\nA THRONE OF BONES\n, including my own. What didn’t necessarily work all that well as a full-fledged novel in its own right actually holds up rather nicely as a part of the larger series.  Even though I didn’t see it at the time, it seems Jamsco was correct to observe that it held the seeds of something bigger and better all along.\nThe thing that I find a little astonishing is that with the publication of SE+, the total page count of the complete Selenoth collection now exceeds that of\nThe Lord of the Rings\n, 1,342 to 1,147.\n(1)\nNow, of course, that doesn’t include\nThe Hobbit\n,\nThe Simarillion\n, or the various lost tales.  And Selenoth will never rival Middle Earth, although I do hope it will eventually come to surpass Westeros, Malazan, Randland, and the Four Lands.\n(1) Knowing that someone was bound to raise the typography issue, I went ahead and tabulated the word counts. They are virtually identical at this point, with a slight edge to LOTR at 475,202 as Selenoth is presently at 471,387.",
  "tags": [
    "books",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-11T12:00:00+00:00"
}