{
  "url": "https://voxday.net/2013/05/01/who-when-how-unique-nature-of-sf/",
  "scraped_at": "2025-12-14T22:27:36.205204",
  "title": "Who, When, How: the unique nature of SF",
  "date_display": "May 1, 2013",
  "date_iso": "2013-05-01T08:12:00+00:00",
  "date_from_url": "2013-05-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright contemplates <a href=\"http://www.scifiwright.com/2013/04/what-fools-these-mortals-be/\">what separates SF from all other forms of fiction</a>, and in doing so, helps delineate the intrinsic difference between science fiction and fantasy as well as why science fiction has increasingly been transformed into fantasy as more women entered the field:</p><blockquote class=\"tr_bq\"><p> Aliens are unique to science fiction.</p><p>In no story about detectives solving a murder or heiresses wondering<br> what baron to wed will you find anything told from the point of view of a<br> nonhuman intelligent creature. All other genres, from Westerns to War<br> Stories to Historical drama to mainstream tales about college professors<br> cheating on their wives, are told from within the human realm of human<br> nature and can never leave it. In science fiction and in science fiction<br> alone is there an opportunity to step outside the human realm, and<br> turn, and look, and to see the mask of man from the outside.  Only in<br> science fiction can we speculate on what humans look like to intelligent<br> nonhumans….</br></br></br></br></br></br></br></br></br></p><p>If the task is feasible then science fiction is the only place to go, the only vantage where to stand, to look at mankind, because it and it alone steps away and turns and looks at humanity from the outside.</p><p>Before we address that broader question, the gentle reader may be contemplating at least two objections to the bold statement that examining man from a viewpoint outside man is unique to science fiction.</p><p>The first is that fantasy stories, myths, fairytales, Aesop’s fables and stories about animals, from Lassie to Black Beauty to Bambi, involve imagining what human beings might look like seen from the viewpoint of gods or sprites, ghosts or talking animals, or dumb animals. It would be odd indeed to classify BAMBI or FINDING NEMO or HAPPY FEET as “science fiction” and yet the audience for those tales sees human beings only from the beast’s-eye view. In the oldest poem in the West, THE ILIAD, many a scene is told from the coign of vantage of the Olympian gods. The far-famed Wagner’s Ring Cycle is told mostly from the point of view of gods and dark elves, giants and river nymphs, valkyries and so on: Indeed, in the first opera of the cycle, DAS RHEINGOLD, there is not a single human character on stage at any time.  The first objection, then, is simply that the statement is not true: many stories look at man from outside.</p><p>The second objection is subtler: all stories by their nature take the reader out from his own personal viewpoint. That is the core of what the story-telling imagination is, and what it does. Reading GONE WITH THE WIND as if by magic transforms the reader into the rich and willful daughter of a slaveholding Irish plantation owner; WAR AND PEACE transforms the reader into any number of Russian nobles and serfs in the midst of the Napoleonic wars; in SIEGFRIED, we become a young hero raised by a treacherous dwarf, destined to forge his father’s sword to slay a dire dragon, and win the love of an exiled goddess and the gold the world craves; in BAMBI, we become a deer; in WATERSHIP DOWN, a rabbit.</p><p>The second objection, in other words, is that science fiction is not only not unique in taking us outside our own viewpoint, but that this act of imaginative self-departure is ubiquitous and essential to all story-telling. If the reader can look at the world from another set of eyes, what does it matter whether the reader is transformed for an hour into a Southern Planter, a Russian Boyar, a Germanic Hero, or an English Hare?</p><p>Science fiction (so the objection runs) is doing something no different from any other genre, and indeed, does something less useful, because, unlike Southern Planters and Russian Nobles, the Vulcan scientist or Klingon warrior or green-skinned Orion slavegirl simply does not exist.</p><p>Imaging life from the point of view of a stranger or an enemy may have the benevolent real-world side effect of increasing my sympathy and brotherly love for him, and affirming our common humanity. Whether or not there is any common humanity with the Mollusk Men of Mars, or the Sorns, or the Tharks, or the Old Ones, there is little point in the reader learning how to step by an act of imagination into the shoes of these inhabitants of the Red Planet, because neither do they exist, and even did they, none of them wears shoes.</p><p>In sum, the second objection is that looking at ourselves from outside is what all story telling does, so science fiction is not unique; and looking at ourselves from the point of view of characters who resemble real people serves a useful real world purpose of engendering empathy with others.</p><p>The answer to the second objection is simple: Empathy is engendered by the care and skill of the portrayal, no matter who is portrayed. Whether or not the person portrayed is real or unreal means nothing.</p><p>Scarlet O’Hara of Tara is no more nor less real than Thweel the Martian. Both exist in the imagination only. Both have a relation to reality that is symbolic or emotional. When the nonhuman creature of the Genii in Disney’s ALADDIN yearns for the manacles to be struck from his wrists, and his bondage to end, all spirits longing for liberty understands precisely how he feels, because the emotion is the same in the real as in the unreal circumstances. When the completely unrealistic Siegfried, raised by a magical dwarf in a cave, yearns for the mother he has never known, it is not less poignant than the similar yearning by Oliver Twist, because both are orphans. When Bambi suffers the same loss and longing when his mother is shot by hunters, no skeptic is so foolish as to object that this scene is not moving and melancholy on the grounds that, unlike Siegfried and Oliver, deer cannot put their emotions of filial love for their mother into words, nor can they weep tears.</p><p>The answer to the second objection, in other words, is that it is the act of exercising the imagination which is the beauty and the justification for story-telling.</p><p>By the nature of imagination, the thing imagined is not real. It can be closer to reality or less close, more realistic or more fanciful, but this degree of realism has little or nothing to do with how well the scene draws the reader out of himself, and how firmly he finds himself planted in the shoes of an orphaned boy or, for that matter, an orphaned fawn.</p><p>A realistic scene portrayed without craft or genius does not engage the imagination and therefore fails as an exercise of the story-telling art; an unrealistic scene, even one involving magical beings or talking animals, which is told with craft and skill does indeed engage the imagination, and does indeed accomplish the feat that story-tellers are commanded by the muses to attempt.</p><p>The answer to the first objection is not so simple, for it involves a subtle distinction between what seem to be twins.</p><p>How is a Martian different from a Dark Elf?</p></blockquote><p>People often attempt to distinguish SF from F on the basis of one being a literature of technology and ideas versus the other being a literature of magic and people, but I think Wright’s point about the dividing line being the one between intellect and emotion is cogent and arguably the more convincing.  While there are intellectual strains in many fantasy novels, such as the financial struggles in Westeros(1) or the military logistics in Selenoth, at the end of the day, the focus in these books is as every bit as emotional as the average urban fantasy featuring a necro-bestial love triangle.  The primary appeal of A Song of Ice and Fire, Arts of Dark and Light, and every fantasy since Narnia and Middle Earth is the emotional one of experiencing what it might be like to dwell in those imaginary lands.  It is the appeal of the What and the Why.</p><p>A science fiction novel, on the other hand, concerns the intellectual appeal of posing and answering questions that do not involve feeling. It is the appeal of the Who, the When, and the How.  Which is how it is possible to insist, with a straight face, that one can write a science fiction novel about angels as well as a fantasy novel about scientists.</p><p>Wright says it all considerably better than I possibly can, so just go there and read the entire thing.  And perhaps unintentionally, he implicitly explains why reading chick lit can, to the average man, very nearly approach the experience of reading science fiction.</p><p> (1) In watching A Game of Thrones the other night, I suddenly found myself getting mildly irritated BECAUSE of the financial verisimilitude involved in Tyrion’s attempt to pay for the royal wedding.  While I appreciated the practical realism of the problem as well as the impact it had on the plot, it suddenly occurred to me that Martin engages in a certain amount of handwaving with regards to the economies of the great families.  The Lannisters are unthinkably rich because they have a gold mine and collect taxes in Lannisport and the Westerlands?  Marcus Licinius Crassus laughed. And House Tyrell is very nearly as rich because they have a large quantity of farmland?  Both families are wealthy, to be sure, but the sources of their wealth are not nearly sufficient in historical terms to fund the size of the military activities in which they are engaged.</p></div>",
  "content_text": "John C. Wright contemplates\nwhat separates SF from all other forms of fiction\n, and in doing so, helps delineate the intrinsic difference between science fiction and fantasy as well as why science fiction has increasingly been transformed into fantasy as more women entered the field:\nAliens are unique to science fiction.\nIn no story about detectives solving a murder or heiresses wondering\nwhat baron to wed will you find anything told from the point of view of a\nnonhuman intelligent creature. All other genres, from Westerns to War\nStories to Historical drama to mainstream tales about college professors\ncheating on their wives, are told from within the human realm of human\nnature and can never leave it. In science fiction and in science fiction\nalone is there an opportunity to step outside the human realm, and\nturn, and look, and to see the mask of man from the outside.  Only in\nscience fiction can we speculate on what humans look like to intelligent\nnonhumans….\nIf the task is feasible then science fiction is the only place to go, the only vantage where to stand, to look at mankind, because it and it alone steps away and turns and looks at humanity from the outside.\nBefore we address that broader question, the gentle reader may be contemplating at least two objections to the bold statement that examining man from a viewpoint outside man is unique to science fiction.\nThe first is that fantasy stories, myths, fairytales, Aesop’s fables and stories about animals, from Lassie to Black Beauty to Bambi, involve imagining what human beings might look like seen from the viewpoint of gods or sprites, ghosts or talking animals, or dumb animals. It would be odd indeed to classify BAMBI or FINDING NEMO or HAPPY FEET as “science fiction” and yet the audience for those tales sees human beings only from the beast’s-eye view. In the oldest poem in the West, THE ILIAD, many a scene is told from the coign of vantage of the Olympian gods. The far-famed Wagner’s Ring Cycle is told mostly from the point of view of gods and dark elves, giants and river nymphs, valkyries and so on: Indeed, in the first opera of the cycle, DAS RHEINGOLD, there is not a single human character on stage at any time.  The first objection, then, is simply that the statement is not true: many stories look at man from outside.\nThe second objection is subtler: all stories by their nature take the reader out from his own personal viewpoint. That is the core of what the story-telling imagination is, and what it does. Reading GONE WITH THE WIND as if by magic transforms the reader into the rich and willful daughter of a slaveholding Irish plantation owner; WAR AND PEACE transforms the reader into any number of Russian nobles and serfs in the midst of the Napoleonic wars; in SIEGFRIED, we become a young hero raised by a treacherous dwarf, destined to forge his father’s sword to slay a dire dragon, and win the love of an exiled goddess and the gold the world craves; in BAMBI, we become a deer; in WATERSHIP DOWN, a rabbit.\nThe second objection, in other words, is that science fiction is not only not unique in taking us outside our own viewpoint, but that this act of imaginative self-departure is ubiquitous and essential to all story-telling. If the reader can look at the world from another set of eyes, what does it matter whether the reader is transformed for an hour into a Southern Planter, a Russian Boyar, a Germanic Hero, or an English Hare?\nScience fiction (so the objection runs) is doing something no different from any other genre, and indeed, does something less useful, because, unlike Southern Planters and Russian Nobles, the Vulcan scientist or Klingon warrior or green-skinned Orion slavegirl simply does not exist.\nImaging life from the point of view of a stranger or an enemy may have the benevolent real-world side effect of increasing my sympathy and brotherly love for him, and affirming our common humanity. Whether or not there is any common humanity with the Mollusk Men of Mars, or the Sorns, or the Tharks, or the Old Ones, there is little point in the reader learning how to step by an act of imagination into the shoes of these inhabitants of the Red Planet, because neither do they exist, and even did they, none of them wears shoes.\nIn sum, the second objection is that looking at ourselves from outside is what all story telling does, so science fiction is not unique; and looking at ourselves from the point of view of characters who resemble real people serves a useful real world purpose of engendering empathy with others.\nThe answer to the second objection is simple: Empathy is engendered by the care and skill of the portrayal, no matter who is portrayed. Whether or not the person portrayed is real or unreal means nothing.\nScarlet O’Hara of Tara is no more nor less real than Thweel the Martian. Both exist in the imagination only. Both have a relation to reality that is symbolic or emotional. When the nonhuman creature of the Genii in Disney’s ALADDIN yearns for the manacles to be struck from his wrists, and his bondage to end, all spirits longing for liberty understands precisely how he feels, because the emotion is the same in the real as in the unreal circumstances. When the completely unrealistic Siegfried, raised by a magical dwarf in a cave, yearns for the mother he has never known, it is not less poignant than the similar yearning by Oliver Twist, because both are orphans. When Bambi suffers the same loss and longing when his mother is shot by hunters, no skeptic is so foolish as to object that this scene is not moving and melancholy on the grounds that, unlike Siegfried and Oliver, deer cannot put their emotions of filial love for their mother into words, nor can they weep tears.\nThe answer to the second objection, in other words, is that it is the act of exercising the imagination which is the beauty and the justification for story-telling.\nBy the nature of imagination, the thing imagined is not real. It can be closer to reality or less close, more realistic or more fanciful, but this degree of realism has little or nothing to do with how well the scene draws the reader out of himself, and how firmly he finds himself planted in the shoes of an orphaned boy or, for that matter, an orphaned fawn.\nA realistic scene portrayed without craft or genius does not engage the imagination and therefore fails as an exercise of the story-telling art; an unrealistic scene, even one involving magical beings or talking animals, which is told with craft and skill does indeed engage the imagination, and does indeed accomplish the feat that story-tellers are commanded by the muses to attempt.\nThe answer to the first objection is not so simple, for it involves a subtle distinction between what seem to be twins.\nHow is a Martian different from a Dark Elf?\nPeople often attempt to distinguish SF from F on the basis of one being a literature of technology and ideas versus the other being a literature of magic and people, but I think Wright’s point about the dividing line being the one between intellect and emotion is cogent and arguably the more convincing.  While there are intellectual strains in many fantasy novels, such as the financial struggles in Westeros(1) or the military logistics in Selenoth, at the end of the day, the focus in these books is as every bit as emotional as the average urban fantasy featuring a necro-bestial love triangle.  The primary appeal of A Song of Ice and Fire, Arts of Dark and Light, and every fantasy since Narnia and Middle Earth is the emotional one of experiencing what it might be like to dwell in those imaginary lands.  It is the appeal of the What and the Why.\nA science fiction novel, on the other hand, concerns the intellectual appeal of posing and answering questions that do not involve feeling. It is the appeal of the Who, the When, and the How.  Which is how it is possible to insist, with a straight face, that one can write a science fiction novel about angels as well as a fantasy novel about scientists.\nWright says it all considerably better than I possibly can, so just go there and read the entire thing.  And perhaps unintentionally, he implicitly explains why reading chick lit can, to the average man, very nearly approach the experience of reading science fiction.\n(1) In watching A Game of Thrones the other night, I suddenly found myself getting mildly irritated BECAUSE of the financial verisimilitude involved in Tyrion’s attempt to pay for the royal wedding.  While I appreciated the practical realism of the problem as well as the impact it had on the plot, it suddenly occurred to me that Martin engages in a certain amount of handwaving with regards to the economies of the great families.  The Lannisters are unthinkably rich because they have a gold mine and collect taxes in Lannisport and the Westerlands?  Marcus Licinius Crassus laughed. And House Tyrell is very nearly as rich because they have a large quantity of farmland?  Both families are wealthy, to be sure, but the sources of their wealth are not nearly sufficient in historical terms to fund the size of the military activities in which they are engaged.",
  "tags": [
    "Standout Authors",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-05-01T07:12:00+00:00"
}