{
  "url": "https://voxday.net/2010/03/18/and-they-wonder-why-we-laug/",
  "scraped_at": "2026-01-08T23:22:16.281411",
  "title": "And they wonder why we laugh",
  "date_display": "March 18, 2010",
  "date_iso": "2010-03-18T10:54:00+00:00",
  "date_from_url": "2010-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No woman who is incapable of figuring out that Time always outruns Beauty in the end can reasonably be considered intelligent.  Consider <a href=\"http://www.elle.com/Life-Love/Sex-Relationships/Failure-to-Launch-When-Beauty-Fades\">Elizabeth Wurtzel’s lament</a> that while beauty fades, loneliness lasts:</p><blockquote><p>When I was still in my twenties, for several years I had this wonderful boyfriend; I’ll call him Gregg—he’s the one we’re all waiting for: tall, blue-eyed, with this thick black hair, all smart and sensitive, an inveterate graduate student who used to rub my feet at the end of the day with a lovely pink peppermint lotion from the Body Shop. It was young and romantic. You’d have thought we were happy. I think really we were happy. He was good for me: People met him and liked me better because I was going out with him; his sweetness redounded to me like a sunny day on a dark sidewalk. I could have and probably should have spent the rest of my life with him…. I became seasick with contentment. It was nauseating daily, and I couldn’t still myself against a funny feeling that there had to be more to life than waking up every day beside the same person. To say I was bored would be to misunderstand boredom: I did not need to take up table tennis or ballroom dancing—I needed a sense that this wasn’t the end of the story. The idea of forever with any single person, even someone great whom I loved so much like Gregg, really did seem like what death actually is: a permanent stop….</p><p>Age is a terrible avenger. The lessons of life give you so much to work with, but by the time you’ve got all this great wisdom, you don’t get to be young anymore. And in this world, that’s just about the worst thing that can happen—especially to a woman. Whoever said youth is wasted on the young actually got it wrong; it’s more that maturity is wasted on the old.</p></blockquote><p>The single most amusing thing about the women of modernity is that in their pursuit of finding happiness through imitating masculinity, they have forgotten that most basic of market principle: buy low, sell high.  Time is not cruel, but it is both indifferent and inexorable.  In almost every circumstance, the women that I have seen turn down good men of suitable quality who wanted to marry them in their early and middle twenties wound up settling for lower quality men in their late twenties and thirties.  And they are the fortunate and happy ones; those who are still unmarried and childless in their early forties are nearly all full of regrets for the various opportunities they either rejected or simply allowed to pass them by.</p><p>The root problem seems to be that women are horrifically bad at anticipating what they are going to want in the future.  The usual female pattern proceeds thusly:  In her teens, a woman wants to focus on her education and having fun through a series of practice relationships.  Her main concern is actually how much admiration she generates from men and her concomitant status among women.  In her early to middle twenties, she wants to focus on her job and having fun through sampling a variety of penises; her main concern is actually not getting tied down to any commitments, professional or personal.  In both stages A and B, she will swear up and down that she doesn’t ever want to have children for some nonsensical reason or another, although she is open to getting married someday off in the distant and nebulous future.</p><p>Stage C begins when her friends start getting engaged, usually in her late-twenties.  Then she decides that she might be “okay” with one or two children and begins a desultory search for a marriageable man.  However, this search is usually interrupted by a series of disastrous affairs with various Alphas, bad boys, and marriage-allergic men.  She often talks about how confused she is and has no coherent focus; her main concern is to maintain her social equivalency with her female friends.  At this point, the smarter women settle down and get married to the best available man since their marriage value is still high enough that they can attract a man of reasonable quality.  The more foolish women convince themselves that they are even more attractive than they were in their early twenties due to their educations and careers and decide they have another decade before they “have to settle”.</p><p>Stage D is the early to middle thirties.  A detectable edge of desperation begins to set in; you will seldom talk to a woman in her thirties who does not bring up science out of the blue and and ramble on about how it will allow her to have children in her forties.  She is often in total denial about the decline in her market value and often wastes years dating higher quality men who are not actually on the marriage market.  Her focus is now getting married as soon as possible so she can still have children, however, her inability to properly value herself causes her to pass over the sort of men who are actually willing to settle for her.</p><p>Elizabeth Wurtzel is in stage E.  She is past her prime, she knows she is past it, and she is now regretting the potential husband she foolishly threw away in stage C.  Her focus is now on finding a husband, although she knows it is probably too late for children.  She appears destined to be a Stage F failure, also known as a Companion to Many Cats.  This is not a worthless societal role, or necessarily an undignified one, but it is not one that most young women in their teens dream about.</p><p>The basic problem of female self-valuation is compounded by the challenge posed by the male Madonna-Whore division.  What is attractive to a man on a short term basis is not necessarily attractive to a man on a long term basis.  I would estimate that a woman can expect to regularly attract men who are two points higher in Whore mode than she can in Madonna mode.  If you’re a 20 year-old seven who regularly has flings with men you rate as eights and nines, you should actively look for marriage material among the men you would rate as fives to sevens.  This will significantly increase your chances of long term success; remember that in 15 years you are going to be a five, not a seven, while that five that you find barely attractive now has the potential to move up to a six or even a seven on the scale due to the way women value financial success and social substance over physical looks.</p><p>There are always outliers, of course.  And the progression I describe obviously doesn’t apply to all women.  There are even a few lucky women who are more attractive in Stage C than in Stage A or B.  But in general, a woman will be well served by applying the buy low, sell high principle and marrying a man who is between five and ten years older before she reaches the age of 25.  And above all, remember that what you think you will want in ten years is almost surely not what you will actually want in ten years and that drama is much more entertaining on television than it is in real life.</p><p>And this comment really says it all: <i>“I was shocked at my visceral response to reading this column. I cried uncontrollably. I’m tearing up as I type this comment. There are so many reasons why Elizabeth’s story had such an effect on me….  I spent my entire life working towards my career and then lost it in the blink of an eye. Meanwhile, men were basically play things coming in and out of my life.  (Think Samantha; Sex and the City.) I was never the relationship type. My longest relationship lasted a year during my junior year of college. That was 20 years ago. Now, I’ll be 40 in July.”</i></p><p>Yes, I’m not ashamed to admit it.  I laughed, I did.</p></div>",
  "content_text": "No woman who is incapable of figuring out that Time always outruns Beauty in the end can reasonably be considered intelligent.  Consider\nElizabeth Wurtzel’s lament\nthat while beauty fades, loneliness lasts:\nWhen I was still in my twenties, for several years I had this wonderful boyfriend; I’ll call him Gregg—he’s the one we’re all waiting for: tall, blue-eyed, with this thick black hair, all smart and sensitive, an inveterate graduate student who used to rub my feet at the end of the day with a lovely pink peppermint lotion from the Body Shop. It was young and romantic. You’d have thought we were happy. I think really we were happy. He was good for me: People met him and liked me better because I was going out with him; his sweetness redounded to me like a sunny day on a dark sidewalk. I could have and probably should have spent the rest of my life with him…. I became seasick with contentment. It was nauseating daily, and I couldn’t still myself against a funny feeling that there had to be more to life than waking up every day beside the same person. To say I was bored would be to misunderstand boredom: I did not need to take up table tennis or ballroom dancing—I needed a sense that this wasn’t the end of the story. The idea of forever with any single person, even someone great whom I loved so much like Gregg, really did seem like what death actually is: a permanent stop….\nAge is a terrible avenger. The lessons of life give you so much to work with, but by the time you’ve got all this great wisdom, you don’t get to be young anymore. And in this world, that’s just about the worst thing that can happen—especially to a woman. Whoever said youth is wasted on the young actually got it wrong; it’s more that maturity is wasted on the old.\nThe single most amusing thing about the women of modernity is that in their pursuit of finding happiness through imitating masculinity, they have forgotten that most basic of market principle: buy low, sell high.  Time is not cruel, but it is both indifferent and inexorable.  In almost every circumstance, the women that I have seen turn down good men of suitable quality who wanted to marry them in their early and middle twenties wound up settling for lower quality men in their late twenties and thirties.  And they are the fortunate and happy ones; those who are still unmarried and childless in their early forties are nearly all full of regrets for the various opportunities they either rejected or simply allowed to pass them by.\nThe root problem seems to be that women are horrifically bad at anticipating what they are going to want in the future.  The usual female pattern proceeds thusly:  In her teens, a woman wants to focus on her education and having fun through a series of practice relationships.  Her main concern is actually how much admiration she generates from men and her concomitant status among women.  In her early to middle twenties, she wants to focus on her job and having fun through sampling a variety of penises; her main concern is actually not getting tied down to any commitments, professional or personal.  In both stages A and B, she will swear up and down that she doesn’t ever want to have children for some nonsensical reason or another, although she is open to getting married someday off in the distant and nebulous future.\nStage C begins when her friends start getting engaged, usually in her late-twenties.  Then she decides that she might be “okay” with one or two children and begins a desultory search for a marriageable man.  However, this search is usually interrupted by a series of disastrous affairs with various Alphas, bad boys, and marriage-allergic men.  She often talks about how confused she is and has no coherent focus; her main concern is to maintain her social equivalency with her female friends.  At this point, the smarter women settle down and get married to the best available man since their marriage value is still high enough that they can attract a man of reasonable quality.  The more foolish women convince themselves that they are even more attractive than they were in their early twenties due to their educations and careers and decide they have another decade before they “have to settle”.\nStage D is the early to middle thirties.  A detectable edge of desperation begins to set in; you will seldom talk to a woman in her thirties who does not bring up science out of the blue and and ramble on about how it will allow her to have children in her forties.  She is often in total denial about the decline in her market value and often wastes years dating higher quality men who are not actually on the marriage market.  Her focus is now getting married as soon as possible so she can still have children, however, her inability to properly value herself causes her to pass over the sort of men who are actually willing to settle for her.\nElizabeth Wurtzel is in stage E.  She is past her prime, she knows she is past it, and she is now regretting the potential husband she foolishly threw away in stage C.  Her focus is now on finding a husband, although she knows it is probably too late for children.  She appears destined to be a Stage F failure, also known as a Companion to Many Cats.  This is not a worthless societal role, or necessarily an undignified one, but it is not one that most young women in their teens dream about.\nThe basic problem of female self-valuation is compounded by the challenge posed by the male Madonna-Whore division.  What is attractive to a man on a short term basis is not necessarily attractive to a man on a long term basis.  I would estimate that a woman can expect to regularly attract men who are two points higher in Whore mode than she can in Madonna mode.  If you’re a 20 year-old seven who regularly has flings with men you rate as eights and nines, you should actively look for marriage material among the men you would rate as fives to sevens.  This will significantly increase your chances of long term success; remember that in 15 years you are going to be a five, not a seven, while that five that you find barely attractive now has the potential to move up to a six or even a seven on the scale due to the way women value financial success and social substance over physical looks.\nThere are always outliers, of course.  And the progression I describe obviously doesn’t apply to all women.  There are even a few lucky women who are more attractive in Stage C than in Stage A or B.  But in general, a woman will be well served by applying the buy low, sell high principle and marrying a man who is between five and ten years older before she reaches the age of 25.  And above all, remember that what you think you will want in ten years is almost surely not what you will actually want in ten years and that drama is much more entertaining on television than it is in real life.\nAnd this comment really says it all:\n“I was shocked at my visceral response to reading this column. I cried uncontrollably. I’m tearing up as I type this comment. There are so many reasons why Elizabeth’s story had such an effect on me….  I spent my entire life working towards my career and then lost it in the blink of an eye. Meanwhile, men were basically play things coming in and out of my life.  (Think Samantha; Sex and the City.) I was never the relationship type. My longest relationship lasted a year during my junior year of college. That was 20 years ago. Now, I’ll be 40 in July.”\nYes, I’m not ashamed to admit it.  I laughed, I did.",
  "tags": [
    "trainwreck",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-18T10:54:00+00:00"
}