{
  "url": "https://voxday.net/2010/03/22/book-review-makers-of-modern-strategy/",
  "scraped_at": "2026-01-08T23:22:42.053200",
  "title": "Book review: Makers of Modern Strategy",
  "date_display": "March 22, 2010",
  "date_iso": "2010-03-22T19:34:00+00:00",
  "date_from_url": "2010-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.amazon.com/Makers-Ancient-Strategy-Persian-Wars/dp/0691137900/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1269288995&amp;sr=8-1\">Makers of Ancient Strategy</a></b><br> Victor Davis Hanson, ed.<br> Rating: 8 of 10</br></br></p><p>Victor Davis Hanson is a political pundit and National Review contributor, but he is also a classicist and military historian.  His punditry is better than most, but I happen to find his military histories rather more interesting than his political analysis.  I very much enjoyed his <i>Carnage and Culture</i> as well as <i>A War Like No Other</i>.  His latest book, <i>Makers of Ancient Strategy</i>, is an intriguing look at various aspects of ancient warfare that consists of essays from 10 historians which address everything from Greek fortifications to Roman frontier defense.  The essays are loosely tied together by a theme that connects these ancient strategies with the challenges faced by modern strategists engaged in modern warfare, particularly as it relates to the American occupation of Iraq.</p><p>It should be understood that this is not, however, the misguided effort of a neocon occupation enthusiast to advocate world democratic revolution in a remarkably esoteric and inefficient manner.  Rather, it is a continuation of the approach taken by two similarly named compilations published in the 20th century, both entitled <i>Makers of Modern Strategy</i>, that repeatedly warned how even the radical technological changes that took place during and after World War II had not fundamentally altered the basic nature of military conflict.</p><p>The three best essays are contributed by Donald Kagan, John W.I. Lee, and Hanson himself.  Kagan’s essay, entitled “Pericles, Thucydides, and the Defense of Empire” is an apt warning of the intrinsic difficulty in maintaining a democratic empire even with the advantages of wealth, a talented ruling class, and military superiority.  His conclusion, that empire is tenable so long as it is led by an extraordinary leader like Pericles, should chill the blood of anyone who has spent any time observing the Bush, Clinton, or Obama administrations, much less the House and Senate.</p><p>Lee’s essay, “Urban Warfare in the Classic Greek World” is a reminder that what we think we know often does not bear close scrutiny.  While one tends to think of the Greek warfare as consisting of phalanxes of armored hoplites colliding together, Lee reminds us that two-thirds of the battles recorded by Thucydides actually took place inside various city walls.  What is often described as 4th generation warfare and takes place in urban Iraq today has a surprisingly close relationship to ancient warfare circa 450 BC.  Hanson’s essay, on the other hand, focuses on an individual, Epaminonides the Theban, who crushed Sparta in what could be seen as a precursor of 20th and 21st century wars of democratic liberation.  I found “Epaminonides the Theban and the Doctrine of Preemptive War” to be much more convincing with regards to the Roman opinion of Epaminonides, who Plutarch ranked as a greater man than most of the Athenians and Spartans that we remember today, than as a coherent establishment of a preemptive doctrine.  But Hanson’s perceptions are keen, as always, and he is careful to point out the inherent risks of Epaminonides’s preemptive war.  He writes:</p><p><i>While successful preemptive war may result in an immediate strategic advantage, the dividends of such a risky enterprise are squandered if there is not a well-planned effort to incorporate military success into a larger political framework that results in some sort of advantageous peace.  By its very definition, an optional preemptive war must be short, a sort of decapitation of enemy power that stuns it into paralysis and forces it to grat political concessions.  In democratic states, sucha  controversial gamble cannot garner continued domestic political support if the attack instead leads to a drawn-out, deracinating struggle, the very sort of quagmire that the preemption was originally intended to preclude.  Like it or not, when successful and followed by a period of quiet, preemption is often ultimately considered moral, justified, and defensive; when costly and unsuccessful in securing peace, in hindsight it always looks optional, foolhardy, and aggressive.”</i></p><p>I also enjoyed Tom Holland’s essay on the Persian view of the fractious Greek city-states and Peter Heather’s essay on the approach to frontier defense in the later Roman empire.  The only weak essay was Barry Holland’s “Slave Wars of Greece and Rome”, which didn’t go into much detail of any of the aforementioned slave wars, didn’t provide any useful statistics, and didn’t relate the ancient slave wars to modern insurgencies in any meaningful manner.  Even so, it was interesting to read of the near-complete absence of any doctrine of abolitionism in the ancient world, barring one of the early Church Fathers, Gregory of Nyssa.</p><p><i>Makers of Ancient Strategy</i> is well worth reading by any armchair historian with an interest in the Greco-Roman world, and wargamers in particular will find it five or six of the essays to be fascinating.  And speaking as one of the commentators <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=48256\">who drew upon the example</a> of the Sicilian Expedition to criticize the Iraqi occupation, I have to admit that VDH provides an effective rebuttal to that analogy in this volume.  Not necessarily a conclusive one, mind you, and perhaps even one that could be viewed as contradicting some of the lessons he draws in the Epaminonides essay.  But it is certainly not one that the fair observer can reasonably ignore.</p><p>The essays are all well-sourced and in some cases the notes are nearly as interesting to read as the essays themselves.  I highly recommend it for historically literate readers with an interest in Greco-Roman history, military history, or the politics of the current military occupations.</p></div>",
  "content_text": "Makers of Ancient Strategy\nVictor Davis Hanson, ed.\nRating: 8 of 10\nVictor Davis Hanson is a political pundit and National Review contributor, but he is also a classicist and military historian.  His punditry is better than most, but I happen to find his military histories rather more interesting than his political analysis.  I very much enjoyed his\nCarnage and Culture\nas well as\nA War Like No Other\n.  His latest book,\nMakers of Ancient Strategy\n, is an intriguing look at various aspects of ancient warfare that consists of essays from 10 historians which address everything from Greek fortifications to Roman frontier defense.  The essays are loosely tied together by a theme that connects these ancient strategies with the challenges faced by modern strategists engaged in modern warfare, particularly as it relates to the American occupation of Iraq.\nIt should be understood that this is not, however, the misguided effort of a neocon occupation enthusiast to advocate world democratic revolution in a remarkably esoteric and inefficient manner.  Rather, it is a continuation of the approach taken by two similarly named compilations published in the 20th century, both entitled\nMakers of Modern Strategy\n, that repeatedly warned how even the radical technological changes that took place during and after World War II had not fundamentally altered the basic nature of military conflict.\nThe three best essays are contributed by Donald Kagan, John W.I. Lee, and Hanson himself.  Kagan’s essay, entitled “Pericles, Thucydides, and the Defense of Empire” is an apt warning of the intrinsic difficulty in maintaining a democratic empire even with the advantages of wealth, a talented ruling class, and military superiority.  His conclusion, that empire is tenable so long as it is led by an extraordinary leader like Pericles, should chill the blood of anyone who has spent any time observing the Bush, Clinton, or Obama administrations, much less the House and Senate.\nLee’s essay, “Urban Warfare in the Classic Greek World” is a reminder that what we think we know often does not bear close scrutiny.  While one tends to think of the Greek warfare as consisting of phalanxes of armored hoplites colliding together, Lee reminds us that two-thirds of the battles recorded by Thucydides actually took place inside various city walls.  What is often described as 4th generation warfare and takes place in urban Iraq today has a surprisingly close relationship to ancient warfare circa 450 BC.  Hanson’s essay, on the other hand, focuses on an individual, Epaminonides the Theban, who crushed Sparta in what could be seen as a precursor of 20th and 21st century wars of democratic liberation.  I found “Epaminonides the Theban and the Doctrine of Preemptive War” to be much more convincing with regards to the Roman opinion of Epaminonides, who Plutarch ranked as a greater man than most of the Athenians and Spartans that we remember today, than as a coherent establishment of a preemptive doctrine.  But Hanson’s perceptions are keen, as always, and he is careful to point out the inherent risks of Epaminonides’s preemptive war.  He writes:\nWhile successful preemptive war may result in an immediate strategic advantage, the dividends of such a risky enterprise are squandered if there is not a well-planned effort to incorporate military success into a larger political framework that results in some sort of advantageous peace.  By its very definition, an optional preemptive war must be short, a sort of decapitation of enemy power that stuns it into paralysis and forces it to grat political concessions.  In democratic states, sucha  controversial gamble cannot garner continued domestic political support if the attack instead leads to a drawn-out, deracinating struggle, the very sort of quagmire that the preemption was originally intended to preclude.  Like it or not, when successful and followed by a period of quiet, preemption is often ultimately considered moral, justified, and defensive; when costly and unsuccessful in securing peace, in hindsight it always looks optional, foolhardy, and aggressive.”\nI also enjoyed Tom Holland’s essay on the Persian view of the fractious Greek city-states and Peter Heather’s essay on the approach to frontier defense in the later Roman empire.  The only weak essay was Barry Holland’s “Slave Wars of Greece and Rome”, which didn’t go into much detail of any of the aforementioned slave wars, didn’t provide any useful statistics, and didn’t relate the ancient slave wars to modern insurgencies in any meaningful manner.  Even so, it was interesting to read of the near-complete absence of any doctrine of abolitionism in the ancient world, barring one of the early Church Fathers, Gregory of Nyssa.\nMakers of Ancient Strategy\nis well worth reading by any armchair historian with an interest in the Greco-Roman world, and wargamers in particular will find it five or six of the essays to be fascinating.  And speaking as one of the commentators\nwho drew upon the example\nof the Sicilian Expedition to criticize the Iraqi occupation, I have to admit that VDH provides an effective rebuttal to that analogy in this volume.  Not necessarily a conclusive one, mind you, and perhaps even one that could be viewed as contradicting some of the lessons he draws in the Epaminonides essay.  But it is certainly not one that the fair observer can reasonably ignore.\nThe essays are all well-sourced and in some cases the notes are nearly as interesting to read as the essays themselves.  I highly recommend it for historically literate readers with an interest in Greco-Roman history, military history, or the politics of the current military occupations.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-22T19:34:00+00:00"
}