{
  "url": "https://voxday.net/2010/03/02/enders-scenario/",
  "scraped_at": "2026-01-08T23:20:59.825429",
  "title": "Ender’s scenario",
  "date_display": "March 2, 2010",
  "date_iso": "2010-03-02T21:28:00+00:00",
  "date_from_url": "2010-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It isn’t an exaggeration to say that I am a highly skilled gamer.  I have been playing a variety of strategy, arcade, console, and computer games for nearly five times longer than Malcom Gladwell claims it takes to become unusually skilled at something.  Now, I’m not a freakish game savant like Big Chilly, who has blown away even the most hard-core gamers away by playing through console games that he’s never played before <i>without losing a single man</i>.  (Note: by hard-core, I don’t mean guys who like to play the occasional PS3 game online, but junior high friends who happen to be long-time editors at the one of the game industry’s leading magazines.)  But if you give a me a shot or two at any given game, I can usually figure out the basic mechanics and figure out how to make effective use of them.</p><p>A teenage friend of ours once challenged me to a game of Maddens.  He was in high school, was better than all his friends, and was utterly convinced that he would have no problem at all pwning the old guy.  Not even a gentle pre-game reminder that I’d been playing Maddens since the original Genesis game dented his confidence. A 63-7 loss, on the other hand, just about had him in tears.  Score one for the Original Gaming Generation!</p><p>Anyhow, Advanced Squad Leader is the Game of Games in my opinion.  It occupies six shelves in my office, and while I’m not a rulesmeister or a member of the tournament elite, I can more than hold my own. I started playing Squad Leader and Cross of Iron by myself when I was ten, and over the years I never lost a single scenario at the monthly TCASL meetings, was well on the way to victory playing the Red Barricades campaign game as the Germans when we had to stop playing, won my beach in the two-day Normandy landings in Geneva, and have a ROAR record over .800.  I now have the pleasure to be introducing a young commander to the game, and it’s wonderful to see the combination of interest, wonder, and awe at the vast horizon of possibilities that the game system contains.</p><p>We’ve started out with the excellent ASL Starter kit that MMP put together.  I have to admit that I’d been a little annoyed by the switch to custom starter kit boards, since the first scenario I’d ever designed had been accepted for publication when the kit was going to make use of the standard boards.  (It was a unique setup that involved the use of the Japanese counters <i>against the Germans</i> in a simulation of the 442nd’s rescue of the Lost Battalion.)  But it’s really well-done, the abridged rules make for relatively easy reading, and the bite-sized scenarios are perfect for beginners.  We started with scenario S1 Retaking Vierville, as you do, and my young apprentice chose the defending Americans with my encouragement since it’s usually a little easier on defense.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://4.bp.blogspot.com/_3UXl0oMYPLs/S41y7MfYLQI/AAAAAAAAALQ/N_caoNSjB48/s1600-h/escen1.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"307\" src=\"http://www.milobookclub.com/wp-content/uploads/2010/03/escen1.png\" width=\"400\"/></a></div><p> The image above showed how it finished.  He was too cautious, as beginners usually are, and I took advantage of that to quickly grab the victory condition building hex L3.  I didn’t give him time to react to that, and even briefly managed to punch two squads with an 8-1 leader into a second VC building, M4, before being broken and driven back by point-blank fire from three elite squads of 7-4-7 paratroopers.  The key tactic was sending my reserve of two Fallschirmjager squads with a 9-1 leader to ambush the incoming American reinforcements coming from the north.  They bounced back quickly from breaking thanks to their 9-2 leader, but it delayed their attack on the western edge long enough that not even repeated charges from a pair of HoB-created fanatic squads managed to drive all my second-line Grenadiers from L3.</p><p>He wasn’t bothered by the loss, as I’d warned him beforehand that it’s possible to play for a long time before you chalk up your first win, particularly if your only opponent is a very good player.  We went on to play S2 War of the Rats, and again I had the attacking Germans.  I thought his setup was much too exposed to the initial German prep fire, and expected that my death star under the command of the 9-2 leader would quickly blow a hole in the heart of his defense and allow me to hit the remnants from both sides after I rolled over his two conscript squads in the east and took the key VC L6 building with the 9-1 platoon.  Things went exactly as I expected, the bulk of his forces were broken and my eastern platoon had L6 open for the taking when I made the mistake of deviating from the plan and advancing into close combat in the hex marked with the yellow-bordered red star in order to finish off the one remaining squad.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://4.bp.blogspot.com/_3UXl0oMYPLs/S42EdAHkmtI/AAAAAAAAALg/uA9WEPYC1f0/s1600-h/escen2.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"317\" src=\"http://www.milobookclub.com/wp-content/uploads/2010/03/escen2.png\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2010/03/escen2.png\" decoding=\"async\" height=\"317\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20400%20317%22%3E%3C/svg%3E\" width=\"400\"/></a></div><p>That was when he hit on a 1 in 36 chance and eliminated all three of my squads and my leader… and I blew my kill roll.  That left me with no troops on the eastern side, which would permit him to regain control of all the buildings I’d just taken and force me to grab those buildings before his shock group of three 5-2-7 squads under a 9-2 showed up as randomly determined reinforcements.  It looked pretty good for me, as they didn’t show up in turn four and I was rapidly rolling up his forces until two of my squads got locked in melee in the hex marked with a white-bordered red star with a half-squad in the process of taking control of the last Russian-controlled hex of building L6.  Despite reinforcing the melee, I just couldn’t kill that <i>conscript half-squad</i>, which slowed me down enough so that I only had one squad in position to shoot at the reinforcements as they moved up hexrow O to claim VC building O6.  I finally killed the half-squad and brought all my forces to bear on the shock group.  I forced them out of O6, but my need to focus on the reinforcements allowed his broken 7-0 to rally a broken conscript squad in M2 and move in behind my forces to reclaim L6 and win the game.</p><p>Big Chilly plays ASL from time to time, so he knows how difficult it is to beat a more experienced player.  He absolutely howled with laughter when he found out that my young apprentice not only wasn’t discouraged after playing his first two scenarios, <i>but had actually beaten me</i> without me pulling any punches.  We discussed how his early decision to attack all three of my squads and leader at a 1-4 disadvantage instead of the more usual one-to-one attack had led to the timely snake-eyes looked like beginner’s luck, but concluded that it was actually the right decision to make given that 1 in 36 was probably better odds than you’d normally give a boy to beat a veteran ASL player.</p><p>“Did you give him the Balance?”</p><p>“No!  I didn’t.”</p><p>“Good grief!  He’s Ender!”</p><p>The next day, Ender and I set up S3 Simple Equation.  Ender wanted to play the Americans despite being warned that it was a little more difficult being the attacker.  And then <i>he beat me again!</i></p></div>",
  "content_text": "It isn’t an exaggeration to say that I am a highly skilled gamer.  I have been playing a variety of strategy, arcade, console, and computer games for nearly five times longer than Malcom Gladwell claims it takes to become unusually skilled at something.  Now, I’m not a freakish game savant like Big Chilly, who has blown away even the most hard-core gamers away by playing through console games that he’s never played before\nwithout losing a single man\n.  (Note: by hard-core, I don’t mean guys who like to play the occasional PS3 game online, but junior high friends who happen to be long-time editors at the one of the game industry’s leading magazines.)  But if you give a me a shot or two at any given game, I can usually figure out the basic mechanics and figure out how to make effective use of them.\nA teenage friend of ours once challenged me to a game of Maddens.  He was in high school, was better than all his friends, and was utterly convinced that he would have no problem at all pwning the old guy.  Not even a gentle pre-game reminder that I’d been playing Maddens since the original Genesis game dented his confidence. A 63-7 loss, on the other hand, just about had him in tears.  Score one for the Original Gaming Generation!\nAnyhow, Advanced Squad Leader is the Game of Games in my opinion.  It occupies six shelves in my office, and while I’m not a rulesmeister or a member of the tournament elite, I can more than hold my own. I started playing Squad Leader and Cross of Iron by myself when I was ten, and over the years I never lost a single scenario at the monthly TCASL meetings, was well on the way to victory playing the Red Barricades campaign game as the Germans when we had to stop playing, won my beach in the two-day Normandy landings in Geneva, and have a ROAR record over .800.  I now have the pleasure to be introducing a young commander to the game, and it’s wonderful to see the combination of interest, wonder, and awe at the vast horizon of possibilities that the game system contains.\nWe’ve started out with the excellent ASL Starter kit that MMP put together.  I have to admit that I’d been a little annoyed by the switch to custom starter kit boards, since the first scenario I’d ever designed had been accepted for publication when the kit was going to make use of the standard boards.  (It was a unique setup that involved the use of the Japanese counters\nagainst the Germans\nin a simulation of the 442nd’s rescue of the Lost Battalion.)  But it’s really well-done, the abridged rules make for relatively easy reading, and the bite-sized scenarios are perfect for beginners.  We started with scenario S1 Retaking Vierville, as you do, and my young apprentice chose the defending Americans with my encouragement since it’s usually a little easier on defense.\nThe image above showed how it finished.  He was too cautious, as beginners usually are, and I took advantage of that to quickly grab the victory condition building hex L3.  I didn’t give him time to react to that, and even briefly managed to punch two squads with an 8-1 leader into a second VC building, M4, before being broken and driven back by point-blank fire from three elite squads of 7-4-7 paratroopers.  The key tactic was sending my reserve of two Fallschirmjager squads with a 9-1 leader to ambush the incoming American reinforcements coming from the north.  They bounced back quickly from breaking thanks to their 9-2 leader, but it delayed their attack on the western edge long enough that not even repeated charges from a pair of HoB-created fanatic squads managed to drive all my second-line Grenadiers from L3.\nHe wasn’t bothered by the loss, as I’d warned him beforehand that it’s possible to play for a long time before you chalk up your first win, particularly if your only opponent is a very good player.  We went on to play S2 War of the Rats, and again I had the attacking Germans.  I thought his setup was much too exposed to the initial German prep fire, and expected that my death star under the command of the 9-2 leader would quickly blow a hole in the heart of his defense and allow me to hit the remnants from both sides after I rolled over his two conscript squads in the east and took the key VC L6 building with the 9-1 platoon.  Things went exactly as I expected, the bulk of his forces were broken and my eastern platoon had L6 open for the taking when I made the mistake of deviating from the plan and advancing into close combat in the hex marked with the yellow-bordered red star in order to finish off the one remaining squad.\nThat was when he hit on a 1 in 36 chance and eliminated all three of my squads and my leader… and I blew my kill roll.  That left me with no troops on the eastern side, which would permit him to regain control of all the buildings I’d just taken and force me to grab those buildings before his shock group of three 5-2-7 squads under a 9-2 showed up as randomly determined reinforcements.  It looked pretty good for me, as they didn’t show up in turn four and I was rapidly rolling up his forces until two of my squads got locked in melee in the hex marked with a white-bordered red star with a half-squad in the process of taking control of the last Russian-controlled hex of building L6.  Despite reinforcing the melee, I just couldn’t kill that\nconscript half-squad\n, which slowed me down enough so that I only had one squad in position to shoot at the reinforcements as they moved up hexrow O to claim VC building O6.  I finally killed the half-squad and brought all my forces to bear on the shock group.  I forced them out of O6, but my need to focus on the reinforcements allowed his broken 7-0 to rally a broken conscript squad in M2 and move in behind my forces to reclaim L6 and win the game.\nBig Chilly plays ASL from time to time, so he knows how difficult it is to beat a more experienced player.  He absolutely howled with laughter when he found out that my young apprentice not only wasn’t discouraged after playing his first two scenarios,\nbut had actually beaten me\nwithout me pulling any punches.  We discussed how his early decision to attack all three of my squads and leader at a 1-4 disadvantage instead of the more usual one-to-one attack had led to the timely snake-eyes looked like beginner’s luck, but concluded that it was actually the right decision to make given that 1 in 36 was probably better odds than you’d normally give a boy to beat a veteran ASL player.\n“Did you give him the Balance?”\n“No!  I didn’t.”\n“Good grief!  He’s Ender!”\nThe next day, Ender and I set up S3 Simple Equation.  Ender wanted to play the Americans despite being warned that it was a little more difficult being the attacker.  And then\nhe beat me again!",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-02T21:28:00+00:00"
}