{
  "url": "https://voxday.net/2010/03/24/game-in-19th-century/",
  "scraped_at": "2026-01-08T23:22:51.312047",
  "title": "Game in the 19th century",
  "date_display": "March 24, 2010",
  "date_iso": "2010-03-24T17:15:00+00:00",
  "date_from_url": "2010-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Men who seek to better understand the challenge posed by the dichotomy of female attraction could do far worse than to read the works of W. Somerset Maugham.  Being of a certain orientation as well as an unusually ruthless observer of human behavior, he had the emotional distance necessary to note some of the unusual and contradictory aspects of female behavior that have confounded so many men over the centuries.  His first novel, <i>Liza of Lambeth</i>, is little more than a straightforward portrayal of the instinctive feminine preference for the Alpha; the most desirable young woman on the street, the protagonist Liza, rejects her solid and eminently suitable young suitor, Tom, in favor of a secretive affair with brutish, bearded married man whose children are as old as she is.  Tom’s proper and hesitant advances don’t arouse Liza half as much as Jim’s rough, unsolicited kisses; Jim provokes the consumation of their adultery with a punch in the stomach.  Needless to say, it doesn’t end well for Liza, as she is physically beaten by Jim’s wife, gets pregnant, and dies of a miscarriage.</p><p>A similar, but more sophisticated theme is at work throughout <i>Of Human Bondage</i>, which is an excellent novel worth reading in any event.  The unsavory object of Philip Carey’s unstinting devotion, the anemic waitress Mildred, throws him over in favor of a married German man before running off with his impoverished best friend at Carey’s expense.  Whereas Tom is a beta by virtue of his youth, Carey is a downright gamma courtesy of his club foot and sensitive intelligence.  Carey is a white knight who will not ‘take advantage’ of Mildred even after repeatedly rescuing her from starvation, ill health, and prostitution; she is openly contemptuous of him throughout their entire relationship before finally leaving him in a violent and destructive rage when, in his noble refusal to abuse his position as her rescuer, he resolutely refuses to take her to his bed.  The story finally ends well for Carey, but only thanks to his class superiority providing him with sufficient perceived status to attract a handsome, loving, young quasi-peasant girl.  And even with her, he comes very close to ruining his happy ending by his persistent gammaesque noblesse.  To marry the girl in order to rescue her from social opprobation is a responsibility he willingly accepts, but he finds it very hard to accept the idea of marrying her simply because he wants to do so.</p><p>But Maugham’s prescient explication of Game is most explicit in <i>The Magician</i>, in which the beautiful fiance of a young and brilliant physician is seduced away from him by the grotesque figure of the Aleister Crowley character, Oliver Haddo.</p><p><i>Her contempt for him, her utter loathing, were alloyed with a feeling that aroused in her horror and dismay. She could not get the man out of her thoughts. All that he had said, all that she had seen, seemed, as though it possessed a power of material growth, unaccountably to absorb her. It was as if a rank weed were planted in her heart and slid long poisonous tentacles down every artery, so that each part of her body was enmeshed. Work could not distract her, conversation, exercise, art, left her listless; and between her and all the actions of life stood the flamboyant, bulky form of Oliver Haddo. She was terrified of him now as never before, but curiously had no longer the physical repulsion which hitherto had mastered all other feelings. Although she repeated to herself that she wanted never to see him again, Margaret could scarcely resist an overwhelming desire to go to him. Her will had been taken from her, and she was an automaton. She struggled, like a bird in the fowler’s net with useless beating of the wings; but at the bottom of her heart she was dimly conscious that she did not want to resist. If he had given her that address, it was because he knew she would use it. She did not know why she wanted to go to him; she had nothing to say to him; she knew only that it was necessary to go….</i></p><p>It seemed to her that a comparison was drawn for her attention between the narrow round which awaited her as Arthur’s wife and this fair, full existence. She shuddered to think of the dull house in Harley Street and the insignificance of its humdrum duties. But it was possible for her also to enjoy the wonder of the world. Her soul yearned for a beauty that the commonalty of men did not know. And what devil suggested, a warp as it were in the woof of Oliver’s speech, that her exquisite loveliness gave her the right to devote herself to the great art of living? She felt a sudden desire for perilous adventures. As though fire passed through her, she sprang to her feet and stood with panting bosom, her flashing eyes bright with the multi-coloured pictures that his magic presented.  Oliver Haddo stood too, and they faced one another. Then, on a sudden, she knew what the passion was that consumed her. With a quick movement, his eyes more than ever strangely staring, he took her in his arms, and he kissed her lips. She surrendered herself to him voluptuously. Her whole body burned with the ecstasy of his embrace.</p><p>‘I think I love you,’ she said, hoarsely.</p><p>She looked at him. She did not feel ashamed.</p><p>Now, there are certainly women who master this primal urge for excitement, mystery and perception of male power, who exert their rational faculties and succeed in choosing their lovers utilizing at least some degree of reason rather than simply trusting to the vagaries of instinct.  But that does not mean that the primal urge does not exist in them, or that it is not there to be appealed to by men who recognize it and knowingly manipulate it or by men whose natural behavior tends to stimulate it.  Awareness of this dichotomy of female attraction is useful knowledge for men and women alike, since the woman who is aware of it is less likely to find herself being swept away unconsciously by it, and the man who is aware of it can either use it to avoid behaving in a manner that provokes instinctive disgust in women or to behave in a manner that permits manipulation of those instincts.</p><p>One thing I’m curious to know is how many women are fully cognizant of this call of the wild while simultaneously rejecting it.  Do those who reject it tend to knowingly do so or is it more of an unconscious rejection that is the result of positive social conditioning?  I’m really not interested in hearing what women who completely deny it exists and profess an instinctive preference for white knights and gammas have to say, since there isn’t much to be learned from the opinions of the self-deceptive.</p></div>",
  "content_text": "Men who seek to better understand the challenge posed by the dichotomy of female attraction could do far worse than to read the works of W. Somerset Maugham.  Being of a certain orientation as well as an unusually ruthless observer of human behavior, he had the emotional distance necessary to note some of the unusual and contradictory aspects of female behavior that have confounded so many men over the centuries.  His first novel,\nLiza of Lambeth\n, is little more than a straightforward portrayal of the instinctive feminine preference for the Alpha; the most desirable young woman on the street, the protagonist Liza, rejects her solid and eminently suitable young suitor, Tom, in favor of a secretive affair with brutish, bearded married man whose children are as old as she is.  Tom’s proper and hesitant advances don’t arouse Liza half as much as Jim’s rough, unsolicited kisses; Jim provokes the consumation of their adultery with a punch in the stomach.  Needless to say, it doesn’t end well for Liza, as she is physically beaten by Jim’s wife, gets pregnant, and dies of a miscarriage.\nA similar, but more sophisticated theme is at work throughout\nOf Human Bondage\n, which is an excellent novel worth reading in any event.  The unsavory object of Philip Carey’s unstinting devotion, the anemic waitress Mildred, throws him over in favor of a married German man before running off with his impoverished best friend at Carey’s expense.  Whereas Tom is a beta by virtue of his youth, Carey is a downright gamma courtesy of his club foot and sensitive intelligence.  Carey is a white knight who will not ‘take advantage’ of Mildred even after repeatedly rescuing her from starvation, ill health, and prostitution; she is openly contemptuous of him throughout their entire relationship before finally leaving him in a violent and destructive rage when, in his noble refusal to abuse his position as her rescuer, he resolutely refuses to take her to his bed.  The story finally ends well for Carey, but only thanks to his class superiority providing him with sufficient perceived status to attract a handsome, loving, young quasi-peasant girl.  And even with her, he comes very close to ruining his happy ending by his persistent gammaesque noblesse.  To marry the girl in order to rescue her from social opprobation is a responsibility he willingly accepts, but he finds it very hard to accept the idea of marrying her simply because he wants to do so.\nBut Maugham’s prescient explication of Game is most explicit in\nThe Magician\n, in which the beautiful fiance of a young and brilliant physician is seduced away from him by the grotesque figure of the Aleister Crowley character, Oliver Haddo.\nHer contempt for him, her utter loathing, were alloyed with a feeling that aroused in her horror and dismay. She could not get the man out of her thoughts. All that he had said, all that she had seen, seemed, as though it possessed a power of material growth, unaccountably to absorb her. It was as if a rank weed were planted in her heart and slid long poisonous tentacles down every artery, so that each part of her body was enmeshed. Work could not distract her, conversation, exercise, art, left her listless; and between her and all the actions of life stood the flamboyant, bulky form of Oliver Haddo. She was terrified of him now as never before, but curiously had no longer the physical repulsion which hitherto had mastered all other feelings. Although she repeated to herself that she wanted never to see him again, Margaret could scarcely resist an overwhelming desire to go to him. Her will had been taken from her, and she was an automaton. She struggled, like a bird in the fowler’s net with useless beating of the wings; but at the bottom of her heart she was dimly conscious that she did not want to resist. If he had given her that address, it was because he knew she would use it. She did not know why she wanted to go to him; she had nothing to say to him; she knew only that it was necessary to go….\nIt seemed to her that a comparison was drawn for her attention between the narrow round which awaited her as Arthur’s wife and this fair, full existence. She shuddered to think of the dull house in Harley Street and the insignificance of its humdrum duties. But it was possible for her also to enjoy the wonder of the world. Her soul yearned for a beauty that the commonalty of men did not know. And what devil suggested, a warp as it were in the woof of Oliver’s speech, that her exquisite loveliness gave her the right to devote herself to the great art of living? She felt a sudden desire for perilous adventures. As though fire passed through her, she sprang to her feet and stood with panting bosom, her flashing eyes bright with the multi-coloured pictures that his magic presented.  Oliver Haddo stood too, and they faced one another. Then, on a sudden, she knew what the passion was that consumed her. With a quick movement, his eyes more than ever strangely staring, he took her in his arms, and he kissed her lips. She surrendered herself to him voluptuously. Her whole body burned with the ecstasy of his embrace.\n‘I think I love you,’ she said, hoarsely.\nShe looked at him. She did not feel ashamed.\nNow, there are certainly women who master this primal urge for excitement, mystery and perception of male power, who exert their rational faculties and succeed in choosing their lovers utilizing at least some degree of reason rather than simply trusting to the vagaries of instinct.  But that does not mean that the primal urge does not exist in them, or that it is not there to be appealed to by men who recognize it and knowingly manipulate it or by men whose natural behavior tends to stimulate it.  Awareness of this dichotomy of female attraction is useful knowledge for men and women alike, since the woman who is aware of it is less likely to find herself being swept away unconsciously by it, and the man who is aware of it can either use it to avoid behaving in a manner that provokes instinctive disgust in women or to behave in a manner that permits manipulation of those instincts.\nOne thing I’m curious to know is how many women are fully cognizant of this call of the wild while simultaneously rejecting it.  Do those who reject it tend to knowingly do so or is it more of an unconscious rejection that is the result of positive social conditioning?  I’m really not interested in hearing what women who completely deny it exists and profess an instinctive preference for white knights and gammas have to say, since there isn’t much to be learned from the opinions of the self-deceptive.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-24T17:15:00+00:00"
}