{
  "url": "https://voxday.net/2010/03/08/hitchens-outs-himself/",
  "scraped_at": "2026-01-08T23:21:29.265604",
  "title": "Hitchens outs himself",
  "date_display": "March 8, 2010",
  "date_iso": "2010-03-08T14:45:00+00:00",
  "date_from_url": "2010-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://www.dailymail.co.uk/news/article-1255852/So-WERE-Tory-ministers-gay-flings-Christopher-Hitchens-Oxford.html\">self-outing</a> isn’t exactly a jaw-dropping revelation.  It may also explain an amount of Christopher Hitchens’s obsession with religious strictures on sexual behavior, to say nothing of his bizarre, quasi-Islamic vision of secular paradise provided in <i>god is Not Great</i>:</p><blockquote><p>Which two ministers of Margaret Thatcher’s government had gay relations with the writer Christopher Hitchens while at Oxford?  Since Hitchens’s extraordinary claim emerged this week, the louche figure, now 60, who has been married twice, has fended off all requests for further information….  For although he has always enjoyed a reputation as a womaniser, at Oxford Hitchens was known to be bisexual.  According to one contemporary: ‘He had a reputation for being AC/DC and, although a Trot, he was fancied by quite a few gay Tories and moved in those circles.’</p></blockquote><p>Let’s face it, it’s only a matter of time before <a href=\"http://4.bp.blogspot.com/_3UXl0oMYPLs/SkoaGocVdcI/AAAAAAAAAI8/b4IjayaQR7k/s1600-h/atheism-camp.jpg\">Dawkins comes out too</a>.  All that incoherent rage against the Christian faith exhibited by the New Atheists doesn’t come from an intellectual or even a rational place.  It wouldn’t surprise me if pictures of Hitchens dressed in Nazi regalia surfaced at some point in time either.  Unlike Dawkins, Hitchens is a likable, if roguish, character, but sometimes he really appears to be more of a likable <i>caricature</i>.</p></div>",
  "content_text": "This\nself-outing\nisn’t exactly a jaw-dropping revelation.  It may also explain an amount of Christopher Hitchens’s obsession with religious strictures on sexual behavior, to say nothing of his bizarre, quasi-Islamic vision of secular paradise provided in\ngod is Not Great\n:\nWhich two ministers of Margaret Thatcher’s government had gay relations with the writer Christopher Hitchens while at Oxford?  Since Hitchens’s extraordinary claim emerged this week, the louche figure, now 60, who has been married twice, has fended off all requests for further information….  For although he has always enjoyed a reputation as a womaniser, at Oxford Hitchens was known to be bisexual.  According to one contemporary: ‘He had a reputation for being AC/DC and, although a Trot, he was fancied by quite a few gay Tories and moved in those circles.’\nLet’s face it, it’s only a matter of time before\nDawkins comes out too\n.  All that incoherent rage against the Christian faith exhibited by the New Atheists doesn’t come from an intellectual or even a rational place.  It wouldn’t surprise me if pictures of Hitchens dressed in Nazi regalia surfaced at some point in time either.  Unlike Dawkins, Hitchens is a likable, if roguish, character, but sometimes he really appears to be more of a likable\ncaricature\n.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-08T14:45:00+00:00"
}