{
  "url": "https://voxday.net/2010/03/24/how-it-looks-from-other-side/",
  "scraped_at": "2026-01-08T23:22:49.490064",
  "title": "How it looks from the other side",
  "date_display": "March 24, 2010",
  "date_iso": "2010-03-24T14:15:00+00:00",
  "date_from_url": "2010-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chad the Elder has an interesting link to a WSJ article at the Fraters Libertas.  He also notes that Obamacare has probably destroyed Mitt Romney’s chances at the 2012 nomination, <a href=\"http://www.fraterslibertas.com/2010/03/is-there-echo-in-here.html\">the hapless denials of Captain Underoos notwithstanding</a>.  However, I found this comment following the article to be both illuminating and astounding in terms of how the lunatics on the Left regard the political fallout from the health care bill:</p><blockquote><p>To all my Republican friends. They have met their Waterloo. The bill that was passed by the House on Sunday is not socialized medicine. It is so far from that agenda that the GOP overstated the case. To the public they were the party of NO.They will not repeal it and in November they will be slaughtered. Pelosi gave a young President a spine that he lacked. She encouraged him to invest all of his political capital to promote this bill. People all over the world were tuned in to the pre vote and vote on Sunday. Their impression was that the Tea Party people were a bunch of racist crazies. The whites in this country must accept the fact that in 10 years we will become a minority. President Obama was empowered by the stand he took. He reached out his hand to a reluctant GOP and they slapped him down in a racist and demeaning way. This vote in the House was more significiant than the vote in November 2008. This President is now empowered to be another FDR.</p></blockquote><p>You see, there are many Americans who eagerly anticipate living in a Third World hellhole with a corrupt nomenklatura.  They don’t want anything to do with liberty or the cultural traditions of the West.  And those conservatives who are so foolish as to support immigration have been actively doing their work for them for the last 24 years.  As for the political analysis, the only correct point is that Obama has been empowered by acting decisively.  To gain popularity in the polls, you have to lead them, not follow them.  While the Congressional Democrats will get destroyed in November, Obama may well come out of this very well.  If the bill is perceived to have ruined the health care system, it’s Pelosi’s bill.  If it is perceived to have been a success, he’ll take the credit.</p><p>And, if he has to work with a Republican House and Senate, he’ll work towards a magnificent bipartisan immigration reform, importing tens of millions of third-worlders.  Remember, the economy is already toast, and he still has an out by sacrificing the bankers.</p></div>",
  "content_text": "Chad the Elder has an interesting link to a WSJ article at the Fraters Libertas.  He also notes that Obamacare has probably destroyed Mitt Romney’s chances at the 2012 nomination,\nthe hapless denials of Captain Underoos notwithstanding\n.  However, I found this comment following the article to be both illuminating and astounding in terms of how the lunatics on the Left regard the political fallout from the health care bill:\nTo all my Republican friends. They have met their Waterloo. The bill that was passed by the House on Sunday is not socialized medicine. It is so far from that agenda that the GOP overstated the case. To the public they were the party of NO.They will not repeal it and in November they will be slaughtered. Pelosi gave a young President a spine that he lacked. She encouraged him to invest all of his political capital to promote this bill. People all over the world were tuned in to the pre vote and vote on Sunday. Their impression was that the Tea Party people were a bunch of racist crazies. The whites in this country must accept the fact that in 10 years we will become a minority. President Obama was empowered by the stand he took. He reached out his hand to a reluctant GOP and they slapped him down in a racist and demeaning way. This vote in the House was more significiant than the vote in November 2008. This President is now empowered to be another FDR.\nYou see, there are many Americans who eagerly anticipate living in a Third World hellhole with a corrupt nomenklatura.  They don’t want anything to do with liberty or the cultural traditions of the West.  And those conservatives who are so foolish as to support immigration have been actively doing their work for them for the last 24 years.  As for the political analysis, the only correct point is that Obama has been empowered by acting decisively.  To gain popularity in the polls, you have to lead them, not follow them.  While the Congressional Democrats will get destroyed in November, Obama may well come out of this very well.  If the bill is perceived to have ruined the health care system, it’s Pelosi’s bill.  If it is perceived to have been a success, he’ll take the credit.\nAnd, if he has to work with a Republican House and Senate, he’ll work towards a magnificent bipartisan immigration reform, importing tens of millions of third-worlders.  Remember, the economy is already toast, and he still has an out by sacrificing the bankers.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-24T14:15:00+00:00"
}