{
  "url": "https://voxday.net/2010/03/01/in-fairness-science-bloggers-are-rather/",
  "scraped_at": "2026-01-08T23:20:54.339006",
  "title": "In fairness, science bloggers are rather stupid",
  "date_display": "March 1, 2010",
  "date_iso": "2010-03-01T20:30:00+00:00",
  "date_from_url": "2010-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At least, the sort of science blogger I’ve encountered over the years, such as Myers, Brayton, and Orac, are.  They have reliably proven to be narrowly educated, logic-challenged, emotionally incontinent individuals with reading comprehension problems and an astonishing ignorance of recorded history.  They don’t seem to grasp that their paranoid “defense” of science against the hordes of creationists slavering to, well, <i>put stickers on textbooks</i> for fifth-graders who can barely manage to read or count to fiver doesn’t pass for science or its defense in the eyes of any rational observer.  You’d think science bloggers would worry a lot more about the economy than stickers and school boards, but then, they’re economic illiterates too.  But let the science journalists <a href=\"http://www.scientificblogging.com/science_20/science_journalists_have_met_enemy_and_they_are_bloggers\">speak for themselves</a>:</p><blockquote><p>Today who is treated with the most skepticism by the general public?  Science journalists and climate scientists.  Even Big Pharmacy marketing departments who have found a golden egg in the vaccine industry have more trust among the public.</p><p>Ghosh went on to say something that I know resonated with everyone in the room.  Journalists, he said, “do not defend science.  Ask the awkward questions.”</p><p>So Ghosh does not blame bloggers for the demise of science journalism, he seeks to get them back on the right path and once again become the “trusted guides” they once were regarding complex climate issues.  With him on the panel was Mariette DiChristina of “Scientific American”, who nodded at all the right places while he spoke, yet does not seem to realize that her magazine is a culprit along with the rest of them.   “Scientific American” is not a trusted guide, it is more like a tour guide in Istanbul who takes you on a tour that will always end at his brother’s carpet store.   And with that decrease in credibility has come a decrease in readership and jobs while a magazine like “The Scientist” still has high regard among scientists and casual science readers alike.</p><p>Kennedy had the most vitriol.  He did not dislike all blogs, he said, he read blogs on environmental policy and politics – in other words, he was willing to settle for opinion and lack of expertise on matters outside the science field – he just couldn’t find a single one in science worth a darn.   Only large newspapers and high end journals deserve to survive.</p></blockquote><p>Of course, most of this is simply Old Professional Media bitching about the Uncontrollable Amateur Media.  It’s still pretty funny, though, to see the editor-in-chief of <i>Science</i> ripping to shreds the very individuals who flatter themselves as being the brave guardians of science and secularism against the threat of a new religion-inspired Dark Ages.*  “Not worth a darn” is a bit more generous than I would grant, but it’s certainly an apt description.</p><p>*<i>I know.  And you know.  But they don’t, which tends to underline my point.</i></p><p> UPDATE – <a href=\"http://scienceblogs.com/dispatches/2010/03/vox_day_once_more_into_the_bre.php\">Ed Brayton underlines my point</a> about science bloggers and their relative lack of intelligence in both his failure to understand the logical irrelevance of the question he wanted to ask Washington as well as his amusing inability to keep his story straight.</p><p><i>“As for your challenge to debate, I will consider it – if you can give a coherent answer to the following question”</i><br> – Ed Brayton, February 26</br></p><p><i>“Ellis Washington did not challenge me to a debate.”</i><br> – Ed Brayton, March 1</br></p><p>Yeah, I’m sure Ed is one FEARSOME debater.  He’s probably doing the right thing by evading Washington, because even if Washington is a scientifically illiterate fool, that doesn’t mean that Brayton won’t shoot down his own argument without any help from Washington.  And Ed, perhaps your own readers needed it spelled out for them, but everyone else understood that you didn’t believe anyone could answer your irrelevant question.  That was kind of the point about how you’re using it avoid the risk of embarrassing yourself.</p><p>Which you’ve now managed to do anyhow.  No wonder the real science journalists have almost as much contempt for your kind as I do.</p></div>",
  "content_text": "At least, the sort of science blogger I’ve encountered over the years, such as Myers, Brayton, and Orac, are.  They have reliably proven to be narrowly educated, logic-challenged, emotionally incontinent individuals with reading comprehension problems and an astonishing ignorance of recorded history.  They don’t seem to grasp that their paranoid “defense” of science against the hordes of creationists slavering to, well,\nput stickers on textbooks\nfor fifth-graders who can barely manage to read or count to fiver doesn’t pass for science or its defense in the eyes of any rational observer.  You’d think science bloggers would worry a lot more about the economy than stickers and school boards, but then, they’re economic illiterates too.  But let the science journalists\nspeak for themselves\n:\nToday who is treated with the most skepticism by the general public?  Science journalists and climate scientists.  Even Big Pharmacy marketing departments who have found a golden egg in the vaccine industry have more trust among the public.\nGhosh went on to say something that I know resonated with everyone in the room.  Journalists, he said, “do not defend science.  Ask the awkward questions.”\nSo Ghosh does not blame bloggers for the demise of science journalism, he seeks to get them back on the right path and once again become the “trusted guides” they once were regarding complex climate issues.  With him on the panel was Mariette DiChristina of “Scientific American”, who nodded at all the right places while he spoke, yet does not seem to realize that her magazine is a culprit along with the rest of them.   “Scientific American” is not a trusted guide, it is more like a tour guide in Istanbul who takes you on a tour that will always end at his brother’s carpet store.   And with that decrease in credibility has come a decrease in readership and jobs while a magazine like “The Scientist” still has high regard among scientists and casual science readers alike.\nKennedy had the most vitriol.  He did not dislike all blogs, he said, he read blogs on environmental policy and politics – in other words, he was willing to settle for opinion and lack of expertise on matters outside the science field – he just couldn’t find a single one in science worth a darn.   Only large newspapers and high end journals deserve to survive.\nOf course, most of this is simply Old Professional Media bitching about the Uncontrollable Amateur Media.  It’s still pretty funny, though, to see the editor-in-chief of\nScience\nripping to shreds the very individuals who flatter themselves as being the brave guardians of science and secularism against the threat of a new religion-inspired Dark Ages.*  “Not worth a darn” is a bit more generous than I would grant, but it’s certainly an apt description.\n*\nI know.  And you know.  But they don’t, which tends to underline my point.\nUPDATE –\nEd Brayton underlines my point\nabout science bloggers and their relative lack of intelligence in both his failure to understand the logical irrelevance of the question he wanted to ask Washington as well as his amusing inability to keep his story straight.\n“As for your challenge to debate, I will consider it – if you can give a coherent answer to the following question”\n– Ed Brayton, February 26\n“Ellis Washington did not challenge me to a debate.”\n– Ed Brayton, March 1\nYeah, I’m sure Ed is one FEARSOME debater.  He’s probably doing the right thing by evading Washington, because even if Washington is a scientifically illiterate fool, that doesn’t mean that Brayton won’t shoot down his own argument without any help from Washington.  And Ed, perhaps your own readers needed it spelled out for them, but everyone else understood that you didn’t believe anyone could answer your irrelevant question.  That was kind of the point about how you’re using it avoid the risk of embarrassing yourself.\nWhich you’ve now managed to do anyhow.  No wonder the real science journalists have almost as much contempt for your kind as I do.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-01T20:30:00+00:00"
}