{
  "url": "https://voxday.net/2010/03/28/interview-with-john-derbyshire/",
  "scraped_at": "2026-01-08T23:23:16.503484",
  "title": "Interview with John Derbyshire",
  "date_display": "March 28, 2010",
  "date_iso": "2010-03-28T21:30:00+00:00",
  "date_from_url": "2010-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vox Day interviewed John Derbyshire, the National Review contributor and author of <a href=\"”http://www.amazon.com/Are-Doomed-Reclaiming-Conservative-Pessimism/dp/0307409589/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1269789793&amp;sr=8-1”\">We Are Doomed: Reclaiming Conservative Pessimism</a>, on March 23, 2010.</p><p><b>Who is this “we” of whom you speak?  Are you speaking of America, the West, conservatism, or the human race?</b></p><p>Primarily conservatism.  But touching in a larger way on Western civilization.</p><p><b>You’re a fairly serious student of science.  Isn’t your theme of doom somewhat in opposition to the usual notion of inevitable progress towards a shiny, sexy, science fiction future?</b></p><p>No, I don’t think so.  Science is neutral so far as optimism or pessimism is concerned.  Indeed, it is neutral so far as all the affairs of the heart are concerned.  As I said in the book, the universe doesn’t care what we think of it, it just goes on its way.  I understand what you mean, that sort of H.G. Wells breezy optimism about the prospects for the future based on our understanding more and more about the world is commonplace, although not as commonplace as it was when H.G. Wells was alive.  But it’s not founded in any solid principles.</p><p><b>Of the various issues you address directly, from politics, diversity, and culture to immigration, empire, and economy, which do you consider to be the most responsible for this doom?</b></p><p>Let’s see.  Probably nature.  Most of the truths about the world are contained in the world and they are contained in the nature of reality.  It’s that that drives everything.  I’m more and more inclined, and this is an odd sort of thing for a conservative to say, perhaps, but particularly this last few days, I’m more and more tempted to the old Marxian idea of impersonal forces driving our affairs, with we ourselves having very little to say about it.  That’s actually an awful thing to say and I’d like to qualify it at length, but that would take about 45 minutes, which of course we don’t have.  But that’s the mood that’s coming on me, I’m afraid.</p><p><b>Fortunately, we have no word limits on the blog.  I don’t know if you’re familiar with Robert Prechter and Elliott Wave theory, which applies primarily to the financial markets but can be utilized for purposes well beyond them.  Dating back to Tolstoy, there have been a number of non-Marxian thinkers who have reached similar conclusions about larger forces, waves of mass human emotion rather than individual decisions as per Great Man theory dictating events.</b></p><p>It’s a naughty business and obviously one wouldn’t want to discard altogether the possibility that things can be decisively turned this way or that by a single personality, by a Napoleon or an Alexander.  But possibly those turnings are just harmonics imposed on a bigger, deeper wave form driven by very cold natural forces.</p><p><b>What do you think some of those forces might be?  I mentioned waves of mass human emotion already, but do you have any other candidates in mind?</b></p><p>That’s fairly appealing.  I think so far as human history is concerned that in some way that we are not currently even close to understanding, somehow a kind of vector sum of individual human drives and emotions, a sum that is of hundreds of millions of such drives.  There probably are some kind of underlying laws there, if only we could discern them.</p><p><b>One of the most terrifying things I have ever read was Paul Krugman’s statement that he decided to become an economist after reading Isaac Asimov’s <i>Foundation</i> novels.</b></p><p>Yeah, we’re veering a bit close to that here, aren’t we?  It was Hari Seldon and psychohistory, wasn’t it?  I think if you think we’re close to understanding anything like that, you’re in the zone of what is called misplaced concreteness.  I think that’s far beyond our grasp at the moment.  But it’s very suggestive.  There are great forces and great tides at work, ebbing and flowing.  Perhaps we’ll understand them, though I doubt we’ll ever reduce them to mathematics as Hari Seldon did.  It’s a strong temptation for economists, and one reason to keep economists at arms-length.  They do tend to do this kind of thing.  You know, if it’s not Hari Seldon, it’s Ayn Rand, one of these other mechanistic thinkers.  We’re not even close to understanding any of those dynamics, but that doesn’t mean they might not be impersonal dynamics.</p><p><b>I am somewhat in awe of your prediction in the book that we shall all be Icelanders, given recent events of that island nation and our own debt/GDP ratio.  How was it that you so accurately foresaw the collapse into debt-servitude of the Icelandic economy?</b></p><p>(Chuckles)  Yes, yes.  Do you know the joke that was going around?  What’s the capital of Iceland?  About $45.  That was just fortuitous.  That was in my chapter on religion and when I spoke of us being Icelanders I was saying that even in the least religious nation in the world, where only two percent of the population attend church regularly, if you poll them you get big majorities believing in life after death, supernatural powers, and so on.  Just by way of illustrating the fact that you can have these diffuse spiritual longings, human beings do have them in the generality, without much in the way of organized religion.  It wasn’t actually related to the economics; although I would have liked to have predicted the economic crash in Iceland, but no, I didn’t.</p><p><b>I was aware of that, I just thought you might like to take the credit.  You know, one of the interesting data points in one of the Barna religion surveys was that half of the self-identified atheists surveyed believed in Heaven and Hell.</b></p><p>Oh yes, you get all kinds of things.  Way back when I was a student, I read Marghanita Laski’s very fine book, <i>Ecstasy in Secular and Religious Experience</i>.  It was an inquiry into the religious experience.  She found as many people she could who had claimed to have had a religious experience and asked them to describe it in order to draw out the common elements in the experiences, and some striking proportion of her respondents, something like 30 percent, were atheists!  Religious experiences for everyone!</p><p><b>Now, you’re not a religious man, but it seems to me there is a certain Voltairean theme in your book.  It is customary among the scientific cognoscenti to consider religion a sign of  backwardness, however, in <i>We Are Doomed</i>, one of the things you cite as evidence of our doom is this rising tide of unbelief.  How do you balance that in terms of where you stand between Voltaire on one side and Sam Harris on the other?</b></p><p>Well, there’s a tragic element there, always.  As a number of commentators have pointed out, if you survey the human race dispassionately, it’s hard not to come to the conclusion that a) human beings are better off with religion, and yet, b) religion is ultimately a wishful fantasy.  So that the kind of adherence to cold realism that you would want people to have in spheres like scientific inquiry and jurisprudence doesn’t serve the human race well if it is taken up in all aspects of life.  Probably people who are not very reflective – Hazlitt had a phrase that I liked very much, “the reflective portion of humanity” amongst which he of course included himself –  the reflective portion of humanity is probably only a quarter or a third of the human race at best.  And the rest, ordinary people who just want to go about their lives and raise their families and do some type of useful work, I doubt they can be sustained in life without some sort of supernatural beliefs.  So, yeah, there’s a tragic element there.  What one might wish human beings to be like and what they’re actually like is an unbridgeable gap.  That’s the tragic dimension.  But the Voltairean optimism is not apt, certainly not in our present circumstances.  I think we will lose our faith.  I think we’re losing it visibly.  I’ve been living in America since 1973 and this is a much less religious country now than it was then.  I give the example in the book of the countries I grew up adjacent to, Ireland and Wales, which were then deeply religious in the 1950s and are now completely irreligious.  They’re as irreligious as Iceland now, Ireland not quite, but Wales is there already.  I don’t know why this wouldn’t happen to any other Western country.  The cause is the same and the basic genetic stock is much the same.</p><p><b>Speaking of the change of nations, recent studies have shown that immigrants tend to lean heavily Democrat.  You’ve got a chapter devoted to immigration in the book, so how do you explain the continued enthusiasm for immigration into the USA among conservatives and the Republican Party?</b></p><p>It’s based in a heady optimism about American exceptionalism.  What I was really arguing about in my chapter in religion is American exceptionalism draining away.  The great exceptionalism that America has amongst Western nations is its religiosity.  That’s draining away.  I think a lot of American conservatives are very much attached to this notion of exceptionalism.  Patriotism is one of the half-dozen core features of conservatism, the belief that one’s own country is special and has some sort of special mission in the world.  That’s been a core feature, not just of American conservatism but every kind of conservatism.  Even the much older, European, Throne-and-Altar conservatism, the Squire Weston type in 18th century England.  The exceptionalism of “our King, our Church, our Nation”.  That’s a core feature, so in what does American exceptionalism consist?  And one of the things it consists of is this having been a nation populated in very recent times.  Most of the populating of American has taken place just in the last 400 years; that’s a very exceptional thing.  It makes us a new country, structurally, and American conservatives would like to feel that’s going to go on, that we’re going to go on populating ourselves.  I think that’s the main pull there.  But of course, it’s an illusion.  It’s a fantasy.  We already have far more people than we can reasonably support.  The ideal population for the continental USA is probably about 100 million, I should think.  It doesn’t make any sense in terms of economics or demographics.  But there’s the pull of wanting to be that unusual nation, wanting to maintain the things that made us what we are, one of those things having been <i>occasional</i> waves of mass immigration.  But you know, conservatives aren’t very knowledgeable here.  Peter Brimelow likes to point out that the New England states had practically zero immigration for 200 years, from the mid-17th century to the mid-19th century, from the last of the Pilgrims to the first of the Irish.  There was essentially no inflow into New England and the population increased naturally.  So, these spells of immigration were few and far between, but they caught the imagination of conservatives because they speak to our exceptionalism.</p><p><b>After the passage of the Obamacare bill, you made an analogy to a sinking cruise ship.  What are some of the issues that you feel have drawn the bilge-pumpers away from the pumps and onto the dance floor over the last two decades?</b></p><p>The temptations of power.  There’s always been enough discontent with the way things are going to draw people to vote conservatives into power now and again.   When conservatives are in power, then the temptations of power take over and they become statists.  They want to do things – they want to do <i>conservative things</i> – but the only way to do things is to use the apparatus of the federal government – so they then become proponents of federal power and are sucked into the abyss like that.  We’ve fallen into the trap of active conservatism, conservatism to do something, conservatism to ban something, conservatism to fix something.  And that really isn’t conservatism, it certainly isn’t real American conservatism.  That’s why I obsess about Calvin Coolidge, who was the quintessential American conservative.</p><p><b>I admired your refusal to end <i>We Are Doomed</i> on an up note.  Since you finished the book, have you seen any evidence that you need to alter your conclusions of doom?</b></p><p>Oh, none at all.  I think my conclusions stand.  I was writing something for NRO this morning and I was going to quote myself, the bit where I say that I fully expect to live the rest of my life without ever seeing any major conservative legislation passed.  I stand by that.  I think it looks better now than when I wrote it.</p><p><b>There is a lot of talk on National Review and elsewhere that the Obamacare bill is really going to energize the Right, that people are going to react strongly against the Congressional Democrats and Obama as a result of their ramming health care legislation down the collective throat of the country.  Do you think this is true and we’re on the verge of a 1994, Contract With America-style revolution or is something else in the cards?</b></p><p>So what if we are?  After ’94 came ’95.  The forces that are dragging the ship down quickly reasserted themselves after 1994 and they will after 2010.  They are irresistible, I’m sure.  Thomas Sowell, who in my book is a wise man, has a piece on NRO where he pours cold water on the dreams of 2010 being another 1994.  It just may not be like that, it may be a nine-days wonder and now that it’s done, everyone will just breathe a sigh of relief and say “oh, thank goodness we don’t have to talk about that stuff anymore.”  I think inertia will settle in.  I’m pessimistic.  (laughs)  So, don’t take it for granted that there’s going to be some huge upheaval in 2010.  A lot of politicians will get voted out of office, perhaps the balance of power will even change in the House.  But we’ll still have this president, we’ll still have this establishment, we’ll still have this Federal apparatus, we’ll still have a largely torpid general public not willing to concentrate very long on any of the things that matter.</p></div>",
  "content_text": "Vox Day interviewed John Derbyshire, the National Review contributor and author of\nWe Are Doomed: Reclaiming Conservative Pessimism\n, on March 23, 2010.\nWho is this “we” of whom you speak?  Are you speaking of America, the West, conservatism, or the human race?\nPrimarily conservatism.  But touching in a larger way on Western civilization.\nYou’re a fairly serious student of science.  Isn’t your theme of doom somewhat in opposition to the usual notion of inevitable progress towards a shiny, sexy, science fiction future?\nNo, I don’t think so.  Science is neutral so far as optimism or pessimism is concerned.  Indeed, it is neutral so far as all the affairs of the heart are concerned.  As I said in the book, the universe doesn’t care what we think of it, it just goes on its way.  I understand what you mean, that sort of H.G. Wells breezy optimism about the prospects for the future based on our understanding more and more about the world is commonplace, although not as commonplace as it was when H.G. Wells was alive.  But it’s not founded in any solid principles.\nOf the various issues you address directly, from politics, diversity, and culture to immigration, empire, and economy, which do you consider to be the most responsible for this doom?\nLet’s see.  Probably nature.  Most of the truths about the world are contained in the world and they are contained in the nature of reality.  It’s that that drives everything.  I’m more and more inclined, and this is an odd sort of thing for a conservative to say, perhaps, but particularly this last few days, I’m more and more tempted to the old Marxian idea of impersonal forces driving our affairs, with we ourselves having very little to say about it.  That’s actually an awful thing to say and I’d like to qualify it at length, but that would take about 45 minutes, which of course we don’t have.  But that’s the mood that’s coming on me, I’m afraid.\nFortunately, we have no word limits on the blog.  I don’t know if you’re familiar with Robert Prechter and Elliott Wave theory, which applies primarily to the financial markets but can be utilized for purposes well beyond them.  Dating back to Tolstoy, there have been a number of non-Marxian thinkers who have reached similar conclusions about larger forces, waves of mass human emotion rather than individual decisions as per Great Man theory dictating events.\nIt’s a naughty business and obviously one wouldn’t want to discard altogether the possibility that things can be decisively turned this way or that by a single personality, by a Napoleon or an Alexander.  But possibly those turnings are just harmonics imposed on a bigger, deeper wave form driven by very cold natural forces.\nWhat do you think some of those forces might be?  I mentioned waves of mass human emotion already, but do you have any other candidates in mind?\nThat’s fairly appealing.  I think so far as human history is concerned that in some way that we are not currently even close to understanding, somehow a kind of vector sum of individual human drives and emotions, a sum that is of hundreds of millions of such drives.  There probably are some kind of underlying laws there, if only we could discern them.\nOne of the most terrifying things I have ever read was Paul Krugman’s statement that he decided to become an economist after reading Isaac Asimov’s\nFoundation\nnovels.\nYeah, we’re veering a bit close to that here, aren’t we?  It was Hari Seldon and psychohistory, wasn’t it?  I think if you think we’re close to understanding anything like that, you’re in the zone of what is called misplaced concreteness.  I think that’s far beyond our grasp at the moment.  But it’s very suggestive.  There are great forces and great tides at work, ebbing and flowing.  Perhaps we’ll understand them, though I doubt we’ll ever reduce them to mathematics as Hari Seldon did.  It’s a strong temptation for economists, and one reason to keep economists at arms-length.  They do tend to do this kind of thing.  You know, if it’s not Hari Seldon, it’s Ayn Rand, one of these other mechanistic thinkers.  We’re not even close to understanding any of those dynamics, but that doesn’t mean they might not be impersonal dynamics.\nI am somewhat in awe of your prediction in the book that we shall all be Icelanders, given recent events of that island nation and our own debt/GDP ratio.  How was it that you so accurately foresaw the collapse into debt-servitude of the Icelandic economy?\n(Chuckles)  Yes, yes.  Do you know the joke that was going around?  What’s the capital of Iceland?  About $45.  That was just fortuitous.  That was in my chapter on religion and when I spoke of us being Icelanders I was saying that even in the least religious nation in the world, where only two percent of the population attend church regularly, if you poll them you get big majorities believing in life after death, supernatural powers, and so on.  Just by way of illustrating the fact that you can have these diffuse spiritual longings, human beings do have them in the generality, without much in the way of organized religion.  It wasn’t actually related to the economics; although I would have liked to have predicted the economic crash in Iceland, but no, I didn’t.\nI was aware of that, I just thought you might like to take the credit.  You know, one of the interesting data points in one of the Barna religion surveys was that half of the self-identified atheists surveyed believed in Heaven and Hell.\nOh yes, you get all kinds of things.  Way back when I was a student, I read Marghanita Laski’s very fine book,\nEcstasy in Secular and Religious Experience\n.  It was an inquiry into the religious experience.  She found as many people she could who had claimed to have had a religious experience and asked them to describe it in order to draw out the common elements in the experiences, and some striking proportion of her respondents, something like 30 percent, were atheists!  Religious experiences for everyone!\nNow, you’re not a religious man, but it seems to me there is a certain Voltairean theme in your book.  It is customary among the scientific cognoscenti to consider religion a sign of  backwardness, however, in\nWe Are Doomed\n, one of the things you cite as evidence of our doom is this rising tide of unbelief.  How do you balance that in terms of where you stand between Voltaire on one side and Sam Harris on the other?\nWell, there’s a tragic element there, always.  As a number of commentators have pointed out, if you survey the human race dispassionately, it’s hard not to come to the conclusion that a) human beings are better off with religion, and yet, b) religion is ultimately a wishful fantasy.  So that the kind of adherence to cold realism that you would want people to have in spheres like scientific inquiry and jurisprudence doesn’t serve the human race well if it is taken up in all aspects of life.  Probably people who are not very reflective – Hazlitt had a phrase that I liked very much, “the reflective portion of humanity” amongst which he of course included himself –  the reflective portion of humanity is probably only a quarter or a third of the human race at best.  And the rest, ordinary people who just want to go about their lives and raise their families and do some type of useful work, I doubt they can be sustained in life without some sort of supernatural beliefs.  So, yeah, there’s a tragic element there.  What one might wish human beings to be like and what they’re actually like is an unbridgeable gap.  That’s the tragic dimension.  But the Voltairean optimism is not apt, certainly not in our present circumstances.  I think we will lose our faith.  I think we’re losing it visibly.  I’ve been living in America since 1973 and this is a much less religious country now than it was then.  I give the example in the book of the countries I grew up adjacent to, Ireland and Wales, which were then deeply religious in the 1950s and are now completely irreligious.  They’re as irreligious as Iceland now, Ireland not quite, but Wales is there already.  I don’t know why this wouldn’t happen to any other Western country.  The cause is the same and the basic genetic stock is much the same.\nSpeaking of the change of nations, recent studies have shown that immigrants tend to lean heavily Democrat.  You’ve got a chapter devoted to immigration in the book, so how do you explain the continued enthusiasm for immigration into the USA among conservatives and the Republican Party?\nIt’s based in a heady optimism about American exceptionalism.  What I was really arguing about in my chapter in religion is American exceptionalism draining away.  The great exceptionalism that America has amongst Western nations is its religiosity.  That’s draining away.  I think a lot of American conservatives are very much attached to this notion of exceptionalism.  Patriotism is one of the half-dozen core features of conservatism, the belief that one’s own country is special and has some sort of special mission in the world.  That’s been a core feature, not just of American conservatism but every kind of conservatism.  Even the much older, European, Throne-and-Altar conservatism, the Squire Weston type in 18th century England.  The exceptionalism of “our King, our Church, our Nation”.  That’s a core feature, so in what does American exceptionalism consist?  And one of the things it consists of is this having been a nation populated in very recent times.  Most of the populating of American has taken place just in the last 400 years; that’s a very exceptional thing.  It makes us a new country, structurally, and American conservatives would like to feel that’s going to go on, that we’re going to go on populating ourselves.  I think that’s the main pull there.  But of course, it’s an illusion.  It’s a fantasy.  We already have far more people than we can reasonably support.  The ideal population for the continental USA is probably about 100 million, I should think.  It doesn’t make any sense in terms of economics or demographics.  But there’s the pull of wanting to be that unusual nation, wanting to maintain the things that made us what we are, one of those things having been\noccasional\nwaves of mass immigration.  But you know, conservatives aren’t very knowledgeable here.  Peter Brimelow likes to point out that the New England states had practically zero immigration for 200 years, from the mid-17th century to the mid-19th century, from the last of the Pilgrims to the first of the Irish.  There was essentially no inflow into New England and the population increased naturally.  So, these spells of immigration were few and far between, but they caught the imagination of conservatives because they speak to our exceptionalism.\nAfter the passage of the Obamacare bill, you made an analogy to a sinking cruise ship.  What are some of the issues that you feel have drawn the bilge-pumpers away from the pumps and onto the dance floor over the last two decades?\nThe temptations of power.  There’s always been enough discontent with the way things are going to draw people to vote conservatives into power now and again.   When conservatives are in power, then the temptations of power take over and they become statists.  They want to do things – they want to do\nconservative things\n– but the only way to do things is to use the apparatus of the federal government – so they then become proponents of federal power and are sucked into the abyss like that.  We’ve fallen into the trap of active conservatism, conservatism to do something, conservatism to ban something, conservatism to fix something.  And that really isn’t conservatism, it certainly isn’t real American conservatism.  That’s why I obsess about Calvin Coolidge, who was the quintessential American conservative.\nI admired your refusal to end\nWe Are Doomed\non an up note.  Since you finished the book, have you seen any evidence that you need to alter your conclusions of doom?\nOh, none at all.  I think my conclusions stand.  I was writing something for NRO this morning and I was going to quote myself, the bit where I say that I fully expect to live the rest of my life without ever seeing any major conservative legislation passed.  I stand by that.  I think it looks better now than when I wrote it.\nThere is a lot of talk on National Review and elsewhere that the Obamacare bill is really going to energize the Right, that people are going to react strongly against the Congressional Democrats and Obama as a result of their ramming health care legislation down the collective throat of the country.  Do you think this is true and we’re on the verge of a 1994, Contract With America-style revolution or is something else in the cards?\nSo what if we are?  After ’94 came ’95.  The forces that are dragging the ship down quickly reasserted themselves after 1994 and they will after 2010.  They are irresistible, I’m sure.  Thomas Sowell, who in my book is a wise man, has a piece on NRO where he pours cold water on the dreams of 2010 being another 1994.  It just may not be like that, it may be a nine-days wonder and now that it’s done, everyone will just breathe a sigh of relief and say “oh, thank goodness we don’t have to talk about that stuff anymore.”  I think inertia will settle in.  I’m pessimistic.  (laughs)  So, don’t take it for granted that there’s going to be some huge upheaval in 2010.  A lot of politicians will get voted out of office, perhaps the balance of power will even change in the House.  But we’ll still have this president, we’ll still have this establishment, we’ll still have this Federal apparatus, we’ll still have a largely torpid general public not willing to concentrate very long on any of the things that matter.",
  "tags": [
    "books",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-28T20:30:00+00:00"
}