{
  "url": "https://voxday.net/2010/03/01/interview-with-john-williams/",
  "scraped_at": "2026-01-08T23:20:48.837318",
  "title": "Interview with John Williams",
  "date_display": "March 1, 2010",
  "date_iso": "2010-03-01T06:00:00+00:00",
  "date_from_url": "2010-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Vox Day interviewed John Williams of <a href=\"http://www.shadowstats.com/\">Shadowstats</a> on April 26, 2009.  As of February 2010, his alternate statistics reported -4.5% GDP, 9.8% CPI-U, 21.2% unemployment, and -2.5% M3 for the U.S. economy.</i></p><p><b>What is your basis for believing the official statistics underestimate unemployment and inflation?</b></p><p>I’ve been a consulting economist for more than 25 years. What I have found over time is that public perceptions as to what’s happening in the economy have tended to vary increasingly from the official reporting, generally moving away from the common experience.  It appears to be moving towards generally weaker economic growth and stronger inflation than the government is reporting.  I’ve used econometric models over time for forecasting a variety of economic variables and I’ve found the ability of the official numbers to predict what was happening to be also weakening over time.  Some of the series are simply nonsense, they’re effectively political propaganda.  I’ll state that very specifically in terms of the GDP.</p><p>But the reason you’ve seen this shifting sentiment of the quality of the government statistics is that there have been methodological changes over time that have built in upside biases to the economic reporting and downside biases to the inflation reporting.  The changes that have been made often have had some academic basis for them.  I would contend that most of the changes have been primarily academic and have very little relationship to the real world.</p><p><b>Your GDP chart appears to show that the USA has been in recession since 2000, with only one quarter of positive growth in 2001.  That would make it twice is long as the Great Depression.  Do you think that is really the case?</b></p><p>I think you’ll find that we’ve had longer and deeper recessions than have been officially reported by the government.  What you see in terms of the year-to-year change is not necessarily the quarter to-quarter change.  You’ll see this on some of the better series that are more relevant to the GDP, payroll employment, industrial production, and such, used for timing recessions.  What is the official short-lived 2001 recession that has now disappeared from the GDP reporting probably began in late 1999 and dragged on into 2003.  And again, you can see those patterns in industrial production and payrolls, we did not have recovery when they called the end of the recession.  What we’re seeing now, in terms of the indicators I look at, is that the current recession probably started in the fourth quarter of 2006, that’s a year earlier than the National Bureau of Economic Research had it happening.  With that short a span between what can be distinguished as two recessions, it’s really just one double-dip recession similar to what we saw in the early 1980s.  The Great Depression was a double-dip recession too.</p><p>So yes, this is dragging out and this will likely be a longer downturn than any in the last century.  I think there may have been one or two that were longer in the 1800s, but what we’re seeing is a structural change.  It’s one that Alan Greenspan recognized and I think it’s one that’s generally recognized in Washington, but nothing that has been done in terms of stimulus will address it.  This is going to be a particularly protracted downturn, particularly deep and generally unresponsive to most of the stimulus thrown at it.</p><p><b>Are European economic statistics more accurate?  Because I’ve been reading in the German statistics, the British statistics, and the Japanese statistics, and all appear to be showing deeper recessions than the U.S. GDP statistics do.</b></p><p>I think they generally are.  There have been a lot of efforts to standardize and institutionalize what the U.S. has done, some countries have gone along with it, some have not, but there is a lot of variation between the statistics in different countries.  But I would say yes, not only are the European statistics more accurate, they’re also a little bit more open about their financial and banking problems.  I think they also have a more realistic outlook as to what is happening in the United States because they have a pretty good sense as to how the system gets politically manipulated here.</p><p><b>Wouldn’t underestimating inflation also have a significant effect on real economic growth, and does your GDP chart take the effects of your CPI calculations into account or not?</b></p><p>Yes, it does.  Real GDP growth, which is an inflation-adjusted GDP growth the way it is popularly followed, is an annualized quarter-to-quarter rate.  I think is a silly way to look at it only because the error in the reporting is so large that when you raise the growth rate to the 4th power you exaggerate what is a very poor quality number.  It’s not just CPI and it’s not just inflation.  If you use artificially low inflation, that will give you artificially strong GDP growth once it’s adjusted for inflation.  The CPI is not the same thing as the GDP price deflator; CPI is generally related to consumer spending, the deflator covers the industrial sector of the economy, imports and exports, etcetera.  It’s not a one-to-one relationship, but I would say that CPI is the major modifier in the adjustments that are made there.</p><p><b>Which of the three unemployment measures, U3, U6, or SGS Alternate, most closely track the economic statistics that are presently reported for the Great Depression?</b></p><p>The unemployment rates reported for the Great Depression were the creation of the academic community and the Social Security adminstration after the fact.  There was no unemployment reporting during the Great Depression, that started in 1940.  The Federal annual census did some measurements, but even there it wasn’t measuring unemployment, it was measuring what your general trade was versus whether or not you were actually employed.  So it’s a best guess that was generated by political entities.  I’ll contend that if you talk to an average individual and ask them whether or not they’re employed, they won’t hesitate to give you an answer.  It’s the type of thing that they can tell you right away whether or not it happens to match the government’s definition of employment and unemployment.  That gets to the crux of what I’m doing here with my numbers because I’m trying to look at them from a standpoint that has a basis in historical government surveying and yet at the same time reflect the common experience.</p><p><b>One thing that I’ve done is take the employment numbers from the old censuses and compare them to the total population figures.  Then you just have a straight-up percentage of how many people are nominally employed.   There are demographic issues that don’t factor in, but if you add the military, it gives you a much better picture.  In 1944, the military made up eight percent of the population!  How do you even begin to talk about unemployment when you’re ignoring eight percent of the population, all of which is of prime employment age?</b></p><p>That’s often why the WWII period is excluded from normal business cycle analysis.  It’s outside the norm of what you would see with a standard business cycle.  But to quickly answer your question on the unemployment measure, I would view that what came out of the estimates for 1933, taken as the peak of the Great Depression, where they had 25% broad unemployment and 34% unemployment estimated for the non-farm population, would generally be along the lines of asking people whether they were employed or unemployed.  The closest to this would be the SGS Alternate.  In terms of the unemployment rate in 1933, remember that something like 27 or 28 percent of the population was agricultural at the point.  Today it’s less than 2 percent.  If you’re trying to compare it to today, you have to compare it to the 34% non-farm rate.  In terms of the unemployment series that the government publishes from U1 to U6, U3 being the most popularly followed at 8.5 percent, U6 is around 15.6 percent, and my SGS Alternate is around 19.8 percent.  (NB: this interview took place ten months ago.  U3 is presently 9.7 percent and SGS Alternate is 21.5 percent.)</p><p><b>That’s still a long way from the 34% non-farm in 1933.</b></p><p>It is.  The only difference between my number and U6 is that I include marginal discouraged workers that the government defined away in 1994.  But these are people, if you asked them if they’re employed or unemployed, they’d say they’re unemployed.  A “discouraged” worker meets all the attributes of being unemployed, except they’re not actively looking for work because there are no jobs to be had.  The definitional change that was made in 1994 simply put a time limit on that; if you were discouraged for more than a year you were no longer counted as part of the labor force.  That removed several million out of the equation.  I estimate a number that is still generally proportionate; I think something around 20 percent is probably pretty close.  To put it in perspective, going back over the time between now and WWII, in the best of times you are down in the eight-to-nine percent range, which unsurprisingly matches the European experience.  In terms of how bad is it now versus how it was… this is the worst since 1975, it’s not worse than the Great Depression yet.</p><p><b>If I understand correctly, your methodology typically involves adding a fudge factor as a correction to the official statistics.  Is that correct?  Is it possible to recompute the statistics using the formulas that were previously used or is the data simply unavailable?</b></p><p>It’s not available.  And even if it were, it would be extremely expensive and time-consuming.  My measures are not perfect, they are estimates to give you an idea of what things would look like under different reporting circumstances.  In terms of the CPI, if you look at how things were calculated in 1980 you’re looking at a seven percent differential, versus the 1990 methodology where it’s a three percent differential.  But if you look at that seven percent, five percent comes directly from the BLS’s estimates as to the impact each different methodological change had on the reported annual rate of inflation.  Two percent comes from my estimates of factors that since 1990 such as the substitution effect, the weighting of the CPI index, as well as the shifting of retail prices and such.  If you read my answer to the government’s paper on misperceptions about the CPI, you will see my arguments.  The gist of it is that the way the CPI was originally used, the way most people believe that it is still used, is that it measures the change in the cost of living needed to maintain a constant standard of living, is not how it is being used now when it attempts to take into account presumed quality of life changes.</p><p><b>What, in your opinion, is the least accurate series and which is the most accurate?</b></p><p>The big three, CPI, GDP, and unemployment series that are so closely followed and are so important politically do tend to get the bulk of the manipulation.  Of those three, the GDP is the least accurate, followed by CPI, and then unemployment.  The CPI is probably the worst in terms of its negative real-world impact being misrepresented because people rely on it for financial decisions, the others are more informational.  I generally prefer private series, such as the Purchasing Managers survey, the Conference Board’s Help Wanted advertising measure, although their newspaper index has taken some hits due to the Internet.  Even allowing for that, it still telling you a very negative story on the employment picture.  The interesting thing is that if you look at the current year-over-year changes in that index in the nascent online industry, Conference Board and Monster.com, you’re seeing parallel declines.  That’s a series in transition, but the Help Wanted advertising is a good one.  The Purchasing Managers survey, in particular the New Orders component, is a very good leading indicator.   In terms of the government’s data, although you can have some monthly aberrations, the Retail Sales and the Industrial Production are reasonably clean.  I look at them as being pretty good indicators of what’s happening and what lies ahead.  Even the non-farm payrolls, once you get all the revisions in there, is pretty good.  New claims for unemployment is another one, but you can’t use the week-to-week change, you have to use the year-to-year smoothed over 17 weeks because the government does not seasonally adjust well.  They try, but they’ve never been successful at it.</p><p><b>There’s been a lot of talk of economic recovery beginning in late 2009 or 2010.  What do you see?</b></p><p>I don’t see that.  Even if there’s a change that would affect the economy, let’s say for example that the stimulus package was really effective, the economy does not turn on a dime.  If the stimulus package were effective, you might expect to see something towards the end of the year, but the stimulus itself is really minimal in the first year and does not address the structural problems.  I will contend that the recession is so deep that it’s going to absorb the stimulus package without the economy breaking the surface of the water.  We had a circumstance now where there is a real problem for the consumer tied to his income growth falling short of the rate of inflation.  If you look at the household income that was reported in the last poverty survey, both median and mean income growth, adjusted for the government’s own inflation numbers, has not recovered, they are still at pre-2001 recession levels.  If you look at real average weekly earnings, they still have not recovered from the levels preceding the 1973-1975 levels.  Average real weekly earnings are down 15 percent from where they were back in the early 1970s.  This has been an ongoing, developing problem as higher-paying jobs in production have been shifted off-shore.  As a result, we normally will see more than one breadwinner in a family while back the 1970s it would have been more common to only have one.  The average family is not making ends meet, the average individual is not making ends meet, and there is the big problem for the economy.  Unless you have a sustained growth in income that exceeds the rate of inflation, you’re not going to have sustained economic growth.  You’re not going to have sustained GDP growth unless you engage in temporary measures such as debt growth.</p><p>Greenspan saw this.  He was aware.  It was obvious for many years.  But particularly coming in in 1987, before the crash and the financial crisis that he would not let run its course, he took very deliberate action to encourage debt expansion over time which has been the primary fuel of economic growth over the last two decades.  Now we’re seeing the debt collapse and without people making adequate income over inflation and without being able to borrow, there is no way to get the economy growing by 2010.</p><p><b>It sounds to me as if you’re saying that there’s not much choice except to accept this structural change and deal with it.</b></p><p>Over time the system will be self-righting.  The ways of quickly addressing it would not be considered politically correct, such as to become more protectionist or rebuild the U.S. manufacturing base.  And there’s nothing in the works that’s going to turn this quickly.  Even if you started to do things like that, you’d probably be looking at a decade before you started to see results.  What we have ahead of us, what we’re in now, will be classified as a depression.  A decade or so back, I talked with the Bureau of Economic Analysis National Bureau of Economic Research about how they would define a depression in terms of how we look at things today, and came up with a consensus of sorts – it’s nothing official – of a peak-to-trough, inflation-adjusted contraction in GDP or broad economic activity in excess of 10 percent.  A great depression would be in excess of 25 percent.  If you look at series such as retail sales and industrial production, we’re seeing numbers that year-to-year are in the depression camp, durable goods orders and housing are in the great depression category.  Even in terms of GDP, there’s a chance of seeing a 10 percent decline if they don’t fudge it too heavily.  That would count as a depression.  In terms of a great depression, I think we’re going to have one but that is going to be in conjunction with hyperinflation.  You’re writing a book about the Great Depression, right?</p><p><b>It’s called <i>The Return of the Great Depression</i>, it will be out on the 80th anniversary of Black Tuesday.</b></p><p>That’s an interesting title because I’ll contend that what Roosevelt did in abandoning the gold standard, which freed him up to introduce the debt standard, really set us up for what we’re going through now.  The debt standard is now collapsing and you don’t have anything supporting it beyond the printing of the money which is now looming.  One of the other government statistics that I write about is the budget deficit based on GAAP accounting.  And although they argue about whether or not they should include the unfunded liabilities for Social Security and Medicare, they do at least footnote them and there have been times when they’ve included them.  If you look at that, last year you had a deficit of about $5 trillion.  It’s averaged $4 trillion since they began publishing the combined numbers back in 2000 or 2001.  That’s beyond containment.  You cannot raise taxes enough to cover that even if you take all of everyone’s income.  They’re still adding new unfunded programs, so there is just no way that the system survives.  We’re facing a GAAP-based deficit this year of around $8 trillion and net present value of unfunded Federal liabilities of around $65 trillion.  That’s bigger than the global GDP and even without the banking crisis, the country is effectively bankrupt and headed for debt-default, which I can’t see the U.S. doing. I think it’s more likely that they’ll go with the traditional solution which is revving up the printing presses and paying off the debts with a debased currency.</p><p>What’s happened with the current crisis is that the process has been accelerated.  The key here is the dollar.  You’ll start to see heavy dumping of the dollar, you’ll start to see very rapid inflation beginning with oil prices.  If I’m right in terms of hyperinflation, which could start anytime between the end of this year and 2014, that would throw you into a great depression.  If you look what happened in Zimbabwe, the hyperinflation there developed over a number of years but things still continued to function because they had a working black market in the U.S. dollar.  We don’t have a black market backup.  When it comes here, it’s going to be extremely disruptive and will probably bring normal commerce to a halt.</p></div>",
  "content_text": "Vox Day interviewed John Williams of\nShadowstats\non April 26, 2009.  As of February 2010, his alternate statistics reported -4.5% GDP, 9.8% CPI-U, 21.2% unemployment, and -2.5% M3 for the U.S. economy.\nWhat is your basis for believing the official statistics underestimate unemployment and inflation?\nI’ve been a consulting economist for more than 25 years. What I have found over time is that public perceptions as to what’s happening in the economy have tended to vary increasingly from the official reporting, generally moving away from the common experience.  It appears to be moving towards generally weaker economic growth and stronger inflation than the government is reporting.  I’ve used econometric models over time for forecasting a variety of economic variables and I’ve found the ability of the official numbers to predict what was happening to be also weakening over time.  Some of the series are simply nonsense, they’re effectively political propaganda.  I’ll state that very specifically in terms of the GDP.\nBut the reason you’ve seen this shifting sentiment of the quality of the government statistics is that there have been methodological changes over time that have built in upside biases to the economic reporting and downside biases to the inflation reporting.  The changes that have been made often have had some academic basis for them.  I would contend that most of the changes have been primarily academic and have very little relationship to the real world.\nYour GDP chart appears to show that the USA has been in recession since 2000, with only one quarter of positive growth in 2001.  That would make it twice is long as the Great Depression.  Do you think that is really the case?\nI think you’ll find that we’ve had longer and deeper recessions than have been officially reported by the government.  What you see in terms of the year-to-year change is not necessarily the quarter to-quarter change.  You’ll see this on some of the better series that are more relevant to the GDP, payroll employment, industrial production, and such, used for timing recessions.  What is the official short-lived 2001 recession that has now disappeared from the GDP reporting probably began in late 1999 and dragged on into 2003.  And again, you can see those patterns in industrial production and payrolls, we did not have recovery when they called the end of the recession.  What we’re seeing now, in terms of the indicators I look at, is that the current recession probably started in the fourth quarter of 2006, that’s a year earlier than the National Bureau of Economic Research had it happening.  With that short a span between what can be distinguished as two recessions, it’s really just one double-dip recession similar to what we saw in the early 1980s.  The Great Depression was a double-dip recession too.\nSo yes, this is dragging out and this will likely be a longer downturn than any in the last century.  I think there may have been one or two that were longer in the 1800s, but what we’re seeing is a structural change.  It’s one that Alan Greenspan recognized and I think it’s one that’s generally recognized in Washington, but nothing that has been done in terms of stimulus will address it.  This is going to be a particularly protracted downturn, particularly deep and generally unresponsive to most of the stimulus thrown at it.\nAre European economic statistics more accurate?  Because I’ve been reading in the German statistics, the British statistics, and the Japanese statistics, and all appear to be showing deeper recessions than the U.S. GDP statistics do.\nI think they generally are.  There have been a lot of efforts to standardize and institutionalize what the U.S. has done, some countries have gone along with it, some have not, but there is a lot of variation between the statistics in different countries.  But I would say yes, not only are the European statistics more accurate, they’re also a little bit more open about their financial and banking problems.  I think they also have a more realistic outlook as to what is happening in the United States because they have a pretty good sense as to how the system gets politically manipulated here.\nWouldn’t underestimating inflation also have a significant effect on real economic growth, and does your GDP chart take the effects of your CPI calculations into account or not?\nYes, it does.  Real GDP growth, which is an inflation-adjusted GDP growth the way it is popularly followed, is an annualized quarter-to-quarter rate.  I think is a silly way to look at it only because the error in the reporting is so large that when you raise the growth rate to the 4th power you exaggerate what is a very poor quality number.  It’s not just CPI and it’s not just inflation.  If you use artificially low inflation, that will give you artificially strong GDP growth once it’s adjusted for inflation.  The CPI is not the same thing as the GDP price deflator; CPI is generally related to consumer spending, the deflator covers the industrial sector of the economy, imports and exports, etcetera.  It’s not a one-to-one relationship, but I would say that CPI is the major modifier in the adjustments that are made there.\nWhich of the three unemployment measures, U3, U6, or SGS Alternate, most closely track the economic statistics that are presently reported for the Great Depression?\nThe unemployment rates reported for the Great Depression were the creation of the academic community and the Social Security adminstration after the fact.  There was no unemployment reporting during the Great Depression, that started in 1940.  The Federal annual census did some measurements, but even there it wasn’t measuring unemployment, it was measuring what your general trade was versus whether or not you were actually employed.  So it’s a best guess that was generated by political entities.  I’ll contend that if you talk to an average individual and ask them whether or not they’re employed, they won’t hesitate to give you an answer.  It’s the type of thing that they can tell you right away whether or not it happens to match the government’s definition of employment and unemployment.  That gets to the crux of what I’m doing here with my numbers because I’m trying to look at them from a standpoint that has a basis in historical government surveying and yet at the same time reflect the common experience.\nOne thing that I’ve done is take the employment numbers from the old censuses and compare them to the total population figures.  Then you just have a straight-up percentage of how many people are nominally employed.   There are demographic issues that don’t factor in, but if you add the military, it gives you a much better picture.  In 1944, the military made up eight percent of the population!  How do you even begin to talk about unemployment when you’re ignoring eight percent of the population, all of which is of prime employment age?\nThat’s often why the WWII period is excluded from normal business cycle analysis.  It’s outside the norm of what you would see with a standard business cycle.  But to quickly answer your question on the unemployment measure, I would view that what came out of the estimates for 1933, taken as the peak of the Great Depression, where they had 25% broad unemployment and 34% unemployment estimated for the non-farm population, would generally be along the lines of asking people whether they were employed or unemployed.  The closest to this would be the SGS Alternate.  In terms of the unemployment rate in 1933, remember that something like 27 or 28 percent of the population was agricultural at the point.  Today it’s less than 2 percent.  If you’re trying to compare it to today, you have to compare it to the 34% non-farm rate.  In terms of the unemployment series that the government publishes from U1 to U6, U3 being the most popularly followed at 8.5 percent, U6 is around 15.6 percent, and my SGS Alternate is around 19.8 percent.  (NB: this interview took place ten months ago.  U3 is presently 9.7 percent and SGS Alternate is 21.5 percent.)\nThat’s still a long way from the 34% non-farm in 1933.\nIt is.  The only difference between my number and U6 is that I include marginal discouraged workers that the government defined away in 1994.  But these are people, if you asked them if they’re employed or unemployed, they’d say they’re unemployed.  A “discouraged” worker meets all the attributes of being unemployed, except they’re not actively looking for work because there are no jobs to be had.  The definitional change that was made in 1994 simply put a time limit on that; if you were discouraged for more than a year you were no longer counted as part of the labor force.  That removed several million out of the equation.  I estimate a number that is still generally proportionate; I think something around 20 percent is probably pretty close.  To put it in perspective, going back over the time between now and WWII, in the best of times you are down in the eight-to-nine percent range, which unsurprisingly matches the European experience.  In terms of how bad is it now versus how it was… this is the worst since 1975, it’s not worse than the Great Depression yet.\nIf I understand correctly, your methodology typically involves adding a fudge factor as a correction to the official statistics.  Is that correct?  Is it possible to recompute the statistics using the formulas that were previously used or is the data simply unavailable?\nIt’s not available.  And even if it were, it would be extremely expensive and time-consuming.  My measures are not perfect, they are estimates to give you an idea of what things would look like under different reporting circumstances.  In terms of the CPI, if you look at how things were calculated in 1980 you’re looking at a seven percent differential, versus the 1990 methodology where it’s a three percent differential.  But if you look at that seven percent, five percent comes directly from the BLS’s estimates as to the impact each different methodological change had on the reported annual rate of inflation.  Two percent comes from my estimates of factors that since 1990 such as the substitution effect, the weighting of the CPI index, as well as the shifting of retail prices and such.  If you read my answer to the government’s paper on misperceptions about the CPI, you will see my arguments.  The gist of it is that the way the CPI was originally used, the way most people believe that it is still used, is that it measures the change in the cost of living needed to maintain a constant standard of living, is not how it is being used now when it attempts to take into account presumed quality of life changes.\nWhat, in your opinion, is the least accurate series and which is the most accurate?\nThe big three, CPI, GDP, and unemployment series that are so closely followed and are so important politically do tend to get the bulk of the manipulation.  Of those three, the GDP is the least accurate, followed by CPI, and then unemployment.  The CPI is probably the worst in terms of its negative real-world impact being misrepresented because people rely on it for financial decisions, the others are more informational.  I generally prefer private series, such as the Purchasing Managers survey, the Conference Board’s Help Wanted advertising measure, although their newspaper index has taken some hits due to the Internet.  Even allowing for that, it still telling you a very negative story on the employment picture.  The interesting thing is that if you look at the current year-over-year changes in that index in the nascent online industry, Conference Board and Monster.com, you’re seeing parallel declines.  That’s a series in transition, but the Help Wanted advertising is a good one.  The Purchasing Managers survey, in particular the New Orders component, is a very good leading indicator.   In terms of the government’s data, although you can have some monthly aberrations, the Retail Sales and the Industrial Production are reasonably clean.  I look at them as being pretty good indicators of what’s happening and what lies ahead.  Even the non-farm payrolls, once you get all the revisions in there, is pretty good.  New claims for unemployment is another one, but you can’t use the week-to-week change, you have to use the year-to-year smoothed over 17 weeks because the government does not seasonally adjust well.  They try, but they’ve never been successful at it.\nThere’s been a lot of talk of economic recovery beginning in late 2009 or 2010.  What do you see?\nI don’t see that.  Even if there’s a change that would affect the economy, let’s say for example that the stimulus package was really effective, the economy does not turn on a dime.  If the stimulus package were effective, you might expect to see something towards the end of the year, but the stimulus itself is really minimal in the first year and does not address the structural problems.  I will contend that the recession is so deep that it’s going to absorb the stimulus package without the economy breaking the surface of the water.  We had a circumstance now where there is a real problem for the consumer tied to his income growth falling short of the rate of inflation.  If you look at the household income that was reported in the last poverty survey, both median and mean income growth, adjusted for the government’s own inflation numbers, has not recovered, they are still at pre-2001 recession levels.  If you look at real average weekly earnings, they still have not recovered from the levels preceding the 1973-1975 levels.  Average real weekly earnings are down 15 percent from where they were back in the early 1970s.  This has been an ongoing, developing problem as higher-paying jobs in production have been shifted off-shore.  As a result, we normally will see more than one breadwinner in a family while back the 1970s it would have been more common to only have one.  The average family is not making ends meet, the average individual is not making ends meet, and there is the big problem for the economy.  Unless you have a sustained growth in income that exceeds the rate of inflation, you’re not going to have sustained economic growth.  You’re not going to have sustained GDP growth unless you engage in temporary measures such as debt growth.\nGreenspan saw this.  He was aware.  It was obvious for many years.  But particularly coming in in 1987, before the crash and the financial crisis that he would not let run its course, he took very deliberate action to encourage debt expansion over time which has been the primary fuel of economic growth over the last two decades.  Now we’re seeing the debt collapse and without people making adequate income over inflation and without being able to borrow, there is no way to get the economy growing by 2010.\nIt sounds to me as if you’re saying that there’s not much choice except to accept this structural change and deal with it.\nOver time the system will be self-righting.  The ways of quickly addressing it would not be considered politically correct, such as to become more protectionist or rebuild the U.S. manufacturing base.  And there’s nothing in the works that’s going to turn this quickly.  Even if you started to do things like that, you’d probably be looking at a decade before you started to see results.  What we have ahead of us, what we’re in now, will be classified as a depression.  A decade or so back, I talked with the Bureau of Economic Analysis National Bureau of Economic Research about how they would define a depression in terms of how we look at things today, and came up with a consensus of sorts – it’s nothing official – of a peak-to-trough, inflation-adjusted contraction in GDP or broad economic activity in excess of 10 percent.  A great depression would be in excess of 25 percent.  If you look at series such as retail sales and industrial production, we’re seeing numbers that year-to-year are in the depression camp, durable goods orders and housing are in the great depression category.  Even in terms of GDP, there’s a chance of seeing a 10 percent decline if they don’t fudge it too heavily.  That would count as a depression.  In terms of a great depression, I think we’re going to have one but that is going to be in conjunction with hyperinflation.  You’re writing a book about the Great Depression, right?\nIt’s called\nThe Return of the Great Depression\n, it will be out on the 80th anniversary of Black Tuesday.\nThat’s an interesting title because I’ll contend that what Roosevelt did in abandoning the gold standard, which freed him up to introduce the debt standard, really set us up for what we’re going through now.  The debt standard is now collapsing and you don’t have anything supporting it beyond the printing of the money which is now looming.  One of the other government statistics that I write about is the budget deficit based on GAAP accounting.  And although they argue about whether or not they should include the unfunded liabilities for Social Security and Medicare, they do at least footnote them and there have been times when they’ve included them.  If you look at that, last year you had a deficit of about $5 trillion.  It’s averaged $4 trillion since they began publishing the combined numbers back in 2000 or 2001.  That’s beyond containment.  You cannot raise taxes enough to cover that even if you take all of everyone’s income.  They’re still adding new unfunded programs, so there is just no way that the system survives.  We’re facing a GAAP-based deficit this year of around $8 trillion and net present value of unfunded Federal liabilities of around $65 trillion.  That’s bigger than the global GDP and even without the banking crisis, the country is effectively bankrupt and headed for debt-default, which I can’t see the U.S. doing. I think it’s more likely that they’ll go with the traditional solution which is revving up the printing presses and paying off the debts with a debased currency.\nWhat’s happened with the current crisis is that the process has been accelerated.  The key here is the dollar.  You’ll start to see heavy dumping of the dollar, you’ll start to see very rapid inflation beginning with oil prices.  If I’m right in terms of hyperinflation, which could start anytime between the end of this year and 2014, that would throw you into a great depression.  If you look what happened in Zimbabwe, the hyperinflation there developed over a number of years but things still continued to function because they had a working black market in the U.S. dollar.  We don’t have a black market backup.  When it comes here, it’s going to be extremely disruptive and will probably bring normal commerce to a halt.",
  "tags": [
    "economics",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-01T06:00:00+00:00"
}