{
  "url": "https://voxday.net/2010/03/15/mailvox-atheists-write/",
  "scraped_at": "2026-01-08T23:22:05.258890",
  "title": "Mailvox: in which the shining void is reached",
  "date_display": "March 15, 2010",
  "date_iso": "2010-03-15T21:42:00+00:00",
  "date_from_url": "2010-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MH stumbled across the column today:</p><blockquote><p>I think Richard Dawkins is tremendous, and I’m not a socially maladjusted loser, although must admit that being called that is quite a convincing argument that perhaps I’m wrong!  Maybe I should rethink my ways or I’ll be called names.  I essentially believe in freedom, capitalism, individualism, and reason.  I’m a conservative in all things non god-related, and can’t stand progressives and their broken ideas. What I don’t understand about conservative sites like wnd is that they can be so right on so many things, then at the last second have to throw in, oh we also believe in god, santa claus, and the easter bunny.</p><p>My experience tells me that people today believe in god mostly because of family pressures, or the mistaken idea that life has no meaning on Earth if they don’t so they can’t let go of the idea.  But god is like phlogiston, an idea that had some usefulness before understanding of how the world works progressed to the point where it was obvious it was a human proposal that was just incorrect and needed to be discarded.  The common thread between most progressive ideas is the desire to reach a certain conclusion at all costs, the determination that their conclusion must be true because they want/need it to be, then embark on a complex mission of torturing logic so they can desperately avoid reality.  Most conservative ideas however embrace reality for what it is — until you get to this one glaring exception they can’t seem to let go of.</p><p>What book(s) would you recommend for someone seeking to learn more about people like yourself who seem otherwise incredibly intelligent yet can’t seem to let go of this one bad idea?  I’m seeking books based on rational arguments, preferably low on the name-calling intimidation tactics you personally seem fond of that just undermine your cause.</p></blockquote><p>First, I’d like to point out that I only described Richard Dawkins’s biggest fans – the former RD.Net crowd – as socially maladjusted losers.  Any substantial perusal of those old forums will suffice to prove my point, further supported by Dawkins’s own reaction to his erstwhile fan club.  Second, the connection that you are missing between freedom, capitalism, individualism, reason, and a belief in God is that the first four are heavily dependent upon the fifth.  This is not controversial; non-Christians and even non-believers such as Socrates, Seneca, and Voltaire have subscribed to it.  You would do well to examine the difference between historical pagan societies and Christian society before concluding that your phlogiston hypothesis is even remotely credible.  Keep in mind that you still live in a heavily Christian society, where even the atheists, as Michel Onfray points out, are <i>Christian</i> atheists.  And, as I’ve pointed out, it is already clear that it is not secular scientopia that is the post-Christian heir, but rather a return to paganism.</p><p>I don’t read apologetics, so I’m afraid I can’t recommend much in the way of a positive, non-argumentative case for Christianity although I’m sure a number of commenters here will have some recommendations for you.  My Christian faith and my allegiance to Jesus Christ stems from my experience and observation of evil, so it’s not a line of reasoning that is likely to make a great deal of sense to anyone who lacks it.  But I would greatly encourage you to read Thucydides and his History of the Peloponnesian War, Caesar’s Commentaries, and other works of pre-Christian history so that you will have a more accurate picture of what a society without God is like.  Then, perhaps you will have a better perspective on the connection between those things you accept and that which you reject.</p><p>JC also shares his two cents:</p><blockquote><p>Day:</p><p>Your slide show isn’t all that impressive. I’ll cross the IQ bridge first and get it out of the way.  My IQ is 156 and I’m an atheist. I suppose that stupid ignorance would be blissful, but I can’t swallow Christianity.</p><p>Religion has been around longer than modern science – your point?</p><p>Here’s the deal, Vox. I don’t believe that an invisible man in the sky is talking to you. I think you’re blowing smoke – like the religious have done for centuries.</p><p>JC<br> Member and Sponsor – American Atheists</br></p></blockquote><p>The relevant question isn’t if the slideshow is impressive or not, but is it accurate or not?  It’s interesting how nearly every atheist who has emailed or commented today hasn’t dared to take any direct issue with any of the refutations and claim that the New Atheist arguments are, in fact, correct.  And anyone with an IQ of 156 should have absolutely no trouble understanding the point regarding the significance of the degree to which religion preceded science in light of Sam Harris’s claim that religion + science = human extinction.</p><p>But, since even atheists with 156 IQs apparently have some trouble applying basic logic, I will spell it out.  Since religion has only caused 7% of the wars in human history and has never once threatened the existence of the species in 11,600 years, at least 93% of the threat to continued human existence will remain even if religion is eliminated tomorrow.  This means that the threat of extinction has virtually nothing to do with religion, it is the direct result of science.  If the threat is real – and naturally we must assume that Sam Harris, PhD, knows whereof he speaks – then logic dictates the only way to eliminate it is to end science.  To the extent that religion and science are in opposition, then, the only rational response to the threat of human extinction is to embrace religion, regardless of one’s personal beliefs in any religious tenets, and make full use of it to the maximum extent possible in order to eliminate science.</p><p>But I am humbly grateful to JC.   While I can envision a more perfect state of indifference, it would take ten Siddharthas medidating ten centuries to reach this amazing state of Śūnyatā to which his assertion of his opinion has propelled me….  I can see… everything!  I can feel… everything!</p></div>",
  "content_text": "MH stumbled across the column today:\nI think Richard Dawkins is tremendous, and I’m not a socially maladjusted loser, although must admit that being called that is quite a convincing argument that perhaps I’m wrong!  Maybe I should rethink my ways or I’ll be called names.  I essentially believe in freedom, capitalism, individualism, and reason.  I’m a conservative in all things non god-related, and can’t stand progressives and their broken ideas. What I don’t understand about conservative sites like wnd is that they can be so right on so many things, then at the last second have to throw in, oh we also believe in god, santa claus, and the easter bunny.\nMy experience tells me that people today believe in god mostly because of family pressures, or the mistaken idea that life has no meaning on Earth if they don’t so they can’t let go of the idea.  But god is like phlogiston, an idea that had some usefulness before understanding of how the world works progressed to the point where it was obvious it was a human proposal that was just incorrect and needed to be discarded.  The common thread between most progressive ideas is the desire to reach a certain conclusion at all costs, the determination that their conclusion must be true because they want/need it to be, then embark on a complex mission of torturing logic so they can desperately avoid reality.  Most conservative ideas however embrace reality for what it is — until you get to this one glaring exception they can’t seem to let go of.\nWhat book(s) would you recommend for someone seeking to learn more about people like yourself who seem otherwise incredibly intelligent yet can’t seem to let go of this one bad idea?  I’m seeking books based on rational arguments, preferably low on the name-calling intimidation tactics you personally seem fond of that just undermine your cause.\nFirst, I’d like to point out that I only described Richard Dawkins’s biggest fans – the former RD.Net crowd – as socially maladjusted losers.  Any substantial perusal of those old forums will suffice to prove my point, further supported by Dawkins’s own reaction to his erstwhile fan club.  Second, the connection that you are missing between freedom, capitalism, individualism, reason, and a belief in God is that the first four are heavily dependent upon the fifth.  This is not controversial; non-Christians and even non-believers such as Socrates, Seneca, and Voltaire have subscribed to it.  You would do well to examine the difference between historical pagan societies and Christian society before concluding that your phlogiston hypothesis is even remotely credible.  Keep in mind that you still live in a heavily Christian society, where even the atheists, as Michel Onfray points out, are\nChristian\natheists.  And, as I’ve pointed out, it is already clear that it is not secular scientopia that is the post-Christian heir, but rather a return to paganism.\nI don’t read apologetics, so I’m afraid I can’t recommend much in the way of a positive, non-argumentative case for Christianity although I’m sure a number of commenters here will have some recommendations for you.  My Christian faith and my allegiance to Jesus Christ stems from my experience and observation of evil, so it’s not a line of reasoning that is likely to make a great deal of sense to anyone who lacks it.  But I would greatly encourage you to read Thucydides and his History of the Peloponnesian War, Caesar’s Commentaries, and other works of pre-Christian history so that you will have a more accurate picture of what a society without God is like.  Then, perhaps you will have a better perspective on the connection between those things you accept and that which you reject.\nJC also shares his two cents:\nDay:\nYour slide show isn’t all that impressive. I’ll cross the IQ bridge first and get it out of the way.  My IQ is 156 and I’m an atheist. I suppose that stupid ignorance would be blissful, but I can’t swallow Christianity.\nReligion has been around longer than modern science – your point?\nHere’s the deal, Vox. I don’t believe that an invisible man in the sky is talking to you. I think you’re blowing smoke – like the religious have done for centuries.\nJC\nMember and Sponsor – American Atheists\nThe relevant question isn’t if the slideshow is impressive or not, but is it accurate or not?  It’s interesting how nearly every atheist who has emailed or commented today hasn’t dared to take any direct issue with any of the refutations and claim that the New Atheist arguments are, in fact, correct.  And anyone with an IQ of 156 should have absolutely no trouble understanding the point regarding the significance of the degree to which religion preceded science in light of Sam Harris’s claim that religion + science = human extinction.\nBut, since even atheists with 156 IQs apparently have some trouble applying basic logic, I will spell it out.  Since religion has only caused 7% of the wars in human history and has never once threatened the existence of the species in 11,600 years, at least 93% of the threat to continued human existence will remain even if religion is eliminated tomorrow.  This means that the threat of extinction has virtually nothing to do with religion, it is the direct result of science.  If the threat is real – and naturally we must assume that Sam Harris, PhD, knows whereof he speaks – then logic dictates the only way to eliminate it is to end science.  To the extent that religion and science are in opposition, then, the only rational response to the threat of human extinction is to embrace religion, regardless of one’s personal beliefs in any religious tenets, and make full use of it to the maximum extent possible in order to eliminate science.\nBut I am humbly grateful to JC.   While I can envision a more perfect state of indifference, it would take ten Siddharthas medidating ten centuries to reach this amazing state of Śūnyatā to which his assertion of his opinion has propelled me….  I can see… everything!  I can feel… everything!",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-15T21:42:00+00:00"
}