{
  "url": "https://voxday.net/2010/03/19/mailvox-book-for-suckers/",
  "scraped_at": "2026-01-08T23:22:23.599465",
  "title": "Mailvox: inference and fact",
  "date_display": "March 19, 2010",
  "date_iso": "2010-03-19T11:55:00+00:00",
  "date_from_url": "2010-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Blackblade explains his take on Richard Dawkins’s invalid substitution of inference for fact in his latest book, <i>The Greatest Show on Earth</i>:</p><blockquote><p>My reading may be oversimplifying but, summarising, his fundamental assertion is this: <i>There is sufficient evidence, direct and inferred, to prove that evolution has occurred (although not the mechanism by which it did so), to the normal standards of such proof and it should therefore be viewed as fact.</i></p><p>He then attempts to justify his nomenclature of evolution as a “fact” by somewhat confusing hypotheses, theorems and facts and the definition thereof. He even goes so far as to create a new one called theorums so as to be more precise in his meaning. However, since you made a few words up yourself in TIA for a similar purpose I think you can’t complain on that one too much 🙂 But, yes, I do agree that your original point was valid.</p><p>However, and this is why I made my original point, the whole thing is a distraction from the fundamental issue … is there sufficient evidence to conclude that evolution has occurred and with what degree of confidence … the nomenclature of what confidence level deserves the imprimatur “Fact” is, to me at least, largely inconsequential and Dawkins would have done well to have avoided the pseudo-philosophical and just focused on the evidence.</p></blockquote><p>I certainly can’t disagree with the latter part of that statement.  Dawkins would always do well to avoid anything that is even remotely philosophical, pseudo or otherwise, since philosophy is demonstrably outside both his competence and his interest.  However, what Blackblade is missing here is that <i>The Greatest Show on Earth</i> is not a rational case for the theory of evolution by natural selection or possibly something else.  It is instead a polemical work of propaganda; as in <i>The God Delusion</i>, Dawkins is not presenting his case and methodically supporting that case with evidence, he is instead merely attempting to browbeat and bedazzle the careless or moderately intelligent reader into accepting something that is provably and demonstrably untrue.  The reason that Dawkins could not simply focus on the evidence because the evidence, scientific and otherwise, is insufficient to make a convincing case, let alone a conclusive one.</p><p>Consider the insidious and characteristic bait-and-switch in which Dawkins engages in the first chapter alone:</p><p>“Evolution is a fact.  Beyond reasonable doubt.  Beyond serious doubt, beyond sane, informed, intelligent doubt, beyond doubt evolution is a fact.”</p><p>“Evolution is a fact, and this book will demonstrate it.”</p><p>“I shall demonstrate that evolution is an inescapable fact.”</p><p>“I shall show the irrefragable power of the inference that evolution is a fact.”</p><p>Notice the rapid devolution in Dawkins’s case from “evolution is an inescapable fact” to “I infer that evolution is a fact”.  These are two very different statements because an inference is not a fact, by definition.  It cannot reasonably be considered a fact no matter how much Dawkins elects to argue that it can be.  And Dawkins knows this perfectly well, for he even writes: “The dictionary definition of a fact mentions ‘<i>actual obervation</i> or authentic testimony, as opposed to <i>what is merely inferred</i>‘ (emphasis added).  The implied pejorative of that ‘merely’ is a bit of a cheek.  Careful inference can be more reliable than ‘actual observation’, however strongly our intuition protests at it.”</p><p>But what Dawkins has done here is to cherry-pick aspects of the definition of “fact” and silently substitute “apparent fact” for “fact” in order to dishonestly justify his substitution of inference for fact.  It is true that careful inference can be more reliable than actual observation, but it is also true that astrology, blind luck, and women’s intuition can be more reliable than actual observation.  None of these comparisons of reliability have anything to do with the definition of a fact.  In addition to leaving out the greater portion of the definition, Dawkins skates over the obvious distinction between fact and apparent fact, which is to say that if an observation or testimony is incorrect, then the claim based on that observation or testimony <i>is clearly not a fact.</i> Now let’s consider the definition.</p><p>FACT<br> –noun</br></p><p>1. something that actually exists; reality; truth<br> 2. something known to exist or to have happened<br> 3. a truth known by actual experience or observation; something known to be true<br> 4. something said to be true or supposed to have happened</br></br></br></p><p>Dawkins blatantly leaves out the first two definitions and the second part of the third one in a devious attempt to leverage the small opening provided by the first part of the third one into misleading the reader into accepting the idea that an inference is equivalent to a fact.  But it is not.  It cannot be, according to its own definition.</p><p>INFERENCE<br> –noun</br></p><p>1. the act or process of inferring.<br> 2. something that is inferred<br> 3. Logic. <br> a.  the process of deriving the strict logical consequences of assumed premises.<br> b. the process of arriving at some conclusion that, though it is not logically derivable from the assumed premises, possesses some degree of probability relative to the premises.<br> c. a proposition reached by a process of inference.</br></br></br></br></br></p><p>Of course, the reason that Dawkins wants to claim that his proposition, his conclusion with some degree of probability that is not logically derivable from the premises, is something that known to exist or have happened, is that if he sticks to what he can actually prove to be true, he has absolutely no basis for claiming that people who reject that proposition are “History-deniers”.  Because, <i>by the very definition of inference</i>, there is some degree of probability that the skeptics are correct to doubt the validity of his conclusion.</p><p>I note with no little amusement that no man who was so foolish to write, as Dawkins did on page 249 of <i>The God Delusion</i>: “I do not believe there is an atheist in the world who would bulldoze Mecca— or Chartres, York Minster or Notre Dame, the Shwe Dagon, the temples of Kyoto or, of course, the Buddhas of Bamiyan.”, should ever dare to use the term “History-denier” in public.  Remember, we are dealing with such a historical ignoramus here that he not only doesn’t know it was atheists who destroyed 41,000 of Russia’s 48,000 churches, 240 of 700 Buddhist temples in Vietnam, and 7,000 Buddhist temples in Tibet in the previous century, but genuinely believes religion is a primary cause of war.</p><p>Blackblade points out that Dawkins coins a somewhat useful term, “theorum”, in order to distinguish non-mathematically provable scientific concepts in which he has a high level of confidence from mathematical theorems.  The ironic thing, however, is that Dawkins destroys his own case in his very definition of “theorum”.</p><p><i>“[It] has been confirmed or established by observation or experiment, and is propounded or accepted as accounting for the known facts; [it is] a statement of what are held to be the general laws, principles or causes of something known or observed.”</i></p><p>What follows are 434 pages of explaining why the reader should accept Dawkins’s proposition as a fact despite the absence of observation and experiment in support of it.  I think my favorite argument was Dawkins’s technologically naive citation of the recurrent laryngeal nerve in mammals as good evidence against a designer.  Speaking as an veteran technology designer, I would invite anyone who finds that argument convincing to open up the shell of an electronic device; in many cases you will find no shortages of wires indicating similar reroutings of the printed circuit boards.</p><p>And ironically, even if evolution by possible natural selection is both propounded and accepted as accounting for the known facts by every sane, informed, intelligent individual, that pesky and means that in addition to not being a fact, Dawkins’s inference <i>does not even qualify as a theorum by his own chosen definition.</i></p><p>The historical fact of the matter is that evolution by natural selection is a failed science.  It has a long and inglorious record of failed predictions that puts even Keynesian economics to shame.  Evolutionists know this, which is why they prefer polemic to predictions and why the foremost evolutionary propagandist has adopted rhetorical tactics that are utilized by the devotees of another pseudoscience, anthropogenic climate change/global warming.</p><p><i>The Greatest Show on Earth</i> is an apt name for Dawkins’s book.  For, as the man who made that phrase famous is popularly and erroneously supposed to have said, there’s a sucker born every minute.</p></div>",
  "content_text": "Blackblade explains his take on Richard Dawkins’s invalid substitution of inference for fact in his latest book,\nThe Greatest Show on Earth\n:\nMy reading may be oversimplifying but, summarising, his fundamental assertion is this:\nThere is sufficient evidence, direct and inferred, to prove that evolution has occurred (although not the mechanism by which it did so), to the normal standards of such proof and it should therefore be viewed as fact.\nHe then attempts to justify his nomenclature of evolution as a “fact” by somewhat confusing hypotheses, theorems and facts and the definition thereof. He even goes so far as to create a new one called theorums so as to be more precise in his meaning. However, since you made a few words up yourself in TIA for a similar purpose I think you can’t complain on that one too much 🙂 But, yes, I do agree that your original point was valid.\nHowever, and this is why I made my original point, the whole thing is a distraction from the fundamental issue … is there sufficient evidence to conclude that evolution has occurred and with what degree of confidence … the nomenclature of what confidence level deserves the imprimatur “Fact” is, to me at least, largely inconsequential and Dawkins would have done well to have avoided the pseudo-philosophical and just focused on the evidence.\nI certainly can’t disagree with the latter part of that statement.  Dawkins would always do well to avoid anything that is even remotely philosophical, pseudo or otherwise, since philosophy is demonstrably outside both his competence and his interest.  However, what Blackblade is missing here is that\nThe Greatest Show on Earth\nis not a rational case for the theory of evolution by natural selection or possibly something else.  It is instead a polemical work of propaganda; as in\nThe God Delusion\n, Dawkins is not presenting his case and methodically supporting that case with evidence, he is instead merely attempting to browbeat and bedazzle the careless or moderately intelligent reader into accepting something that is provably and demonstrably untrue.  The reason that Dawkins could not simply focus on the evidence because the evidence, scientific and otherwise, is insufficient to make a convincing case, let alone a conclusive one.\nConsider the insidious and characteristic bait-and-switch in which Dawkins engages in the first chapter alone:\n“Evolution is a fact.  Beyond reasonable doubt.  Beyond serious doubt, beyond sane, informed, intelligent doubt, beyond doubt evolution is a fact.”\n“Evolution is a fact, and this book will demonstrate it.”\n“I shall demonstrate that evolution is an inescapable fact.”\n“I shall show the irrefragable power of the inference that evolution is a fact.”\nNotice the rapid devolution in Dawkins’s case from “evolution is an inescapable fact” to “I infer that evolution is a fact”.  These are two very different statements because an inference is not a fact, by definition.  It cannot reasonably be considered a fact no matter how much Dawkins elects to argue that it can be.  And Dawkins knows this perfectly well, for he even writes: “The dictionary definition of a fact mentions ‘\nactual obervation\nor authentic testimony, as opposed to\nwhat is merely inferred\n‘ (emphasis added).  The implied pejorative of that ‘merely’ is a bit of a cheek.  Careful inference can be more reliable than ‘actual observation’, however strongly our intuition protests at it.”\nBut what Dawkins has done here is to cherry-pick aspects of the definition of “fact” and silently substitute “apparent fact” for “fact” in order to dishonestly justify his substitution of inference for fact.  It is true that careful inference can be more reliable than actual observation, but it is also true that astrology, blind luck, and women’s intuition can be more reliable than actual observation.  None of these comparisons of reliability have anything to do with the definition of a fact.  In addition to leaving out the greater portion of the definition, Dawkins skates over the obvious distinction between fact and apparent fact, which is to say that if an observation or testimony is incorrect, then the claim based on that observation or testimony\nis clearly not a fact.\nNow let’s consider the definition.\nFACT\n–noun\n1. something that actually exists; reality; truth\n2. something known to exist or to have happened\n3. a truth known by actual experience or observation; something known to be true\n4. something said to be true or supposed to have happened\nDawkins blatantly leaves out the first two definitions and the second part of the third one in a devious attempt to leverage the small opening provided by the first part of the third one into misleading the reader into accepting the idea that an inference is equivalent to a fact.  But it is not.  It cannot be, according to its own definition.\nINFERENCE\n–noun\n1. the act or process of inferring.\n2. something that is inferred\n3. Logic.\na.  the process of deriving the strict logical consequences of assumed premises.\nb. the process of arriving at some conclusion that, though it is not logically derivable from the assumed premises, possesses some degree of probability relative to the premises.\nc. a proposition reached by a process of inference.\nOf course, the reason that Dawkins wants to claim that his proposition, his conclusion with some degree of probability that is not logically derivable from the premises, is something that known to exist or have happened, is that if he sticks to what he can actually prove to be true, he has absolutely no basis for claiming that people who reject that proposition are “History-deniers”.  Because,\nby the very definition of inference\n, there is some degree of probability that the skeptics are correct to doubt the validity of his conclusion.\nI note with no little amusement that no man who was so foolish to write, as Dawkins did on page 249 of\nThe God Delusion\n: “I do not believe there is an atheist in the world who would bulldoze Mecca— or Chartres, York Minster or Notre Dame, the Shwe Dagon, the temples of Kyoto or, of course, the Buddhas of Bamiyan.”, should ever dare to use the term “History-denier” in public.  Remember, we are dealing with such a historical ignoramus here that he not only doesn’t know it was atheists who destroyed 41,000 of Russia’s 48,000 churches, 240 of 700 Buddhist temples in Vietnam, and 7,000 Buddhist temples in Tibet in the previous century, but genuinely believes religion is a primary cause of war.\nBlackblade points out that Dawkins coins a somewhat useful term, “theorum”, in order to distinguish non-mathematically provable scientific concepts in which he has a high level of confidence from mathematical theorems.  The ironic thing, however, is that Dawkins destroys his own case in his very definition of “theorum”.\n“[It] has been confirmed or established by observation or experiment, and is propounded or accepted as accounting for the known facts; [it is] a statement of what are held to be the general laws, principles or causes of something known or observed.”\nWhat follows are 434 pages of explaining why the reader should accept Dawkins’s proposition as a fact despite the absence of observation and experiment in support of it.  I think my favorite argument was Dawkins’s technologically naive citation of the recurrent laryngeal nerve in mammals as good evidence against a designer.  Speaking as an veteran technology designer, I would invite anyone who finds that argument convincing to open up the shell of an electronic device; in many cases you will find no shortages of wires indicating similar reroutings of the printed circuit boards.\nAnd ironically, even if evolution by possible natural selection is both propounded and accepted as accounting for the known facts by every sane, informed, intelligent individual, that pesky and means that in addition to not being a fact, Dawkins’s inference\ndoes not even qualify as a theorum by his own chosen definition.\nThe historical fact of the matter is that evolution by natural selection is a failed science.  It has a long and inglorious record of failed predictions that puts even Keynesian economics to shame.  Evolutionists know this, which is why they prefer polemic to predictions and why the foremost evolutionary propagandist has adopted rhetorical tactics that are utilized by the devotees of another pseudoscience, anthropogenic climate change/global warming.\nThe Greatest Show on Earth\nis an apt name for Dawkins’s book.  For, as the man who made that phrase famous is popularly and erroneously supposed to have said, there’s a sucker born every minute.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-19T11:55:00+00:00"
}