{
  "url": "https://voxday.net/2010/03/02/mailvox-broken-windows-and-stimulus-of/",
  "scraped_at": "2026-01-08T23:20:56.156506",
  "title": "Mailvox: broken windows and the stimulus of WWII",
  "date_display": "March 2, 2010",
  "date_iso": "2010-03-02T09:51:00+00:00",
  "date_from_url": "2010-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CH asks about a common economic misconception:</p><blockquote><p>I follow your columns so I thought you’d be able to answer this question for me, if you would. As you have stated, the Democrats are Keynesians and believe they can spend their way out of recession. Benanke cites the Great Depression as evidence of this. I know that FDR’s policies of spending didn’t lift us out of the Great Depression (they made it worse), but it is often noted that WWII did lift us out of said Depression. How can this be? How did that work? It seems to me that the militarization of our industries were funded by the Government. This put people to work and sent many to war equipped with the products of our industries and therefore operated as a large Government “stimulus”. I am trying to see Bernanke’s logic, if I am correct, that the spending the Government did to fund the war was what it took to get the economy going. This in effect is what the Dems are trying to reproduce by simply dumping money in the economy, putting people to work and creating a false demand, to bring us out of this recession. The war was true demand, sure, but wasn’t the war really a big fat stimulus? Government gave money to industries who put people to work, who paid taxes and spent money, allowing industry to produce more product, etc. I’m very confused how all this worked. Please set me straight!</p></blockquote><p>First, let me note that it’s not only the Democrats who are Neo-Keynesians.  Most Republican politicians are too; the monetarism of the Chicago School is little more than a Keynesian heresy that focuses on monetary policy and leaves fiscal policy out of the equation.  Now, it is true that WWII helped lift the USA out of the Great Depression, but not for the reasons that the economically illiterate, historically clueless, and logically challenged usually cite.  The stimulus involved in producing hundreds of thousands of ships, tanks, and airplanes and employing millions of men did not bring about the post-war economic recovery, it was the effective <i>use</i> of those men and materials in destroying the industrial infrastructure of Italy, Germany and Japan that did.  While economists such as Henry Hazlitt and Thomas Sowell rightly cite Frederic Bastiat’s Broken Window fallacy and point out that there is nothing productive or wealth-generating about turning steel into a rusting hulk on the bottom of the ocean, they forget that destroying an economic competitor’s industrial infrastructure at no cost to your own, then providing consumer goods and the means of rebuilding that infrastructure is very productive and wealth-generating indeed.</p><p>Let us call it Vox’s Addendum to Bastiat’s Broken Window Fallacy.  Or, if you prefer, the Broken Window Martial Motive.  Bastiat’s parable goes thusly:</p><p><i>Have you ever witnessed the anger of the good shopkeeper, James Goodfellow, when his careless son happened to break a pane of glass? If you have been present at such a scene, you will most assuredly bear witness to the fact, that every one of the spectators, were there even thirty of them, by common consent apparently, offered the unfortunate owner this invariable consolation—”It is an ill wind that blows nobody good. Everybody must live, and what would become of the glaziers if panes of glass were never broken?”</i></p><p>Now, this form of condolence contains an entire theory, which it will be well to show up in this simple case, seeing that it is precisely the same as that which, unhappily, regulates the greater part of our economical institutions.</p><p>Suppose it cost six francs to repair the damage, and you say that the accident brings six francs to the glazier’s trade—that it encourages that trade to the amount of six francs—I grant it; I have not a word to say against it; you reason justly. The glazier comes, performs his task, receives his six francs, rubs his hands, and, in his heart, blesses the careless child. All this is that which is seen.</p><p>But if, on the other hand, you come to the conclusion, as is too often the case, that it is a good thing to break windows, that it causes money to circulate, and that the encouragement of industry in general will be the result of it, you will oblige me to call out, “Stop there! Your theory is confined to that which is seen; it takes no account of that which is not seen.”</p><p>It is not seen that as our shopkeeper has spent six francs upon one thing, he cannot spend them upon another. It is not seen that if he had not had a window to replace, he would, perhaps, have replaced his old shoes, or added another book to his library. In short, he would have employed his six francs in some way, which this accident has prevented.</p><p>If, however, the shopkeeper happens to live in the next town over, his window is broken, and the house belonging to his neighbor the second glazier is burned down with the second glazier inside it due to the vagaries of violent inter-village relations, the six francs the shopkeeper will spend on repairing his broken window will be six francs that did not previously circulate within the first town’s economy, and which the shopkeeper, living in the second town, was never going to spend on shoes or books produced in the first town.  Therefore, it is a good thing to break windows, so long as the windows are broken in the neighboring town at a cost that is exceeded by the benefit to be gained from fixing them.</p><p><i>“In short, he would have employed his six francs in some way, which this accident has prevented, [unless the accident happens to take place in the neighboring town. – VD]”</i></p><p>This means that while most wars are economically destructive, wars that offer the likely prospect of destroying the industrial base of one or more advanced economies without putting the nation’s own industrial base at risk are economically beneficial.  By way of statistical evidence in support of this conclusion, note how <a href=\"http://admin.returnofthegreatdepression.com/2010/03/gdp-and-loan-growth/\">the annual rate of commercial bank loan growth</a> was much higher immediately after WWII – 25% in 1947 and 21.5% in 1950 – than it ever has been since.</p></div>",
  "content_text": "CH asks about a common economic misconception:\nI follow your columns so I thought you’d be able to answer this question for me, if you would. As you have stated, the Democrats are Keynesians and believe they can spend their way out of recession. Benanke cites the Great Depression as evidence of this. I know that FDR’s policies of spending didn’t lift us out of the Great Depression (they made it worse), but it is often noted that WWII did lift us out of said Depression. How can this be? How did that work? It seems to me that the militarization of our industries were funded by the Government. This put people to work and sent many to war equipped with the products of our industries and therefore operated as a large Government “stimulus”. I am trying to see Bernanke’s logic, if I am correct, that the spending the Government did to fund the war was what it took to get the economy going. This in effect is what the Dems are trying to reproduce by simply dumping money in the economy, putting people to work and creating a false demand, to bring us out of this recession. The war was true demand, sure, but wasn’t the war really a big fat stimulus? Government gave money to industries who put people to work, who paid taxes and spent money, allowing industry to produce more product, etc. I’m very confused how all this worked. Please set me straight!\nFirst, let me note that it’s not only the Democrats who are Neo-Keynesians.  Most Republican politicians are too; the monetarism of the Chicago School is little more than a Keynesian heresy that focuses on monetary policy and leaves fiscal policy out of the equation.  Now, it is true that WWII helped lift the USA out of the Great Depression, but not for the reasons that the economically illiterate, historically clueless, and logically challenged usually cite.  The stimulus involved in producing hundreds of thousands of ships, tanks, and airplanes and employing millions of men did not bring about the post-war economic recovery, it was the effective\nuse\nof those men and materials in destroying the industrial infrastructure of Italy, Germany and Japan that did.  While economists such as Henry Hazlitt and Thomas Sowell rightly cite Frederic Bastiat’s Broken Window fallacy and point out that there is nothing productive or wealth-generating about turning steel into a rusting hulk on the bottom of the ocean, they forget that destroying an economic competitor’s industrial infrastructure at no cost to your own, then providing consumer goods and the means of rebuilding that infrastructure is very productive and wealth-generating indeed.\nLet us call it Vox’s Addendum to Bastiat’s Broken Window Fallacy.  Or, if you prefer, the Broken Window Martial Motive.  Bastiat’s parable goes thusly:\nHave you ever witnessed the anger of the good shopkeeper, James Goodfellow, when his careless son happened to break a pane of glass? If you have been present at such a scene, you will most assuredly bear witness to the fact, that every one of the spectators, were there even thirty of them, by common consent apparently, offered the unfortunate owner this invariable consolation—”It is an ill wind that blows nobody good. Everybody must live, and what would become of the glaziers if panes of glass were never broken?”\nNow, this form of condolence contains an entire theory, which it will be well to show up in this simple case, seeing that it is precisely the same as that which, unhappily, regulates the greater part of our economical institutions.\nSuppose it cost six francs to repair the damage, and you say that the accident brings six francs to the glazier’s trade—that it encourages that trade to the amount of six francs—I grant it; I have not a word to say against it; you reason justly. The glazier comes, performs his task, receives his six francs, rubs his hands, and, in his heart, blesses the careless child. All this is that which is seen.\nBut if, on the other hand, you come to the conclusion, as is too often the case, that it is a good thing to break windows, that it causes money to circulate, and that the encouragement of industry in general will be the result of it, you will oblige me to call out, “Stop there! Your theory is confined to that which is seen; it takes no account of that which is not seen.”\nIt is not seen that as our shopkeeper has spent six francs upon one thing, he cannot spend them upon another. It is not seen that if he had not had a window to replace, he would, perhaps, have replaced his old shoes, or added another book to his library. In short, he would have employed his six francs in some way, which this accident has prevented.\nIf, however, the shopkeeper happens to live in the next town over, his window is broken, and the house belonging to his neighbor the second glazier is burned down with the second glazier inside it due to the vagaries of violent inter-village relations, the six francs the shopkeeper will spend on repairing his broken window will be six francs that did not previously circulate within the first town’s economy, and which the shopkeeper, living in the second town, was never going to spend on shoes or books produced in the first town.  Therefore, it is a good thing to break windows, so long as the windows are broken in the neighboring town at a cost that is exceeded by the benefit to be gained from fixing them.\n“In short, he would have employed his six francs in some way, which this accident has prevented, [unless the accident happens to take place in the neighboring town. – VD]”\nThis means that while most wars are economically destructive, wars that offer the likely prospect of destroying the industrial base of one or more advanced economies without putting the nation’s own industrial base at risk are economically beneficial.  By way of statistical evidence in support of this conclusion, note how\nthe annual rate of commercial bank loan growth\nwas much higher immediately after WWII – 25% in 1947 and 21.5% in 1950 – than it ever has been since.",
  "tags": [
    "economics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-02T09:51:00+00:00"
}