{
  "url": "https://voxday.net/2010/03/30/mailvox-obama-vs-science/",
  "scraped_at": "2026-01-08T23:23:22.200363",
  "title": "Mailvox: Obama vs science education",
  "date_display": "March 30, 2010",
  "date_iso": "2010-03-30T08:32:00+00:00",
  "date_from_url": "2010-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Hatfield of <a href=\"http://monkeytrials.blogspot.com/2010/03/down-stretch.html\">Monkey Trials</a> writes about the standards of science education:</p><blockquote><p>I invite you to read the state science standards for high school biology in California.  You’ll find those on <a href=\"http://www.cde.ca.gov/BE/ST/SS/documents/sciencestnd.pdf\">pages 51-56 of this PDF file</a>.  It’s true that evolution is in there, but there is absolutely no requirement to teach ‘scientific history.’  I admit that I give one lecture on Mendel and his experiments when I teach genetics, and one lecture on Darwin’s voyage of the Beagle and how that (and the thought of others, like Malthus) influenced his thought.</p><p>Other than that, the other 178-days of instruction are pretty much the concepts and facts that you can see on the standards, which are in fact voluminous.  I can’t speak for PZ and Dawkins, but I assure you that I care very much about the fact that there is less time for experiments and far too much time spent prepping for the standardized tests which, under NCLB, are used by the states and the fed to rate schools.</p><p>By the way, if your looking for a way to improve science ed, then please join me in rejecting the OBAMA administration proposal to tie teacher evaluations more closely to testing.  A rare offer for you and I to unite in a criticism of the present administration!</p><p>Again, check out what we actually have to teach.  There’s a lot to cram in 180 days, and to do it, we typically are sacrificing labs, especially the highly-instructive but time-consuming ones that take weeks to complete.</p></blockquote><p>I have no problem whatsoever condemning the Obama administration proposal.  Teacher evaluations and education standards are not Constitutional concerns of the U.S. federal government and Obama has no business attempting to dictate such things.  Now, I’m certainly not against the use of standards in evaluating teachers; one reason for the drive towards objective standards is that the political power of the teachers unions is completely out of hand in some states.  Given that testing can be an over-blunt club, I’m curious to know how Scott would prefer to see teachers evaluated.  And while I don’t understand how opposing a proposal for a change can <i>improve</i> the current situation, I am happy to oppose it nonetheless.</p><p>Obviously, a science teacher whose black, inner-city, public school students score an average 80th percentile is probably a much better teacher than one whose Chinese, suburban, private school students average 85th percentile.  And it’s also clear that straightforward teaching to the test will tend to restrict a teacher’s ability to focus on whatever aspects of his subject he thinks is important.  But I’m sure Scott also realizes that for every good science teacher who wants to push his students and expose them to actually learning how to utilize the scientific method, there are several who would spend the entire school day haranguing their students on anything from Marxism and patriarchal oppression to Genesis and Scientology if given the opportunity.</p><p>I don’t have an answer myself.  But I’m curious to know what Scott’s recommendation would be.  As for “science history”, that’s often what is taught in lieu of science.  Whether one considers the cult of Adam Smith or the cult of Charles Darwin, even a moment of reflection should suffice to determine that the Great Men of Science theme is actually a historical theme, not a scientific one.  An astronomer has absolutely no need to know if it was Pythagoras or Copernicus who thought the Sun orbited the Earth in order to calculate the orbit of an extrasolar planet just as a biologist has absolutely no need to know if it was Darwin or Paley who articulated evolution by natural selection when he is figuring out the utility of junk DNA.</p><p>Don’t get me wrong, I think scientific history is tremendously interesting and knowledge of economic history is actually quite valuable in understanding how and why the present orthodoxy went so badly awry.  The more unsettled a science is, the more important the historical knowledge will be.  Reading Joseph Schumpeter’s mammoth <i>History of Economic Thought</i> played a major role in my critical revisitation of Ricardian free trade, then Friedmanite monetarism.  But repeating anecdotes about finches and shoemakers should never be confused with actually calculating debt/GDP ratios or collecting butterflies.</p><p>For the record, I no more object to teaching evolution than I do to teaching Keynesian macroeconomics or any other extant idea.  In other words, I <i>insist</i> on them being taught and being taught accurately.  It is only when you have fully and correctly understood a concept that you can truly grasp the intrinsic and/or potential flaws in it.  For example, I found this requirement to be more than a little amusing: <i>“8. Evolution is the result of genetic changes that occur in constantly changing environments. As a basis for understanding this concept:  a. Students know how natural selection determines the differential survival of groups of organisms.”</i> I should, of course, be very interested to know how they know that, given that even Richard Dawkins has now admitted that the science is still unsettled on whether Darwin was fundamentally wrong about the very core of his so-called “dangerous idea”.  The logic is at least superficially sound, but is the science?  After all, that is precisely what still remains to be determined.</p><p>But to be clear, it must be understood that while I am an outright Keynesian Denier, a Marxian Denier, and a Friedmanite Denier, I am but a mere Darwinian <i>Skeptic</i>.</p></div>",
  "content_text": "Scott Hatfield of\nMonkey Trials\nwrites about the standards of science education:\nI invite you to read the state science standards for high school biology in California.  You’ll find those on\npages 51-56 of this PDF file\n.  It’s true that evolution is in there, but there is absolutely no requirement to teach ‘scientific history.’  I admit that I give one lecture on Mendel and his experiments when I teach genetics, and one lecture on Darwin’s voyage of the Beagle and how that (and the thought of others, like Malthus) influenced his thought.\nOther than that, the other 178-days of instruction are pretty much the concepts and facts that you can see on the standards, which are in fact voluminous.  I can’t speak for PZ and Dawkins, but I assure you that I care very much about the fact that there is less time for experiments and far too much time spent prepping for the standardized tests which, under NCLB, are used by the states and the fed to rate schools.\nBy the way, if your looking for a way to improve science ed, then please join me in rejecting the OBAMA administration proposal to tie teacher evaluations more closely to testing.  A rare offer for you and I to unite in a criticism of the present administration!\nAgain, check out what we actually have to teach.  There’s a lot to cram in 180 days, and to do it, we typically are sacrificing labs, especially the highly-instructive but time-consuming ones that take weeks to complete.\nI have no problem whatsoever condemning the Obama administration proposal.  Teacher evaluations and education standards are not Constitutional concerns of the U.S. federal government and Obama has no business attempting to dictate such things.  Now, I’m certainly not against the use of standards in evaluating teachers; one reason for the drive towards objective standards is that the political power of the teachers unions is completely out of hand in some states.  Given that testing can be an over-blunt club, I’m curious to know how Scott would prefer to see teachers evaluated.  And while I don’t understand how opposing a proposal for a change can\nimprove\nthe current situation, I am happy to oppose it nonetheless.\nObviously, a science teacher whose black, inner-city, public school students score an average 80th percentile is probably a much better teacher than one whose Chinese, suburban, private school students average 85th percentile.  And it’s also clear that straightforward teaching to the test will tend to restrict a teacher’s ability to focus on whatever aspects of his subject he thinks is important.  But I’m sure Scott also realizes that for every good science teacher who wants to push his students and expose them to actually learning how to utilize the scientific method, there are several who would spend the entire school day haranguing their students on anything from Marxism and patriarchal oppression to Genesis and Scientology if given the opportunity.\nI don’t have an answer myself.  But I’m curious to know what Scott’s recommendation would be.  As for “science history”, that’s often what is taught in lieu of science.  Whether one considers the cult of Adam Smith or the cult of Charles Darwin, even a moment of reflection should suffice to determine that the Great Men of Science theme is actually a historical theme, not a scientific one.  An astronomer has absolutely no need to know if it was Pythagoras or Copernicus who thought the Sun orbited the Earth in order to calculate the orbit of an extrasolar planet just as a biologist has absolutely no need to know if it was Darwin or Paley who articulated evolution by natural selection when he is figuring out the utility of junk DNA.\nDon’t get me wrong, I think scientific history is tremendously interesting and knowledge of economic history is actually quite valuable in understanding how and why the present orthodoxy went so badly awry.  The more unsettled a science is, the more important the historical knowledge will be.  Reading Joseph Schumpeter’s mammoth\nHistory of Economic Thought\nplayed a major role in my critical revisitation of Ricardian free trade, then Friedmanite monetarism.  But repeating anecdotes about finches and shoemakers should never be confused with actually calculating debt/GDP ratios or collecting butterflies.\nFor the record, I no more object to teaching evolution than I do to teaching Keynesian macroeconomics or any other extant idea.  In other words, I\ninsist\non them being taught and being taught accurately.  It is only when you have fully and correctly understood a concept that you can truly grasp the intrinsic and/or potential flaws in it.  For example, I found this requirement to be more than a little amusing:\n“8. Evolution is the result of genetic changes that occur in constantly changing environments. As a basis for understanding this concept:  a. Students know how natural selection determines the differential survival of groups of organisms.”\nI should, of course, be very interested to know how they know that, given that even Richard Dawkins has now admitted that the science is still unsettled on whether Darwin was fundamentally wrong about the very core of his so-called “dangerous idea”.  The logic is at least superficially sound, but is the science?  After all, that is precisely what still remains to be determined.\nBut to be clear, it must be understood that while I am an outright Keynesian Denier, a Marxian Denier, and a Friedmanite Denier, I am but a mere Darwinian\nSkeptic\n.",
  "tags": [
    "mailvox",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-30T07:32:00+00:00"
}