{
  "url": "https://voxday.net/2010/03/30/mailvox-waste-of-time-and-effor/",
  "scraped_at": "2026-01-08T23:23:24.018209",
  "title": "Mailvox: a waste of time and effort",
  "date_display": "March 30, 2010",
  "date_iso": "2010-03-30T14:15:00+00:00",
  "date_from_url": "2010-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Baseball Savant questions my time allocations:</p><blockquote><p>Leaving aside the fact that we pretty much disagree about everything when it comes to Christianity, the one thing I have a problem with in reading your blog the last couple of years is your fight in atheism/religion. Admittedly I haven’t read “TIA”, but I think for this discussion I get the gist that you basically used the same logic that the unholy trinity provided to disprove atheism or at least show that it’s more unlikely than religious thought/belief. I might be oversimplifying it, but I think you get my point. My problem though is that you spend an enormous amount of time on this very topic. That I don’t understand. I would think even as an open theist we would have similar views on eternal perspective and the problem that I have is that your writing of TIA, although interesting, doesn’t further that cause too much.</p><p>I can certainly see the rationale behind it if you believe that you are the first domino to fall in that equation in that</p><p>ATHEIST –&gt; READ TIA —-&gt; DOUBT ATHEISM —–&gt; DISREGARD ATHEISM —-&gt; BELIEVE IN RELIGION —-&gt; COME TO CHRIST</p><p>But the last part is very dicey. There are a million religions in the world, and it seems your argument is only that atheism is illogical. I agree with it. I guess I’m just wondering the end? Not that everything has to be done with eternal perspective in mind, but this is something that I think definitely coincides with that sort of thing because you are delving into religious matters. Does open theism teach that God is pleased if something comes to religion even if that religion is still pagan in nature and hell is the final destination for the person who converts to that religion from atheism?</p><p>If it’s all for intellectual masturbation then I get it, but you seem too bright to waste time on an endeavor such as this with no real cost/benefit analysis in the end.</p><p>Obviously you write for you. You’ve always said as much, but the time aspect is odd for me. What do you think?</p></blockquote><p>First, I don’t spend anywhere nearly as much time on the subject as most people think.  Because I read very fast and think a bit more quickly than the norm, it doesn’t take me very long to notice the flaws in an argument and use them to pick it apart.  The only thing that occasionally takes an amount of time is doing the research to prove what I already have concluded to the satisfaction of others.  Second, as always, I highly recommend reading the relevant material before commenting on it.</p><p>Because the Baseball Savant hasn’t read TIA, he isn’t aware that my ambitions for the book have always been modest.  I not only think the last link in his chain is very dicey, I think the one preceding it is too.  TIA is not a work of Christian apologetics nor is it even a theological work, the one speculative chapter notwithstanding, as it is nothing more than a work dedicated to destroying a collection of spurious, illogical, and demonstrably false arguments by a small group of well-known intellectual charlatans.  Convincing the reader to disregard a specific form of atheism is the most that the book was ever even potentially going to achieve, and it’s quite clear that it has been very successful in that regard.  The feeble and insubstantial protestations with which the <i>Against the New Atheism</i> slideshow has been met is testimony to the way in which even the most militant atheists have largely abandoned certain arguments they once believed to be powerfully effective.</p><p>Removing a bar to belief isn’t always going to lead to belief.  I would even say that it usually isn’t.  But, having seen so many well-meaning Christians struggle so ineffectively against unoriginal and outdated arguments that were fundamentally flawed, I thought it was worth the small effort it took to dismantle them in such a comprehensive manner that practically anyone who has read the book can now do the same with ease.  I expect that I will continue to tear apart their future arguments since it costs me nothing and I find it more entertaining than sitting down and watching 151 hours of television per month like the average American.  Needless to say, I will be providing a detailed critique of Sam Harris’s <a href=\"http://www.project-reason.org/newsfeed/item/moral_confusion_in_the_name_of_science3/\">all-too-characteristically incoherent argument</a> in favor of utilizing science to answer moral questions at some point in the future.</p><p>The truth is that I spend far more time on what could be characterized as even less important matters.  I am currently designing five games, none of which are of any importance to the human race and only two of which will be potentially profitable to me.  I am spending a great deal of time and money on a superior input device which will allow people to do useful, useless and even harmful things on a computer up to 50% faster.  I am writing a sequel to a novel that probably didn’t sell more than 500 copies.  I play board games and computer games, alone and with others.  And I just finished reading a novel by Balzac that wasn’t particularly interesting and has taught me nothing useful.</p><p>The ironic thing about this email is the way it shows how people, <i>even those who haven’t read the book</i>, are still far more interested in discussing <i>The Irrational Atheist</i> than they are in discussing either of the two books I have published since.  And this is despite the fact that we’re now in the midst of the very economic contraction that I describe in <i>The Return of the Great Depression</i>!</p><p>Time passes whether we spend it wisely or not.  I have numerous regrets for opportunities and time I have wasted in the past, but writing TIA and discussing the related issues is not one of them.</p></div>",
  "content_text": "The Baseball Savant questions my time allocations:\nLeaving aside the fact that we pretty much disagree about everything when it comes to Christianity, the one thing I have a problem with in reading your blog the last couple of years is your fight in atheism/religion. Admittedly I haven’t read “TIA”, but I think for this discussion I get the gist that you basically used the same logic that the unholy trinity provided to disprove atheism or at least show that it’s more unlikely than religious thought/belief. I might be oversimplifying it, but I think you get my point. My problem though is that you spend an enormous amount of time on this very topic. That I don’t understand. I would think even as an open theist we would have similar views on eternal perspective and the problem that I have is that your writing of TIA, although interesting, doesn’t further that cause too much.\nI can certainly see the rationale behind it if you believe that you are the first domino to fall in that equation in that\nATHEIST –> READ TIA —-> DOUBT ATHEISM —–> DISREGARD ATHEISM —-> BELIEVE IN RELIGION —-> COME TO CHRIST\nBut the last part is very dicey. There are a million religions in the world, and it seems your argument is only that atheism is illogical. I agree with it. I guess I’m just wondering the end? Not that everything has to be done with eternal perspective in mind, but this is something that I think definitely coincides with that sort of thing because you are delving into religious matters. Does open theism teach that God is pleased if something comes to religion even if that religion is still pagan in nature and hell is the final destination for the person who converts to that religion from atheism?\nIf it’s all for intellectual masturbation then I get it, but you seem too bright to waste time on an endeavor such as this with no real cost/benefit analysis in the end.\nObviously you write for you. You’ve always said as much, but the time aspect is odd for me. What do you think?\nFirst, I don’t spend anywhere nearly as much time on the subject as most people think.  Because I read very fast and think a bit more quickly than the norm, it doesn’t take me very long to notice the flaws in an argument and use them to pick it apart.  The only thing that occasionally takes an amount of time is doing the research to prove what I already have concluded to the satisfaction of others.  Second, as always, I highly recommend reading the relevant material before commenting on it.\nBecause the Baseball Savant hasn’t read TIA, he isn’t aware that my ambitions for the book have always been modest.  I not only think the last link in his chain is very dicey, I think the one preceding it is too.  TIA is not a work of Christian apologetics nor is it even a theological work, the one speculative chapter notwithstanding, as it is nothing more than a work dedicated to destroying a collection of spurious, illogical, and demonstrably false arguments by a small group of well-known intellectual charlatans.  Convincing the reader to disregard a specific form of atheism is the most that the book was ever even potentially going to achieve, and it’s quite clear that it has been very successful in that regard.  The feeble and insubstantial protestations with which the\nAgainst the New Atheism\nslideshow has been met is testimony to the way in which even the most militant atheists have largely abandoned certain arguments they once believed to be powerfully effective.\nRemoving a bar to belief isn’t always going to lead to belief.  I would even say that it usually isn’t.  But, having seen so many well-meaning Christians struggle so ineffectively against unoriginal and outdated arguments that were fundamentally flawed, I thought it was worth the small effort it took to dismantle them in such a comprehensive manner that practically anyone who has read the book can now do the same with ease.  I expect that I will continue to tear apart their future arguments since it costs me nothing and I find it more entertaining than sitting down and watching 151 hours of television per month like the average American.  Needless to say, I will be providing a detailed critique of Sam Harris’s\nall-too-characteristically incoherent argument\nin favor of utilizing science to answer moral questions at some point in the future.\nThe truth is that I spend far more time on what could be characterized as even less important matters.  I am currently designing five games, none of which are of any importance to the human race and only two of which will be potentially profitable to me.  I am spending a great deal of time and money on a superior input device which will allow people to do useful, useless and even harmful things on a computer up to 50% faster.  I am writing a sequel to a novel that probably didn’t sell more than 500 copies.  I play board games and computer games, alone and with others.  And I just finished reading a novel by Balzac that wasn’t particularly interesting and has taught me nothing useful.\nThe ironic thing about this email is the way it shows how people,\neven those who haven’t read the book\n, are still far more interested in discussing\nThe Irrational Atheist\nthan they are in discussing either of the two books I have published since.  And this is despite the fact that we’re now in the midst of the very economic contraction that I describe in\nThe Return of the Great Depression\n!\nTime passes whether we spend it wisely or not.  I have numerous regrets for opportunities and time I have wasted in the past, but writing TIA and discussing the related issues is not one of them.",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-30T13:15:00+00:00"
}