{
  "url": "https://voxday.net/2010/03/07/mailvox-key-to-civilization/",
  "scraped_at": "2026-01-08T23:21:23.686734",
  "title": "Mailvox: the key to civilization",
  "date_display": "March 7, 2010",
  "date_iso": "2010-03-07T13:36:00+00:00",
  "date_from_url": "2010-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RB poses a question:</p><blockquote><p>Your blog rocks!  Anyways, I have a question I think you may know the answer to: Why is it that in Europe, the Middle East, and Asia, people developed into advanced civilizations?  Yet, when you look at the American Indians, [most] tribes in Central and South America, and Africa, these people were ages behind everyone else?  I figure that commerce and perhaps the conquering of other peoples and their technologies had something to do with it, but when you look at the folks who did not advance, it’s like they decided to work harder and not smarter.  I mean, look at the regions these people came from.  They were resource rich, yet no one got off their butts to make life easier.</p></blockquote><p>There are rival theories that attempt to explain the variance in technological advancement across various societies and cultures.  For example, Jared Diamond’s famous hypothesis encapsulated in <i>Guns, Germs, and Steel</i> is little more than an attempt to blame anything but human evolution and racial differences.  He’d rather hypothesize causal differences between horizontal and vertical continental geographies than observe the simple fact that the cultures that are known to have produced relatively advanced civilizations also happen to feature populations that presently posses higher intelligences.  One can certainly argue that smarter populations are the result of advanced civilization rather than its cause, but logic suggests that the relationship between civilization and intelligence is unlikely to run in that direction due to the way in which civilization and technology are known to increase the survival and breeding rates of the less intelligent portions of the population.</p><p>However, the mere advantage of higher intelligence possessed by the European, Semitic and Asian peoples is simply not enough to account for the vast difference between different civilizations such as the tribal cultures of Papua New Guinea and Western European culture circa 1800.  Keep in mind that the technological advancement of the Egyptians came to a halt long before Alexander the Great.  Europe may not have experienced any Dark Ages, but its southern civilization certainly took a step or two backward during the decline and fall of the Roman Empire, and similar periods of arrested and even retarded development is known to have taken place in China and Japan as well.</p><p>So, the more informative question probably does not surround what advantage permits technological and societal advancement towards civilization, but rather, what are the factors that are capable of retarding them.  It’s a complicated question; for example, while matriarchy clearly retards civilization, patriarchy doesn’t necessarily advance it.  Christianity helped in Europe, but played no similar role in the Levant.  So, I don’t have an answer, except to say that when it is figured out it will likely involve a complicated mixture of factors that don’t easily permit pointing to any two or three of them and declaring that they are the magic key.</p></div>",
  "content_text": "RB poses a question:\nYour blog rocks!  Anyways, I have a question I think you may know the answer to: Why is it that in Europe, the Middle East, and Asia, people developed into advanced civilizations?  Yet, when you look at the American Indians, [most] tribes in Central and South America, and Africa, these people were ages behind everyone else?  I figure that commerce and perhaps the conquering of other peoples and their technologies had something to do with it, but when you look at the folks who did not advance, it’s like they decided to work harder and not smarter.  I mean, look at the regions these people came from.  They were resource rich, yet no one got off their butts to make life easier.\nThere are rival theories that attempt to explain the variance in technological advancement across various societies and cultures.  For example, Jared Diamond’s famous hypothesis encapsulated in\nGuns, Germs, and Steel\nis little more than an attempt to blame anything but human evolution and racial differences.  He’d rather hypothesize causal differences between horizontal and vertical continental geographies than observe the simple fact that the cultures that are known to have produced relatively advanced civilizations also happen to feature populations that presently posses higher intelligences.  One can certainly argue that smarter populations are the result of advanced civilization rather than its cause, but logic suggests that the relationship between civilization and intelligence is unlikely to run in that direction due to the way in which civilization and technology are known to increase the survival and breeding rates of the less intelligent portions of the population.\nHowever, the mere advantage of higher intelligence possessed by the European, Semitic and Asian peoples is simply not enough to account for the vast difference between different civilizations such as the tribal cultures of Papua New Guinea and Western European culture circa 1800.  Keep in mind that the technological advancement of the Egyptians came to a halt long before Alexander the Great.  Europe may not have experienced any Dark Ages, but its southern civilization certainly took a step or two backward during the decline and fall of the Roman Empire, and similar periods of arrested and even retarded development is known to have taken place in China and Japan as well.\nSo, the more informative question probably does not surround what advantage permits technological and societal advancement towards civilization, but rather, what are the factors that are capable of retarding them.  It’s a complicated question; for example, while matriarchy clearly retards civilization, patriarchy doesn’t necessarily advance it.  Christianity helped in Europe, but played no similar role in the Levant.  So, I don’t have an answer, except to say that when it is figured out it will likely involve a complicated mixture of factors that don’t easily permit pointing to any two or three of them and declaring that they are the magic key.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-07T13:36:00+00:00"
}