{
  "url": "https://voxday.net/2010/03/23/mailvox-republican-despair/",
  "scraped_at": "2026-01-08T23:22:45.820524",
  "title": "Mailvox: Republican despair",
  "date_display": "March 23, 2010",
  "date_iso": "2010-03-23T18:17:00+00:00",
  "date_from_url": "2010-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JW writes of her loss of faith in the GOP:</p><blockquote><p>Finally somebody has printed what I think. Not that I made it up first, but you’ve put clarity and the printed word to what is so patently obvious.  I’ve been a Republican all my life (50 years) and it just makes me sick now.  I’ve lost my enthusiasm and hope for the future.  So many commentators in the last 24 hours are spouting “we’ll take it back!” or  “they’ll listen to us now if we shout and fight!”  blah  blah  blah.</p><p>Don’t they get it?  Nobody is listening, except the choir.</p><p>My husband says retribution will occur in the next election. But even if they all get voted out, who do we have to replace them?  McCain?  Palin?  The ones at the top of the heap don’t really amount to much.  It’s the pile underneath that is either rock or sucking sand…</p><p>We own a small business. Since we are classified as a “mine”, even though all operations are above ground (and we don’t strip mine) we are subject to the whims of MSHA (the Federal Mine Safety Administration). Since the Sago disasters, MSHA has become a monstrosity and out of control.  I could go on and on, but for one example-  our company has received a safety award from this organization every year (we have no employee accidents) and at the same time, were fined over $[quantity] in 2009 for “violations”.  On top of this, other federal and county taxes, fees, inspections, payroll taxes, etc. are putting us under.  I warned my family almost two years ago that ‘universal’ healthcare would put us out of business and it needed to be worked against. Didn’t hear a word back from any of them.  As far as I know, my entire family is Republican.</p><p>I communicate with my Senator and Representative.  They heard my voice.  I don’t know what else to do.</p></blockquote><p>There is nothing else to do except to leave the country to its fate and look to provide for and protect your family.  When the masses stampede into madness, there is no talking them out of it.  Just get out of the way and let them run off the cliff.  I’ve been telling people that it is too late for several years now; the election of George W. Bush sealed the deal that was in the works since Reagan failed to cut government spending as well as taxes.  That failure, combined with the Immigration Reform and Control Act of 1986, planted the seeds for the harvest now being reaped.</p><p>I am sure that most of the conservative media will be full of vigor and inspiring words this week.  But you may wish to remember that I was one of the very few right-wing commentators to point out the total uselessness of the Tea Party movement.  And, for all their signs and fury, they signified nothing when it came down to interrupting the political process and its long march towards American serfdom.  The movement is irrelevant because it is a near certainty that even a full Republican House, Senate, and White House would not repeal Obamacare… after all, did they do anything about abortion, Social Security, Medicaid or Medicare when they were in power?  No, they actually created a new entitlement program and invaded two countries that posed zero threat to the American people instead.</p><p>You cannot fix a problem by applying more of what helped cause it.  America is no longer free.  Get used to it.  The absence of human liberty is, after all, very much the norm for the greater part of human history.</p><p>UPDATE: Republicans <a href=\"http://corner.nationalreview.com/post/?q=MjQzZDhlMzljNTQyODRlNDI1ZDZkODU2YzFlMzlmZjM=\">aren’t even going to try</a> to repeal Obamacare. <i>Sen. John Cornyn (R., Texas) told HuffPo today that Republicans won’t run on an across-the-board repeal of new health-care laws.  “There is non-controversial stuff here like the preexisting conditions exclusion and those sorts of things,” the Texas Republican said. “Now we are not interested in repealing that. And that is frankly a distraction.”</i></p><p>Put that in your tea and drink it….</p></div>",
  "content_text": "JW writes of her loss of faith in the GOP:\nFinally somebody has printed what I think. Not that I made it up first, but you’ve put clarity and the printed word to what is so patently obvious.  I’ve been a Republican all my life (50 years) and it just makes me sick now.  I’ve lost my enthusiasm and hope for the future.  So many commentators in the last 24 hours are spouting “we’ll take it back!” or  “they’ll listen to us now if we shout and fight!”  blah  blah  blah.\nDon’t they get it?  Nobody is listening, except the choir.\nMy husband says retribution will occur in the next election. But even if they all get voted out, who do we have to replace them?  McCain?  Palin?  The ones at the top of the heap don’t really amount to much.  It’s the pile underneath that is either rock or sucking sand…\nWe own a small business. Since we are classified as a “mine”, even though all operations are above ground (and we don’t strip mine) we are subject to the whims of MSHA (the Federal Mine Safety Administration). Since the Sago disasters, MSHA has become a monstrosity and out of control.  I could go on and on, but for one example-  our company has received a safety award from this organization every year (we have no employee accidents) and at the same time, were fined over $[quantity] in 2009 for “violations”.  On top of this, other federal and county taxes, fees, inspections, payroll taxes, etc. are putting us under.  I warned my family almost two years ago that ‘universal’ healthcare would put us out of business and it needed to be worked against. Didn’t hear a word back from any of them.  As far as I know, my entire family is Republican.\nI communicate with my Senator and Representative.  They heard my voice.  I don’t know what else to do.\nThere is nothing else to do except to leave the country to its fate and look to provide for and protect your family.  When the masses stampede into madness, there is no talking them out of it.  Just get out of the way and let them run off the cliff.  I’ve been telling people that it is too late for several years now; the election of George W. Bush sealed the deal that was in the works since Reagan failed to cut government spending as well as taxes.  That failure, combined with the Immigration Reform and Control Act of 1986, planted the seeds for the harvest now being reaped.\nI am sure that most of the conservative media will be full of vigor and inspiring words this week.  But you may wish to remember that I was one of the very few right-wing commentators to point out the total uselessness of the Tea Party movement.  And, for all their signs and fury, they signified nothing when it came down to interrupting the political process and its long march towards American serfdom.  The movement is irrelevant because it is a near certainty that even a full Republican House, Senate, and White House would not repeal Obamacare… after all, did they do anything about abortion, Social Security, Medicaid or Medicare when they were in power?  No, they actually created a new entitlement program and invaded two countries that posed zero threat to the American people instead.\nYou cannot fix a problem by applying more of what helped cause it.  America is no longer free.  Get used to it.  The absence of human liberty is, after all, very much the norm for the greater part of human history.\nUPDATE: Republicans\naren’t even going to try\nto repeal Obamacare.\nSen. John Cornyn (R., Texas) told HuffPo today that Republicans won’t run on an across-the-board repeal of new health-care laws.  “There is non-controversial stuff here like the preexisting conditions exclusion and those sorts of things,” the Texas Republican said. “Now we are not interested in repealing that. And that is frankly a distraction.”\nPut that in your tea and drink it….",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-23T18:17:00+00:00"
}