{
  "url": "https://voxday.net/2010/03/19/mailvox-divine-communication/",
  "scraped_at": "2026-01-08T23:22:27.299224",
  "title": "Mailvox: Divine communication",
  "date_display": "March 19, 2010",
  "date_iso": "2010-03-19T17:15:00+00:00",
  "date_from_url": "2010-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DF requests clarification:</p><blockquote><p>I have a question for you.  In your <a href=\"http://www.milobookclub.com/2010/03/17/literal-or-non-litera/\">Literal or non-literal post</a>, you stated, “I do not believe that the human mind is capable of properly comprehending either the Word of God or the Will of God.”  God’s thoughts are above our thoughts, that is clear.  However, do you really believe that a God who a) created humans, b) became a human, and c) openly desires communion with humans lacks the capacity or willingness to communicate with humans on a level that we can “properly comprehend”?  If so, which is it: incapacity or unwillingness?</p></blockquote><p>First, I must note that DF’s three points are not quite correct.  The Father created Man, but He never became a man.  That is, of course, a minor correction and not pertinent to the question at hand.  I believe that the answer has to be unwillingness, since the design of Man is such that Man lacks the capacity to fully comprehend God’s Will or His reason.  And Man clearly lacked this capacity from the start, as evidenced by Adam’s failure to grasp the difference between Good and Evil.</p><p>So, while it is God’s intention that we understand and obey Him to the best of our limited capacity to do so, it is clearly not His intention that we fully comprehend either His purposes or His reason.  The thoughtful reader will note that this also explains the common atheist complaint that God does not make it easy for them to see or believe in Him.  There is no Scriptural indication that making things easy for us to comprehend has ever been any part of His intentions, and indeed, there is a great deal of evidence indicating the precise opposite.</p></div>",
  "content_text": "DF requests clarification:\nI have a question for you.  In your\nLiteral or non-literal post\n, you stated, “I do not believe that the human mind is capable of properly comprehending either the Word of God or the Will of God.”  God’s thoughts are above our thoughts, that is clear.  However, do you really believe that a God who a) created humans, b) became a human, and c) openly desires communion with humans lacks the capacity or willingness to communicate with humans on a level that we can “properly comprehend”?  If so, which is it: incapacity or unwillingness?\nFirst, I must note that DF’s three points are not quite correct.  The Father created Man, but He never became a man.  That is, of course, a minor correction and not pertinent to the question at hand.  I believe that the answer has to be unwillingness, since the design of Man is such that Man lacks the capacity to fully comprehend God’s Will or His reason.  And Man clearly lacked this capacity from the start, as evidenced by Adam’s failure to grasp the difference between Good and Evil.\nSo, while it is God’s intention that we understand and obey Him to the best of our limited capacity to do so, it is clearly not His intention that we fully comprehend either His purposes or His reason.  The thoughtful reader will note that this also explains the common atheist complaint that God does not make it easy for them to see or believe in Him.  There is no Scriptural indication that making things easy for us to comprehend has ever been any part of His intentions, and indeed, there is a great deal of evidence indicating the precise opposite.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-19T17:15:00+00:00"
}