{
  "url": "https://voxday.net/2010/03/05/mailvox-smith-vs-ricardo/",
  "scraped_at": "2026-01-08T23:21:14.538380",
  "title": "Mailvox: Smith vs Ricardo",
  "date_display": "March 5, 2010",
  "date_iso": "2010-03-05T08:12:00+00:00",
  "date_from_url": "2010-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LS emails a 2003 essay by R.B. Calco published in the American Conservative.  Here’s an excerpt:</p><blockquote><p>The Father of free trade was no globalist.</p><p>Adam Smith is commonly regarded as the father of modern economics.  Free traders claim he is also the father of free trade and credit him with the first systematic attack on government regulation of trade ever written. This is true as far as it goes.  This is not to say, however, that Adam Smith was a free trader in the same sense that the term is promoted today.  Since David Ricardo and the Austrians took hold of it, the term has acquired a dimension and a purpose that was, to paraphrase Smith, no part of his intention.  Or, in any event, it was no part of his definition.  Smith’s argument for trade was rooted in what economists today refer to as “Absolute Advantage”; it was left to the crafty mind of David Ricardo half a century later to invent a justification for trade on the basis of the far more subjective “Comparative Advantage” that today the economists tell us we need to consider instead.</p><p>While the dull, pencil-headed, pocket calculator logic of Comparative Advantage works fine for the textbook laboratory example f two nations and two products, it falls apart entirely the minute real-world constraints or considerations are introduced.  It becomes absurd when you attempt to factor “comparative advantage” across three nations and three products, let alone the hundreds of nations and millions of products of the real world.  Try it – you will lose your mind.</p><p>All Comparative Advantage amounts to, reduced to its essential components, is a sophistic argument for international division of labor — for global economic union — without dealing with any issues of political union.  It is the economic equivalent of living in sin, so to speak.  For whatever intuitive sense it claims to have, this argument relies on a fundamental confusion between trade — economic activity between economic systems — and division of labor — economic activity between individuals in a single economic system.</p><p>At bottom, this argument is a bait-and-switch for a global system, not a plan for any one nation to become wealthy, least of all the United States, which, according to the law of equilibrium, would be forced under a free-trade regime to sustain massive losses of jobs and wealth to pull all other nations up in the new global wage and price structure.</p></blockquote><p>There is little question that global free trade tends to raise the overall level of global wealth.  But what consequence-blind Ricardians stubbornly refuse to understand is that Comparative Advantage simply does not work on a macroeconomic level.  The falsity of their assumptions is easily determined both logically and empirically; in RGD, for example, I show how the historical trade statistics prove that the Smoot-Hawley tariff could not possibly have played a major role, let alone a causal one, in causing the Great Depression.</p><p>The important logical question that the Ricardians have to answer is this: Does the level of rising global wealth come at the benefit or the expense of the wealthiest nations?  The important empirical question is this: What is the rate of increase in U.S. national wealth per capita compared to the rate of increase in global wealth per capita?  Those who are intellectually honest enough to contemplate answering those straightforward questions of applied theory instead of retreating to the safety of the abstract will soon recognize that the Comparative Advantage is a fundamentally incorrect doctrine and the Ricardian case for free trade is strictly dependent upon circumstances that do not apply to many situations, presently including that of the United States.</p><p>Those who disagree are certainly welcome to answer those two questions so long as they provide an amount of reason and evidence in support of their answers.  And it is worth keeping in mind, as Joseph Schumpeter pointed out, that David Ricardo was first and foremost a political creature and an ideologue, he was not an intellectual driven by a natural interest in the truth of the matter.  This is not to argue that what is known as the Ricardian theory of Comparative Advantage is incorrect on an ad hominem basis, I am merely pointing out the historical fact that his case was a political one with a specific policy objective in mind.  It is also worth noting that the this case was not even original to him, as the idea of Comparative Advantage was first introduced by Robert Torrens in <i>An Essay on the External Corn Trade</i> two years before Ricardo published <i>On the Principles of Political Economy and Taxation</i>.</p></div>",
  "content_text": "LS emails a 2003 essay by R.B. Calco published in the American Conservative.  Here’s an excerpt:\nThe Father of free trade was no globalist.\nAdam Smith is commonly regarded as the father of modern economics.  Free traders claim he is also the father of free trade and credit him with the first systematic attack on government regulation of trade ever written. This is true as far as it goes.  This is not to say, however, that Adam Smith was a free trader in the same sense that the term is promoted today.  Since David Ricardo and the Austrians took hold of it, the term has acquired a dimension and a purpose that was, to paraphrase Smith, no part of his intention.  Or, in any event, it was no part of his definition.  Smith’s argument for trade was rooted in what economists today refer to as “Absolute Advantage”; it was left to the crafty mind of David Ricardo half a century later to invent a justification for trade on the basis of the far more subjective “Comparative Advantage” that today the economists tell us we need to consider instead.\nWhile the dull, pencil-headed, pocket calculator logic of Comparative Advantage works fine for the textbook laboratory example f two nations and two products, it falls apart entirely the minute real-world constraints or considerations are introduced.  It becomes absurd when you attempt to factor “comparative advantage” across three nations and three products, let alone the hundreds of nations and millions of products of the real world.  Try it – you will lose your mind.\nAll Comparative Advantage amounts to, reduced to its essential components, is a sophistic argument for international division of labor — for global economic union — without dealing with any issues of political union.  It is the economic equivalent of living in sin, so to speak.  For whatever intuitive sense it claims to have, this argument relies on a fundamental confusion between trade — economic activity between economic systems — and division of labor — economic activity between individuals in a single economic system.\nAt bottom, this argument is a bait-and-switch for a global system, not a plan for any one nation to become wealthy, least of all the United States, which, according to the law of equilibrium, would be forced under a free-trade regime to sustain massive losses of jobs and wealth to pull all other nations up in the new global wage and price structure.\nThere is little question that global free trade tends to raise the overall level of global wealth.  But what consequence-blind Ricardians stubbornly refuse to understand is that Comparative Advantage simply does not work on a macroeconomic level.  The falsity of their assumptions is easily determined both logically and empirically; in RGD, for example, I show how the historical trade statistics prove that the Smoot-Hawley tariff could not possibly have played a major role, let alone a causal one, in causing the Great Depression.\nThe important logical question that the Ricardians have to answer is this: Does the level of rising global wealth come at the benefit or the expense of the wealthiest nations?  The important empirical question is this: What is the rate of increase in U.S. national wealth per capita compared to the rate of increase in global wealth per capita?  Those who are intellectually honest enough to contemplate answering those straightforward questions of applied theory instead of retreating to the safety of the abstract will soon recognize that the Comparative Advantage is a fundamentally incorrect doctrine and the Ricardian case for free trade is strictly dependent upon circumstances that do not apply to many situations, presently including that of the United States.\nThose who disagree are certainly welcome to answer those two questions so long as they provide an amount of reason and evidence in support of their answers.  And it is worth keeping in mind, as Joseph Schumpeter pointed out, that David Ricardo was first and foremost a political creature and an ideologue, he was not an intellectual driven by a natural interest in the truth of the matter.  This is not to argue that what is known as the Ricardian theory of Comparative Advantage is incorrect on an ad hominem basis, I am merely pointing out the historical fact that his case was a political one with a specific policy objective in mind.  It is also worth noting that the this case was not even original to him, as the idea of Comparative Advantage was first introduced by Robert Torrens in\nAn Essay on the External Corn Trade\ntwo years before Ricardo published\nOn the Principles of Political Economy and Taxation\n.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-05T08:12:00+00:00"
}