{
  "url": "https://voxday.net/2010/03/02/mailvox-implications-of-evolution/",
  "scraped_at": "2026-01-08T23:20:58.008260",
  "title": "Mailvox: the implications of evolution",
  "date_display": "March 2, 2010",
  "date_iso": "2010-03-02T15:30:00+00:00",
  "date_from_url": "2010-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://johncwright.livejournal.com/\">John C. Wright</a> responds to <a href=\"http://www.cnn.com/2010/HEALTH/02/26/liberals.atheists.sex.intelligence/index.html?hpt=C2\">the recent CNN report on religion, political tendencies, intelligence, and evolution</a> that cited a 6-point average IQ advantage for liberal atheists:</p><blockquote><p>I love how these ‘Just So’ stories always just so happen to flatter the person telling it.   Just for the sake of contrast, I’d like to see an evolutionary sociobiologist<br> say something along the lines of: “Being an atheist, like being a sociopath, is a defective mutation of the genes human beings use to recognize meaning in life. Robbed of this basic faculty of human thought, atheists tend to retreat into paranoid fantasies of superiority, as if their inability to grasp reality were a result of greater, rather than lesser, intellectual activity.</br></p><p>“Consequently they tend to be bookish, and selfish, and to cut social ties to family and friends: but this crippling isolation and arrogance, ironically, allows some of them to score well on I.Q. tests, which do not, after all, measure those social skills that tribes of hunter-gatherers need to survive.</p><p>“The fact that no civilization and no tribe in the history of the world has been atheist, except for a very few malignant Twentieth Century regimes of unparalleled savagery and bloodshed, might indicate why atheism has had no positive influence on the philosophy, art, culture, law or advancement of civilization since the dawn of time. Natural selection culls this unfavorable mutation, and only in the<br> luxurious modern day, when science can keep alive even worthless and backward members of the bloodline, has it been possible to preserve a statistically significant moiety of this evolutionary dead end.</br></p><p>“Sufferers of what is now called ‘The Dawkins Syndrome’ are generally acknowledged to be harmless irritants in their host sociieties, but, as the cases of Russia and China make abundantly clear, when this dangerous ‘meme’ of self-centered defensive arrogance spreads to others, the result is genocidal levels of mass murder.”</p></blockquote><p>There are several amusing aspects to this.  First, I find it very funny indeed to see people whose IQs are more than thirty points lower than mine attempting to cite a six-point average IQ advantage as proof of their superior intelligence, and therefore, their belief systems as well.  I’m impressed, to be sure, albeit not exactly in the way they intended.  An appeal to authority is bad enough, but an appeal to average statistical advantage is insane.</p><p>Second, this appears to be confirmation of something I described in TIA.  Atheists are going to be more intelligent than the average by literal self-definition.  The ability to understand and identify with an abstract concept that departs from the norm requires some basic level of intelligence, which excludes many less intelligent and  non-religious individuals who are by every meaningful definition atheists but do not self-identify as atheists.  Libertarians, for example, would benefit from the same self-selecting mechanism.  It is possible that the Kanagawa study corrected for this identification bias, but that is unlikely as I am unaware of any study of atheism and religion that has done so.</p><p>To me, the most interesting and counterintuitive discovery  is the reported link between sexual exclusivity and <i>male</i> atheism.  That surprised me, although I suppose it shouldn’t have if I had thought about it more.  Now, one can’t read too much into this yet, since we don’t know what exactly what “sexual exclusivity” means, but it does tend to contradict what one would expect given the male atheist obsession with religious sexual restrictions.  The hint is the divergence between male and female atheists, so my suspicion – and at this point it is nothing more than that – is that the Kanagawa report will provide some evidence of the link between atheism and social autism.  The dichotomy between the theoretical sexual freedom of the male atheist provided by his belief system and his actual sexual limitations caused by his sub-standard attractiveness to women suggests that male atheists, on average, are more inclined to be gamma/omega males whose sexual options are more restricted than the norm.  This hypothesis is supported by observing the consistently gamma behavior of male atheists on this site and around the Internet in general.</p></div>",
  "content_text": "John C. Wright\nresponds to\nthe recent CNN report on religion, political tendencies, intelligence, and evolution\nthat cited a 6-point average IQ advantage for liberal atheists:\nI love how these ‘Just So’ stories always just so happen to flatter the person telling it.   Just for the sake of contrast, I’d like to see an evolutionary sociobiologist\nsay something along the lines of: “Being an atheist, like being a sociopath, is a defective mutation of the genes human beings use to recognize meaning in life. Robbed of this basic faculty of human thought, atheists tend to retreat into paranoid fantasies of superiority, as if their inability to grasp reality were a result of greater, rather than lesser, intellectual activity.\n“Consequently they tend to be bookish, and selfish, and to cut social ties to family and friends: but this crippling isolation and arrogance, ironically, allows some of them to score well on I.Q. tests, which do not, after all, measure those social skills that tribes of hunter-gatherers need to survive.\n“The fact that no civilization and no tribe in the history of the world has been atheist, except for a very few malignant Twentieth Century regimes of unparalleled savagery and bloodshed, might indicate why atheism has had no positive influence on the philosophy, art, culture, law or advancement of civilization since the dawn of time. Natural selection culls this unfavorable mutation, and only in the\nluxurious modern day, when science can keep alive even worthless and backward members of the bloodline, has it been possible to preserve a statistically significant moiety of this evolutionary dead end.\n“Sufferers of what is now called ‘The Dawkins Syndrome’ are generally acknowledged to be harmless irritants in their host sociieties, but, as the cases of Russia and China make abundantly clear, when this dangerous ‘meme’ of self-centered defensive arrogance spreads to others, the result is genocidal levels of mass murder.”\nThere are several amusing aspects to this.  First, I find it very funny indeed to see people whose IQs are more than thirty points lower than mine attempting to cite a six-point average IQ advantage as proof of their superior intelligence, and therefore, their belief systems as well.  I’m impressed, to be sure, albeit not exactly in the way they intended.  An appeal to authority is bad enough, but an appeal to average statistical advantage is insane.\nSecond, this appears to be confirmation of something I described in TIA.  Atheists are going to be more intelligent than the average by literal self-definition.  The ability to understand and identify with an abstract concept that departs from the norm requires some basic level of intelligence, which excludes many less intelligent and  non-religious individuals who are by every meaningful definition atheists but do not self-identify as atheists.  Libertarians, for example, would benefit from the same self-selecting mechanism.  It is possible that the Kanagawa study corrected for this identification bias, but that is unlikely as I am unaware of any study of atheism and religion that has done so.\nTo me, the most interesting and counterintuitive discovery  is the reported link between sexual exclusivity and\nmale\natheism.  That surprised me, although I suppose it shouldn’t have if I had thought about it more.  Now, one can’t read too much into this yet, since we don’t know what exactly what “sexual exclusivity” means, but it does tend to contradict what one would expect given the male atheist obsession with religious sexual restrictions.  The hint is the divergence between male and female atheists, so my suspicion – and at this point it is nothing more than that – is that the Kanagawa report will provide some evidence of the link between atheism and social autism.  The dichotomy between the theoretical sexual freedom of the male atheist provided by his belief system and his actual sexual limitations caused by his sub-standard attractiveness to women suggests that male atheists, on average, are more inclined to be gamma/omega males whose sexual options are more restricted than the norm.  This hypothesis is supported by observing the consistently gamma behavior of male atheists on this site and around the Internet in general.",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-02T15:30:00+00:00"
}