{
  "url": "https://voxday.net/2010/03/26/on-helping-indebted-homeowners/",
  "scraped_at": "2026-01-08T23:23:02.482504",
  "title": "On “helping” indebted homeowners",
  "date_display": "March 26, 2010",
  "date_iso": "2010-03-26T14:15:00+00:00",
  "date_from_url": "2010-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger correctly <a href=\"http://market-ticker.denninger.net/archives/2125-Housing-Obama-Still-Has-Not-Grown-Up.html\">points out the obvious</a> about the latest Obama sleight of hand on housing:</p><blockquote><p>Absolutely none of the attempts made thus far have had a damn thing to do with helping Americans, and this “new program” is no exception.  They have all  – each and every one – been aimed at one and only one thing – allowing banks and the GSEs to lie about the “value” of the home loans they hold.</p><p>The essence of this economic mess was a credit bubble.  Nowhere was it bigger in the impact on the common American than in residential real estate.</p><p>Every action since this crisis began related to housing has acted to prevent the market from clearing.  Holding loans and houses above market value – the price where they will clear in a free and open market – has been done for one and only one purpose – to allow banks and GSEs that are radically underwater – that is, INSOLVENT – to pretend they are not.</p></blockquote><p>This latest plan <a href=\"http://www.bloomberg.com/apps/news?pid=20601087&amp;sid=atJluo6gnEQo&amp;pos=5\">to use TARP money to subsidize those who own homes with mortgages</a> that exceed the value of their homes is actually nothing more than another bank subsidy.  Washington is giving the banks something for nothing; the “cuts” envisioned on the second mortgages will actually have the net effect of temporarily creating some value in an otherwise worthless unsecured loan.  As Denninger points out, the plan does not represent a cut in loan value from 100% to 15%, but rather an increase from 0% to 15%.</p><p>It’s just more extend-and-pretend.  And like all the previous efforts to prop things up, it’s going to fail too.  Remember, the primary reason banks so desperately want to prevent foreclosures is because they want to avoid being forced to revalue the loans presently inflating their assets.</p><p>On a tangential note, consider the intriguing implications of the following comparison of interest rates:</p><p>4.78% 30-year Treasury Note<br> 4.99% 30-year mortgage</br></p><p>In other words, Federal Debt is priced as being nearly as risky as a home mortgage in a market where a significant number of mortgages are underwater or in default.</p></div>",
  "content_text": "Karl Denninger correctly\npoints out the obvious\nabout the latest Obama sleight of hand on housing:\nAbsolutely none of the attempts made thus far have had a damn thing to do with helping Americans, and this “new program” is no exception.  They have all  – each and every one – been aimed at one and only one thing – allowing banks and the GSEs to lie about the “value” of the home loans they hold.\nThe essence of this economic mess was a credit bubble.  Nowhere was it bigger in the impact on the common American than in residential real estate.\nEvery action since this crisis began related to housing has acted to prevent the market from clearing.  Holding loans and houses above market value – the price where they will clear in a free and open market – has been done for one and only one purpose – to allow banks and GSEs that are radically underwater – that is, INSOLVENT – to pretend they are not.\nThis latest plan\nto use TARP money to subsidize those who own homes with mortgages\nthat exceed the value of their homes is actually nothing more than another bank subsidy.  Washington is giving the banks something for nothing; the “cuts” envisioned on the second mortgages will actually have the net effect of temporarily creating some value in an otherwise worthless unsecured loan.  As Denninger points out, the plan does not represent a cut in loan value from 100% to 15%, but rather an increase from 0% to 15%.\nIt’s just more extend-and-pretend.  And like all the previous efforts to prop things up, it’s going to fail too.  Remember, the primary reason banks so desperately want to prevent foreclosures is because they want to avoid being forced to revalue the loans presently inflating their assets.\nOn a tangential note, consider the intriguing implications of the following comparison of interest rates:\n4.78% 30-year Treasury Note\n4.99% 30-year mortgage\nIn other words, Federal Debt is priced as being nearly as risky as a home mortgage in a market where a significant number of mortgages are underwater or in default.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-26T14:15:00+00:00"
}