{
  "url": "https://voxday.net/2010/03/31/political-science/",
  "scraped_at": "2026-01-08T23:23:29.533882",
  "title": "Political science",
  "date_display": "March 31, 2010",
  "date_iso": "2010-03-31T17:41:00+00:00",
  "date_from_url": "2010-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The UK attempts to <a href=\"http://www.breitbart.com/article.php?id=D9EP86981&amp;show_article=1\">whitewash Climategate</a>:</p><blockquote><p>The first of several British investigations into the e-mails leaked from one of the world’s leading climate research centers has <b>largely </b>vindicated the scientists involved.</p><p>The House of Commons’ Science and Technology Committee said Wednesday that <b>they’d seen no evidence</b> to support charges that the University of East Anglia’s Climatic Research Unit or its director, Phil Jones, had tampered with data or perverted the peer review process to exaggerate the threat of global warming—two of the most serious criticisms levied against the climatologist and his colleagues.</p><p>In their report, the committee said that, <b>as far as it was able to ascertain</b>, “the scientific reputation of Professor Jones and CRU remains intact,” adding that nothing in the more than 1,000 stolen e-mails, or the controversy kicked up by their publication, challenged scientific consensus that “global warming is happening and that it is induced by human activity.”…</p><p>Lawmakers stressed that their report—which was written after only a single day of oral testimony—<b>did not cover all the issues</b> and <b>would not be as in-depth</b> as the two other inquiries into the e-mail scandal that are still pending.</p></blockquote><p>Translation: we found nothing too terribly damning… mostly because we were careful not to look very hard.  Please, please, please be sure to notice all the qualifiers we were careful to insert so we don’t look like we were covering anything up when more in-depth investigations reach opposite conclusions.</p><p>The stonewalling didn’t work.  Neither will the whitewashing.</p></div>",
  "content_text": "The UK attempts to\nwhitewash Climategate\n:\nThe first of several British investigations into the e-mails leaked from one of the world’s leading climate research centers has\nlargely\nvindicated the scientists involved.\nThe House of Commons’ Science and Technology Committee said Wednesday that\nthey’d seen no evidence\nto support charges that the University of East Anglia’s Climatic Research Unit or its director, Phil Jones, had tampered with data or perverted the peer review process to exaggerate the threat of global warming—two of the most serious criticisms levied against the climatologist and his colleagues.\nIn their report, the committee said that,\nas far as it was able to ascertain\n, “the scientific reputation of Professor Jones and CRU remains intact,” adding that nothing in the more than 1,000 stolen e-mails, or the controversy kicked up by their publication, challenged scientific consensus that “global warming is happening and that it is induced by human activity.”…\nLawmakers stressed that their report—which was written after only a single day of oral testimony—\ndid not cover all the issues\nand\nwould not be as in-depth\nas the two other inquiries into the e-mail scandal that are still pending.\nTranslation: we found nothing too terribly damning… mostly because we were careful not to look very hard.  Please, please, please be sure to notice all the qualifiers we were careful to insert so we don’t look like we were covering anything up when more in-depth investigations reach opposite conclusions.\nThe stonewalling didn’t work.  Neither will the whitewashing.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-31T16:41:00+00:00"
}