{
  "url": "https://voxday.net/2010/03/12/reading-in-real-world/",
  "scraped_at": "2026-01-08T23:21:51.183768",
  "title": "Reading in the real world",
  "date_display": "March 12, 2010",
  "date_iso": "2010-03-12T18:15:00+00:00",
  "date_from_url": "2010-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I admire the generous purpose behind <a href=\"http://whatever.scalzi.com/2010/03/11/the-big-idea-skyler-white/\">John Scalzi’s The Big Idea posts</a>, in which he provides space to an author to explain The Big Idea underlying his newly published book, I have to admit that I have tended to have little interest in most of books that have been featured there because I simply don’t read much SF/F anymore.  I increasingly find that I’d rather <i>play</i> it.</p><p>Since John doesn’t do much the way of non-fiction at Whatever and because the Ilk tend to be more interested in exposure to more serious subjects than the latest attempt to adultize angst-filled teen vampire/wereseal novels, it occurs to me that a similar feature might be welcome here, especially in light of how Mr. Rockwell was kind enough to provide me <a href=\"http://www.lewrockwell.com/orig5/day6.1.1.html\">with space at his site to introduce RGD</a> the week it was published.  So, if you are the author of a non-fiction book in the field of history, politics, economics, or science that has been published since August 2009, I’d like to invite you to email me a 500 to 2,000-word account of what you believe to be worthy of note about your new book accompanied by a link to an image of the cover.</p><p>On a barely tangential note, this afternoon I had what I thought to be a fantastic idea for my next non-fiction book.  Reflecting on the missing Life of Epaminondas, I completely cracked up over the thought of writing <i>Godwin’s Lives</i>, which would be a set of parallel Lives ala Plutarch purporting to compare one classic historical figure with a modern one, albeit every classic figure would be compared to Hitler.  Needless to say, this is why Spacebunny seldom asks me to share what I’m thinking.</p><p>And to return to the subject, more or less, I’m presently reading <i>Makers of Ancient Strategy</i>, edited by Victor Davis Hanson.  It’s a very good collection of essays and I will post a review of the book next week.  However, it was a little startling to encounter VDH’s brief rebuttal – a fairly effective one, to be honest – addressed to the “many commenters” who had referenced the Athenian attack on Syracuse in criticizing the American invasion of Iraq.  I suspect he may have had <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=48256\">this column in particular</a> in mind.</p></div>",
  "content_text": "While I admire the generous purpose behind\nJohn Scalzi’s The Big Idea posts\n, in which he provides space to an author to explain The Big Idea underlying his newly published book, I have to admit that I have tended to have little interest in most of books that have been featured there because I simply don’t read much SF/F anymore.  I increasingly find that I’d rather\nplay\nit.\nSince John doesn’t do much the way of non-fiction at Whatever and because the Ilk tend to be more interested in exposure to more serious subjects than the latest attempt to adultize angst-filled teen vampire/wereseal novels, it occurs to me that a similar feature might be welcome here, especially in light of how Mr. Rockwell was kind enough to provide me\nwith space at his site to introduce RGD\nthe week it was published.  So, if you are the author of a non-fiction book in the field of history, politics, economics, or science that has been published since August 2009, I’d like to invite you to email me a 500 to 2,000-word account of what you believe to be worthy of note about your new book accompanied by a link to an image of the cover.\nOn a barely tangential note, this afternoon I had what I thought to be a fantastic idea for my next non-fiction book.  Reflecting on the missing Life of Epaminondas, I completely cracked up over the thought of writing\nGodwin’s Lives\n, which would be a set of parallel Lives ala Plutarch purporting to compare one classic historical figure with a modern one, albeit every classic figure would be compared to Hitler.  Needless to say, this is why Spacebunny seldom asks me to share what I’m thinking.\nAnd to return to the subject, more or less, I’m presently reading\nMakers of Ancient Strategy\n, edited by Victor Davis Hanson.  It’s a very good collection of essays and I will post a review of the book next week.  However, it was a little startling to encounter VDH’s brief rebuttal – a fairly effective one, to be honest – addressed to the “many commenters” who had referenced the Athenian attack on Syracuse in criticizing the American invasion of Iraq.  I suspect he may have had\nthis column in particular\nin mind.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-12T18:15:00+00:00"
}