{
  "url": "https://voxday.net/2010/03/01/return-of-great-depression-blog/",
  "scraped_at": "2026-01-08T23:20:50.704329",
  "title": "Return of the Great Depression blog",
  "date_display": "March 1, 2010",
  "date_iso": "2010-03-01T14:00:00+00:00",
  "date_from_url": "2010-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things I have wanted to do since the release of the book is to turn <a href=\"http://www.returnofthegreatdepression.com\">the RGD book site</a> into a bona fide economic resource.  However, I simply have not had the bandwidth.  A number of people responded to my inquiry last month, and I selected two of them to act as my associate bloggers there.</p><p><a href=\"http://www.samueljscott.com/\">Sam </a>will be focused on Europe, Asia, and the Middle East.  He has a great initial post on why the current economic crisis <a href=\"http://www.returnofthegreatdepression.com/2010/03/how-israel-beat-the-recession/\">has not hit Israel</a> as hard as might be expected.  He’ll be paying particularly close attention to the Greek situation and to the Irish and Spanish reports since it’s looking like one of those three nations will be the flashpoint in the next round of European debt-deflation.  But don’t count out China either….</p><p>Carlton will be focused on the USA and keeping abreast of the economic release schedule, particularly as it relates to significant indicators such as debt, New Orders, housing prices, and sales tax revenues.  His introductory post is on the FDIC.  The goal is to have daily updates on various economic statistics, but focused on those measures that I believe to be more significant and less susceptible to manipulation for political purposes.  In keeping with this goal, I’ve added my own post showing annual GDP growth charted against total commercial bank loan growth <a href=\"http://www.returnofthegreatdepression.com/2010/03/gdp-and-loan-growth/\">from 1947 to 2010</a>.</p><p>Any comments or suggestions for further improvements would be welcome.</p></div>",
  "content_text": "One of the things I have wanted to do since the release of the book is to turn\nthe RGD book site\ninto a bona fide economic resource.  However, I simply have not had the bandwidth.  A number of people responded to my inquiry last month, and I selected two of them to act as my associate bloggers there.\nSam\nwill be focused on Europe, Asia, and the Middle East.  He has a great initial post on why the current economic crisis\nhas not hit Israel\nas hard as might be expected.  He’ll be paying particularly close attention to the Greek situation and to the Irish and Spanish reports since it’s looking like one of those three nations will be the flashpoint in the next round of European debt-deflation.  But don’t count out China either….\nCarlton will be focused on the USA and keeping abreast of the economic release schedule, particularly as it relates to significant indicators such as debt, New Orders, housing prices, and sales tax revenues.  His introductory post is on the FDIC.  The goal is to have daily updates on various economic statistics, but focused on those measures that I believe to be more significant and less susceptible to manipulation for political purposes.  In keeping with this goal, I’ve added my own post showing annual GDP growth charted against total commercial bank loan growth\nfrom 1947 to 2010\n.\nAny comments or suggestions for further improvements would be welcome.",
  "tags": [
    "economics",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-01T14:00:00+00:00"
}