{
  "url": "https://voxday.net/2010/03/22/rgd-rather-good-review/",
  "scraped_at": "2026-01-08T23:22:40.182866",
  "title": "RGD: a rather good review",
  "date_display": "March 22, 2010",
  "date_iso": "2010-03-22T14:15:00+00:00",
  "date_from_url": "2010-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An academic economist <a href=\"http://www.amazon.com/review/R14N3S0N1XYOO7/ref=cm_cr_rdp_perm\">reviews RGD</a>:</p><blockquote><p>The book is simply a brilliant masterpiece. It is written remarkably well and gets you to read more and more. It provides a balanced mix between telling a story and zooming in on the economic fundamentals. Right from the very beginning, it becomes perfectly clear to the cognoscenti that Vox is a member of a small, ultra-elite club that has figured out the fundamental flaws of our modern-day Keynesian economic dogma, as well as the finest points of the Austrian school that only few people in the world are familiar with and understand. As an Austrian myself, it is easy to see how sophisticated Vox is in the area.</p><p>I am a professor in Economics who has been trained in and disillusioned from the mainstream economics. As an economist, I was completely reborn when I became an Austrian 7-8 years ago. Ever since, I have been teaching economics and finance mostly as an Austrian. During the Spring semester of 2008, I was teaching a course on the Financial Crisis at the American University in Bulgaria. My biggest regret is that I did not have at that time available to use Vox’s book for my course. It would have been perfect. The book may be somewhat difficult for first year Econ 101, but it is absolutely perfect for juniors and seniors – it could well be the book that will make them rethink their mainstream economics foundations. For my course, I had to use Peter Schiff’s “Crash Proof” as the very best available at the time. If I had to do it today again, I would use “The Return of the Great Depression” as my primary book. When combined with “Crash Proof”, it provides a killer combination that would open the eyes to any student willing to read. My third choice would be, without doubt, “Meltdown” by Thomas Woods.</p><p>Enough praising Vox and his book. Do not hesitate to get your copy and read it – I guarantee that you would be glad you did it.</p></blockquote><p>This is without a doubt the best book review I have ever received from Bulgaria.  Possibly the most interesting thing about Dr. Petrov’s review is that I happen to know he does not agree with me on the most important question of the day, <a href=\"http://www.financialsense.com/editorials/petrov/2008/1226.html\">inflation vs deflation</a>.  But, as I have said many times in writing about the issue, including in RGD, there are very smart and informed individuals on both sides of the issue and it is only the less sophisticated observers who think that the issue is simple enough to be critical of the other side for the way they interpret the available evidence.  While I think that evidence of the last fifteen months has tended to favor the deflationary scenario, I don’t regard the matter as settled.  And I certainly don’t think any less of excellent economic observers such as Marc Faber, Jim Rogers, Peter Schiff, the Mogambo Guru, or Dr. Petrov due to their expectation of a Whiskey Zulu situation.</p><p>Economics is a complex science wherein the timing remains an art.  This means everyone gets something wrong sooner or later; even when you have interpreted all the evidence correctly you can still get the timing fatally wrong.  I very much appreciate Dr. Petrov’s review, as it is great to see academics who have opened their minds to Austrian School economic theory.  But, to return to the inflation/deflation matter, <a href=\"http://www.swarmusa.com/vb4/content.php/282-THE-Most-Important-Chart-of-the-CENTURY\">this chart on the diminishing marginal utility of debt</a> nicely illustrates why I fall on the deflationary side and why I am confident that we are still in the early stages of the Great Depression 2.0.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://market-ticker.denninger.net/uploads/2010/Mar/Diminishing-Prod.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"241\" src=\"http://market-ticker.denninger.net/uploads/2010/Mar/Diminishing-Prod.jpg\" width=\"400\"/></a></div></div>",
  "content_text": "An academic economist\nreviews RGD\n:\nThe book is simply a brilliant masterpiece. It is written remarkably well and gets you to read more and more. It provides a balanced mix between telling a story and zooming in on the economic fundamentals. Right from the very beginning, it becomes perfectly clear to the cognoscenti that Vox is a member of a small, ultra-elite club that has figured out the fundamental flaws of our modern-day Keynesian economic dogma, as well as the finest points of the Austrian school that only few people in the world are familiar with and understand. As an Austrian myself, it is easy to see how sophisticated Vox is in the area.\nI am a professor in Economics who has been trained in and disillusioned from the mainstream economics. As an economist, I was completely reborn when I became an Austrian 7-8 years ago. Ever since, I have been teaching economics and finance mostly as an Austrian. During the Spring semester of 2008, I was teaching a course on the Financial Crisis at the American University in Bulgaria. My biggest regret is that I did not have at that time available to use Vox’s book for my course. It would have been perfect. The book may be somewhat difficult for first year Econ 101, but it is absolutely perfect for juniors and seniors – it could well be the book that will make them rethink their mainstream economics foundations. For my course, I had to use Peter Schiff’s “Crash Proof” as the very best available at the time. If I had to do it today again, I would use “The Return of the Great Depression” as my primary book. When combined with “Crash Proof”, it provides a killer combination that would open the eyes to any student willing to read. My third choice would be, without doubt, “Meltdown” by Thomas Woods.\nEnough praising Vox and his book. Do not hesitate to get your copy and read it – I guarantee that you would be glad you did it.\nThis is without a doubt the best book review I have ever received from Bulgaria.  Possibly the most interesting thing about Dr. Petrov’s review is that I happen to know he does not agree with me on the most important question of the day,\ninflation vs deflation\n.  But, as I have said many times in writing about the issue, including in RGD, there are very smart and informed individuals on both sides of the issue and it is only the less sophisticated observers who think that the issue is simple enough to be critical of the other side for the way they interpret the available evidence.  While I think that evidence of the last fifteen months has tended to favor the deflationary scenario, I don’t regard the matter as settled.  And I certainly don’t think any less of excellent economic observers such as Marc Faber, Jim Rogers, Peter Schiff, the Mogambo Guru, or Dr. Petrov due to their expectation of a Whiskey Zulu situation.\nEconomics is a complex science wherein the timing remains an art.  This means everyone gets something wrong sooner or later; even when you have interpreted all the evidence correctly you can still get the timing fatally wrong.  I very much appreciate Dr. Petrov’s review, as it is great to see academics who have opened their minds to Austrian School economic theory.  But, to return to the inflation/deflation matter,\nthis chart on the diminishing marginal utility of debt\nnicely illustrates why I fall on the deflationary side and why I am confident that we are still in the early stages of the Great Depression 2.0.",
  "tags": [
    "economics",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-22T14:15:00+00:00"
}