{
  "url": "https://voxday.net/2010/03/31/science-teacher-responds/",
  "scraped_at": "2026-01-08T23:23:31.439012",
  "title": "A science teacher responds",
  "date_display": "March 31, 2010",
  "date_iso": "2010-03-31T19:00:00+00:00",
  "date_from_url": "2010-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Hatfield <a href=\"http://monkeytrials.blogspot.com/2010/03/three-points-for-vox.html\">replies to my post</a> supporting his call to reject a proposal to further federalize education:</p><blockquote><p>Vox’s reply is interesting and wide-ranging. I can only touch on a few points (in fact, three) that might be said to fall in my area of knowledge. Vox writes:</p><p><i>“I’m curious to know how Scott would prefer to see teachers evaluated.”</i></p><p>This is a thorny question, in that there are political realities at work. Most teachers are affiliated with teacher’s unions which tend to resist objective measures tied to student performance on standardized tests, for reasons that Vox acknowledges. Unfortunately, many unions tend to resist objective measures in general, and many educational professionals in administration and in government are so wedded to ‘standards-based reform’ that considering a different approach is unlikely to occur during my teaching career. I’m not punting, you understand, just acknowledging that there are practical reasons why we have the impasse that presently exists in terms of assessing instructor performance.</p></blockquote><p>One of the things I enjoy about discourse with Scott is that unlike so many other evolutionists, he is open to the possibility that skepticism about TENS is not intrinsically related to one’s religious faith; this happens to be a position that is also in accord with the observable fact of numerous irreligious evolutionary skeptics.  Nevertheless, I have to take some small exception to Scott’s belief that I misread the 8a of the California standards, specifically the second sentence quoted:  “Students know how natural selection determines the differential survival of groups of organisms.”  Because there is insufficient scientific evidence to indicate that natural selection even exists beyond the tautological level, I don’t see how anyone, let alone students, can presently know how it determines the differential survival of anything, including groups of organisms.</p><p>And in the interest of forestalling all the poorly read evolutionists who will be tempted to claim that I don’t understand the science due to their failure to keep up on the latest research, please note that the erroneous basis of most of the evidence presently cited in support of natural selection isn’t something you should take up with me, but rather, <a href=\"http://live.psu.edu/story/38686\">with Masatoshi Nei, Shozo Yokoyama, and Yoshiyuki Suzuki</a>.  And yes, I know they still believe in natural selection despite their criticism of the statistical evidence, but then, their personal opinions are neither science nor the point.</p></div>",
  "content_text": "Scott Hatfield\nreplies to my post\nsupporting his call to reject a proposal to further federalize education:\nVox’s reply is interesting and wide-ranging. I can only touch on a few points (in fact, three) that might be said to fall in my area of knowledge. Vox writes:\n“I’m curious to know how Scott would prefer to see teachers evaluated.”\nThis is a thorny question, in that there are political realities at work. Most teachers are affiliated with teacher’s unions which tend to resist objective measures tied to student performance on standardized tests, for reasons that Vox acknowledges. Unfortunately, many unions tend to resist objective measures in general, and many educational professionals in administration and in government are so wedded to ‘standards-based reform’ that considering a different approach is unlikely to occur during my teaching career. I’m not punting, you understand, just acknowledging that there are practical reasons why we have the impasse that presently exists in terms of assessing instructor performance.\nOne of the things I enjoy about discourse with Scott is that unlike so many other evolutionists, he is open to the possibility that skepticism about TENS is not intrinsically related to one’s religious faith; this happens to be a position that is also in accord with the observable fact of numerous irreligious evolutionary skeptics.  Nevertheless, I have to take some small exception to Scott’s belief that I misread the 8a of the California standards, specifically the second sentence quoted:  “Students know how natural selection determines the differential survival of groups of organisms.”  Because there is insufficient scientific evidence to indicate that natural selection even exists beyond the tautological level, I don’t see how anyone, let alone students, can presently know how it determines the differential survival of anything, including groups of organisms.\nAnd in the interest of forestalling all the poorly read evolutionists who will be tempted to claim that I don’t understand the science due to their failure to keep up on the latest research, please note that the erroneous basis of most of the evidence presently cited in support of natural selection isn’t something you should take up with me, but rather,\nwith Masatoshi Nei, Shozo Yokoyama, and Yoshiyuki Suzuki\n.  And yes, I know they still believe in natural selection despite their criticism of the statistical evidence, but then, their personal opinions are neither science nor the point.",
  "tags": [
    "education",
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-31T18:00:00+00:00"
}