{
  "url": "https://voxday.net/2010/03/03/there-is-no-labour-there-is-no-tory/",
  "scraped_at": "2026-01-08T23:21:01.627856",
  "title": "There is no Labour, there is no Tory",
  "date_display": "March 3, 2010",
  "date_iso": "2010-03-03T12:07:00+00:00",
  "date_from_url": "2010-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Cameron’s <a href=\"http://article.nationalreview.com/426503/losing-it/andrew-stuttaford?page=1\">backtrack on the promised Lisbon referendum</a> was more revealing and will arguably be more electorally self-destructive than George Bush’s disavowal of “Read my lips.”</p><blockquote><p>it is interesting to see that the Conservative lead started to narrow shortly after the Tories reneged on a pledge to hold a referendum on the EU’s Lisbon Treaty in the event that they were to be elected…. Then there was the spectacle of Ken Clarke, the most Europhile senior Tory, being dispatched to meet with EU high-ups in Brussels.</p></blockquote><p>It is now clear that the so-called Conservative party is totally useless, they’re nothing more than the centrist wing of the UK’s EU party.  Those who wish to see the restoration of a strong and independent UK, or at least an independent and sovereign England, shouldn’t even consider voting Tory.  In effect, there is no Labour, there is no Tory, there is no LDP, there is only the BNP on the left, the EU party in the center and UKIP on the right.  As of now, those are the only relevant choices for UK voters, which comes down to voting UKIP or <i>abstimmen auf Deutsch</i>.</p></div>",
  "content_text": "David Cameron’s\nbacktrack on the promised Lisbon referendum\nwas more revealing and will arguably be more electorally self-destructive than George Bush’s disavowal of “Read my lips.”\nit is interesting to see that the Conservative lead started to narrow shortly after the Tories reneged on a pledge to hold a referendum on the EU’s Lisbon Treaty in the event that they were to be elected…. Then there was the spectacle of Ken Clarke, the most Europhile senior Tory, being dispatched to meet with EU high-ups in Brussels.\nIt is now clear that the so-called Conservative party is totally useless, they’re nothing more than the centrist wing of the UK’s EU party.  Those who wish to see the restoration of a strong and independent UK, or at least an independent and sovereign England, shouldn’t even consider voting Tory.  In effect, there is no Labour, there is no Tory, there is no LDP, there is only the BNP on the left, the EU party in the center and UKIP on the right.  As of now, those are the only relevant choices for UK voters, which comes down to voting UKIP or\nabstimmen auf Deutsch\n.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-03T12:07:00+00:00"
}