{
  "url": "https://voxday.net/2010/03/26/they-know-theyre-losing/",
  "scraped_at": "2026-01-08T23:23:05.765008",
  "title": "They know they’re losing",
  "date_display": "March 26, 2010",
  "date_iso": "2010-03-26T20:15:00+00:00",
  "date_from_url": "2010-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When you’re losing, <i><a href=\"http://www.npr.org/ombudsman/2010/03/npr_changes_abortion_language.html\">change the language</a></i>:</p><blockquote><p>“NPR News is revising the terms we use to describe people and groups involved in the abortion debate.  This updated policy is aimed at ensuring the words we speak and write are as clear, consistent and neutral as possible. This is important given that written text is such an integral part of our work.</p><p>On the air, we should use “abortion rights supporter(s)/advocate(s)” and “abortion rights opponent(s)” or derivations thereof (for example: “advocates of abortion rights”). It is acceptable to use the phrase “anti-abortion”, but do not use the term “pro-abortion rights”.</p><p>Digital News will continue to use the AP style book for online content, which mirrors the revised NPR policy.</p><p>Do not use “pro-life” and “pro-choice” in copy except when used in the name of a group.</p></blockquote><p>So, an “abortion rights supporter” is not “pro-abortion rights”?  How does that make any sense?  However, I do generally agree with the move away from the pro-life / pro-choice dichotomy.  Most abortionettes are not uniformly pro-abortion, they primarily support it in the case of black women or when a baby inconveniently stands in the way of obtaining that all important degree in <s>Starbuck’s management</s>Women’s Studies or <s>Walmart receptionist</s>Sociology.  And “pro-choice” was always stupid.  It was as about as reasonable as describing Hitler as “pro-choice” when it came to Jews.</p><p>Anyhow, it’s a pretty transparent to cast the anti-abortion movement as anti-rights.  Because all rights are good, after all.  Personally, I tend to view the two sides as “abortionette” and “decent, civilized human being”.  The ironic thing is that it’s usually the ignorant pro-infanticide crowd that attempts to portray the opposition as paleolithic.  But if there is one thing that archeology has taught us, it is that pre-Christian societies <a href=\"http://www.christiancadre.org/member_contrib/cp_infanticide.html\">viewed it as a parental right to murder unwanted children</a>, especially baby girls.</p></div>",
  "content_text": "When you’re losing,\nchange the language\n:\n“NPR News is revising the terms we use to describe people and groups involved in the abortion debate.  This updated policy is aimed at ensuring the words we speak and write are as clear, consistent and neutral as possible. This is important given that written text is such an integral part of our work.\nOn the air, we should use “abortion rights supporter(s)/advocate(s)” and “abortion rights opponent(s)” or derivations thereof (for example: “advocates of abortion rights”). It is acceptable to use the phrase “anti-abortion”, but do not use the term “pro-abortion rights”.\nDigital News will continue to use the AP style book for online content, which mirrors the revised NPR policy.\nDo not use “pro-life” and “pro-choice” in copy except when used in the name of a group.\nSo, an “abortion rights supporter” is not “pro-abortion rights”?  How does that make any sense?  However, I do generally agree with the move away from the pro-life / pro-choice dichotomy.  Most abortionettes are not uniformly pro-abortion, they primarily support it in the case of black women or when a baby inconveniently stands in the way of obtaining that all important degree in\nStarbuck’s management\nWomen’s Studies or\nWalmart receptionist\nSociology.  And “pro-choice” was always stupid.  It was as about as reasonable as describing Hitler as “pro-choice” when it came to Jews.\nAnyhow, it’s a pretty transparent to cast the anti-abortion movement as anti-rights.  Because all rights are good, after all.  Personally, I tend to view the two sides as “abortionette” and “decent, civilized human being”.  The ironic thing is that it’s usually the ignorant pro-infanticide crowd that attempts to portray the opposition as paleolithic.  But if there is one thing that archeology has taught us, it is that pre-Christian societies\nviewed it as a parental right to murder unwanted children\n, especially baby girls.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-26T20:15:00+00:00"
}