{
  "url": "https://voxday.net/2010/03/26/wanktankery-doo/",
  "scraped_at": "2026-01-08T23:23:04.304727",
  "title": "Wanktankery-doo",
  "date_display": "March 26, 2010",
  "date_iso": "2010-03-26T17:15:00+00:00",
  "date_from_url": "2010-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not being a Republican, a conservative, or a wonker, I am completely unconcerned with who happens to work at the various Washington <s>wankfests</s>think tanks.  That being said, I hardly think it’s astonishing to learn David Frum has continued <a href=\"http://corner.nationalreview.com/post/?q=MDk4NjA3NmU5NTI3ZDNhOGM4ODUzOWI2OTViNTg1NDM=\">to travel along the leftward path</a> trod by David Brock and others before him.</p><blockquote><p>With Mike Allen’s account  of his exchange with David Frum, we apparently have David’s version of his departure from AEI: Donor pressure forced AEI president Arthur Brooks to fire him. “But the elite isn’t leading anymore,” David is quoted as saying. “It’s trapped. Partly because of the desperate economic situation in the country, what were once the leading institutions of conservatism are constrained. I think Arthur took no pleasure in this. I think he was embarrassed. I think he would have avoided it if he possibly could, but he couldn’t.”</p><p>I have known and liked David and Danielle Frum for many years, and what I am about to write will end that friendship. I regret that. But his statement goes beyond self-serving. It is a calumny against an organization that has treated him not just fairly but generously…. I also think that for David to have leveled the charge that Arthur Brooks caved in to donor pressure, knowing that the charge would be picked up and spread beyond recall, knowing that such a charge strikes at the core of the Institute’s integrity, and making such a sensational charge without a shred of evidence, is despicable.</p></blockquote><p>Merowr!  Despicable calumny… that’s excellent.  This tempest in a teapot should be good for a few amusingly overheated columns over the next few weeks, to say nothing of random sideshots over the years.  Having read a pair of David Frum’s books and interviewed him, I think he’s an interesting thinker who is about as genuinely and deeply conservative as Lady Gaga.  Frum is one of those unique political analysts whose superior ability to recognize a problem is inversely proportional to his ability to recommend a reasonable solution to it.</p><p>I don’t see much value in the wank tanks anyhow.  Begging copious donations from a lot of people in order to give it to a few people who have never accomplished anything material in their lives to sit around and think grand thoughts strikes me as an excellent way to kill a lot of trees without producing anything of value.  I haven’t seen any evidence that the wank tanks have a better track record for putting out significant books than the average non-fiction publisher.  As for the American Enterprise Institute, I see they’ve got something like 13 Fellows who supposedly pay attention to the economy and U.S. monetary policy, precisely none of whom were capable of figuring out that perhaps keeping interest rates near zero just possibly might cause an investment bubble that could perhaps have some small effect on the economy.</p><p>(rolls eyes) Seriously, what in the name of Milton Friedman are you doing if your entire job is to pay attention to monetary policy and <i>you don’t even know what obvious effect certain monetary policies will have on the economy?</i></p></div>",
  "content_text": "Not being a Republican, a conservative, or a wonker, I am completely unconcerned with who happens to work at the various Washington\nwankfests\nthink tanks.  That being said, I hardly think it’s astonishing to learn David Frum has continued\nto travel along the leftward path\ntrod by David Brock and others before him.\nWith Mike Allen’s account  of his exchange with David Frum, we apparently have David’s version of his departure from AEI: Donor pressure forced AEI president Arthur Brooks to fire him. “But the elite isn’t leading anymore,” David is quoted as saying. “It’s trapped. Partly because of the desperate economic situation in the country, what were once the leading institutions of conservatism are constrained. I think Arthur took no pleasure in this. I think he was embarrassed. I think he would have avoided it if he possibly could, but he couldn’t.”\nI have known and liked David and Danielle Frum for many years, and what I am about to write will end that friendship. I regret that. But his statement goes beyond self-serving. It is a calumny against an organization that has treated him not just fairly but generously…. I also think that for David to have leveled the charge that Arthur Brooks caved in to donor pressure, knowing that the charge would be picked up and spread beyond recall, knowing that such a charge strikes at the core of the Institute’s integrity, and making such a sensational charge without a shred of evidence, is despicable.\nMerowr!  Despicable calumny… that’s excellent.  This tempest in a teapot should be good for a few amusingly overheated columns over the next few weeks, to say nothing of random sideshots over the years.  Having read a pair of David Frum’s books and interviewed him, I think he’s an interesting thinker who is about as genuinely and deeply conservative as Lady Gaga.  Frum is one of those unique political analysts whose superior ability to recognize a problem is inversely proportional to his ability to recommend a reasonable solution to it.\nI don’t see much value in the wank tanks anyhow.  Begging copious donations from a lot of people in order to give it to a few people who have never accomplished anything material in their lives to sit around and think grand thoughts strikes me as an excellent way to kill a lot of trees without producing anything of value.  I haven’t seen any evidence that the wank tanks have a better track record for putting out significant books than the average non-fiction publisher.  As for the American Enterprise Institute, I see they’ve got something like 13 Fellows who supposedly pay attention to the economy and U.S. monetary policy, precisely none of whom were capable of figuring out that perhaps keeping interest rates near zero just possibly might cause an investment bubble that could perhaps have some small effect on the economy.\n(rolls eyes) Seriously, what in the name of Milton Friedman are you doing if your entire job is to pay attention to monetary policy and\nyou don’t even know what obvious effect certain monetary policies will have on the economy?",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-26T17:15:00+00:00"
}