{
  "url": "https://voxday.net/2010/03/30/water-cooler-conversation/",
  "scraped_at": "2026-01-08T23:23:27.694630",
  "title": "Water cooler conversation",
  "date_display": "March 30, 2010",
  "date_iso": "2010-03-30T20:00:00+00:00",
  "date_from_url": "2010-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This may explain a certain amount of workplace inefficiency.  The context for this, as will no doubt be completely obvious to the casual reader, is firmware updates via USB.</i></p><p>MK: By the way, do you reject the doctrine of infallibility of the original scrolls of the Bible?  Because, as the PUOSU states, I had assumed at least that of the reader, and if you reject it, there is no reason to even respond, because you would fall outside of the scope of the argument. In terms of forming an opinion with an evolutionary algorithm, this would mean a cost of irreconcilable conflict between two passages being similar to <a href=\"http://xkcd.com/534/ \">thisAlgorithmBecomingSkynetCost</a>. Without the doctrine, the costs are different, and one can reach an opposite conclusion based on the same information.</p><p>VD: I believe so, assuming that I understand what you mean by “doctrine of infallibility” correctly.  My position on the overall message being correct and the various details not necessarily being correct is reasonably well-known at this point.  The part that most people fail to understand is that we are not capable of determining the perfectly correct from the not perfectly correct, so we should regard it as being correct to the greatest extent possible.</p><p>MK: Right, but there is still a division between inerrancy and infallibility. The former means that all statements that are given with the “voice of the narrator” in the Bible are true, and infallibility means that all THEOLOGICAL statements are true.</p><p>VD: I think something can be true without being perfectly or even properly understood.  So, I’m not sure I can say that I reject infallibility.</p><p>MK: Where the difference plays out in practice, is the cost of a conflict when interpreted according to the various doctrines. If there is an interpretation that resolves the conflict but feels a tad iffy (and the conflict is in a theological statement), the infallibility believer will always take it. Whereas the disbeliever may say “that’s just one verse, so it could be wrong.”</p><p>VD: Right, particularly when there are other verses pointing in another direction.  In this context, I would say that I am not a subscriber to the infallability doctrine.  If anything, I am a subscriber to the ineffability doctrine.</p><p>MK: Of course, I’m still interested to see the response, but just so that I understand that you assign the costs differently in the algorithm.  You are the first person not to give the textual equivalent of a blank stare, by the way.</p><p>VD: I am not as technical as you, but neither am I an idiot.</p><p>MK: Just my frustration with how there are perfectly concise ways to describe certain theological issues, that would otherwise take like five sermons, but I can’t use them due to the “huh?” problem.</p><p>VD: Imagine how God feels trying to explain things to us… in fact, this tends to metaphorically support the ineffability doctrine.</p><p>MK: But God would be able to accurately predict when the problem is going to happen, and wouldn’t even take the trouble of saying it. Which would force us to conclude that when He does say something, it is possible to understand it…. Can’t BELIEVE I didn’t see your argument coming, though. Total sucker punch.</p></div>",
  "content_text": "This may explain a certain amount of workplace inefficiency.  The context for this, as will no doubt be completely obvious to the casual reader, is firmware updates via USB.\nMK: By the way, do you reject the doctrine of infallibility of the original scrolls of the Bible?  Because, as the PUOSU states, I had assumed at least that of the reader, and if you reject it, there is no reason to even respond, because you would fall outside of the scope of the argument. In terms of forming an opinion with an evolutionary algorithm, this would mean a cost of irreconcilable conflict between two passages being similar to\nthisAlgorithmBecomingSkynetCost\n. Without the doctrine, the costs are different, and one can reach an opposite conclusion based on the same information.\nVD: I believe so, assuming that I understand what you mean by “doctrine of infallibility” correctly.  My position on the overall message being correct and the various details not necessarily being correct is reasonably well-known at this point.  The part that most people fail to understand is that we are not capable of determining the perfectly correct from the not perfectly correct, so we should regard it as being correct to the greatest extent possible.\nMK: Right, but there is still a division between inerrancy and infallibility. The former means that all statements that are given with the “voice of the narrator” in the Bible are true, and infallibility means that all THEOLOGICAL statements are true.\nVD: I think something can be true without being perfectly or even properly understood.  So, I’m not sure I can say that I reject infallibility.\nMK: Where the difference plays out in practice, is the cost of a conflict when interpreted according to the various doctrines. If there is an interpretation that resolves the conflict but feels a tad iffy (and the conflict is in a theological statement), the infallibility believer will always take it. Whereas the disbeliever may say “that’s just one verse, so it could be wrong.”\nVD: Right, particularly when there are other verses pointing in another direction.  In this context, I would say that I am not a subscriber to the infallability doctrine.  If anything, I am a subscriber to the ineffability doctrine.\nMK: Of course, I’m still interested to see the response, but just so that I understand that you assign the costs differently in the algorithm.  You are the first person not to give the textual equivalent of a blank stare, by the way.\nVD: I am not as technical as you, but neither am I an idiot.\nMK: Just my frustration with how there are perfectly concise ways to describe certain theological issues, that would otherwise take like five sermons, but I can’t use them due to the “huh?” problem.\nVD: Imagine how God feels trying to explain things to us… in fact, this tends to metaphorically support the ineffability doctrine.\nMK: But God would be able to accurately predict when the problem is going to happen, and wouldn’t even take the trouble of saying it. Which would force us to conclude that when He does say something, it is possible to understand it…. Can’t BELIEVE I didn’t see your argument coming, though. Total sucker punch.",
  "tags": [
    "freakshow",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-30T19:00:00+00:00"
}