{
  "url": "https://voxday.net/2010/03/21/whos-got-nex/",
  "scraped_at": "2026-01-08T23:22:36.547218",
  "title": "Who’s got next?",
  "date_display": "March 21, 2010",
  "date_iso": "2010-03-21T20:35:00+00:00",
  "date_from_url": "2010-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First it was Hitchens, now <a href=\"http://www.randi.org/site/index.php/swift-blog/914-how-to-say-it.html\">James Randi comes out of the closet</a>:</p><blockquote><p>Well, here goes. I really resent the term, but I use it because it’s recognized and accepted.</p><p>I’m gay.</p></blockquote><p>Let me first make it clear that I don’t think there’s any reason to mock the guy for his idiosyncrasy.  From what I have observed from the outside over the years, it is apparent that the lifestyle is not an easy one.  But his predilection is nevertheless relevant, as it was in the case of Hitchens, simply because it calls into question the primary source of his tireless opposition to religion.  It doesn’t change the strength or weakness of his so-called rationalist arguments in the least – those have to stand or fall on their own merits – but since Man is above all a <i>rationalizing</i> creature it does indicate the direction in which Randi’s confirmation biases have been pointing for quite some time now.</p><p>Anyhow, I applaud the man’s courage for addressing the matter in a forthright manner since it was obviously difficult for him.  And I don’t think it would be fair for anyone to claim it as “proof of the perfidy of the rationalist mode of life” since to the extent there may be a causal relationship, it would tend to run the other way.</p><p>All that being said, I must admit that I will, without a doubt, laugh myself silly if Dawkins is the next atheist to come out with a Very Special Announcement.</p></div>",
  "content_text": "First it was Hitchens, now\nJames Randi comes out of the closet\n:\nWell, here goes. I really resent the term, but I use it because it’s recognized and accepted.\nI’m gay.\nLet me first make it clear that I don’t think there’s any reason to mock the guy for his idiosyncrasy.  From what I have observed from the outside over the years, it is apparent that the lifestyle is not an easy one.  But his predilection is nevertheless relevant, as it was in the case of Hitchens, simply because it calls into question the primary source of his tireless opposition to religion.  It doesn’t change the strength or weakness of his so-called rationalist arguments in the least – those have to stand or fall on their own merits – but since Man is above all a\nrationalizing\ncreature it does indicate the direction in which Randi’s confirmation biases have been pointing for quite some time now.\nAnyhow, I applaud the man’s courage for addressing the matter in a forthright manner since it was obviously difficult for him.  And I don’t think it would be fair for anyone to claim it as “proof of the perfidy of the rationalist mode of life” since to the extent there may be a causal relationship, it would tend to run the other way.\nAll that being said, I must admit that I will, without a doubt, laugh myself silly if Dawkins is the next atheist to come out with a Very Special Announcement.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-21T20:35:00+00:00"
}