{
  "url": "https://voxday.net/2010/03/18/zero-reserve-banking-syste/",
  "scraped_at": "2026-01-08T23:22:19.950378",
  "title": "The zero-reserve banking system",
  "date_display": "March 18, 2010",
  "date_iso": "2010-03-18T16:47:00+00:00",
  "date_from_url": "2010-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unbelievable.  They certainly didn’t teach this in our economics textbooks.  From <a href=\"http://www.federalreserve.gov/newsevents/testimony/bernanke20100210a.htm#fn9\">Ben Bernanke’s testimony</a> to the House Committee on Financial Services:</p><blockquote><p>Given the very high level of reserve balances currently in the banking system, the Federal Reserve has ample time to consider the best long-run framework for policy implementation. The Federal Reserve believes it is possible that, ultimately, <b>its operating framework will allow the elimination of minimum reserve requirements</b>, which impose costs and distortions on the banking system.</p></blockquote><p>Those who have RGD will note that this elimination of reserve requirements would theoretically permit the former fractional-reserve banks to make an infinite amount of loans regardless of what deposits they hold.  This would also theoretically provide a rational basis for the hyperinflation scenario, but as I have pointed out many times before, even an infinite money multiple will require an infinity of borrowers.</p><p>If this does not make it clear to you that the financial authorities are getting desperate, I don’t know what will.  The ironic thing is that most people still believe that the fractional-reserve system is based on a 10% minimum reserve requirement.</p></div>",
  "content_text": "Unbelievable.  They certainly didn’t teach this in our economics textbooks.  From\nBen Bernanke’s testimony\nto the House Committee on Financial Services:\nGiven the very high level of reserve balances currently in the banking system, the Federal Reserve has ample time to consider the best long-run framework for policy implementation. The Federal Reserve believes it is possible that, ultimately,\nits operating framework will allow the elimination of minimum reserve requirements\n, which impose costs and distortions on the banking system.\nThose who have RGD will note that this elimination of reserve requirements would theoretically permit the former fractional-reserve banks to make an infinite amount of loans regardless of what deposits they hold.  This would also theoretically provide a rational basis for the hyperinflation scenario, but as I have pointed out many times before, even an infinite money multiple will require an infinity of borrowers.\nIf this does not make it clear to you that the financial authorities are getting desperate, I don’t know what will.  The ironic thing is that most people still believe that the fractional-reserve system is based on a 10% minimum reserve requirement.",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-03-18T16:47:00+00:00"
}