{
  "url": "https://voxday.net/2012/11/06/2012-presidential-endorsemen/",
  "scraped_at": "2025-12-14T05:07:16.623609",
  "title": "2012 Presidential Endorsement",
  "date_display": "November 6, 2012",
  "date_iso": "2012-11-06T14:30:00+00:00",
  "date_from_url": "2012-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, here are a small selection of my favorite endorsements from the more than 200 that were presented by the Dread Ilk.  I was surprised to see that there were more of them than were presented at Whatever, but I was not surprised to see that they were considerably more diverse and much more indicative of being the result of actual and original cognitive activity.</p><blockquote class=\"tr_bq\"><p> Romney…b/c he has executive style hair this country desperately needs<br> – TRK</br></p><p>I am endorsing Romney because he is the only chance to save the republic from the impending maelstrom of….  Just kidding. I am voting for Romney because it will be fun to revel in the misery of the sanctimonious messiah worshippers and see the MSNBC crew put on suicide watch.<br> – Judge</br></p><p>Not voting so that one day I can look my children in the eyes and tell them that I never supported any of it!<br> – Cinco</br></p><p>I don’t vote. Here is why: It’s Hobson’s Choice, disguised. No matter who you vote for, you get the exact same game plan. Since I am going to receive the same outcome no matter my vote, I prefer not to contribute to the appearance of legitimacy of the voting process.<br> – P-Dawg</br></p><p>I cannot support Obama or Romney. Neither candidate supports the constitution of the US, nor the freedoms, rights and responsibilities it guarantees. If liberty and freedom of conscience means nothing to them, then the candidates mean nothing to me.<br> – wordwarrior</br></p><p>Voting is an absolute waste of time. When you read and listen to what Americans think on almost any subject, social or political, you must conclude that prosperity has indeed bred contempt. Contempt for reality.<br> – Altered Fate</br></p><p>Mitt, for two reasons  1. I wanted to vote on the down ticket items, and leaving the presidental circles empty can get you ballot tossed.  2. It makes my inlaws nuts.<br> – RedJack</br></p><p>In the time since I’ve been legally able to vote I have only seen ambitious politicians who have managed to do nothing but screw things up despite their best intentions of making a positive change. This has led me to the following conclusion: Change is not feasible…. So I intend to vote for the the candidate with no ambition to do much more than collect a paycheck and enjoy the title, rather than vainly hope they might do something worthwhile and being perennially let down. Even in the office of president I would rather have a vain pompous ass who had no sites beyond making himself look good and protecting his legacy for the next 4 years so he can safely pass the buck when he’s gone. That is why I will be voting for Obama.<br> – NateM</br></p><p>I am abstaining this year. Gary Johnson is a pathetic excuse for a Libertarian who thinks his name recognition will help him get votes as a Libertarian candidate. If the Lib. Party had actually nominated someone that understood first principles, I would again go to vote for the Lib. Party in my district. However, unless or until I see that the LP actually stands for what it says it is about I will continue to abstain.<br>– CunningDove</br></p><p>Romney. First of all, I am just tired of Obama and Biden. They bore me. They are pathetic and I am tired of hearing the idiotic drivel that oozes from them.  Second, Romney will do better with appointing Supreme Court justices, and other judges for that matter. I know Vox scoffs at this reason. But let’s do the math on the Obamacare decision, for example. 80% of the Republican appointed judges voted the right way. 0% of the Democrat appointed judges voted the right way.<br> – Boetain</br></p><p>This is my reason for not voting.  In John Locke’s Second Treatise of Government any legitimate government must first obtain direct consent of the governed. This is later reaffirmed by the unanimous Declaration of the thirteen united States of America.<br> – difranco</br></p><p>I’m voting Romney because I think the implosion of Western civilization in America will proceed at a slower pace under him. We should prop up the vestiges of better times that remain in our laws for as long as we can. Maybe in the meantime some saint will rise up with a way to turn the tide.<br> – DanDan</br></p><p>Writing in Ron Paul as a protest vote.<br> – Grendelizer</br></p></blockquote><p>One can make a good Leninesque case for voting for Obama: the faster the disaster, the sooner the solution.  One can make a solid prevent defense case for voting for Romney: the longer collapse is delayed, the more time we have to eat, drink, make merry, and reach the sweet release of death before it all comes tumbling down.  Sadly, CunningDove is correct and one cannot make a good case for voting for Gary Johnson; the Libertarian candidate is not a libertarian.  But one can also make a good case for writing in Ron Paul as a protest vote.</p><p>However, all of these reasonable arguments are trumped by one overarching principle: maintaining the illusion of legitimate democratic rule through representation requires the participation of the voter.  By voting, you are participating in the illusion.  You are sustaining it, even if you are refusing to engage in the immoral choice of the lesser of two evils by voting third party or writing in a protest candidate.  This is why avowedly anti-democratic nations pass laws that mandate voting.  They are not interested in knowing the will of the people, they merely wish to use it as a veil, as is the case here in the United States today.</p><p>I can, of course, cite history to show that genuine change of the sort that is desperately needed seldom comes from the ballot box.  I can demonstrate that your one vote for president will not, under any circumstances, be permitted to determine the outcome of the election.  I can explain how supporting the lesser of two evils is not a morally permissible choice. But those things are irrelevant in comparison with the fundamental choice between participating in the illusion or refusing to participate in it.</p><p>Therefore, I endorse not voting for anyone for U.S. president.</p><p>I am not saying that one should never vote under any circumstances, or even that you should not vote today.  There are many important state and local measures concerning which your vote does actually matter and you should not hesitate to make your opinion formally known.  But I do recommend refusing your consent to the electoral sham of the U.S. presidential process.</p></div>",
  "content_text": "First, here are a small selection of my favorite endorsements from the more than 200 that were presented by the Dread Ilk.  I was surprised to see that there were more of them than were presented at Whatever, but I was not surprised to see that they were considerably more diverse and much more indicative of being the result of actual and original cognitive activity.\nRomney…b/c he has executive style hair this country desperately needs\n– TRK\nI am endorsing Romney because he is the only chance to save the republic from the impending maelstrom of….  Just kidding. I am voting for Romney because it will be fun to revel in the misery of the sanctimonious messiah worshippers and see the MSNBC crew put on suicide watch.\n– Judge\nNot voting so that one day I can look my children in the eyes and tell them that I never supported any of it!\n– Cinco\nI don’t vote. Here is why: It’s Hobson’s Choice, disguised. No matter who you vote for, you get the exact same game plan. Since I am going to receive the same outcome no matter my vote, I prefer not to contribute to the appearance of legitimacy of the voting process.\n– P-Dawg\nI cannot support Obama or Romney. Neither candidate supports the constitution of the US, nor the freedoms, rights and responsibilities it guarantees. If liberty and freedom of conscience means nothing to them, then the candidates mean nothing to me.\n– wordwarrior\nVoting is an absolute waste of time. When you read and listen to what Americans think on almost any subject, social or political, you must conclude that prosperity has indeed bred contempt. Contempt for reality.\n– Altered Fate\nMitt, for two reasons  1. I wanted to vote on the down ticket items, and leaving the presidental circles empty can get you ballot tossed.  2. It makes my inlaws nuts.\n– RedJack\nIn the time since I’ve been legally able to vote I have only seen ambitious politicians who have managed to do nothing but screw things up despite their best intentions of making a positive change. This has led me to the following conclusion: Change is not feasible…. So I intend to vote for the the candidate with no ambition to do much more than collect a paycheck and enjoy the title, rather than vainly hope they might do something worthwhile and being perennially let down. Even in the office of president I would rather have a vain pompous ass who had no sites beyond making himself look good and protecting his legacy for the next 4 years so he can safely pass the buck when he’s gone. That is why I will be voting for Obama.\n– NateM\nI am abstaining this year. Gary Johnson is a pathetic excuse for a Libertarian who thinks his name recognition will help him get votes as a Libertarian candidate. If the Lib. Party had actually nominated someone that understood first principles, I would again go to vote for the Lib. Party in my district. However, unless or until I see that the LP actually stands for what it says it is about I will continue to abstain.\n– CunningDove\nRomney. First of all, I am just tired of Obama and Biden. They bore me. They are pathetic and I am tired of hearing the idiotic drivel that oozes from them.  Second, Romney will do better with appointing Supreme Court justices, and other judges for that matter. I know Vox scoffs at this reason. But let’s do the math on the Obamacare decision, for example. 80% of the Republican appointed judges voted the right way. 0% of the Democrat appointed judges voted the right way.\n– Boetain\nThis is my reason for not voting.  In John Locke’s Second Treatise of Government any legitimate government must first obtain direct consent of the governed. This is later reaffirmed by the unanimous Declaration of the thirteen united States of America.\n– difranco\nI’m voting Romney because I think the implosion of Western civilization in America will proceed at a slower pace under him. We should prop up the vestiges of better times that remain in our laws for as long as we can. Maybe in the meantime some saint will rise up with a way to turn the tide.\n– DanDan\nWriting in Ron Paul as a protest vote.\n– Grendelizer\nOne can make a good Leninesque case for voting for Obama: the faster the disaster, the sooner the solution.  One can make a solid prevent defense case for voting for Romney: the longer collapse is delayed, the more time we have to eat, drink, make merry, and reach the sweet release of death before it all comes tumbling down.  Sadly, CunningDove is correct and one cannot make a good case for voting for Gary Johnson; the Libertarian candidate is not a libertarian.  But one can also make a good case for writing in Ron Paul as a protest vote.\nHowever, all of these reasonable arguments are trumped by one overarching principle: maintaining the illusion of legitimate democratic rule through representation requires the participation of the voter.  By voting, you are participating in the illusion.  You are sustaining it, even if you are refusing to engage in the immoral choice of the lesser of two evils by voting third party or writing in a protest candidate.  This is why avowedly anti-democratic nations pass laws that mandate voting.  They are not interested in knowing the will of the people, they merely wish to use it as a veil, as is the case here in the United States today.\nI can, of course, cite history to show that genuine change of the sort that is desperately needed seldom comes from the ballot box.  I can demonstrate that your one vote for president will not, under any circumstances, be permitted to determine the outcome of the election.  I can explain how supporting the lesser of two evils is not a morally permissible choice. But those things are irrelevant in comparison with the fundamental choice between participating in the illusion or refusing to participate in it.\nTherefore, I endorse not voting for anyone for U.S. president.\nI am not saying that one should never vote under any circumstances, or even that you should not vote today.  There are many important state and local measures concerning which your vote does actually matter and you should not hesitate to make your opinion formally known.  But I do recommend refusing your consent to the electoral sham of the U.S. presidential process.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-06T14:30:00+00:00"
}