{
  "url": "https://voxday.net/2012/11/01/american-red-cross-goes-awo/",
  "scraped_at": "2025-12-14T05:06:59.909693",
  "title": "American Red Cross goes AWOL",
  "date_display": "November 1, 2012",
  "date_iso": "2012-11-01T21:47:00+00:00",
  "date_from_url": "2012-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Only now are SWPLs beginning to discover that charities that pay their executives compensation comparable with the private sector not all that concerned about actually <a href=\"http://politicker.com/2012/11/staten-island-borough-president-dont-give-money-to-the-red-cross/\">helping people in need</a>:</p><blockquote class=\"tr_bq\"><p> At a press conference this morning on Staten Island, a host of local<br> officials, including Senators Chuck Schumer and Kirsten Gillibrand,<br> gathered to highlight the needs of the hard-hit borough in the aftermath<br> of Hurricane Sandy. And, although many pols spoke, no one was more<br> impassioned than Borough President James Molinaro, who called the Red<br> Cross an “absolute disgrace” and even urged the public to cease giving<br> them contributions.</br></br></br></br></br></br></p><p>“Because the devastation in Staten Island, the lack of a response,”<br> Mr. Molinaro said to explain his comment to NBC after the press<br> conference. “You know, I went to a shelter Monday night after the storm.<br> People were coming in with no socks, with no shoes. They were in<br> desperate need. Their housing was destroyed. They were crying. Where was<br> the Red Cross? Isn’t that their function? They collect millions of<br> dollars. Whenever there’s a drive in Staten Island, we give openly and<br> honestly. Where are they? Where are they? I was at the South Shore<br> yesterday, people were buried in their homes. There the dogs are trying<br> to find bodies. The people there, the neighbors who had no electricity,<br> were making soup. Making soup. It’s very emotional because the lack of a<br> response. The lack of a response. They’re supposed to be here….They<br> should be on the front lines fighting, and helping the people.”</br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Clearly Mr. Molinaro doesn’t understand how this works.  Private sector executives don’t feel the need to be there helping anyone, so why should their American Red Cross counterparts be out there either?  The function of the American Red Cross is to collect millions of dollars and then distribute that money throughout its bureaucracy.  It has nothing to do with helping anyone except themselves.  Doesn’t everyone know that?</p><p>For the record, this is NOT true of other national Red Cross organizations.  But the big name American charities make even Wall Street executives raise their eyebrows and marvel at their rapaciousness.  At least Goldman Sachs has the decency to honestly swindle its clients out of their money rather than lying about how they’re going to help disaster victims with it.</p></div>",
  "content_text": "Only now are SWPLs beginning to discover that charities that pay their executives compensation comparable with the private sector not all that concerned about actually\nhelping people in need\n:\nAt a press conference this morning on Staten Island, a host of local\nofficials, including Senators Chuck Schumer and Kirsten Gillibrand,\ngathered to highlight the needs of the hard-hit borough in the aftermath\nof Hurricane Sandy. And, although many pols spoke, no one was more\nimpassioned than Borough President James Molinaro, who called the Red\nCross an “absolute disgrace” and even urged the public to cease giving\nthem contributions.\n“Because the devastation in Staten Island, the lack of a response,”\nMr. Molinaro said to explain his comment to NBC after the press\nconference. “You know, I went to a shelter Monday night after the storm.\nPeople were coming in with no socks, with no shoes. They were in\ndesperate need. Their housing was destroyed. They were crying. Where was\nthe Red Cross? Isn’t that their function? They collect millions of\ndollars. Whenever there’s a drive in Staten Island, we give openly and\nhonestly. Where are they? Where are they? I was at the South Shore\nyesterday, people were buried in their homes. There the dogs are trying\nto find bodies. The people there, the neighbors who had no electricity,\nwere making soup. Making soup. It’s very emotional because the lack of a\nresponse. The lack of a response. They’re supposed to be here….They\nshould be on the front lines fighting, and helping the people.”\nClearly Mr. Molinaro doesn’t understand how this works.  Private sector executives don’t feel the need to be there helping anyone, so why should their American Red Cross counterparts be out there either?  The function of the American Red Cross is to collect millions of dollars and then distribute that money throughout its bureaucracy.  It has nothing to do with helping anyone except themselves.  Doesn’t everyone know that?\nFor the record, this is NOT true of other national Red Cross organizations.  But the big name American charities make even Wall Street executives raise their eyebrows and marvel at their rapaciousness.  At least Goldman Sachs has the decency to honestly swindle its clients out of their money rather than lying about how they’re going to help disaster victims with it.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-01T21:47:00+00:00"
}