{
  "url": "https://voxday.net/2012/11/09/an-unexpected-argument-against-suffrage/",
  "scraped_at": "2025-12-14T05:07:31.209786",
  "title": "An unexpected argument against suffrage",
  "date_display": "November 9, 2012",
  "date_iso": "2012-11-09T12:31:00+00:00",
  "date_from_url": "2012-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One doesn’t usually expect to see the New York Times present <a href=\"http://campaignstops.blogs.nytimes.com/2012/11/08/more-women-but-not-nearly-enough/?hp\">arguments against women’s suffrage</a>:</p><blockquote class=\"tr_bq\"><p> On average, women make up about 20 percent of lawmakers in the United States<br> and abroad. We found that when women constituted 20 percent of a<br> decision-making body that operates by majority rule, the average woman<br> took up only about 60 percent of the floor time used by the average man.<br> Women were perceived — by themselves and their peers — as more<br> quiescent and less effective. They were more likely to be rudely<br> interrupted; they were less likely to strongly advocate their policy<br> preferences; and they seldom mentioned the vulnerable. These gender<br> dynamics held even when adjusting for political ideology (beliefs about<br> liberalism and egalitarianism) and income.</br></br></br></br></br></br></br></br></br></p><p>In contrast, the men in our experiment did not speak up less or appear to lose influence when they were in the minority.</p><p>In<br> our experiment, groups with few women set a minimum income of about<br> $21,600 per year for a family of four — which is close to the federal<br> poverty level for a family of four. But once women made up 60 to 80<br> percent or more of a group, they spoke as much as men, raised the needs<br> of the vulnerable and argued for redistribution (and influenced the<br> rhetoric of their male counterparts). They also encountered fewer<br> hostile interruptions.</br></br></br></br></br></br></br></p><p>Significantly, they elevated the safety net<br> to as much as $31,000. The most talkative participants in these<br> majority-female groups advocated for even more government generosity:<br> $36,000, enough to catapult many poor families into the ranks of the<br> lower middle class.</br></br></br></br></p></blockquote><p>Translation: if you think the nation is in economic difficulty now, just wait until more women are elected to office!</p><p>Right<br> now, spending on social services was $2.10 trillion, if we limit that<br> definition to Social Security, Unemployment/Welfare, Medicare, Medicaid,<br> the Department of Health and Human Services, and the Social Security<br> Administration.  If we apply the researcher’s numbers, a female-majority<br> government would increase that by 43.5 percent, to $3.01 trillion.  And<br> if the most activist, “most talkative” women were in charge, the bill<br> would come to $3.5 trillion.</br></br></br></br></br></br></br></p><p>Total revenue: $2.165 trillion.  Deficit in the max-women scenario: $2.67 trillion, more than double the current $1.27 trillion.</p><p>Ironically,<br> to the numerate individual, this is not a logical argument for more<br> women in elected office.  This is an argument against female suffrage.</br></br></p></div>",
  "content_text": "One doesn’t usually expect to see the New York Times present\narguments against women’s suffrage\n:\nOn average, women make up about 20 percent of lawmakers in the United States\nand abroad. We found that when women constituted 20 percent of a\ndecision-making body that operates by majority rule, the average woman\ntook up only about 60 percent of the floor time used by the average man.\nWomen were perceived — by themselves and their peers — as more\nquiescent and less effective. They were more likely to be rudely\ninterrupted; they were less likely to strongly advocate their policy\npreferences; and they seldom mentioned the vulnerable. These gender\ndynamics held even when adjusting for political ideology (beliefs about\nliberalism and egalitarianism) and income.\nIn contrast, the men in our experiment did not speak up less or appear to lose influence when they were in the minority.\nIn\nour experiment, groups with few women set a minimum income of about\n$21,600 per year for a family of four — which is close to the federal\npoverty level for a family of four. But once women made up 60 to 80\npercent or more of a group, they spoke as much as men, raised the needs\nof the vulnerable and argued for redistribution (and influenced the\nrhetoric of their male counterparts). They also encountered fewer\nhostile interruptions.\nSignificantly, they elevated the safety net\nto as much as $31,000. The most talkative participants in these\nmajority-female groups advocated for even more government generosity:\n$36,000, enough to catapult many poor families into the ranks of the\nlower middle class.\nTranslation: if you think the nation is in economic difficulty now, just wait until more women are elected to office!\nRight\nnow, spending on social services was $2.10 trillion, if we limit that\ndefinition to Social Security, Unemployment/Welfare, Medicare, Medicaid,\nthe Department of Health and Human Services, and the Social Security\nAdministration.  If we apply the researcher’s numbers, a female-majority\ngovernment would increase that by 43.5 percent, to $3.01 trillion.  And\nif the most activist, “most talkative” women were in charge, the bill\nwould come to $3.5 trillion.\nTotal revenue: $2.165 trillion.  Deficit in the max-women scenario: $2.67 trillion, more than double the current $1.27 trillion.\nIronically,\nto the numerate individual, this is not a logical argument for more\nwomen in elected office.  This is an argument against female suffrage.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2012-11-09T12:31:00+00:00"
}