{
  "url": "https://voxday.net/2012/11/14/bitchslapping-anklebiter/",
  "scraped_at": "2025-12-14T05:07:56.675845",
  "title": "Bitchslapping the anklebiter",
  "date_display": "November 14, 2012",
  "date_iso": "2012-11-14T00:17:00+00:00",
  "date_from_url": "2012-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tad tees himself up:</p><blockquote class=\"tr_bq\"><p> @Vox Day “They can’t assert that debt doesn’t matter at all anymore…”</p><p>No, they can’t assert this. But, then they never did.  Burn that straw man down!!! </p></blockquote><p>It’s hard for me to clearly communicate how much I despise anklebiting little bitches like Tad.  They’re as stupid as they are ignorant, and yet they somehow manage to act smug whenever they are “correcting” their intellectual superiors.  The fact that such a cretin is willing to publicly assert I am attacking a straw man when I am doing nothing more than citing literally TEXTBOOK mainstream economics would alone be enough to make me reject democracy.  Three points:</p><p>1)  Debt isn’t even listed in the extensive 13-page index of the most important textbook in economic history, Paul Samuelson’s <i>Economics</i>.  622 pages and Samuelson devotes all of a paragraph to it, mostly to explain why it’s irrelevant.</p><p>2)  In his latest book, Paul Krugman openly argues that debt is irrelevant for any nation with a central bank that borrows in its own currency because it cannot default, and since the nation cannot default, it can eventually grow its way out of debt through a combination of time, GDP expansion, and inflation.  He writes: <i>“Governments depend on being able to roll over most of this debt, in effect selling new bonds to pay off old ones. If for some reason investors should refuse to buy new bonds, even a basically solvent government could be forced into default.  Could this happen to the United States? Actually, no—because the Federal Reserve could and would step in and buy federal debt, in effect printing money to pay the government’s bills. Nor could it happen to Britain, or Japan, or any country that borrows in its own currency and has its own central bank.”</i></p><p>3)  In his landmark Neo-Keynesian textbook, Paul Samuelson expressly pointed out that domestic debt did not matter in the aggregate.  He wrote: <i>“The interest on an internal debt is paid by Americans to Americans; there is no direct loss of goods and services. When interest on the debt is paid out of taxation, there is no direct loss of disposable income; Paul receives what Peter loses, and sometimes – but only sometimes – Paul and Peter are one and the same person…. In the future, some of our grandchildren will be giving up goods and services to other grandchildren. That is the nub of the matter. The only way we can impose a direct burden on the future nation as a whole is by incurring an external debt or by passing along less capital equipment to posterity.”</i></p><p>So, the Neo-Keynesians have ALWAYS argued that debt doesn’t matter in the aggregate so long as it is internal.  This is a fundamental aspect of their core view of economics, and this is why they don’t understand bubbles as well as why their solution to economic depression always involves more debt and more spending.</p><p>I’ve noticed that as a general rule, if someone uses the phrase “straw man”, they are almost invariably the same sort of mindless yapping idiot that used to make a habit of pointing out “correlation is not causation” and claiming “extraordinary claims require extraordinary evidence”.  It’s almost as if there is someone programming these morons to say demonstrably ludicrous things and inflicting them upon the public en masse.</p><p>UPDATE: Since Tad has somehow managed to conclude that economists explicitly arguing that debt doesn’t matter is evidence that they believe it does, in fact, matter, let’s add a few more Krugman quotes from “the document where this assertion was made by, say, Krugman”, namely, his latest book,  <i>End This Depression Now!</i>  Tad clearly doesn’t understand that the entire point of Krugman’s book is not only to convince readers that debt doesn’t matter, but to convince them that adding massive quantities of government debt to the existing debt is the actual and only solution to the speedy end of the current depression.  Here is Krugman writing in the chapter entitled “But What About the Deficit?”</p><p><i>“Where the harm done by lack of jobs is real and terrible, the harm done by deficits to a nation like America in its current situation is, for the most part, hypothetical….</i></p><p><i>The key thing to bear in mind is that the $5 trillion or so in debt America has run up since the crisis began, and the trillions more we’ll surely run up before this economic siege is over, won’t have to be paid off quickly, or indeed at all. In fact, it won’t be a tragedy if the debt actually continues to grow, as long as it grows more slowly than the sum of inflation and economic growth….  </i></p><p><i>Now let’s consider what all this implies for the future burden of the debt we’re building up now. We won’t ever have to pay off the debt; all we’ll have to do is pay enough of the interest on the debt so that the debt grows significantly more slowly than the economy.”</i></p></div>",
  "content_text": "Tad tees himself up:\n@Vox Day “They can’t assert that debt doesn’t matter at all anymore…”\nNo, they can’t assert this. But, then they never did.  Burn that straw man down!!!\nIt’s hard for me to clearly communicate how much I despise anklebiting little bitches like Tad.  They’re as stupid as they are ignorant, and yet they somehow manage to act smug whenever they are “correcting” their intellectual superiors.  The fact that such a cretin is willing to publicly assert I am attacking a straw man when I am doing nothing more than citing literally TEXTBOOK mainstream economics would alone be enough to make me reject democracy.  Three points:\n1)  Debt isn’t even listed in the extensive 13-page index of the most important textbook in economic history, Paul Samuelson’s\nEconomics\n.  622 pages and Samuelson devotes all of a paragraph to it, mostly to explain why it’s irrelevant.\n2)  In his latest book, Paul Krugman openly argues that debt is irrelevant for any nation with a central bank that borrows in its own currency because it cannot default, and since the nation cannot default, it can eventually grow its way out of debt through a combination of time, GDP expansion, and inflation.  He writes:\n“Governments depend on being able to roll over most of this debt, in effect selling new bonds to pay off old ones. If for some reason investors should refuse to buy new bonds, even a basically solvent government could be forced into default.  Could this happen to the United States? Actually, no—because the Federal Reserve could and would step in and buy federal debt, in effect printing money to pay the government’s bills. Nor could it happen to Britain, or Japan, or any country that borrows in its own currency and has its own central bank.”\n3)  In his landmark Neo-Keynesian textbook, Paul Samuelson expressly pointed out that domestic debt did not matter in the aggregate.  He wrote:\n“The interest on an internal debt is paid by Americans to Americans; there is no direct loss of goods and services. When interest on the debt is paid out of taxation, there is no direct loss of disposable income; Paul receives what Peter loses, and sometimes – but only sometimes – Paul and Peter are one and the same person…. In the future, some of our grandchildren will be giving up goods and services to other grandchildren. That is the nub of the matter. The only way we can impose a direct burden on the future nation as a whole is by incurring an external debt or by passing along less capital equipment to posterity.”\nSo, the Neo-Keynesians have ALWAYS argued that debt doesn’t matter in the aggregate so long as it is internal.  This is a fundamental aspect of their core view of economics, and this is why they don’t understand bubbles as well as why their solution to economic depression always involves more debt and more spending.\nI’ve noticed that as a general rule, if someone uses the phrase “straw man”, they are almost invariably the same sort of mindless yapping idiot that used to make a habit of pointing out “correlation is not causation” and claiming “extraordinary claims require extraordinary evidence”.  It’s almost as if there is someone programming these morons to say demonstrably ludicrous things and inflicting them upon the public en masse.\nUPDATE: Since Tad has somehow managed to conclude that economists explicitly arguing that debt doesn’t matter is evidence that they believe it does, in fact, matter, let’s add a few more Krugman quotes from “the document where this assertion was made by, say, Krugman”, namely, his latest book,\nEnd This Depression Now!\nTad clearly doesn’t understand that the entire point of Krugman’s book is not only to convince readers that debt doesn’t matter, but to convince them that adding massive quantities of government debt to the existing debt is the actual and only solution to the speedy end of the current depression.  Here is Krugman writing in the chapter entitled “But What About the Deficit?”\n“Where the harm done by lack of jobs is real and terrible, the harm done by deficits to a nation like America in its current situation is, for the most part, hypothetical….\nThe key thing to bear in mind is that the $5 trillion or so in debt America has run up since the crisis began, and the trillions more we’ll surely run up before this economic siege is over, won’t have to be paid off quickly, or indeed at all. In fact, it won’t be a tragedy if the debt actually continues to grow, as long as it grows more slowly than the sum of inflation and economic growth….\nNow let’s consider what all this implies for the future burden of the debt we’re building up now. We won’t ever have to pay off the debt; all we’ll have to do is pay enough of the interest on the debt so that the debt grows significantly more slowly than the economy.”",
  "tags": [
    "anklebiters",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-14T00:17:00+00:00"
}