{
  "url": "https://voxday.net/2012/11/20/church-of-england-delays-suicide/",
  "scraped_at": "2025-12-14T05:08:29.565632",
  "title": "Church of England delays suicide",
  "date_display": "November 20, 2012",
  "date_iso": "2012-11-20T19:27:00+00:00",
  "date_from_url": "2012-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m a little surprised at <a href=\"http://www.telegraph.co.uk/news/religion/9689903/Crisis-as-Church-of-England-votes-against-women-bishops.html\">the result of the Synod vote</a> as I was confident that the Anglicans were literally Hell-bent on following the Episcopalians in their death spiral into the historical dustbin of post-Christianity:</p><blockquote class=\"tr_bq\"><div class=\"firstPar\"> In a knife-edge decision at a special sitting of the Synod in London, bishops<br> and clergy voted through the change by large majorities.  But the measure failed to secure the required two thirds support among<br> representatives of the laity by just 6 votes.  Although 324 members of the Synod voted in favour of the change, 124 voted<br> against and 11 abstained.</br></br></br></div></blockquote><p>It’s amazing that so many churches are determined to follow the world rather than the Word.  But then, it was written that they would do precisely that.  I wouldn’t go so far as to say that a nominally Christian denomination that ordains women isn’t Christian, merely that it won’t be Christian for long.</p></div>",
  "content_text": "I’m a little surprised at\nthe result of the Synod vote\nas I was confident that the Anglicans were literally Hell-bent on following the Episcopalians in their death spiral into the historical dustbin of post-Christianity:\nIn a knife-edge decision at a special sitting of the Synod in London, bishops\nand clergy voted through the change by large majorities.  But the measure failed to secure the required two thirds support among\nrepresentatives of the laity by just 6 votes.  Although 324 members of the Synod voted in favour of the change, 124 voted\nagainst and 11 abstained.\nIt’s amazing that so many churches are determined to follow the world rather than the Word.  But then, it was written that they would do precisely that.  I wouldn’t go so far as to say that a nominally Christian denomination that ordains women isn’t Christian, merely that it won’t be Christian for long.",
  "tags": [
    "Christianity",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-20T19:27:00+00:00"
}