{
  "url": "https://voxday.net/2012/11/06/election-day-and-fourth-turning/",
  "scraped_at": "2025-12-14T05:07:14.700790",
  "title": "Election Day and the Fourth Turning",
  "date_display": "November 6, 2012",
  "date_iso": "2012-11-06T09:29:00+00:00",
  "date_from_url": "2012-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t necessarily subscribe to the concept of generational dynamics, but I do find it to be an interesting perspective.  Regardless, it certainly provides <a href=\"http://www.zerohedge.com/news/2012-11-05/guest-post-will-prophet-assume-command\">a unique take on the presidential election</a> today and inspires some reflection on my part.  I don’t often make public my meanderings, by which I mean ideas I cannot articulate in what I consider to be an adequately defensible manner, but since we’re basically engaging in multiple levels of societal haruspicy here, I suppose it can’t hurt so long as everyone realizes this is little more than following the idea flow wherever it happens to go:</p><blockquote class=\"tr_bq\"><p> Can generational theory predict who will win the presidential election? Probably not, but based upon historical precedent, during times of Crisis the country usually turns to a Prophet generation leader who provides a new vision and summons the moral authority to lead. This leader may not have the right vision or have the backing of the entire population, but he is not afraid to take bold action. Franklin Delano Roosevelt was despised by many, but he boldly led the country during the last Crisis. Abraham Lincoln won the 1860 election with only 39.8% of the popular vote, but he unflinchingly did whatever he thought was necessary to achieve victory and preserve the union. Prophet leaders like Samuel Adams and Benjamin Franklin offered the sense of moral urgency required to sustain the American Revolution. Strauss &amp; Howe give a historical perspective on Prophet generations.</p><p><i>“Prophet generations are born after a great war or other crisis, during a time of rejuvenated community life and consensus around a new societal order. Prophets grow up as the increasingly indulged children of this post-crisis era, come of age as narcissistic young crusaders of a spiritual awakening, cultivate principle as moralistic mid-lifers, and emerge as wise elders guiding another historical crisis. By virtue of this location in history, such generations tend to be remembered for their coming-of-age passion and their principled elder stewardship. Their principle endowments are often in the domain of vision, values, and religion. Their best-known historical leaders include John Winthrop, William Berkeley, Samuel Adams, Benjamin Franklin, James Polk, Abraham Lincoln, Herbert Hoover, and Franklin Roosevelt. These were principled moralists, summoners of human sacrifice, and wagers of righteous wars. Early in life, few saw combat in uniform; later in life, most came to be revered more for their inspiring words than for their grand deeds.” </i>– The Fourth Turning – Strauss &amp; Howe</p><p>Barack Obama was born in 1961. According to the Strauss &amp; Howe generational distinctions, this makes him an early Gen-Xer. His life story matches that of the Nomad archetype. His chaotic early life, confused upbringing by an array of elders, frenetic alienated early adulthood as a community organizer, and his rise to power through his public speaking talent and pragmatic ability to achieve his agenda is a blueprint for a Nomad. Mitt Romney was born in 1947 [Prophet – VD] and grew up during the American High. His childhood was idyllic and privileged. His moral Mormon youth as a missionary eventually devolved into his yuppie “greed is good” career at Bain Capital acquiring companies, making them more efficient (firing Americans &amp; hiring Asians), and spinning them off, while siphoning millions in fees. He has tried to convince Americans to vote for him, based upon his business acumen and moral lifestyle, as the cure for what ails America. With the continued downward spiral of societal mood, record low trust in Congress and 60% of Americans thinking the country is on the wrong track, the odds should favor the Prophet candidate. The 40% of Americans who think the country is on the right track are a tribute to our awful government run public education system or are smoking crack.</p><p>The Barack Obama presidency has many similarities to the one-term presidencies of Herbert Hoover and James Buchanan. Both men were overwhelmed by rapidly deteriorating events, an inability to understand the true nature of the Crisis, and failure to inspire the American people to rally behind a common cause. Both men drifted off into obscurity and are overwhelmingly acknowledged as two of the least successful presidents. The men who succeeded them are ranked by historians at the top of the list, even though they are both despised by more libertarian minded citizens as proponents of big government solutions and control. Libertarians will not be happy with developments over the next fifteen years. This Crisis is an era in which America’s corrupt social order will be torn down and reconstructed from the ground as a reaction to the unsustainable financial pyramid scheme which is an existential threat to the nation’s very survival. Civic authority will revive, cultural manifestation will find a community resolution, and citizens will begin to associate themselves as adherents of a larger cluster.  </p><p>Barack Obama has fallen short as a Crisis leader, just as Buchanan and Hoover fell short. Buchanan also tried to maintain the status quo and not address the key issues of the day – secession and slavery. His handling of the financial Panic of 1857 led to annual deficits that exceeded 13% of GDP during his entire presidency. His legacy is one of failure and hesitation. Hoover was a technocrat with an engineering background who failed to recognize the extent of the suffering by the American people during the early stages of the Great Depression. It is a false storyline that he did not attempt to use the power of the Federal government to address the economic crisis. Federal spending increased by over 20% during his term and he was running a deficit when Roosevelt assumed power. Hoover was an activist president who began the public works programs that FDR expanded and dramatically increased taxes on the rich and corporations in 1932.</p><p>Obama inherited a plunging economic situation and proceeded to make choices that will make this Crisis far worse than it needed to be. He has failed miserably in addressing the core elements of this Crisis that were foreseen by Strauss and Howe over a decade before the initial spark in 2008. Debt, civic decay, rising wealth inequality due to the rise of our plutocracy, and global disorder are the underlying basis for this Crisis. Obama’s response was to run record deficits driving the national debt skyward, failing to address the unfunded entitlement liabilities that loom on the horizon, bowing down before the Wall Street mobsters and paying their ransom demands, layering on more complexity and unfunded healthcare liabilities to an already teetering government system, and extending our policing the world foreign policy at a cost of $1 trillion per year. A Crisis requires a bold leader who makes tough choices and leads. Obama has proven to not be that leader. Based on historical precedent and the rapidly deteriorating mood of the country, it would be logical for the country to select Romney, a Prophet generation leader.</p></blockquote><p>This analysis rather ominously parallels what I have observed about Mitt Romney’s character during the Republican primaries and at the Republican National Convention.  Because he governed as an unprincipled moderate in Massachusetts, and because he has an affable public personality, very few observers realize that the man has a strong will to power and authoritarian instincts.  Being a Mormon, he likely possesses the same sense of self-justification by historical persecution that many revolutionary Jews have had, and he will acknowledge no allegiance to the mainstream Christians and evangelicals who elected him.</p><p>We already knows he views himself as a Mr. Fix-it, and quite reasonably so.  I suspect, therefore, that he might surprise everyone and abandon all pretense of political moderation if he perceives what I and other economic observers have long perceived and concludes that the nation, as well as the global financial system, is on the verge of collapse.  What I don’t know is which way he will jump if he goes Full Fix-it; I assume he is a conventional globalist who will follow the usual path of doing the same thing, only at the next level, but then again, his Mormonism could be an indication that he will take a different and less predictable path.  After all, if there is an individual that is going to address the immigration and vibrancy problem that is fracturing the country in such a predictably conclusive manner, it is most likely one from a group has religious justification for doing so in its most sacred scripture.</p><p>Here is the vital point.  Mitt Romney appears to be a principled man with a public track record of no conventional political principles.  He has flip-flopped so many times on so many major issues that no one can possibly say with any degree of plausibility what his true political ideology is, if one can even be said to exist.  He has bound himself to nothing and no one.  So, this raises the obvious question: what are his underlying principles?  I suspect he has been practicing a Mormon form of taqiyya for a long, long time, and we will only discover what those principles are if Romney is elected and comes to believe the national situation is dire enough to justify him revealing himself and taking action in full Prophet mode.</p></div>",
  "content_text": "I don’t necessarily subscribe to the concept of generational dynamics, but I do find it to be an interesting perspective.  Regardless, it certainly provides\na unique take on the presidential election\ntoday and inspires some reflection on my part.  I don’t often make public my meanderings, by which I mean ideas I cannot articulate in what I consider to be an adequately defensible manner, but since we’re basically engaging in multiple levels of societal haruspicy here, I suppose it can’t hurt so long as everyone realizes this is little more than following the idea flow wherever it happens to go:\nCan generational theory predict who will win the presidential election? Probably not, but based upon historical precedent, during times of Crisis the country usually turns to a Prophet generation leader who provides a new vision and summons the moral authority to lead. This leader may not have the right vision or have the backing of the entire population, but he is not afraid to take bold action. Franklin Delano Roosevelt was despised by many, but he boldly led the country during the last Crisis. Abraham Lincoln won the 1860 election with only 39.8% of the popular vote, but he unflinchingly did whatever he thought was necessary to achieve victory and preserve the union. Prophet leaders like Samuel Adams and Benjamin Franklin offered the sense of moral urgency required to sustain the American Revolution. Strauss & Howe give a historical perspective on Prophet generations.\n“Prophet generations are born after a great war or other crisis, during a time of rejuvenated community life and consensus around a new societal order. Prophets grow up as the increasingly indulged children of this post-crisis era, come of age as narcissistic young crusaders of a spiritual awakening, cultivate principle as moralistic mid-lifers, and emerge as wise elders guiding another historical crisis. By virtue of this location in history, such generations tend to be remembered for their coming-of-age passion and their principled elder stewardship. Their principle endowments are often in the domain of vision, values, and religion. Their best-known historical leaders include John Winthrop, William Berkeley, Samuel Adams, Benjamin Franklin, James Polk, Abraham Lincoln, Herbert Hoover, and Franklin Roosevelt. These were principled moralists, summoners of human sacrifice, and wagers of righteous wars. Early in life, few saw combat in uniform; later in life, most came to be revered more for their inspiring words than for their grand deeds.”\n– The Fourth Turning – Strauss & Howe\nBarack Obama was born in 1961. According to the Strauss & Howe generational distinctions, this makes him an early Gen-Xer. His life story matches that of the Nomad archetype. His chaotic early life, confused upbringing by an array of elders, frenetic alienated early adulthood as a community organizer, and his rise to power through his public speaking talent and pragmatic ability to achieve his agenda is a blueprint for a Nomad. Mitt Romney was born in 1947 [Prophet – VD] and grew up during the American High. His childhood was idyllic and privileged. His moral Mormon youth as a missionary eventually devolved into his yuppie “greed is good” career at Bain Capital acquiring companies, making them more efficient (firing Americans & hiring Asians), and spinning them off, while siphoning millions in fees. He has tried to convince Americans to vote for him, based upon his business acumen and moral lifestyle, as the cure for what ails America. With the continued downward spiral of societal mood, record low trust in Congress and 60% of Americans thinking the country is on the wrong track, the odds should favor the Prophet candidate. The 40% of Americans who think the country is on the right track are a tribute to our awful government run public education system or are smoking crack.\nThe Barack Obama presidency has many similarities to the one-term presidencies of Herbert Hoover and James Buchanan. Both men were overwhelmed by rapidly deteriorating events, an inability to understand the true nature of the Crisis, and failure to inspire the American people to rally behind a common cause. Both men drifted off into obscurity and are overwhelmingly acknowledged as two of the least successful presidents. The men who succeeded them are ranked by historians at the top of the list, even though they are both despised by more libertarian minded citizens as proponents of big government solutions and control. Libertarians will not be happy with developments over the next fifteen years. This Crisis is an era in which America’s corrupt social order will be torn down and reconstructed from the ground as a reaction to the unsustainable financial pyramid scheme which is an existential threat to the nation’s very survival. Civic authority will revive, cultural manifestation will find a community resolution, and citizens will begin to associate themselves as adherents of a larger cluster.\nBarack Obama has fallen short as a Crisis leader, just as Buchanan and Hoover fell short. Buchanan also tried to maintain the status quo and not address the key issues of the day – secession and slavery. His handling of the financial Panic of 1857 led to annual deficits that exceeded 13% of GDP during his entire presidency. His legacy is one of failure and hesitation. Hoover was a technocrat with an engineering background who failed to recognize the extent of the suffering by the American people during the early stages of the Great Depression. It is a false storyline that he did not attempt to use the power of the Federal government to address the economic crisis. Federal spending increased by over 20% during his term and he was running a deficit when Roosevelt assumed power. Hoover was an activist president who began the public works programs that FDR expanded and dramatically increased taxes on the rich and corporations in 1932.\nObama inherited a plunging economic situation and proceeded to make choices that will make this Crisis far worse than it needed to be. He has failed miserably in addressing the core elements of this Crisis that were foreseen by Strauss and Howe over a decade before the initial spark in 2008. Debt, civic decay, rising wealth inequality due to the rise of our plutocracy, and global disorder are the underlying basis for this Crisis. Obama’s response was to run record deficits driving the national debt skyward, failing to address the unfunded entitlement liabilities that loom on the horizon, bowing down before the Wall Street mobsters and paying their ransom demands, layering on more complexity and unfunded healthcare liabilities to an already teetering government system, and extending our policing the world foreign policy at a cost of $1 trillion per year. A Crisis requires a bold leader who makes tough choices and leads. Obama has proven to not be that leader. Based on historical precedent and the rapidly deteriorating mood of the country, it would be logical for the country to select Romney, a Prophet generation leader.\nThis analysis rather ominously parallels what I have observed about Mitt Romney’s character during the Republican primaries and at the Republican National Convention.  Because he governed as an unprincipled moderate in Massachusetts, and because he has an affable public personality, very few observers realize that the man has a strong will to power and authoritarian instincts.  Being a Mormon, he likely possesses the same sense of self-justification by historical persecution that many revolutionary Jews have had, and he will acknowledge no allegiance to the mainstream Christians and evangelicals who elected him.\nWe already knows he views himself as a Mr. Fix-it, and quite reasonably so.  I suspect, therefore, that he might surprise everyone and abandon all pretense of political moderation if he perceives what I and other economic observers have long perceived and concludes that the nation, as well as the global financial system, is on the verge of collapse.  What I don’t know is which way he will jump if he goes Full Fix-it; I assume he is a conventional globalist who will follow the usual path of doing the same thing, only at the next level, but then again, his Mormonism could be an indication that he will take a different and less predictable path.  After all, if there is an individual that is going to address the immigration and vibrancy problem that is fracturing the country in such a predictably conclusive manner, it is most likely one from a group has religious justification for doing so in its most sacred scripture.\nHere is the vital point.  Mitt Romney appears to be a principled man with a public track record of no conventional political principles.  He has flip-flopped so many times on so many major issues that no one can possibly say with any degree of plausibility what his true political ideology is, if one can even be said to exist.  He has bound himself to nothing and no one.  So, this raises the obvious question: what are his underlying principles?  I suspect he has been practicing a Mormon form of taqiyya for a long, long time, and we will only discover what those principles are if Romney is elected and comes to believe the national situation is dire enough to justify him revealing himself and taking action in full Prophet mode.",
  "tags": [
    "history",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-06T09:29:00+00:00"
}