{
  "url": "https://voxday.net/2012/11/23/he-doesnt-care-and-here-is-why/",
  "scraped_at": "2025-12-14T05:08:42.458556",
  "title": "He doesn’t care and here is why",
  "date_display": "November 23, 2012",
  "date_iso": "2012-11-23T17:01:00+00:00",
  "date_from_url": "2012-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi proves he doesn’t care what people think about him by writing <a href=\"http://whatever.scalzi.com/2012/11/20/the-existential-horror-of-betaness-or-not/\">yet another post explaining his opinion</a><br> concerning what people think about his position on the socio-sexual<br> hierarchy and why he is not insulted by being identified as a “beta<br> male”:</br></br></br></p><blockquote class=\"tr_bq\"><p> I think they are less<br> concerned about insulting me than they are reassuring themselves that<br> there is no possible way they could ever be beta males, whatever their<br> definition of ‘beta male’ is. By all indications their definition is<br> something along the lines of “a man who sees women as something other<br> than a mute dispensary of sandwiches and boobies” and/or “a man who does<br> not live in fear of everyone else not continually affirming his<br> internal assessment of personal status,” gussied up in language that<br> allows them not to have to deal with these essential facts of their own<br> nature. But inasmuch as insulting me is part of the mechanism of<br> reassuring themselves, I am offered the insult.</br></br></br></br></br></br></br></br></br></br></p><p>I’m not insulted because, a) I consider the source, b) I don’t mind<br> being seen as someone who does not view women through a tangled bramble<br> of fear, ignorance and desire, c) when I step into a room, I don’t<br> neurotically spend my time tallying up who in the room has higher status<br> than I do, and who doesn’t. I am a grown-up, for God’s sake. Paranoid<br> status anxiety is tiring. </br></br></br></br></br></p></blockquote><p>One has to wonder how John knows that paranoid status anxiety is so exhausting considering that he cares so little about what others think of him.  In any event, I take a more in-depth look at what his response tells us about his socio-sexual status <a href=\"http://alphagameplan.blogspot.ch/2012/11/rapey-has-no-game.html\">at Alpha Game</a>.</p></div>",
  "content_text": "John Scalzi proves he doesn’t care what people think about him by writing\nyet another post explaining his opinion\nconcerning what people think about his position on the socio-sexual\nhierarchy and why he is not insulted by being identified as a “beta\nmale”:\nI think they are less\nconcerned about insulting me than they are reassuring themselves that\nthere is no possible way they could ever be beta males, whatever their\ndefinition of ‘beta male’ is. By all indications their definition is\nsomething along the lines of “a man who sees women as something other\nthan a mute dispensary of sandwiches and boobies” and/or “a man who does\nnot live in fear of everyone else not continually affirming his\ninternal assessment of personal status,” gussied up in language that\nallows them not to have to deal with these essential facts of their own\nnature. But inasmuch as insulting me is part of the mechanism of\nreassuring themselves, I am offered the insult.\nI’m not insulted because, a) I consider the source, b) I don’t mind\nbeing seen as someone who does not view women through a tangled bramble\nof fear, ignorance and desire, c) when I step into a room, I don’t\nneurotically spend my time tallying up who in the room has higher status\nthan I do, and who doesn’t. I am a grown-up, for God’s sake. Paranoid\nstatus anxiety is tiring.\nOne has to wonder how John knows that paranoid status anxiety is so exhausting considering that he cares so little about what others think of him.  In any event, I take a more in-depth look at what his response tells us about his socio-sexual status\nat Alpha Game\n.",
  "tags": [
    "Alpha Game",
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-23T17:01:00+00:00"
}