{
  "url": "https://voxday.net/2012/11/08/hope-vs-ma/",
  "scraped_at": "2025-12-14T05:07:25.694731",
  "title": "Hope vs Math",
  "date_display": "November 8, 2012",
  "date_iso": "2012-11-08T11:49:00+00:00",
  "date_from_url": "2012-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pat Buchanan appeared inclined <a href=\"http://www.wnd.com/2012/11/the-coming-age-of-austerity/\">to bet on the latter</a> in his pre-election column:</p><blockquote class=\"tr_bq\"><p> [W]hoever wins today, it is hard to be sanguine about the future.  The demographic and economic realities do not permit it.</p><p>Consider. Between 1946 and 1964, 79 million babies were born – the<br> largest, best-educated and most successful generation in our history.<br> Bill Clinton and George W. Bush, both born in 1946, were in that first<br> class of baby boomers.</br></br></br></p><p>The problem.  Assume that 75 million of these 79 million boomers survive to age 66.<br> This means that from this year through 2030, an average of nearly 4<br> million boomers will be retiring every year. This translates into some<br> 11,000 boomers becoming eligible for Medicare and Social Security every<br> single day for the next 18 years.  Add in immigrants in that same age category and the fact that baby<br> boomers live longer than the Greatest Generation or Silent Generation<br> seniors, and you have an immense and unavoidable increase coming in<br> expenditures for our largest entitlement programs….</br></br></br></br></br></br></br></p><p>With government in the U.S. at all levels consuming 40 percent of<br> gross domestic product, and taxes 30 percent, taxes will have to rise<br> and government spending be controlled or cut. The alternative is to<br> destroy the debt by depreciating the dollars in which it is denominated –<br> i.e., by Fed-induced inflation.  But you can only rob your creditors once. After that, they never trust you again.</br></br></br></br></p><p>There is another social development rarely discussed.  The workers who are replacing retiring baby boomers in the labor force are increasingly minorities.  Black folks and Hispanics alone account now for 30 percent of the population – and rising rapidly.  Yet these two minorities have high-school dropout rates of up to 50<br> percent in many cities, and many who do graduate have math, reading and<br> science scores at seventh-, eighth- and ninth-grade levels.</br></br></p><p>Can their contributions to an advanced economy be as great as were<br> those of baby boomers of the ’60s and ’70s, whose SAT scores were among<br> the highest we ever recorded? U.S. scores in global competition have<br> been plummeting toward Third World levels.</br></br></br></p></blockquote><p>Let’s just say that I expect the de facto social policy of seeking to replace white male Anglo-Saxon Protestant products of intact families with a labor force that increasingly consists of uneducated, illegitimate, irreligious female people of color to work even less effectively than the Roman attempt to replace Roman citizens with German barbarians in the legions.</p><p>The bizarre thing is that it is the numerate and historically aware portion of the population that is decried as benighted, outdated, and anti-science by the bien pensantry.  They are betting on hope and belief in the inevitability of “progress” against mere population demographics and math.  In the immortal words of Pepper Brooks: “It’s a bold strategy, Cotton. Let’s see if it pays off for ’em.”</p></div>",
  "content_text": "Pat Buchanan appeared inclined\nto bet on the latter\nin his pre-election column:\n[W]hoever wins today, it is hard to be sanguine about the future.  The demographic and economic realities do not permit it.\nConsider. Between 1946 and 1964, 79 million babies were born – the\nlargest, best-educated and most successful generation in our history.\nBill Clinton and George W. Bush, both born in 1946, were in that first\nclass of baby boomers.\nThe problem.  Assume that 75 million of these 79 million boomers survive to age 66.\nThis means that from this year through 2030, an average of nearly 4\nmillion boomers will be retiring every year. This translates into some\n11,000 boomers becoming eligible for Medicare and Social Security every\nsingle day for the next 18 years.  Add in immigrants in that same age category and the fact that baby\nboomers live longer than the Greatest Generation or Silent Generation\nseniors, and you have an immense and unavoidable increase coming in\nexpenditures for our largest entitlement programs….\nWith government in the U.S. at all levels consuming 40 percent of\ngross domestic product, and taxes 30 percent, taxes will have to rise\nand government spending be controlled or cut. The alternative is to\ndestroy the debt by depreciating the dollars in which it is denominated –\ni.e., by Fed-induced inflation.  But you can only rob your creditors once. After that, they never trust you again.\nThere is another social development rarely discussed.  The workers who are replacing retiring baby boomers in the labor force are increasingly minorities.  Black folks and Hispanics alone account now for 30 percent of the population – and rising rapidly.  Yet these two minorities have high-school dropout rates of up to 50\npercent in many cities, and many who do graduate have math, reading and\nscience scores at seventh-, eighth- and ninth-grade levels.\nCan their contributions to an advanced economy be as great as were\nthose of baby boomers of the ’60s and ’70s, whose SAT scores were among\nthe highest we ever recorded? U.S. scores in global competition have\nbeen plummeting toward Third World levels.\nLet’s just say that I expect the de facto social policy of seeking to replace white male Anglo-Saxon Protestant products of intact families with a labor force that increasingly consists of uneducated, illegitimate, irreligious female people of color to work even less effectively than the Roman attempt to replace Roman citizens with German barbarians in the legions.\nThe bizarre thing is that it is the numerate and historically aware portion of the population that is decried as benighted, outdated, and anti-science by the bien pensantry.  They are betting on hope and belief in the inevitability of “progress” against mere population demographics and math.  In the immortal words of Pepper Brooks: “It’s a bold strategy, Cotton. Let’s see if it pays off for ’em.”",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-08T11:49:00+00:00"
}