{
  "url": "https://voxday.net/2012/11/19/i-dont-call-myself-one-either/",
  "scraped_at": "2025-12-14T05:08:20.229288",
  "title": "Yeah, I don’t call myself one either",
  "date_display": "November 19, 2012",
  "date_iso": "2012-11-19T06:00:00+00:00",
  "date_from_url": "2012-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. John Scalzi explains, in considerable detail, <a href=\"http://whatever.scalzi.com/2012/11/18/quick-notes-on-my-personal-feminism/\">why he does not call himself a feminist</a>.  Even though he is.  He just doesn’t deserve to call himself one.  But don’t think he cares what anyone thinks, because he doesn’t.  And if you don’t believe him, he’ll write another 12 posts about himself just to prove you’re wrong.</p><blockquote class=\"tr_bq\"><p> I am a feminist in the most general sense of believing that women<br> are entitled to the same rights and privileges as men, with everything<br> that implies in terms of access to education, economic opportunity and<br> personal liberty. However, as far as I know most people don’t use the<br> term “feminism” in this most broad of definitions, either positively or<br> negatively. This is another reason I don’t tend to use the term to apply<br> to myself.</br></br></br></br></br></br></p><p>A third reason I don’t apply the term feminist to<br> myself is that, again to be blunt about it, I don’t think I deserve to.<br> I know myself well enough to know where I fall down on the subject. On a<br> very superficial level, I’m wary of touting myself as a feminist and<br> then doing something that shows my ass on the subject in a very public<br> way. Best not to set myself up for such a fall.</br></br></br></br></br></p><p>On a slightly deeper level, I know the personal journey I’m taking in<br> terms of my relationships with women, individually and generally. I’ve<br> always tried to be a good person to women in my life, and to women in<br> general, but there have been times I’ve fallen short of those goals,<br> through ignorance or through being (for lack of a better term) a dick. I<br> work at these things. I keep working at them.</br></br></br></br></br></p></blockquote><p>Ye cats.  This post was poorly titled.  It should have been “Quick Notes on My Personal Effeminacy” or perhaps “Delving Into the Depths of My Navel: the Self-Portrait of a Gamma Male”.  Anyhow, if John wants to call himself a feminist, he’s certainly got my permission.  I don’t happen to call myself a feminist because feminism is the only ideology that is more intellectually incoherent than communism and more societally suicidal than the Skoptsy.</p><p>This is the best part: “I am delighted to annoy this category of status-anxious, woman-fearing moron.”  The President of the SFWA calling anyone “status-anxious” and “woman-fearing” tends to strike one rather like Charles Manson saying that someone else is “a little out there”.</p></div>",
  "content_text": "Mr. John Scalzi explains, in considerable detail,\nwhy he does not call himself a feminist\n.  Even though he is.  He just doesn’t deserve to call himself one.  But don’t think he cares what anyone thinks, because he doesn’t.  And if you don’t believe him, he’ll write another 12 posts about himself just to prove you’re wrong.\nI am a feminist in the most general sense of believing that women\nare entitled to the same rights and privileges as men, with everything\nthat implies in terms of access to education, economic opportunity and\npersonal liberty. However, as far as I know most people don’t use the\nterm “feminism” in this most broad of definitions, either positively or\nnegatively. This is another reason I don’t tend to use the term to apply\nto myself.\nA third reason I don’t apply the term feminist to\nmyself is that, again to be blunt about it, I don’t think I deserve to.\nI know myself well enough to know where I fall down on the subject. On a\nvery superficial level, I’m wary of touting myself as a feminist and\nthen doing something that shows my ass on the subject in a very public\nway. Best not to set myself up for such a fall.\nOn a slightly deeper level, I know the personal journey I’m taking in\nterms of my relationships with women, individually and generally. I’ve\nalways tried to be a good person to women in my life, and to women in\ngeneral, but there have been times I’ve fallen short of those goals,\nthrough ignorance or through being (for lack of a better term) a dick. I\nwork at these things. I keep working at them.\nYe cats.  This post was poorly titled.  It should have been “Quick Notes on My Personal Effeminacy” or perhaps “Delving Into the Depths of My Navel: the Self-Portrait of a Gamma Male”.  Anyhow, if John wants to call himself a feminist, he’s certainly got my permission.  I don’t happen to call myself a feminist because feminism is the only ideology that is more intellectually incoherent than communism and more societally suicidal than the Skoptsy.\nThis is the best part: “I am delighted to annoy this category of status-anxious, woman-fearing moron.”  The President of the SFWA calling anyone “status-anxious” and “woman-fearing” tends to strike one rather like Charles Manson saying that someone else is “a little out there”.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-19T06:00:00+00:00"
}