{
  "url": "https://voxday.net/2012/11/09/its-too-late-republicans/",
  "scraped_at": "2025-12-14T05:07:29.355391",
  "title": "It’s too late, Republicans",
  "date_display": "November 9, 2012",
  "date_iso": "2012-11-09T00:09:00+00:00",
  "date_from_url": "2012-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Paul, who was rejected by Republicans in favor of the supposedly more electable Mitt Romney, <a href=\"http://www.washingtontimes.com/blog/inside-politics/2012/nov/8/ron-paul-election-shows-us-far-gone/\">concludes it is Game Over</a> for the USA as well:</p><blockquote class=\"tr_bq\"><p> Rep. Ron Paul, whose maverick presidential bids shook the GOP, said<br> in the wake of this week’s elections that the country has already veered<br> over the fiscal cliff and he sees no chance of righting ship in a<br> country where too many people are dependent on government.</br></br></br></p><p>“We’re<br> so far gone. We’re over the cliff,” the Texas Republican told Bloomberg<br> Television’s “In the Loop” program. “We cannot get enough people in<br> Congress in the next 5-10 years who will do wise things.”</br></br></br></p></blockquote><p>Since the “drive toward the cliff slower” strategy has worked so well, perhaps Republicans will now consider attempting a “fall slower” approach.</p></div>",
  "content_text": "Ron Paul, who was rejected by Republicans in favor of the supposedly more electable Mitt Romney,\nconcludes it is Game Over\nfor the USA as well:\nRep. Ron Paul, whose maverick presidential bids shook the GOP, said\nin the wake of this week’s elections that the country has already veered\nover the fiscal cliff and he sees no chance of righting ship in a\ncountry where too many people are dependent on government.\n“We’re\nso far gone. We’re over the cliff,” the Texas Republican told Bloomberg\nTelevision’s “In the Loop” program. “We cannot get enough people in\nCongress in the next 5-10 years who will do wise things.”\nSince the “drive toward the cliff slower” strategy has worked so well, perhaps Republicans will now consider attempting a “fall slower” approach.",
  "tags": [
    "politics",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-09T00:09:00+00:00"
}