{
  "url": "https://voxday.net/2012/11/02/mailvox-silence-of-keynesians/",
  "scraped_at": "2025-12-14T05:07:01.724325",
  "title": "Mailvox: The silence of the Keynesians",
  "date_display": "November 2, 2012",
  "date_iso": "2012-11-02T07:35:00+00:00",
  "date_from_url": "2012-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BK asks why Paul Krugman and the Neo-Keynesians aren’t celebrating all those windows broken by Tropical Storm Sandy:</p><blockquote class=\"tr_bq\"><p> If, as per the NeoKeynesians, the government action in economy like<br> building some bridges somewhere is good for economy, then don’t you<br> think Sandy has given the government the right opportunity to improve<br> the economy- by rebuilding things. ( I guess they don’t care about the<br> broken window, do they.)  Why is it that Krugman and Co are not declaring<br> publicly that “Sandy is good for America”, then? Are they afraid that<br> such a statement will not be good for Obama campaign? That would be<br> double standards then – keep quiet about your theory when it is<br> unpopular, speak it out and implement it other times to gain popularity.<br> In that case, why isn’t the Romney people exposing the double standards<br> of these people to gain advantage?</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Krugman and company are (mostly) keeping quiet on the tropical storm stimulation being provided to the US economy because it is a concept too manifestly absurd to be accepted by the general public when the public is actually dealing with the concrete reality of the devastation.  Keynesianism is the sort of gassy theoretical model that only holds up as long as it isn’t held accountable by events, which is why you never see Keynesians talking about economic history or even showing any sign that they are familiar with economic history.</p><p>As for the Romney supporters, they aren’t exposing the double-standards of Krugman and other Obama supporters because they, too, are Neo-Keynesians.  They are the flavor known as monetarists, heavily influenced by the Keynesian reformist Milton Friedman, but as Steve Keen and other economists of left and right have pointed out, they’re all operating within the same conceptual neoclassical framework, speaking the same Samuelsonian language.</p></div>",
  "content_text": "BK asks why Paul Krugman and the Neo-Keynesians aren’t celebrating all those windows broken by Tropical Storm Sandy:\nIf, as per the NeoKeynesians, the government action in economy like\nbuilding some bridges somewhere is good for economy, then don’t you\nthink Sandy has given the government the right opportunity to improve\nthe economy- by rebuilding things. ( I guess they don’t care about the\nbroken window, do they.)  Why is it that Krugman and Co are not declaring\npublicly that “Sandy is good for America”, then? Are they afraid that\nsuch a statement will not be good for Obama campaign? That would be\ndouble standards then – keep quiet about your theory when it is\nunpopular, speak it out and implement it other times to gain popularity.\nIn that case, why isn’t the Romney people exposing the double standards\nof these people to gain advantage?\nKrugman and company are (mostly) keeping quiet on the tropical storm stimulation being provided to the US economy because it is a concept too manifestly absurd to be accepted by the general public when the public is actually dealing with the concrete reality of the devastation.  Keynesianism is the sort of gassy theoretical model that only holds up as long as it isn’t held accountable by events, which is why you never see Keynesians talking about economic history or even showing any sign that they are familiar with economic history.\nAs for the Romney supporters, they aren’t exposing the double-standards of Krugman and other Obama supporters because they, too, are Neo-Keynesians.  They are the flavor known as monetarists, heavily influenced by the Keynesian reformist Milton Friedman, but as Steve Keen and other economists of left and right have pointed out, they’re all operating within the same conceptual neoclassical framework, speaking the same Samuelsonian language.",
  "tags": [
    "economics",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-02T07:35:00+00:00"
}