{
  "url": "https://voxday.net/2012/11/07/nate-1-vox-0/",
  "scraped_at": "2025-12-14T05:07:20.078137",
  "title": "Nate Silver 1 Vox 0",
  "date_display": "November 7, 2012",
  "date_iso": "2012-11-07T08:41:00+00:00",
  "date_from_url": "2012-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This comment from DH sums up the election nicely:</p><blockquote class=\"tr_bq\"><p> Nate Silver was very close to perfect.  VD called the swings states wrong.  National polling is not that useful, State polling is pretty useful.</p></blockquote><p>So, the good news is that we probably won’t be fighting Iran or any other wars in the Middle East now.  Another African intervention or two is more likely and less problematic.  The bad news is that Helicopter Ben just got the green light for QEn.  The dreadful news is that those seemingly ridiculous D+11 samples were actually correct, which means the 2012 election has the potential to mark a demographic turning point from which the American Right will never be able to recover.  The Republican Party is going to have to move harder to the Left if it is going to compete for the female and third world votes that are now electorally determinative.  The demographics are only going to get worse, significantly worse, from here, as millions of immigrants and the children of immigrants with no connection to, or regard for, little American traditions such as the U.S. Constitution and limited government become legal voters.</p><p>Like immigrants everywhere, they will attempt to make their new land more like their old one.  And now we know they will succeed.  That’s good news if you like Mexican food, not so good if you don’t like corporate corruption on steroids, third world crime rates, and a lower standard of living.</p><p>And yet, in the short term, as I’ve been pointing out for some time now, most Americans will be better off with the Golfer-in-Chief walking the links than an authoritarian CEO-in-Chief aggressively “fixing” everything from Syria to the money supply.  If we’re fortunate, Obama will be content to bask in his victory for the next four years and let the economy collapse without much more than the half-hearted Keynesian assistance he’s provided in the past.</p><p>But I think it is safe to conclude that I should stick to economics and societal predictions rather than political ones.  Polling clearly trumps pattern recognition with regards to the latter.  On the plus side, now that we know the polls are reliable, there isn’t really any need for short-term predictions anymore.  As Real Clear Politics has shown, anyone with Excel and a Monte Carlo plug-in can do the basic math averaging the state polls as competently as Nate Silver.</p><p>The New York Times makes it pretty clear how we can expect the left-liberals <a href=\"http://www.nytimes.com/2012/11/07/opinion/president-obamas-majority.html?hp\">to interpret Obama’s victory</a>:</p><blockquote class=\"tr_bq\"><div itemprop=\"articleBody\">  The president’s victory depended heavily on Midwestern Rust Belt states<br> like Ohio, where the bailout of the auto industry — which Mr. Obama<br> engineered and Mr. Romney opposed — proved widely popular for the simple<br> reason that it worked.  More broadly, Midwestern voters seemed to endorse the president’s<br> argument that the government has a significant role in creating<br> private-sector jobs and boosting the economy. They rejected Mr. Romney’s<br> position that Washington should simply stay out of such matters and let<br> the free market work its will.</br></br></br></br></br></br></br></div></blockquote><div itemprop=\"articleBody\"> It’s hard to argue with that, except for the idea that Mr. Romney was going to actually keep Washington out of such matters if Wall Street was involved.  It appears the next book I have to read is Paul Krugman’s <i>End This Depression Now</i>, as I have the feeling it’s going to be increasingly relevant as an economic roadmap.<i><br/></i></div></div>",
  "content_text": "This comment from DH sums up the election nicely:\nNate Silver was very close to perfect.  VD called the swings states wrong.  National polling is not that useful, State polling is pretty useful.\nSo, the good news is that we probably won’t be fighting Iran or any other wars in the Middle East now.  Another African intervention or two is more likely and less problematic.  The bad news is that Helicopter Ben just got the green light for QEn.  The dreadful news is that those seemingly ridiculous D+11 samples were actually correct, which means the 2012 election has the potential to mark a demographic turning point from which the American Right will never be able to recover.  The Republican Party is going to have to move harder to the Left if it is going to compete for the female and third world votes that are now electorally determinative.  The demographics are only going to get worse, significantly worse, from here, as millions of immigrants and the children of immigrants with no connection to, or regard for, little American traditions such as the U.S. Constitution and limited government become legal voters.\nLike immigrants everywhere, they will attempt to make their new land more like their old one.  And now we know they will succeed.  That’s good news if you like Mexican food, not so good if you don’t like corporate corruption on steroids, third world crime rates, and a lower standard of living.\nAnd yet, in the short term, as I’ve been pointing out for some time now, most Americans will be better off with the Golfer-in-Chief walking the links than an authoritarian CEO-in-Chief aggressively “fixing” everything from Syria to the money supply.  If we’re fortunate, Obama will be content to bask in his victory for the next four years and let the economy collapse without much more than the half-hearted Keynesian assistance he’s provided in the past.\nBut I think it is safe to conclude that I should stick to economics and societal predictions rather than political ones.  Polling clearly trumps pattern recognition with regards to the latter.  On the plus side, now that we know the polls are reliable, there isn’t really any need for short-term predictions anymore.  As Real Clear Politics has shown, anyone with Excel and a Monte Carlo plug-in can do the basic math averaging the state polls as competently as Nate Silver.\nThe New York Times makes it pretty clear how we can expect the left-liberals\nto interpret Obama’s victory\n:\nThe president’s victory depended heavily on Midwestern Rust Belt states\nlike Ohio, where the bailout of the auto industry — which Mr. Obama\nengineered and Mr. Romney opposed — proved widely popular for the simple\nreason that it worked.  More broadly, Midwestern voters seemed to endorse the president’s\nargument that the government has a significant role in creating\nprivate-sector jobs and boosting the economy. They rejected Mr. Romney’s\nposition that Washington should simply stay out of such matters and let\nthe free market work its will.\nIt’s hard to argue with that, except for the idea that Mr. Romney was going to actually keep Washington out of such matters if Wall Street was involved.  It appears the next book I have to read is Paul Krugman’s\nEnd This Depression Now\n, as I have the feeling it’s going to be increasingly relevant as an economic roadmap.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-07T08:41:00+00:00"
}