{
  "url": "https://voxday.net/2012/11/16/no-dont-move/",
  "scraped_at": "2025-12-14T05:08:11.108077",
  "title": "No, don’t move",
  "date_display": "November 16, 2012",
  "date_iso": "2012-11-16T19:12:00+00:00",
  "date_from_url": "2012-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger inadvertantly recommends <a href=\"http://market-ticker.org/akcs-www?post=213994\">spreading the Blue virus</a>:</p><blockquote class=\"tr_bq\"><p> [T]he people of California passed a ballot measure to tax themselves<br> and give the money not to a state program but rather to a bunch of<br> banksters.  There’s no solution to stupidity that is lawful; your only lawful option if you live in that craphole called <em>California</em><br> where people vote to steal your money using the guns of the government<br> as a means to compel you to to turn it over and then give it to a bunch<br> of thieves on Wall Street — not even spending it on a program to<br> benefit you and your children — is to move.</br></br></br></br></br></br></p></blockquote><p>While it is moderately amusing to think of the devout goodthinkers of California patting themselves on the bank as they  piously vote to raise taxes that use the California schools as a funnel to the banksters, it is a mistake to permit Californians to go anywhere but another proud blue state.  Because it’s only a matter of time before the ex-Californians start looking around and wondering if life wouldn’t be better for everyone if things were done the wonderful way they were back in California.</p><p>And aside from New Yorkers, I’ve never known any group of people more dedicated to informing you of their origins than Californians.  It was bad enough at my university that the one girl from Minnesota used to roll her eyes and sarcastically mutter “hey, Minnesota buddy!” in my direction if we both happened to be in the vicinity of two Californians congratulating each other on their mutual state of residence.  Granted, they’re not quite as obnoxious as Parisians, but it’s still ridiculous.</p></div>",
  "content_text": "Karl Denninger inadvertantly recommends\nspreading the Blue virus\n:\n[T]he people of California passed a ballot measure to tax themselves\nand give the money not to a state program but rather to a bunch of\nbanksters.  There’s no solution to stupidity that is lawful; your only lawful option if you live in that craphole called\nCalifornia\nwhere people vote to steal your money using the guns of the government\nas a means to compel you to to turn it over and then give it to a bunch\nof thieves on Wall Street — not even spending it on a program to\nbenefit you and your children — is to move.\nWhile it is moderately amusing to think of the devout goodthinkers of California patting themselves on the bank as they  piously vote to raise taxes that use the California schools as a funnel to the banksters, it is a mistake to permit Californians to go anywhere but another proud blue state.  Because it’s only a matter of time before the ex-Californians start looking around and wondering if life wouldn’t be better for everyone if things were done the wonderful way they were back in California.\nAnd aside from New Yorkers, I’ve never known any group of people more dedicated to informing you of their origins than Californians.  It was bad enough at my university that the one girl from Minnesota used to roll her eyes and sarcastically mutter “hey, Minnesota buddy!” in my direction if we both happened to be in the vicinity of two Californians congratulating each other on their mutual state of residence.  Granted, they’re not quite as obnoxious as Parisians, but it’s still ridiculous.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-16T19:12:00+00:00"
}