{
  "url": "https://voxday.net/2012/11/16/petraeus-starts-talking/",
  "scraped_at": "2025-12-14T05:08:12.928076",
  "title": "Petraeus starts talking",
  "date_display": "November 16, 2012",
  "date_iso": "2012-11-16T22:07:00+00:00",
  "date_from_url": "2012-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Two interesting bits of news to surface today:</p><blockquote class=\"tr_bq\"><p> 1.  “Representative Peter King stated that former CIA Director David Petraeus<br> stated that he knew the Benghazi attack was terrorism and that the<br> talking points given to Ambassador Susan Rice were different from the<br> ones prepared by the CIA. Petraeus stated Rice’s talking points were<br> edited to demphasized the possibility of terrorism.”</br></br></br></br></p><p>2.  “Reports from those who listened to recordings of the pleas<br> for help coming from the Benghazi Consulate on September 11 that caused Marine<br> Ty Woods to disobey orders and fight to defend the consulate suggest that the<br> tapes are “damning” proof of the Obama Administration’s mishandling of the<br> attacks.”</br></br></br></br></p></blockquote><p>I’d provide the links, but that’s all there was.  It looks like Obama could be a lame duck a lot sooner than his two-term predecessors were.   There are going to be a lot of people interested in discovering who edited the CIA notes and why.</p></div>",
  "content_text": "Two interesting bits of news to surface today:\n1.  “Representative Peter King stated that former CIA Director David Petraeus\nstated that he knew the Benghazi attack was terrorism and that the\ntalking points given to Ambassador Susan Rice were different from the\nones prepared by the CIA. Petraeus stated Rice’s talking points were\nedited to demphasized the possibility of terrorism.”\n2.  “Reports from those who listened to recordings of the pleas\nfor help coming from the Benghazi Consulate on September 11 that caused Marine\nTy Woods to disobey orders and fight to defend the consulate suggest that the\ntapes are “damning” proof of the Obama Administration’s mishandling of the\nattacks.”\nI’d provide the links, but that’s all there was.  It looks like Obama could be a lame duck a lot sooner than his two-term predecessors were.   There are going to be a lot of people interested in discovering who edited the CIA notes and why.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-16T22:07:00+00:00"
}