{
  "url": "https://voxday.net/2012/11/24/preorder-period-ending/",
  "scraped_at": "2025-12-14T05:08:46.106719",
  "title": "Preorder period ending",
  "date_display": "November 24, 2012",
  "date_iso": "2012-11-24T17:21:00+00:00",
  "date_from_url": "2012-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://4.bp.blogspot.com/-D5vUaBg7fFY/UHvVxc4PQNI/AAAAAAAAAVc/VprGTfLGmWY/s1600/ATOB_480.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2012/11/ATOB_480.png\" width=\"213\"/></a></div><p><i>In Selenoth, the race of Man is on the<br> ascendant. The ancient dragons sleep. The ghastly Witchkings are<br> no<br> more; their evil power destroyed by the courage of Men and the<br> fearsome magic of the Elves. The Dwarves have retreated to the<br> kingdoms of the Underdeep, the trolls hide in their mountains, and<br> even the savage orc tribes have learned to dread the iron<br> discipline<br> of Amorr’s mighty legions. But after four hundred years of mutual<br> suspicion, the rivalry between two of the Houses Martial that rule<br> the Amorran Senate threatens to turn violent, and unrest sparks<br> rebellion throughout the imperial provinces. In the north, the<br> barbarian reavers who have long plagued the coasts of the White<br> Sea<br> beg for the royal protection of the King of Savondir, as they flee<br> a vicious race of wolf-demons. In the east, the war drums<br> echo throughout the mountains as orcs and goblins gather in great<br> numbers, summoned by their bestial gods.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></i></p><p><i>And when the Most Holy and Sanctified<br> Father is found dead in his bed, leaving the Ivory Throne of the<br> Apostles unclaimed, the temptation to seize the Sacred College and<br> wield Holy Mother Church as a weapon is more than some fallen<br> souls<br> can resist.</br></br></br></br></br></i></p><p>We’re working hard on getting the ebook out on December 1st.  The hardcover won’t ship for about two weeks after that, so if anyone spots any errata of any kind in the ebook, be it typos, grammar, or continuity, please don’t hesitate to email them to me immediately and we’ll get them corrected.  We will, of course, be providing updated ebooks to those who have purchased them.  This is a little unusual, but then, the book is a hefty monster that is going to run around 900 pages in the 6×9 format and given that you guys managed to find over 100 errors in each of the three EW novels published and line-edited by Pocket, I have no doubt we’ll miss a few howlers here.</p><p>Marcher Lord also asked me to remind those who are interested in buying the hardcover, but have not yet preordered it that <a href=\"http://www.marcherlordpress.com/bookstore/fantasy/throne-of-bones/\">the preorder discount offer</a> will end on Monday, November 26th.  Remember that in addition to the discounted price, those who have preordered the hardcover will receive the ebook when it comes out.  Thanks to all of you who have preordered already.</p></div>",
  "content_text": "In Selenoth, the race of Man is on the\nascendant. The ancient dragons sleep. The ghastly Witchkings are\nno\nmore; their evil power destroyed by the courage of Men and the\nfearsome magic of the Elves. The Dwarves have retreated to the\nkingdoms of the Underdeep, the trolls hide in their mountains, and\neven the savage orc tribes have learned to dread the iron\ndiscipline\nof Amorr’s mighty legions. But after four hundred years of mutual\nsuspicion, the rivalry between two of the Houses Martial that rule\nthe Amorran Senate threatens to turn violent, and unrest sparks\nrebellion throughout the imperial provinces. In the north, the\nbarbarian reavers who have long plagued the coasts of the White\nSea\nbeg for the royal protection of the King of Savondir, as they flee\na vicious race of wolf-demons. In the east, the war drums\necho throughout the mountains as orcs and goblins gather in great\nnumbers, summoned by their bestial gods.\nAnd when the Most Holy and Sanctified\nFather is found dead in his bed, leaving the Ivory Throne of the\nApostles unclaimed, the temptation to seize the Sacred College and\nwield Holy Mother Church as a weapon is more than some fallen\nsouls\ncan resist.\nWe’re working hard on getting the ebook out on December 1st.  The hardcover won’t ship for about two weeks after that, so if anyone spots any errata of any kind in the ebook, be it typos, grammar, or continuity, please don’t hesitate to email them to me immediately and we’ll get them corrected.  We will, of course, be providing updated ebooks to those who have purchased them.  This is a little unusual, but then, the book is a hefty monster that is going to run around 900 pages in the 6×9 format and given that you guys managed to find over 100 errors in each of the three EW novels published and line-edited by Pocket, I have no doubt we’ll miss a few howlers here.\nMarcher Lord also asked me to remind those who are interested in buying the hardcover, but have not yet preordered it that\nthe preorder discount offer\nwill end on Monday, November 26th.  Remember that in addition to the discounted price, those who have preordered the hardcover will receive the ebook when it comes out.  Thanks to all of you who have preordered already.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-24T17:21:00+00:00"
}