{
  "url": "https://voxday.net/2012/11/04/richard-dawkins-on-us-politics/",
  "scraped_at": "2025-12-14T05:07:07.334170",
  "title": "Richard Dawkins on US politics",
  "date_display": "November 4, 2012",
  "date_iso": "2012-11-04T15:00:00+00:00",
  "date_from_url": "2012-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Keep in mind, this is <a href=\"http://www.nationalreview.com/corner/332416/richard-dawkinss-blind-faith-obama-charles-c-w-cooke\">the same keen political observer</a> who fell for Sam Harris’s ridiculous Red State argument because he didn’t know that American states are divided into counties:</p><blockquote class=\"tr_bq\"><p> If anyone is in doubt that Dawkins is a staunch liberal, take a quick look at his Twitter feed. On it, he <a href=\"http://twitter.com/RichardDawkins/status/260004959473504256\">d</a><a href=\"http://twitter.com/RichardDawkins/status/260004959473504256\">escribes</a> Mitt Romney as an “awful Republican,” and — <a href=\"http://www.nytimes.com/interactive/2012/10/28/opinion/presidential-endorsement-timeline.html\">this might sound familiar</a><br> — disdains every Republican candidate and president since Eisenhower.<br> He constantly, almost obsessively, retweets Barack Obama’s campaign<br> missives. He approvingly <a href=\"https://twitter.com/RichardDawkins/status/260364613491769344\">quotes</a><br> Obama’s infamous line about those who “cling to guns or religion or<br> antipathy to people who aren’t like them” and contrasts it favorably<br> with Romney’s NRA membership, which he <a href=\"https://twitter.com/RichardDawkins/status/260352528615628800\">characterizes</a> thus:<br> “No dang libruls gonna take away mah constitootional raht to carry a<br> gun. Pow! Bang! Weehaaar! Good shoot’n pardner.” Indeed, so partisan is<br> the man that he even entertained the absurd dual conspiracy theories<br> that Bush cheated in his debates with a <a href=\"https://twitter.com/RichardDawkins/status/254470371854671872\">radio</a> (it’s “undeniable,” apparently) and Romney with a <a href=\"https://twitter.com/RichardDawkins/status/254326105815793665\">handkerchief</a> in his.</br></br></br></br></br></br></br></br></br></br></p><p>This is a shame, but it is not a surprise. I’ve very much enjoyed<br> Dawkins’s books on science, biology, and evolution, and I enjoyed <i>The God Delusion</i>,<br> too. The lattermost, however, made it clear that whatever genius<br> Richard Dawkins has for science does not extend into politics or current<br> affairs. (His passage on how to set up the “ideal society” is one of<br> the most excrutiatingly infantile things I’ve read.) If anybody could<br> profit from Thomas Sowell’s advice that experts should stay in their<br> fields, it is Richard Dawkins.</br></br></br></br></br></br></br></p><p>On the lecture circuit, Dawkins likes to explain to his audiences<br> that faith corrupts thinking people. Alas, his love affair with Barack<br> Obama appears to have proven him correct.</br></br></p></blockquote><p>Charles Cooke fails to follow the logic to its obvious conclusion.  Richard Dawkins does not possess any genius at all.  I’ve read his books on science, biology, and evolution too, and while I find him to be a generally engaging writer, I find his reasoning to be ever bit as abysmally bad with regards to science, biology, and evolution as it is to US politics.  Keep in mind that of the two “scientific” concepts for which he is most famous, there is no material evidence for the one and the other is looking increasingly dubious.</p></div>",
  "content_text": "Keep in mind, this is\nthe same keen political observer\nwho fell for Sam Harris’s ridiculous Red State argument because he didn’t know that American states are divided into counties:\nIf anyone is in doubt that Dawkins is a staunch liberal, take a quick look at his Twitter feed. On it, he\nd\nescribes\nMitt Romney as an “awful Republican,” and —\nthis might sound familiar\n— disdains every Republican candidate and president since Eisenhower.\nHe constantly, almost obsessively, retweets Barack Obama’s campaign\nmissives. He approvingly\nquotes\nObama’s infamous line about those who “cling to guns or religion or\nantipathy to people who aren’t like them” and contrasts it favorably\nwith Romney’s NRA membership, which he\ncharacterizes\nthus:\n“No dang libruls gonna take away mah constitootional raht to carry a\ngun. Pow! Bang! Weehaaar! Good shoot’n pardner.” Indeed, so partisan is\nthe man that he even entertained the absurd dual conspiracy theories\nthat Bush cheated in his debates with a\nradio\n(it’s “undeniable,” apparently) and Romney with a\nhandkerchief\nin his.\nThis is a shame, but it is not a surprise. I’ve very much enjoyed\nDawkins’s books on science, biology, and evolution, and I enjoyed\nThe God Delusion\n,\ntoo. The lattermost, however, made it clear that whatever genius\nRichard Dawkins has for science does not extend into politics or current\naffairs. (His passage on how to set up the “ideal society” is one of\nthe most excrutiatingly infantile things I’ve read.) If anybody could\nprofit from Thomas Sowell’s advice that experts should stay in their\nfields, it is Richard Dawkins.\nOn the lecture circuit, Dawkins likes to explain to his audiences\nthat faith corrupts thinking people. Alas, his love affair with Barack\nObama appears to have proven him correct.\nCharles Cooke fails to follow the logic to its obvious conclusion.  Richard Dawkins does not possess any genius at all.  I’ve read his books on science, biology, and evolution too, and while I find him to be a generally engaging writer, I find his reasoning to be ever bit as abysmally bad with regards to science, biology, and evolution as it is to US politics.  Keep in mind that of the two “scientific” concepts for which he is most famous, there is no material evidence for the one and the other is looking increasingly dubious.",
  "tags": [
    "atheism",
    "politics",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-04T15:00:00+00:00"
}