{
  "url": "https://voxday.net/2012/11/15/ron-paul-on-secession/",
  "scraped_at": "2025-12-14T05:08:04.035026",
  "title": "Ron Paul on secession",
  "date_display": "November 15, 2012",
  "date_iso": "2012-11-15T14:00:00+00:00",
  "date_from_url": "2012-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote class=\"tr_bq\"><p> This weekend I got a couple of calls from<br> the media asking me questions about Rick Perry, our governor here in<br> Texas and the statements he made about possible secession. Now, he<br> didn’t call for secession, but he was restating a principle that was<br> long held and at least in the original time of our country, and that is<br> that there was a right to secession.</br></br></br></br></br></p><p>Actually, after the Civil War, nobody believes there is a so-called<br> right to secession, but it is a very legitimate issue to debate because<br> all of the states that came into the Union before the Civil War<br> believed  they have a right to secede and New England in the early part<br> of the  19th century actually considered it, and nobody questioned them<br> about  whether they had the right to do it or not.  Since the Civil War, it’s been sort of a dead issue, but he brought<br> it up. It stirred the media and believe me, it really stirred some of<br> the liberal media where they started really screaming about what is<br> going on here. “This is un-American”, I heard one individual say, “This<br> is treasonous to even talk about it.”</br></br></br></br></br></br></br></br></br></p><p>Well, they don’t know their history very well because if they think<br> about it, it’s an American tradition. It’s very American to talk about<br> secession. That’s how we came into being. Thirteen colonies seceded from<br> the British and established a new country, so secession is very much<br> an  American principle.</br></br></br></br></p><p>What about all the strong endorsements we have given over the past<br> decade or two of those republics that seceded from the Soviet system? We<br> were delighted with this. We never said, “Oh no. Secession is<br> treasonous”.</br></br></br></p><p>No. Secession is a good principle. Just think of the benefits that<br> would have come over these last 230-some years if the principle of<br> secession had existed. That means the federal government would always<br> have been restrained, not to overburden the states with too much<br> federalism, too many federal rules and regulations.</br></br></br></br></p><p>But since that was all wiped out with the Civil War, the federal<br> government has grown by leaps and bounds and we have suffered the<br> consequences, and we need to reconsider this. It’s not un-American to<br> think about the possibility of secession. This is something that’s<br> voluntary. We came together voluntarily. A free society means you can<br> dissolve it voluntarily. That was the whole issue was about.<br> Just remember one of the reasons that Wilson drove us in<br> unnecessarily into World War I. He talked about what we have to give,<br> have every country in the world the benefit of self-determination, a<br> good principle. Of course, I don’t think he really believed that. But<br> self-determination is a good principle. It’s a very American principle,<br> so to me it’s a shame that we can’t discuss this.</br></br></br></br></br></br></br></br></br></br></br></p><p>You know, it’s interesting that so many of us have been taught for so<br> many years, and as long as I can remember from the first grade on up<br> taking the pledge of allegiance that we have a republic that’s<br> “indivisible” and we have been preached that and preached it. So<br> therefore, there is no contest, no question since the Civil War that we<br> have even the thought that this could happen.</br></br></br></br></br></p><p>But you know what a lot of people don’t talk about and they really don’t even know about is <a href=\"http://rexcurry.net/bookchapter1a1a.html\" rel=\"noopener\" target=\"_BLANK\">who wrote the pledge to the flag</a>.<br> The pledge to the flag came from, for instance, Bellamy, an avowed<br> Socialist who wanted to put into concrete in the pledge this principle<br> of being indivisible, and he did it, you know, for the celebration<br> ironically 400 years of the celebration of the landing of Christopher<br> Columbus, so it was in 1892.</br></br></br></br></br></p><p>I mean, the pledge of allegiance has not been here, you know, all our<br> history. So I think it’s worth of discussion. I think people should<br> discuss this because right now, the American people are sick and tired<br> of it all and I think the time will come when people will consider it<br> much more seriously is when the federal government can no longer<br> deliver. That time will come when the dollar collapses.</br></br></br></br></br></p><p>No matter what they do and how many promises they have and how many<br> bailouts they have, they can’t do it if the money doesn’t work. So then,<br> the independence of the states will come back and it doesn’t mean that<br> you’ll be un-American to even contemplate what might have to be done<br> once the dollar crashes.</br></br></br></br></p></blockquote><p>It’s really not a question of a right of secession so much as a question of the American right to self-determination.  Are those who live in “the land of the free and the home of the brave” truly less free than Libyans, Iraqis, and Croatians?  Moreoever, if America is a conceptual nation, then obviously it cannot be a geographic location, nor can it be concepts that are intrinsically opposed to the original concepts.  It should be readily apparent that secular big government forced union “America” cannot properly be considered American, regardless of whether one considers the matter in terms of conventional nationalism or the conceptual nationalism so beloved of the melting pot mythmakers.</p><p>We already know the union of the forcibly United States will be divided.  The younger union of the Soviet Socialist Republics broke apart 23 years ago.  The European Union is visibly fracturing already.  The much older union of the kingdoms of Scotland and England will be voting on its dissolution soon.  The only thing we don’t know is when the division will take place.  As I have stated before, my expectation is that it will take place by 2033.</p></div>",
  "content_text": "This weekend I got a couple of calls from\nthe media asking me questions about Rick Perry, our governor here in\nTexas and the statements he made about possible secession. Now, he\ndidn’t call for secession, but he was restating a principle that was\nlong held and at least in the original time of our country, and that is\nthat there was a right to secession.\nActually, after the Civil War, nobody believes there is a so-called\nright to secession, but it is a very legitimate issue to debate because\nall of the states that came into the Union before the Civil War\nbelieved  they have a right to secede and New England in the early part\nof the  19th century actually considered it, and nobody questioned them\nabout  whether they had the right to do it or not.  Since the Civil War, it’s been sort of a dead issue, but he brought\nit up. It stirred the media and believe me, it really stirred some of\nthe liberal media where they started really screaming about what is\ngoing on here. “This is un-American”, I heard one individual say, “This\nis treasonous to even talk about it.”\nWell, they don’t know their history very well because if they think\nabout it, it’s an American tradition. It’s very American to talk about\nsecession. That’s how we came into being. Thirteen colonies seceded from\nthe British and established a new country, so secession is very much\nan  American principle.\nWhat about all the strong endorsements we have given over the past\ndecade or two of those republics that seceded from the Soviet system? We\nwere delighted with this. We never said, “Oh no. Secession is\ntreasonous”.\nNo. Secession is a good principle. Just think of the benefits that\nwould have come over these last 230-some years if the principle of\nsecession had existed. That means the federal government would always\nhave been restrained, not to overburden the states with too much\nfederalism, too many federal rules and regulations.\nBut since that was all wiped out with the Civil War, the federal\ngovernment has grown by leaps and bounds and we have suffered the\nconsequences, and we need to reconsider this. It’s not un-American to\nthink about the possibility of secession. This is something that’s\nvoluntary. We came together voluntarily. A free society means you can\ndissolve it voluntarily. That was the whole issue was about.\nJust remember one of the reasons that Wilson drove us in\nunnecessarily into World War I. He talked about what we have to give,\nhave every country in the world the benefit of self-determination, a\ngood principle. Of course, I don’t think he really believed that. But\nself-determination is a good principle. It’s a very American principle,\nso to me it’s a shame that we can’t discuss this.\nYou know, it’s interesting that so many of us have been taught for so\nmany years, and as long as I can remember from the first grade on up\ntaking the pledge of allegiance that we have a republic that’s\n“indivisible” and we have been preached that and preached it. So\ntherefore, there is no contest, no question since the Civil War that we\nhave even the thought that this could happen.\nBut you know what a lot of people don’t talk about and they really don’t even know about is\nwho wrote the pledge to the flag\n.\nThe pledge to the flag came from, for instance, Bellamy, an avowed\nSocialist who wanted to put into concrete in the pledge this principle\nof being indivisible, and he did it, you know, for the celebration\nironically 400 years of the celebration of the landing of Christopher\nColumbus, so it was in 1892.\nI mean, the pledge of allegiance has not been here, you know, all our\nhistory. So I think it’s worth of discussion. I think people should\ndiscuss this because right now, the American people are sick and tired\nof it all and I think the time will come when people will consider it\nmuch more seriously is when the federal government can no longer\ndeliver. That time will come when the dollar collapses.\nNo matter what they do and how many promises they have and how many\nbailouts they have, they can’t do it if the money doesn’t work. So then,\nthe independence of the states will come back and it doesn’t mean that\nyou’ll be un-American to even contemplate what might have to be done\nonce the dollar crashes.\nIt’s really not a question of a right of secession so much as a question of the American right to self-determination.  Are those who live in “the land of the free and the home of the brave” truly less free than Libyans, Iraqis, and Croatians?  Moreoever, if America is a conceptual nation, then obviously it cannot be a geographic location, nor can it be concepts that are intrinsically opposed to the original concepts.  It should be readily apparent that secular big government forced union “America” cannot properly be considered American, regardless of whether one considers the matter in terms of conventional nationalism or the conceptual nationalism so beloved of the melting pot mythmakers.\nWe already know the union of the forcibly United States will be divided.  The younger union of the Soviet Socialist Republics broke apart 23 years ago.  The European Union is visibly fracturing already.  The much older union of the kingdoms of Scotland and England will be voting on its dissolution soon.  The only thing we don’t know is when the division will take place.  As I have stated before, my expectation is that it will take place by 2033.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-15T14:00:00+00:00"
}