{
  "url": "https://voxday.net/2012/11/24/secession-enters-mainstrea/",
  "scraped_at": "2025-12-14T05:08:44.279898",
  "title": "Secession enters the mainstream",
  "date_display": "November 24, 2012",
  "date_iso": "2012-11-24T11:55:00+00:00",
  "date_from_url": "2012-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times publishes a remarkably balanced article on <a href=\"http://www.nytimes.com/2012/11/24/us/politics/with-stickers-a-petition-and-even-a-middle-name-secession-fever-hits-texas.html?hp\">the topic of Texas secession</a>:</p><blockquote class=\"tr_bq\"><div itemprop=\"articleBody\"> In Texas, talk of secession in recent years has steadily shifted to the<br> center from the fringe right. It has emerged as an echo of the state<br> Republican leadership’s anti-Washington, pro-Texas-sovereignty mantra on<br> a variety of issues, including health care and environmental<br> regulations. For some Texans, the renewed interest in the subject serves<br> simply as comic relief after a crushing election defeat. </br></br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> But for other proponents of secession and its sister ideology, Texas<br> nationalism — a focus of the Texas Nationalist Movement and other groups<br> that want the state to become an independent nation, as it was in the<br> 1830s and 1840s — it is a far more serious matter. </br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> The official in East Texas, Peter Morrison, the treasurer of the Hardin<br> County Republican Party, said in a statement that he had received<br> overwhelming support from conservative Texans and overwhelming<br> opposition from liberals outside the state in response to his comments<br> in his newsletter. He said that it may take time for “people to<br> appreciate that the fundamental cultural differences between Texas and<br> other parts of the United States may be best addressed by an amicable<br> divorce, a peaceful separation.” </br></br></br></br></br></br></br></div></blockquote><div itemprop=\"articleBody\"> For the record, I am in favor of self-determination.  That is the key, I think, for secession supporters to win liberal/progressive support.  American liberals, for all their ability to double-think, simply cannot permit themselves to oppose self-determination, since it is one of the foundations of their perspective on foreign policy.  While some of them will be able to concoct a convoluted conceptual structure that allows them to vehemently support foreign self-determination while denying it to Americans, most of them will not.  It is too integral to their view of the world.</div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> And for the record, I am entirely in favor of self-determination for Texans as well as the other American states.  Liberals like to point out that the “Democratic” states subsidize the “Republican” states; a fact which omits one extremely relevant point which I shall point out and walk through the math in a future post.  Secession advocates should use this fact and the self-determination argument relentlessly, as encouraging the left to declare “good riddance” will be key to winning their support for the eventual, and inevitable, secession of several American States.</div></div>",
  "content_text": "The New York Times publishes a remarkably balanced article on\nthe topic of Texas secession\n:\nIn Texas, talk of secession in recent years has steadily shifted to the\ncenter from the fringe right. It has emerged as an echo of the state\nRepublican leadership’s anti-Washington, pro-Texas-sovereignty mantra on\na variety of issues, including health care and environmental\nregulations. For some Texans, the renewed interest in the subject serves\nsimply as comic relief after a crushing election defeat.\nBut for other proponents of secession and its sister ideology, Texas\nnationalism — a focus of the Texas Nationalist Movement and other groups\nthat want the state to become an independent nation, as it was in the\n1830s and 1840s — it is a far more serious matter.\nThe official in East Texas, Peter Morrison, the treasurer of the Hardin\nCounty Republican Party, said in a statement that he had received\noverwhelming support from conservative Texans and overwhelming\nopposition from liberals outside the state in response to his comments\nin his newsletter. He said that it may take time for “people to\nappreciate that the fundamental cultural differences between Texas and\nother parts of the United States may be best addressed by an amicable\ndivorce, a peaceful separation.”\nFor the record, I am in favor of self-determination.  That is the key, I think, for secession supporters to win liberal/progressive support.  American liberals, for all their ability to double-think, simply cannot permit themselves to oppose self-determination, since it is one of the foundations of their perspective on foreign policy.  While some of them will be able to concoct a convoluted conceptual structure that allows them to vehemently support foreign self-determination while denying it to Americans, most of them will not.  It is too integral to their view of the world.\nAnd for the record, I am entirely in favor of self-determination for Texans as well as the other American states.  Liberals like to point out that the “Democratic” states subsidize the “Republican” states; a fact which omits one extremely relevant point which I shall point out and walk through the math in a future post.  Secession advocates should use this fact and the self-determination argument relentlessly, as encouraging the left to declare “good riddance” will be key to winning their support for the eventual, and inevitable, secession of several American States.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-24T11:55:00+00:00"
}