{
  "url": "https://voxday.net/2012/11/01/smells-like-game-over/",
  "scraped_at": "2025-12-14T05:06:57.081606",
  "title": "Smells like game over",
  "date_display": "November 1, 2012",
  "date_iso": "2012-11-01T15:25:00+00:00",
  "date_from_url": "2012-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite not being at all a Muslim in any way, shape, or form, so help him, um, Moses, Obama <a href=\"http://washington.cbslocal.com/2012/11/01/poll-majority-of-israelis-want-romney-as-president/\">actually managed to lose the Israelis</a>:</p><blockquote class=\"tr_bq\"><p> Mitt Romney was running for president against Barack Obama in Israel, the former Mass. governor would win in a landslide.<br> A new poll released by The Times of Israel on Thursday showed that 45<br> percent of Israelis would vote for Romney, compared to 29 percent for<br> the president. </br></br></br></p></blockquote><p>As we saw from the commenter at McRapey’s, when you’ve lost the Israelis, you’ve lost the American Jewish vote.  I’m a little saddened by this tragi-comic ending, as I just don’t think a Romney administration is going to provide even one-fifth the comedic appeal of its predecessor.</p></div>",
  "content_text": "Despite not being at all a Muslim in any way, shape, or form, so help him, um, Moses, Obama\nactually managed to lose the Israelis\n:\nMitt Romney was running for president against Barack Obama in Israel, the former Mass. governor would win in a landslide.\nA new poll released by The Times of Israel on Thursday showed that 45\npercent of Israelis would vote for Romney, compared to 29 percent for\nthe president.\nAs we saw from the commenter at McRapey’s, when you’ve lost the Israelis, you’ve lost the American Jewish vote.  I’m a little saddened by this tragi-comic ending, as I just don’t think a Romney administration is going to provide even one-fifth the comedic appeal of its predecessor.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-01T15:25:00+00:00"
}