{
  "url": "https://voxday.net/2012/11/25/the-laffer-curve-at-work/",
  "scraped_at": "2025-12-14T05:08:47.919130",
  "title": "The Laffer Curve at work",
  "date_display": "November 25, 2012",
  "date_iso": "2012-11-25T11:49:00+00:00",
  "date_from_url": "2012-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An Instapundit reader illustrates both the perils of <a href=\"http://pjmedia.com/instapundit/158375/\">blindly raising income tax rates</a> and the financial pointlessness of many married women working:</p><blockquote class=\"tr_bq\"><p> After the election, my wife and I are going partial Galt.  We’re in<br> California, so our state income tax went up in addition to what’s sure<br> to come out of Washington.</br></br></p><p>My wife quit her job last week.  I increased my participation in a<br> tax deferment plan offered by my employer to bring my taxable income as<br> close to $250K as possible.  We’ll be cutting back a little, but the<br> government is going to getting a whole lot less.</br></br></br></p><p>My wife’s entire salary barely covered our tax bill – she was 100%<br> slave to the government, while I was a 10% slave.  Now she is 100% free,<br> and I’ll be a ~35% slave  As a couple, 17.5% of our time is slaving on<br> the government plantation from an astounding 55% previously.</br></br></br></p><p>My wife is deliriously happy, our children are delighted to have mom<br> home, the dog gets more walks, and I find not spending money rapturously<br> satisfying. </br></br></p></blockquote><p>Statist theoreticians and bureaucrats never seem to understand that humans always modify their behavior in response to prospective stimuli.  And when they finally do, after failing to achieve the results expected, they usually make the mistake of attempting to forcibly limit human options, thereby falling into exactly the same trap.  And the smarter and more productive the individual, the more his contributions are required, the more likely it is that he will figure out a way to refuse to participate.</p><p>Here is a trivially easy prediction.  California will collect less tax revenue than estimated in 2013 despite its newly raised rates that theoretically will cause it to collect more.  Moreover, it will probably collect less than it did in 2012, and its budget deficit will rise.</p></div>",
  "content_text": "An Instapundit reader illustrates both the perils of\nblindly raising income tax rates\nand the financial pointlessness of many married women working:\nAfter the election, my wife and I are going partial Galt.  We’re in\nCalifornia, so our state income tax went up in addition to what’s sure\nto come out of Washington.\nMy wife quit her job last week.  I increased my participation in a\ntax deferment plan offered by my employer to bring my taxable income as\nclose to $250K as possible.  We’ll be cutting back a little, but the\ngovernment is going to getting a whole lot less.\nMy wife’s entire salary barely covered our tax bill – she was 100%\nslave to the government, while I was a 10% slave.  Now she is 100% free,\nand I’ll be a ~35% slave  As a couple, 17.5% of our time is slaving on\nthe government plantation from an astounding 55% previously.\nMy wife is deliriously happy, our children are delighted to have mom\nhome, the dog gets more walks, and I find not spending money rapturously\nsatisfying.\nStatist theoreticians and bureaucrats never seem to understand that humans always modify their behavior in response to prospective stimuli.  And when they finally do, after failing to achieve the results expected, they usually make the mistake of attempting to forcibly limit human options, thereby falling into exactly the same trap.  And the smarter and more productive the individual, the more his contributions are required, the more likely it is that he will figure out a way to refuse to participate.\nHere is a trivially easy prediction.  California will collect less tax revenue than estimated in 2013 despite its newly raised rates that theoretically will cause it to collect more.  Moreover, it will probably collect less than it did in 2012, and its budget deficit will rise.",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-25T11:49:00+00:00"
}