{
  "url": "https://voxday.net/2012/11/14/the-diversity-dilemma/",
  "scraped_at": "2025-12-14T05:07:58.496126",
  "title": "The diversity dilemma",
  "date_display": "November 14, 2012",
  "date_iso": "2012-11-14T11:26:00+00:00",
  "date_from_url": "2012-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Friedman can be a clueless buffoon at times, but the one thing he does know about is the Middle East.  What I find fascinating about <a href=\"http://www.nytimes.com/2012/11/14/opinion/friedman-obamas-nightmare.html?hp\">his nightmare scenario</a> is the way it shows how left-liberals who clearly recognize the structural problems in other countries can nevertheless turn around and advocate the continuing construction of the same sort of problems in the United States:</p><blockquote class=\"tr_bq\"><div itemprop=\"articleBody\"> Ever since the start of the Syrian uprising/civil war, I’ve cautioned<br> that while Libya, Egypt, Yemen, Bahrain and Tunisia implode, Syria would<br> <i>explode</i> if a political resolution was not found quickly. That is exactly what’s happening.  The reason Syria explodes is because its borders are particularly<br> artificial, and all its communities — Sunnis, Shiites, Alawites, Kurds,<br> Druze and Christians — are linked to brethren in nearby countries and<br> are trying to draw them in for help.</br></br></br></br></br></div></blockquote><p> That’s an astute observation, Tom.  Now, guess what’s going to happen when the various communities inside the United States, the Mexicans, the Colombians, the Muslims, the Chinese, and the Jews, can’t make any more headway in collecting resources from the central government and start battling it out amongst themselves as is already taking place in places like south central LA, which the Aztecs have 65 percent ethnically cleansed already.</p><p>Now, why isn’t all that diversity making Syria stronger?</p></div>",
  "content_text": "Thomas Friedman can be a clueless buffoon at times, but the one thing he does know about is the Middle East.  What I find fascinating about\nhis nightmare scenario\nis the way it shows how left-liberals who clearly recognize the structural problems in other countries can nevertheless turn around and advocate the continuing construction of the same sort of problems in the United States:\nEver since the start of the Syrian uprising/civil war, I’ve cautioned\nthat while Libya, Egypt, Yemen, Bahrain and Tunisia implode, Syria would\nexplode\nif a political resolution was not found quickly. That is exactly what’s happening.  The reason Syria explodes is because its borders are particularly\nartificial, and all its communities — Sunnis, Shiites, Alawites, Kurds,\nDruze and Christians — are linked to brethren in nearby countries and\nare trying to draw them in for help.\nThat’s an astute observation, Tom.  Now, guess what’s going to happen when the various communities inside the United States, the Mexicans, the Colombians, the Muslims, the Chinese, and the Jews, can’t make any more headway in collecting resources from the central government and start battling it out amongst themselves as is already taking place in places like south central LA, which the Aztecs have 65 percent ethnically cleansed already.\nNow, why isn’t all that diversity making Syria stronger?",
  "tags": [
    "Vibrancy is our strength",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-14T11:26:00+00:00"
}