{
  "url": "https://voxday.net/2012/11/11/the-poison-is-antidote/",
  "scraped_at": "2025-12-14T05:07:41.883038",
  "title": "The poison is the antidote",
  "date_display": "November 11, 2012",
  "date_iso": "2012-11-11T13:15:00+00:00",
  "date_from_url": "2012-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or so numerous pundits, a number of whom actually voted for Obama in 2008, would have us believe given <a href=\"http://www.thedailybeast.com/articles/2012/11/09/how-can-the-republicans-take-back-the-majority.html\">their advice to the Republican Party</a>:</p><blockquote class=\"tr_bq\"><p> It was a crushing defeat.  Despite<br> an economy as underpowered as a cheap flourescent light, Mitt Romney<br> somehow failed to unseat Barack Obama.  And now it is time for the<br> Republicans to rethink their platform in order to attract new voters–or<br> doom themselves to permanent minority status.</br></br></br></br></p><p>I<br> think the obvious place to start is with immigration reform.  Increase<br> the number of visas available.  Explore guest-worker programs.<br>  Establish a path to citizenship for illegal immigrants who were brought<br> here as children and have never known any other home.  This not only<br> gives the GOP a shot at the Latino vote, but also softens their image in<br> the eyes of the professional class, who might be willing to give the<br> party another look if it didn’t seem so committed to deporting poorer,<br> darker skinned people who just want a shot at picking fruit, trimming<br> lawns, and cleaning houses.</br></br></br></br></br></br></br></br></br></p><p>The<br> GOP would also help itself with those people by embracing gay marriage.<br>  To be sure, this might cause them some problems with the evangelical<br> base whose organizing support is crucial to Republican get-out-the-vote<br> efforts.  But the GOP could assuage that tension by promulgating a<br> hard-core, Republican version of gay and straight marriage.  That’s why<br> they should pair it with making marriage mandatory, and eliminating<br> no-fault divorce.  The message should be that if everyone can get<br> married, then there’s no really excuse not to be.   Oh, I know, the<br> divorce changes might cause friction with the kind of Republicans who go<br> through wives the way other men go through undershirts, but this seems<br> like a small price to pay for a shot at the 1-3% of the electorate that<br> is eligible for gay marriage.  </br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><div class=\"text parbase section\"> The frightening thing here is that McCardle attempts to portray herself as an economist.  My suggestion is that one never take either political or economic advice from an economist, however tall, who cannot figure out that 20 percent is larger than 2 percent….<p>Regardless, there is only one viable long-term solution for the Republican Party, indeed, for the survival of constitutional America throughout the current territorial limits of the United States, and that is a repeat of Operation Wetback on a vastly larger scale. Such an action would require the banning of all dual-citizenships, mass deportations on an unprecedented scale, and likely inspire violence of the sort that has not been seen in America since the riots of the 1960s.  And, needless to say, it is clear there is now no chance that it is ever going to happen.</p><p>Which is a real pity, because it would actually have been the lesser of the two probable evils.  What is going to happen instead is some sort of civil war following the next major stage in the ongoing economic meltdown.  How big it will be and how it will turn out, I don’t pretend to know.  But it is as easily predictable as the wars in the former Soviet Union, the former Yugoslavia, and the former British empire in India, because war is how diverse groups of people usually negotiate imperial divorce.  The USA has not truly been a single nation since imperial rule was forcibly imposed upon the southern states in 1865, but the difference is that it is no longer possible to plausibly pretend that it is still one any longer.</p><p>It’s not a question of hate, race, or religion.  It is the simple historical observation that the Kuomintang will not voluntarily live under the same governance as the Chinese communists.  Pakistanis will not voluntarily live under the same governance as the Indians.  Americans will not voluntarily live under the same governance as Mexicans, Chinese, Indians, or Arabs.  They just will not do it, and to pretend otherwise isn’t so much foolish as insane.</p><p>It doesn’t matter what you do.  It doesn’t matter what you think.  Winter is coming.  The only question is whether it will take you by surprise or not.  And there really isn’t much excuse for being surprised when the temperature has been dropping and the leaves have been falling for quite some time now.</p></div></div>",
  "content_text": "Or so numerous pundits, a number of whom actually voted for Obama in 2008, would have us believe given\ntheir advice to the Republican Party\n:\nIt was a crushing defeat.  Despite\nan economy as underpowered as a cheap flourescent light, Mitt Romney\nsomehow failed to unseat Barack Obama.  And now it is time for the\nRepublicans to rethink their platform in order to attract new voters–or\ndoom themselves to permanent minority status.\nI\nthink the obvious place to start is with immigration reform.  Increase\nthe number of visas available.  Explore guest-worker programs.\nEstablish a path to citizenship for illegal immigrants who were brought\nhere as children and have never known any other home.  This not only\ngives the GOP a shot at the Latino vote, but also softens their image in\nthe eyes of the professional class, who might be willing to give the\nparty another look if it didn’t seem so committed to deporting poorer,\ndarker skinned people who just want a shot at picking fruit, trimming\nlawns, and cleaning houses.\nThe\nGOP would also help itself with those people by embracing gay marriage.\nTo be sure, this might cause them some problems with the evangelical\nbase whose organizing support is crucial to Republican get-out-the-vote\nefforts.  But the GOP could assuage that tension by promulgating a\nhard-core, Republican version of gay and straight marriage.  That’s why\nthey should pair it with making marriage mandatory, and eliminating\nno-fault divorce.  The message should be that if everyone can get\nmarried, then there’s no really excuse not to be.   Oh, I know, the\ndivorce changes might cause friction with the kind of Republicans who go\nthrough wives the way other men go through undershirts, but this seems\nlike a small price to pay for a shot at the 1-3% of the electorate that\nis eligible for gay marriage.\nThe frightening thing here is that McCardle attempts to portray herself as an economist.  My suggestion is that one never take either political or economic advice from an economist, however tall, who cannot figure out that 20 percent is larger than 2 percent….\nRegardless, there is only one viable long-term solution for the Republican Party, indeed, for the survival of constitutional America throughout the current territorial limits of the United States, and that is a repeat of Operation Wetback on a vastly larger scale. Such an action would require the banning of all dual-citizenships, mass deportations on an unprecedented scale, and likely inspire violence of the sort that has not been seen in America since the riots of the 1960s.  And, needless to say, it is clear there is now no chance that it is ever going to happen.\nWhich is a real pity, because it would actually have been the lesser of the two probable evils.  What is going to happen instead is some sort of civil war following the next major stage in the ongoing economic meltdown.  How big it will be and how it will turn out, I don’t pretend to know.  But it is as easily predictable as the wars in the former Soviet Union, the former Yugoslavia, and the former British empire in India, because war is how diverse groups of people usually negotiate imperial divorce.  The USA has not truly been a single nation since imperial rule was forcibly imposed upon the southern states in 1865, but the difference is that it is no longer possible to plausibly pretend that it is still one any longer.\nIt’s not a question of hate, race, or religion.  It is the simple historical observation that the Kuomintang will not voluntarily live under the same governance as the Chinese communists.  Pakistanis will not voluntarily live under the same governance as the Indians.  Americans will not voluntarily live under the same governance as Mexicans, Chinese, Indians, or Arabs.  They just will not do it, and to pretend otherwise isn’t so much foolish as insane.\nIt doesn’t matter what you do.  It doesn’t matter what you think.  Winter is coming.  The only question is whether it will take you by surprise or not.  And there really isn’t much excuse for being surprised when the temperature has been dropping and the leaves have been falling for quite some time now.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-11T13:15:00+00:00"
}