{
  "url": "https://voxday.net/2012/11/29/the-half-life-of-secular-utopia/",
  "scraped_at": "2025-12-14T05:09:02.670382",
  "title": "The half-life of the secular utopia",
  "date_display": "November 29, 2012",
  "date_iso": "2012-11-29T15:19:00+00:00",
  "date_from_url": "2012-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Post-Christianity is all secular fun and games <a href=\"http://www.gatestoneinstitute.org/3459/denmark-muslim-country\">until the vacuum is filled</a>.  And we all know how nature fills about vacuums:</p><blockquote class=\"tr_bq\"><p> Muslim immigrants in a town near Copenhagen have forced the<br> cancellation of traditional Christmas displays this year even while<br> spending lavishly on the Islamic Eid celebration marking the end of<br> Ramadan.</br></br></br></p><p>The controversy has escalated into an angry nationwide debate over<br> the role of Islam in post-Christian Denmark, where a burgeoning Muslim<br> population is becoming increasingly assertive in imposing its will on a<br> wide range of social and civic issues.</br></br></br></p><p>A spokesman for the Danish Conservative Party, Tom Behnke, says he fears there are people who want to convert Denmark into a Muslim country. In an interview with DR News, Behnke said: “I think it is deeply alarming that our integration efforts are so ineffective that the moment there is a Muslim majority, we do away with good-old Danish traditions and introduce Muslim traditions instead. We are living in Denmark, and people have to adapt to the situation that applies here.”</p><p>When asked whether housing associations with a Muslim minority should sponsor an Eid party, Behnke replied: “We have to remember that in the past, an Eid festival was the Muslims’ victory celebration after they had slaughtered the Christians, so I don’t know how much there is to celebrate in Denmark. Still, people should be allowed to celebrate whatever festivals they want to, but they also must respect the festivals in the country they have come to.”</p><p>Behnke added: “There is no point in wanting to convert Denmark into a Muslim country because you yourself have a Muslim background. That must never happen. On the contrary, we must have mutual respect for one another. This is a lack of respect for Danish traditions and culture. We must not have a Denmark where Danish traditions disappear as soon as there is a Muslim majority.”</p></blockquote><p>Of course, the only way for Denmark to avoid losing its Danish traditions is to not have a Muslim majority.  As I have repeatedly attempted to spell out for the atheists and agnostics in our midst, there is not and there will never be a secular science-based utopia.  It is a fundamental category error to pretend it is even remotely possible.  What passes for secularism is merely the transitional state between one dominant religious form and its successor. Post-Christian culture is neither secular nor scientific, it is pagan and pre-Western civilization.</p><p>There are two choices on offer.  The secular enlightenment isn’t one of them.  What passes for progress is actually a large-scale societal reversion of significant proportions, and neither technology nor ever-increasing quantities of debt, (which presently pass for wealth), are going to prevent that.</p><p>Based on what we’re observing, the half-life of a secular society is about twenty years.</p></div>",
  "content_text": "Post-Christianity is all secular fun and games\nuntil the vacuum is filled\n.  And we all know how nature fills about vacuums:\nMuslim immigrants in a town near Copenhagen have forced the\ncancellation of traditional Christmas displays this year even while\nspending lavishly on the Islamic Eid celebration marking the end of\nRamadan.\nThe controversy has escalated into an angry nationwide debate over\nthe role of Islam in post-Christian Denmark, where a burgeoning Muslim\npopulation is becoming increasingly assertive in imposing its will on a\nwide range of social and civic issues.\nA spokesman for the Danish Conservative Party, Tom Behnke, says he fears there are people who want to convert Denmark into a Muslim country. In an interview with DR News, Behnke said: “I think it is deeply alarming that our integration efforts are so ineffective that the moment there is a Muslim majority, we do away with good-old Danish traditions and introduce Muslim traditions instead. We are living in Denmark, and people have to adapt to the situation that applies here.”\nWhen asked whether housing associations with a Muslim minority should sponsor an Eid party, Behnke replied: “We have to remember that in the past, an Eid festival was the Muslims’ victory celebration after they had slaughtered the Christians, so I don’t know how much there is to celebrate in Denmark. Still, people should be allowed to celebrate whatever festivals they want to, but they also must respect the festivals in the country they have come to.”\nBehnke added: “There is no point in wanting to convert Denmark into a Muslim country because you yourself have a Muslim background. That must never happen. On the contrary, we must have mutual respect for one another. This is a lack of respect for Danish traditions and culture. We must not have a Denmark where Danish traditions disappear as soon as there is a Muslim majority.”\nOf course, the only way for Denmark to avoid losing its Danish traditions is to not have a Muslim majority.  As I have repeatedly attempted to spell out for the atheists and agnostics in our midst, there is not and there will never be a secular science-based utopia.  It is a fundamental category error to pretend it is even remotely possible.  What passes for secularism is merely the transitional state between one dominant religious form and its successor. Post-Christian culture is neither secular nor scientific, it is pagan and pre-Western civilization.\nThere are two choices on offer.  The secular enlightenment isn’t one of them.  What passes for progress is actually a large-scale societal reversion of significant proportions, and neither technology nor ever-increasing quantities of debt, (which presently pass for wealth), are going to prevent that.\nBased on what we’re observing, the half-life of a secular society is about twenty years.",
  "tags": [
    "decline and fall",
    "soci"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-29T15:19:00+00:00"
}