{
  "url": "https://voxday.net/2012/11/10/the-italian-war-on-science-continues/",
  "scraped_at": "2025-12-14T05:07:40.035247",
  "title": "The Italian war on science continues",
  "date_display": "November 10, 2012",
  "date_iso": "2012-11-10T16:30:00+00:00",
  "date_from_url": "2012-11-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As we learned in the reaction to the L’Aquila verdicts, holding scientists accountable for actions that lead directly to the deaths of innocent people is <a href=\"http://www.myfoxny.com/story/20051278/italian-cardiologists-arrested-over-experiments\">a direct attack on science</a>:</p><blockquote class=\"tr_bq\"><p> Italian police say they have arrested nine cardiologists accused of performing unauthorized experimental treatments on patients.  Carabinieri<br> Col. Giovanni Capasso says the investigation began over a year ago<br> after consumer groups raised alarm about some suspicious deaths at the<br> Polyclinic hospital in the northern city of Modena.</br></br></br></p><p>Capasso said<br> nine doctors were arrested Friday on accusations of corruption, criminal<br> association, embezzlement, defrauding the national health system and<br> performing unauthorized experimental treatments. One was jailed while<br> the others were given house arrest.  In addition, he said, a dozen<br> medical equipment companies have been barred from working with the<br> national health system for their alleged involvement in the scheme.</br></br></br></br></br></br></p></blockquote><p>What an outrage!  Obviously these heroes of science must be released at once!  How dare the Italian authorities put such fine, reputable scientists on trial for the “crime” of adding to the the body of scientific knowledge?</p></div>",
  "content_text": "As we learned in the reaction to the L’Aquila verdicts, holding scientists accountable for actions that lead directly to the deaths of innocent people is\na direct attack on science\n:\nItalian police say they have arrested nine cardiologists accused of performing unauthorized experimental treatments on patients.  Carabinieri\nCol. Giovanni Capasso says the investigation began over a year ago\nafter consumer groups raised alarm about some suspicious deaths at the\nPolyclinic hospital in the northern city of Modena.\nCapasso said\nnine doctors were arrested Friday on accusations of corruption, criminal\nassociation, embezzlement, defrauding the national health system and\nperforming unauthorized experimental treatments. One was jailed while\nthe others were given house arrest.  In addition, he said, a dozen\nmedical equipment companies have been barred from working with the\nnational health system for their alleged involvement in the scheme.\nWhat an outrage!  Obviously these heroes of science must be released at once!  How dare the Italian authorities put such fine, reputable scientists on trial for the “crime” of adding to the the body of scientific knowledge?",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-10T16:30:00+00:00"
}