{
  "url": "https://voxday.net/2012/11/30/the-gun-she-smokes/",
  "scraped_at": "2025-12-14T05:09:08.143430",
  "title": "The gun, she smokes",
  "date_display": "November 30, 2012",
  "date_iso": "2012-11-30T07:05:00+00:00",
  "date_from_url": "2012-11-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the main reasons I am a vaccine skeptic is that the organizations which vaccine advocates repeatedly cite in their attempt to claim vaccine safety are <a href=\"http://vactruth.com/2012/11/23/flu-shot-spikes-fetal-death/?utm_source=The+Vaccine+Truth+Newsletter&amp;utm_campaign=e89506d904-11_22_2012_vaers&amp;utm_medium=email\">caught concealing information</a> that indicates the opposite:</p><blockquote class=\"tr_bq\"><div align=\"left\">  Documentation received from the National Coalition of<br> Organized Women (NCOW) states that between 2009 and 2010 the<br> mercury-laden combined flu vaccinations have increased Vaccine Adverse<br> Events Reporting Systems (VAERS) fetal death reports by 4,250 percent in<br> pregnant women. Eileen Dannemann, NCOW’s director, made abundantly<br> clear that despite these figures being known to the Centers for Disease<br> Control (CDC), the multiple-strain, inactivated flu vaccine containing<br> mercury (Thimerosal) has once again been recommended to pregnant women<br> as a safe vaccination this season….</br></br></br></br></br></br></br></br></div><div align=\"left\"></div><p>Despite evidence that the CDC knew of the 4,250 percent increase in<br> fetal death reports in 2009/2010, in order to ensure the continuance of<br> the vaccine program for pregnant women, the CDC published a study in<br> AJOG authored by Dr. Pedro Moro of the CDC in the fall of 2010. The<br> study articulated that there were only 23 miscarriages caused by the<br> single flu vaccine in 19 years between 1990 – 2009, an average of 1.2<br> miscarriages per year. This study formed the basis of a CDC worldwide<br> publicity campaign that the flu shot was safe for pregnant women by<br> willfully and strategically excluding the 2009 pandemic data, which was<br> available to them.</br></br></br></br></br></br></br></br></br></p></blockquote><p>For those who blithely argue that all vaccines are developed scientifically and therefore safe – a fascinating approach from a logical perspective – and insist that the CDC should be considered more reliable than other government regulatory agencies such as the BEA or the SEC, I wonder how they can defend the notion that the CDC data is trustworthy when it is confirmed that the organization is making knowingly false statements concerning the safety of vaccines known to cause adverse effects.</p></div>",
  "content_text": "One of the main reasons I am a vaccine skeptic is that the organizations which vaccine advocates repeatedly cite in their attempt to claim vaccine safety are\ncaught concealing information\nthat indicates the opposite:\nDocumentation received from the National Coalition of\nOrganized Women (NCOW) states that between 2009 and 2010 the\nmercury-laden combined flu vaccinations have increased Vaccine Adverse\nEvents Reporting Systems (VAERS) fetal death reports by 4,250 percent in\npregnant women. Eileen Dannemann, NCOW’s director, made abundantly\nclear that despite these figures being known to the Centers for Disease\nControl (CDC), the multiple-strain, inactivated flu vaccine containing\nmercury (Thimerosal) has once again been recommended to pregnant women\nas a safe vaccination this season….\nDespite evidence that the CDC knew of the 4,250 percent increase in\nfetal death reports in 2009/2010, in order to ensure the continuance of\nthe vaccine program for pregnant women, the CDC published a study in\nAJOG authored by Dr. Pedro Moro of the CDC in the fall of 2010. The\nstudy articulated that there were only 23 miscarriages caused by the\nsingle flu vaccine in 19 years between 1990 – 2009, an average of 1.2\nmiscarriages per year. This study formed the basis of a CDC worldwide\npublicity campaign that the flu shot was safe for pregnant women by\nwillfully and strategically excluding the 2009 pandemic data, which was\navailable to them.\nFor those who blithely argue that all vaccines are developed scientifically and therefore safe – a fascinating approach from a logical perspective – and insist that the CDC should be considered more reliable than other government regulatory agencies such as the BEA or the SEC, I wonder how they can defend the notion that the CDC data is trustworthy when it is confirmed that the organization is making knowingly false statements concerning the safety of vaccines known to cause adverse effects.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-30T07:05:00+00:00"
}