{
  "url": "https://voxday.net/2012/11/29/the-wrong-side-of-curve/",
  "scraped_at": "2025-12-14T05:09:06.301289",
  "title": "The wrong side of the curve",
  "date_display": "November 29, 2012",
  "date_iso": "2012-11-29T20:53:00+00:00",
  "date_from_url": "2012-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The UK discovers <a href=\"http://www.telegraph.co.uk/news/politics/9707029/Two-thirds-of-millionaires-left-Britain-to-avoid-50p-tax-rate.html\">the Laffer Curve matters</a>:</p><div class=\"firstPar\"><blockquote class=\"tr_bq\"><p> In the 2009-10 tax year, more than 16,000 people declared an annual income of<br> more than £1 million to HM Revenue and Customs. This number fell to just 6,000 after Gordon Brown introduced the new 50p top<br> rate of income tax shortly before the last general election. The figures have been seized upon by the Conservatives to claim that<br> increasing the highest rate of tax actually led to a loss in revenues for<br> the Government. It is believed that rich Britons moved abroad or took steps to avoid paying<br> the new levy by reducing their taxable incomes.</br></br></br></br></br></p></blockquote><p>Anyone who believes in the myth of human progress has to have their faith shaken by the total inability of governments to grasp the concept of cause and effect despite literally thousands of years of historical evidence upon which to draw.</p></div></div>",
  "content_text": "The UK discovers\nthe Laffer Curve matters\n:\nIn the 2009-10 tax year, more than 16,000 people declared an annual income of\nmore than £1 million to HM Revenue and Customs. This number fell to just 6,000 after Gordon Brown introduced the new 50p top\nrate of income tax shortly before the last general election. The figures have been seized upon by the Conservatives to claim that\nincreasing the highest rate of tax actually led to a loss in revenues for\nthe Government. It is believed that rich Britons moved abroad or took steps to avoid paying\nthe new levy by reducing their taxable incomes.\nAnyone who believes in the myth of human progress has to have their faith shaken by the total inability of governments to grasp the concept of cause and effect despite literally thousands of years of historical evidence upon which to draw.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-29T20:53:00+00:00"
}