{
  "url": "https://voxday.net/2012/11/19/the-governments-other-party/",
  "scraped_at": "2025-12-14T05:08:22.045924",
  "title": "The Government’s Other Party",
  "date_display": "November 19, 2012",
  "date_iso": "2012-11-19T15:00:00+00:00",
  "date_from_url": "2012-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jim Geraghty laments the growing <a href=\"http://www.nationalreview.com/campaign-spot/333646/did-some-470000-mccain-voters-go-libertarian-2012\">libertarian distaste for the Republican Party</a>:</p><blockquote class=\"tr_bq\"><p> Considering how there was little dispute that another four years of<br> Obama would mean another four years of government growing bigger and<br> taking a more active role in citizens’ lives, and how no one really<br> thought Johnson would win, it would appear that the 1.22 million<br> Libertarian voters were content to “send a message” with their votes… a<br> message that will now be almost entirely ignored in Washington.</br></br></br></br></br></p><p>It’s their right; every vote has to be earned, and surely a Romney<br> presidency would have offered its own disappointments to the Libertarian<br> worldview. But it may be a continuing liability for the GOP that<br> roughly one percent of the electorate believes strongly in limited<br> government, but votes in a way that does not empower the GOP to do<br> anything to limit that government.</br></br></br></br></br></p></blockquote><p>Even more problematic was the larger number of libertarians like me and Karl Denninger, who didn’t even vote for Johnson because we knew that while he was the nominated Libertarian candidate, he was no libertarian.  After eight years of unmitigated government growth under George Bush, several of them with the Republicans holding the White House, House, and Senate, many libertarians are completely done with the Republican Party.  We simply will not support the party of not-quite-so-big government.</p><p>The fact of the matter is that it makes no sense for any advocate of small government to vote to empower the GOP to do anything to limit government because the Government’s Other Party has absolutely no intention of doing so.</p></div>",
  "content_text": "Jim Geraghty laments the growing\nlibertarian distaste for the Republican Party\n:\nConsidering how there was little dispute that another four years of\nObama would mean another four years of government growing bigger and\ntaking a more active role in citizens’ lives, and how no one really\nthought Johnson would win, it would appear that the 1.22 million\nLibertarian voters were content to “send a message” with their votes… a\nmessage that will now be almost entirely ignored in Washington.\nIt’s their right; every vote has to be earned, and surely a Romney\npresidency would have offered its own disappointments to the Libertarian\nworldview. But it may be a continuing liability for the GOP that\nroughly one percent of the electorate believes strongly in limited\ngovernment, but votes in a way that does not empower the GOP to do\nanything to limit that government.\nEven more problematic was the larger number of libertarians like me and Karl Denninger, who didn’t even vote for Johnson because we knew that while he was the nominated Libertarian candidate, he was no libertarian.  After eight years of unmitigated government growth under George Bush, several of them with the Republicans holding the White House, House, and Senate, many libertarians are completely done with the Republican Party.  We simply will not support the party of not-quite-so-big government.\nThe fact of the matter is that it makes no sense for any advocate of small government to vote to empower the GOP to do anything to limit government because the Government’s Other Party has absolutely no intention of doing so.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2012-11-19T15:00:00+00:00"
}