{
  "url": "https://voxday.net/2003/10/13/adding-blogro/",
  "scraped_at": "2025-12-13T15:30:28.911003",
  "title": "Adding a Blogroll",
  "date_display": "October 13, 2003",
  "date_iso": "2003-10-13T08:55:00+00:00",
  "date_from_url": "2003-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Okay, after some thought and a bit of reader lobbying, I’ve come to the conclusion that it does make sense to add a blogroll.  I’ve always been of the opinion that <em>quando a Roma, fa cosi come i Romani</em>, and a brief tour of the blogosphere has proved that a blogroll is standard operating procedure.  While I still believe that it is important for a person in the public eye, even one who is barely in the far corner of the public’s peripheral vision such as myself, to be careful of their words and their associations, it would be crazy to be held responsible for something that someone else has written on a site over which one has zero editorial control.</p><p>Nevertheless, I fully expect that at some point, my critics will throw a hissy fit when someone on the blogroll goes off the deep end.  They’ve shown very little logic or reason in their past attacks, so there’s no reason to assume that they’ll start exhibiting it now that I’ve got a blog.</p><p>I’ve also decided to distinguish my readers blogs from the general blogroll, because without them, a writer is basically just talking to himself. <a href=\"http://dougkenline.blogspot.com/\">Doug Kenline</a> and <a href=\"http://nossn.blogspot.com/\">Christian Bowman</a>, two long-time readers who encouraged me to start blogging, have the distinction of heading the list.  I will not be adding a comments section, however, as my blogosphere tour also taught me that an unacceptably high level of public comments on many sites are polluted by trolls, salesmen and porn ads.  If you want to make comments about my blog, well, you’ve got  a blog too, don’t you?</p><p>I will be publicly addressing the occasional email here, though, so if you don’t want me to address yours openly: a) don’t be derogatory, and b) tell me so.<br/></p></div>",
  "content_text": "Okay, after some thought and a bit of reader lobbying, I’ve come to the conclusion that it does make sense to add a blogroll.  I’ve always been of the opinion that\nquando a Roma, fa cosi come i Romani\n, and a brief tour of the blogosphere has proved that a blogroll is standard operating procedure.  While I still believe that it is important for a person in the public eye, even one who is barely in the far corner of the public’s peripheral vision such as myself, to be careful of their words and their associations, it would be crazy to be held responsible for something that someone else has written on a site over which one has zero editorial control.\nNevertheless, I fully expect that at some point, my critics will throw a hissy fit when someone on the blogroll goes off the deep end.  They’ve shown very little logic or reason in their past attacks, so there’s no reason to assume that they’ll start exhibiting it now that I’ve got a blog.\nI’ve also decided to distinguish my readers blogs from the general blogroll, because without them, a writer is basically just talking to himself.\nDoug Kenline\nand\nChristian Bowman\n, two long-time readers who encouraged me to start blogging, have the distinction of heading the list.  I will not be adding a comments section, however, as my blogosphere tour also taught me that an unacceptably high level of public comments on many sites are polluted by trolls, salesmen and porn ads.  If you want to make comments about my blog, well, you’ve got  a blog too, don’t you?\nI will be publicly addressing the occasional email here, though, so if you don’t want me to address yours openly: a) don’t be derogatory, and b) tell me so.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-13T07:55:00+00:00"
}