{
  "url": "https://voxday.net/2003/10/26/another-paper-i-wont-be-reading/",
  "scraped_at": "2025-12-13T15:32:08.533546",
  "title": "Another paper I won’t be reading",
  "date_display": "October 26, 2003",
  "date_iso": "2003-10-26T13:16:00+00:00",
  "date_from_url": "2003-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not long after the <a href=\"http://www.twincities.com/mld/twincities/\">St. Paul Pioneer Press</a> abandoned its register-to-read policy, the paper across the river, the Star Tribune, has initiated one.  I won’t bother providing a link, since you can’t read it anyhow.  As I am opposed to all corporate tracking measures that compromise Internet anonymity, I refuse to register for any online newspaper, which is why I no longer read:</p><p>1) The New York Times<br> <br>2) The Washington Post<br> <br>3) The Star Tribune</br></br></br></br></p><p>I don’t read them online, anyhow.  There’s still nothing to keep me from picking up the office copy of the Star Tribune in the meantime, not until they manage to produce newsprint that bursts into flames and consumes the entire paper should it be touched by a non-registered biometric pattern.</p><p>True, I will probably be a little late to the next NYT-manufactured non-story, such as the massive Master’s protests that swept the nation – who could ever forget the rage – but I’ll survive and thrive nevertheless.  I also predict that the Star Tribune will open up its content within six months as its Internet readership drops off a cliff.  I’m not saying that they don’t have a perfect right to close off their web site to anonymous visitors, I just don’t think that culling one’s readership is a particularly smart move in this day of media saturation.  I quit reading the Nando Times, an early web favorite, when they began to require registration, and it <a href=\"http://www.nandotimes.com/\">doesn’t look as if I was the only one</a> to do so.</p><p>Registration is akin to a cable news show declaring: “you can watch us, but only if you first tell us who you are.”  Yeah, good luck with that.</p></div>",
  "content_text": "Not long after the\nSt. Paul Pioneer Press\nabandoned its register-to-read policy, the paper across the river, the Star Tribune, has initiated one.  I won’t bother providing a link, since you can’t read it anyhow.  As I am opposed to all corporate tracking measures that compromise Internet anonymity, I refuse to register for any online newspaper, which is why I no longer read:\n1) The New York Times\n2) The Washington Post\n3) The Star Tribune\nI don’t read them online, anyhow.  There’s still nothing to keep me from picking up the office copy of the Star Tribune in the meantime, not until they manage to produce newsprint that bursts into flames and consumes the entire paper should it be touched by a non-registered biometric pattern.\nTrue, I will probably be a little late to the next NYT-manufactured non-story, such as the massive Master’s protests that swept the nation – who could ever forget the rage – but I’ll survive and thrive nevertheless.  I also predict that the Star Tribune will open up its content within six months as its Internet readership drops off a cliff.  I’m not saying that they don’t have a perfect right to close off their web site to anonymous visitors, I just don’t think that culling one’s readership is a particularly smart move in this day of media saturation.  I quit reading the Nando Times, an early web favorite, when they began to require registration, and it\ndoesn’t look as if I was the only one\nto do so.\nRegistration is akin to a cable news show declaring: “you can watch us, but only if you first tell us who you are.”  Yeah, good luck with that.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-26T13:16:00+00:00"
}