{
  "url": "https://voxday.net/2003/10/24/best-of-all-possible-reasons/",
  "scraped_at": "2025-12-13T15:31:53.119200",
  "title": "The best of all possible reasons",
  "date_display": "October 24, 2003",
  "date_iso": "2003-10-24T10:17:00+00:00",
  "date_from_url": "2003-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“Microsoft founder and chairman Bill Gates has slammed moves by political parties in Australia and elsewhere to legislate the adoption of open source software.  In <a href=\"http://australianit.news.com.au/articles/0,7204,7638578%5E15306%5E%5Enbv%5E,00.html\">an interview with The Australian</a> at the Microsoft Office System launch in New York, Mr Gates said any such moves by government were wrongheaded and would result in a reduction in public sector productivity.”</p><p>If reducing public sector productivity is not a reason to cheer for Linux, then I don’t know what is.  Private sector productivity = good.  Public sector productivity = everything from a drag on private sector productivity (not good) to the increased efficiency of mass murder (really, really bad).</p><p>Think that sounds whacked?  Then perhaps you should note that 41 of the 191 UN member states have murdered at least 1 percent of their citizenry within the last 100 years.  Everyone remembers Germany, China and the Soviet Union.  But there’s also France, Mexico, Spain, Poland, Turkey, and Yugoslavia, just to name a few.  For a human being living in the 20th century, the chances of getting offed by your own government were hundreds of times greater than the chance that you would be murdered by an individual criminal.</p></div>",
  "content_text": "“Microsoft founder and chairman Bill Gates has slammed moves by political parties in Australia and elsewhere to legislate the adoption of open source software.  In\nan interview with The Australian\nat the Microsoft Office System launch in New York, Mr Gates said any such moves by government were wrongheaded and would result in a reduction in public sector productivity.”\nIf reducing public sector productivity is not a reason to cheer for Linux, then I don’t know what is.  Private sector productivity = good.  Public sector productivity = everything from a drag on private sector productivity (not good) to the increased efficiency of mass murder (really, really bad).\nThink that sounds whacked?  Then perhaps you should note that 41 of the 191 UN member states have murdered at least 1 percent of their citizenry within the last 100 years.  Everyone remembers Germany, China and the Soviet Union.  But there’s also France, Mexico, Spain, Poland, Turkey, and Yugoslavia, just to name a few.  For a human being living in the 20th century, the chances of getting offed by your own government were hundreds of times greater than the chance that you would be murdered by an individual criminal.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-24T09:17:00+00:00"
}