{
  "url": "https://voxday.net/2003/10/09/democrats-sans-democracy/",
  "scraped_at": "2025-12-13T15:30:10.592535",
  "title": "Democrats sans democracy",
  "date_display": "October 9, 2003",
  "date_iso": "2003-10-09T07:56:00+00:00",
  "date_from_url": "2003-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is an interesting trend.  Those who most loudly and proudly proclaim their allegiance to the will of the people appear to actually hate it whenever it counters their interests.  In the recent California recall, the California Democratic party was more than willing to use three corrupt judges to attempt to overturn what has now proven to be the overwhelming will of the people of California.  I’m not saying that I support Governor Schwarzenegger – I don’t, and I suspect it is possible that he may one day come to represent the continental divide of the national Republican Party – but it’s clear that the people of California want him to govern them.  Sometimes people get the government they deserve.</p><p>Sometimes people don’t, however.  The eurofascists of Europe Uber alles are now forcing their so-called constitution down the unwilling throats of people who don’t support it, have never seen it debated in their national parliaments and will not be allowed to vote on it.  Of course, in those countries where the Franco-German Fourth Reich will permit a vote, they will simply force a second vote if the result of the first one is not to their liking.  And a third, if necessary, and a fourth… until the people finally vote as directed.  For an example of how this works, one only has to <a href=\"http://c2d.unige.ch/news/rel.php?rel=1608&amp;lang=\">look to Ireland</a>, which was the only nation of the fifteen signatories involved that allowed its citizens to vote on the Treaty of Nice.  The EU is rather like the Hotel California.  You can enter any time you like, but you can never leave – for as Romano Prodi has declared, “the Euro is forever”.</p><p>How Hitler would have envied these men!  Politicans succeed where panzers failed.</p></div>",
  "content_text": "This is an interesting trend.  Those who most loudly and proudly proclaim their allegiance to the will of the people appear to actually hate it whenever it counters their interests.  In the recent California recall, the California Democratic party was more than willing to use three corrupt judges to attempt to overturn what has now proven to be the overwhelming will of the people of California.  I’m not saying that I support Governor Schwarzenegger – I don’t, and I suspect it is possible that he may one day come to represent the continental divide of the national Republican Party – but it’s clear that the people of California want him to govern them.  Sometimes people get the government they deserve.\nSometimes people don’t, however.  The eurofascists of Europe Uber alles are now forcing their so-called constitution down the unwilling throats of people who don’t support it, have never seen it debated in their national parliaments and will not be allowed to vote on it.  Of course, in those countries where the Franco-German Fourth Reich will permit a vote, they will simply force a second vote if the result of the first one is not to their liking.  And a third, if necessary, and a fourth… until the people finally vote as directed.  For an example of how this works, one only has to\nlook to Ireland\n, which was the only nation of the fifteen signatories involved that allowed its citizens to vote on the Treaty of Nice.  The EU is rather like the Hotel California.  You can enter any time you like, but you can never leave – for as Romano Prodi has declared, “the Euro is forever”.\nHow Hitler would have envied these men!  Politicans succeed where panzers failed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-09T06:56:00+00:00"
}