{
  "url": "https://voxday.net/2003/10/16/distinguished-tradition-of-failure/",
  "scraped_at": "2025-12-13T15:30:44.346120",
  "title": "A distinguished tradition of failure",
  "date_display": "October 16, 2003",
  "date_iso": "2003-10-16T07:54:00+00:00",
  "date_from_url": "2003-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t mean to sound cruel, but I have to admit that despite my near complete disinterest in baseball, I’m kind of glad that the Cubs lost.  From an outsider’s perspective, it would seem kind of a shame to cast aside such a long and distinguished record of failure.  As for the Red Sox, the only question is whether the Sports Guy – may he live forever – would be more suicidal if they A) lost to the Yankees in Game 7 of the ALCS; or B) went on to the World Series and lost to the Marlins.</p><p>I’m going with (B).  Florida is still an expansion team in the hearts and minds of baseball’s purists.  You’d think, as a Vikings fan who can still remember crying his eyes out when the Vikes lost their fourth Super Bowl to Oakland, I’d have more sympathy.  But I don’t.</p><p>By the way, did anyone else think it was funny that Tom Clancy matched up the Vikes against the Broncos in <em>The Sum of All Terror</em>?  Of course, the joke has lost its punch now that Denver has two wins under their orange-and-blue belts.  Tom, you know you should have gone with the Bills!  I bet it still annoys him that he didn’t.</p></div>",
  "content_text": "I don’t mean to sound cruel, but I have to admit that despite my near complete disinterest in baseball, I’m kind of glad that the Cubs lost.  From an outsider’s perspective, it would seem kind of a shame to cast aside such a long and distinguished record of failure.  As for the Red Sox, the only question is whether the Sports Guy – may he live forever – would be more suicidal if they A) lost to the Yankees in Game 7 of the ALCS; or B) went on to the World Series and lost to the Marlins.\nI’m going with (B).  Florida is still an expansion team in the hearts and minds of baseball’s purists.  You’d think, as a Vikings fan who can still remember crying his eyes out when the Vikes lost their fourth Super Bowl to Oakland, I’d have more sympathy.  But I don’t.\nBy the way, did anyone else think it was funny that Tom Clancy matched up the Vikes against the Broncos in\nThe Sum of All Terror\n?  Of course, the joke has lost its punch now that Denver has two wins under their orange-and-blue belts.  Tom, you know you should have gone with the Bills!  I bet it still annoys him that he didn’t.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-16T06:54:00+00:00"
}