{
  "url": "https://voxday.net/2003/10/27/dogs-and-light-bulbs/",
  "scraped_at": "2025-12-13T15:32:15.779572",
  "title": "Dogs and light bulbs",
  "date_display": "October 27, 2003",
  "date_iso": "2003-10-27T10:03:00+00:00",
  "date_from_url": "2003-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yeah, this sort of circular email is only one half-step up from Spam, but some of these were pretty funny and it will amuse a certain pretty blonde girl to see them here. <em>How many dogs does it take to change a light bulb?</em></p><p><em>Golden Retriever</em>: The sun is shining, the day is young, we’ve got our whole lives ahead of us, and you’re inside worrying about a stupid burned-out bulb?</p><p><em>Border Collie</em>: Just one. And then I’ll replace any wiring that’s not up to code.</p><p><em>Rottweiler</em>: Make me.</p><p><em>German Shepherd</em>: I’ll change it as soon as I’ve led these people from the dark, check to make sure I haven’t missed any, and make just one more perimeter patrol to see that no one has tried to take advantage of the situation.</p><p><em>Greyhound</em>: It isn’t moving. Who cares?</p><p><em>Poodle</em>: I’ll just blow in the Border Collie’s ear and he’ll do it. By the time he finishes rewiring the house, my nails will be dry.</p><p><em>Ridgeback</em>: I’ll bark at the next delivery guy.  He’ll change it.  After he changes his underwear.</p><p><em>Vizsla</em>:  Don’t hate me because I’m beautiful.</p><p><em>Beagle</em>: WHAT? THE LIGHT BULB NEEDS TO BE CHANGED?? HEY! HEY! THE LIGHT BULB NEEDS TO BE CHANGED! WOWOOOO, WOWOO! SOMEBODY BETTER CHANGE THE LIGHTBULB!!</p><p><em>Cat</em>: “Dogs do not change light bulbs. People change light bulbs. So, the real question is: How long will it be before I can expect some light, some dinner, and a massage?”</p></div>",
  "content_text": "Yeah, this sort of circular email is only one half-step up from Spam, but some of these were pretty funny and it will amuse a certain pretty blonde girl to see them here.\nHow many dogs does it take to change a light bulb?\nGolden Retriever\n: The sun is shining, the day is young, we’ve got our whole lives ahead of us, and you’re inside worrying about a stupid burned-out bulb?\nBorder Collie\n: Just one. And then I’ll replace any wiring that’s not up to code.\nRottweiler\n: Make me.\nGerman Shepherd\n: I’ll change it as soon as I’ve led these people from the dark, check to make sure I haven’t missed any, and make just one more perimeter patrol to see that no one has tried to take advantage of the situation.\nGreyhound\n: It isn’t moving. Who cares?\nPoodle\n: I’ll just blow in the Border Collie’s ear and he’ll do it. By the time he finishes rewiring the house, my nails will be dry.\nRidgeback\n: I’ll bark at the next delivery guy.  He’ll change it.  After he changes his underwear.\nVizsla\n:  Don’t hate me because I’m beautiful.\nBeagle\n: WHAT? THE LIGHT BULB NEEDS TO BE CHANGED?? HEY! HEY! THE LIGHT BULB NEEDS TO BE CHANGED! WOWOOOO, WOWOO! SOMEBODY BETTER CHANGE THE LIGHTBULB!!\nCat\n: “Dogs do not change light bulbs. People change light bulbs. So, the real question is: How long will it be before I can expect some light, some dinner, and a massage?”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-27T10:03:00+00:00"
}