{
  "url": "https://voxday.net/2003/10/13/donovan-mcnabb-superstar/",
  "scraped_at": "2025-12-13T15:30:30.375622",
  "title": "Donovan McNabb, Superstar",
  "date_display": "October 13, 2003",
  "date_iso": "2003-10-13T10:34:00+00:00",
  "date_from_url": "2003-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>16/30\t157\t5.23\t1\t2<br> <br>11/26\t126\t4.85\t1\t0</br></br></p><p>That’s Donovan McNabb’s performance since the <em>affaire d’Limbaugh</em>, which has mysteriously inspired a panoply of headlines crowing that the quarterback was not only <em>not </em>overrated, but was back in a big way as proved by the Eagles’ win over the Redskins.  Right, a <strong>48 percent </strong>completion ratio to go with an average of 1 TD and 1 INT per game is really stellar, gentlemen.  Of course, a lot of these jokers who purport to be sportswriters picked the Eagles to run away with the NFC East, which now looks like this:</p><p>4-1 Dallas<br> <br>3-3 Washington<br> <br>2-3 New York<br> <br>2-3 Philadelphia</br></br></br></br></br></br></p><p>Looking at that sparks one big thought – dang, but the Big Tuna can coach!  The Eagles are by no means out of it, as yet, but a loss to New York next week would make it very, very difficult for them to reclaim the division title if Dallas beats Detroit as expected.  Look, Donovan is a decent quarterback, but he’s inaccurate and is looking less and less likely to be a top QB over the next few years.  I wouldn’t have dumped James Thrash earlier in favor of picking up Andre Johnson and keeping the faith with superpsycho David Boston – which won me a big game last week – if I had any faith in Donovan’s ability to get him the ball in the end zone.</p><p>If you want a black quarterback to talk up and cheer, there’s one in Minnesota worthy of high regard.  Welcome back, Mr. Culpepper!</p></div>",
  "content_text": "16/30\t157\t5.23\t1\t2\n11/26\t126\t4.85\t1\t0\nThat’s Donovan McNabb’s performance since the\naffaire d’Limbaugh\n, which has mysteriously inspired a panoply of headlines crowing that the quarterback was not only\nnot\noverrated, but was back in a big way as proved by the Eagles’ win over the Redskins.  Right, a\n48 percent\ncompletion ratio to go with an average of 1 TD and 1 INT per game is really stellar, gentlemen.  Of course, a lot of these jokers who purport to be sportswriters picked the Eagles to run away with the NFC East, which now looks like this:\n4-1 Dallas\n3-3 Washington\n2-3 New York\n2-3 Philadelphia\nLooking at that sparks one big thought – dang, but the Big Tuna can coach!  The Eagles are by no means out of it, as yet, but a loss to New York next week would make it very, very difficult for them to reclaim the division title if Dallas beats Detroit as expected.  Look, Donovan is a decent quarterback, but he’s inaccurate and is looking less and less likely to be a top QB over the next few years.  I wouldn’t have dumped James Thrash earlier in favor of picking up Andre Johnson and keeping the faith with superpsycho David Boston – which won me a big game last week – if I had any faith in Donovan’s ability to get him the ball in the end zone.\nIf you want a black quarterback to talk up and cheer, there’s one in Minnesota worthy of high regard.  Welcome back, Mr. Culpepper!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-13T09:34:00+00:00"
}