{
  "url": "https://voxday.net/2003/10/11/driving-tank/",
  "scraped_at": "2025-12-13T15:30:22.310826",
  "title": "Driving the tank",
  "date_display": "October 11, 2003",
  "date_iso": "2003-10-11T12:54:00+00:00",
  "date_from_url": "2003-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know if it was the perfect synchronicity of yesterday’s good news out of Dallas, caffeine, Neal Stephenson and a random good mood, or what, but the computer gods elected to smile on my usually fruitless technical efforts this morning.  I mounted my floppy!  In Linux!  Not only that, but this amazing feat of Eloian prestidigitation was followed up by an even more amazing stunt… I also managed to mount the hard drive partition that lets me access my Windows files!  It’s actually pretty easy, of course, once you find <a href=\"http://www.redhat.com/docs/manuals/linux/RHL-9-Manual/getting-started-guide/s1-q-and-a-windows.html\">a decent set of instructions</a> on how to do it.</p><p>There’s still a lot to do before I can make the leap into full-blown Penguin mode.  The hard drive mounts automatically now, but I’m still doing a lot of manual navigation due to my unfamiliarity with both Gnome and Nautilus, and I only have read access to the drive right now.  This is functional, for the time being, but I’d originally set up three partitions to allow for safe(?) writing to the shared third partition from both Windows 2000 and Linux and I’d like to get that going too.  The bigger challenge is getting the Penguin talking to my wireless network.  Unfortunately, it turns out that my WUSB adapter is version 2.6, not the version 2.5 for which the Linux drivers are available, so I’ll have to strip a PCMCIA card from one of my other machines.  I’m not too happy about that, but all will be cheerfully forgiven if I can just get the wireless up and running.</p><p>Unfortunately, the instructions that came with the linux-wlan-ng-0.2.1-pre9 download are not exactly user-friendly.  Hard to imagine, I know, with a filename like that.</p><p>So, does anyone else suddenly have the image of an out-of-control tank lurching wildly across the countryside, as farmers, sheep and chickens run for their lives?  But so what?  I’m driving the freaking tank!  Yee-ha!  Say, I wonder what this big trigger thing does….</p></div>",
  "content_text": "I don’t know if it was the perfect synchronicity of yesterday’s good news out of Dallas, caffeine, Neal Stephenson and a random good mood, or what, but the computer gods elected to smile on my usually fruitless technical efforts this morning.  I mounted my floppy!  In Linux!  Not only that, but this amazing feat of Eloian prestidigitation was followed up by an even more amazing stunt… I also managed to mount the hard drive partition that lets me access my Windows files!  It’s actually pretty easy, of course, once you find\na decent set of instructions\non how to do it.\nThere’s still a lot to do before I can make the leap into full-blown Penguin mode.  The hard drive mounts automatically now, but I’m still doing a lot of manual navigation due to my unfamiliarity with both Gnome and Nautilus, and I only have read access to the drive right now.  This is functional, for the time being, but I’d originally set up three partitions to allow for safe(?) writing to the shared third partition from both Windows 2000 and Linux and I’d like to get that going too.  The bigger challenge is getting the Penguin talking to my wireless network.  Unfortunately, it turns out that my WUSB adapter is version 2.6, not the version 2.5 for which the Linux drivers are available, so I’ll have to strip a PCMCIA card from one of my other machines.  I’m not too happy about that, but all will be cheerfully forgiven if I can just get the wireless up and running.\nUnfortunately, the instructions that came with the linux-wlan-ng-0.2.1-pre9 download are not exactly user-friendly.  Hard to imagine, I know, with a filename like that.\nSo, does anyone else suddenly have the image of an out-of-control tank lurching wildly across the countryside, as farmers, sheep and chickens run for their lives?  But so what?  I’m driving the freaking tank!  Yee-ha!  Say, I wonder what this big trigger thing does….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-11T11:54:00+00:00"
}