{
  "url": "https://voxday.net/2003/10/26/fantasy-football-freaks/",
  "scraped_at": "2025-12-13T15:32:10.363142",
  "title": "Fantasy Football Freaks",
  "date_display": "October 26, 2003",
  "date_iso": "2003-10-26T14:30:00+00:00",
  "date_from_url": "2003-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think that the explosion of interest in fantasy football has created some high profile openings for some very mediocre analysts.  Here’s some of the “insight” being offered by CNN/SI’s vaunted fantasy gurus:</p><p>Bob Harris suggests <a href=\"http://sportsillustrated.cnn.com/2003/fantasy/10/23/back.page/index.html\">staying away from</a>:  the Chicago Bears offense, Cleveland Browns QB, Miami QB, New York Jets QB and Philadelpha WRs.  He also recommends not contracting the Ebola virus, not sticking your head in the microwave and not driving your car into a brick wall at 60 miles per hour.  Thanks, Bob!</p><p>Meanwhile, <a href=\"http://sportsillustrated.cnn.com/2003/fantasy/10/22/first.cut/index.html\">Dr. Football</a> thinks that Peyton Manning, Daunte Culpepper and Steve McNair are good starts.  Are you sure, doctor?  Do you really think the three starting QBs with the three highest QB ratings in the league are good starts?  Manning is going against the second-worst defense in the league this week, but until I read your brilliant insight, I was planning to sit him and start Kordell Stewart.  Dr. Football also just discovered that Joey Harrington, currently leading the 1-5 Detroit Lions into oblivion, is “starting to fade”.  Starting?  I ditched him <em>as a backup</em> after Week 2, when it became clear that my mother could throw for two TDs against Arizona, and probably rush for a third</p><p>Who are these jokers?  Look, the kind of questions that we need answered are things like: in what order would you rank Onterrio Smith, Michael Bennet and Moe Williams for the rest of the season?  Do you start Domanick Davis against Indy, or should you sit him since he’s getting vultured at the goal line by Stacy Mack?  Does LaDainian’s 200 last week help or hurt David Boston against Miami?</p><p>Please try to keep this in mind, gentlemen.  If you’re only going to predict the sure thing, you are as useless as calling a QB draw for Vinnie Testaverde.</p></div>",
  "content_text": "I think that the explosion of interest in fantasy football has created some high profile openings for some very mediocre analysts.  Here’s some of the “insight” being offered by CNN/SI’s vaunted fantasy gurus:\nBob Harris suggests\nstaying away from\n:  the Chicago Bears offense, Cleveland Browns QB, Miami QB, New York Jets QB and Philadelpha WRs.  He also recommends not contracting the Ebola virus, not sticking your head in the microwave and not driving your car into a brick wall at 60 miles per hour.  Thanks, Bob!\nMeanwhile,\nDr. Football\nthinks that Peyton Manning, Daunte Culpepper and Steve McNair are good starts.  Are you sure, doctor?  Do you really think the three starting QBs with the three highest QB ratings in the league are good starts?  Manning is going against the second-worst defense in the league this week, but until I read your brilliant insight, I was planning to sit him and start Kordell Stewart.  Dr. Football also just discovered that Joey Harrington, currently leading the 1-5 Detroit Lions into oblivion, is “starting to fade”.  Starting?  I ditched him\nas a backup\nafter Week 2, when it became clear that my mother could throw for two TDs against Arizona, and probably rush for a third\nWho are these jokers?  Look, the kind of questions that we need answered are things like: in what order would you rank Onterrio Smith, Michael Bennet and Moe Williams for the rest of the season?  Do you start Domanick Davis against Indy, or should you sit him since he’s getting vultured at the goal line by Stacy Mack?  Does LaDainian’s 200 last week help or hurt David Boston against Miami?\nPlease try to keep this in mind, gentlemen.  If you’re only going to predict the sure thing, you are as useless as calling a QB draw for Vinnie Testaverde.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-26T14:30:00+00:00"
}