{
  "url": "https://voxday.net/2003/10/24/fascists-20/",
  "scraped_at": "2025-12-13T15:31:56.410141",
  "title": "Fascists 2.0",
  "date_display": "October 24, 2003",
  "date_iso": "2003-10-24T13:27:00+00:00",
  "date_from_url": "2003-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Umberto Bossi, Italy’s Reform Minister, said Brussels was “transforming vices into virtues” and “advancing the cause of atheism every day”. <a href=\"http://www.telegraph.co.uk/news/main.jhtml?xml=%2Fnews%2F2003%2F10%2F23%2Fwpig23.xml\">He denounced the European arrest warrant</a> as a step towards “dictatorship, deportation, and terror, instilling fear in the people, a crime in itself”. It would lead to a Stalinist regime “multiplied by 25”.</p><p>I’ve written warnings about the EU on several occasions.  Now there are top European leaders warning you.  Remember how when you first learned about the Holocaust and you wondered how Adolf Hitler and the National Socialists could possibly have come to power without anyone protesting or doing anything about it?  Well, now you know.  I’m just curious.  Is it really better for a German government to team up with a French government in order to rule over Europe in a profoundly anti-democratic, freedom-hating manner than for a German government to militarily defeat a French government before teaming up with a second French government to rule over Europe in a profoundly anti-democratic, freedom-hating manner?  Many of the people of the so-called member states won’t even be permitted to vote on the national death warrant known as the European constitution.</p><p>Fascism is not dead.  The fascists were simply smart enough to abandon the swishy sado-masochistic uniforms, take their time and use politicians instead of panzers to take control over the people of Europe.  I suspect there are those in the United States government who realize this, which is why they are so <a href=\"http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2003/10/17/weu17.xml\">concerned about the threat</a> that the Euro Army poses to NATO.  Because if NATO is not there to keep the fascists new army under guard, it’s quite likely that one day the United States will be back in Europe, fighting that same army.</p></div>",
  "content_text": "Umberto Bossi, Italy’s Reform Minister, said Brussels was “transforming vices into virtues” and “advancing the cause of atheism every day”.\nHe denounced the European arrest warrant\nas a step towards “dictatorship, deportation, and terror, instilling fear in the people, a crime in itself”. It would lead to a Stalinist regime “multiplied by 25”.\nI’ve written warnings about the EU on several occasions.  Now there are top European leaders warning you.  Remember how when you first learned about the Holocaust and you wondered how Adolf Hitler and the National Socialists could possibly have come to power without anyone protesting or doing anything about it?  Well, now you know.  I’m just curious.  Is it really better for a German government to team up with a French government in order to rule over Europe in a profoundly anti-democratic, freedom-hating manner than for a German government to militarily defeat a French government before teaming up with a second French government to rule over Europe in a profoundly anti-democratic, freedom-hating manner?  Many of the people of the so-called member states won’t even be permitted to vote on the national death warrant known as the European constitution.\nFascism is not dead.  The fascists were simply smart enough to abandon the swishy sado-masochistic uniforms, take their time and use politicians instead of panzers to take control over the people of Europe.  I suspect there are those in the United States government who realize this, which is why they are so\nconcerned about the threat\nthat the Euro Army poses to NATO.  Because if NATO is not there to keep the fascists new army under guard, it’s quite likely that one day the United States will be back in Europe, fighting that same army.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-24T12:27:00+00:00"
}