{
  "url": "https://voxday.net/2003/10/08/feeling-minnesota/",
  "scraped_at": "2025-12-13T15:30:09.103318",
  "title": "Feeling Minnesota",
  "date_display": "October 8, 2003",
  "date_iso": "2003-10-08T15:55:00+00:00",
  "date_from_url": "2003-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of the NFL, is anyone else beginning to smell a little 1998 in the air?  Almost every year, one team that failed to make the playoffs the previous year ends up in the Super Bowl, and the mighty Vikes finally appear to have a defense to pair with their high-octane offense.</p><p>The ironic thing about this black quarterback controversy is that the only apparent race-based decision that I’ve ever seen at the position was when Denny Green signed Randall Cunningham to a long-term contract and let Brad Johnson go.  I love Randall and I have nothing but the fondest memories of that magical 1998 season, but the small fact that his long and distinguished career was running on fumes at that point would have seemed to indicate that just <em>maybe </em>it might <em>possibly </em>make sense to keep the younger guy around.  And sure enough, much to Denny’s surprise, Randall’s wheels fell off the very next year.</p><p>But it worked out well for everyone in the end.  Randall got paid for an incredible year, Brad got his Super Bowl ring with Tampa, and now we’ve got Daunte.</p></div>",
  "content_text": "Speaking of the NFL, is anyone else beginning to smell a little 1998 in the air?  Almost every year, one team that failed to make the playoffs the previous year ends up in the Super Bowl, and the mighty Vikes finally appear to have a defense to pair with their high-octane offense.\nThe ironic thing about this black quarterback controversy is that the only apparent race-based decision that I’ve ever seen at the position was when Denny Green signed Randall Cunningham to a long-term contract and let Brad Johnson go.  I love Randall and I have nothing but the fondest memories of that magical 1998 season, but the small fact that his long and distinguished career was running on fumes at that point would have seemed to indicate that just\nmaybe\nit might\npossibly\nmake sense to keep the younger guy around.  And sure enough, much to Denny’s surprise, Randall’s wheels fell off the very next year.\nBut it worked out well for everyone in the end.  Randall got paid for an incredible year, Brad got his Super Bowl ring with Tampa, and now we’ve got Daunte.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-08T14:55:00+00:00"
}