{
  "url": "https://voxday.net/2003/10/19/firebird/",
  "scraped_at": "2025-12-13T15:31:06.674059",
  "title": "Firebird",
  "date_display": "October 19, 2003",
  "date_iso": "2003-10-19T09:27:00+00:00",
  "date_from_url": "2003-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m rather liking this <a href=\"http://www.mozilla.org/products/firebird/\">stripped-down version of Mozilla</a>.  For one thing, it’s now my blogging tool of choice, since it supports the Link, Bold and Italic panel buttons in Blogger as Opera and the version of Mozilla that came with Redhat 8 do not.  I still prefer Opera for general meandering about the web, but Firebird is a good second option.  It’s got some nice pop-up controls too.</p><p>Also, a little experimentation with <a href=\"http://rpm.pbone.net/index.php3/stat/4/idpl/676007/com/txt2pdbdoc-1.2.1-5.i586.rpm.html\">txt2pdbdoc</a> has turned out well, and while it is a command line deal, it’s a faster and easier way to convert text files into Palm docs than the Microsoft Word macro I was using before.  Supposedly it’s now up to version 1.4.2, but I haven’t been able to find a binary RPM for anything newer than 1.2.1.  It works fine, though, which reduces my list of required Windows functions down to three:</p><p>1)  Fantasy Football stattracks<br> <br>2)  Alphsmart Dana hotsync.  I couldn’t get this working under WINE, so this looks unlikely.<br> <br>3)  Java-related sundries</br></br></br></br></p><p>Of course, I’ll still be popping into Windows to play Combat Mission, but that’s not a big deal.  Windows will remain the standard interface for computer games for the foreseeable future.  The same was true for DOS long after Windows was introduced.</p></div>",
  "content_text": "I’m rather liking this\nstripped-down version of Mozilla\n.  For one thing, it’s now my blogging tool of choice, since it supports the Link, Bold and Italic panel buttons in Blogger as Opera and the version of Mozilla that came with Redhat 8 do not.  I still prefer Opera for general meandering about the web, but Firebird is a good second option.  It’s got some nice pop-up controls too.\nAlso, a little experimentation with\ntxt2pdbdoc\nhas turned out well, and while it is a command line deal, it’s a faster and easier way to convert text files into Palm docs than the Microsoft Word macro I was using before.  Supposedly it’s now up to version 1.4.2, but I haven’t been able to find a binary RPM for anything newer than 1.2.1.  It works fine, though, which reduces my list of required Windows functions down to three:\n1)  Fantasy Football stattracks\n2)  Alphsmart Dana hotsync.  I couldn’t get this working under WINE, so this looks unlikely.\n3)  Java-related sundries\nOf course, I’ll still be popping into Windows to play Combat Mission, but that’s not a big deal.  Windows will remain the standard interface for computer games for the foreseeable future.  The same was true for DOS long after Windows was introduced.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-19T08:27:00+00:00"
}