{
  "url": "https://voxday.net/2003/10/22/flaky-little-machine/",
  "scraped_at": "2025-12-13T15:31:33.478252",
  "title": "Flaky little machine",
  "date_display": "October 22, 2003",
  "date_iso": "2003-10-22T08:08:00+00:00",
  "date_from_url": "2003-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My Alphasmart Dana died yesterday.  Repeatedly turning off on her own, she couldn’t recognize her SD card for a minute there before conking out altogether.  She’s too flaky to even stay dead, though, as a hardware reset and hotsync – <em>Kardorto</em> – has restored her to seeming full health.  I get the feeling that she was protesting my repeated attempts to sync her under Linux.</p><p>It’s okay, baby… it’s okay.  If you want Windows, you can stick with Windows… for now.  In keeping with the theme, I’m reading Copeland’s <em>Microserfs</em> on her now.  Isilo is a little disappointing, as it doesn’t jump pages as inobtrusively as Palm Reader, so I switched back to Palm Reader.</p><p>You have to love a device with 30 hours of battery life, <a href=\"http://www.alphasmart.com/products/dana_overview.html\">a wide-screen and a full keyboard</a>.  Great for reading in bed and writing on the go.</p></div>",
  "content_text": "My Alphasmart Dana died yesterday.  Repeatedly turning off on her own, she couldn’t recognize her SD card for a minute there before conking out altogether.  She’s too flaky to even stay dead, though, as a hardware reset and hotsync –\nKardorto\n– has restored her to seeming full health.  I get the feeling that she was protesting my repeated attempts to sync her under Linux.\nIt’s okay, baby… it’s okay.  If you want Windows, you can stick with Windows… for now.  In keeping with the theme, I’m reading Copeland’s\nMicroserfs\non her now.  Isilo is a little disappointing, as it doesn’t jump pages as inobtrusively as Palm Reader, so I switched back to Palm Reader.\nYou have to love a device with 30 hours of battery life,\na wide-screen and a full keyboard\n.  Great for reading in bed and writing on the go.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-22T07:08:00+00:00"
}