{
  "url": "https://voxday.net/2003/10/24/following-to-freedo/",
  "scraped_at": "2025-12-13T15:31:50.166188",
  "title": "Following to Freedom",
  "date_display": "October 24, 2003",
  "date_iso": "2003-10-24T07:20:00+00:00",
  "date_from_url": "2003-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nine people have written to tell me that they decided to start their own Linux migrations after reading <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35163\">Breaking Up with Bill</a>, and one dealer informed me that he’s going to start encouraging his customers to make the move.  I think that’s great, since the growth from 1 percent to 2 percent is always harder than going from 10 percent to 20 percent.  Even more people told me that they’d like to make the move, but just weren’t ready yet.</p><p>I don’t know if we’re on the verge of another OS shift or not, but it’s fun to think that we might be.  I talked to a friend of mine who is an executive at a computer game company, and he’s open to the notion of Linux ports.  Once the game makers do that, the floodgates will open.  It’s really games that drives technology these days, and that’s been the little-known case for twelve years now.</p><p>By the way, Samba is shaking her thang on my local network now.  The instructions were a little more detailed and encyclopedic and a little less how-to than I would have liked, though.  And one thing I didn’t realize earlier is that the NTFS partition instructions actually caused Redhat to provide a icon link to my newly accessible hard drive – that’s pretty handy.</p><p>Next step – get WINE working</p></div>",
  "content_text": "Nine people have written to tell me that they decided to start their own Linux migrations after reading\nBreaking Up with Bill\n, and one dealer informed me that he’s going to start encouraging his customers to make the move.  I think that’s great, since the growth from 1 percent to 2 percent is always harder than going from 10 percent to 20 percent.  Even more people told me that they’d like to make the move, but just weren’t ready yet.\nI don’t know if we’re on the verge of another OS shift or not, but it’s fun to think that we might be.  I talked to a friend of mine who is an executive at a computer game company, and he’s open to the notion of Linux ports.  Once the game makers do that, the floodgates will open.  It’s really games that drives technology these days, and that’s been the little-known case for twelve years now.\nBy the way, Samba is shaking her thang on my local network now.  The instructions were a little more detailed and encyclopedic and a little less how-to than I would have liked, though.  And one thing I didn’t realize earlier is that the NTFS partition instructions actually caused Redhat to provide a icon link to my newly accessible hard drive – that’s pretty handy.\nNext step – get WINE working",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-24T06:20:00+00:00"
}