{
  "url": "https://voxday.net/2003/10/31/fooling-gender-genie/",
  "scraped_at": "2025-12-13T15:32:49.161837",
  "title": "Fooling the Gender Genie",
  "date_display": "October 31, 2003",
  "date_iso": "2003-10-31T10:05:00+00:00",
  "date_from_url": "2003-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The <a href=\"http://www.bookblog.net/gender/genie.html\">Gender Genie</a> purports to be able to identify the gender of a writer by their choice of words and phrases, but it’s pretty clear that it’s only accurate in that men tend to write more about things and ideas and women tend to write more about their feelings and relationships.  A man who writes about the latter or a female who writes about the former will likely be able to confuse it.  I ran my last three columns through it and it came up with the following results:</p><p><a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35278\">Shadows, Sex and Sorrow</a> = Female +36.4%<br> <br><a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35163\">Breaking up with Bill</a> = Female +9.3%<br> <br><a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35051\">The End of Art</a> = Male +19.9%</br></br></br></br></p><p>It did correctly identify a fiction short, though, as Male +16.8%.  It occurs to me that these gender tendencies may be why I so loathe women writing about sports.  Almost invariably, they tend to write about how the game affects them and their feelings, so their columns are devoted to how cheering for two different teams can pose a challenge to a relationship (McKendry), how other writer’s attitudes affect them personally (McKendry), how their knowledge of football can intimidate a man they are dating (Pressman), and then, you have the mystifying subject matter shear of how it feels to imitate Sarah Jessica Parker (Casey).</p><p>Meanwhile, the male writers are writing about who should get into the Hall of Fame (Dr. Z), who will be the best rookie wide receivers this year (Ralph Wiley), which team is blowing its salary cap (Pasquerelli), and how the Red Sox losing makes him sad (Simmons).  Of course, the Sports Guy is clearly a bit of a girl from time to time – after all, he not only watches the Oscars, but keeps a running diary on them.  Still, to be fair, his usual motif is massive multipart prognostications on how the various NFL/NBA/MLB teams will do in the coming season.  Not to mention even longer pieces devoted to the seasonal fantasy drafts.  And diaries of the actual professional drafts.  A lot more snails and puppy dog tails than sugar-and-spice, actually, if you consider his entire <em>oeuvre.</em></p><p>This subjective/objective dichotomy reminds me of a girl I dated long ago, a model who tended to attract an amount of attention wherever she went.  I realized I couldn’t keep seeing her when we met up at a nightclub one night after having hit different establishments earlier in the evening.  When I asked her how Club X had been – in other words, were there a lot of people there, was it fun, is it hopping tonight, should we go there later – she answered with an encyclopedic litany of who had noticed her and exactly how they had reacted to her.  At the end of her recitation, I had no more information about the question I’d asked than before she opened her mouth.  That brief glimpse into the yawning horror of life with someone who believes that the entire universe is nothing more than a mirror encouraged me to run, not walk, out of that relationship.</p><p>She was an extreme example of total narcissism, of course.  But just as it behooves male writers to open up from time to time and allow their readers to learn more about them as human beings, I think it would also be a good thing if female writers – especially female sportswriters – would keep in mind that the subjects about which they are supposed to be writing generally have very little to do with them and their feelings.</p></div>",
  "content_text": "The\nGender Genie\npurports to be able to identify the gender of a writer by their choice of words and phrases, but it’s pretty clear that it’s only accurate in that men tend to write more about things and ideas and women tend to write more about their feelings and relationships.  A man who writes about the latter or a female who writes about the former will likely be able to confuse it.  I ran my last three columns through it and it came up with the following results:\nShadows, Sex and Sorrow\n= Female +36.4%\nBreaking up with Bill\n= Female +9.3%\nThe End of Art\n= Male +19.9%\nIt did correctly identify a fiction short, though, as Male +16.8%.  It occurs to me that these gender tendencies may be why I so loathe women writing about sports.  Almost invariably, they tend to write about how the game affects them and their feelings, so their columns are devoted to how cheering for two different teams can pose a challenge to a relationship (McKendry), how other writer’s attitudes affect them personally (McKendry), how their knowledge of football can intimidate a man they are dating (Pressman), and then, you have the mystifying subject matter shear of how it feels to imitate Sarah Jessica Parker (Casey).\nMeanwhile, the male writers are writing about who should get into the Hall of Fame (Dr. Z), who will be the best rookie wide receivers this year (Ralph Wiley), which team is blowing its salary cap (Pasquerelli), and how the Red Sox losing makes him sad (Simmons).  Of course, the Sports Guy is clearly a bit of a girl from time to time – after all, he not only watches the Oscars, but keeps a running diary on them.  Still, to be fair, his usual motif is massive multipart prognostications on how the various NFL/NBA/MLB teams will do in the coming season.  Not to mention even longer pieces devoted to the seasonal fantasy drafts.  And diaries of the actual professional drafts.  A lot more snails and puppy dog tails than sugar-and-spice, actually, if you consider his entire\noeuvre.\nThis subjective/objective dichotomy reminds me of a girl I dated long ago, a model who tended to attract an amount of attention wherever she went.  I realized I couldn’t keep seeing her when we met up at a nightclub one night after having hit different establishments earlier in the evening.  When I asked her how Club X had been – in other words, were there a lot of people there, was it fun, is it hopping tonight, should we go there later – she answered with an encyclopedic litany of who had noticed her and exactly how they had reacted to her.  At the end of her recitation, I had no more information about the question I’d asked than before she opened her mouth.  That brief glimpse into the yawning horror of life with someone who believes that the entire universe is nothing more than a mirror encouraged me to run, not walk, out of that relationship.\nShe was an extreme example of total narcissism, of course.  But just as it behooves male writers to open up from time to time and allow their readers to learn more about them as human beings, I think it would also be a good thing if female writers – especially female sportswriters – would keep in mind that the subjects about which they are supposed to be writing generally have very little to do with them and their feelings.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-31T10:05:00+00:00"
}