{
  "url": "https://voxday.net/2003/10/30/free-state/",
  "scraped_at": "2025-12-13T15:32:40.690802",
  "title": "Free State",
  "date_display": "October 30, 2003",
  "date_iso": "2003-10-30T11:44:00+00:00",
  "date_from_url": "2003-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>I have been searching your blog for your thoughts on the freestateproject.org;  are there any?</em></p><p>I am certainly a supporter of the <a href=\"http://freestateproject.org/\">Free State Project</a>.  I think it is one of the few freedom-loving organizations that stands any chance of making a difference – or at least helping people avoid some of the consequences – as the country continues in its long tailspin towards socialist crisis.  I think Jason Sorens’ conception of the project was brilliant and I also believe that the choice of New Hampshire was optimal.  When I first heard about it, I assumed that they’d go to New Hampshire, but it’s better that everyone had a chance to contribute to the debate and thus ensure mental buy-in.</p><p>Will I go there myself?  Quite possibly, if only to support the cause of American liberty.  New Hampshire’s pretty easy for me, too, as I’ve had family living there and am pretty familiar with it.</p></div>",
  "content_text": "I have been searching your blog for your thoughts on the freestateproject.org;  are there any?\nI am certainly a supporter of the\nFree State Project\n.  I think it is one of the few freedom-loving organizations that stands any chance of making a difference – or at least helping people avoid some of the consequences – as the country continues in its long tailspin towards socialist crisis.  I think Jason Sorens’ conception of the project was brilliant and I also believe that the choice of New Hampshire was optimal.  When I first heard about it, I assumed that they’d go to New Hampshire, but it’s better that everyone had a chance to contribute to the debate and thus ensure mental buy-in.\nWill I go there myself?  Quite possibly, if only to support the cause of American liberty.  New Hampshire’s pretty easy for me, too, as I’ve had family living there and am pretty familiar with it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-30T11:44:00+00:00"
}