{
  "url": "https://voxday.net/2003/10/31/grokking-microsofts-waterloo/",
  "scraped_at": "2025-12-13T15:32:52.475173",
  "title": "Grokking Microsoft’s Waterloo",
  "date_display": "October 31, 2003",
  "date_iso": "2003-10-31T18:58:00+00:00",
  "date_from_url": "2003-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>The GPL is their downfall. It’s almost amusing watching them get all tangled up in its terms. They can’t satisfy their greed and abide by the GPL at the same time. Poor SCO. Poor Microsoft. They will have to write their own software, and they can’t. They write it, but it isn’t as good. They can’t match our software because they won’t use our method. The open source/free method of developing software results in better, more stable, more secure code, and it’s developed blazingly fast in comparision to their pokey ways. They want the results, but they’re so terrified of the open process, they won’t use it. The apparent solution they have come up with is to steal GPL code. Maybe they think if they can get it put in the public domain, not that they can, then maybe Windows software will finally become secure, once it’s running on Linux, like Apple runs on BSD.</em> – Groklaw</p><p>How is <a href=\"http://www.groklaw.net/article.php?story=20031029191055995\">this guy not a lawyer</a> yet?  For those – the vast majority across the globe – who haven’t been following the SCO debacle, I’ll explain it briefly and almost surely more than a little inaccurately.  But you’ll grasp the point.</p><p>1.  The GPL is the license that allows anyone to use a large library free open source code, as long as they freely release the source code that they subsequently derive from it.<br> <br>2.  GPL code is very good, and many corporations want to use it.<br> <br>3.  They don’t want to abide by the GPL, however.  But they are scared sans fecal matter since they also are trying to sell their software in competition with the free GPL software which in many cases is arguably better.  This is Microsoft, in case you haven’t guessed, by the way.<br> <br>5.  SCO received a big investment from Microsoft in order to act as its sock puppet and attack the GPL in court, arguing that it is not legally valid and therefore they can use GPL code without having to operate under its restrictions.  Some of the parties to the lawsuit SCO has brought <em>includes their own customers!</em></br></br></br></br></br></br></p><p>Keep in mind that every bit of Microsoft software is licensed, which, if you read the fine print, means that even though you paid for it, it isn’t yours, it’s theirs, unless it breaks something or causes you to suffer some kind of damage, in which case the liability is yours – although you can sue them for the princely sum of $5 at which point your damages are capped.  That license, of course, is considered Holy Writ, but a license that says: here, it’s free, you can use it if you want it, but you have to release anything derived from it under the same license, that is apparently unenforceable, null and void.</p><p>Why?  Well, because it prevents Microsoft from making large sums of money off other people’s intellectual property!  Considering that they’ve been doing it that way from the very beginning, no wonder Bill and company are having a hard time understanding that they won’t be able to do it here.</p></div>",
  "content_text": "The GPL is their downfall. It’s almost amusing watching them get all tangled up in its terms. They can’t satisfy their greed and abide by the GPL at the same time. Poor SCO. Poor Microsoft. They will have to write their own software, and they can’t. They write it, but it isn’t as good. They can’t match our software because they won’t use our method. The open source/free method of developing software results in better, more stable, more secure code, and it’s developed blazingly fast in comparision to their pokey ways. They want the results, but they’re so terrified of the open process, they won’t use it. The apparent solution they have come up with is to steal GPL code. Maybe they think if they can get it put in the public domain, not that they can, then maybe Windows software will finally become secure, once it’s running on Linux, like Apple runs on BSD.\n– Groklaw\nHow is\nthis guy not a lawyer\nyet?  For those – the vast majority across the globe – who haven’t been following the SCO debacle, I’ll explain it briefly and almost surely more than a little inaccurately.  But you’ll grasp the point.\n1.  The GPL is the license that allows anyone to use a large library free open source code, as long as they freely release the source code that they subsequently derive from it.\n2.  GPL code is very good, and many corporations want to use it.\n3.  They don’t want to abide by the GPL, however.  But they are scared sans fecal matter since they also are trying to sell their software in competition with the free GPL software which in many cases is arguably better.  This is Microsoft, in case you haven’t guessed, by the way.\n5.  SCO received a big investment from Microsoft in order to act as its sock puppet and attack the GPL in court, arguing that it is not legally valid and therefore they can use GPL code without having to operate under its restrictions.  Some of the parties to the lawsuit SCO has brought\nincludes their own customers!\nKeep in mind that every bit of Microsoft software is licensed, which, if you read the fine print, means that even though you paid for it, it isn’t yours, it’s theirs, unless it breaks something or causes you to suffer some kind of damage, in which case the liability is yours – although you can sue them for the princely sum of $5 at which point your damages are capped.  That license, of course, is considered Holy Writ, but a license that says: here, it’s free, you can use it if you want it, but you have to release anything derived from it under the same license, that is apparently unenforceable, null and void.\nWhy?  Well, because it prevents Microsoft from making large sums of money off other people’s intellectual property!  Considering that they’ve been doing it that way from the very beginning, no wonder Bill and company are having a hard time understanding that they won’t be able to do it here.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-31T18:58:00+00:00"
}