{
  "url": "https://voxday.net/2003/10/20/how-to-escape-from-windows/",
  "scraped_at": "2025-12-13T15:31:17.015488",
  "title": "How to escape from Windows",
  "date_display": "October 20, 2003",
  "date_iso": "2003-10-20T17:00:00+00:00",
  "date_from_url": "2003-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>1. First, figure out what your primary applications are.  For most people, this involves little more than email, surfing and word processing, in which case you’re good.  If you have other, more esoteric applications which you regularly use, do  a little research to make sure it, or a reasonable equivalent, run under Linux.  For example, plenty of Palm devices work with Linux, but my <a href=\"http://www.alphasmart.com/products/dana_overview.html\">Alphasmart Dana</a> does not, so I’m stuck with ducking my head back into Windows twice a week to hotsync it.</p><p>2. Choose your Linux distro.  I recommend <a href=\"http://www.redhat.com/download/products.html\">Redhat 9</a> for those escaping out of Windows for the first time.  Download the ISO files and burn the three CDs, buy it, score it from a friend, whatever suits your style.</p><p>3. Investigate support for your internet connection.  Confirming <a href=\"http://www.linux-wlan.org/docs/wlan_adapters.html\">specific wireless network card support</a> is particularly important, since Linksys is terrible about identifying the differences between its models and versions.  For example, versions 2, 2.5 and 3 of the WPC-11 run with Linux, while version 4 doesn’t.   Version 2.5 of the WUSB-11 runs with  Linux, version 2.6 does not.  This is because the new versions have entirely different chipsets – they’re entirely different products with the same name.</p><p>4. Buy the appropriate card/modem, if necessary, and <a href=\"http://prism2.unixguru.raleigh.nc.us/\">download the specified packages</a>.  Read the directions and the readme to determine which three packages to download, and always follow the directions precisely!  Linux information is written by programmers, not technical writers, so it is usually maddeningly incomplete, but almost always precise.  There is usually a reason for doing things exactly the way they tell you, though they seldom explain why or how to go about doing it.   (Example – they will tell you to “install package X”; they will never say “double-click on the RPM file you downloaded to install package X”.)</p><p>5. Put the first Linux CD in the drive and restart your computer.  Watch the screen closely – you may need to hit F2 during the pre-Windows setup phase in order to tell your machine to boot off the CD instead of the hard drive.  Choose the dual-boot option.</p><p>6. Follow the install directions.  The only real decision involved regards how to divide your hard drive partitions.  I think three partitions is a good way to start – have the first (hda1) be NTFS for your Windows boot drive, the second (hda2) EXT3 for Linux, and the third (hda3) FAT for a shared partition that you can access from both Windows and Linux and use to transfer files.  Since you’ll be working more in Linux, plan to devote more space to the second and third partitions.</p><p>7. Write down your passwords, both for root and your username.  Remember that it’s better to be logged on as username most of the time, not root.  You can give yourself root permissions whenever you need to – usually you’ll be prompted.  If not, open a terminal window, type su, and you will be asked for the root’s password.</p><p>8. Restart, choose DOS, then copy the three RPM packages you downloaded for the wireless card drivers onto the third drive.  Do NOT reformat the second drive, which Windows can’t read.  That’s your Linux drive.  Restart and choose Linux this time.</p><p>9. Now that you’re into Linux, you still need to mount your third partition so you can read it and write to it.  Note that you won’t be thinking of it as D: or whatever anymore, but as /mnt/winlinux or whatever you decide to call it.  It’s not too hard, <a href=\"http://www.redhat.com/docs/manuals/linux/RHL-9-Manual/getting-started-guide/s1-q-and-a-windows.html\">here’s how</a>.</p><p>10. Now it’s time to tackle the Internet connection.  If you have a Linksys card and you went with Redhat 9, then find those three RPM packages on your WinLinux partition – just double-click on them or right-click and choose Open With, then Install Packages – and let the installer do its thing.  Don’t expect any messages or confirmations, just insert your PCMCIA card when it’s done and fire up Internet / Web Browser from the Redhat Start menus.  It will start Mozilla, and if it works, you’ll be online.</p><p>11. Once you’re up and running on the Internet, <a href=\"http://www.ximian.com/products/redcarpet/\">download Red Carpet</a> from Ximian.  This is a package installation tool that is very helpful in resolving package interdependency problems.  Not all software programs are tied in with this very useful tool, but it is so useful that you may find yourself sticking with older versions simply because the new versions aren’t incorporated into Red Carpet yet.  To run Red Carpet, select System Tools – Terminal from the Red Hat start menus, type red-carpet at the prompt, and enter your root password.  Do your updates through Red Carpet and the Red Hat channel, not the Red Hat update agent.</p><p>12. Use Red Carpet to upgrade to the latest version of Evolution.  Grab Pan, too, if you’re a newsgroup junkie. <em>(Reader PB points out that there are over 530 Linux Users Groups <a href=\"http://lugww.counter.li.org\">where you can find help</a>, including 45 on Usenet.)</em></p><p>13. If you need PDF capability, note that there’s some complexity to the installation of <a href=\"http://neomundi.com.br/usuarios/mab/redhat8_en.html\">Acrobat Reader</a>.  Unfortunately, although you can create PDF files with OpenOffice, you can’t read them.  Download the acroread RPM, and follow the <a href=\"http://www.macewan.org/howto/acroread_on_redhat_8.html\">installation instructions</a>.  Be careful in vi, it doesn’t operate like Notepad or Word.  Press i before inserting any text, then hit ESC to exit insertion mode before typing ZZ to quit and save.</p><p>14. Celebrate.  You are now <a href=\"http://www.spack.org/index.cgi/InTheBeginningWasTheCommandLine#head-5e1cc52ee9dc9b01ec3e086a2ff90add329a43a7\"> driving the tank</a>.</p><p>I’m no Linux expert.  I still don’t have my Java Run-time Environment working yet and there are a panoply of basic functions of which I remain ignorant.  But I’m out, I’m up and I’m running, and if I can do it, you can too.</p></div>",
  "content_text": "1. First, figure out what your primary applications are.  For most people, this involves little more than email, surfing and word processing, in which case you’re good.  If you have other, more esoteric applications which you regularly use, do  a little research to make sure it, or a reasonable equivalent, run under Linux.  For example, plenty of Palm devices work with Linux, but my\nAlphasmart Dana\ndoes not, so I’m stuck with ducking my head back into Windows twice a week to hotsync it.\n2. Choose your Linux distro.  I recommend\nRedhat 9\nfor those escaping out of Windows for the first time.  Download the ISO files and burn the three CDs, buy it, score it from a friend, whatever suits your style.\n3. Investigate support for your internet connection.  Confirming\nspecific wireless network card support\nis particularly important, since Linksys is terrible about identifying the differences between its models and versions.  For example, versions 2, 2.5 and 3 of the WPC-11 run with Linux, while version 4 doesn’t.   Version 2.5 of the WUSB-11 runs with  Linux, version 2.6 does not.  This is because the new versions have entirely different chipsets – they’re entirely different products with the same name.\n4. Buy the appropriate card/modem, if necessary, and\ndownload the specified packages\n.  Read the directions and the readme to determine which three packages to download, and always follow the directions precisely!  Linux information is written by programmers, not technical writers, so it is usually maddeningly incomplete, but almost always precise.  There is usually a reason for doing things exactly the way they tell you, though they seldom explain why or how to go about doing it.   (Example – they will tell you to “install package X”; they will never say “double-click on the RPM file you downloaded to install package X”.)\n5. Put the first Linux CD in the drive and restart your computer.  Watch the screen closely – you may need to hit F2 during the pre-Windows setup phase in order to tell your machine to boot off the CD instead of the hard drive.  Choose the dual-boot option.\n6. Follow the install directions.  The only real decision involved regards how to divide your hard drive partitions.  I think three partitions is a good way to start – have the first (hda1) be NTFS for your Windows boot drive, the second (hda2) EXT3 for Linux, and the third (hda3) FAT for a shared partition that you can access from both Windows and Linux and use to transfer files.  Since you’ll be working more in Linux, plan to devote more space to the second and third partitions.\n7. Write down your passwords, both for root and your username.  Remember that it’s better to be logged on as username most of the time, not root.  You can give yourself root permissions whenever you need to – usually you’ll be prompted.  If not, open a terminal window, type su, and you will be asked for the root’s password.\n8. Restart, choose DOS, then copy the three RPM packages you downloaded for the wireless card drivers onto the third drive.  Do NOT reformat the second drive, which Windows can’t read.  That’s your Linux drive.  Restart and choose Linux this time.\n9. Now that you’re into Linux, you still need to mount your third partition so you can read it and write to it.  Note that you won’t be thinking of it as D: or whatever anymore, but as /mnt/winlinux or whatever you decide to call it.  It’s not too hard,\nhere’s how\n.\n10. Now it’s time to tackle the Internet connection.  If you have a Linksys card and you went with Redhat 9, then find those three RPM packages on your WinLinux partition – just double-click on them or right-click and choose Open With, then Install Packages – and let the installer do its thing.  Don’t expect any messages or confirmations, just insert your PCMCIA card when it’s done and fire up Internet / Web Browser from the Redhat Start menus.  It will start Mozilla, and if it works, you’ll be online.\n11. Once you’re up and running on the Internet,\ndownload Red Carpet\nfrom Ximian.  This is a package installation tool that is very helpful in resolving package interdependency problems.  Not all software programs are tied in with this very useful tool, but it is so useful that you may find yourself sticking with older versions simply because the new versions aren’t incorporated into Red Carpet yet.  To run Red Carpet, select System Tools – Terminal from the Red Hat start menus, type red-carpet at the prompt, and enter your root password.  Do your updates through Red Carpet and the Red Hat channel, not the Red Hat update agent.\n12. Use Red Carpet to upgrade to the latest version of Evolution.  Grab Pan, too, if you’re a newsgroup junkie.\n(Reader PB points out that there are over 530 Linux Users Groups\nwhere you can find help\n, including 45 on Usenet.)\n13. If you need PDF capability, note that there’s some complexity to the installation of\nAcrobat Reader\n.  Unfortunately, although you can create PDF files with OpenOffice, you can’t read them.  Download the acroread RPM, and follow the\ninstallation instructions\n.  Be careful in vi, it doesn’t operate like Notepad or Word.  Press i before inserting any text, then hit ESC to exit insertion mode before typing ZZ to quit and save.\n14. Celebrate.  You are now\ndriving the tank\n.\nI’m no Linux expert.  I still don’t have my Java Run-time Environment working yet and there are a panoply of basic functions of which I remain ignorant.  But I’m out, I’m up and I’m running, and if I can do it, you can too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-20T16:00:00+00:00"
}