{
  "url": "https://voxday.net/2003/10/11/i-am-penguin/",
  "scraped_at": "2025-12-13T15:30:23.819181",
  "title": "I am the Penguin",
  "date_display": "October 11, 2003",
  "date_iso": "2003-10-11T14:20:00+00:00",
  "date_from_url": "2003-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am he as you are we etc etc whatever…. <strong>HOLY CATS IT WORKED!</strong> I’m actually posting this from my dual-boot machine running Linux, accessing the Internet via my wireless network which is now also running happily as a hamster under Linux.  I was so psyched I had to call my best friend, who is a bona fide stud programmer and approximately 500x more technical than I am, and he was just as fired up despite the fact that he was taking the call in a wet, naked and half-showered state.  He’s been contemplating going Penguin himself, and now that I’ve achieved exit velocity, he has no choice but to follow suit if he wishes to preserve the tattered remnants of his techno-manhood.</p><p>It turns out that the trick was to ignore the linux-wlan-ng download that pops up on most Google searches and go with the <a href=\"http://prism2.unixguru.raleigh.nc.us/\">preconfigured packages</a> (RPMS)  put together for the Red Hat distros by an RPM packager in Raleigh, Tim Miller, who I will soon be recommending to the Vatican for beatification.</p><p>Make sure you read the README, and keep in mind that as usual, the programmer/guru tells you everything you need to know, but not exactly what you need to do or what you should expect.  I would add the following directions:</p><p>1.  Figure out which version and kernel of Red Hat you’re running.  Do this by firing up a terminal (<em>System Tools / Terminal</em>) and typing <em>cat /proc/version</em>.<br> <br>2.  Click on the appropriate Red Hat version (7.3, 8, or 9) found under <strong>Serve up the packages!</strong> Download the appropriate three packages, as indicated by your wireless card/adapter and kernel number.<br> <br>3.  Install each package separately.  Do this by finding where you saved the RPM files, then right-clicking on the first file.  Select <em>Open With</em>, then <em>Install Packages</em>.  Click continue to complete the installation of the package.  You’ll do this three times, once for each package.<br> <br>4.  Edit the file as directed in the README.  It’s just the one change in the first file, followed by the renaming of the second file.<br> <br>5.  Stick your PCMCIA card in.  Don’t reboot or anything, and don’t expect a happy little beep or a message telling you that new hardware has been found.  Nothing happens.<br> <br>6.  Fire up Mozilla – <em>Internet/Web Browser </em>– then type in a web address.  Watch in shock and delight as it actually appears.<br> <br>7.  Phone your friends.  Post on your blog.  Cackle madly and gesture rudely in the direction of Redmond.<br> <br>8.  Celebrate.  You’re driving the tank!</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "I am he as you are we etc etc whatever….\nHOLY CATS IT WORKED!\nI’m actually posting this from my dual-boot machine running Linux, accessing the Internet via my wireless network which is now also running happily as a hamster under Linux.  I was so psyched I had to call my best friend, who is a bona fide stud programmer and approximately 500x more technical than I am, and he was just as fired up despite the fact that he was taking the call in a wet, naked and half-showered state.  He’s been contemplating going Penguin himself, and now that I’ve achieved exit velocity, he has no choice but to follow suit if he wishes to preserve the tattered remnants of his techno-manhood.\nIt turns out that the trick was to ignore the linux-wlan-ng download that pops up on most Google searches and go with the\npreconfigured packages\n(RPMS)  put together for the Red Hat distros by an RPM packager in Raleigh, Tim Miller, who I will soon be recommending to the Vatican for beatification.\nMake sure you read the README, and keep in mind that as usual, the programmer/guru tells you everything you need to know, but not exactly what you need to do or what you should expect.  I would add the following directions:\n1.  Figure out which version and kernel of Red Hat you’re running.  Do this by firing up a terminal (\nSystem Tools / Terminal\n) and typing\ncat /proc/version\n.\n2.  Click on the appropriate Red Hat version (7.3, 8, or 9) found under\nServe up the packages!\nDownload the appropriate three packages, as indicated by your wireless card/adapter and kernel number.\n3.  Install each package separately.  Do this by finding where you saved the RPM files, then right-clicking on the first file.  Select\nOpen With\n, then\nInstall Packages\n.  Click continue to complete the installation of the package.  You’ll do this three times, once for each package.\n4.  Edit the file as directed in the README.  It’s just the one change in the first file, followed by the renaming of the second file.\n5.  Stick your PCMCIA card in.  Don’t reboot or anything, and don’t expect a happy little beep or a message telling you that new hardware has been found.  Nothing happens.\n6.  Fire up Mozilla –\nInternet/Web Browser\n– then type in a web address.  Watch in shock and delight as it actually appears.\n7.  Phone your friends.  Post on your blog.  Cackle madly and gesture rudely in the direction of Redmond.\n8.  Celebrate.  You’re driving the tank!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-11T13:20:00+00:00"
}