{
  "url": "https://voxday.net/2003/10/18/its-official-espn-blows/",
  "scraped_at": "2025-12-13T15:31:03.346830",
  "title": "It’s official – ESPN blows",
  "date_display": "October 18, 2003",
  "date_iso": "2003-10-18T20:05:00+00:00",
  "date_from_url": "2003-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They fired TMQ.  What a bunch of small-minded control freaks.  I wonder if it ever occurs to anyone that firing everyone who says anything the least bit critical of individuals who happen to be Jewish is probably not the best way to convince the <em>Judenhassen</em> that Jews are not, in fact, <a href=\"http://www.usatoday.com/news/world/2003-10-16-malaysia-summit_x.htm\">running everything</a>.</p><p>I’m done with ESPN.  Half of Page 2 has already been converted to stupid Hollywood junk and whiny women complaining that they can’t get dates because they know too much about sports.  Right, that’s probably it.  They ought to just change the name to Page E-IX and have done with it.  Let ESPN know <a href=\"http://espn.go.com/sitetools/s/contact/espn.com.html\"> what you think</a>.  I did.</p><p>Just one more reason to despise Disney.  In truth, I believe this contemptible firing had more to do with Easterbrook daring to criticize Disney’s chairman than it did with anything relating to Judaism.</p></div>",
  "content_text": "They fired TMQ.  What a bunch of small-minded control freaks.  I wonder if it ever occurs to anyone that firing everyone who says anything the least bit critical of individuals who happen to be Jewish is probably not the best way to convince the\nJudenhassen\nthat Jews are not, in fact,\nrunning everything\n.\nI’m done with ESPN.  Half of Page 2 has already been converted to stupid Hollywood junk and whiny women complaining that they can’t get dates because they know too much about sports.  Right, that’s probably it.  They ought to just change the name to Page E-IX and have done with it.  Let ESPN know\nwhat you think\n.  I did.\nJust one more reason to despise Disney.  In truth, I believe this contemptible firing had more to do with Easterbrook daring to criticize Disney’s chairman than it did with anything relating to Judaism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-18T19:05:00+00:00"
}