{
  "url": "https://voxday.net/2003/10/15/jew-haters-at-state/",
  "scraped_at": "2025-12-13T15:30:41.048777",
  "title": "Jew haters at State",
  "date_display": "October 15, 2003",
  "date_iso": "2003-10-15T15:00:00+00:00",
  "date_from_url": "2003-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is simply no excuse for <a href=\"http://www.state.gov/p/nea/ci/c2419.htm\">this intentional slight </a> of Israel.  Thanks to DG, who brought this State Department map of Saudi Arabia to my attention.  Notice how State was able to find space for labeling the tiny little island of Bahrain, but somehow, they just couldn’t fit the six letters that make up the name of the only Jewish country in the vicinity on the map.</p><p>I am not Jewish.  I am not particularly fond of Jewish culture.  I dislike the quasi-socialism that has made up Israeli government policy for the entirety of its existence.  But I have nothing but contempt for the Arabists at State, who would like to help their murderous proxies finish what the National Socialists started by wiping out what they consider to be a “s—– little country”.</p><p>There has got to be a spiritual component to this irrational, illogical Jew hatred.  There’s simply no other credible explanation for two millenia of rabid cross-cultural antipathy.</p></div>",
  "content_text": "There is simply no excuse for\nthis intentional slight\nof Israel.  Thanks to DG, who brought this State Department map of Saudi Arabia to my attention.  Notice how State was able to find space for labeling the tiny little island of Bahrain, but somehow, they just couldn’t fit the six letters that make up the name of the only Jewish country in the vicinity on the map.\nI am not Jewish.  I am not particularly fond of Jewish culture.  I dislike the quasi-socialism that has made up Israeli government policy for the entirety of its existence.  But I have nothing but contempt for the Arabists at State, who would like to help their murderous proxies finish what the National Socialists started by wiping out what they consider to be a “s—– little country”.\nThere has got to be a spiritual component to this irrational, illogical Jew hatred.  There’s simply no other credible explanation for two millenia of rabid cross-cultural antipathy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-15T14:00:00+00:00"
}