{
  "url": "https://voxday.net/2003/10/25/keep-god-out-and-let-hollywood-in/",
  "scraped_at": "2025-12-13T15:32:03.750723",
  "title": "Keep God out and let Hollywood in",
  "date_display": "October 25, 2003",
  "date_iso": "2003-10-25T12:50:00+00:00",
  "date_from_url": "2003-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s a cheerful story for everyone who still has any doubts about <a href=\"http://story.news.yahoo.com/news?tmpl=story&amp;u=/ap/20031023/ap_on_hi_te/anti_piracy_lessons_1\">the brainwashing element</a> of the public school system.  Don’t read.  Don’t think.  Take your test, accept your assigned place and be a good little cog in the socialist corporasphere.  And if you’re not clear on the difference between a good little consumer and a bad little consumer, the MPAA, with the aid of Junior Achievement, will send special teachers to your elementary or junior high school to make sure you know right from wrong.</p><p>Not that there’s any such thing as right and wrong.  All morals are relative.  Except for what the people responsible for murderous bloodbaths such as <em>The Texas Chainsaw Massacre</em> and <em>Kill Bill</em> tell you, that is.</p><p>“We’re really trying to teach young people to be responsible and to obey laws that they may not understand,” said David Chernow, Junior Achievement’s chief executive, apparently oblivious to the fact that children from <em>5th to 9th grade</em> are seldom considered to be experts in intellectual property law.</p><p>Teach them to obey laws they don’t understand.  Yes, that sums it up nicely.</p></div>",
  "content_text": "Here’s a cheerful story for everyone who still has any doubts about\nthe brainwashing element\nof the public school system.  Don’t read.  Don’t think.  Take your test, accept your assigned place and be a good little cog in the socialist corporasphere.  And if you’re not clear on the difference between a good little consumer and a bad little consumer, the MPAA, with the aid of Junior Achievement, will send special teachers to your elementary or junior high school to make sure you know right from wrong.\nNot that there’s any such thing as right and wrong.  All morals are relative.  Except for what the people responsible for murderous bloodbaths such as\nThe Texas Chainsaw Massacre\nand\nKill Bill\ntell you, that is.\n“We’re really trying to teach young people to be responsible and to obey laws that they may not understand,” said David Chernow, Junior Achievement’s chief executive, apparently oblivious to the fact that children from\n5th to 9th grade\nare seldom considered to be experts in intellectual property law.\nTeach them to obey laws they don’t understand.  Yes, that sums it up nicely.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-25T11:50:00+00:00"
}