{
  "url": "https://voxday.net/2003/10/31/lighter-fluid-or-paint-thinner/",
  "scraped_at": "2025-12-13T15:32:47.682560",
  "title": "Lighter fluid or paint thinner?",
  "date_display": "October 31, 2003",
  "date_iso": "2003-10-31T08:49:00+00:00",
  "date_from_url": "2003-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bad enough that ESPN fired Tuesday Morning Quarterback Gregg Easterbrook, one of the more amusing writers dedicated to the NFL, for the sin of criticizing Michael “my evil plan to destroy Disney is working, ha ha ha!” Eisner and his role in pushing a carnucopia of gore on America.  Unbe-freaking-lievable is that they replaced him with a little blonde girl who writes about <a href=\"http://msn.espn.go.com/page2/s/casey/031029.html\">riding the trapeze</a> in New York City.  Just like Sarah Jessica Parker in Sex in the City!  Eek!</p><p>[insert expression containing roughly balanced degrees of vulgarity and disbelief here]</p><p>Did I miss it, or did ESPN hire its new web editor from Chick Flick magazine?  This is akin to having Dr. Z write a hard-core article on offensive line blocking schemes for Cosmopolitan.  Chris McKendry was highly annoying at times, but at least she knew a bit about sports.  Now we’ve got Stacy Pressman and some older woman writing about their dating mishaps, a dork making lists about Hollywood actors, and now a girl living out her dream to recreate Sex in the City scenes. <a href=\"http://sports.espn.go.com/espn/archive?columnist=simmons_bill&amp;root=page2\">Bill Simmons</a> – now, with Ralph Wiley, officially the only good thing about Page 2 – is no doubt debating whether he should use lighter fluid or paint thinner to set himself on fire.</p></div>",
  "content_text": "Bad enough that ESPN fired Tuesday Morning Quarterback Gregg Easterbrook, one of the more amusing writers dedicated to the NFL, for the sin of criticizing Michael “my evil plan to destroy Disney is working, ha ha ha!” Eisner and his role in pushing a carnucopia of gore on America.  Unbe-freaking-lievable is that they replaced him with a little blonde girl who writes about\nriding the trapeze\nin New York City.  Just like Sarah Jessica Parker in Sex in the City!  Eek!\n[insert expression containing roughly balanced degrees of vulgarity and disbelief here]\nDid I miss it, or did ESPN hire its new web editor from Chick Flick magazine?  This is akin to having Dr. Z write a hard-core article on offensive line blocking schemes for Cosmopolitan.  Chris McKendry was highly annoying at times, but at least she knew a bit about sports.  Now we’ve got Stacy Pressman and some older woman writing about their dating mishaps, a dork making lists about Hollywood actors, and now a girl living out her dream to recreate Sex in the City scenes.\nBill Simmons\n– now, with Ralph Wiley, officially the only good thing about Page 2 – is no doubt debating whether he should use lighter fluid or paint thinner to set himself on fire.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-31T08:49:00+00:00"
}