{
  "url": "https://voxday.net/2003/10/18/linux-and-acrobat-reader/",
  "scraped_at": "2025-12-13T15:31:01.887982",
  "title": "Linux and Acrobat Reader",
  "date_display": "October 18, 2003",
  "date_iso": "2003-10-18T19:10:00+00:00",
  "date_from_url": "2003-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://neomundi.com.br/usuarios/mab/redhat8_en.html\">Acrobat Reader</a> is a virtual necessity if you want to read PDF files, so I was surprised at the shoddy level of Linux support by Adobe.  I fully expected it to be available via Red Carpet or the Redhat Update Agent, but barring that, I was anticipating an easy RPM installation at the very least.  That proved not to be the case, as I got what proves to be a very normal error when trying to run it on Redhat 8:</p><p><em>$ acroread</em></p><p>Warning: charset “UTF-8” not supported, using “ISO8859-1”.</p><p>Aborted</p><p>Fortunately, and this is one of the things I love about Linux, someone has <a href=\"http://www.macewan.org/howto/acroread_on_redhat_8.html\">come up with the solution</a>.  I can vouch for its efficacy, although the author, being a programmer no doubt, assumes that you will know how to use vi.  (He does better than most, actually, in telling you how to start vi.)  The thing to keep in mind is that vi requires going into Insert mode in order to make your changes, and then leaving it before you quit and save.  It’s a little bit like the old DOS Edit command, which was probably copied from vi or another UNIX command in the first place.</p><p>Anyhow, i will insert text at the cursor, so make your changes and then hit ESC to exit Insert mode.  Then type ZZ to save and quit.  You can start Acrobat Reader by going out to the terminal and typing acrobat.  The interface is grey and ugly, but the PDF documents look good and everything works fine.</p></div>",
  "content_text": "Acrobat Reader\nis a virtual necessity if you want to read PDF files, so I was surprised at the shoddy level of Linux support by Adobe.  I fully expected it to be available via Red Carpet or the Redhat Update Agent, but barring that, I was anticipating an easy RPM installation at the very least.  That proved not to be the case, as I got what proves to be a very normal error when trying to run it on Redhat 8:\n$ acroread\nWarning: charset “UTF-8” not supported, using “ISO8859-1”.\nAborted\nFortunately, and this is one of the things I love about Linux, someone has\ncome up with the solution\n.  I can vouch for its efficacy, although the author, being a programmer no doubt, assumes that you will know how to use vi.  (He does better than most, actually, in telling you how to start vi.)  The thing to keep in mind is that vi requires going into Insert mode in order to make your changes, and then leaving it before you quit and save.  It’s a little bit like the old DOS Edit command, which was probably copied from vi or another UNIX command in the first place.\nAnyhow, i will insert text at the cursor, so make your changes and then hit ESC to exit Insert mode.  Then type ZZ to save and quit.  You can start Acrobat Reader by going out to the terminal and typing acrobat.  The interface is grey and ugly, but the PDF documents look good and everything works fine.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-18T18:10:00+00:00"
}