{
  "url": "https://voxday.net/2003/10/23/mailbox-vox-nazi/",
  "scraped_at": "2025-12-13T15:31:41.677034",
  "title": "Mailbox – Vox Nazi",
  "date_display": "October 23, 2003",
  "date_iso": "2003-10-23T09:09:00+00:00",
  "date_from_url": "2003-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Dear Hitler Youth</em></p><p>[long rant on Rush Limbaugh’s hypocrisy deleted, as well as subsequent exchange of email on how “if you need to present all the Orwellian Hilter was Liberal/Democrat/Whatever BS, we both know it just the rhetoric of Reactionaries trying to distance themselves from the Ultimate Reactionary.”]</p><p>Do have yourself a wonderful day, Vox.  Now that Limbaugh’s power is decimated, I know that I will!</p><p>Keep that Brownshirt pressed,<br> <br>J. Fontaine</br></br></p><p>Like most on the left, Mr. Fontaine is utterly ignorant of the left-wing nature of the German National Socialist Worker’s Party.  After asking for some clarification from him, I was able to break down his argument as follows:</p><p><em>1)  The central fact of Hitler’s Nazi ideology is Jew hatred.<br> <br>2)  Hitler was right-wing because he was opposed to Communism.<br> <br>3)  Vox Day is right-wing (It’s true, but we don’t actually know why Mr. Fontaine believes this since he doesn’t understand <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=34468\">the spectrum</a>.)<br> <br>4)  Therefore Vox Day is a brownshirt-wearing Hitler Youth Nazi.</br></br></br></br></br></br></em></p><p>Mr. Fontaine subsequently admitted that he was puzzled by <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=28445\">my defense of Jews</a>, which, of course, explodes his entire argument with regards to me.  Unfortunately, he was not able to admit that the reason his logic fails with regards to me is that it is entirely absurd in the first place.  Many other socialists besides the national socialists were opposed to the Marxist variant, just as Mensheviks opposed Bolsheviks and Marx opposed the syndicalists and other socialists himself – the truth is that points 1, 2 and 4 above are simply incorrect.  Here, by contrast, is the breakdown of my case for the left-wing Nazi:</p><p>1)  The central fact of Hitler’s Nazi ideology was government control of society.<br> <br>2)  There were a number of social policy actions which the Nazi party wished to and did enact.<br> <br>3)  Most of those policy actions were very similar to those supported by the Communist party and the Democratic party.<br> <br>4)  These policy actions, as well as the fundamental left-wing notion of a collective right to control society, are antithetical to everything for which I, and the libertarian party, stand.  I am a right-wing extremist opposed to every plank of the Munich manifesto as well as the entire Communist manifesto.  The Democratic party is not only not opposed to either, but in fact explicitely supports the majority of the specific goals of both.<br> <br>5)  Therefore, Nazi ideology belongs to the Left and is an overt enemy of my right-wing libertarian ideology.</br></br></br></br></br></br></br></br></p><p>Looks like the brownshirt actually fits Mr. Fontaine rather nicely.  With a name like that, perhaps Jean-Marie Le Pen’s <em>Front National</em> might suit his style.</p></div>",
  "content_text": "Dear Hitler Youth\n[long rant on Rush Limbaugh’s hypocrisy deleted, as well as subsequent exchange of email on how “if you need to present all the Orwellian Hilter was Liberal/Democrat/Whatever BS, we both know it just the rhetoric of Reactionaries trying to distance themselves from the Ultimate Reactionary.”]\nDo have yourself a wonderful day, Vox.  Now that Limbaugh’s power is decimated, I know that I will!\nKeep that Brownshirt pressed,\nJ. Fontaine\nLike most on the left, Mr. Fontaine is utterly ignorant of the left-wing nature of the German National Socialist Worker’s Party.  After asking for some clarification from him, I was able to break down his argument as follows:\n1)  The central fact of Hitler’s Nazi ideology is Jew hatred.\n2)  Hitler was right-wing because he was opposed to Communism.\n3)  Vox Day is right-wing (It’s true, but we don’t actually know why Mr. Fontaine believes this since he doesn’t understand\nthe spectrum\n.)\n4)  Therefore Vox Day is a brownshirt-wearing Hitler Youth Nazi.\nMr. Fontaine subsequently admitted that he was puzzled by\nmy defense of Jews\n, which, of course, explodes his entire argument with regards to me.  Unfortunately, he was not able to admit that the reason his logic fails with regards to me is that it is entirely absurd in the first place.  Many other socialists besides the national socialists were opposed to the Marxist variant, just as Mensheviks opposed Bolsheviks and Marx opposed the syndicalists and other socialists himself – the truth is that points 1, 2 and 4 above are simply incorrect.  Here, by contrast, is the breakdown of my case for the left-wing Nazi:\n1)  The central fact of Hitler’s Nazi ideology was government control of society.\n2)  There were a number of social policy actions which the Nazi party wished to and did enact.\n3)  Most of those policy actions were very similar to those supported by the Communist party and the Democratic party.\n4)  These policy actions, as well as the fundamental left-wing notion of a collective right to control society, are antithetical to everything for which I, and the libertarian party, stand.  I am a right-wing extremist opposed to every plank of the Munich manifesto as well as the entire Communist manifesto.  The Democratic party is not only not opposed to either, but in fact explicitely supports the majority of the specific goals of both.\n5)  Therefore, Nazi ideology belongs to the Left and is an overt enemy of my right-wing libertarian ideology.\nLooks like the brownshirt actually fits Mr. Fontaine rather nicely.  With a name like that, perhaps Jean-Marie Le Pen’s\nFront National\nmight suit his style.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-23T08:09:00+00:00"
}