{
  "url": "https://voxday.net/2003/10/24/mailbox-you-dont-have-to-be-clueless/",
  "scraped_at": "2025-12-13T15:31:51.629227",
  "title": "Mailbox – You don’t have to be clueless, but it helps",
  "date_display": "October 24, 2003",
  "date_iso": "2003-10-24T08:32:00+00:00",
  "date_from_url": "2003-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Alejandro writes: <em>“First, you “Americans” kill palestinians using the Israeli Army. That land first belong to them, not to the people who is living now there (not all of them, I mean). Yes, probably they killed many US Citizens (you know, America is a continet, so when you say Americans, i think in Brazilians, Cubans,Canadians, Mexicans, US people, Argentinians, etc).”</em></p><p>Strike one – We Americans have the United States Marine Corps.  We don’t need Jews, or anyone else, to do our deadly work for us.  Did you miss the small matter of the successful invasion of two countries in the last two years?  Invading Gaza would take about ten minutes, judging by the speed of the assault on Iraq.</p><p>Strike two – The majority of Palestinians moved to Israel AFTER European Jews made their long-prophesied return and made the land economically viable.  Even their great leader, Arafat, is an Egyptian.  Then many of them, the “refugees”, moved out of their own accord in order to make way for the expected triumph of the Egyptian and Jordanian armies.  Unlike refugees in almost every other country, these “refugees” have not been permitted to settle in the lands of their Arab brothers, who profess to care so much about them.</p><p>Strike three – What a load of horse <em>merde</em>!  I am so tired of the faux worldly pretending that Americans are globally ignorant and that national terminology is founded solely in geography.  I’m sure that when Arab or European demonstrators are waving Hate America signs that they’re probably referring to Brazilians and Argentinians, right?  Canadians call themselves Canadians, not Americans, and they call us Americans.  The same is true for Brazilians, Cubans, Mexicans and Argentinians.  I don’t know what people are trying to prove by pretending to misunderstand something they obviously understood – and one doesn’t exactly make a strong case for one’s scholarly superiority by demonstrating that one is unaware that “continent” is spelled with three Ns.</p><p>Three sentences, three strikes.  Impressive stuff, Alejandro.  And, you’re out.</p></div>",
  "content_text": "Alejandro writes:\n“First, you “Americans” kill palestinians using the Israeli Army. That land first belong to them, not to the people who is living now there (not all of them, I mean). Yes, probably they killed many US Citizens (you know, America is a continet, so when you say Americans, i think in Brazilians, Cubans,Canadians, Mexicans, US people, Argentinians, etc).”\nStrike one – We Americans have the United States Marine Corps.  We don’t need Jews, or anyone else, to do our deadly work for us.  Did you miss the small matter of the successful invasion of two countries in the last two years?  Invading Gaza would take about ten minutes, judging by the speed of the assault on Iraq.\nStrike two – The majority of Palestinians moved to Israel AFTER European Jews made their long-prophesied return and made the land economically viable.  Even their great leader, Arafat, is an Egyptian.  Then many of them, the “refugees”, moved out of their own accord in order to make way for the expected triumph of the Egyptian and Jordanian armies.  Unlike refugees in almost every other country, these “refugees” have not been permitted to settle in the lands of their Arab brothers, who profess to care so much about them.\nStrike three – What a load of horse\nmerde\n!  I am so tired of the faux worldly pretending that Americans are globally ignorant and that national terminology is founded solely in geography.  I’m sure that when Arab or European demonstrators are waving Hate America signs that they’re probably referring to Brazilians and Argentinians, right?  Canadians call themselves Canadians, not Americans, and they call us Americans.  The same is true for Brazilians, Cubans, Mexicans and Argentinians.  I don’t know what people are trying to prove by pretending to misunderstand something they obviously understood – and one doesn’t exactly make a strong case for one’s scholarly superiority by demonstrating that one is unaware that “continent” is spelled with three Ns.\nThree sentences, three strikes.  Impressive stuff, Alejandro.  And, you’re out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-24T07:32:00+00:00"
}