{
  "url": "https://voxday.net/2003/10/22/missing-poin-2/",
  "scraped_at": "2025-12-13T15:31:31.624575",
  "title": "Missing the point",
  "date_display": "October 22, 2003",
  "date_iso": "2003-10-22T07:32:00+00:00",
  "date_from_url": "2003-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>She’s a lovely woman, and a bright one, but <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35204\">Michelle Malkin completely misses the point</a>.  Grover Norquist’s pro-growth, anti-tax Republican credentials are pretty close to impeccable.  The fact that Mr. Norquist is keeping company with the likes of Alec Baldwin and the left-wing People for the American Way does not mean that he is a closet leftist.  Just as a stopped clock is right twice a day, these quasi-sentient socialists are right, for once, to oppose the Patriot Act and some of the ways in which the Justice Department is handling its “terrorist” investigations.  You would think that the unusual fact that Mr. Norquist sees fit to join forces with these polar opposites on this particular issue should cause Michelle to reconsider her opinion, not leap to kick Norquist out of the Republican party.</p><p>Like Mrs. Malkin, National Review’s <a href=\"http://www.nationalreview.com/goldberg/goldberg200310020917.asp\">Jonah Goldberg</a>, of whom I am a fan, defends the <a href=\"http://www.eff.org/issues/usapa/\">Patriot Act </a>because none of its intrusive aspects have been invoked yet: <em>“This would even be defensible if there were one iota, one scintilla (is a scintilla smaller than an iota?) of evidence that the Patriot Act has been abused. But there hasn’t been a single allegation of abuse of the Patriot Act that has survived judicial or any other reasonable scrutiny.”</em></p><p>This analysis is disturbing, as it seems that some on the Right are now beginning to develop the same historical amnesia that pervades the mainstream media.  This fact that the Patriot Act is being unused is nevertheless absolutely in keeping with the history of many other cancerous laws, which are passed and kept in the scabbard for a while, only to be unsheathed later when people are accustomed to the concept and the political protests have lost their steam.  No one was concerned about the income tax in 1913 because it did not affect anyone that anyone knew – but everybody sure knows about it now.  The reasonable person should assume that those dangerous provisions are in the Patriot Act because there are plans to use them in the future, not that they are harmless because they have not been used yet.</p><p>The Patriot Act and the IAO are constitutional abominations.  The War on Terror is being used exactly in the same way that the War on Drugs has been used for decades – to provide the federal government with the ability to infringe upon the liberty of the American people.  Your house can get stormed with a no-knock raid if an anonymous telephone call accuses you of the wrong sort of botany project, and soon the same thing will be the case if you happen to visit the wrong web sites or use dangerous terminology in your emails. <a href=\"http://www.heise.de/tp/english/inhalt/te/2889/1.html\">Echelon is still out there</a> transcribing American faxes, emails and telephone calls, after all.</p><p> I suppose it shouldn’t surprise me that the same so-called conservatives who support the latter also support the former now.  As for me, I’ll consider taking the federal government’s commitment to fighting “terror” seriously when it stops cuddling up to the Saudis, begins deporting illegal aliens, refuses entry to the citizens of all terrorist states and cuts off funding to the godfather of terrorism, Yasser Arafat.</p></div>",
  "content_text": "She’s a lovely woman, and a bright one, but\nMichelle Malkin completely misses the point\n.  Grover Norquist’s pro-growth, anti-tax Republican credentials are pretty close to impeccable.  The fact that Mr. Norquist is keeping company with the likes of Alec Baldwin and the left-wing People for the American Way does not mean that he is a closet leftist.  Just as a stopped clock is right twice a day, these quasi-sentient socialists are right, for once, to oppose the Patriot Act and some of the ways in which the Justice Department is handling its “terrorist” investigations.  You would think that the unusual fact that Mr. Norquist sees fit to join forces with these polar opposites on this particular issue should cause Michelle to reconsider her opinion, not leap to kick Norquist out of the Republican party.\nLike Mrs. Malkin, National Review’s\nJonah Goldberg\n, of whom I am a fan, defends the\nPatriot Act\nbecause none of its intrusive aspects have been invoked yet:\n“This would even be defensible if there were one iota, one scintilla (is a scintilla smaller than an iota?) of evidence that the Patriot Act has been abused. But there hasn’t been a single allegation of abuse of the Patriot Act that has survived judicial or any other reasonable scrutiny.”\nThis analysis is disturbing, as it seems that some on the Right are now beginning to develop the same historical amnesia that pervades the mainstream media.  This fact that the Patriot Act is being unused is nevertheless absolutely in keeping with the history of many other cancerous laws, which are passed and kept in the scabbard for a while, only to be unsheathed later when people are accustomed to the concept and the political protests have lost their steam.  No one was concerned about the income tax in 1913 because it did not affect anyone that anyone knew – but everybody sure knows about it now.  The reasonable person should assume that those dangerous provisions are in the Patriot Act because there are plans to use them in the future, not that they are harmless because they have not been used yet.\nThe Patriot Act and the IAO are constitutional abominations.  The War on Terror is being used exactly in the same way that the War on Drugs has been used for decades – to provide the federal government with the ability to infringe upon the liberty of the American people.  Your house can get stormed with a no-knock raid if an anonymous telephone call accuses you of the wrong sort of botany project, and soon the same thing will be the case if you happen to visit the wrong web sites or use dangerous terminology in your emails.\nEchelon is still out there\ntranscribing American faxes, emails and telephone calls, after all.\nI suppose it shouldn’t surprise me that the same so-called conservatives who support the latter also support the former now.  As for me, I’ll consider taking the federal government’s commitment to fighting “terror” seriously when it stops cuddling up to the Saudis, begins deporting illegal aliens, refuses entry to the citizens of all terrorist states and cuts off funding to the godfather of terrorism, Yasser Arafat.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-22T06:32:00+00:00"
}