{
  "url": "https://voxday.net/2003/10/18/old-age-and-wisdo/",
  "scraped_at": "2025-12-13T15:31:00.067653",
  "title": "Old age and wisdom…",
  "date_display": "October 18, 2003",
  "date_iso": "2003-10-18T16:52:00+00:00",
  "date_from_url": "2003-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>will overcome youth and skill.  That was a favorite saying of the father of one of my best friends, who is very appropriately nicknamed Sly.  After re-reading my last post, it occurred to me that another reason why challenging a man on the far side of the half-century does not seem unfair to me is that my sensei just turned 50 this year.  He may not have the 17-inch biceps he had when I first met him, but I have no doubt that he can still wipe up the floor with me.</p><p>I remember the following exchange very clearly:</p><p>Sensei:   You are fast.  Faster than almost anyone I have ever seen.<br> <br>Me:       Then how come you always get in before I can?<br> <br>Sensei:  (smiles broadly)  Because I know what you are going to do before you do it.</br></br></br></br></p><p>The ironic thing about this conversation was that he was paying this backhanded compliment while at the same time extending a hand to help me up from the floor after having dropped me with a rear-hand strike to the solar plexus.  He was, and is, a deadly fighter.  I once watched him absolutely destroy the 10th-ranked point fighter in the country – he could have easily been a champion if he did not disdain point fighting as a perversion of the art.  His teaching was distinctive enough that when a friend and I visited another dojo while he was gone for a time, the instructor, <a href=\"http://www.keepkickin.net/whitdef.htm\">a well-known Tang Soo Do champion</a>, asked us if we were his students after only two rounds of sparring.</p></div>",
  "content_text": "will overcome youth and skill.  That was a favorite saying of the father of one of my best friends, who is very appropriately nicknamed Sly.  After re-reading my last post, it occurred to me that another reason why challenging a man on the far side of the half-century does not seem unfair to me is that my sensei just turned 50 this year.  He may not have the 17-inch biceps he had when I first met him, but I have no doubt that he can still wipe up the floor with me.\nI remember the following exchange very clearly:\nSensei:   You are fast.  Faster than almost anyone I have ever seen.\nMe:       Then how come you always get in before I can?\nSensei:  (smiles broadly)  Because I know what you are going to do before you do it.\nThe ironic thing about this conversation was that he was paying this backhanded compliment while at the same time extending a hand to help me up from the floor after having dropped me with a rear-hand strike to the solar plexus.  He was, and is, a deadly fighter.  I once watched him absolutely destroy the 10th-ranked point fighter in the country – he could have easily been a champion if he did not disdain point fighting as a perversion of the art.  His teaching was distinctive enough that when a friend and I visited another dojo while he was gone for a time, the instructor,\na well-known Tang Soo Do champion\n, asked us if we were his students after only two rounds of sparring.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-18T15:52:00+00:00"
}