{
  "url": "https://voxday.net/2003/10/30/on-targe/",
  "scraped_at": "2025-12-13T15:32:45.867038",
  "title": "On target",
  "date_display": "October 30, 2003",
  "date_iso": "2003-10-30T20:18:00+00:00",
  "date_from_url": "2003-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Looks like Mr. Joseph Farah has <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35346\">nailed it again</a>.  He called the DC sniper, and he also <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=35299\">predicted</a> that the California fires would turn out to be a form of Muslim terror attack.  I have to admit that I was skeptical about the latter case, but it turns out that the first arsonist arrested is named Dikran.  I don’t know my Arabic names well enough to be sure of Mr. Arnouchian’s heritage, but it surely isn’t a name that turns up frequently in the Lutheran churches around here.</p><p>Update – DZ points out: <em>“Nationality — Surnames ending in “ian” are generally Armenian.  Armenians are generally Christian.  They are certainly not fans of Islam, given the genocides precipitated by the Turks.”</em></p><p>Fair enough.  Ergo, the jury is still out on Mr. Farah’s prediction.</p></div>",
  "content_text": "Looks like Mr. Joseph Farah has\nnailed it again\n.  He called the DC sniper, and he also\npredicted\nthat the California fires would turn out to be a form of Muslim terror attack.  I have to admit that I was skeptical about the latter case, but it turns out that the first arsonist arrested is named Dikran.  I don’t know my Arabic names well enough to be sure of Mr. Arnouchian’s heritage, but it surely isn’t a name that turns up frequently in the Lutheran churches around here.\nUpdate – DZ points out:\n“Nationality — Surnames ending in “ian” are generally Armenian.  Armenians are generally Christian.  They are certainly not fans of Islam, given the genocides precipitated by the Turks.”\nFair enough.  Ergo, the jury is still out on Mr. Farah’s prediction.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-30T20:18:00+00:00"
}