{
  "url": "https://voxday.net/2003/10/15/palestinians-killing-americans-again/",
  "scraped_at": "2025-12-13T15:30:39.583080",
  "title": "Palestinians killing Americans… again",
  "date_display": "October 15, 2003",
  "date_iso": "2003-10-15T10:23:00+00:00",
  "date_from_url": "2003-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have never understood why the Palestinian murderocracy is permitted to play whack-a-Jew while the State Department cheers them on and lobbies for the PA to receive more financial support from the U.S. government.  What really infuriates me, though, is that Arafat and his bloodthirsty gang are again being permitted to <a href=\"http://www.startribune.com/stories/484/4155218.html\">murder Americans</a> with total impunity.  Arafat has killed Americans before, and I have no doubt that he will do so in the future until President Bush finds a backbone and shows more resolve in shutting down the monster than did his predecessors: Clinton, Bush, Reagan, and Carter.  You can’t tell me that Arafat believes we’re going to strike back, when we jump all over Israel every time they justifiably hit back at the poor, defenseless murderers.  I have no doubt that later today we’ll hear plenty of somber condemnations worded in the harshest possible terms.  Whatever.</p><p>I have many doubts about the so-called War on Terror, but chief among them is this: if we are truly fighting against terror, why is the godfather of terror, the creator of modern terrorism, left in peace?</p></div>",
  "content_text": "I have never understood why the Palestinian murderocracy is permitted to play whack-a-Jew while the State Department cheers them on and lobbies for the PA to receive more financial support from the U.S. government.  What really infuriates me, though, is that Arafat and his bloodthirsty gang are again being permitted to\nmurder Americans\nwith total impunity.  Arafat has killed Americans before, and I have no doubt that he will do so in the future until President Bush finds a backbone and shows more resolve in shutting down the monster than did his predecessors: Clinton, Bush, Reagan, and Carter.  You can’t tell me that Arafat believes we’re going to strike back, when we jump all over Israel every time they justifiably hit back at the poor, defenseless murderers.  I have no doubt that later today we’ll hear plenty of somber condemnations worded in the harshest possible terms.  Whatever.\nI have many doubts about the so-called War on Terror, but chief among them is this: if we are truly fighting against terror, why is the godfather of terror, the creator of modern terrorism, left in peace?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-15T09:23:00+00:00"
}