{
  "url": "https://voxday.net/2003/10/12/pondering-debian/",
  "scraped_at": "2025-12-13T15:30:25.281904",
  "title": "Pondering Debian",
  "date_display": "October 12, 2003",
  "date_iso": "2003-10-12T16:58:00+00:00",
  "date_from_url": "2003-10-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that I’m fully operational on Linux – there are two or three applications for which I stil require Windows, but nothing vital – I’m beginning to wonder if I’ve chosen the right distro.  I’m using Red Hat 8, primarily for the rather prosaic reason that one of my boys happened to have the CDs at the time I decided to take the plunge.  Red Hat is up to version 9 now, but I’m a little loathe to bother upgrading since everything is working fine and having a slightly prettier interface is not at the top of my list of concerns right now.</p><p>It’s typical, of course, that one no sooner makes the leap to Linux than one begins to plunge headlong into the endless debate of which is the One True Distro.  Fortunately, the general consensus appears to be that Red Hat is a reasonable choice for us non-hacker power-user sorts.</p><p>Of growing interest to me is Debian, which not only appeals to my libertarian ideals and comes with Neal Stephenson’s recommendation, but also makes what now, post-deflowering, appears to be an increasingly plausible case for fewer operational headaches down the road.  The Red Hat Update Agent, while incomparably less intrusive than Microsoft’s odious automatic update system, is more than a little clunky, and the August timeout bug that I had to wrestle with today is exactly the sort of problem that corporations regularly create for themselves and their customers in the interest of preserving their competitive advantages.  They have a long, long way to go before they can be accused of aping the nefarious ways of the evil empire, of course, but it’s annoying to encounter even a faint echo of the very sort of thing one is trying to escape in the first place.</p><p>I’m happy with Red Hat, though, which in combination with the Opera web browser and Evolution email, makes me feel almost giddy, as if I’m breathing in the fresh air of the country for the first time after spending years choking down the polluted smog of Redmond.  So, I’m going to resist the urge to upgrade the kernel for now, and instead I’ll let the happy little penguin amuse itself downloading Debian via <em>jigdo </em>while I’m taking in the NFL action.  Just in case… just in case.  By the way, it’s worth considering a switch from IE to Opera even if you don’t have the skillz or the gutz to make the big OS switch.  Opera is small, fast, and has a brilliant radio button for controlling pop-ups that’s incredibly easy to operate.  It’s got some definite quirks, especially related to the fonts used on some web sites, but on the whole it is much better than the increasingly bloated space hog that is Internet Explorer.</p><p>From what I’ve seen so far, while Linux is by no means ready for mainstream prime time, it is now fully practical for the power-user who isn’t afraid to tinker.  A few years ago, that was really not the case, as one needed to be a hacker with programming skills if one wished to use it.  The conclusion:  Don’t be afraid.  Go for it.  Drive the tank.  Be the penguin.</p></div>",
  "content_text": "Now that I’m fully operational on Linux – there are two or three applications for which I stil require Windows, but nothing vital – I’m beginning to wonder if I’ve chosen the right distro.  I’m using Red Hat 8, primarily for the rather prosaic reason that one of my boys happened to have the CDs at the time I decided to take the plunge.  Red Hat is up to version 9 now, but I’m a little loathe to bother upgrading since everything is working fine and having a slightly prettier interface is not at the top of my list of concerns right now.\nIt’s typical, of course, that one no sooner makes the leap to Linux than one begins to plunge headlong into the endless debate of which is the One True Distro.  Fortunately, the general consensus appears to be that Red Hat is a reasonable choice for us non-hacker power-user sorts.\nOf growing interest to me is Debian, which not only appeals to my libertarian ideals and comes with Neal Stephenson’s recommendation, but also makes what now, post-deflowering, appears to be an increasingly plausible case for fewer operational headaches down the road.  The Red Hat Update Agent, while incomparably less intrusive than Microsoft’s odious automatic update system, is more than a little clunky, and the August timeout bug that I had to wrestle with today is exactly the sort of problem that corporations regularly create for themselves and their customers in the interest of preserving their competitive advantages.  They have a long, long way to go before they can be accused of aping the nefarious ways of the evil empire, of course, but it’s annoying to encounter even a faint echo of the very sort of thing one is trying to escape in the first place.\nI’m happy with Red Hat, though, which in combination with the Opera web browser and Evolution email, makes me feel almost giddy, as if I’m breathing in the fresh air of the country for the first time after spending years choking down the polluted smog of Redmond.  So, I’m going to resist the urge to upgrade the kernel for now, and instead I’ll let the happy little penguin amuse itself downloading Debian via\njigdo\nwhile I’m taking in the NFL action.  Just in case… just in case.  By the way, it’s worth considering a switch from IE to Opera even if you don’t have the skillz or the gutz to make the big OS switch.  Opera is small, fast, and has a brilliant radio button for controlling pop-ups that’s incredibly easy to operate.  It’s got some definite quirks, especially related to the fonts used on some web sites, but on the whole it is much better than the increasingly bloated space hog that is Internet Explorer.\nFrom what I’ve seen so far, while Linux is by no means ready for mainstream prime time, it is now fully practical for the power-user who isn’t afraid to tinker.  A few years ago, that was really not the case, as one needed to be a hacker with programming skills if one wished to use it.  The conclusion:  Don’t be afraid.  Go for it.  Drive the tank.  Be the penguin.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-12T15:58:00+00:00"
}