{
  "url": "https://voxday.net/2003/10/09/pumping-for-arnold/",
  "scraped_at": "2025-12-13T15:30:12.061760",
  "title": "Pumping for Arnold",
  "date_display": "October 9, 2003",
  "date_iso": "2003-10-09T14:12:00+00:00",
  "date_from_url": "2003-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In honor of Governor Schwarzenegger’s election – I didn’t and don’t support his political career, but I still like him as an example of what determination can do for an individual – I hit the triceps hard today.  After my normal workout, I added a symbolic six reps with the 100-pound dumbell.  I figure Arnold would appreciate that sort of homage instead of the usual toast or whatever.  So, *grunt* here’s to the new governor!</p><p>And now to sacrifice whatever man points the above feat may have gained me… I was listening to Robbie Williams in the car on the way to the gym, (<em>note – not my CD, it was already in there</em>), and I had to admire the way he forthrightly addressed the public accusations of his supposed homosexuality.  In my humble opinion, singing “Press be asking do I care for sodomy, I don’t know, yeh, probably,” while a not-very-clad Kylie Minogue is draped all over you amounts to a rather decisively sarcastic rebuttal.</p><p>Given that I am charged with an unhealthy and unnatural interest in men on pretty much a weekly basis, I see only one logical solution.  It’s time for me to write a song and film a video with Kylie.</p></div>",
  "content_text": "In honor of Governor Schwarzenegger’s election – I didn’t and don’t support his political career, but I still like him as an example of what determination can do for an individual – I hit the triceps hard today.  After my normal workout, I added a symbolic six reps with the 100-pound dumbell.  I figure Arnold would appreciate that sort of homage instead of the usual toast or whatever.  So, *grunt* here’s to the new governor!\nAnd now to sacrifice whatever man points the above feat may have gained me… I was listening to Robbie Williams in the car on the way to the gym, (\nnote – not my CD, it was already in there\n), and I had to admire the way he forthrightly addressed the public accusations of his supposed homosexuality.  In my humble opinion, singing “Press be asking do I care for sodomy, I don’t know, yeh, probably,” while a not-very-clad Kylie Minogue is draped all over you amounts to a rather decisively sarcastic rebuttal.\nGiven that I am charged with an unhealthy and unnatural interest in men on pretty much a weekly basis, I see only one logical solution.  It’s time for me to write a song and film a video with Kylie.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-09T13:12:00+00:00"
}