{
  "url": "https://voxday.net/2003/10/22/pure-halloween-evi/",
  "scraped_at": "2025-12-13T15:31:38.314255",
  "title": "Pure Halloween evil",
  "date_display": "October 22, 2003",
  "date_iso": "2003-10-22T14:20:00+00:00",
  "date_from_url": "2003-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The so-called <a href=\"http://www.opensource.org/halloween/halloween1.php\">Halloween document</a> makes for some fascinating reading, especially where it is annotated by open source advocates.  I found the following section to be very interesting, considering that I had independently come to the conclusion that Microsoft is a force working against freedom of choice and human liberty.  As described by the annotator, it was written by a Microsoft staff engineer “with contributions, endorsements, and reviews by two Program Managers, the Senior Vice President in charge of NT development, and two members of the eight-person Executive Committee (Microsoft’s Politburo, answering only to Bill Gates).”</p><p>After reading it, you’ll probably conclude two things:  a) I’m glad I migrated / I really should migrate to Linux; b) Politburo is really an apt appellation.</p><p><em>One of the most interesting implications of viable OSS ecosystems is long-term credibility.</em></p><p>Long-Term Credibility Defined</p><p>Long term credibility exists if there is no way you can be driven out of business in the near term. This forces change in how competitors deal with you.</p><p>{ TN comments: Note the terminology used here “driven out of business”. MS believes that putting other companies out of business is not merely “collateral damage” — a byproduct of selling better stuff — but rather, a direct business goal. To put this in perspective, economic theory and the typical honest, customer-oriented businessperson will think of business as a stock-car race — the fastest car with the most skillful driver wins. Microsoft views business as a demolition derby — you knock out as many competitors as possible, and try to maneuver things so that your competitors wipe each other out and thereby eliminate themselves. In a stock car race there are many finishers and thus many drivers get a paycheck. In a demolition derby there is just one survivor. Can you see why “Microsoft” and “freedom of choice” are absolutely in two different universes? } </p></div>",
  "content_text": "The so-called\nHalloween document\nmakes for some fascinating reading, especially where it is annotated by open source advocates.  I found the following section to be very interesting, considering that I had independently come to the conclusion that Microsoft is a force working against freedom of choice and human liberty.  As described by the annotator, it was written by a Microsoft staff engineer “with contributions, endorsements, and reviews by two Program Managers, the Senior Vice President in charge of NT development, and two members of the eight-person Executive Committee (Microsoft’s Politburo, answering only to Bill Gates).”\nAfter reading it, you’ll probably conclude two things:  a) I’m glad I migrated / I really should migrate to Linux; b) Politburo is really an apt appellation.\nOne of the most interesting implications of viable OSS ecosystems is long-term credibility.\nLong-Term Credibility Defined\nLong term credibility exists if there is no way you can be driven out of business in the near term. This forces change in how competitors deal with you.\n{ TN comments: Note the terminology used here “driven out of business”. MS believes that putting other companies out of business is not merely “collateral damage” — a byproduct of selling better stuff — but rather, a direct business goal. To put this in perspective, economic theory and the typical honest, customer-oriented businessperson will think of business as a stock-car race — the fastest car with the most skillful driver wins. Microsoft views business as a demolition derby — you knock out as many competitors as possible, and try to maneuver things so that your competitors wipe each other out and thereby eliminate themselves. In a stock car race there are many finishers and thus many drivers get a paycheck. In a demolition derby there is just one survivor. Can you see why “Microsoft” and “freedom of choice” are absolutely in two different universes? }",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-22T13:20:00+00:00"
}