{
  "url": "https://voxday.net/2003/10/21/rabid-running-dog-at-forbes/",
  "scraped_at": "2025-12-13T15:31:26.136357",
  "title": "Rabid running dog at Forbes",
  "date_display": "October 21, 2003",
  "date_iso": "2003-10-21T10:55:00+00:00",
  "date_from_url": "2003-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We capitalists are in bad shape if we think we can rely on these jokers at Forbes to defend it.  Daniel Lyons clearly doesn’t understand that the fulfillment of voluntary contractual obligations is a foundational element of any capitalist system.  In this <a href=\"http://www.forbes.com/2003/10/14/cz_dl_1014linksys.html\">slimy little article</a>, he does a hit piece on the Free Software Foundation, which is doing nothing more than its job of protecting the GNU General Public License.</p><p>Let’s break down the logic of Mr. Lyons’ position:</p><p>1.  The FSF is responsible for the GPL.  Under the GPL license, if you distribute GPL software in a product, you must also distribute the software’s source code as well as the code for any derivative works.<br> <br>2.  Broadcom chose to use GPL code in its router chips, as per the GPL license.<br> <br>3.  Linksys chose to use Broadcom’s chips in its routers.<br> <br>4.  Cisco chose to buy Linksys.<br> <br>5.  Broadcom has not released its code, as required by the GPL license.  Nor have they argued that they are under no obligation to do so.<br> <br>6.  In order that Broadcom remain in compliance with their contractual obligations, the Free Software Foundation is telling Broadcom (and therefore Cisco), to: a) rip out all the GPL code in the router and use something else, or b) make their code available to the entire world as per the license.<br> <br>7.  Therefore, the Free Software Foundation is communist.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>There are adjectives to describe this argument.  Generally speaking, they can be described as antonyms for intelligent, logical, persuasive and well-reasoned.  To spell out just a few items of which Mr. Lyons is apparently ignorant – communists don’t attempt to enforce private property rights.  Nor do they permit free choice in deciding what to buy and sell.  Nor is the FSF a government entity.  Nor did anyone force Broadcom to put the GPL code in its chips. In other words, Mr. Lyons argument is not just flawed, it is profoundly absurd.</p></div>",
  "content_text": "We capitalists are in bad shape if we think we can rely on these jokers at Forbes to defend it.  Daniel Lyons clearly doesn’t understand that the fulfillment of voluntary contractual obligations is a foundational element of any capitalist system.  In this\nslimy little article\n, he does a hit piece on the Free Software Foundation, which is doing nothing more than its job of protecting the GNU General Public License.\nLet’s break down the logic of Mr. Lyons’ position:\n1.  The FSF is responsible for the GPL.  Under the GPL license, if you distribute GPL software in a product, you must also distribute the software’s source code as well as the code for any derivative works.\n2.  Broadcom chose to use GPL code in its router chips, as per the GPL license.\n3.  Linksys chose to use Broadcom’s chips in its routers.\n4.  Cisco chose to buy Linksys.\n5.  Broadcom has not released its code, as required by the GPL license.  Nor have they argued that they are under no obligation to do so.\n6.  In order that Broadcom remain in compliance with their contractual obligations, the Free Software Foundation is telling Broadcom (and therefore Cisco), to: a) rip out all the GPL code in the router and use something else, or b) make their code available to the entire world as per the license.\n7.  Therefore, the Free Software Foundation is communist.\nThere are adjectives to describe this argument.  Generally speaking, they can be described as antonyms for intelligent, logical, persuasive and well-reasoned.  To spell out just a few items of which Mr. Lyons is apparently ignorant – communists don’t attempt to enforce private property rights.  Nor do they permit free choice in deciding what to buy and sell.  Nor is the FSF a government entity.  Nor did anyone force Broadcom to put the GPL code in its chips. In other words, Mr. Lyons argument is not just flawed, it is profoundly absurd.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-21T09:55:00+00:00"
}