{
  "url": "https://voxday.net/2003/10/21/re-homeschooling/",
  "scraped_at": "2025-12-13T15:31:24.309195",
  "title": "Re: Homeschooling",
  "date_display": "October 21, 2003",
  "date_iso": "2003-10-21T08:17:00+00:00",
  "date_from_url": "2003-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Interesting exchange on the <a href=\"http://www.dallasnews.com/opinion/blog/\">DMN Daily blog</a>.  I’d link directly to the posts, except that it’s not possible.</p><p><em><strong>John Chamless</strong>: Even though home-schooling has become so common as to almost be mainstream here, I am surprised at how defensive some people are about it. I’ve seen the same thing over and over with National Rifle Association members. They assume a stranger is going to judge them negatively. I wonder if they really do get a lot of negative reactions.</em></p><p><strong>Rod Dreher</strong>: John, are you serious? Let me count the ways! Are you a religious nut? Aren’t you worried that your child is not going to be socialized? Are you a racist? What, are you too good for the public schools? And so forth. I suspect your in-box is going to be filling up with letters from homeschoolers who talk about the negative comments they receive. It’s funny how when lots of folks find out you’re a homeschooler, they immediately take it upon themselves to tell you what a menace to your child and to society you are. Most of them are too polite to put it so bluntly, but the message is clear. My wife and I even had one woman nearly in tears, whose opinion we had not sought, exhorting us that it was our duty as Christians to put our kids in the public schools.  I’m to the point where my stock response is going to be: Who the hell asked you, anyway?</p><p>I think it’s time for homeschoolers to turn the tables.  There’s certainly enough evidence of the inferiority of the government school option to justify it.  Don’t you care what your children are learning?  Don’t you want to spend time with them?  Aren’t you worried that your child is going to be socialized into an amoral monster?  Doesn’t it bother you that Marx, Hitler and Lenin were all big advocates of public schooling?  Don’t you love your children enough to want the best for them?</p></div>",
  "content_text": "Interesting exchange on the\nDMN Daily blog\n.  I’d link directly to the posts, except that it’s not possible.\nJohn Chamless\n: Even though home-schooling has become so common as to almost be mainstream here, I am surprised at how defensive some people are about it. I’ve seen the same thing over and over with National Rifle Association members. They assume a stranger is going to judge them negatively. I wonder if they really do get a lot of negative reactions.\nRod Dreher\n: John, are you serious? Let me count the ways! Are you a religious nut? Aren’t you worried that your child is not going to be socialized? Are you a racist? What, are you too good for the public schools? And so forth. I suspect your in-box is going to be filling up with letters from homeschoolers who talk about the negative comments they receive. It’s funny how when lots of folks find out you’re a homeschooler, they immediately take it upon themselves to tell you what a menace to your child and to society you are. Most of them are too polite to put it so bluntly, but the message is clear. My wife and I even had one woman nearly in tears, whose opinion we had not sought, exhorting us that it was our duty as Christians to put our kids in the public schools.  I’m to the point where my stock response is going to be: Who the hell asked you, anyway?\nI think it’s time for homeschoolers to turn the tables.  There’s certainly enough evidence of the inferiority of the government school option to justify it.  Don’t you care what your children are learning?  Don’t you want to spend time with them?  Aren’t you worried that your child is going to be socialized into an amoral monster?  Doesn’t it bother you that Marx, Hitler and Lenin were all big advocates of public schooling?  Don’t you love your children enough to want the best for them?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-21T07:17:00+00:00"
}