{
  "url": "https://voxday.net/2003/10/30/ready-aim-fire/",
  "scraped_at": "2025-12-13T15:32:42.535754",
  "title": "Ready, aim, FIRE",
  "date_display": "October 30, 2003",
  "date_iso": "2003-10-30T12:25:00+00:00",
  "date_from_url": "2003-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, conservatives are not cultural.  Strange, considering that the list of signatories quite clearly demonstrates that exhibiting an inordinate interest in other people’s bottoms – of the same sex, mind you – suffices to qualify one as cultural.  It seems that being capable of breathing and pulse would qualify one to surmount a bar set that low.  Looks like it’s time for <a href=\"http://www.thefire.org/index.php\">FIRE</a> to smack some leftie heads around again – legally speaking, that is.  I don’t know what minority status has to do with culture, but if Bucknell is a typical college campus, there’s no doubt that conservatives are in the minority.</p><p><em>Dear Bucknell University Conservatives Club,</em></p><p>We would like to thank you for your time and interest in becoming a member of the Multicultural Council of Presidents.  As a result of the council’s vote, we are unable to offer you a seat on the council at this time.The Multicultural Council of Presidents (MCOP) has determined that the Bucknell University Conservatives Club (BUCC) does not meet the qualifications for membership as stated by our Constitution.</p><p>A significant piece to the MCOP constitution is that all members of the council must be ” multicultural organizations,” as stated in Article III Section 3.01.  At this time, the Multicultural Council of Presidents does not feel that the Bucknell University Conservatives Club sufficiently defined their organization as a cultural organization in the application process.  The application was presented as a claim to culture rather than providing a historical context of cultural heritage of the organization.  The BUCC failed to convince MCOP that the organization is either a culture or minority.</p><p>The application committee clearly stated that the Conservatives Club share a similar viewpoint as an organization, but the council does not feel that shared viewpoints equal a shared identity.  I may also note that although the individual members within organizations seated on the Multicultural Council of Presidents do not necessarily share the same viewpoints, each organization does share a unified culture as defined above.According to MCOP Constitutional guidelines, as delineated in section 3.02, council members vote on the admittance of potential new members.  Approval is dependent on the favorable opinion of 2/3 of the quorum.  BUCC failed to secure this majority.</p><p>In light of these proceedings, your application has been respectfully declined.The members of the Multicultural Council of Presidents (MCOP) highly regard and thank you for your time and interest in this matter.</p><p>Best Regards,</p><p>On behalf of the Multicultural Council of Presidents,<br> <br>Nicole R. Thompson, Bucknell Multicultural Theatre Ensemble<br> <br>Alisha Lang, Zeta Phi Beta Sorority<br> <br>Philip Martoma, FLAG &amp; BT</br></br></br></br></br></br></p></div>",
  "content_text": "So, conservatives are not cultural.  Strange, considering that the list of signatories quite clearly demonstrates that exhibiting an inordinate interest in other people’s bottoms – of the same sex, mind you – suffices to qualify one as cultural.  It seems that being capable of breathing and pulse would qualify one to surmount a bar set that low.  Looks like it’s time for\nFIRE\nto smack some leftie heads around again – legally speaking, that is.  I don’t know what minority status has to do with culture, but if Bucknell is a typical college campus, there’s no doubt that conservatives are in the minority.\nDear Bucknell University Conservatives Club,\nWe would like to thank you for your time and interest in becoming a member of the Multicultural Council of Presidents.  As a result of the council’s vote, we are unable to offer you a seat on the council at this time.The Multicultural Council of Presidents (MCOP) has determined that the Bucknell University Conservatives Club (BUCC) does not meet the qualifications for membership as stated by our Constitution.\nA significant piece to the MCOP constitution is that all members of the council must be ” multicultural organizations,” as stated in Article III Section 3.01.  At this time, the Multicultural Council of Presidents does not feel that the Bucknell University Conservatives Club sufficiently defined their organization as a cultural organization in the application process.  The application was presented as a claim to culture rather than providing a historical context of cultural heritage of the organization.  The BUCC failed to convince MCOP that the organization is either a culture or minority.\nThe application committee clearly stated that the Conservatives Club share a similar viewpoint as an organization, but the council does not feel that shared viewpoints equal a shared identity.  I may also note that although the individual members within organizations seated on the Multicultural Council of Presidents do not necessarily share the same viewpoints, each organization does share a unified culture as defined above.According to MCOP Constitutional guidelines, as delineated in section 3.02, council members vote on the admittance of potential new members.  Approval is dependent on the favorable opinion of 2/3 of the quorum.  BUCC failed to secure this majority.\nIn light of these proceedings, your application has been respectfully declined.The members of the Multicultural Council of Presidents (MCOP) highly regard and thank you for your time and interest in this matter.\nBest Regards,\nOn behalf of the Multicultural Council of Presidents,\nNicole R. Thompson, Bucknell Multicultural Theatre Ensemble\nAlisha Lang, Zeta Phi Beta Sorority\nPhilip Martoma, FLAG & BT",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-30T12:25:00+00:00"
}