{
  "url": "https://voxday.net/2003/10/24/right-to-kill-your-wife/",
  "scraped_at": "2025-12-13T15:31:58.217852",
  "title": "The right to kill your wife",
  "date_display": "October 24, 2003",
  "date_iso": "2003-10-24T13:48:00+00:00",
  "date_from_url": "2003-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It seems that if those nutty Christians are against it, <a href=\"http://www.sun-sentinel.com/news/local/florida/sfl-schiavo24oct24,0,1346658.story?coll=sfla-news-florida\">the ACLU is for it</a>.  We’re not talking about pulling the plug on machines keeping someone artificially alive, we’re talking about intentionally starving someone to death here.  It just seems very strange that the ACLU would wish to support the right of someone to KILL HIS FREAKING WIFE!  To show how absurd this is, what if instead of wanting to starve her, Mr. Schiavo wanted to hit Mrs. Schiavo over the head with a hammer?  That would be faster, less painful and less cruel, though admittedly a little messier.  If the court decides that husbands have the right to starve their womenfolk to death, doesn’t that give them free rein to beat them to death too?  This seems to be taking us back to the day of the legally-defined thickness of a cane with which one could beat his wife, and then some.</p><p>Of course, since the ACLU also believes in the right of mothers to murder their babies, I suppose supporting the right of men to kill their wives is at least in keeping with their ghoulish philosophy.</p></div>",
  "content_text": "It seems that if those nutty Christians are against it,\nthe ACLU is for it\n.  We’re not talking about pulling the plug on machines keeping someone artificially alive, we’re talking about intentionally starving someone to death here.  It just seems very strange that the ACLU would wish to support the right of someone to KILL HIS FREAKING WIFE!  To show how absurd this is, what if instead of wanting to starve her, Mr. Schiavo wanted to hit Mrs. Schiavo over the head with a hammer?  That would be faster, less painful and less cruel, though admittedly a little messier.  If the court decides that husbands have the right to starve their womenfolk to death, doesn’t that give them free rein to beat them to death too?  This seems to be taking us back to the day of the legally-defined thickness of a cane with which one could beat his wife, and then some.\nOf course, since the ACLU also believes in the right of mothers to murder their babies, I suppose supporting the right of men to kill their wives is at least in keeping with their ghoulish philosophy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-24T12:48:00+00:00"
}