{
  "url": "https://voxday.net/2003/10/14/russian-dolls-and-monkey-solution/",
  "scraped_at": "2025-12-13T15:30:34.044173",
  "title": "Russian dolls and the monkey solution",
  "date_display": "October 14, 2003",
  "date_iso": "2003-10-14T19:28:00+00:00",
  "date_from_url": "2003-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Linux is not a digital paradise, as yet, but we’re getting there.  One of the biggest annoyances I’ve run into thus far is the package dependency problem.  I wanted to download a newsreader, but XNews doesn’t run under Linux, so I did a little research and learned that Pan is considered to be roughly equivalent to Agent, one of the more popular Windows newsreaders.  Then, after downloading Pan’s installation package, I learned that I needed eight other packages in order for it to install properly.</p><p>Fine, fair enough, since the new version of Pan is quite a bit newer than the Redhat 8.0 discs from which I installed Linux a while back.  I downloaded five of the eight packages, installed two of them, and then learned that the third required two additional packages.  Hmmm.  So I downloaded those two, installed the first, and then learned that the second required an additional package.  Grrrrrr.  It was rather like a mixed drink: two-parts cracking open those increasingly smaller Russian dolls and one-part fighting the Hydra sans a fiery brand for the regenerating stumps.</p><p>At that point, I gave up, assuming that there had to be a better way.  Sure enough, there was. <a href=\"http://www.ximian.com\">Ximian’s Red Carpet</a> is a little like the Red Hat update agent, only it works a lot better.  Not only did it have the Pan interdependencies worked out, downloaded and installed in minutes, but it also resolved a package interdependency issue that had caused the Red Hat update agent to throw in the towel.  Very impressive!  So much so that I went ahead and upgraded Ximian Evolution, the email program I’m using, without even bothering to read the new features list.  Good on ya, Monkey Men.</p><p>Unfortunately, Evolution Pilot doesn’t seem to recognize my Dana.  But my list of Windows-necessary functions is now down to three.  Adieu, sweet Bill….</p></div>",
  "content_text": "Linux is not a digital paradise, as yet, but we’re getting there.  One of the biggest annoyances I’ve run into thus far is the package dependency problem.  I wanted to download a newsreader, but XNews doesn’t run under Linux, so I did a little research and learned that Pan is considered to be roughly equivalent to Agent, one of the more popular Windows newsreaders.  Then, after downloading Pan’s installation package, I learned that I needed eight other packages in order for it to install properly.\nFine, fair enough, since the new version of Pan is quite a bit newer than the Redhat 8.0 discs from which I installed Linux a while back.  I downloaded five of the eight packages, installed two of them, and then learned that the third required two additional packages.  Hmmm.  So I downloaded those two, installed the first, and then learned that the second required an additional package.  Grrrrrr.  It was rather like a mixed drink: two-parts cracking open those increasingly smaller Russian dolls and one-part fighting the Hydra sans a fiery brand for the regenerating stumps.\nAt that point, I gave up, assuming that there had to be a better way.  Sure enough, there was.\nXimian’s Red Carpet\nis a little like the Red Hat update agent, only it works a lot better.  Not only did it have the Pan interdependencies worked out, downloaded and installed in minutes, but it also resolved a package interdependency issue that had caused the Red Hat update agent to throw in the towel.  Very impressive!  So much so that I went ahead and upgraded Ximian Evolution, the email program I’m using, without even bothering to read the new features list.  Good on ya, Monkey Men.\nUnfortunately, Evolution Pilot doesn’t seem to recognize my Dana.  But my list of Windows-necessary functions is now down to three.  Adieu, sweet Bill….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-14T18:28:00+00:00"
}