{
  "url": "https://voxday.net/2003/10/27/so-this-is-world-war-iii/",
  "scraped_at": "2025-12-13T15:32:17.638359",
  "title": "So this is World War III",
  "date_display": "October 27, 2003",
  "date_iso": "2003-10-27T11:01:00+00:00",
  "date_from_url": "2003-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em><a href=\"http://www.debka.com/article.php?aid=648\">The points Rumsfeld made</a> include these: The US has no way to measure whether it is winning or losing the global war on terror; we have not made truly “bold moves” to fight terrorists and we are in for “a long, hard slog” in Iraq and Afghanistan. Pointing to Iraq’s al Qaeda-linked Ansar al Islam, Rumsfeld asked: “Are we capturing, killing or deterring and dissuading more terrorists every day than the madrassas and the clerics are recruiting, training and deploying?”  Later, in a briefing to Washington Times staff, he called for a new agency to help fight “a war of ideas” against international terrorism. He suggested a “21st –century information agency in the government” to help in the international battle of ideas, to limit the teaching of terrorism and extremism and to provide better education.”  However, in his memo, he said private organizations could counter Islamist “radical madrassas.”</em></p><p>Clearly, the defense secretary is convinced that the war on terror cannot be won by military victories alone and wants more emphasis on the struggle for hearts and minds. Fighters and defense officials, says Rumsfeld, must start asking themselves: “Are there things we aren’t doing that we might be doing?”</p><p>I don’t always agree with the Defense Secretary, but he’s certainly got a mind of some magnitude and his thinking is always worthy of due respect.  As usual, the press is focusing on irrelevant trivialities from the leaked memo, but there are some interesting points revealed here.  First, it’s pretty clear that the whole “war on terror” and “Islam means peace” line is simply pacification cover for the idiot press and public.  You aren’t concerned about madrassas – Islamic academies – and memes if you don’t view the war as a long-term clash between civilizations, or as the Islamists put it, the inevitable conflict between the Dar al-Islam and the Dar al-Harb.    Also, his mention of the need for private organizations rightly recognizes that government can only accomplish so much in terms of winning a war of ideas and implicitly recognizes – I suspect – that Christian missionaries and aid societies can accomplish more in Iraq at this point than the USMC.  Finally, it’s both true and intriguing that Rumsfeld does not consider successfully invading Afghanistan and Iraq to be bold moves…. though perhaps ending the Saudi, Palestinian and Iranian threats would be.</p><p>I dislike that our government is still hiding the true nature of this revival of war between Islam and the West, I reject the notion that a new propaganda agency will solve anything and I very much distrust the government’s ability to resist the temptation to further assault American liberties while using the war as an excuse.  But until our Islamic enemies are willing to declare a real peace with their Christian, atheist and Hindu foes, it’s still somewhat of a relief to know that those running the show aren’t quite as clueless as they are somehow determined to make themselves appear to be.</p></div>",
  "content_text": "The points Rumsfeld made\ninclude these: The US has no way to measure whether it is winning or losing the global war on terror; we have not made truly “bold moves” to fight terrorists and we are in for “a long, hard slog” in Iraq and Afghanistan. Pointing to Iraq’s al Qaeda-linked Ansar al Islam, Rumsfeld asked: “Are we capturing, killing or deterring and dissuading more terrorists every day than the madrassas and the clerics are recruiting, training and deploying?”  Later, in a briefing to Washington Times staff, he called for a new agency to help fight “a war of ideas” against international terrorism. He suggested a “21st –century information agency in the government” to help in the international battle of ideas, to limit the teaching of terrorism and extremism and to provide better education.”  However, in his memo, he said private organizations could counter Islamist “radical madrassas.”\nClearly, the defense secretary is convinced that the war on terror cannot be won by military victories alone and wants more emphasis on the struggle for hearts and minds. Fighters and defense officials, says Rumsfeld, must start asking themselves: “Are there things we aren’t doing that we might be doing?”\nI don’t always agree with the Defense Secretary, but he’s certainly got a mind of some magnitude and his thinking is always worthy of due respect.  As usual, the press is focusing on irrelevant trivialities from the leaked memo, but there are some interesting points revealed here.  First, it’s pretty clear that the whole “war on terror” and “Islam means peace” line is simply pacification cover for the idiot press and public.  You aren’t concerned about madrassas – Islamic academies – and memes if you don’t view the war as a long-term clash between civilizations, or as the Islamists put it, the inevitable conflict between the Dar al-Islam and the Dar al-Harb.    Also, his mention of the need for private organizations rightly recognizes that government can only accomplish so much in terms of winning a war of ideas and implicitly recognizes – I suspect – that Christian missionaries and aid societies can accomplish more in Iraq at this point than the USMC.  Finally, it’s both true and intriguing that Rumsfeld does not consider successfully invading Afghanistan and Iraq to be bold moves…. though perhaps ending the Saudi, Palestinian and Iranian threats would be.\nI dislike that our government is still hiding the true nature of this revival of war between Islam and the West, I reject the notion that a new propaganda agency will solve anything and I very much distrust the government’s ability to resist the temptation to further assault American liberties while using the war as an excuse.  But until our Islamic enemies are willing to declare a real peace with their Christian, atheist and Hindu foes, it’s still somewhat of a relief to know that those running the show aren’t quite as clueless as they are somehow determined to make themselves appear to be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-27T11:01:00+00:00"
}