{
  "url": "https://voxday.net/2003/10/28/stay-single-young-man/",
  "scraped_at": "2025-12-13T15:32:30.166842",
  "title": "Stay single, young man",
  "date_display": "October 28, 2003",
  "date_iso": "2003-10-28T17:40:00+00:00",
  "date_from_url": "2003-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you or your potential wife-to-be are non-Christians, that is.  I’m serious about this.  Only a woman who believes that her commitment is before God has a reason to take her commitment seriously once the initial romantic high wears off.  Women choose to end <a href=\"http://www.legalexpenseplans.com/divorce.htm\">75 percent</a> of marriages and now, contrary to  what one would assume, are apparently committing nearly <a href=\"http://www.thesun.co.uk/article/0,,5-2003500337,00.html\">half of the adultery</a> as well.</p><p>This is not to say that a Christian wife won’t leave you when she gets bored or fail to decline an affair with a good-looking tennis instructor if you happen to be spending too much time out with the guys.  But at least she has a solid reason not to do so, whereas if her only reason to remain faithful is because she’s in love with you and thinks you’re super spiffy, what do you think is likely to happen if she decides she isn’t in love with you anymore and starts to believe that you are the one responsible for her being miserable?</p><p>I know there are plenty of faithless (in the religious sense) couples who are happily married.  I know a few and I have great respect for them.  And there’s certainly no shortage of Christians who fail to live up to their ideals.  But, as the study is apparently an English one, it demonstrates how a lack of faith is likely to correspond with a lack of long-term committment.  Since the legal deck is heavily stacked against men, the only real solution for young men is to avoid matrimony like the black plague.  This is the strategy that Scandinavian men have pursued, according to a Danish friend of mine, and with some degree of success as 54 percent of the children in Sweden and 46 percent in Denmark are now born illegitimate.  As my friend concludes, you’re going to lose custody anyhow, so you might as well make sure that you’ll be able to preserve your bank account if the relationship falls apart.</p><p>The cost to society will be terrible, of course.  Which is exactly what many Christians argued, to no avail, when the Godless Leap Forward was made two generations ago.  But I can’t, in good conscience, tell a young man that it makes any sense whatsoever for him to marry a woman whose only commitment is emotional and legal, instead of spiritual and eternal.</p></div>",
  "content_text": "If you or your potential wife-to-be are non-Christians, that is.  I’m serious about this.  Only a woman who believes that her commitment is before God has a reason to take her commitment seriously once the initial romantic high wears off.  Women choose to end\n75 percent\nof marriages and now, contrary to  what one would assume, are apparently committing nearly\nhalf of the adultery\nas well.\nThis is not to say that a Christian wife won’t leave you when she gets bored or fail to decline an affair with a good-looking tennis instructor if you happen to be spending too much time out with the guys.  But at least she has a solid reason not to do so, whereas if her only reason to remain faithful is because she’s in love with you and thinks you’re super spiffy, what do you think is likely to happen if she decides she isn’t in love with you anymore and starts to believe that you are the one responsible for her being miserable?\nI know there are plenty of faithless (in the religious sense) couples who are happily married.  I know a few and I have great respect for them.  And there’s certainly no shortage of Christians who fail to live up to their ideals.  But, as the study is apparently an English one, it demonstrates how a lack of faith is likely to correspond with a lack of long-term committment.  Since the legal deck is heavily stacked against men, the only real solution for young men is to avoid matrimony like the black plague.  This is the strategy that Scandinavian men have pursued, according to a Danish friend of mine, and with some degree of success as 54 percent of the children in Sweden and 46 percent in Denmark are now born illegitimate.  As my friend concludes, you’re going to lose custody anyhow, so you might as well make sure that you’ll be able to preserve your bank account if the relationship falls apart.\nThe cost to society will be terrible, of course.  Which is exactly what many Christians argued, to no avail, when the Godless Leap Forward was made two generations ago.  But I can’t, in good conscience, tell a young man that it makes any sense whatsoever for him to marry a woman whose only commitment is emotional and legal, instead of spiritual and eternal.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-28T17:40:00+00:00"
}