{
  "url": "https://voxday.net/2003/10/22/sure-you-can/",
  "scraped_at": "2025-12-13T15:31:34.959232",
  "title": "Sure you can!",
  "date_display": "October 22, 2003",
  "date_iso": "2003-10-22T09:22:00+00:00",
  "date_from_url": "2003-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>“You can’t explain a 12 percent decline in men 18 to 34 or close to 20 percent in men 18 to 24 by saying they’re playing a lot more video games,” said David F. Poltrack, the executive vice president for research at CBS.”</em></p><p><a href=\"http://www.nytimes.com/2003/10/22/business/media/22ADCO.html?ex=1067486400&amp;en=82f335c3c62caef9&amp;ei=5062&amp;partner=GOOGLE\">I don’t watch much television</a>.  There’s only one of my friends who watches television with any degree of regularity, except for the NFL, of course.  Why would any guy waste his time on vegging out in front of the TV, when it is a) stupid, b) boring, c) broken up into five-minute segments and d) propagandistic.  The Internet, computer games and video games are all significantly more entertaining and interesting.  Not to mention books.  I think it’s amusing that the networks try to cram homosexuality and feminist indoctrination down our throats, then are surprised when guys shrug their shoulders, say ‘forget that’ and hit the off button.</p><p>We’re guys, after all.  We don’t make a scene.  We don’t throw hissy fits and protest marches.  We just go away.</p></div>",
  "content_text": "“You can’t explain a 12 percent decline in men 18 to 34 or close to 20 percent in men 18 to 24 by saying they’re playing a lot more video games,” said David F. Poltrack, the executive vice president for research at CBS.”\nI don’t watch much television\n.  There’s only one of my friends who watches television with any degree of regularity, except for the NFL, of course.  Why would any guy waste his time on vegging out in front of the TV, when it is a) stupid, b) boring, c) broken up into five-minute segments and d) propagandistic.  The Internet, computer games and video games are all significantly more entertaining and interesting.  Not to mention books.  I think it’s amusing that the networks try to cram homosexuality and feminist indoctrination down our throats, then are surprised when guys shrug their shoulders, say ‘forget that’ and hit the off button.\nWe’re guys, after all.  We don’t make a scene.  We don’t throw hissy fits and protest marches.  We just go away.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-22T08:22:00+00:00"
}