{
  "url": "https://voxday.net/2003/10/26/they-just-dont-learn/",
  "scraped_at": "2025-12-13T15:32:05.223835",
  "title": "They just don’t learn",
  "date_display": "October 26, 2003",
  "date_iso": "2003-10-26T12:21:00+00:00",
  "date_from_url": "2003-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Neal Stephenson, technoprophet and quite possibly the finest writer of my generation, voiced prescient doubts that Microsoft would be able to wean itself from dependency on its operating systems in his excellent <a href=\"http://www.spack.org/index.cgi/InTheBeginningWasTheCommandLine#head-ea3032d96a9f15c3fed4f4a0d8393dd345f477f4\">In The Beginning was the Command Line</a>.  He saw them as following in Apple’s footsteps, missing the opportunity to make a necessary self-transformation in a futile attempt to protect the increasingly less valuable crown jewels.</p><p>Microsoft’s latest move demonstrates that the dependency is stronger than ever, as after acquiring Virtual PC from Connectix – a means of running multiple operating systems on a single machine – they <a href=\"http://www.msfn.org/comments.php?id=5516&amp;catid=1\">removed mention of Linux</a> and a few other operating systems from the setup wizard.  Jury is still out on whether the Microsoft “improvements” have altogether crippled the product.  This is not only short-sighted, if one accepts Stephenson’s point of view, but borders on downright stupid considering that Microsoft has repeatedly denied that it buys other companies simply to shut them down and avoid competition.  Not that Microsoft has a whole lot of credibility anymore.  (Reader DZ points out that this <a href=\"http://msn.computeractive.co.uk/News/1143906\">isn’t the first time</a>, either.)</p><p>One is reminded of Lenin’s famous quote about capitalists selling the rope that will be used one day to hang them.</p></div>",
  "content_text": "Neal Stephenson, technoprophet and quite possibly the finest writer of my generation, voiced prescient doubts that Microsoft would be able to wean itself from dependency on its operating systems in his excellent\nIn The Beginning was the Command Line\n.  He saw them as following in Apple’s footsteps, missing the opportunity to make a necessary self-transformation in a futile attempt to protect the increasingly less valuable crown jewels.\nMicrosoft’s latest move demonstrates that the dependency is stronger than ever, as after acquiring Virtual PC from Connectix – a means of running multiple operating systems on a single machine – they\nremoved mention of Linux\nand a few other operating systems from the setup wizard.  Jury is still out on whether the Microsoft “improvements” have altogether crippled the product.  This is not only short-sighted, if one accepts Stephenson’s point of view, but borders on downright stupid considering that Microsoft has repeatedly denied that it buys other companies simply to shut them down and avoid competition.  Not that Microsoft has a whole lot of credibility anymore.  (Reader DZ points out that this\nisn’t the first time\n, either.)\nOne is reminded of Lenin’s famous quote about capitalists selling the rope that will be used one day to hang them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-26T12:21:00+00:00"
}