{
  "url": "https://voxday.net/2003/10/17/tmq-apologizes/",
  "scraped_at": "2025-12-13T15:30:54.591650",
  "title": "TMQ apologizes….",
  "date_display": "October 17, 2003",
  "date_iso": "2003-10-17T21:37:00+00:00",
  "date_from_url": "2003-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Along with Ralph Wiley and the Sports Guy, Tuesday Morning Quarterback is the best thing about ESPN’s Page 2.  TMQ, or Gregg Easterbrook, is also an editor of The New Republic, a left-liberal magazine of some regard.  Although he <a href=\"http://www.tnr.com/easterbrook.mhtml\"> did apologize </a> for the way in which he felt he mangled his words, I don’t really see that he had anything for which to do so and I’m glad to see that he’s standing his ground on the substance, if not the style, of his remarks.  Jews, no less than Christians, have a responsibility to answer to God for their actions and decisions, and I think it is eminently reasonable to question both Michael Eisner and Harvey Weinstein for their decision to inflict what is apparently a new low in movie-making violence on the American public.  No executive – Christian, atheist or Jew – should be permitted to hide behind modern guilt over historical prejudices in an attempt to escape being held responsible for what appears to be another vicious assault on the values of our civilization.</p><p>The very notion that one needs to watch one’s tongue about implying that Jews, as opposed to Christians or atheists, are inordinately interested in money several hundred years after the Catholic prohibition on usury was broken is ridiculous.  Jews have far more serious problems these days, for example, the fact that the schools in many Muslim countries are teaching another generation of children to believe that one day the trees will cry “O Muslim, there is a Jew hiding behind me, come and kill him!”  And while the Euro elite sneers in scorn, hoping secretly that someone else will finish the job their grandfathers started.</p><p>But that’s just my opinion.  As I’ve written before, the Jewish people, in addition to suffering the unwarranted hatred of the nations, have also been remarkably stupid at times with regards to their own self-preservation in the past.  Why on earth would they be concerned now with the opinion of a Gregg Easterbrook, while Israeli leaders like Shimon Peres and Binyamin Ben-Eliezer are attempting to lead the Jewish people down the fatal path of Mordechai Rumkowski and Jacob Gens?</p></div>",
  "content_text": "Along with Ralph Wiley and the Sports Guy, Tuesday Morning Quarterback is the best thing about ESPN’s Page 2.  TMQ, or Gregg Easterbrook, is also an editor of The New Republic, a left-liberal magazine of some regard.  Although he\ndid apologize\nfor the way in which he felt he mangled his words, I don’t really see that he had anything for which to do so and I’m glad to see that he’s standing his ground on the substance, if not the style, of his remarks.  Jews, no less than Christians, have a responsibility to answer to God for their actions and decisions, and I think it is eminently reasonable to question both Michael Eisner and Harvey Weinstein for their decision to inflict what is apparently a new low in movie-making violence on the American public.  No executive – Christian, atheist or Jew – should be permitted to hide behind modern guilt over historical prejudices in an attempt to escape being held responsible for what appears to be another vicious assault on the values of our civilization.\nThe very notion that one needs to watch one’s tongue about implying that Jews, as opposed to Christians or atheists, are inordinately interested in money several hundred years after the Catholic prohibition on usury was broken is ridiculous.  Jews have far more serious problems these days, for example, the fact that the schools in many Muslim countries are teaching another generation of children to believe that one day the trees will cry “O Muslim, there is a Jew hiding behind me, come and kill him!”  And while the Euro elite sneers in scorn, hoping secretly that someone else will finish the job their grandfathers started.\nBut that’s just my opinion.  As I’ve written before, the Jewish people, in addition to suffering the unwarranted hatred of the nations, have also been remarkably stupid at times with regards to their own self-preservation in the past.  Why on earth would they be concerned now with the opinion of a Gregg Easterbrook, while Israeli leaders like Shimon Peres and Binyamin Ben-Eliezer are attempting to lead the Jewish people down the fatal path of Mordechai Rumkowski and Jacob Gens?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-17T20:37:00+00:00"
}