{
  "url": "https://voxday.net/2003/10/21/update-on-linux-distro-recommendations/",
  "scraped_at": "2025-12-13T15:31:29.809344",
  "title": "Update on Linux distro recommendations",
  "date_display": "October 21, 2003",
  "date_iso": "2003-10-21T14:48:00+00:00",
  "date_from_url": "2003-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not asking for a vote on the matter or anything, but just in case anyone happens to care, there have been 15 folks, about half of whom are <em>not</em> Mandrake users, who’ve suggested <a href=\"http://www.mandrakelinux.com/en/ftp.php3\">Mandrake 9.2</a> as being the ideal distro for beginners, two who’ve suggested Libranet/Debian, one Debian user who recommends not using Debian if you’re coming from Windows, three Lindows supporters and two SUSE advocates.  Oh, and two bitter Windows lovers who are taking my migration WAY too personally.</p><p>The general view appears to be that Redhat, despite its virtues, is perhaps a little too corporate-focused for the home user.  But the most significant point, I think, is that Linux in all its flavors is now a proven option now for the power Windows user.  For those who are using Redhat, <a href=\"http://freshrpms.net/\">FreshRPMs</a> is definitely a site worth bookmarking.</p></div>",
  "content_text": "I’m not asking for a vote on the matter or anything, but just in case anyone happens to care, there have been 15 folks, about half of whom are\nnot\nMandrake users, who’ve suggested\nMandrake 9.2\nas being the ideal distro for beginners, two who’ve suggested Libranet/Debian, one Debian user who recommends not using Debian if you’re coming from Windows, three Lindows supporters and two SUSE advocates.  Oh, and two bitter Windows lovers who are taking my migration WAY too personally.\nThe general view appears to be that Redhat, despite its virtues, is perhaps a little too corporate-focused for the home user.  But the most significant point, I think, is that Linux in all its flavors is now a proven option now for the power Windows user.  For those who are using Redhat,\nFreshRPMs\nis definitely a site worth bookmarking.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-21T13:48:00+00:00"
}