{
  "url": "https://voxday.net/2003/10/14/waiting-for-mr-franken/",
  "scraped_at": "2025-12-13T15:30:32.205751",
  "title": "Waiting for Mr. Franken",
  "date_display": "October 14, 2003",
  "date_iso": "2003-10-14T08:43:00+00:00",
  "date_from_url": "2003-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I still haven’t heard a response from Al Franken, the great champion of Democratic Party manhood.  I assume he’s simply been tied up with his book tour, but in case he somehow missed seeing <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=34828\">the column in which I posed a challenge </a>to him, I decided to send the following email to his press agent.</p><p><em>Dear Mr. Franken,</em></p><p>I’m a little disappointed that I have not heard from you as yet.  Perhaps this column did not happen to come to your attention, in which case I am rectifying matters by sending this to you here.  I should also like to interview you, either pre- or post-incontro della contesa.</p><p>Very best regards,<br> <br>Vox Day<br> <br>Universal Press Syndicate</br></br></br></br></p><p>I hope he’ll get in touch with me soon.  I was also interested to see that Rich Lowry has finally <a href=\"http://www.townhall.com/columnists/richlowry/rl20031013.shtml\">addressed the question </a>of Mr. Franken’s slur on his character, although I’m disappointed that Mr. Lowry seems content to contest the matter on the field of words, not combat.  My profile is quite a bit lower than the editor of the <a href=\"http://www.nationalreview.com/\">National Review</a>, but I still feel that it’s a real pity Mr. Franken did not address his original challenge to me.  I would have been happy to take him up on it.</p><p>Anyhow, Mr. Franken, I eagerly await your response.</p></div>",
  "content_text": "I still haven’t heard a response from Al Franken, the great champion of Democratic Party manhood.  I assume he’s simply been tied up with his book tour, but in case he somehow missed seeing\nthe column in which I posed a challenge\nto him, I decided to send the following email to his press agent.\nDear Mr. Franken,\nI’m a little disappointed that I have not heard from you as yet.  Perhaps this column did not happen to come to your attention, in which case I am rectifying matters by sending this to you here.  I should also like to interview you, either pre- or post-incontro della contesa.\nVery best regards,\nVox Day\nUniversal Press Syndicate\nI hope he’ll get in touch with me soon.  I was also interested to see that Rich Lowry has finally\naddressed the question\nof Mr. Franken’s slur on his character, although I’m disappointed that Mr. Lowry seems content to contest the matter on the field of words, not combat.  My profile is quite a bit lower than the editor of the\nNational Review\n, but I still feel that it’s a real pity Mr. Franken did not address his original challenge to me.  I would have been happy to take him up on it.\nAnyhow, Mr. Franken, I eagerly await your response.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-14T07:43:00+00:00"
}