{
  "url": "https://voxday.net/2003/10/16/when-murder-isnt-murder/",
  "scraped_at": "2025-12-13T15:30:49.666324",
  "title": "When murder isn’t murder",
  "date_display": "October 16, 2003",
  "date_iso": "2003-10-16T14:34:00+00:00",
  "date_from_url": "2003-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So it looks like the government courts, having decided that it’s just fine to murder unborn babies, have now made the long-predicted next step of approving involuntary euthanasia by starving Terry Schiavo to death.  And if you don’t think depriving someone who can’t feed herself is murder, then just don’t feed an infant for a few months and see if you’re charged with a crime – not that <a href=\"http://www.petersingerlinks.com/abortion.htm\"> Dr. Peter Singer </a> thinks there’s anything wrong with that.  Apparently it’s been decided that we’re to go the way of Holland, where the doctors of death have been creating their own mini-massacre behind closed doors for almost 20 years now:</p><p><em>Euthanasia in The Netherlands is “beyond effective control”, according to a report which shows that one in five assisted suicides is without explicit consent. British opponents of assisted suicide say that the figures are a warning of the dangers of decriminalising euthanasia, as Holland did in 1984. By 1995 cases of euthanasia and assisted suicide in Holland had risen to almost 3 per cent of all deaths. The Dutch survey, reviewed in the Journal of Medical Ethics, looked at the figures for 1995 and found that as well as 3,600 authorized cases there were 900 others in which doctors had acted without explicit consent. A follow-up survey found that the main reason for not consulting patients was that they had dementia or were otherwise not competent.</em></p><p>Doesn’t anyone else see that there is a connection between these cardinal beliefs of the American left and their globalist counterparts?</p><p>1.  There are too many people: (environmentalism, overpopulation worries, etc.)<br> <br>2.  Abortion must remain legal.  (kill the unborn)<br> <br>3.  Irresponsible homosexual behavior must be indulged.  (kill the queers)<br> <br>4.  Suicide and involuntary euthanasia  must be made legal.  (kill the incompetent and the unfit)</br></br></br></br></br></br></p><p>It makes sense, of course.  If there are too many people, then why not just kill off the weak, the sick and the unproductive.  Think of it as intelligent evolution in action, plus, it would surely keep Social Security solvent for another decade or two.  And eventually they’ll get around to those pesky Jews, like they always do.</p></div>",
  "content_text": "So it looks like the government courts, having decided that it’s just fine to murder unborn babies, have now made the long-predicted next step of approving involuntary euthanasia by starving Terry Schiavo to death.  And if you don’t think depriving someone who can’t feed herself is murder, then just don’t feed an infant for a few months and see if you’re charged with a crime – not that\nDr. Peter Singer\nthinks there’s anything wrong with that.  Apparently it’s been decided that we’re to go the way of Holland, where the doctors of death have been creating their own mini-massacre behind closed doors for almost 20 years now:\nEuthanasia in The Netherlands is “beyond effective control”, according to a report which shows that one in five assisted suicides is without explicit consent. British opponents of assisted suicide say that the figures are a warning of the dangers of decriminalising euthanasia, as Holland did in 1984. By 1995 cases of euthanasia and assisted suicide in Holland had risen to almost 3 per cent of all deaths. The Dutch survey, reviewed in the Journal of Medical Ethics, looked at the figures for 1995 and found that as well as 3,600 authorized cases there were 900 others in which doctors had acted without explicit consent. A follow-up survey found that the main reason for not consulting patients was that they had dementia or were otherwise not competent.\nDoesn’t anyone else see that there is a connection between these cardinal beliefs of the American left and their globalist counterparts?\n1.  There are too many people: (environmentalism, overpopulation worries, etc.)\n2.  Abortion must remain legal.  (kill the unborn)\n3.  Irresponsible homosexual behavior must be indulged.  (kill the queers)\n4.  Suicide and involuntary euthanasia  must be made legal.  (kill the incompetent and the unfit)\nIt makes sense, of course.  If there are too many people, then why not just kill off the weak, the sick and the unproductive.  Think of it as intelligent evolution in action, plus, it would surely keep Social Security solvent for another decade or two.  And eventually they’ll get around to those pesky Jews, like they always do.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-16T13:34:00+00:00"
}