{
  "url": "https://voxday.net/2003/10/25/where-hitler-feared-to-tread/",
  "scraped_at": "2025-12-13T15:32:00.061152",
  "title": "Where Hitler feared to tread",
  "date_display": "October 25, 2003",
  "date_iso": "2003-10-25T10:14:00+00:00",
  "date_from_url": "2003-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>“The EU has even described Switzerland’s position on <a href=\"http://www.swissinfo.ch/sen/swissinfo.html?siteSect=105&amp;sid=4368244\">future membership of the bloc</a> as ‘controversial’.  Commentators say Brussels has always seen the bilaterals as a first stage towards full membership of the bloc – a view certainly not held by the People’s Party.  And they believe Brussels would be unwilling to continue negotiations if it thought Switzerland was reneging on this unspoken promise.  ‘If this were withdrawn, it would be difficult to explain to the EU member countries why Switzerland had been working on special accords with the EU’, said a EU commissioner.”</em></p><p>Of course, when getting the first bilateral agreement approved, the Swiss government absolutely denied that its approval had anything to do with joining <em>Europe Uber alles</em>.  And the Swiss people voted heavily against putting their necks in the Eurofascist noose, with 80 percent of the population voting against even holding discussions to join the EU in 2001.  Which leads one to wonder just what that unspoken promise was, and by whom it was given, since all four of the parties in government were officially against joining the EU at the time.</p><p>But it’s clear now that three of them were lying, as less than two years later, the Christian Democrats, the Radicals and the Social Democrats are now all lobbying openly for Switzerland to join up.  Which, no doubt, is exactly what has propelled the People’s Party from a distant fourth place to first.  It’s not too hard to see how the other three parties might find common ground with the anti-democratic EU, though, since they are banding together to deny the People’s Party, the top vote-getter in the most recent national elections, <a href=\"http://www.swissinfo.ch/sen/Swissinfo.html?siteSect=111&amp;sid=4359148\">a second ministry of the seven available</a>.</p><p>This is not the first time that talk of the inevitability of European union has been heard in Switzerland. <a href=\"http://www.stephenhalbrook.com/target.html\">Target Switzerland</a> is an excellent history of the Third Reich’s failed attempt to swallow the small Alpine country.  Here’s hoping the new Fourth Reich will have no better success.</p></div>",
  "content_text": "“The EU has even described Switzerland’s position on\nfuture membership of the bloc\nas ‘controversial’.  Commentators say Brussels has always seen the bilaterals as a first stage towards full membership of the bloc – a view certainly not held by the People’s Party.  And they believe Brussels would be unwilling to continue negotiations if it thought Switzerland was reneging on this unspoken promise.  ‘If this were withdrawn, it would be difficult to explain to the EU member countries why Switzerland had been working on special accords with the EU’, said a EU commissioner.”\nOf course, when getting the first bilateral agreement approved, the Swiss government absolutely denied that its approval had anything to do with joining\nEurope Uber alles\n.  And the Swiss people voted heavily against putting their necks in the Eurofascist noose, with 80 percent of the population voting against even holding discussions to join the EU in 2001.  Which leads one to wonder just what that unspoken promise was, and by whom it was given, since all four of the parties in government were officially against joining the EU at the time.\nBut it’s clear now that three of them were lying, as less than two years later, the Christian Democrats, the Radicals and the Social Democrats are now all lobbying openly for Switzerland to join up.  Which, no doubt, is exactly what has propelled the People’s Party from a distant fourth place to first.  It’s not too hard to see how the other three parties might find common ground with the anti-democratic EU, though, since they are banding together to deny the People’s Party, the top vote-getter in the most recent national elections,\na second ministry of the seven available\n.\nThis is not the first time that talk of the inevitability of European union has been heard in Switzerland.\nTarget Switzerland\nis an excellent history of the Third Reich’s failed attempt to swallow the small Alpine country.  Here’s hoping the new Fourth Reich will have no better success.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-25T09:14:00+00:00"
}