{
  "url": "https://voxday.net/2003/10/21/wow/",
  "scraped_at": "2025-12-13T15:31:22.503224",
  "title": "Wow!",
  "date_display": "October 21, 2003",
  "date_iso": "2003-10-21T07:22:00+00:00",
  "date_from_url": "2003-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>According to Sitemeter, there were 2,000 visits yesterday on only the 12th day of this blog.  Thanks for stopping by, everyone!  The Truth Laid Bear even had Vox Popoli ranked in the <a href=\"http://www.truthlaidbear.com/TrafficRanking.php\">Blogosphere’s top 150</a>, much to my surprise.  Another thing that was kind of cool was seeing that both <a href=\"http://linuxtoday.com/infrastructure/2003102001726OPDTSW\">Linux Today</a> and <a href=\"http://www.linux.org\">Linux.org</a> provided links to yesterday’s column on their front page; there’s also a number of Talkback responses on Linux Today which are interesting to read.  One thing I noticed there that a few people who know a lot more about Linux than I do seem to have misunderstood is that I was not recommending RedHat because I think it is the best distro, I was recommending it because, as a longtime Windows user, I have seen that it works and can be installed by a reasonable Windows user with a bit of a clue.</p><p>I assume the same is true of Mandrake and a few other distros, <em>but I don’t know it from my own experience</em>.  Nor, as a user and not a hacker, am I going to install various OSs on my system just to see which one is ideal   Okay, I am thinking of messing around with Mandrake and Debian on one of my other machines and I’ll certainly offer up a report when I do so, but it’s important to keep in mind that Windows users don’t think in term of distros the way Linux users do.  To them, (until a week ago, us), Linux is a single entity, and it’s important to understand that yes, you too can make the migration.</p><p>Finally, a surprising number of people don’t seem to understand what a monopoly is.  From Merriam-Webster:</p><p><strong>MONOPOLY</strong><br> <br>1 : exclusive ownership through legal privilege, command of supply, or concerted action<br> <br>2 : exclusive possession or control<br> <br>3 : a commodity controlled by one party</br></br></br></br></br></br></p><p>Does Microsoft have exclusive ownership of the only OS, desktop or browser?  No.  Does Microsoft have exclusive possession or control?  No.  Is the desktop environment a commodity?  No.  I have said it before and I will say it again.  Microsoft is an evil and dangerous corporate empire.  It is not, however, a monopoly.</p></div>",
  "content_text": "According to Sitemeter, there were 2,000 visits yesterday on only the 12th day of this blog.  Thanks for stopping by, everyone!  The Truth Laid Bear even had Vox Popoli ranked in the\nBlogosphere’s top 150\n, much to my surprise.  Another thing that was kind of cool was seeing that both\nLinux Today\nand\nLinux.org\nprovided links to yesterday’s column on their front page; there’s also a number of Talkback responses on Linux Today which are interesting to read.  One thing I noticed there that a few people who know a lot more about Linux than I do seem to have misunderstood is that I was not recommending RedHat because I think it is the best distro, I was recommending it because, as a longtime Windows user, I have seen that it works and can be installed by a reasonable Windows user with a bit of a clue.\nI assume the same is true of Mandrake and a few other distros,\nbut I don’t know it from my own experience\n.  Nor, as a user and not a hacker, am I going to install various OSs on my system just to see which one is ideal   Okay, I am thinking of messing around with Mandrake and Debian on one of my other machines and I’ll certainly offer up a report when I do so, but it’s important to keep in mind that Windows users don’t think in term of distros the way Linux users do.  To them, (until a week ago, us), Linux is a single entity, and it’s important to understand that yes, you too can make the migration.\nFinally, a surprising number of people don’t seem to understand what a monopoly is.  From Merriam-Webster:\nMONOPOLY\n1 : exclusive ownership through legal privilege, command of supply, or concerted action\n2 : exclusive possession or control\n3 : a commodity controlled by one party\nDoes Microsoft have exclusive ownership of the only OS, desktop or browser?  No.  Does Microsoft have exclusive possession or control?  No.  Is the desktop environment a commodity?  No.  I have said it before and I will say it again.  Microsoft is an evil and dangerous corporate empire.  It is not, however, a monopoly.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-21T06:22:00+00:00"
}