{
  "url": "https://voxday.net/2003/10/08/you-never-write-you-never-ca/",
  "scraped_at": "2025-12-13T15:30:07.612478",
  "title": "You never write, you never call….",
  "date_display": "October 8, 2003",
  "date_iso": "2003-10-08T10:46:00+00:00",
  "date_from_url": "2003-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I couldn’t help but notice some similarities today between <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=34982\">Patrick Buchanan’s column </a>on the Rush Limbaugh NFL controversy today and <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=34934\">my own</a>.  On Monday, I wrote: “It is shocking, however, that he chose to resign so quickly, rather than force ESPN to show its timorous hand by firing him for daring to speak out on an issue around which the cowardly sports media has danced so delicately for decades.”</p><p>Meanwhile, Mr. Buchanan wrote: “But, as a friend said wisely, Rush should not have resigned. He should have forced the weenies at ESPN to fire him and to publish the reason why they were doing it, so the world could see how craven they are.”</p><p>Now, this is hardly an original point – it’s not exactly akin to the simultaneous development of calculus, to say the least – but I am mildly curious to know if perhaps I happen to be that friend of whom Mr. Buchanan spoke with such regard.  Probably not, since I suppose he writes his column several days in advance, in which case he would not have seen my column.  But it’s remotely possible, and if it is the case, this leaves me with two questions:</p><p>1)  Why mention Slate and Barra, but not WorldNetDaily and my own bad self?</p><p>2)  When are we going to hang out?  I don’t know about you, but I have the definite impression that hanging out with Mr. Patrick J. Buchanan promises a good time.  Not as good a time as, say, David Spade or The Dallas Cowboys Cheerleaders, but a good time nonetheless.<br/></p></div>",
  "content_text": "I couldn’t help but notice some similarities today between\nPatrick Buchanan’s column\non the Rush Limbaugh NFL controversy today and\nmy own\n.  On Monday, I wrote: “It is shocking, however, that he chose to resign so quickly, rather than force ESPN to show its timorous hand by firing him for daring to speak out on an issue around which the cowardly sports media has danced so delicately for decades.”\nMeanwhile, Mr. Buchanan wrote: “But, as a friend said wisely, Rush should not have resigned. He should have forced the weenies at ESPN to fire him and to publish the reason why they were doing it, so the world could see how craven they are.”\nNow, this is hardly an original point – it’s not exactly akin to the simultaneous development of calculus, to say the least – but I am mildly curious to know if perhaps I happen to be that friend of whom Mr. Buchanan spoke with such regard.  Probably not, since I suppose he writes his column several days in advance, in which case he would not have seen my column.  But it’s remotely possible, and if it is the case, this leaves me with two questions:\n1)  Why mention Slate and Barra, but not WorldNetDaily and my own bad self?\n2)  When are we going to hang out?  I don’t know about you, but I have the definite impression that hanging out with Mr. Patrick J. Buchanan promises a good time.  Not as good a time as, say, David Spade or The Dallas Cowboys Cheerleaders, but a good time nonetheless.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-08T09:46:00+00:00"
}