{
  "url": "https://voxday.net/2003/10/28/zero-sum-zeros/",
  "scraped_at": "2025-12-13T15:32:28.313107",
  "title": "Zero-sum zeros",
  "date_display": "October 28, 2003",
  "date_iso": "2003-10-28T15:20:00+00:00",
  "date_from_url": "2003-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have been a supporter of US Women’s Soccer and the WUSA for five years, but no more.  I’ll have no part in supporting anything for which the feminasties are waving the pink flag.  Julie Foudy, the loud-mouthed former national team player and Reichsfuhrer of the Women’s Sports Foundation, has repeatedly revealed herself as a sexist opportunist who will brook no criticism of Title IX, however valid, as BYU swimming coach Tim Powers <a href=\"http://www.nationalreview.com/comment/powers200310280823.asp\">points out</a>:</p><p><em>Cynthia Cooper, the WNBA player who co-chaired the commission, tried in vain to raise these very points. “The law of Title IX stays as is,” she explained during a recent hearing. “We are talking about the three-part test. Are you attending a university to play sports? If not, then why should you be counted for proportionality?”   Cooper was quickly rebuked by Julie Foudy, president of the Women’s Sports Foundation, who argued “If 3 percent of airline pilots are Black, does that means that Blacks are afraid of flying?” Foudy went on to call Cooper’s ideas “crazy” and “dangerous” — exactly the kind of invective that greets anyone who dares to challenge proportionality.</em></p><p>Nice logic, Foudy, and tasteful too, considering that Cynthia Cooper is black.  Right, it’s crazy and dangerous to suggest that it is possible – possible – that on some college campuses, there are more men than women who wish to play sports.  And if there are, Foudy wants them to sit down and forget about it.  What a joke.  If women want to turn sports into a zero-sum game, then so be it.  Perhaps men should boycott the WNBA.  Oh, never mind, what’s the point?  It’s not like anyone watches it anyhow.</p></div>",
  "content_text": "I have been a supporter of US Women’s Soccer and the WUSA for five years, but no more.  I’ll have no part in supporting anything for which the feminasties are waving the pink flag.  Julie Foudy, the loud-mouthed former national team player and Reichsfuhrer of the Women’s Sports Foundation, has repeatedly revealed herself as a sexist opportunist who will brook no criticism of Title IX, however valid, as BYU swimming coach Tim Powers\npoints out\n:\nCynthia Cooper, the WNBA player who co-chaired the commission, tried in vain to raise these very points. “The law of Title IX stays as is,” she explained during a recent hearing. “We are talking about the three-part test. Are you attending a university to play sports? If not, then why should you be counted for proportionality?”   Cooper was quickly rebuked by Julie Foudy, president of the Women’s Sports Foundation, who argued “If 3 percent of airline pilots are Black, does that means that Blacks are afraid of flying?” Foudy went on to call Cooper’s ideas “crazy” and “dangerous” — exactly the kind of invective that greets anyone who dares to challenge proportionality.\nNice logic, Foudy, and tasteful too, considering that Cynthia Cooper is black.  Right, it’s crazy and dangerous to suggest that it is possible – possible – that on some college campuses, there are more men than women who wish to play sports.  And if there are, Foudy wants them to sit down and forget about it.  What a joke.  If women want to turn sports into a zero-sum game, then so be it.  Perhaps men should boycott the WNBA.  Oh, never mind, what’s the point?  It’s not like anyone watches it anyhow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2003-10-28T15:20:00+00:00"
}