{
  "url": "https://voxday.net/2023/02/01/castalia-library-the-arts-of-war/",
  "scraped_at": "2026-01-08T13:46:13.447001",
  "title": "Castalia Library: THE ARTS OF WAR",
  "date_display": "February 1, 2023",
  "date_iso": "2023-02-01T14:08:45+00:00",
  "date_from_url": "2023-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As was previously mentioned on the Darkstream, the Jan-Feb subscription book is THE ARTS OF WAR. This will feature ancient military treatises on the art of war, one of which is very famous and most of which will be entirely new to even the historical military enthusiast. The included selections are as follows:</p><ul class=\"wp-block-list\"><li>Sun Tzu, <em>The Art of War</em></li><li>Asclepiodotus, <em>Taktika</em></li><li>Aeneas Tacticus, <em>Poliorketika</em></li><li>Sextus Frontinus, <em>Strategemata</em></li><li>Vegetius, <em>De Re Militari</em></li><li>Maurice, <em>Strategikon</em></li><li>Onasander, <em>Strategikos</em></li></ul><p>The book will feature a foreword by Alex Macris, formerly of West Point, and an introduction by yours truly. Depending upon how well it is received, it may become the first in a series, as there are a number of medieval, Renaissance, and modern texts that are thematically relevant, but at the very least, it will serve as an epic historical must-read. So if you aren’t a subscriber yet, you may want to consider <a href=\"https://arkhavencomics.com/product/castalia-library-subscription/\">joining the Library</a> now.</p><p>It may interest Selenoth fans to know that the <em>Arts of Light and Dark</em> series repeatedly references Sextus Frontinus, particularly the Marcus Valerius chapters. And speaking of AODAL, both <a href=\"https://arkhavencomics.com/product/atob1-library-edition/\"><em>A THRONE OF BONES </em>Book 1</a> and <a href=\"https://arkhavencomics.com/product/atob2-library-edition/\"><em>A THRONE OF BONES</em> Book 2</a> are now shipping, and ATOB Book 1 is the February Book of the Month. As of this morning, about 65 copies of each limited edition of 850 remain available.</p><p>January was a productive month on the writing front. I exceeded my goal of 31,000 words, putting in 34,529 on <em>A SEA OF SKULLS</em> and 2,019 on other fiction. At this rate, I expect to finish the first draft of ASOS on or before March 3rd. There will be a little back-and-forth with the first readers and cleaning up any inconsistencies or infelicities, but the ebook should be out sometime in May. I plan to use the ebook release to catch any further typos or errors, so the print edition should be out around August, and the two-volume Library set will be based upon the print edition and will probably serve as the subscription books toward the end of the year or the beginning of 2024.</p><p>The bindery tells us that <em>THE JUNGLE BOOKS</em> will begin production on February 20th, followed by the four Taleb books on February 24th. We plan to launch the new Castalia Library site at the end of the month, but more about that anon.</p><p>Finally, we’re going to be putting the first three Finnish AODAL books in print this year. If there are any native speakers interested in translating them into German, French, or Italian, please let me know.</p><p><em><a href=\"https://social.infogalactic.com/micropost/37f07a53-94f7-4727-9ac3-52c2d13e9576\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "As was previously mentioned on the Darkstream, the Jan-Feb subscription book is THE ARTS OF WAR. This will feature ancient military treatises on the art of war, one of which is very famous and most of which will be entirely new to even the historical military enthusiast. The included selections are as follows:\nSun Tzu,\nThe Art of War\nAsclepiodotus,\nTaktika\nAeneas Tacticus,\nPoliorketika\nSextus Frontinus,\nStrategemata\nVegetius,\nDe Re Militari\nMaurice,\nStrategikon\nOnasander,\nStrategikos\nThe book will feature a foreword by Alex Macris, formerly of West Point, and an introduction by yours truly. Depending upon how well it is received, it may become the first in a series, as there are a number of medieval, Renaissance, and modern texts that are thematically relevant, but at the very least, it will serve as an epic historical must-read. So if you aren’t a subscriber yet, you may want to consider\njoining the Library\nnow.\nIt may interest Selenoth fans to know that the\nArts of Light and Dark\nseries repeatedly references Sextus Frontinus, particularly the Marcus Valerius chapters. And speaking of AODAL, both\nA THRONE OF BONES\nBook 1\nand\nA THRONE OF BONES\nBook 2\nare now shipping, and ATOB Book 1 is the February Book of the Month. As of this morning, about 65 copies of each limited edition of 850 remain available.\nJanuary was a productive month on the writing front. I exceeded my goal of 31,000 words, putting in 34,529 on\nA SEA OF SKULLS\nand 2,019 on other fiction. At this rate, I expect to finish the first draft of ASOS on or before March 3rd. There will be a little back-and-forth with the first readers and cleaning up any inconsistencies or infelicities, but the ebook should be out sometime in May. I plan to use the ebook release to catch any further typos or errors, so the print edition should be out around August, and the two-volume Library set will be based upon the print edition and will probably serve as the subscription books toward the end of the year or the beginning of 2024.\nThe bindery tells us that\nTHE JUNGLE BOOKS\nwill begin production on February 20th, followed by the four Taleb books on February 24th. We plan to launch the new Castalia Library site at the end of the month, but more about that anon.\nFinally, we’re going to be putting the first three Finnish AODAL books in print this year. If there are any native speakers interested in translating them into German, French, or Italian, please let me know.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-01T14:59:36+00:00"
}