{
  "url": "https://voxday.net/2023/02/13/chernohio/",
  "scraped_at": "2026-01-08T13:47:33.374085",
  "title": "Chernohio",
  "date_display": "February 13, 2023",
  "date_iso": "2023-02-13T10:47:42+00:00",
  "date_from_url": "2023-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At this point, there is no way one can assume government stupidity is responsible for <a href=\"https://www.nbcnews.com/news/us-news/fearing-explosion-officials-release-toxic-chemical-ohio-train-derailme-rcna69405\">the toxic outcome </a>of the chemical train cars derailed in East Palestine, Ohio. Never attribute to stupidity that which is adequately explained by malice.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Officials on Monday completed the release of toxic chemicals that had been carried on a train that derailed over the weekend in eastern Ohio. Officials had warned that the chemical could be deadly if inhaled.</p><p>The release of vinyl chloride, a toxic, flammable gas used to produce vehicle interiors and PVC piping, was completed late Monday afternoon after evacuations were expanded from East Palestine, Ohio, the site of Friday night’s derailment, to an adjacent community in Pennsylvania.</p><p>The release was “successfully completed,” according to the train’s operator, Norfolk Southern. A burn-off of material would continue past nightfall, it said.</p><p>A federal Emergency Alert System message on Monday urged residents in East Palestine and Pennsylvania’s Darlington Township to leave immediately.</p></blockquote><p>There are various <a href=\"https://gab.com/B_Boop/posts/109855690567394978\">reports on social media</a> of wildlife and pets dying and reporters being arrested, while the mainstream media has been covering the story in the most anodyne possible terms. It’s too soon, and the information is too restricted, for us to have any idea how bad the situation is, but it appears likely that the matter is more serious than has been initially reported.</p><p>The fact that the town is named “Palestine” may also be significant for symbolic reasons.</p><p><em><a href=\"https://social.infogalactic.com/micropost/28f7da1f-2489-4c2d-8b81-db3318dedb04\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "At this point, there is no way one can assume government stupidity is responsible for\nthe toxic outcome\nof the chemical train cars derailed in East Palestine, Ohio. Never attribute to stupidity that which is adequately explained by malice.\nOfficials on Monday completed the release of toxic chemicals that had been carried on a train that derailed over the weekend in eastern Ohio. Officials had warned that the chemical could be deadly if inhaled.\nThe release of vinyl chloride, a toxic, flammable gas used to produce vehicle interiors and PVC piping, was completed late Monday afternoon after evacuations were expanded from East Palestine, Ohio, the site of Friday night’s derailment, to an adjacent community in Pennsylvania.\nThe release was “successfully completed,” according to the train’s operator, Norfolk Southern. A burn-off of material would continue past nightfall, it said.\nA federal Emergency Alert System message on Monday urged residents in East Palestine and Pennsylvania’s Darlington Township to leave immediately.\nThere are various\nreports on social media\nof wildlife and pets dying and reporters being arrested, while the mainstream media has been covering the story in the most anodyne possible terms. It’s too soon, and the information is too restricted, for us to have any idea how bad the situation is, but it appears likely that the matter is more serious than has been initially reported.\nThe fact that the town is named “Palestine” may also be significant for symbolic reasons.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "news"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-13T10:47:44+00:00"
}