{
  "url": "https://voxday.net/2023/02/14/china-calls-out-surveillance/",
  "scraped_at": "2026-01-08T13:47:42.815971",
  "title": "China Calls Out Surveillance",
  "date_display": "February 14, 2023",
  "date_iso": "2023-02-14T12:32:10+00:00",
  "date_from_url": "2023-02-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wait, what’s that sound. It sounds like they’re playing… <a href=\"http://belfast.china-consulate.gov.cn/eng/wjbfyrth_3/202302/t20230213_11024546.htm\">that’s AC’s music!</a> This unusually direct accusation by the Chinese Foreign Ministry is ostensibly in response to the US Air Force shooting down the rogue Chinese weather balloon, and <em>perhaps</em> that is all it is, but the repeated references to “No. 1 spy empire” and “absolute No. 1 country in terms of spying and surveillance” make it appear to also be shot across the bow concerning the massive domestic Stalkerstasi spy program.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As a matter of fact, it is the US who is the No.1 surveillance country and has the largest spy network in the world.</p><p>The US National Security Agency spied on calls and chat messages to and from the phones of leaders of Germany, France, Norway, Sweden, the Netherlands and other European countries. The US has been operating a highly secretive signals intelligence collection program through almost a hundred US embassies and consulates worldwide. Anzer, a cybersecurity information platform, revealed last year that the NSA stole more than 97 billion pieces of global internet data and 124 billion phone records in 30 days, compromising the privacy of citizens across the world. Namibia recently found in its waters a US saildrone used to gather data underwater, and local media generally believe it to be an American spy drone. The US knows how many surveillance balloons it has sent into the skies in the world. It’s quite clear to the global community which country is the No.1 spy empire in the world…</p><p>Over the years, the US has been engaged in massive, non-discriminate wiretapping and secret theft operations globally, including against its allies, by abusing its tech advantage. These operations violate the sovereignty and interests of countries around the world, the international law and basic norms governing international relations, which makes the US the absolute No.1 country in terms of spying and surveillance.</p> <cite>Foreign Ministry Spokesperson Wang Wenbin’s Regular Press Conference on February 13, 2023</cite></blockquote><p>Once WWIII goes hot, by which I mean it ceases to be presented as a proxy conflict between “Ukraine” and Vladimir Putin’s ego, but becomes a direct war between the USA and the Sino-Russian alliance, I expect we are going to learn an awful lot about the historical and ongoing misdeeds of the US government and its agencies, as well as of the Clown World individuals and organizations that control them.</p><p>Remember, the Russians know all about “the Holocaust”. It was their Red Army that liberated all of the so-called death camps. They know all about the surveillance and spy programs, both international and domestic. They know everything about NASA and the space programs. They know who killed JFK and why. They know why Watergate happened and they know at whose behest Nixon was removed.</p><p>And now it appears the Chinese do too. It’s somewhat amusing that while US figures such as Tucker Carlson, Sean Hannity, Donald Trump, Ben Shapiro, Ann Coulter, Jordan Peterson, Ron DeSantis and pretty much every other figure of the neoconservative media and movement keep their mouths resolutely shut about something they definitely know about, the Chinese are openly throwing it out there to the entire world.</p><p>Jesus Christ said “the truth will set you free.” If you cannot speak the truth, then you obviously are not free.</p><p>Just in case anyone happened to miss the significance of this statement by the Foreign Ministry, the <em>Global Times </em><a href=\"https://www.globaltimes.cn/page/202302/1285442.shtml\">made sure to highlight it</a>. Any revelatory information releases by China or Russia will obviously be dismissed as “wartime rhetoric.” Indeed, it will actually be wartime rhetoric, but dialectic is a form of rhetoric and I have no doubt that both the Russians and the Chinese will find it to be highly beneficial to inform Americans just how genuinely evil the rulers of Clown World are.</p><p>It may be worth noting that even as it calls out US surveillance, China is also very publicly embracing Iran, with a specific message to anyone who feels “targeted” by the new developmetns.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The development of China-Iran relations has a strong endogenous driving force. It can be said that President Raisi’s visit to China is very natural. However, as Iran is still under severe sanctions by the US, and China is the main target of US’ strategic suppression. With a narrow-minded mindset, some US and Western public opinion appeared rather odd in viewing the relationship between China and Iran, hyping that both China and Iran are “opposed” to the US and claiming that cooperation between the two sides will “weaken US efforts to isolate Iran.” Such zero-sum thinking is arrogant, unreasonable and overbearing. China and Iran do not need to act according to their attitude, and it is even less likely that the two sides will reduce exchanges because some people are unhappy.</p><p>In fact, many of the achievements of China-Iran cooperation in recent years have been realized by overcoming interference and sabotage by the US side. It may be difficult to improve this situation in a short period of time, but outside the US-West bloc and its influence circle, there is huge space and potential for win-win cooperation between countries, including China and Iran, which cannot be blocked by the political forces of the US and the West.</p><p>In this sense, China’s deepening cooperation with Iran also has anti-hegemony and anti-bullying feature. Both China and Iran uphold independent foreign policies, firmly defend the principle of non-interference in internal affairs on international occasions, and safeguard the common interests of developing countries. This is conducive to promoting the multi-polarization and diversified development of the world, and conforms to the general trend of the times. If anyone feels “targeted” in this process, then they should first reflect on whether they are too selfish.</p> <cite>Welcome President Raisi. China, Iran no need to watch attitude of US, West, <em>Global Times</em>, 14 February 2023</cite></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/3ff1be43-f0b8-41f8-8fe8-60f8938ef72e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Wait, what’s that sound. It sounds like they’re playing…\nthat’s AC’s music!\nThis unusually direct accusation by the Chinese Foreign Ministry is ostensibly in response to the US Air Force shooting down the rogue Chinese weather balloon, and\nperhaps\nthat is all it is, but the repeated references to “No. 1 spy empire” and “absolute No. 1 country in terms of spying and surveillance” make it appear to also be shot across the bow concerning the massive domestic Stalkerstasi spy program.\nAs a matter of fact, it is the US who is the No.1 surveillance country and has the largest spy network in the world.\nThe US National Security Agency spied on calls and chat messages to and from the phones of leaders of Germany, France, Norway, Sweden, the Netherlands and other European countries. The US has been operating a highly secretive signals intelligence collection program through almost a hundred US embassies and consulates worldwide. Anzer, a cybersecurity information platform, revealed last year that the NSA stole more than 97 billion pieces of global internet data and 124 billion phone records in 30 days, compromising the privacy of citizens across the world. Namibia recently found in its waters a US saildrone used to gather data underwater, and local media generally believe it to be an American spy drone. The US knows how many surveillance balloons it has sent into the skies in the world. It’s quite clear to the global community which country is the No.1 spy empire in the world…\nOver the years, the US has been engaged in massive, non-discriminate wiretapping and secret theft operations globally, including against its allies, by abusing its tech advantage. These operations violate the sovereignty and interests of countries around the world, the international law and basic norms governing international relations, which makes the US the absolute No.1 country in terms of spying and surveillance.\nForeign Ministry Spokesperson Wang Wenbin’s Regular Press Conference on February 13, 2023\nOnce WWIII goes hot, by which I mean it ceases to be presented as a proxy conflict between “Ukraine” and Vladimir Putin’s ego, but becomes a direct war between the USA and the Sino-Russian alliance, I expect we are going to learn an awful lot about the historical and ongoing misdeeds of the US government and its agencies, as well as of the Clown World individuals and organizations that control them.\nRemember, the Russians know all about “the Holocaust”. It was their Red Army that liberated all of the so-called death camps. They know all about the surveillance and spy programs, both international and domestic. They know everything about NASA and the space programs. They know who killed JFK and why. They know why Watergate happened and they know at whose behest Nixon was removed.\nAnd now it appears the Chinese do too. It’s somewhat amusing that while US figures such as Tucker Carlson, Sean Hannity, Donald Trump, Ben Shapiro, Ann Coulter, Jordan Peterson, Ron DeSantis and pretty much every other figure of the neoconservative media and movement keep their mouths resolutely shut about something they definitely know about, the Chinese are openly throwing it out there to the entire world.\nJesus Christ said “the truth will set you free.” If you cannot speak the truth, then you obviously are not free.\nJust in case anyone happened to miss the significance of this statement by the Foreign Ministry, the\nGlobal Times\nmade sure to highlight it\n. Any revelatory information releases by China or Russia will obviously be dismissed as “wartime rhetoric.” Indeed, it will actually be wartime rhetoric, but dialectic is a form of rhetoric and I have no doubt that both the Russians and the Chinese will find it to be highly beneficial to inform Americans just how genuinely evil the rulers of Clown World are.\nIt may be worth noting that even as it calls out US surveillance, China is also very publicly embracing Iran, with a specific message to anyone who feels “targeted” by the new developmetns.\nThe development of China-Iran relations has a strong endogenous driving force. It can be said that President Raisi’s visit to China is very natural. However, as Iran is still under severe sanctions by the US, and China is the main target of US’ strategic suppression. With a narrow-minded mindset, some US and Western public opinion appeared rather odd in viewing the relationship between China and Iran, hyping that both China and Iran are “opposed” to the US and claiming that cooperation between the two sides will “weaken US efforts to isolate Iran.” Such zero-sum thinking is arrogant, unreasonable and overbearing. China and Iran do not need to act according to their attitude, and it is even less likely that the two sides will reduce exchanges because some people are unhappy.\nIn fact, many of the achievements of China-Iran cooperation in recent years have been realized by overcoming interference and sabotage by the US side. It may be difficult to improve this situation in a short period of time, but outside the US-West bloc and its influence circle, there is huge space and potential for win-win cooperation between countries, including China and Iran, which cannot be blocked by the political forces of the US and the West.\nIn this sense, China’s deepening cooperation with Iran also has anti-hegemony and anti-bullying feature. Both China and Iran uphold independent foreign policies, firmly defend the principle of non-interference in internal affairs on international occasions, and safeguard the common interests of developing countries. This is conducive to promoting the multi-polarization and diversified development of the world, and conforms to the general trend of the times. If anyone feels “targeted” in this process, then they should first reflect on whether they are too selfish.\nWelcome President Raisi. China, Iran no need to watch attitude of US, West,\nGlobal Times\n, 14 February 2023\nDISCUSS ON SG",
  "tags": [
    "China",
    "Clown World",
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-14T12:47:08+00:00"
}