{
  "url": "https://voxday.net/2023/02/08/intelligence-of-intent/",
  "scraped_at": "2026-01-08T13:47:01.803853",
  "title": "Intelligence of Intent",
  "date_display": "February 8, 2023",
  "date_iso": "2023-02-08T10:27:12+00:00",
  "date_from_url": "2023-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ukrainian sources are buzzing with what they believe to be the incipient winter offensive by Russia starting within <a href=\"https://www.yahoo.com/news/russia-prepares-large-scale-offensive-033424903.html\">the next ten days</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The <em>Financial Times</em> writes that Kyiv has obtained “very solid intelligence of intent” by Russia to launch a new attack. The Russian offensive will likely aim to capture the entire Donbas region and may begin in the west of Luhansk Oblast, near the cities of Kreminna and Lyman, where Russia has been assembling forces for several weeks.</p><p>The <em>Financial Times</em> also notes that Russia is building up its troops in the south of Donetsk Oblast, with additional forces being deployed to villages around occupied Mariupol. According to the <em>Financial Times</em>, Russia’s goal is to launch the offensive before Ukraine receives Western tanks and weapons.</p><p>The anonymous Ukrainian military adviser said a renewed Russian attack would probably be spearheaded by elite units.</p></blockquote><p>It appears the “Russia is out of weapons and totally losing” crowd is about to get an object lesson in what the actual Russian army looks like. If the Turkish earthquakes were the unnatural results of a geophysic strike, one assumes that any last Russian doubts about the wisdom of bringing the war in Ukraine to a rapid end have been settled.</p><p>Or perhaps this is just more fog of war being spread about by one of Clown World’s leading media organs. We’ll find out soon enough.</p><p><strong>UPDATE: </strong>The media preparations for the Narrative shift <a href=\"https://www.yahoo.com/news/vladimir-putin-shock-gains-190000881.html\">are underway.</a></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Vladimir Putin is about to make shock gains</p><p>With Russia back on the offensive after significant Ukrainian combat successes around Kharkiv and Kherson in the second half of 2022, the past few weeks have been the bloodiest so far of an already bloody war, with both sides taking extraordinarily heavy casualties. Expect it to get worse.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/18a7b22d-cf2f-4b10-ab6c-fe66d12f0b77\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Ukrainian sources are buzzing with what they believe to be the incipient winter offensive by Russia starting within\nthe next ten days\n.\nThe\nFinancial Times\nwrites that Kyiv has obtained “very solid intelligence of intent” by Russia to launch a new attack. The Russian offensive will likely aim to capture the entire Donbas region and may begin in the west of Luhansk Oblast, near the cities of Kreminna and Lyman, where Russia has been assembling forces for several weeks.\nThe\nFinancial Times\nalso notes that Russia is building up its troops in the south of Donetsk Oblast, with additional forces being deployed to villages around occupied Mariupol. According to the\nFinancial Times\n, Russia’s goal is to launch the offensive before Ukraine receives Western tanks and weapons.\nThe anonymous Ukrainian military adviser said a renewed Russian attack would probably be spearheaded by elite units.\nIt appears the “Russia is out of weapons and totally losing” crowd is about to get an object lesson in what the actual Russian army looks like. If the Turkish earthquakes were the unnatural results of a geophysic strike, one assumes that any last Russian doubts about the wisdom of bringing the war in Ukraine to a rapid end have been settled.\nOr perhaps this is just more fog of war being spread about by one of Clown World’s leading media organs. We’ll find out soon enough.\nUPDATE:\nThe media preparations for the Narrative shift\nare underway.\nVladimir Putin is about to make shock gains\nWith Russia back on the offensive after significant Ukrainian combat successes around Kharkiv and Kherson in the second half of 2022, the past few weeks have been the bloodiest so far of an already bloody war, with both sides taking extraordinarily heavy casualties. Expect it to get worse.\nDISCUSS ON SG",
  "tags": [
    "rumors",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-08T13:25:53+00:00"
}