{
  "url": "https://voxday.net/2023/02/23/nothing-fucking-works/",
  "scraped_at": "2026-01-08T13:48:43.619570",
  "title": "Nothing Fucking Works",
  "date_display": "February 23, 2023",
  "date_iso": "2023-02-23T21:49:31+00:00",
  "date_from_url": "2023-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Do you know why we haven’t sent any of you any emails for the last two years? Because the so-called email services refused to do <em>what is literally their one job</em>. After looking around for one that might actually be interested in providing the services it sells, Castalia House just sent its first mass email in two years today. And it turns out that if ONE SINGLE RECIPIENT decides to complain about nonexistent “abuse”, the retarded email “services” literally FREEZE THE SENDER’S ACCOUNT. Never mind how many thousands of people opened it, clicked on it, or otherwise interacted positively with the email.</p><p><s>So, if you can’t bother to follow the blog or the SG/Gab account, you’re out of luck. Deal with it. There is literally nothing we can do about it. </s></p><p>It’s going to be interesting to see how the restaurant business or the entertainment business fares if one unsatisfied customer is sufficient to shut down the entire operation.</p><p><strong>UPDATE: </strong>The restrictions have been removed. And the provider is now aware that we are not inclined to tolerate the ridiculous policy. So we’ll continue to use it for now, but we already have backup options in place and will continue to work on improving our communications systems.</p><p><em><a href=\"https://social.infogalactic.com/micropost/3fd81b7b-399f-468c-a972-90618a86178d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Do you know why we haven’t sent any of you any emails for the last two years? Because the so-called email services refused to do\nwhat is literally their one job\n. After looking around for one that might actually be interested in providing the services it sells, Castalia House just sent its first mass email in two years today. And it turns out that if ONE SINGLE RECIPIENT decides to complain about nonexistent “abuse”, the retarded email “services” literally FREEZE THE SENDER’S ACCOUNT. Never mind how many thousands of people opened it, clicked on it, or otherwise interacted positively with the email.\nSo, if you can’t bother to follow the blog or the SG/Gab account, you’re out of luck. Deal with it. There is literally nothing we can do about it.\nIt’s going to be interesting to see how the restaurant business or the entertainment business fares if one unsatisfied customer is sufficient to shut down the entire operation.\nUPDATE:\nThe restrictions have been removed. And the provider is now aware that we are not inclined to tolerate the ridiculous policy. So we’ll continue to use it for now, but we already have backup options in place and will continue to work on improving our communications systems.\nDISCUSS ON SG",
  "tags": [
    "technology",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-24T09:15:20+00:00"
}