{
  "url": "https://voxday.net/2023/02/21/project-falsitas/",
  "scraped_at": "2026-01-08T13:48:25.714791",
  "title": "Project Falsitas",
  "date_display": "February 21, 2023",
  "date_iso": "2023-02-21T10:16:41+00:00",
  "date_from_url": "2023-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is apparent that James O’Keefe never read <em>SJWAL, SJWADD, </em>or <em>Corporate Cancer</em>. If he had, he would never have put himself in the position of being so easily ejected from the organization he founded by a Clown World agent who joined it only four months ago.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Since it’s already out there, here are my heartfelt remarks to my staff this morning.</p><p>I need to make clear I have not resigned from the company, Project Veritas, I founded 13 years ago. I was stripped of my position as CEO and Chairman.</p><p>I came to the PV office today to remove my personal belongings.</p></blockquote><p>Every church, every corporation, and every organization needs to understand that it is under attack-by-infiltration at all times. Those smiling helpful new people who just love what you’re doing and are ever-so-dedicated to throwing themselves in and helping are not even <em>remotely </em>on your side at all.</p><p>The following is a selection from <em>SJWS ALWAYS DOUBLE DOWN</em>, a book that is not half as read as its predecessor, but is arguably even more important for people like James O’Keefe.</p><hr class=\"wp-block-separator has-alpha-channel-opacity\"/><p>The convergence of institutions tends to follow a recognizable pattern that operates in much the same way as the SJW attack sequence, but on a larger scale. This pattern can be usefully described as the SJW convergence sequence. We can see how it has played out for the last sixty years in fully converged institutions such as academia, the mainstream media, and the publishing industry, we can see how it plays out today in partially converged institutions such as corporate America and the various Christian churches, and we can see how rapidly the cancer can metastasize in institutions that are just being infiltrated today, such as the game industry and the open source software community.</p><p>Regardless of the nature of the institution, the same general pattern of behavior is reliably followed to such an extent that it is relatively easy to identify how badly an institution is converged, and its resultant ability or inability to perform its primary purpose, on the basis of what stage in the convergence sequence has been reached by the SJWs converging it.</p><p>For example, when I read the bizarre story of the sudden decline of a once-popular church near my childhood home in Minnesota being reduced to 800 people meeting in a hotel, I knew without even needing to ask anyone what had happened. The church, a Lutheran church called North Heights that my parents had attended in the 1990s, had been infiltrated by SJWs, converged, lost its ability to perform its primary function as a Christian church, and found itself on the brink of failure. What was astonishing to me was just how fast what looked like a rock-solid community institution had gone downhill and collapsed.</p><p>Founded in 1946, the church was a fixture in the northern suburbs of St. Paul, with two locations offering seven worship services to 7,000 parishioners. It was one of Minnesota’s first megachurches, which always struck me as a little ironic as the senior pastor since 1961, a quiet, humble Scandinavian man named Morris Vaagenes, could not have been further from the smooth, slick-haired Joel Osteen clones that one tends to picture when one thinks of a megachurch. While I seldom attended it, preferring Greg Boyd’s Woodland Hills instead, my mother sang in the Christmas choir there, my aunt and uncle and cousins were members, and if I recall correctly, several of my friends’ children attended North Heights Christian Academy, a private K-8 Christian school that was founded by the church. It was a church full of good, decent people, nice Minnesota Lutherans in whom even Garrison Keillor could find no fault, who loved Jesus, loved their fellow man, and liked nothing better than to send their children to Haiti or Trinidad for two weeks in the winter to build homes and churches for the less fortunate. It was a wealthy church, too, located as it was near the lake homes of Shoreview and North Oaks, and the parking lot was always filled with Audis, and BMWs, and Mercedes.</p><p>Pastor Vaagenes was a genuine man of God, who initially appeared a little weak and bumbling in person, but grew in stature in the pulpit, preaching straight from the Bible with a powerful evangelical fervor that belied his traditional white robes and otherwise unprepossessing demeanor. However, he retired in 1999, and as is so often the case when a strong leader retires, was succeeded by men who were considerably less capable of assuming the burden of leadership. In 2007, a woman by the name of Mindy Bak joined what had become a bloated 88-person staff, and with the help of other SJWs who had also infiltrated the church, managed to get herself appointed interim senior pastor in 2014 through a series of highly political machinations circumventing the traditionalists on the church’s Board of Elders. This was rather a remarkable accomplishment, considering that a considerable percentage of the church members were relatively traditional Christians who held to the conventional Biblical teachings on the proper roles of men and women in church ministry.</p><p>It was arguably even more remarkable that within just 18 months, attendance had fallen nearly 80 percent, over half the staff was laid off, both total and per-capita giving drastically declined, and the original location was shut down, in part due to “a lack of elevator access for the disabled.”</p><p>What could possibly motivate a pastor, even a female one, to destroy her own church in this manner? According to one former member quoted in the <em>Star Tribune</em>, the answer is pretty simple. “She hates men.”</p><p>And on March 13, 2016, less than two years after she had been appointed interim senior pastor, Mindy Bak presided over the final service at North Heights Lutheran in front of the last 900 members of the congregation. Her work was done, and what for sixty years was a thriving church community had been destroyed.</p><p><em>A long-running schism proves fatal to North Heights Lutheran… Prejudice, sexism and scapegoating all played a role in the church’s downfall, Bak said. Members of the breakaway group didn’t want a female leader, Bak said, particularly one that didn’t shy away from issues that predecessors had refused to address. They didn’t want to hear about the prejudices of North Heights or the truth about its finances, she said. Nor did they want to embrace her message that to love Christ you must love even those people who are challenging to love. A sign in the church hall read, in part, “Throughout our history, many grew to be the followers of Jesus we were called to be. But our willingness to love one another, in spite of division, never came. For decades upon decades, selfishness and pride have brought us to this place of self-destruction. We are a cautionary tale of a dying church.”</em></p><p>—–“Deep divide dooms onetime megachurch North Heights Lutheran,” <em>Star Tribune</em>, 13 March 2016</p><p>The convergence, decline, and fall of North Heights Lutheran is indeed a cautionary tale. But it is vital to remember that the SJW convergence of North Heights did not begin with the ascendance of Mindy Bak to the interim senior pastorship. Nor did it begin when she began working at the church in 2007; the fact that she was hired as a pastor indicates that the convergence actually began in the late 1990s, when the church failed to successfully vet its new employees, pastors, and elders. By the time the convergence is visible to the average member of the institution, it is usually too late to salvage the institution in the absence of a strong leader who understands what is at stake, does not fear conflict, and is willing to stand up to the vicious slander and underhanded tactics that will be unleashed against him.</p><hr class=\"wp-block-separator has-alpha-channel-opacity\"/><p>In the same way, the convergence and destruction of Project Veritas did not begin with <a href=\"https://threadreaderapp.com/thread/1623512341760311297.html\">the hiring of Barry Hinckley</a> as the organization’s Chief Strategy Officer in the autumn of 2022. His allies were already there and waiting for him to spearhead the insurrection; note that O’Keefe was successfully ejected <em>after </em>he realized Hinckley was a problem and fired him.</p><p><em><a href=\"https://social.infogalactic.com/micropost/f75771d3-3a3a-4a48-862a-502219cad85f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It is apparent that James O’Keefe never read\nSJWAL, SJWADD,\nor\nCorporate Cancer\n. If he had, he would never have put himself in the position of being so easily ejected from the organization he founded by a Clown World agent who joined it only four months ago.\nSince it’s already out there, here are my heartfelt remarks to my staff this morning.\nI need to make clear I have not resigned from the company, Project Veritas, I founded 13 years ago. I was stripped of my position as CEO and Chairman.\nI came to the PV office today to remove my personal belongings.\nEvery church, every corporation, and every organization needs to understand that it is under attack-by-infiltration at all times. Those smiling helpful new people who just love what you’re doing and are ever-so-dedicated to throwing themselves in and helping are not even\nremotely\non your side at all.\nThe following is a selection from\nSJWS ALWAYS DOUBLE DOWN\n, a book that is not half as read as its predecessor, but is arguably even more important for people like James O’Keefe.\nThe convergence of institutions tends to follow a recognizable pattern that operates in much the same way as the SJW attack sequence, but on a larger scale. This pattern can be usefully described as the SJW convergence sequence. We can see how it has played out for the last sixty years in fully converged institutions such as academia, the mainstream media, and the publishing industry, we can see how it plays out today in partially converged institutions such as corporate America and the various Christian churches, and we can see how rapidly the cancer can metastasize in institutions that are just being infiltrated today, such as the game industry and the open source software community.\nRegardless of the nature of the institution, the same general pattern of behavior is reliably followed to such an extent that it is relatively easy to identify how badly an institution is converged, and its resultant ability or inability to perform its primary purpose, on the basis of what stage in the convergence sequence has been reached by the SJWs converging it.\nFor example, when I read the bizarre story of the sudden decline of a once-popular church near my childhood home in Minnesota being reduced to 800 people meeting in a hotel, I knew without even needing to ask anyone what had happened. The church, a Lutheran church called North Heights that my parents had attended in the 1990s, had been infiltrated by SJWs, converged, lost its ability to perform its primary function as a Christian church, and found itself on the brink of failure. What was astonishing to me was just how fast what looked like a rock-solid community institution had gone downhill and collapsed.\nFounded in 1946, the church was a fixture in the northern suburbs of St. Paul, with two locations offering seven worship services to 7,000 parishioners. It was one of Minnesota’s first megachurches, which always struck me as a little ironic as the senior pastor since 1961, a quiet, humble Scandinavian man named Morris Vaagenes, could not have been further from the smooth, slick-haired Joel Osteen clones that one tends to picture when one thinks of a megachurch. While I seldom attended it, preferring Greg Boyd’s Woodland Hills instead, my mother sang in the Christmas choir there, my aunt and uncle and cousins were members, and if I recall correctly, several of my friends’ children attended North Heights Christian Academy, a private K-8 Christian school that was founded by the church. It was a church full of good, decent people, nice Minnesota Lutherans in whom even Garrison Keillor could find no fault, who loved Jesus, loved their fellow man, and liked nothing better than to send their children to Haiti or Trinidad for two weeks in the winter to build homes and churches for the less fortunate. It was a wealthy church, too, located as it was near the lake homes of Shoreview and North Oaks, and the parking lot was always filled with Audis, and BMWs, and Mercedes.\nPastor Vaagenes was a genuine man of God, who initially appeared a little weak and bumbling in person, but grew in stature in the pulpit, preaching straight from the Bible with a powerful evangelical fervor that belied his traditional white robes and otherwise unprepossessing demeanor. However, he retired in 1999, and as is so often the case when a strong leader retires, was succeeded by men who were considerably less capable of assuming the burden of leadership. In 2007, a woman by the name of Mindy Bak joined what had become a bloated 88-person staff, and with the help of other SJWs who had also infiltrated the church, managed to get herself appointed interim senior pastor in 2014 through a series of highly political machinations circumventing the traditionalists on the church’s Board of Elders. This was rather a remarkable accomplishment, considering that a considerable percentage of the church members were relatively traditional Christians who held to the conventional Biblical teachings on the proper roles of men and women in church ministry.\nIt was arguably even more remarkable that within just 18 months, attendance had fallen nearly 80 percent, over half the staff was laid off, both total and per-capita giving drastically declined, and the original location was shut down, in part due to “a lack of elevator access for the disabled.”\nWhat could possibly motivate a pastor, even a female one, to destroy her own church in this manner? According to one former member quoted in the\nStar Tribune\n, the answer is pretty simple. “She hates men.”\nAnd on March 13, 2016, less than two years after she had been appointed interim senior pastor, Mindy Bak presided over the final service at North Heights Lutheran in front of the last 900 members of the congregation. Her work was done, and what for sixty years was a thriving church community had been destroyed.\nA long-running schism proves fatal to North Heights Lutheran… Prejudice, sexism and scapegoating all played a role in the church’s downfall, Bak said. Members of the breakaway group didn’t want a female leader, Bak said, particularly one that didn’t shy away from issues that predecessors had refused to address. They didn’t want to hear about the prejudices of North Heights or the truth about its finances, she said. Nor did they want to embrace her message that to love Christ you must love even those people who are challenging to love. A sign in the church hall read, in part, “Throughout our history, many grew to be the followers of Jesus we were called to be. But our willingness to love one another, in spite of division, never came. For decades upon decades, selfishness and pride have brought us to this place of self-destruction. We are a cautionary tale of a dying church.”\n—–“Deep divide dooms onetime megachurch North Heights Lutheran,”\nStar Tribune\n, 13 March 2016\nThe convergence, decline, and fall of North Heights Lutheran is indeed a cautionary tale. But it is vital to remember that the SJW convergence of North Heights did not begin with the ascendance of Mindy Bak to the interim senior pastorship. Nor did it begin when she began working at the church in 2007; the fact that she was hired as a pastor indicates that the convergence actually began in the late 1990s, when the church failed to successfully vet its new employees, pastors, and elders. By the time the convergence is visible to the average member of the institution, it is usually too late to salvage the institution in the absence of a strong leader who understands what is at stake, does not fear conflict, and is willing to stand up to the vicious slander and underhanded tactics that will be unleashed against him.\nIn the same way, the convergence and destruction of Project Veritas did not begin with\nthe hiring of Barry Hinckley\nas the organization’s Chief Strategy Officer in the autumn of 2022. His allies were already there and waiting for him to spearhead the insurrection; note that O’Keefe was successfully ejected\nafter\nhe realized Hinckley was a problem and fired him.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-21T10:16:43+00:00"
}