{
  "url": "https://voxday.net/2023/02/20/red-lines/",
  "scraped_at": "2026-01-08T13:48:20.237676",
  "title": "Red Lines",
  "date_display": "February 20, 2023",
  "date_iso": "2023-02-20T11:11:15+00:00",
  "date_from_url": "2023-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The USA consistently refused to respect Russia’s red lines. Why on Earth would China pay any attention whatsoever to whatever the USA <a href=\"https://www.rt.com/news/571746-us-draw-red-line-china/\">claims its red lines</a> to be?</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Any nation providing lethal support to Moscow in its ongoing conflict with Kiev would cross Washington’s “red line,” the US envoy to the UN, Linda Thomas-Greenfield, told CNN on Sunday. Earlier the same day, US State Secretary Antony Blinken directly warned a top Chinese diplomat, Wang Yi, against considering such an option.</p><p>“<em>We … have to be clear that if there are any thoughts and efforts by the Chinese and others to provide lethal support to the Russians in their brutal attack against Ukraine, that that is unacceptable,</em>” Thomas-Greenfield told CNN’s ‘State of the Union,’ adding that it “w<em>ould be a red line</em>.”</p><p>Her words came as Blinken was meeting Wang Yi on the sidelines of the Munich Security Conference in Germany. There, the US diplomat told his Chinese counterpart that the US was “<em>very concerned that China is considering providing lethal support to Russia</em>,” Blinken told NBC’s Chuck Todd in the wake of the meeting.</p></blockquote><p>This is what happens when you have a bunch of very special boys in charge of things. The neocons genuinely believe that they have the right to do whatever they see as in their own interest, but no one else has the same right.</p><p>Of course China is going to provide “lethal support to Russia”. It’s in their interest, because the same special boys who are threatening them if they do have already announced their intention to go to war with China just as soon as they’re done defeating Russia.</p><p>All I can conclude is that because the neocons hate literally everyone, including themselves, they’re playing a suicidal game of Samson burning down the temple using the US military as a match. I mean, it’s impossible to believe that they’re literally this stupid and totally unable to see the obvious consequences of their actions.</p><p>On the other hand, the possibility of stupidity should not be entirely dismissed. China is already allied with Russia, and World War III started with the Special Military Operation in February 2022.</p><p><em>“If China allies itself with Russia, there will be a world war.”</em></p><p>—Volodymyr Zelenskyy, 20 February 2023</p><p><em><a href=\"https://social.infogalactic.com/micropost/e2d1097d-0140-4e8e-87bb-bda207753e2e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The USA consistently refused to respect Russia’s red lines. Why on Earth would China pay any attention whatsoever to whatever the USA\nclaims its red lines\nto be?\nAny nation providing lethal support to Moscow in its ongoing conflict with Kiev would cross Washington’s “red line,” the US envoy to the UN, Linda Thomas-Greenfield, told CNN on Sunday. Earlier the same day, US State Secretary Antony Blinken directly warned a top Chinese diplomat, Wang Yi, against considering such an option.\n“\nWe … have to be clear that if there are any thoughts and efforts by the Chinese and others to provide lethal support to the Russians in their brutal attack against Ukraine, that that is unacceptable,\n” Thomas-Greenfield told CNN’s ‘State of the Union,’ adding that it “w\nould be a red line\n.”\nHer words came as Blinken was meeting Wang Yi on the sidelines of the Munich Security Conference in Germany. There, the US diplomat told his Chinese counterpart that the US was “\nvery concerned that China is considering providing lethal support to Russia\n,” Blinken told NBC’s Chuck Todd in the wake of the meeting.\nThis is what happens when you have a bunch of very special boys in charge of things. The neocons genuinely believe that they have the right to do whatever they see as in their own interest, but no one else has the same right.\nOf course China is going to provide “lethal support to Russia”. It’s in their interest, because the same special boys who are threatening them if they do have already announced their intention to go to war with China just as soon as they’re done defeating Russia.\nAll I can conclude is that because the neocons hate literally everyone, including themselves, they’re playing a suicidal game of Samson burning down the temple using the US military as a match. I mean, it’s impossible to believe that they’re literally this stupid and totally unable to see the obvious consequences of their actions.\nOn the other hand, the possibility of stupidity should not be entirely dismissed. China is already allied with Russia, and World War III started with the Special Military Operation in February 2022.\n“If China allies itself with Russia, there will be a world war.”\n—Volodymyr Zelenskyy, 20 February 2023\nDISCUSS ON SG",
  "tags": [
    "China",
    "Clown World",
    "neocons",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-20T13:35:41+00:00"
}