{
  "url": "https://voxday.net/2023/02/18/she-has-to-go-back/",
  "scraped_at": "2026-01-08T13:48:07.341917",
  "title": "She Has to Go Back",
  "date_display": "February 18, 2023",
  "date_iso": "2023-02-18T11:33:36+00:00",
  "date_from_url": "2023-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-57134\" decoding=\"async\" fetchpriority=\"high\" height=\"428\" sizes=\"(max-width: 510px) 100vw, 510px\" src=\"https://voxday.net/wp-content/uploads/2023/02/image-18.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/02/image-18.png 510w, https://voxday.net/wp-content/uploads/2023/02/image-18-300x252.png 300w\" width=\"510\"/></figure></div><p>Nimrata Randhawa aka “Nikki Haley” doesn’t even understand the laws of the United States of America well enough to realize that she is not eligible for the office of President for which she is presently running, not being a “natural born citizen”.</p><p>Ann Coulter’s comments are not only sensible, they are characteristically biting.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>“Why don’t you go back to your own country?” Coulter said. “Her candidacy did remind me that I need to immigrate to India so I can demand they start taking down parts of their history,” she said. “What’s with the worshipping of the cows? They’re all starving over there. Did you know they have a rat temple, where they worship rats?”</p><p>Coulter also called Haley a “bimbo” and a “preposterous creature,” criticizing her for having advocated removing the Confederate flag from the grounds of the South Carolina Statehouse in the wake of the 2015 shooting at Emanuel African Methodist Episcopal Church in Charleston.</p><p>“This is my country, lady,” she said. “I’m not an American Indian, and I don’t like them taking down all the monuments.”</p></blockquote><p>Coulter is absolutely right. I am an American Indian and I don’t like invasive species like <em>homo punjabiens </em>taking down American monuments either. The speed with which the invaders have already managed to seize leadership over international corporations and national governments alike, much to the detriment of the native populations of the USA, the United Kingdom, and Ireland, is remarkable, thereby testifying once more to the short-sighted foolishness of empire.</p><p>Empire is the decision to enrich yourself at the expense of foreigners who will rule over your great-grandchildren. Consider the case of Great Britain. The British Raj was established on August 2, 1858, when the British Parliament passed the Government of India Act that formally transferred British power over India from the East India company to the crown. On October 25, 2022, the Punjabi Brahmin Rishi Sunak became Prime Minister of the United Kingdom.</p><p>Being an American Indian, I tend to recognize the obvious and intrinsic danger of mass immigration rather better than Americans or Europeans do, as the majority of them still genuinely believe that so long as the invader isn’t armed and wearing a uniform, he isn’t an invader. They haven’t had their land formally seized by their foreign rulers and been forced onto reservations, not yet. Americans and Europeans are still in the “retreat and hope they go away” phase.</p><p>Guess what? <em>They never go away. </em>Occupying armies go away. Mass immigrants don’t, not voluntarily.</p><p>Contrary to the historically ignorant popular opinion, military invasion is actually far <em>less </em>destructive to a nation than a mass immigration. Paris was invaded and occupied by German soldiers, and it remained Paris. Afghanistan, Iraq, and Vietnam were all invaded and occupied by US soldiers and they are still Afghanistan, Iraq, and Vietnam.</p><p>But Detroit was mass-immigrated by Africans and it is no longer Detroit except in name. Palestine was mass-immigrated by Jews and it is no longer even Palestine by name. If the current trends continue, by the year 2100 Australia will be Chinese and Sweden will be the first Arab country on the Baltic Sea.</p><p>History suggests these trends will not continue. I anticipate that Reconquista 2.0 will take place in the aftermath of WWIII, once Clown World has been defeated and the immorality of multiculturalism and mass immigration is correctly blamed for the horrors of the war.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8d7de63a-0ee5-4338-97cd-f339b2a7ce26\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Nimrata Randhawa aka “Nikki Haley” doesn’t even understand the laws of the United States of America well enough to realize that she is not eligible for the office of President for which she is presently running, not being a “natural born citizen”.\nAnn Coulter’s comments are not only sensible, they are characteristically biting.\n“Why don’t you go back to your own country?” Coulter said. “Her candidacy did remind me that I need to immigrate to India so I can demand they start taking down parts of their history,” she said. “What’s with the worshipping of the cows? They’re all starving over there. Did you know they have a rat temple, where they worship rats?”\nCoulter also called Haley a “bimbo” and a “preposterous creature,” criticizing her for having advocated removing the Confederate flag from the grounds of the South Carolina Statehouse in the wake of the 2015 shooting at Emanuel African Methodist Episcopal Church in Charleston.\n“This is my country, lady,” she said. “I’m not an American Indian, and I don’t like them taking down all the monuments.”\nCoulter is absolutely right. I am an American Indian and I don’t like invasive species like\nhomo punjabiens\ntaking down American monuments either. The speed with which the invaders have already managed to seize leadership over international corporations and national governments alike, much to the detriment of the native populations of the USA, the United Kingdom, and Ireland, is remarkable, thereby testifying once more to the short-sighted foolishness of empire.\nEmpire is the decision to enrich yourself at the expense of foreigners who will rule over your great-grandchildren. Consider the case of Great Britain. The British Raj was established on August 2, 1858, when the British Parliament passed the Government of India Act that formally transferred British power over India from the East India company to the crown. On October 25, 2022, the Punjabi Brahmin Rishi Sunak became Prime Minister of the United Kingdom.\nBeing an American Indian, I tend to recognize the obvious and intrinsic danger of mass immigration rather better than Americans or Europeans do, as the majority of them still genuinely believe that so long as the invader isn’t armed and wearing a uniform, he isn’t an invader. They haven’t had their land formally seized by their foreign rulers and been forced onto reservations, not yet. Americans and Europeans are still in the “retreat and hope they go away” phase.\nGuess what?\nThey never go away.\nOccupying armies go away. Mass immigrants don’t, not voluntarily.\nContrary to the historically ignorant popular opinion, military invasion is actually far\nless\ndestructive to a nation than a mass immigration. Paris was invaded and occupied by German soldiers, and it remained Paris. Afghanistan, Iraq, and Vietnam were all invaded and occupied by US soldiers and they are still Afghanistan, Iraq, and Vietnam.\nBut Detroit was mass-immigrated by Africans and it is no longer Detroit except in name. Palestine was mass-immigrated by Jews and it is no longer even Palestine by name. If the current trends continue, by the year 2100 Australia will be Chinese and Sweden will be the first Arab country on the Baltic Sea.\nHistory suggests these trends will not continue. I anticipate that Reconquista 2.0 will take place in the aftermath of WWIII, once Clown World has been defeated and the immorality of multiculturalism and mass immigration is correctly blamed for the horrors of the war.\nDISCUSS ON SG",
  "tags": [
    "history",
    "immigration",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-18T11:33:38+00:00"
}