{
  "url": "https://voxday.net/2023/02/11/silver-lining/",
  "scraped_at": "2026-01-08T13:47:22.384163",
  "title": "Silver Lining",
  "date_display": "February 11, 2023",
  "date_iso": "2023-02-11T18:43:16+00:00",
  "date_from_url": "2023-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m glad Gab exists. It serves a very useful purpose. But there are a LOT of literal retards<a href=\"https://gab.com/tradtiger/posts/109847479316603565\"> on social media</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>VD: <em>“A man in Arizona admitted to possessing child pornography during the interview process for a position with the El Mirage Police Department.”</em></p><p>Following the disclosure, he was offered the position of police chief.</p><p>GAMMA: Total malarkey. The man was arrested, not offered a position of police chief. Here’s an article on the story from the New York Post.</p></blockquote><p>This sort of thing is why I’m not quite <em>entirely </em>unsympathetic to the globalist notion of offering lethal poison to every moron gullible enough to trust the science and inject it into his body because credentials. Yes, it’s awful, horrific, evil, and satanic, no question, but I do think it’s important to remember that it will pretty much kill off the self-appointed reality police.</p><p>Silver linings, my friends. Silver linings.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6b87aee0-4303-4879-80ac-fea514ba2873\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’m glad Gab exists. It serves a very useful purpose. But there are a LOT of literal retards\non social media\n.\nVD:\n“A man in Arizona admitted to possessing child pornography during the interview process for a position with the El Mirage Police Department.”\nFollowing the disclosure, he was offered the position of police chief.\nGAMMA: Total malarkey. The man was arrested, not offered a position of police chief. Here’s an article on the story from the New York Post.\nThis sort of thing is why I’m not quite\nentirely\nunsympathetic to the globalist notion of offering lethal poison to every moron gullible enough to trust the science and inject it into his body because credentials. Yes, it’s awful, horrific, evil, and satanic, no question, but I do think it’s important to remember that it will pretty much kill off the self-appointed reality police.\nSilver linings, my friends. Silver linings.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "Gamma",
    "W:AWCAAWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-11T18:43:51+00:00"
}