{
  "url": "https://voxday.net/2023/02/03/strategically-incapable/",
  "scraped_at": "2026-01-08T13:46:24.181915",
  "title": "Strategically Incapable",
  "date_display": "February 3, 2023",
  "date_iso": "2023-02-03T15:12:28+00:00",
  "date_from_url": "2023-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The USA is not only “agreement-incapable”, <a href=\"https://smoothiex12.blogspot.com/2023/02/what-load-of-contrived-bs.html\">it is now also strategically incapable</a>, as Reminiscence of the Future correctly observes:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>You cannot explain to 99.99% of people within the Beltway what real war is, how military strategy is subordinated to the strategy of the state (meaning geopolitics in a larger sense). Lastly, you cannot explain it to the average US MSM journo or “analysts” (or “expert”) which is a euphemism for the general lack of culture and ignorance.</p><p><em>The war in Ukraine is reaching a new phase, and US strategy is undergoing an important shift. Fears of Russian nuclear escalation are receding as fears of a long war featuring unrelenting attrition are increasing. So President Joe Biden’s administration is ramping up support for Ukraine now in hopes of producing an eventual diplomatic resolution — an “escalate to de-escalate” strategy that may prove very difficult to execute. Nearly a year into the war, uncertainty about its course is greater than ever. For the first six months, Russia had the initiative: The major questions were when, where and with what success it would attack. Over the following five months, Ukraine had the initiative, and analysts tried to divine the location and prospects of its counteroffensives.</em></p><p>The United States can not do “strategy”, it never could after WW II. It took SMO to expose utter incompetence of the US “elites” with all their military, diplomatic and academic institutions. It is a parade of the ambitious amateurs who are no good for any serious task of statesmanship, despite all their hefty fraudulent degrees. US “diplomacy” is a butt of jokes among the rest of the world, US military cannot fight a serious combined arms conflict with peer, without sustaining catastrophic losses.</p></blockquote><p>The reason the USA is not capable of constructing a grand strategy is that it is not a nation. It is an empire which is ruled by a foreign elite, rather like the Roman Empire once the emperors ceased to be Roman.</p><p>In <em>China’s Grand Strategy: Trends, Trajectories, and Long-Term Competition</em>, the seven RAND scholars define the concept of grand strategy: <em>Grant strategy is the process by which a state relates long-term ends to means within the rubric of an overarching and enduring vision to advance the national interest.</em></p><p>But when the state is controlled by an elite that has interests which are separate, distinct, and in some cases contradictory to the national interest, it is not possible to create any overarching and enduring vision, because the overarching and enduring objective of the elite is to remain in power.</p><p>This built-in contradiction between the national interest and the foreign elite’s interest will necessarily and inevitably lead to growing incoherencies that are even more readily apparent to enemies outside the state than nationals within it. Which, no doubt, is why Wang Hunin was able to observe the incoherencies and write <em>America Against America</em> 20 years before I made some of the same observations, which was nearly 20 years before it became obvious to most Americans that “defending democracy” looked a lot like “installing a puppet regime” in Ukraine.</p><p>What is the USA’s grand strategy? No one can say. Even the US strategists readily admit that they have no idea what it is. Defending the petrodollar is not a grand strategy. Preventing the rise of Russia and China is not a grand strategy. Maintaining the largest GDP or the highest GDP per capita is not a grand strategy. Eliminating the European population within a state is a grand strategy of sorts, but it is an evil, insane, and observably inimical to the national interest, ergo it is not a viable one for the United States.</p><p>And the incoherency produced by having a state with separate interests from the nation is why the USA is absolutely destined to defeat at the hands of nation-states with genuine grand strategies. There are other valid reasons, of course, beginning with industrial capacity, but on the most basic level, it should be easy to understand that it is much more difficult to successfully reach a destination when one doesn’t even have a particular one in mind.</p><p><em><a href=\"https://social.infogalactic.com/micropost/4a499b87-ed85-4c63-af17-d8c4dbb31585\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The USA is not only “agreement-incapable”,\nit is now also strategically incapable\n, as Reminiscence of the Future correctly observes:\nYou cannot explain to 99.99% of people within the Beltway what real war is, how military strategy is subordinated to the strategy of the state (meaning geopolitics in a larger sense). Lastly, you cannot explain it to the average US MSM journo or “analysts” (or “expert”) which is a euphemism for the general lack of culture and ignorance.\nThe war in Ukraine is reaching a new phase, and US strategy is undergoing an important shift. Fears of Russian nuclear escalation are receding as fears of a long war featuring unrelenting attrition are increasing. So President Joe Biden’s administration is ramping up support for Ukraine now in hopes of producing an eventual diplomatic resolution — an “escalate to de-escalate” strategy that may prove very difficult to execute. Nearly a year into the war, uncertainty about its course is greater than ever. For the first six months, Russia had the initiative: The major questions were when, where and with what success it would attack. Over the following five months, Ukraine had the initiative, and analysts tried to divine the location and prospects of its counteroffensives.\nThe United States can not do “strategy”, it never could after WW II. It took SMO to expose utter incompetence of the US “elites” with all their military, diplomatic and academic institutions. It is a parade of the ambitious amateurs who are no good for any serious task of statesmanship, despite all their hefty fraudulent degrees. US “diplomacy” is a butt of jokes among the rest of the world, US military cannot fight a serious combined arms conflict with peer, without sustaining catastrophic losses.\nThe reason the USA is not capable of constructing a grand strategy is that it is not a nation. It is an empire which is ruled by a foreign elite, rather like the Roman Empire once the emperors ceased to be Roman.\nIn\nChina’s Grand Strategy: Trends, Trajectories, and Long-Term Competition\n, the seven RAND scholars define the concept of grand strategy:\nGrant strategy is the process by which a state relates long-term ends to means within the rubric of an overarching and enduring vision to advance the national interest.\nBut when the state is controlled by an elite that has interests which are separate, distinct, and in some cases contradictory to the national interest, it is not possible to create any overarching and enduring vision, because the overarching and enduring objective of the elite is to remain in power.\nThis built-in contradiction between the national interest and the foreign elite’s interest will necessarily and inevitably lead to growing incoherencies that are even more readily apparent to enemies outside the state than nationals within it. Which, no doubt, is why Wang Hunin was able to observe the incoherencies and write\nAmerica Against America\n20 years before I made some of the same observations, which was nearly 20 years before it became obvious to most Americans that “defending democracy” looked a lot like “installing a puppet regime” in Ukraine.\nWhat is the USA’s grand strategy? No one can say. Even the US strategists readily admit that they have no idea what it is. Defending the petrodollar is not a grand strategy. Preventing the rise of Russia and China is not a grand strategy. Maintaining the largest GDP or the highest GDP per capita is not a grand strategy. Eliminating the European population within a state is a grand strategy of sorts, but it is an evil, insane, and observably inimical to the national interest, ergo it is not a viable one for the United States.\nAnd the incoherency produced by having a state with separate interests from the nation is why the USA is absolutely destined to defeat at the hands of nation-states with genuine grand strategies. There are other valid reasons, of course, beginning with industrial capacity, but on the most basic level, it should be easy to understand that it is much more difficult to successfully reach a destination when one doesn’t even have a particular one in mind.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-03T15:12:30+00:00"
}