{
  "url": "https://voxday.net/2023/02/16/whoring-for-the-nfl/",
  "scraped_at": "2026-01-08T13:47:58.533627",
  "title": "Whoring for the NFL",
  "date_display": "February 16, 2023",
  "date_iso": "2023-02-16T19:27:19+00:00",
  "date_from_url": "2023-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Florio tries to float what has to be <a href=\"https://profootballtalk.nbcsports.com/2023/02/16/nfl-films-footage-shows-james-bradberry-pulling-juju-smith-schusters-jersey/\">the dumbest, most disingenous defense</a> of the defensive holding call that gifted the Super Bowl to the Kansas City Chiefs:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Four days after the Super Bowl, a surprising number of people continue to suggest that an instance of defensive holding should not have been called defensive holding.</p><p>The argument apparently was rooted in the reality that we all wanted to witness a more exciting finish to Super Bowl LVII, and that the foul called on Eagles cornerback James Bradberry allowed the Chiefs to bleed the clock, kick a field goal, and give the ball back to the Eagles with fewer than 10 seconds on the clock.</p><p>The argument definitely isn’t rooted in whether holding happened. It did. And, under the rules, holding definitely happened.</p><p>“It is defensive holding if a player grasps an eligible offensive player (or his jersey) with his hands, or extends an arm or arms to cut off or encircle him,” the rulebook states.</p><p>Or his jersey.</p><p>NFL Films has provided a much more clear angle of the fact that Bradberry did indeed hold the jersey of Chiefs receiver JuJu Smith-Schuster.</p><p>Bradberry admitted immediately after the game that he held Smith-Schuster, but that Bradberry simply hoped he’d get away with it. He didn’t. He shouldn’t have.</p><p>Why are people still insisting that the officials should have ignored a clear violation of the rules?</p></blockquote><p>Why are people still insisting that the officials should have ignored a clear violation of the rules? The answer could hardly be more obvious. <em>Because the officials had ignored it, and ignored similar violations, for the previous 58 minutes and 6 seconds.</em> The more interesting question is this: why are Florio and other NFL-financed media whores are out in force defending the obvious and indefensible? The answer is because the thumb on the scale is becoming undeniable to even the average fan.</p><p>When casual observes like me can reliably and correctly identify which team will be the beneficiary of the referee’s calls before the first half of the first quarter is complete, the league has a problem. Unfortunately, instead of admitting that it has its officials put a thumb on the scale in order to a) keep televised games close and b) further the league’s favored narrative and either stopping the practice or defending its benefits, the NFL is choosing to try gaslighting its fans.</p><p>I, for one, am not going to argue that a 55-10 championship game, such as Super Bowl XXIV, is to be preferred in any way to the modern games with the thumb on the scale. It’s not an accident that so many regular season and playoff games are close these days; the phantom “roughing the passer call” against the Giants at the end of the game against the Vikings was as egregious as the officials stopping the clock on a non-existent substitution to permit Andy Reid’s challenging of a pass that had been complete.</p><p>Notice that Florio isn’t talking about that. Anyhow, the league should be informed that playing dumb is really not an effective defense in these circumstances.</p><p><em><a href=\"https://social.infogalactic.com/micropost/3713392a-ca9c-4b93-aee5-6777ca067306\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Mike Florio tries to float what has to be\nthe dumbest, most disingenous defense\nof the defensive holding call that gifted the Super Bowl to the Kansas City Chiefs:\nFour days after the Super Bowl, a surprising number of people continue to suggest that an instance of defensive holding should not have been called defensive holding.\nThe argument apparently was rooted in the reality that we all wanted to witness a more exciting finish to Super Bowl LVII, and that the foul called on Eagles cornerback James Bradberry allowed the Chiefs to bleed the clock, kick a field goal, and give the ball back to the Eagles with fewer than 10 seconds on the clock.\nThe argument definitely isn’t rooted in whether holding happened. It did. And, under the rules, holding definitely happened.\n“It is defensive holding if a player grasps an eligible offensive player (or his jersey) with his hands, or extends an arm or arms to cut off or encircle him,” the rulebook states.\nOr his jersey.\nNFL Films has provided a much more clear angle of the fact that Bradberry did indeed hold the jersey of Chiefs receiver JuJu Smith-Schuster.\nBradberry admitted immediately after the game that he held Smith-Schuster, but that Bradberry simply hoped he’d get away with it. He didn’t. He shouldn’t have.\nWhy are people still insisting that the officials should have ignored a clear violation of the rules?\nWhy are people still insisting that the officials should have ignored a clear violation of the rules? The answer could hardly be more obvious.\nBecause the officials had ignored it, and ignored similar violations, for the previous 58 minutes and 6 seconds.\nThe more interesting question is this: why are Florio and other NFL-financed media whores are out in force defending the obvious and indefensible? The answer is because the thumb on the scale is becoming undeniable to even the average fan.\nWhen casual observes like me can reliably and correctly identify which team will be the beneficiary of the referee’s calls before the first half of the first quarter is complete, the league has a problem. Unfortunately, instead of admitting that it has its officials put a thumb on the scale in order to a) keep televised games close and b) further the league’s favored narrative and either stopping the practice or defending its benefits, the NFL is choosing to try gaslighting its fans.\nI, for one, am not going to argue that a 55-10 championship game, such as Super Bowl XXIV, is to be preferred in any way to the modern games with the thumb on the scale. It’s not an accident that so many regular season and playoff games are close these days; the phantom “roughing the passer call” against the Giants at the end of the game against the Vikings was as egregious as the officials stopping the clock on a non-existent substitution to permit Andy Reid’s challenging of a pass that had been complete.\nNotice that Florio isn’t talking about that. Anyhow, the league should be informed that playing dumb is really not an effective defense in these circumstances.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-02-16T19:27:21+00:00"
}