{
  "url": "https://voxday.net/2004/11/21/alexander-and-jesus/",
  "scraped_at": "2026-01-08T19:45:13.126593",
  "title": "Alexander and Jesus",
  "date_display": "November 21, 2004",
  "date_iso": "2004-11-21T17:39:00+00:00",
  "date_from_url": "2004-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always been strange to me how atheists and other unbelievers have such a difficult accepting the Bible as a historical document, while swallowing outright every bit of secular history that passes before them.  I’m quite interested in seeing Oliver Stone’s new movie on Alexander – a first for me, though I still probably won’t see it until it’s out on DVD – but I think it’s worthwhile to consider the following words about <a href=\"http://www.livius.org/arl-arz/arrian/arrian.htm\">the very fascinating historian</a> whose work is considered our most important source on Alexander’s career.</p><p>“Arrian’s <em>Anabasis</em> is our most important source on the reign of Alexander. The reason is that Arrian ignored Cleitarchus’ immensely popular History of Alexander and used other, better sources. In the prologue, Arrian explains why: ‘It seems to me that Ptolemy and Aristobulus are the most trustworthy writers on Alexander’s conquests, because the latter shared Alexander’s campaigns, and the former -Ptolemy- in addition to this advantage, was himself a king, and it is more disgraceful for a king to tell lies than for anybody else.'”</p><p>So, a Greek doctor speaking to eyewitnesses is inherently dubious because of what they said they saw, but a Roman politician writing more than 400 years after the death of his subject who believes that kings are more trustworthy than other men isn’t?  Furthermore, Arrian’s accuracy must be further called into account based on his known preference for inaccuracy on the basis of aesthetic prejudice.</p><p>“More recent descriptions of India are quoted by several Christian authors and Arrian’s younger contemporary Philostratus, but Arrian chose to ignore these recent sources because they were written in so-called Koinê-Greek, which was considered ugly in the second century CE. Nearchus, on the other hand, had written decent ‘classical’ Greek and even though the contents of his Indikê were outdated, Nearchus was to be preferred.”</p><p>Just a little food for thought.<br/></p></div>",
  "content_text": "It’s always been strange to me how atheists and other unbelievers have such a difficult accepting the Bible as a historical document, while swallowing outright every bit of secular history that passes before them.  I’m quite interested in seeing Oliver Stone’s new movie on Alexander – a first for me, though I still probably won’t see it until it’s out on DVD – but I think it’s worthwhile to consider the following words about\nthe very fascinating historian\nwhose work is considered our most important source on Alexander’s career.\n“Arrian’s\nAnabasis\nis our most important source on the reign of Alexander. The reason is that Arrian ignored Cleitarchus’ immensely popular History of Alexander and used other, better sources. In the prologue, Arrian explains why: ‘It seems to me that Ptolemy and Aristobulus are the most trustworthy writers on Alexander’s conquests, because the latter shared Alexander’s campaigns, and the former -Ptolemy- in addition to this advantage, was himself a king, and it is more disgraceful for a king to tell lies than for anybody else.'”\nSo, a Greek doctor speaking to eyewitnesses is inherently dubious because of what they said they saw, but a Roman politician writing more than 400 years after the death of his subject who believes that kings are more trustworthy than other men isn’t?  Furthermore, Arrian’s accuracy must be further called into account based on his known preference for inaccuracy on the basis of aesthetic prejudice.\n“More recent descriptions of India are quoted by several Christian authors and Arrian’s younger contemporary Philostratus, but Arrian chose to ignore these recent sources because they were written in so-called Koinê-Greek, which was considered ugly in the second century CE. Nearchus, on the other hand, had written decent ‘classical’ Greek and even though the contents of his Indikê were outdated, Nearchus was to be preferred.”\nJust a little food for thought.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-21T17:39:00+00:00"
}