{
  "url": "https://voxday.net/2004/11/19/chicks-with-guns/",
  "scraped_at": "2026-01-08T19:45:03.957010",
  "title": "Chicks with guns",
  "date_display": "November 19, 2004",
  "date_iso": "2004-11-19T16:08:00+00:00",
  "date_from_url": "2004-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Slate (via Insty):<br/></p><blockquote><p> <br>Ricardo had me watch a short film as part of my gun-safety training, and in it the narrator explained that guns are simply machines. Machines can’t hurt you, he said; the danger lies in the person operating the machine. OK, I thought, but if I am inept in the handling of my blow-dryer, I am unlikely to vaporize anyone’s kidney. As he went through his safety lectures, Ricardo emphasized which firearms would be best for my “personal protection,” even though as a District resident this was virtually out of the question, and even though I assured him that no one was after me. Undeterred, his top recommendation was a pump-action shotgun. “Nothing else makes that sound,” he said, and even I could conjure up that ka-chung. “Hearing that sound alone can negate the need to fire. It makes such a sweet song.”<br/></br></p></blockquote><p>Space Bunny <a href=\"http://slate.msn.com/id/2109816/\">will dig this</a>.  We took one of her very liberal friends to shoot, who very much enjoyed the experience.  I’ve taught a few girls how to shoot, and it’s always amusing to see the wild-eyed, vaguely turned-on expression that they get afterwards.  With one exception, Chilliette was crying her eyes out the entire time; she was scared to death of this .50 caliber Desert Eagle a guy three lanes down was shooting.  Echoing off the concret, the thing sounded like large-bore artillery fire.<br/></p></div>",
  "content_text": "From Slate (via Insty):\nRicardo had me watch a short film as part of my gun-safety training, and in it the narrator explained that guns are simply machines. Machines can’t hurt you, he said; the danger lies in the person operating the machine. OK, I thought, but if I am inept in the handling of my blow-dryer, I am unlikely to vaporize anyone’s kidney. As he went through his safety lectures, Ricardo emphasized which firearms would be best for my “personal protection,” even though as a District resident this was virtually out of the question, and even though I assured him that no one was after me. Undeterred, his top recommendation was a pump-action shotgun. “Nothing else makes that sound,” he said, and even I could conjure up that ka-chung. “Hearing that sound alone can negate the need to fire. It makes such a sweet song.”\nSpace Bunny\nwill dig this\n.  We took one of her very liberal friends to shoot, who very much enjoyed the experience.  I’ve taught a few girls how to shoot, and it’s always amusing to see the wild-eyed, vaguely turned-on expression that they get afterwards.  With one exception, Chilliette was crying her eyes out the entire time; she was scared to death of this .50 caliber Desert Eagle a guy three lanes down was shooting.  Echoing off the concret, the thing sounded like large-bore artillery fire.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-19T16:08:00+00:00"
}