{
  "url": "https://voxday.net/2004/11/06/crackdown-come/",
  "scraped_at": "2025-12-19T20:52:38.524993",
  "title": "The crackdown cometh",
  "date_display": "November 6, 2004",
  "date_iso": "2004-11-06T11:07:00+00:00",
  "date_from_url": "2004-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Washington Times:<br/></p><blockquote><p> <br>Deputy Prime Minister Gerrit Zalm agreed with comments by other politicians who called Mr. van Gogh’s slaying a declaration of Islamic jihad, or “holy war.” “We are not going to tolerate this. We are going to ratchet up the fight against this sort of terrorism,” he said. “The increase in radicalization is worse than we had thought.”  Among measures under consideration is an emergency law to enable authorities to revoke the Dutch nationality of dual citizens suspected of terrorist activity so that they can be deported….</br></p><p>Jozias van Aartsen, parliamentary speaker for the nationalist People’s Party for Freedom and Democracy (VVD), the second-largest party in the government of Prime Minister Jan Peter Balkenende, issued a statement that called Mr. van Gogh’s slaying tantamount to a declaration of war. “The jihad has come to the Netherlands and a small group of jihadist terrorists is attacking the principles of our country,” he said. “I hope the Netherlands will now move beyond denial and do what is fitting in a democracy — take action.<br/></p></blockquote><p>I’ve said for some time that Europe will crack down harder on Islam because of its history and because it is more vulnerable to a Muslim takeover based on its demographics.  It’s interesting to note that a single murder by a jihadist already has the Dutch people burning a mosque and prepared to strip citizenship from its Muslim citizens.</p><p>America truly is a tertiary front and some of the uglier incidents are probably going to take place in France, Denmark and Holland.  It’s customary to talk about the Europeans as paper lions, and in some senses they certainly are.  But in two thousand years of history, the Europeans have never been shy about using brutal government force on citizens considered problematic <a href=\"http://www.fantompowa.net/Flame/algeria_napoli_article.htm\">even after World War II</a>.<br/></p></div>",
  "content_text": "From the Washington Times:\nDeputy Prime Minister Gerrit Zalm agreed with comments by other politicians who called Mr. van Gogh’s slaying a declaration of Islamic jihad, or “holy war.” “We are not going to tolerate this. We are going to ratchet up the fight against this sort of terrorism,” he said. “The increase in radicalization is worse than we had thought.”  Among measures under consideration is an emergency law to enable authorities to revoke the Dutch nationality of dual citizens suspected of terrorist activity so that they can be deported….\nJozias van Aartsen, parliamentary speaker for the nationalist People’s Party for Freedom and Democracy (VVD), the second-largest party in the government of Prime Minister Jan Peter Balkenende, issued a statement that called Mr. van Gogh’s slaying tantamount to a declaration of war. “The jihad has come to the Netherlands and a small group of jihadist terrorists is attacking the principles of our country,” he said. “I hope the Netherlands will now move beyond denial and do what is fitting in a democracy — take action.\nI’ve said for some time that Europe will crack down harder on Islam because of its history and because it is more vulnerable to a Muslim takeover based on its demographics.  It’s interesting to note that a single murder by a jihadist already has the Dutch people burning a mosque and prepared to strip citizenship from its Muslim citizens.\nAmerica truly is a tertiary front and some of the uglier incidents are probably going to take place in France, Denmark and Holland.  It’s customary to talk about the Europeans as paper lions, and in some senses they certainly are.  But in two thousand years of history, the Europeans have never been shy about using brutal government force on citizens considered problematic\neven after World War II\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-06T11:07:00+00:00"
}