{
  "url": "https://voxday.net/2004/11/24/hollywood-cowards/",
  "scraped_at": "2026-01-08T19:45:42.532828",
  "title": "Hollywood cowards",
  "date_display": "November 24, 2004",
  "date_iso": "2004-11-24T18:02:00+00:00",
  "date_from_url": "2004-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>One would think that in the name of artistic freedom, the creative community would take a stand against filmmakers being sent into hiding à la Salman Rushdie, or left bleeding in the street. Yet <a href=\"http://www.opinionjournal.com/extra/?id=110005935\">we’ve heard nary a peep from Hollywood</a> about the van Gogh slaying. Indeed Hollywood has long walked on eggshells regarding the topic of Islamic fundamentalism. The film version of Tom Clancy’s “The Sum of All Fears” changed Palestinian terrorists to neo-Nazis out of a desire to avoid offending Arabs or Muslims. The war on terror is a Tinsel Town taboo, even though a Hollywood Reporter poll showed that roughly two-thirds of filmgoers surveyed would pay to see a film on the topic.</br></p><p>In a recent conversation with a struggling liberal screenwriter, I brought up the Clancy film as an example of Hollywood shying away from what really affects filmgoers–namely, the al Qaeda threat vs. the neo-Nazi threat. He vehemently defended the script switch. “It’s an easy target,” he said of Arab terrorism, repeating this like a parrot, then adding, “It’s a cheap shot.” How many American moviegoers would think that scripting Arab terrorists as the enemy in a fiction film is a “cheap shot”? In fact, it’s realism; it’s what touches lives world-wide. It’s this disconnect with filmgoers that has left the Hollywood box office bleeding by the side of the road.<br/></p></blockquote><p>Keep in mind, this is the same crowd that insists on the artistic purity of portraying the “realism” of the inner city by showing enough murders per minute to wipe out Los Angeles in five years.  All you have to know about Hollywood is that its denizens believe all blacks are gangsters and that there’s no such thing as an Arab terrorist… it’s the neo-Nazis that are the real danger!</p><p>(I’ve been at a European soccer game where the real Neos were showing out.  They were a bunch of 13-16 year-olds with arms the size of my finger, it’s about as genuinely dangerous as your average white suburban Eminem fan is a gangster.)</p><p>If Christians ever got one-one hundredth as concerned about insults to their religion as Muslims are about theirs, you’d never see a priest or Protestant bad guy out of Hollywood again.<br/></p></div>",
  "content_text": "One would think that in the name of artistic freedom, the creative community would take a stand against filmmakers being sent into hiding à la Salman Rushdie, or left bleeding in the street. Yet\nwe’ve heard nary a peep from Hollywood\nabout the van Gogh slaying. Indeed Hollywood has long walked on eggshells regarding the topic of Islamic fundamentalism. The film version of Tom Clancy’s “The Sum of All Fears” changed Palestinian terrorists to neo-Nazis out of a desire to avoid offending Arabs or Muslims. The war on terror is a Tinsel Town taboo, even though a Hollywood Reporter poll showed that roughly two-thirds of filmgoers surveyed would pay to see a film on the topic.\nIn a recent conversation with a struggling liberal screenwriter, I brought up the Clancy film as an example of Hollywood shying away from what really affects filmgoers–namely, the al Qaeda threat vs. the neo-Nazi threat. He vehemently defended the script switch. “It’s an easy target,” he said of Arab terrorism, repeating this like a parrot, then adding, “It’s a cheap shot.” How many American moviegoers would think that scripting Arab terrorists as the enemy in a fiction film is a “cheap shot”? In fact, it’s realism; it’s what touches lives world-wide. It’s this disconnect with filmgoers that has left the Hollywood box office bleeding by the side of the road.\nKeep in mind, this is the same crowd that insists on the artistic purity of portraying the “realism” of the inner city by showing enough murders per minute to wipe out Los Angeles in five years.  All you have to know about Hollywood is that its denizens believe all blacks are gangsters and that there’s no such thing as an Arab terrorist… it’s the neo-Nazis that are the real danger!\n(I’ve been at a European soccer game where the real Neos were showing out.  They were a bunch of 13-16 year-olds with arms the size of my finger, it’s about as genuinely dangerous as your average white suburban Eminem fan is a gangster.)\nIf Christians ever got one-one hundredth as concerned about insults to their religion as Muslims are about theirs, you’d never see a priest or Protestant bad guy out of Hollywood again.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-24T18:02:00+00:00"
}