{
  "url": "https://voxday.net/2004/11/12/illogically-optimistic-atheis/",
  "scraped_at": "2026-01-08T19:43:53.229727",
  "title": "The illogically optimistic atheist",
  "date_display": "November 12, 2004",
  "date_iso": "2004-11-12T11:28:00+00:00",
  "date_from_url": "2004-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The scrutable Mr. Rasmussen <a href=\"http://uti.dinggraphics.com/archives/000378.html\">screws himself into an logical bind</a> in response to a post of mine earlier this week:<br/></p><blockquote><p> <br><em>“Tell me again why I shouldn’t blow your head off since there is no God, no good and evil, no right and wrong? Oh, because it would be non-utilitarian if everyone were to behave so, and you’ve constructed a rational structure in your head which, um, doesn’t have anything to do with me? BOOM!”</em></br></p><p>How about, I have created a rational structure in my head that is shared with the rational structure in everyone else’s head and enforced by the law that we have created as a society. Click. You’re on death row – regardless of whether or not your Magic Man in the Sky exists….</p><p>What this all really boils down to is that a secular person who does good for goodness’ sake is a more moral person than a theist who does good only out of fear of divine retribution. Of course Vox and his minions will denigrate my opinion as silly and blind and atheist and secular. You know, because their invisible, omnimax god-thing is so much more reasonable.</p><p>Depressed, I am. The world seems to be going insane and there doesn’t seem to be any way to stop the madness.<br/></p></blockquote><p>It’s amazing how a self-styled rationalist can demonstrate such a limited capacity for logical thought, not to mention reading comprehension.  The point of my original post was not to state that I’m a psychotic killing machine, inhibited only by my fear of God and the hereafter, but to demonstrate that the rational structure, however admirable, in Mr. Rasmussen’s head, IS MANIFESTLY NOT IN EVERYONE ELSE’S HEAD!</p><p>His answer is nothing more than a paraphrase of W. Somerset Maugham’s modification of Crowley, “do what thou wilt with due regard for the policeman around the corner”.  But neither he nor Maugham has anything to say to the psychopathic deist or the rational atheist who happens to take pleasure in killing; still less can they address Crowley’s principles as embodied into law by various historical societies.  In any society where “thou shalt kill” is written into the law, such as Mao’s People’s Republic of China or the Democratic Republic of Kampuchea, Mr. Rasmussen’s philosophy is clearly inadequate to the task, <a href=\"http://www.milobookclub.com/2004/11/09/mailvox-good-evil-and-rational-ethics/\">just as I wrote in another earlier post</a> that it must be.</p><p>I actually agree that a secular person who does right of his own accord is an inherently better person than a believer who does right out of the fear of God.  The tragedy of the irrational atheist is that he usually is a genuinely decent individual; it is his own decency that blinds him to the corruption and evil in the hearts of others.</p><p>On a societal level, atheism does little harm when it is limited to an abstract-minded elite.  But unleashing it on the more carnally minded masses is a recipe for disaster, as both Voltaire and Socrates recognized.  What is ironic is that it is actually atheism which is the optimist’s fairy tale; Christianity, on the other hand, is a grimly realistic faith which requires the willingness to stare squarely into the abyss and not shirk from what looks back.</p><p>Don’t get me wrong.  I may disagree with them and mock them at times, but I quite like irrational atheists.  It’s the rational ones who scare me, such as the nihilistic Chinese gentleman who wrote the following words:</p><p><em>Heaven brings forth innumerable things to help man.<br> <br>Man has nothing with which to recompense Heaven.<br> <br>Kill. Kill. Kill. Kill. Kill. Kill. Kill.</br></br></br></br></em></p><p>The reference to Heaven notwithstanding, this is not the composition of a Deist.  This is the desperation of a rational man who lacks both faith and Mr. Rasmussen’s utilitarian edifice, who sees no reason not to unleash his empty bitterness and fury upon his fellow man.<br/></p></div>",
  "content_text": "The scrutable Mr. Rasmussen\nscrews himself into an logical bind\nin response to a post of mine earlier this week:\n“Tell me again why I shouldn’t blow your head off since there is no God, no good and evil, no right and wrong? Oh, because it would be non-utilitarian if everyone were to behave so, and you’ve constructed a rational structure in your head which, um, doesn’t have anything to do with me? BOOM!”\nHow about, I have created a rational structure in my head that is shared with the rational structure in everyone else’s head and enforced by the law that we have created as a society. Click. You’re on death row – regardless of whether or not your Magic Man in the Sky exists….\nWhat this all really boils down to is that a secular person who does good for goodness’ sake is a more moral person than a theist who does good only out of fear of divine retribution. Of course Vox and his minions will denigrate my opinion as silly and blind and atheist and secular. You know, because their invisible, omnimax god-thing is so much more reasonable.\nDepressed, I am. The world seems to be going insane and there doesn’t seem to be any way to stop the madness.\nIt’s amazing how a self-styled rationalist can demonstrate such a limited capacity for logical thought, not to mention reading comprehension.  The point of my original post was not to state that I’m a psychotic killing machine, inhibited only by my fear of God and the hereafter, but to demonstrate that the rational structure, however admirable, in Mr. Rasmussen’s head, IS MANIFESTLY NOT IN EVERYONE ELSE’S HEAD!\nHis answer is nothing more than a paraphrase of W. Somerset Maugham’s modification of Crowley, “do what thou wilt with due regard for the policeman around the corner”.  But neither he nor Maugham has anything to say to the psychopathic deist or the rational atheist who happens to take pleasure in killing; still less can they address Crowley’s principles as embodied into law by various historical societies.  In any society where “thou shalt kill” is written into the law, such as Mao’s People’s Republic of China or the Democratic Republic of Kampuchea, Mr. Rasmussen’s philosophy is clearly inadequate to the task,\njust as I wrote in another earlier post\nthat it must be.\nI actually agree that a secular person who does right of his own accord is an inherently better person than a believer who does right out of the fear of God.  The tragedy of the irrational atheist is that he usually is a genuinely decent individual; it is his own decency that blinds him to the corruption and evil in the hearts of others.\nOn a societal level, atheism does little harm when it is limited to an abstract-minded elite.  But unleashing it on the more carnally minded masses is a recipe for disaster, as both Voltaire and Socrates recognized.  What is ironic is that it is actually atheism which is the optimist’s fairy tale; Christianity, on the other hand, is a grimly realistic faith which requires the willingness to stare squarely into the abyss and not shirk from what looks back.\nDon’t get me wrong.  I may disagree with them and mock them at times, but I quite like irrational atheists.  It’s the rational ones who scare me, such as the nihilistic Chinese gentleman who wrote the following words:\nHeaven brings forth innumerable things to help man.\nMan has nothing with which to recompense Heaven.\nKill. Kill. Kill. Kill. Kill. Kill. Kill.\nThe reference to Heaven notwithstanding, this is not the composition of a Deist.  This is the desperation of a rational man who lacks both faith and Mr. Rasmussen’s utilitarian edifice, who sees no reason not to unleash his empty bitterness and fury upon his fellow man.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-12T11:28:00+00:00"
}