{
  "url": "https://voxday.net/2004/11/01/islamic-tolerance/",
  "scraped_at": "2025-12-19T20:51:48.475768",
  "title": "Islamic tolerance",
  "date_display": "November 1, 2004",
  "date_iso": "2004-11-01T06:04:00+00:00",
  "date_from_url": "2004-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br><a href=\"http://www.nytimes.com/2004/10/31/international/asia/31cnd-china.html?ei=5006&amp;en=c4c119d7ec061625&amp;ex=1099890000&amp;partner=ALTAVISTA1&amp;pagewanted=print&amp;position=\">Violent clashes</a> between members of the Muslim Hui ethnic group and the majority Han group left nearly 150 people dead and forced authorities to declare martial law in a section of Henan Province in central China, journalists and witnesses in the region said today. The fighting flared late last week and continued into the weekend after a Hui taxi driver fatally struck a 6-year-old Han girl, prompting recriminations between different ethnic groups in neighboring villages, these people said. One person who was briefed on the incident by the police said that 148 people had been killed, including 18 police officers sent to quell the violence.</br></p><p>Chinese media have reported nothing about unrest in Henan. But a news blackout would not be unusual, as propaganda authorities routinely suppress information about ethnic tensions.Although most Chinese belong to the dominant Han ethnic group, the country has 55 other groups, including several Muslim minorities and others who have ties to Tibet, Southeast Asia, Korea and Mongolia. Ethnic Muslim Uighurs in China’s northwestern region of Xinjiang have led sporadic uprisings against Chinese rule and authorities maintain a heavy police presence there to prevent an Islamic insurgency. Hui Muslims, scattered in several provinces in the central and Western part of the country, are more integrated and generally are not considered a threat to social stability.<br/></p></blockquote><p>My repeated insistence that it is vital to understand the enemy who has declared war on America should not be confused for the Left’s oft-heard insistence which equates understanding with ACCEPTING and EXCUSING.  In times of conflict, incredible and inaccurate demonizations of the other side are common; while they may motivate the young and the stupid to accept any behavior as necessary on the part of the government, they also can prevent us from seeing and exploiting the weaknesses of the other side.</p><p>The National Review’s love for it aside, the concept of Islamic fascism is very much inaccurate.  Islam’s strength is its decentralized, pan-national nature, which is directly contrary to the highly centralized nationalism of fascism.  It is also very ethnically tolerant, which is why black Muslims are active in Nigeria, Asian Muslims are active in the Philippines, Indonesia and China and white Muslims are making threatening videos and trying to set their shoes on fire on airplanes.  This genuine tolerance to all who make the submission was one reason for its widespread acceptance during its first expansionary phase and it is one reason for its appeal to men and women today.</p><p>The truth is the truth.  Evading uncomfortable truths will not help the West to end the jihadist war on it, doing so will only prolong the conflict.<br/></p></div>",
  "content_text": "Violent clashes\nbetween members of the Muslim Hui ethnic group and the majority Han group left nearly 150 people dead and forced authorities to declare martial law in a section of Henan Province in central China, journalists and witnesses in the region said today. The fighting flared late last week and continued into the weekend after a Hui taxi driver fatally struck a 6-year-old Han girl, prompting recriminations between different ethnic groups in neighboring villages, these people said. One person who was briefed on the incident by the police said that 148 people had been killed, including 18 police officers sent to quell the violence.\nChinese media have reported nothing about unrest in Henan. But a news blackout would not be unusual, as propaganda authorities routinely suppress information about ethnic tensions.Although most Chinese belong to the dominant Han ethnic group, the country has 55 other groups, including several Muslim minorities and others who have ties to Tibet, Southeast Asia, Korea and Mongolia. Ethnic Muslim Uighurs in China’s northwestern region of Xinjiang have led sporadic uprisings against Chinese rule and authorities maintain a heavy police presence there to prevent an Islamic insurgency. Hui Muslims, scattered in several provinces in the central and Western part of the country, are more integrated and generally are not considered a threat to social stability.\nMy repeated insistence that it is vital to understand the enemy who has declared war on America should not be confused for the Left’s oft-heard insistence which equates understanding with ACCEPTING and EXCUSING.  In times of conflict, incredible and inaccurate demonizations of the other side are common; while they may motivate the young and the stupid to accept any behavior as necessary on the part of the government, they also can prevent us from seeing and exploiting the weaknesses of the other side.\nThe National Review’s love for it aside, the concept of Islamic fascism is very much inaccurate.  Islam’s strength is its decentralized, pan-national nature, which is directly contrary to the highly centralized nationalism of fascism.  It is also very ethnically tolerant, which is why black Muslims are active in Nigeria, Asian Muslims are active in the Philippines, Indonesia and China and white Muslims are making threatening videos and trying to set their shoes on fire on airplanes.  This genuine tolerance to all who make the submission was one reason for its widespread acceptance during its first expansionary phase and it is one reason for its appeal to men and women today.\nThe truth is the truth.  Evading uncomfortable truths will not help the West to end the jihadist war on it, doing so will only prolong the conflict.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-01T06:04:00+00:00"
}