{
  "url": "https://voxday.net/2004/11/05/lies-and-lying-krugmans-who-tell-the/",
  "scraped_at": "2025-12-19T20:52:27.347744",
  "title": "Lies and the Lying Krugmans who tell them",
  "date_display": "November 5, 2004",
  "date_iso": "2004-11-05T17:44:00+00:00",
  "date_from_url": "2004-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paul Krugman writes in the New York Times:<br/></p><blockquote><p> <br>Yes, Democrats need to make it clear that they support personal virtue, that they value fidelity, responsibility, honesty and faith. This shouldn’t be a hard case to make: Democrats are as likely as Republicans to be faithful spouses and good parents, and Republicans are as likely as Democrats to be adulterers, gamblers or drug abusers. Massachusetts has the lowest divorce rate in the country; blue states, on average, have lower rates of out-of-wedlock births than red states.<br/></br></p></blockquote><p>Except, of course, they don’t, because the majority of them believe such things are relative.  As soon as I read that, I was sure Krugman was being disingenuous with the numbers.  And my suspicions proved to be correct, because Massachusetts residents are simply not as likely to be spouses of any kind; MA may be TIED for the SECOND-lowest divorce rate at 2.5 per thousand <a href=\"http://www.cdc.gov/nchs/data/nvss/mar&amp;div.pdf\">according to a report released by the CDC</a> this August, (DC is counted as a state by the CDC and has the lowest, GA is tied with MA) but this low divorce rate is because MA has the fourth-lowest marriage rate in the country at 5.9 per thousand.  You can’t get divorced if you don’t get married in the first place.</p><p>For both divorce and marriage rates, MA is at 63% of the national average, 2.5/4.0 divorce (62.5%) and 5.9/9.3 marriage (63.4%).  In other words, this citation of the divorce rate proves little except that a) people who don’t get married don’t get divorced, and, b) Paul Krugman is a deceptive ass who believes his audience is too stupid to look up even the most easily researched facts.  Furthermore, of 10 of the 12 states with the lowest marriage rates, (and the top seven), are all states that went for Kerry on Tuesday.  So, there would seem to be something to the godless heathen Democrats being anti-marriage in practice as well as theory.<br/></p></div>",
  "content_text": "Paul Krugman writes in the New York Times:\nYes, Democrats need to make it clear that they support personal virtue, that they value fidelity, responsibility, honesty and faith. This shouldn’t be a hard case to make: Democrats are as likely as Republicans to be faithful spouses and good parents, and Republicans are as likely as Democrats to be adulterers, gamblers or drug abusers. Massachusetts has the lowest divorce rate in the country; blue states, on average, have lower rates of out-of-wedlock births than red states.\nExcept, of course, they don’t, because the majority of them believe such things are relative.  As soon as I read that, I was sure Krugman was being disingenuous with the numbers.  And my suspicions proved to be correct, because Massachusetts residents are simply not as likely to be spouses of any kind; MA may be TIED for the SECOND-lowest divorce rate at 2.5 per thousand\naccording to a report released by the CDC\nthis August, (DC is counted as a state by the CDC and has the lowest, GA is tied with MA) but this low divorce rate is because MA has the fourth-lowest marriage rate in the country at 5.9 per thousand.  You can’t get divorced if you don’t get married in the first place.\nFor both divorce and marriage rates, MA is at 63% of the national average, 2.5/4.0 divorce (62.5%) and 5.9/9.3 marriage (63.4%).  In other words, this citation of the divorce rate proves little except that a) people who don’t get married don’t get divorced, and, b) Paul Krugman is a deceptive ass who believes his audience is too stupid to look up even the most easily researched facts.  Furthermore, of 10 of the 12 states with the lowest marriage rates, (and the top seven), are all states that went for Kerry on Tuesday.  So, there would seem to be something to the godless heathen Democrats being anti-marriage in practice as well as theory.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-05T17:44:00+00:00"
}