{
  "url": "https://voxday.net/2004/11/16/lines-and-stepping-over-thereof_16/",
  "scraped_at": "2026-01-08T19:44:37.644384",
  "title": "Lines and the stepping-over thereof",
  "date_display": "November 16, 2004",
  "date_iso": "2004-11-16T21:49:00+00:00",
  "date_from_url": "2004-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Andy laments:<br/></p><blockquote><p> <br>I’ve not done an actual analysis, but, in subsequent topics/comments to this thread, I have perceived an increase in the use of words/phrases which were (IMHO) better left unsaid.<br/></br></p></blockquote><p>That’s always the case, and someone goes too far, and then I’ll tell them to knock it off, and then things will clean up for a while.  It’s the norm.  But considering that I’ve been absolutely steeped in the Hitchhikers’ Trilogy for the last week, the chances that I was going to let that Rory reference go were essentially nil.</p><p>So, to those inclined to more earthy speech, I say, that’s enough.  The humor depends on the rarity factor, thus spake Vox.  To those who are inclined to take it overly seriously, I encourage you to unwind that Gordian knot and deal with it; it may not happen often but it will happen from time to time.  And on a gratuitous basis, I do hope.</p><p>And to anyone who happens to be interested, I say that I have completed <b>The Dichotomous Subversive: Douglas Adams and the Rule of Unreason</b> and sent it in.  Hopefully the good people at Benbella will find it to their liking and it will appear in the collection of essays devoted to the work of the late and much-lamented Mr. Adams.<br/></p></div>",
  "content_text": "Andy laments:\nI’ve not done an actual analysis, but, in subsequent topics/comments to this thread, I have perceived an increase in the use of words/phrases which were (IMHO) better left unsaid.\nThat’s always the case, and someone goes too far, and then I’ll tell them to knock it off, and then things will clean up for a while.  It’s the norm.  But considering that I’ve been absolutely steeped in the Hitchhikers’ Trilogy for the last week, the chances that I was going to let that Rory reference go were essentially nil.\nSo, to those inclined to more earthy speech, I say, that’s enough.  The humor depends on the rarity factor, thus spake Vox.  To those who are inclined to take it overly seriously, I encourage you to unwind that Gordian knot and deal with it; it may not happen often but it will happen from time to time.  And on a gratuitous basis, I do hope.\nAnd to anyone who happens to be interested, I say that I have completed\nThe Dichotomous Subversive: Douglas Adams and the Rule of Unreason\nand sent it in.  Hopefully the good people at Benbella will find it to their liking and it will appear in the collection of essays devoted to the work of the late and much-lamented Mr. Adams.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-16T21:49:00+00:00"
}