{
  "url": "https://voxday.net/2004/11/04/little-cold-water-down-your-neck/",
  "scraped_at": "2025-12-19T20:52:21.816051",
  "title": "A little cold water down your neck",
  "date_display": "November 4, 2004",
  "date_iso": "2004-11-04T11:44:00+00:00",
  "date_from_url": "2004-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LD brings this to our attention:<br/></p><blockquote><p> <br>The Republican expected to chair the Senate Judiciary Committee next year <a href=\"http://www.chron.com/cs/CDA/ssistory.mpl/politics/2883040\">bluntly warned newly re-elected President Bush</a> today against putting forth Supreme Court nominees who would seek to overturn abortion rights or are otherwise too conservative to win confirmation.  Sen. Arlen Specter, fresh from winning a fifth term in Pennsylvania, also said the current Supreme Court now lacks legal “giants” on the bench.</br></p><p>“When you talk about judges who would change the right of a woman to choose, overturn Roe v. Wade, I think that is unlikely,” Specter said, referring to the landmark 1973 Supreme Court decision legalizing abortion.</p><p>“The president is well aware of what happened, when a bunch of his nominees were sent up, with the filibuster,” Specter added, referring to Senate Democrats’ success over the past four years in blocking the confirmation of many of Bush’s conservative judicial picks. “… And I would expect the president to be mindful of the considerations which I am mentioning.”<br/></p></blockquote><p>Don’t say I didn’t warn you about this.  I heard from a lot of conservatives before the election that the only reason they were supporting George Bush was because he would put conservative, pro-life judges on the Supreme Court, but Sen. Spector is wasting no time before disabusing his fellow Republicans of the notion.  How surprising that he should remain silent on this until immediately after the election.</p><p>Do try to remember this four years from now, when we again face THE MOST IMPORTANT ELECTION OF OUR LIFETIMES.<br/></p></div>",
  "content_text": "LD brings this to our attention:\nThe Republican expected to chair the Senate Judiciary Committee next year\nbluntly warned newly re-elected President Bush\ntoday against putting forth Supreme Court nominees who would seek to overturn abortion rights or are otherwise too conservative to win confirmation.  Sen. Arlen Specter, fresh from winning a fifth term in Pennsylvania, also said the current Supreme Court now lacks legal “giants” on the bench.\n“When you talk about judges who would change the right of a woman to choose, overturn Roe v. Wade, I think that is unlikely,” Specter said, referring to the landmark 1973 Supreme Court decision legalizing abortion.\n“The president is well aware of what happened, when a bunch of his nominees were sent up, with the filibuster,” Specter added, referring to Senate Democrats’ success over the past four years in blocking the confirmation of many of Bush’s conservative judicial picks. “… And I would expect the president to be mindful of the considerations which I am mentioning.”\nDon’t say I didn’t warn you about this.  I heard from a lot of conservatives before the election that the only reason they were supporting George Bush was because he would put conservative, pro-life judges on the Supreme Court, but Sen. Spector is wasting no time before disabusing his fellow Republicans of the notion.  How surprising that he should remain silent on this until immediately after the election.\nDo try to remember this four years from now, when we again face THE MOST IMPORTANT ELECTION OF OUR LIFETIMES.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-04T11:44:00+00:00"
}