{
  "url": "https://voxday.net/2004/11/01/mailvox-letter-to-david-kupelian/",
  "scraped_at": "2025-12-19T20:51:58.338352",
  "title": "Mailvox: a letter to David Kupelian",
  "date_display": "November 1, 2004",
  "date_iso": "2004-11-01T19:08:00+00:00",
  "date_from_url": "2004-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JA writes in response to <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=41219\">David Kupelian’s open letter</a> to third-party voters:<br/></p><blockquote><p> <br>I couldn’t sit back and not comment on David Kupelian’s attempt to sway voters.  For starters, Kupelian’s comments were nothing but simplistic fear-mongering.  I’ve heard it since I first got interested in politics in the 9th grade (Carter running against Ford).  It’s pathetic.</br></p><p>Idiotic neo-cons need to quit trying to blame principled Christians as if it is their fault if the neo-con’s candidate doesn’t win.  Perhaps if Bush was a candidate for Christians (and true conservatives in general), he’d get our vote.  He’s not, and only the uninformed Christian will vote for him.  If Kerry wins, it will be because he got enough electoral votes.  Same for Bush. Kupelian’s argument is as insulting as it is ignorant. I reject Kupelian’s argument with this quote: <em>“Always vote for principle, though you may vote alone, you may cherish the sweetest reflection that your vote is never lost.”</em> — John Quincy Adams</p><p>What is shallow and unworthy is Kupelian’s pathetic attempt to shame Christians into voting for Bush.  Has Kupelian no faith in God? My God is not so small that He allows others to determine what will happen on earth beyond what He wishes. The argument of ‘every Christian is a sinner’ is no argument for voting for Bush at all….</p><p>Kupelian even goes so far as to twist ‘the lesser of two evils is the ‘good’ choice.’  That’s almost saying evil is good and good is evil.  It’s twisted logic at best, if not outright lies. A vote for Bush or Kerry ensures the continued decline of our Constitution, our sovereignty, our culture and our liberty.  Neither man is worthy, and I know one of the two will be in the White House.  But not by my hand.  We will reap what we sow, as a nation, and it will not be good with either of these men in charge.</p><p>If David Kupelian is a man of faith, it is a small faith, and one filled more with fear of this life than of our Father in Heaven.  God is a big God, and His ways are mysterious to us.  To quote Mother Theresa, “God didn’t call me to be successful, He called me to be faithful.”  If Kupelian’s faith is in the Republican Party, he worships a false god.<br/></p></blockquote><p>Now, Kupelian is no “idiotic neo-con”, many principled Christians will vote for Bush, (and for that matter, Kerry) and I also happen to disagree with the statement that God does not allow others to determine things beyond what He wishes.  (I believe that this world is fallen and under the authority of an evil god that Jesus Christ called “the prince of this world”)  But JA’s criticism is at heart well-founded.  Christianity is not only not of this world, but even in this world it goes far beyond the United States.  For example, the lesser of two evils argument expressed by Buchanan, Kupelian and Farah of late would have required Christians to support the Conservative Chirac in France because the Socialist Jospin was indubitably worse.  It’s nonsense, the only question is at which point you are willing to recognize it as such.</p><p>Political pragmatism is not only counter-productive, but fatal in the long-run.  Testimony to this is how the Republicans of today often appear to be to the left of many, if not most, of the Democrats of 40 years ago.<br/></p></div>",
  "content_text": "JA writes in response to\nDavid Kupelian’s open letter\nto third-party voters:\nI couldn’t sit back and not comment on David Kupelian’s attempt to sway voters.  For starters, Kupelian’s comments were nothing but simplistic fear-mongering.  I’ve heard it since I first got interested in politics in the 9th grade (Carter running against Ford).  It’s pathetic.\nIdiotic neo-cons need to quit trying to blame principled Christians as if it is their fault if the neo-con’s candidate doesn’t win.  Perhaps if Bush was a candidate for Christians (and true conservatives in general), he’d get our vote.  He’s not, and only the uninformed Christian will vote for him.  If Kerry wins, it will be because he got enough electoral votes.  Same for Bush. Kupelian’s argument is as insulting as it is ignorant. I reject Kupelian’s argument with this quote:\n“Always vote for principle, though you may vote alone, you may cherish the sweetest reflection that your vote is never lost.”\n— John Quincy Adams\nWhat is shallow and unworthy is Kupelian’s pathetic attempt to shame Christians into voting for Bush.  Has Kupelian no faith in God? My God is not so small that He allows others to determine what will happen on earth beyond what He wishes. The argument of ‘every Christian is a sinner’ is no argument for voting for Bush at all….\nKupelian even goes so far as to twist ‘the lesser of two evils is the ‘good’ choice.’  That’s almost saying evil is good and good is evil.  It’s twisted logic at best, if not outright lies. A vote for Bush or Kerry ensures the continued decline of our Constitution, our sovereignty, our culture and our liberty.  Neither man is worthy, and I know one of the two will be in the White House.  But not by my hand.  We will reap what we sow, as a nation, and it will not be good with either of these men in charge.\nIf David Kupelian is a man of faith, it is a small faith, and one filled more with fear of this life than of our Father in Heaven.  God is a big God, and His ways are mysterious to us.  To quote Mother Theresa, “God didn’t call me to be successful, He called me to be faithful.”  If Kupelian’s faith is in the Republican Party, he worships a false god.\nNow, Kupelian is no “idiotic neo-con”, many principled Christians will vote for Bush, (and for that matter, Kerry) and I also happen to disagree with the statement that God does not allow others to determine things beyond what He wishes.  (I believe that this world is fallen and under the authority of an evil god that Jesus Christ called “the prince of this world”)  But JA’s criticism is at heart well-founded.  Christianity is not only not of this world, but even in this world it goes far beyond the United States.  For example, the lesser of two evils argument expressed by Buchanan, Kupelian and Farah of late would have required Christians to support the Conservative Chirac in France because the Socialist Jospin was indubitably worse.  It’s nonsense, the only question is at which point you are willing to recognize it as such.\nPolitical pragmatism is not only counter-productive, but fatal in the long-run.  Testimony to this is how the Republicans of today often appear to be to the left of many, if not most, of the Democrats of 40 years ago.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-01T19:08:00+00:00"
}