{
  "url": "https://voxday.net/2004/11/13/mailvox-where-to-star-2/",
  "scraped_at": "2026-01-08T19:43:58.744167",
  "title": "Mailvox: where to start?",
  "date_display": "November 13, 2004",
  "date_iso": "2004-11-13T09:37:00+00:00",
  "date_from_url": "2004-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ellis shies from the real world:<br/></p><blockquote><p> <br>Because if everyone behaved in that way, life wouldn’t be pleasant for anyone except maybe the most brutal. I would much rather live in a society where people at least attempt to avoid injuring one another, so I do my part to make society better instead of worse.  Is this really that hard to get?<br/></br></p></blockquote><p>What does how you would prefer to live have to do with anything, Ellis?  Have you never heard of the law of tooth and claw?  As an atheist, do you not believe in evolution, where only the strongest survive to improve the species?  I have no doubt that you are a decent human being our mutual lights, but your very decency is both irrational and illogical considering your beliefs – and they are beliefs, demonstrably more unfounded than those of the most unthinking Bible-thumping fundamentalists.</p><p>That fundamentalist at least has an ancient book at which to point, whereas you’ve got literally nothing except a history that records a reality flying directly in the face of your wishes.  And you haven’t even attempted to address the main point, which was my assertion that the atheist has no wherewithal to confront evil, no basis with which to criticize the individual who does not share his utilitarian analysis but decides instead that the common interest is best served by ridding the world of Jews, blacks, Christians, intellectuals, gays, unborn children or whatever the victim du jour might be.<br/></p><blockquote><p> <br>My thought is that by nature, most people will do good most of the time.<br/></br></p></blockquote><p>And this statement is based on what?  Nothing!  And what is that good of which you speak, the rational structure in your head which is shared by no one else?  Again, the wishful thinking of the decent atheist looking at others through rose-colored glasses.  And yet atheists often accuse the faithful of believing in fairy tales!  History proves that enough people wish to do evil enough of the time to produce the war, crime and bloodshed that is familiar to every society in every age.<br/></p><blockquote><p> <br>Also:  “With or without religion, good people can behave well and bad people can do evil — but for good people to do evil — that takes religion.”<br/></br></p></blockquote><p>There are few things as annoying as a pithy and meaningless quote that is somehow supposed to be deeply meaningful.  Were there no good people in China, the Soviet Union or Kampuchea who were swept up into the profoundly atheistic murderous frenzies?  Were there no good people committing evil acts in any of <a href=\"http://www.voxday.net/archive/2004/110804.html\">the 489 wars I surveyed for this article</a>, 90 percent of which had nothing to do with religion of any kind?</p><p>The quote is simply incorrect.  Getting good people to do evil does not take religion, it only requires a government edict.<br/></p></div>",
  "content_text": "Ellis shies from the real world:\nBecause if everyone behaved in that way, life wouldn’t be pleasant for anyone except maybe the most brutal. I would much rather live in a society where people at least attempt to avoid injuring one another, so I do my part to make society better instead of worse.  Is this really that hard to get?\nWhat does how you would prefer to live have to do with anything, Ellis?  Have you never heard of the law of tooth and claw?  As an atheist, do you not believe in evolution, where only the strongest survive to improve the species?  I have no doubt that you are a decent human being our mutual lights, but your very decency is both irrational and illogical considering your beliefs – and they are beliefs, demonstrably more unfounded than those of the most unthinking Bible-thumping fundamentalists.\nThat fundamentalist at least has an ancient book at which to point, whereas you’ve got literally nothing except a history that records a reality flying directly in the face of your wishes.  And you haven’t even attempted to address the main point, which was my assertion that the atheist has no wherewithal to confront evil, no basis with which to criticize the individual who does not share his utilitarian analysis but decides instead that the common interest is best served by ridding the world of Jews, blacks, Christians, intellectuals, gays, unborn children or whatever the victim du jour might be.\nMy thought is that by nature, most people will do good most of the time.\nAnd this statement is based on what?  Nothing!  And what is that good of which you speak, the rational structure in your head which is shared by no one else?  Again, the wishful thinking of the decent atheist looking at others through rose-colored glasses.  And yet atheists often accuse the faithful of believing in fairy tales!  History proves that enough people wish to do evil enough of the time to produce the war, crime and bloodshed that is familiar to every society in every age.\nAlso:  “With or without religion, good people can behave well and bad people can do evil — but for good people to do evil — that takes religion.”\nThere are few things as annoying as a pithy and meaningless quote that is somehow supposed to be deeply meaningful.  Were there no good people in China, the Soviet Union or Kampuchea who were swept up into the profoundly atheistic murderous frenzies?  Were there no good people committing evil acts in any of\nthe 489 wars I surveyed for this article\n, 90 percent of which had nothing to do with religion of any kind?\nThe quote is simply incorrect.  Getting good people to do evil does not take religion, it only requires a government edict.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-13T09:37:00+00:00"
}