{
  "url": "https://voxday.net/2004/11/16/no-quarter/",
  "scraped_at": "2026-01-08T19:44:33.965766",
  "title": "No quarter",
  "date_display": "November 16, 2004",
  "date_iso": "2004-11-16T13:23:00+00:00",
  "date_from_url": "2004-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br><a href=\"http://apnews.myway.com/article/20041116/D86CNL1G0.html\">A U.S. Marine shot and killed a wounded and apparently unarmed Iraqi prisoner</a> in a mosque in the former insurgent stronghold of Fallujah, according to dramatic pool television pictures broadcast Monday. A Marine spokesman in Washington said the shooting was under investigation. The shooting Saturday was videotaped by pool correspondent Kevin Sites of NBC television, who said three other previously wounded prisoners in the mosque apparently also had been shot again by the Marines inside the mosque….</br></p><p>The Marines had treated the wounded, he reported, left them behind and continued on Friday with their drive to retake the city from insurgents who have been battling U.S.-led occupation forces in Iraq with increasing ferocity and violence in recent months.  On the video as the camera moved into the mosque during the Saturday incident, a Marine can be heard shouting obscenities in the background, yelling that one of the men was only pretending to be dead.</p><p>The video then showed a Marine raising his rifle toward a prisoner laying on the floor of the mosque but neither NBC nor CNN showed the bullet hitting the man. At that moment the video was blacked out but the report of the rifle could be heard.  Sites reported a Marine in the same unit had been killed just a day earlier when he tended to the booby-trapped dead body of an insurgent.<br/></p></blockquote><p>Sorry, but if you’re booby-trapping your own dead and using suicide bombers as a primary weapon, you’re clearly not operating by the Geneva Convention and the Marines are more than justified in blowing away any enemy combatant at any time, prisoner or not.  I’m not a supporter of this nation-building quasi-war, but it is disgusting for civilians sitting in the safety of their air-conditioned offices try to pass judgment on young men operating in extreme peril against an enemy that openly spurns what few rules exist in wartime.</p><p>I’m not sure to what degree these “insurgents”, as the Marines call them, can be classified as terrorists.  The foreign jihadists clearly are, while many of those belonging to the Iraqi resistance probably are not.  The problem is that the history of terrorism strongly suggests that taking terrorists captive is short-sighted and ineffective, as the next hostage situation will demand their release.<br/></p></div>",
  "content_text": "A U.S. Marine shot and killed a wounded and apparently unarmed Iraqi prisoner\nin a mosque in the former insurgent stronghold of Fallujah, according to dramatic pool television pictures broadcast Monday. A Marine spokesman in Washington said the shooting was under investigation. The shooting Saturday was videotaped by pool correspondent Kevin Sites of NBC television, who said three other previously wounded prisoners in the mosque apparently also had been shot again by the Marines inside the mosque….\nThe Marines had treated the wounded, he reported, left them behind and continued on Friday with their drive to retake the city from insurgents who have been battling U.S.-led occupation forces in Iraq with increasing ferocity and violence in recent months.  On the video as the camera moved into the mosque during the Saturday incident, a Marine can be heard shouting obscenities in the background, yelling that one of the men was only pretending to be dead.\nThe video then showed a Marine raising his rifle toward a prisoner laying on the floor of the mosque but neither NBC nor CNN showed the bullet hitting the man. At that moment the video was blacked out but the report of the rifle could be heard.  Sites reported a Marine in the same unit had been killed just a day earlier when he tended to the booby-trapped dead body of an insurgent.\nSorry, but if you’re booby-trapping your own dead and using suicide bombers as a primary weapon, you’re clearly not operating by the Geneva Convention and the Marines are more than justified in blowing away any enemy combatant at any time, prisoner or not.  I’m not a supporter of this nation-building quasi-war, but it is disgusting for civilians sitting in the safety of their air-conditioned offices try to pass judgment on young men operating in extreme peril against an enemy that openly spurns what few rules exist in wartime.\nI’m not sure to what degree these “insurgents”, as the Marines call them, can be classified as terrorists.  The foreign jihadists clearly are, while many of those belonging to the Iraqi resistance probably are not.  The problem is that the history of terrorism strongly suggests that taking terrorists captive is short-sighted and ineffective, as the next hostage situation will demand their release.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-16T13:23:00+00:00"
}