{
  "url": "https://voxday.net/2004/11/16/no-this-isnt-libera/",
  "scraped_at": "2026-01-08T19:44:32.155318",
  "title": "No, this isn’t liberal",
  "date_display": "November 16, 2004",
  "date_iso": "2004-11-16T11:10:00+00:00",
  "date_from_url": "2004-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From ESPN:<br/></p><blockquote><p> <br>Charlie Sifford, the first African-American to play regularly on the PGA Tour, is now the first African-American in the World Golf Hall of Fame.  Surely, his induction this week at St. Augustine, Fla., tells us <a href=\"http://sports.espn.go.com/golf/news/story?id=1923268\">how far we have come from the days</a> when pigmentation meant closed doors in golf as it did in other areas of our society. But Sifford’s induction is also a reminder of how far we still have to go.</br></p><p>The fact that two of the top three male golfers in the world — Vijay Singh and Tiger Woods — are men of color is compelling and, on the surface, inspiring. But that inspiration is only skin deep. A glimpse just a shade below the surface reveals a reality closer to despair than hope. Simply put, 30 years ago there were 10 African-Americans with PGA Tour cards. Today, there is one — Tiger Woods.</p><p>If the color line was broken more than 40 years ago by Sifford, Pete Brown and others why then are there fewer — 90 percent fewer — African-Americans playing professional golf today than there were in the mid-1970s, more than a decade after the PGA Tour dropped its “Caucasian Only” clause? Why, more than eight full seasons after Woods turned professional, has no other African-American golfer earned a PGA Tour card?</p><p>The answer is frighteningly simple and the solution is frustratingly complex. The dilemma is not one of race as much as it is one of class. Despite all efforts, and until recently those efforts have been dubious at best, golf has become more expensive, more time consuming and less welcoming of new players. It is a closed fraternity and the secret handshake has been denied to most.<br/></p></blockquote><p>How far we have to go towards what?  The progressives never say.  The NBA, as a matter of fact, looks less like America than does the PGA Tour.  Golf is not much of a sport, but it is a strict meritocracy.  How many shots does it take to put the ball in the hole?</p><p>It’s certainly in the PGA Tour’s interest to expand its audience as widely as possible.  But apparently the explosion of the game throughout Asia doesn’t count; how many tour players are Asian?  Including, for one, Tiger Woods.  The writer doesn’t concern himself with contradictions like that, he’s far more interested in sustaining his thesis than ensuring it aligns with reality.</p><p>And don’t forget, according to FAIR, this article wouldn’t be considered liberal because it involves sports.<br/></p></div>",
  "content_text": "From ESPN:\nCharlie Sifford, the first African-American to play regularly on the PGA Tour, is now the first African-American in the World Golf Hall of Fame.  Surely, his induction this week at St. Augustine, Fla., tells us\nhow far we have come from the days\nwhen pigmentation meant closed doors in golf as it did in other areas of our society. But Sifford’s induction is also a reminder of how far we still have to go.\nThe fact that two of the top three male golfers in the world — Vijay Singh and Tiger Woods — are men of color is compelling and, on the surface, inspiring. But that inspiration is only skin deep. A glimpse just a shade below the surface reveals a reality closer to despair than hope. Simply put, 30 years ago there were 10 African-Americans with PGA Tour cards. Today, there is one — Tiger Woods.\nIf the color line was broken more than 40 years ago by Sifford, Pete Brown and others why then are there fewer — 90 percent fewer — African-Americans playing professional golf today than there were in the mid-1970s, more than a decade after the PGA Tour dropped its “Caucasian Only” clause? Why, more than eight full seasons after Woods turned professional, has no other African-American golfer earned a PGA Tour card?\nThe answer is frighteningly simple and the solution is frustratingly complex. The dilemma is not one of race as much as it is one of class. Despite all efforts, and until recently those efforts have been dubious at best, golf has become more expensive, more time consuming and less welcoming of new players. It is a closed fraternity and the secret handshake has been denied to most.\nHow far we have to go towards what?  The progressives never say.  The NBA, as a matter of fact, looks less like America than does the PGA Tour.  Golf is not much of a sport, but it is a strict meritocracy.  How many shots does it take to put the ball in the hole?\nIt’s certainly in the PGA Tour’s interest to expand its audience as widely as possible.  But apparently the explosion of the game throughout Asia doesn’t count; how many tour players are Asian?  Including, for one, Tiger Woods.  The writer doesn’t concern himself with contradictions like that, he’s far more interested in sustaining his thesis than ensuring it aligns with reality.\nAnd don’t forget, according to FAIR, this article wouldn’t be considered liberal because it involves sports.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-16T11:10:00+00:00"
}