{
  "url": "https://voxday.net/2004/11/04/on-eco-and-prous/",
  "scraped_at": "2025-12-19T20:52:19.953168",
  "title": "On Eco and Proust",
  "date_display": "November 4, 2004",
  "date_iso": "2004-11-04T11:25:00+00:00",
  "date_from_url": "2004-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I’m quite pleased to discover I can read Eco’s latest without having to resort to a dictionary, it’s a real shock to learn how slow one reads and how long it takes to read a book when one can’t blitz through it with normal speed-reading techniques.  On the other hand, there is real pleasure in being able to savor a book, especially one clearly designed to be savored.</p><p>I’ve also been reading Swann’s Way by Marcel Proust, (along with plenty of sci-fi and fantasy trash on my Dana while I’m working out at the gym), and it’s easy to see how Eco is very heavily influenced by him.  This isn’t exactly news, as Eco refers to Proust quite often in his essays and devotes no little attention to him in his published series of lectures on literature, <em>Six Walks Through the Fictional Woods</em>.  But it’s still striking to see to what extent he is influenced, as in <em>The Mysterious Flame</em> he uses the excuse of a partial amnesiac who has lost only his memoria episodica, which allows him to remember how to use toothpaste but not to recognize the brand and to remember Napoleon lost at Waterloo but not to recognize his wife, to experiment with diving into the depths of sensory experience in the mode of Proust and his midnight pillows.</p><p>Eco was obviously doing this to some extent in <em>Island of the Day Before</em>, but I did not recognize the significance of his statement that he had “been teaching himself to forget how to swim” when I interviewed him some years ago.  I put it down to a perfectionist’s method-writing, but a Proustian’s sensory engulfing may have been a more accurate description, in retrospect.</p><p>This may be a love story of sorts, too, between a man and the wife he cannot remember.  But it’s too soon to tell; I’ve only finished the first chapter.<br/></p></div>",
  "content_text": "While I’m quite pleased to discover I can read Eco’s latest without having to resort to a dictionary, it’s a real shock to learn how slow one reads and how long it takes to read a book when one can’t blitz through it with normal speed-reading techniques.  On the other hand, there is real pleasure in being able to savor a book, especially one clearly designed to be savored.\nI’ve also been reading Swann’s Way by Marcel Proust, (along with plenty of sci-fi and fantasy trash on my Dana while I’m working out at the gym), and it’s easy to see how Eco is very heavily influenced by him.  This isn’t exactly news, as Eco refers to Proust quite often in his essays and devotes no little attention to him in his published series of lectures on literature,\nSix Walks Through the Fictional Woods\n.  But it’s still striking to see to what extent he is influenced, as in\nThe Mysterious Flame\nhe uses the excuse of a partial amnesiac who has lost only his memoria episodica, which allows him to remember how to use toothpaste but not to recognize the brand and to remember Napoleon lost at Waterloo but not to recognize his wife, to experiment with diving into the depths of sensory experience in the mode of Proust and his midnight pillows.\nEco was obviously doing this to some extent in\nIsland of the Day Before\n, but I did not recognize the significance of his statement that he had “been teaching himself to forget how to swim” when I interviewed him some years ago.  I put it down to a perfectionist’s method-writing, but a Proustian’s sensory engulfing may have been a more accurate description, in retrospect.\nThis may be a love story of sorts, too, between a man and the wife he cannot remember.  But it’s too soon to tell; I’ve only finished the first chapter.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-04T11:25:00+00:00"
}