{
  "url": "https://voxday.net/2004/11/01/pretty-pictures/",
  "scraped_at": "2025-12-19T20:51:52.292206",
  "title": "Pretty pictures",
  "date_display": "November 1, 2004",
  "date_iso": "2004-11-01T09:33:00+00:00",
  "date_from_url": "2004-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>People often ask me how they can contribute or otherwise support my writing, seeing that I haven’t published a political book (yet) and I don’t have Amazon sub-store or a tip jar. (By the way, I don’t recommend that anyone work with the corporate thieves at Paypal; I’ve never used it but a search on Slashdot will soon explain why.)</p><p>But one thing that I would appreciate, if you really would like to contribute somehow to my long march towards Rushian levels of societal influence, is to consider purchasing <a href=\"http://www.christianbook.com/Christian/Books/product?item_no=41&amp;netp_id=294972&amp;event=ESRCN&amp;item_code=WW\">The War in Heaven</a> or <a href=\"http://www.christianbook.com/Christian/Books/product?item_no=54X&amp;netp_id=294978&amp;event=ESRCN&amp;item_code=WW\">The World in Shadow</a>, either for yourself or for someone on your Christmas list who likes reading fiction, especially fantasy or sci-fi.  For those who are younger or are less inclined to the literary, Patrick, the artists and I just finished the first volume in the three-volume <a href=\"http://www.cahabaproductions.com/Merchant2/merchant.mv?Screen=PROD&amp;Store_Code=C&amp;Product_Code=ATF_V1&amp;Category_Code=C_FALL\">Archangels: The Fall</a> comic series, which is a serious, intense and visually striking tale of Satan’s fall and Jesus Christ’s death and resurrection as seen through the eyes of the archangel Michael.  The cover of the first volume can be seen on the right; I’ve never been a comic book – sorry, <em>graphic novel</em> – guy, but as a medium for short stories, I’ve learned that it actually does have some unique strengths.</p><p>Anyhow, I am pleasantly surprised at how well the comic has turned out and I thought that some of you might be interested in hearing about it.  Please note that the signed copies are signed by Patrick, the series creator, and not me.<br/></p></div>",
  "content_text": "People often ask me how they can contribute or otherwise support my writing, seeing that I haven’t published a political book (yet) and I don’t have Amazon sub-store or a tip jar. (By the way, I don’t recommend that anyone work with the corporate thieves at Paypal; I’ve never used it but a search on Slashdot will soon explain why.)\nBut one thing that I would appreciate, if you really would like to contribute somehow to my long march towards Rushian levels of societal influence, is to consider purchasing\nThe War in Heaven\nor\nThe World in Shadow\n, either for yourself or for someone on your Christmas list who likes reading fiction, especially fantasy or sci-fi.  For those who are younger or are less inclined to the literary, Patrick, the artists and I just finished the first volume in the three-volume\nArchangels: The Fall\ncomic series, which is a serious, intense and visually striking tale of Satan’s fall and Jesus Christ’s death and resurrection as seen through the eyes of the archangel Michael.  The cover of the first volume can be seen on the right; I’ve never been a comic book – sorry,\ngraphic novel\n– guy, but as a medium for short stories, I’ve learned that it actually does have some unique strengths.\nAnyhow, I am pleasantly surprised at how well the comic has turned out and I thought that some of you might be interested in hearing about it.  Please note that the signed copies are signed by Patrick, the series creator, and not me.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-01T09:33:00+00:00"
}