{
  "url": "https://voxday.net/2004/11/07/there-they-go-again/",
  "scraped_at": "2026-01-08T19:42:57.637375",
  "title": "There they go again",
  "date_display": "November 7, 2004",
  "date_iso": "2004-11-07T05:43:00+00:00",
  "date_from_url": "2004-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Just days after losing his run for Congress, Arthur Farnsworth, Treasurer for the Pennsylvania Libertarian Party, was arrested and charged with “willfully attempting to evade federal income<br> <br>taxes.”   The government has asked that bail be denied, claiming that Mr. Farnsworth is a “flight risk” even though Mr. Farnsworth has no criminal record, has never failed to show up for any required appearance and has made his beliefs about the IRS public for years.  A preliminary hearing is set for Monday, November 8th.</br></br></br></p><p>For years Mr. Farnsworth has publicly expressed that the federal government has been deliberately misapplying the income tax laws and has been lying to the American people about the true nature of the tax.  On <a href=\"www.enter.net/~arthurlf\">his web site</a>, Farnsworth equates the perception that everyone owes income taxes with the one-time widely held, but now defunct belief that the world is flat.  Farnsworth correctly points out that federal courts have trouble agreeing on a specific legal definition for the word ‘income,’ and that there are dozens of references made by government officials, as well as within the law itself to the ‘voluntary<br> <br>nature’ of the tax code.</br></br></p><p>The crime Mr. Farnsworth has been charged with, “willful evasion of taxes,” is based on two elements.  First, that the Internal Revenue Code makes the individual liable for the income tax and second; that the individual actually believes the tax code makes them liable.  Both elements are necessary to achieve a conviction according to the U.S. Supreme Court, which stated in Cheek vs. U.S., 498 U.S. 192, “A good-faith misunderstanding of the law or a good-faith belief that one is not violating the law negates willfulness, whether or not the claimed belief or misunderstanding is objectively reasonable. Statutory willfulness, which protects the average citizen from prosecution for innocent mistakes made due to the complexity of the tax laws, is the voluntary, intentional violation of a known legal duty.”</p><p>Farnsworth’s repeated public declarations about his beliefs that the law does not say he, nor most Americans, owes the tax would seem to fit the Supreme Court’s qualification, negating the second element of the alleged crime, willfulness.   The government argues that even though Farnsworth has repeatedly made these statements, in reality, he does not believe them and it is he, instead of the government, who has been lying to the American people.<br/></p></blockquote><p>Those pesky Libertarians!  Don’t they know that you’re supposed to believe whatever the government tells you?  It will be interesting to see what sort of shenanigans the federal judge will engage in, as the judge will almost surely do his damndest to keep the tax code and the IRS regulations out of the court.  Notice how these charges amount to the Orwellian thought-crime of proving what Mr. Farnsworth does or does not believe, his actions notwithstanding.</p><p>One hopes he’ll be smart enough to avoid allowing an officer of the court to “defend” him.<br/></p></div>",
  "content_text": "Just days after losing his run for Congress, Arthur Farnsworth, Treasurer for the Pennsylvania Libertarian Party, was arrested and charged with “willfully attempting to evade federal income\ntaxes.”   The government has asked that bail be denied, claiming that Mr. Farnsworth is a “flight risk” even though Mr. Farnsworth has no criminal record, has never failed to show up for any required appearance and has made his beliefs about the IRS public for years.  A preliminary hearing is set for Monday, November 8th.\nFor years Mr. Farnsworth has publicly expressed that the federal government has been deliberately misapplying the income tax laws and has been lying to the American people about the true nature of the tax.  On\nhis web site\n, Farnsworth equates the perception that everyone owes income taxes with the one-time widely held, but now defunct belief that the world is flat.  Farnsworth correctly points out that federal courts have trouble agreeing on a specific legal definition for the word ‘income,’ and that there are dozens of references made by government officials, as well as within the law itself to the ‘voluntary\nnature’ of the tax code.\nThe crime Mr. Farnsworth has been charged with, “willful evasion of taxes,” is based on two elements.  First, that the Internal Revenue Code makes the individual liable for the income tax and second; that the individual actually believes the tax code makes them liable.  Both elements are necessary to achieve a conviction according to the U.S. Supreme Court, which stated in Cheek vs. U.S., 498 U.S. 192, “A good-faith misunderstanding of the law or a good-faith belief that one is not violating the law negates willfulness, whether or not the claimed belief or misunderstanding is objectively reasonable. Statutory willfulness, which protects the average citizen from prosecution for innocent mistakes made due to the complexity of the tax laws, is the voluntary, intentional violation of a known legal duty.”\nFarnsworth’s repeated public declarations about his beliefs that the law does not say he, nor most Americans, owes the tax would seem to fit the Supreme Court’s qualification, negating the second element of the alleged crime, willfulness.   The government argues that even though Farnsworth has repeatedly made these statements, in reality, he does not believe them and it is he, instead of the government, who has been lying to the American people.\nThose pesky Libertarians!  Don’t they know that you’re supposed to believe whatever the government tells you?  It will be interesting to see what sort of shenanigans the federal judge will engage in, as the judge will almost surely do his damndest to keep the tax code and the IRS regulations out of the court.  Notice how these charges amount to the Orwellian thought-crime of proving what Mr. Farnsworth does or does not believe, his actions notwithstanding.\nOne hopes he’ll be smart enough to avoid allowing an officer of the court to “defend” him.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-07T05:43:00+00:00"
}