{
  "url": "https://voxday.net/2004/11/29/you-vill-vatch-zee-propaganda/",
  "scraped_at": "2026-01-08T19:46:01.745937",
  "title": "You vill vatch zee propaganda",
  "date_display": "November 29, 2004",
  "date_iso": "2004-11-29T09:12:00+00:00",
  "date_from_url": "2004-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Since the advent of the VCR, and with the arrival of DVD players, those who want to get to the movie have been free to skip past the coming attractions.  The entertainment industry, however, <a href=\"http://www.nhregister.com/site/news.cfm?newsid=13446112&amp;BRD=1281&amp;PAG=461&amp;dept_id=517515&amp;rfi=6\">is exerting pressure in Congress</a> with the hope of making it impossible to skip past previews and advertisements at the opening of DVDs.  Legislative language that would have done just that — make it illegal for DVDs to allow fast-forwarding — was struck at the last minute from a copyright bill that passed the Senate late Nov. 20.<br/></br></p></blockquote><p>Abandon all hope, Republicans, if your Republican House, Senate and President go for this one.  You cannot possibly claim that the Republican Party supports constitutional or small government if its politicians are willing to exert legal force to make people watch what they don’t want to watch in the privacy of their own homes.</p><p>What’s next, video game makers forcing people to play their games?  Keen observers will note that this fascist action by the MPAA explodes the notion of the inherently “conservative” corporation.<br/></p></div>",
  "content_text": "Since the advent of the VCR, and with the arrival of DVD players, those who want to get to the movie have been free to skip past the coming attractions.  The entertainment industry, however,\nis exerting pressure in Congress\nwith the hope of making it impossible to skip past previews and advertisements at the opening of DVDs.  Legislative language that would have done just that — make it illegal for DVDs to allow fast-forwarding — was struck at the last minute from a copyright bill that passed the Senate late Nov. 20.\nAbandon all hope, Republicans, if your Republican House, Senate and President go for this one.  You cannot possibly claim that the Republican Party supports constitutional or small government if its politicians are willing to exert legal force to make people watch what they don’t want to watch in the privacy of their own homes.\nWhat’s next, video game makers forcing people to play their games?  Keen observers will note that this fascist action by the MPAA explodes the notion of the inherently “conservative” corporation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-11-29T09:12:00+00:00"
}