{
  "url": "https://voxday.net/2015/10/06/30000-infiltrators/",
  "scraped_at": "2025-12-17T17:29:09.181335",
  "title": "30,000 infiltrators",
  "date_display": "October 6, 2015",
  "date_iso": "2015-10-06T16:23:00+00:00",
  "date_from_url": "2015-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Both the math and the social mood <a href=\"http://www.latimes.com/opinion/op-ed/la-oe-1005-harow-refugee-crisis-terrorism-20151001-story.html\">is less than promising</a>:</p><blockquote class=\"tr_bq\"><p> Hungary and Slovakia have been vilified by many for rebelling against<br> taking in thousands of refugees. Not only have they rejected European<br> Union-imposed quotas, but both countries have made it clear that a mass<br> Muslim migration would pose unacceptable demographic and cultural<br> challenges. Their concerns are well founded, not only over integration<br> but especially from a security perspective.</br></br></br></br></br></p><p>Lebanon’s education<br> minister, Elias Bousaab, warned recently that two in every 100 Syrian<br> migrants arriving in Europe are Islamic State fighters, sent to<br> infiltrate a continent distracted by sympathy. If Bousaab’s conservative<br> calculation proves accurate, it would mean that among the 10,000 Syrian<br> refugees that Secretary of State John F. Kerry has pledged to allow<br> into the United States in 2016, there could be 200 committed terrorists.</br></br></br></br></br></br></p></blockquote><p>Germany is now expecting 1.5 million migrants. If the Lebanese estimate holds, that means there will be 30,000 Islamic State fighters resident in Germany by the end of the year. Now, granted, most of the “Syrian refugees” are not even Syrian, but then, we have no assurance that the Pakistani, Afghani, and Yemeni migrants are any less likely to sympathize with ISIS than their Syrian cohorts.</p><p>There is nothing any of us can do about any of this except watch, wait, and understand that when the native populations begin taking measures that go well beyond the infiltrators, they are not the parties responsible for the inevitable tragedies. The responsible parties are those who made the invasions possible in the first place.</p><p>I can’t possibly do justice to how angry people are here. I mean, I quite literally can’t post what I am hearing people of all ages, of all political identities, saying about the invaders and their own politicians, or as doing so would be in violation of numerous speech laws, including those of the USA.</p></div>",
  "content_text": "Both the math and the social mood\nis less than promising\n:\nHungary and Slovakia have been vilified by many for rebelling against\ntaking in thousands of refugees. Not only have they rejected European\nUnion-imposed quotas, but both countries have made it clear that a mass\nMuslim migration would pose unacceptable demographic and cultural\nchallenges. Their concerns are well founded, not only over integration\nbut especially from a security perspective.\nLebanon’s education\nminister, Elias Bousaab, warned recently that two in every 100 Syrian\nmigrants arriving in Europe are Islamic State fighters, sent to\ninfiltrate a continent distracted by sympathy. If Bousaab’s conservative\ncalculation proves accurate, it would mean that among the 10,000 Syrian\nrefugees that Secretary of State John F. Kerry has pledged to allow\ninto the United States in 2016, there could be 200 committed terrorists.\nGermany is now expecting 1.5 million migrants. If the Lebanese estimate holds, that means there will be 30,000 Islamic State fighters resident in Germany by the end of the year. Now, granted, most of the “Syrian refugees” are not even Syrian, but then, we have no assurance that the Pakistani, Afghani, and Yemeni migrants are any less likely to sympathize with ISIS than their Syrian cohorts.\nThere is nothing any of us can do about any of this except watch, wait, and understand that when the native populations begin taking measures that go well beyond the infiltrators, they are not the parties responsible for the inevitable tragedies. The responsible parties are those who made the invasions possible in the first place.\nI can’t possibly do justice to how angry people are here. I mean, I quite literally can’t post what I am hearing people of all ages, of all political identities, saying about the invaders and their own politicians, or as doing so would be in violation of numerous speech laws, including those of the USA.",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-06T15:23:00+00:00"
}