{
  "url": "https://voxday.net/2015/10/16/a-development-failure/",
  "scraped_at": "2025-12-17T17:30:18.139346",
  "title": "A development failure",
  "date_display": "October 16, 2015",
  "date_iso": "2015-10-16T21:06:00+00:00",
  "date_from_url": "2015-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is an interesting look at an AAA development project <a href=\"http://www.polygon.com/2012/11/1/3560318/homefront-kaos-studios-thq\">that hit a single</a> when a home run was needed:</p><blockquote class=\"tr_bq\"><p> To understand why <i>Homefront</i> had such a troubled development,<br> it’s important to look at how THQ was trying to change the way it<br> greenlit games, and the context in which it did so. Its new procedure,<br> which is fairly common in the game industry, was a multi-stage process<br> designed to keep studios at work on new games without committing THQ to<br> seeing them through to publication. THQ would take pitches from all its<br> studios, give feedback, see prototypes and then authorize continued<br> development. After going through this a few times, THQ would make a<br> final decision about moving forward on full development, or pulling the<br> plug on the project.</br></br></br></br></br></br></br></br></br></p><p>What was unusual about THQ’s greenlight process is that it occurred<br> at a time when every THQ studio executive knew that closures were<br> imminent. With the stakes so high, THQ’s new pitch process turned into a<br> never-ending up-sell.</br></br></br></p><p>“We [Kaos] were in jeopardy of dying right after <i>Frontlines</i>,<br> and [Schulman] felt that we really needed to sell to THQ,” says one<br> producer. “So we put forth just about every bit of effort we had into<br> creating one hell of a package to sell to THQ. So much so that I believe<br> our package was held as a metric for what other studios should do to<br> sell their packages. And Dave Schulman was a really good salesman at<br> telling THQ what we could deliver, and turning back to us to say, ‘Hey,<br> sky’s the limit. Just pack more features in. Make it great. Put as many<br> bullet points as you can on the back of the box.'”</br></br></br></br></br></br></br></br></p></blockquote><p>I was meeting with some THQ executives about funding one of Chris Taylor’s projects at this time and they had sky-high expectations of <i>Homefront</i>. I mean, the words “CoD-killer” were bandied about; they really believed it was going to be a <i>Battlefield</i>-level event. I remember being dubious at the time, and later, when it was released, barely even noticing that it was out. No one I knew ever played it.</p></div>",
  "content_text": "This is an interesting look at an AAA development project\nthat hit a single\nwhen a home run was needed:\nTo understand why\nHomefront\nhad such a troubled development,\nit’s important to look at how THQ was trying to change the way it\ngreenlit games, and the context in which it did so. Its new procedure,\nwhich is fairly common in the game industry, was a multi-stage process\ndesigned to keep studios at work on new games without committing THQ to\nseeing them through to publication. THQ would take pitches from all its\nstudios, give feedback, see prototypes and then authorize continued\ndevelopment. After going through this a few times, THQ would make a\nfinal decision about moving forward on full development, or pulling the\nplug on the project.\nWhat was unusual about THQ’s greenlight process is that it occurred\nat a time when every THQ studio executive knew that closures were\nimminent. With the stakes so high, THQ’s new pitch process turned into a\nnever-ending up-sell.\n“We [Kaos] were in jeopardy of dying right after\nFrontlines\n,\nand [Schulman] felt that we really needed to sell to THQ,” says one\nproducer. “So we put forth just about every bit of effort we had into\ncreating one hell of a package to sell to THQ. So much so that I believe\nour package was held as a metric for what other studios should do to\nsell their packages. And Dave Schulman was a really good salesman at\ntelling THQ what we could deliver, and turning back to us to say, ‘Hey,\nsky’s the limit. Just pack more features in. Make it great. Put as many\nbullet points as you can on the back of the box.'”\nI was meeting with some THQ executives about funding one of Chris Taylor’s projects at this time and they had sky-high expectations of\nHomefront\n. I mean, the words “CoD-killer” were bandied about; they really believed it was going to be a\nBattlefield\n-level event. I remember being dubious at the time, and later, when it was released, barely even noticing that it was out. No one I knew ever played it.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-16T20:06:00+00:00"
}