{
  "url": "https://voxday.net/2015/10/13/appendix-n-conclusions/",
  "scraped_at": "2025-12-17T17:29:52.370468",
  "title": "Appendix N: conclusions",
  "date_display": "October 13, 2015",
  "date_iso": "2015-10-13T16:00:00+00:00",
  "date_from_url": "2015-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jeffro <a href=\"https://jeffro.wordpress.com/2015/10/12/appendix-n-survey-complete/\">has completed the initial pass</a> of his quixotic masterpiece. Some of his conclusions:</p><ul><li>Tolkien’s ascendancy was not inevitable. It’s really a fluke that he even became the template for the modern fantasy epic.</li><li>A half dozen authors would have easily been considered on par with Tolkien in the seventies.</li><li>Our concept of “Tolkienesque” fantasy has little to do with Tolkien’s actual work. Likewise, the “Lovecraftian” stories and games of today have little to do with what Lovecraft actually wrote. Our concepts of swords and sorcery have had the “weird” elements removed from them for the most part. Next to the giants of the thirties, just about everything looks tamed and watered down.</li><li>Entire genres have been all but eliminated. The majority of the Appendix N list falls under either planetary romance, science fantasy, or weird fiction. Most people’s readings of AD&amp;D and OD&amp;D are done without a familiarity of these genres.</li><li>Science fiction and fantasy were much more related up through the seventies. Several Appendix N authors did top notch work in both genres. Some did work that could be classified as neither.</li><li>It used to be normal for science fiction and fantasy fans to read books that were published between 1910 and 1977. There was a sense of canon in the seventies that has since been obliterated.</li><li>Modern fandom is now divorced from its past in a way that would be completely alien to game designers in the seventies. They had no problem synthesizing elements from classics, grandmasters of the thirties, and new wave authors.</li><li>Ideological diversity in science fiction and fantasy was a given in the seventies. We are hopelessly homogenistic in comparison to them.</li><li>The program of political correctness of the past several decades has made even writers like Ray Bradbury and C. L. Moore all but unreadable to an entire generation. The conditioning is so strong, some people have almost physical reactions to the older stories now.</li></ul><p>And at Castalia House, Jeffro has posted <a href=\"http://www.castaliahouse.com/retrospective-the-hobbit-and-the-lord-of-the-rings-by-j-r-r-tolkien/#wysija\">a not-unrelated retrospective</a> on the topic of Tolkien’s influence on Dungeons &amp; Dragons:</p><blockquote class=\"tr_bq\"><p> This list has been held up as conclusive evidence of Tolkien’s<br> influence on the formation of original D&amp;D.² Taking all of the<br> game’s influences into account it’s just not that convincing, however.<br> Certainly, players of this rule set would have been able to recreate The<br> Battle of Five Armies and The Battle of the Morannon. And unlike<br> anything you’d see in the coming D&amp;D rule sets, Bard the Hunter’s<br> ability to take out a flying dragon with a single shot is accounted for<br> here. But while wraiths here are clearly inspired by the Nazgul, raising<br> the morale of their allies, causing their foes to make morale checks,<br> and paralyzing men with fear, these special abilities also failed<br> to survive the transition from miniatures supplement to role-playing<br> game.</br></br></br></br></br></br></br></br></br></br></br></p><p> Other staples of the D&amp;D zeitgeist are in evidence even at this<br> early juncture: the chromatic dragons are out in force, along with the<br> chlorine gas breathing variety from the de Camp and Pratt’s <em>The Roaring Trumpet</em>.<br> The clearest example of Tolkien’s diluted authority in Gygax’s views<br> would be in the matter of Trolls. “What are generally referred to as<br> Trolls are more properly Ogres,” he explains. To Gygax, “true Trolls”<br> are more in line with the one in Poul Anderson’s <em>Three Hearts and Three Lions</em>.<br>   <br> Similarly, the wizards of the Chainmail Fantasy Supplement are unlike<br> anything from Tolkien’s corpus; they unleash “Cloudkill” on enemy<br> armies, create hallucinatory terrain, “haste” friendly units while<br> “slowing” enemies, and disrupt the opposing force’s command and control<br> with “confuse”. Tolkien’s stark contrasts between good and evil are<br> replaced with Poul Anderson’s and Michael Moorcock’s Law to Chaos<br> alignment spectrum, with the most surprising implication of this<br> system being that the question of whether Elves will come in on the side<br> of Halflings or Wraiths is determined entirely by the roll of the dice!</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>It’s very easy for wargamers to see the wargaming roots that underlie all role-playing games, but rather less easy for non-wargamers to recognize them. This is actually something I cover in my game development course; the students tend to be very fascinated to see how one can trace the developmental lineage of some of today’s biggest games all the way back to the arcade games of the 1980s. As for literature, I always find it amusing when people assert that Warhammer was an influence on Selenoth because I don’t play Warhammer or any miniatures games nor have I ever read even a single book from the Black Library. The influences they think they are seeing actually stem from board-and-counter games that influenced both Games Workshop and me.</p><p>Selenoth began life as a wargame called “Warleader” which was my attempt to write rules for Fantasy Advanced Squad Leader. Perhaps one day I’ll return to it.</p><p>Speaking of Castalia House, we are looking for some more high-quality writers to join Jeffro, Morgan, and Daniel there, but we are only interested in potential contributors who already have a blog and a track record. If you’re a book reviewer or a game writer interested in expanding your audience, touch base.</p><ul></ul></div>",
  "content_text": "Jeffro\nhas completed the initial pass\nof his quixotic masterpiece. Some of his conclusions:\nTolkien’s ascendancy was not inevitable. It’s really a fluke that he even became the template for the modern fantasy epic.\nA half dozen authors would have easily been considered on par with Tolkien in the seventies.\nOur concept of “Tolkienesque” fantasy has little to do with Tolkien’s actual work. Likewise, the “Lovecraftian” stories and games of today have little to do with what Lovecraft actually wrote. Our concepts of swords and sorcery have had the “weird” elements removed from them for the most part. Next to the giants of the thirties, just about everything looks tamed and watered down.\nEntire genres have been all but eliminated. The majority of the Appendix N list falls under either planetary romance, science fantasy, or weird fiction. Most people’s readings of AD&D and OD&D are done without a familiarity of these genres.\nScience fiction and fantasy were much more related up through the seventies. Several Appendix N authors did top notch work in both genres. Some did work that could be classified as neither.\nIt used to be normal for science fiction and fantasy fans to read books that were published between 1910 and 1977. There was a sense of canon in the seventies that has since been obliterated.\nModern fandom is now divorced from its past in a way that would be completely alien to game designers in the seventies. They had no problem synthesizing elements from classics, grandmasters of the thirties, and new wave authors.\nIdeological diversity in science fiction and fantasy was a given in the seventies. We are hopelessly homogenistic in comparison to them.\nThe program of political correctness of the past several decades has made even writers like Ray Bradbury and C. L. Moore all but unreadable to an entire generation. The conditioning is so strong, some people have almost physical reactions to the older stories now.\nAnd at Castalia House, Jeffro has posted\na not-unrelated retrospective\non the topic of Tolkien’s influence on Dungeons & Dragons:\nThis list has been held up as conclusive evidence of Tolkien’s\ninfluence on the formation of original D&D.² Taking all of the\ngame’s influences into account it’s just not that convincing, however.\nCertainly, players of this rule set would have been able to recreate The\nBattle of Five Armies and The Battle of the Morannon. And unlike\nanything you’d see in the coming D&D rule sets, Bard the Hunter’s\nability to take out a flying dragon with a single shot is accounted for\nhere. But while wraiths here are clearly inspired by the Nazgul, raising\nthe morale of their allies, causing their foes to make morale checks,\nand paralyzing men with fear, these special abilities also failed\nto survive the transition from miniatures supplement to role-playing\ngame.\nOther staples of the D&D zeitgeist are in evidence even at this\nearly juncture: the chromatic dragons are out in force, along with the\nchlorine gas breathing variety from the de Camp and Pratt’s\nThe Roaring Trumpet\n.\nThe clearest example of Tolkien’s diluted authority in Gygax’s views\nwould be in the matter of Trolls. “What are generally referred to as\nTrolls are more properly Ogres,” he explains. To Gygax, “true Trolls”\nare more in line with the one in Poul Anderson’s\nThree Hearts and Three Lions\n.\nSimilarly, the wizards of the Chainmail Fantasy Supplement are unlike\nanything from Tolkien’s corpus; they unleash “Cloudkill” on enemy\narmies, create hallucinatory terrain, “haste” friendly units while\n“slowing” enemies, and disrupt the opposing force’s command and control\nwith “confuse”. Tolkien’s stark contrasts between good and evil are\nreplaced with Poul Anderson’s and Michael Moorcock’s Law to Chaos\nalignment spectrum, with the most surprising implication of this\nsystem being that the question of whether Elves will come in on the side\nof Halflings or Wraiths is determined entirely by the roll of the dice!\nIt’s very easy for wargamers to see the wargaming roots that underlie all role-playing games, but rather less easy for non-wargamers to recognize them. This is actually something I cover in my game development course; the students tend to be very fascinated to see how one can trace the developmental lineage of some of today’s biggest games all the way back to the arcade games of the 1980s. As for literature, I always find it amusing when people assert that Warhammer was an influence on Selenoth because I don’t play Warhammer or any miniatures games nor have I ever read even a single book from the Black Library. The influences they think they are seeing actually stem from board-and-counter games that influenced both Games Workshop and me.\nSelenoth began life as a wargame called “Warleader” which was my attempt to write rules for Fantasy Advanced Squad Leader. Perhaps one day I’ll return to it.\nSpeaking of Castalia House, we are looking for some more high-quality writers to join Jeffro, Morgan, and Daniel there, but we are only interested in potential contributors who already have a blog and a track record. If you’re a book reviewer or a game writer interested in expanding your audience, touch base.",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-13T15:00:00+00:00"
}