{
  "url": "https://voxday.net/2015/10/26/attack-on-marine-recruiting-center/",
  "scraped_at": "2025-12-17T17:31:21.954618",
  "title": "Mailvox: Attack near Marine recruiting center",
  "date_display": "October 26, 2015",
  "date_iso": "2015-10-26T20:14:00+00:00",
  "date_from_url": "2015-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RJ emails: <i>“<a href=\"http://kwqc.com/2015/10/26/police-responding-to-gunman-calls-in-davenport-bettendorf/\">Attack at a Marine recruiting station</a>. Near me. Still ongoing. Knew this was coming. Didn’t think it would be here.”</i></p><blockquote class=\"tr_bq\"><p> BETTENDORF, Iowa (KWQC) – Police are responding to calls of a<br> possible shooter in the 4500 block of Utica Ridge in Bettendorf. It<br> appears to have started near the Marine recruiting office located at 710<br> E. Kimberly Rd. in Davenport around 2 p.m. Monday, Oct. 26, 2015.</br></br></br></p><p>A witness tells TV-6 that he was in the Marine recruiting center when<br> he heard shots fired at a nearby law office. He says he heard screaming<br> and then heard the gunman try to reload his gun. A Marine recruiter<br> told everyone to run. As the witness was running, he said he heard more<br> gunfire. Kimberly Rd. was closed, but has since reopened to traffic.</br></br></br></br></p></blockquote><p>It’s going to be everywhere because the invaders are everywhere. Gun up. Carry. Be prepared.</p><p>UPDATE: False alarm, looks domestic in nature.</p><p><i>“Davenport police told local reporters there were no injuries from the<br> shooting, and the gunman shot himself on Utica Ridge Road, about three<br> miles away.”</br></br></i></p><div class=\"moz-text-html\" lang=\"x-unicode\"></div></div>",
  "content_text": "RJ emails:\n“\nAttack at a Marine recruiting station\n. Near me. Still ongoing. Knew this was coming. Didn’t think it would be here.”\nBETTENDORF, Iowa (KWQC) – Police are responding to calls of a\npossible shooter in the 4500 block of Utica Ridge in Bettendorf. It\nappears to have started near the Marine recruiting office located at 710\nE. Kimberly Rd. in Davenport around 2 p.m. Monday, Oct. 26, 2015.\nA witness tells TV-6 that he was in the Marine recruiting center when\nhe heard shots fired at a nearby law office. He says he heard screaming\nand then heard the gunman try to reload his gun. A Marine recruiter\ntold everyone to run. As the witness was running, he said he heard more\ngunfire. Kimberly Rd. was closed, but has since reopened to traffic.\nIt’s going to be everywhere because the invaders are everywhere. Gun up. Carry. Be prepared.\nUPDATE: False alarm, looks domestic in nature.\n“Davenport police told local reporters there were no injuries from the\nshooting, and the gunman shot himself on Utica Ridge Road, about three\nmiles away.”",
  "tags": [
    "gun control",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-26T20:14:00+00:00"
}