{
  "url": "https://voxday.net/2015/10/14/brainstorm-gorilla-mindse/",
  "scraped_at": "2025-12-17T17:29:57.205327",
  "title": "Brainstorm: Gorilla Mindset",
  "date_display": "October 14, 2015",
  "date_iso": "2015-10-14T10:32:00+00:00",
  "date_from_url": "2015-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://30daystox.com/wp-content/uploads/2015/06/Gorilla-Mindset-by-Mike-Cernovich.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://30daystox.com/wp-content/uploads/2015/06/Gorilla-Mindset-by-Mike-Cernovich.png\" width=\"212\"/></a><br> <i>Since mindset is so important, it has always baffled me that many<br> people gloss over its significance. You’ll see guys who want to be rich,<br> yet talk themselves out of ever starting a company. Or grown men want<br> to get better at dating, but spend all their time complaining that it’s<br> impossible to attract women.</br></br></br></br></i></br></p><p><i><br> </br></i><i>In reality the only thing holding these people back is themselves.<br> It’s impossible to become a winner if you constantly think like a loser.</br></i></p><p>Mike Cernovich’s book, <a href=\"http://www.amazon.com/Gorilla-Mindset-Mike-Cernovich/dp/1514672111\">Gorilla Mindset</a>, is a good “mental reset” book that is likely to be useful to any man who is struggling with negativity, laziness, or burnout. I’ve read it myself and gleaned some useful performance tricks from it, and I’ve even given it to my son to read.</p><p>On Tuesday evening at 6 PM Eastern, Mike Cernovich will be my Brainstorm guest, where we will be discussing <i>Gorilla Mindset</i> and other topics of interest for 90 minutes, including Q&amp;A. It’s a free event, so <a href=\"https://attendee.gotowebinar.com/register/4387735660931852034\">you can register here</a>. Please note that registration will NOT guarantee a seat; only 500 can be seated at a time. If you haven’t read the book yet, I’d encourage you to do so before the event. I wouldn’t call it “life-changing”, but I have no doubt at all that there are others who would. Mike’s personal story is inspirational; he is an impressive guy.</p><p>Brainstorm note: I didn’t realize it until two days ago, but 2,395 people tried to register for the Brainstorm Hugo Party. The registration limit was set to 500, of whom 395 actually attended at some point. Since a lot of people will be interested in what Mike has to say, I’m going to bump up the limit to 750, of whom 500 will be able to simultaneously attend.</p><p>When we reach 100 <a href=\"http://www.castaliahouse.com/downloads/brainstorm-annual/\">annual Brainstorm members</a>, I will bump up the maximum limit to 1,000 simultaneous attendees. For those who want to know how they can help boost the signal, that’s one way to do it.</p><p>In related news, I’ve been working with the institute and the Game Dev course is finally coming together and I anticipate it starting in January. It will be free for all annual Brainstorm members. The full price for the 10 sessions will be $199, but it will be initially priced at $150 for VP readers, #GamerGate members, and subscribers to the two Castalia House mailing lists.</p><p>UPDATE: Mike contacted me to let me know that he will be providing PDF versions of <i>Gorilla Mindset</i> and <i>Juicing for Men</i> to all Brainstorm Annual members on Monday.</p></div>",
  "content_text": "Since mindset is so important, it has always baffled me that many\npeople gloss over its significance. You’ll see guys who want to be rich,\nyet talk themselves out of ever starting a company. Or grown men want\nto get better at dating, but spend all their time complaining that it’s\nimpossible to attract women.\nIn reality the only thing holding these people back is themselves.\nIt’s impossible to become a winner if you constantly think like a loser.\nMike Cernovich’s book,\nGorilla Mindset\n, is a good “mental reset” book that is likely to be useful to any man who is struggling with negativity, laziness, or burnout. I’ve read it myself and gleaned some useful performance tricks from it, and I’ve even given it to my son to read.\nOn Tuesday evening at 6 PM Eastern, Mike Cernovich will be my Brainstorm guest, where we will be discussing\nGorilla Mindset\nand other topics of interest for 90 minutes, including Q&A. It’s a free event, so\nyou can register here\n. Please note that registration will NOT guarantee a seat; only 500 can be seated at a time. If you haven’t read the book yet, I’d encourage you to do so before the event. I wouldn’t call it “life-changing”, but I have no doubt at all that there are others who would. Mike’s personal story is inspirational; he is an impressive guy.\nBrainstorm note: I didn’t realize it until two days ago, but 2,395 people tried to register for the Brainstorm Hugo Party. The registration limit was set to 500, of whom 395 actually attended at some point. Since a lot of people will be interested in what Mike has to say, I’m going to bump up the limit to 750, of whom 500 will be able to simultaneously attend.\nWhen we reach 100\nannual Brainstorm members\n, I will bump up the maximum limit to 1,000 simultaneous attendees. For those who want to know how they can help boost the signal, that’s one way to do it.\nIn related news, I’ve been working with the institute and the Game Dev course is finally coming together and I anticipate it starting in January. It will be free for all annual Brainstorm members. The full price for the 10 sessions will be $199, but it will be initially priced at $150 for VP readers, #GamerGate members, and subscribers to the two Castalia House mailing lists.\nUPDATE: Mike contacted me to let me know that he will be providing PDF versions of\nGorilla Mindset\nand\nJuicing for Men\nto all Brainstorm Annual members on Monday.",
  "tags": [
    "Brainstorm"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-14T09:32:00+00:00"
}