{
  "url": "https://voxday.net/2015/10/01/case-in-poin/",
  "scraped_at": "2025-12-17T17:28:37.726734",
  "title": "Case in point",
  "date_display": "October 1, 2015",
  "date_iso": "2015-10-01T19:00:00+00:00",
  "date_from_url": "2015-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think it’s rather cute that SJWs still think that any shaming technique has even a ghost of a chance of influencing my behavior in the slightest. See, that’s the problem with their approach. Once you throw everything and the kitchen sink at someone and they’re still standing, absolutely nothing you do has any impact whatsoever.</p><blockquote class=\"tr_bq\"><p> <a href=\"https://twitter.com/InnerPartisan/status/649590425989304320\">The Notorious S.J.W. @InnerPartisan</a><br> Oh hey, on his blog, failed author Vox Day is now publishing personal information of people who wrote negative reviews of his latest “book”.</br></p></blockquote><p>This is a beautiful example of SJW behavior at its most blatant.</p><p><i>“failed author”</i>: has published more than a dozen books, has been nominated for multiple awards in more than one genre, currently has had the #1 bestselling book in its category for more than a month. This is not only not failure, it is considerably better than the average author manages.</p><p><a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><b><i>SJWs always lie!</i></b></a></p><p><i>“is now publishing”</i>: Classic point-and-shriek. Of course, everyone knows I do this, I’ve been doing it <a href=\"http://www.milobookclub.com/2013/01/23/a-rabbit-bites-back/\">for more than two years now</a>. Not only will I continue to do it, but I will use my contacts at Amazon to ferret out anyone I can’t readily identify on my own in order to expose them. I’ll even make sure the SJW’s employer learns what they’ve been doing and learns about all your questionable online habits.</p><p><i>“negative reviews”</i>: Obviously false. I don’t object to negative reviews. I object to negative non-reviews.</p><p><a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><b><i>SJWs always lie!</i></b></a><br> <i><br/></i><br> <i>“his latest ‘book'”</i>: It’s not merely a book, it’s a bestselling and very highly-rated book. What is the point of claiming a book is not book? Not only does The Notorious S.J.W. contradict himself – how can I be a “failed author” and still publish a “latest” book – but he’s willing to deny objective reality in order to attempt to minimize and marginalize.</br></br></p><p><a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><b><i>SJWs always lie!</i></b></a></p><p>I appreciate The Notorious S.J.W. for being willing to advertise my latest book by demonstrating, in real life, the very concepts I am attempting to elucidate and explain in <a href=\"http://www.amazon.com/SJWs-Always-Lie-Taking-Thought-ebook/dp/B014GMBUR4\"><b><i>SJWs ALWAYS LIE: Taking Down the Thought Police</i></b></a>.</p><p>We also learned that <a href=\"https://mikebrendan.wordpress.com/\">Mike Brendan is a racist</a> who hates Native Americans and Mexicans. He gives them “a two middle fingers down.” Mike Brendan is a racist who race polices minorities on Twitter and unminorities them.</p></div>",
  "content_text": "I think it’s rather cute that SJWs still think that any shaming technique has even a ghost of a chance of influencing my behavior in the slightest. See, that’s the problem with their approach. Once you throw everything and the kitchen sink at someone and they’re still standing, absolutely nothing you do has any impact whatsoever.\nThe Notorious S.J.W. @InnerPartisan\nOh hey, on his blog, failed author Vox Day is now publishing personal information of people who wrote negative reviews of his latest “book”.\nThis is a beautiful example of SJW behavior at its most blatant.\n“failed author”\n: has published more than a dozen books, has been nominated for multiple awards in more than one genre, currently has had the #1 bestselling book in its category for more than a month. This is not only not failure, it is considerably better than the average author manages.\nSJWs always lie!\n“is now publishing”\n: Classic point-and-shriek. Of course, everyone knows I do this, I’ve been doing it\nfor more than two years now\n. Not only will I continue to do it, but I will use my contacts at Amazon to ferret out anyone I can’t readily identify on my own in order to expose them. I’ll even make sure the SJW’s employer learns what they’ve been doing and learns about all your questionable online habits.\n“negative reviews”\n: Obviously false. I don’t object to negative reviews. I object to negative non-reviews.\nSJWs always lie!\n“his latest ‘book'”\n: It’s not merely a book, it’s a bestselling and very highly-rated book. What is the point of claiming a book is not book? Not only does The Notorious S.J.W. contradict himself – how can I be a “failed author” and still publish a “latest” book – but he’s willing to deny objective reality in order to attempt to minimize and marginalize.\nSJWs always lie!\nI appreciate The Notorious S.J.W. for being willing to advertise my latest book by demonstrating, in real life, the very concepts I am attempting to elucidate and explain in\nSJWs ALWAYS LIE: Taking Down the Thought Police\n.\nWe also learned that\nMike Brendan is a racist\nwho hates Native Americans and Mexicans. He gives them “a two middle fingers down.” Mike Brendan is a racist who race polices minorities on Twitter and unminorities them.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-01T18:00:00+00:00"
}