{
  "url": "https://voxday.net/2015/10/27/dialogue-with-moderate/",
  "scraped_at": "2025-12-17T17:31:28.861233",
  "title": "Dialogue with a moderate",
  "date_display": "October 27, 2015",
  "date_iso": "2015-10-27T16:00:00+00:00",
  "date_from_url": "2015-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This discussion between Nate and a #GamerGate moderate should help illustrate the essential problem with the moderate perspective and demonstrate how they are never truly on the side they nominally claim to be supporting. It should also make it clear that for all his posturing and preening, the moderate is guaranteed, on the basis of his own unprincipled philosophy, to be a loser. </i></p><p>Mr. Scary Cell @gameragodzilla<br> If you respond to disagreement with any of these: Shill, Concern Troll, Divide and Conquer, you want a hugbox just like SJWs do.</br></p><p>Nate @bloggerblaster<br> horse shit. moderates shooting at their own side because they are scared to shoot at the actual enemy. Concern Trolls suck</br></p><p>Mr. Scary Cell @gameragodzilla<br> Fuck this tribalistic “us vs. them” crap. If you can’t handle dissent, you’re no better than “the enemy”.</br></p><p>Nate @bloggerblaster<br> We didn’t make them the enemy. They made us the enemy. Talk to them.</br></p><p>Mr. Scary Cell @gameragodzilla<br> So? If you refuse to allow dissent and dismiss criticism with labels, you’re no better than “the enemy”.</br></p><p>Mr. Scary Cell @gameragodzilla<br> I’m not dismissing your criticism of me. I’m still talking to you, aren’t I? Meanwhile, you dismiss all criticism from me.</br></p><p>Nate @bloggerblaster<br> more poser bullshit. Look son…we’re being punched. and now you’re bitching at us because we’re punching back.</br></p><p>Mr. Scary Cell @gameragodzilla<br> I’m not gonna engage in the same tactics SJWs do when it’s their tactics that make me dislike them in the first place.</br></p><p><i>NOTE:  The tactics are what make him dislike SJWs. He apparently has no problem with their ideals or objectives.</i><br> <a name=\"more\"></a><br> Mr. Scary Cell @gameragodzilla<br> If I “punch back” in the exact same manner, then there is no functional difference between me and “the enemy”.</br></br></br></p><p>Mr. Scary Cell @gameragodzilla <br> If you handle dissent this way, then I have no desire to help you “punch back”. And nor will the vast majority of people.</br></p><p>Nate @bloggerblaster<br> But using dialect to people who only respond to rhetoric is not only ineffective its actually counter productive.</br></p><p>Mr. Scary Cell @gameragodzilla<br> I don’t compromise my principles for what is supposedly “effective”, especially when I remain unconvinced that your rhetoric will do anything other than alienate those who might be sympathetic but aren’t as extreme.</br></p><p>Vox Day ‏@voxday<br> That’s because you’re ignorant. Aristotle explained your position was hopelessly wrong 2,400 years ago.</br></p><p>Mr. Scary Cell @gameragodzilla<br> I’m criticizing the idea of using the exact same tactics SJWs do when SJW tactics are what make me dislike them.</br></p><p>Vox Day @voxday<br> Then you have no principles. It is the objectives that are relevant, not the tactics.</br></p><p>Mr. Scary Cell @gameragodzilla<br> It’s the tactics that I find distasteful about SJWs in the first place. If I use those tactics, I’m’ no different.</br></p><p>Nate @bloggerblaster<br> You’d rather lose than win wrong. Then go away loser. We want to win.</br></p><p>Mr. Scary Cell @gameragodzilla<br> Never compromise. Not even in the face of Armageddon.</br></p><p>Vox Day @voxday<br> Compromise what? You have no principles. You dislike certain TACTICS. That’s just style over substance. That’s etiquette!</br></p><p>Mr. Scary Cell @gameragodzilla <br> My principles forbids the use of certain tactics.</br></p><p>Nate @bloggerblaster<br> so you admit it. You’d rather lose than win wrong.</br></p><p>Mr. Scary Cell @gameragodzilla<br> Winning by becoming just like SJWs is no victory at all.</br></p><p>Vox Day @voxday<br> You’re being a complete idiot. TACTICS do not make you like the other side. They have different objectives.</br></p><p>Nate @bloggerblaster<br> I would tell you that history is full of losers with your view. but it was written by those that killed them. so no.</br></p><p>Mr. Scary Cell @gameragodzilla <br> And history is also full of people who fought against monsters and eventually became them in the end.</br></p><p><i>NOTE: I actually double face-palmed here…</i></p><p>Vox Day @voxday<br> No, it’s not. That’s a stupid aphorism that isn’t even remotely close to being true.</br></p><p>Mr. Scary Cell @gameragodzilla<br> And I’m supposed to just accept that so I can beat whichever enemy is in vogue right now? No thanks.</br></p><p>Vox Day @voxday<br> That’s fine. Then lose. That’s what moderates always do.</br></p><p>Mr. Scary Cell @gameragodzilla<br> If the extremist tactics on either side win, I lose either way</br></p><p>Nate @bloggerblaster<br> sounds like you’re used to losing already. So honorable!</br></p><p> Vox Day @voxday<br> That’s what we’ve been telling you.</br></p></div>",
  "content_text": "This discussion between Nate and a #GamerGate moderate should help illustrate the essential problem with the moderate perspective and demonstrate how they are never truly on the side they nominally claim to be supporting. It should also make it clear that for all his posturing and preening, the moderate is guaranteed, on the basis of his own unprincipled philosophy, to be a loser.\nMr. Scary Cell @gameragodzilla\nIf you respond to disagreement with any of these: Shill, Concern Troll, Divide and Conquer, you want a hugbox just like SJWs do.\nNate @bloggerblaster\nhorse shit. moderates shooting at their own side because they are scared to shoot at the actual enemy. Concern Trolls suck\nMr. Scary Cell @gameragodzilla\nFuck this tribalistic “us vs. them” crap. If you can’t handle dissent, you’re no better than “the enemy”.\nNate @bloggerblaster\nWe didn’t make them the enemy. They made us the enemy. Talk to them.\nMr. Scary Cell @gameragodzilla\nSo? If you refuse to allow dissent and dismiss criticism with labels, you’re no better than “the enemy”.\nMr. Scary Cell @gameragodzilla\nI’m not dismissing your criticism of me. I’m still talking to you, aren’t I? Meanwhile, you dismiss all criticism from me.\nNate @bloggerblaster\nmore poser bullshit. Look son…we’re being punched. and now you’re bitching at us because we’re punching back.\nMr. Scary Cell @gameragodzilla\nI’m not gonna engage in the same tactics SJWs do when it’s their tactics that make me dislike them in the first place.\nNOTE:  The tactics are what make him dislike SJWs. He apparently has no problem with their ideals or objectives.\nMr. Scary Cell @gameragodzilla\nIf I “punch back” in the exact same manner, then there is no functional difference between me and “the enemy”.\nMr. Scary Cell @gameragodzilla\nIf you handle dissent this way, then I have no desire to help you “punch back”. And nor will the vast majority of people.\nNate @bloggerblaster\nBut using dialect to people who only respond to rhetoric is not only ineffective its actually counter productive.\nMr. Scary Cell @gameragodzilla\nI don’t compromise my principles for what is supposedly “effective”, especially when I remain unconvinced that your rhetoric will do anything other than alienate those who might be sympathetic but aren’t as extreme.\nVox Day ‏@voxday\nThat’s because you’re ignorant. Aristotle explained your position was hopelessly wrong 2,400 years ago.\nMr. Scary Cell @gameragodzilla\nI’m criticizing the idea of using the exact same tactics SJWs do when SJW tactics are what make me dislike them.\nVox Day @voxday\nThen you have no principles. It is the objectives that are relevant, not the tactics.\nMr. Scary Cell @gameragodzilla\nIt’s the tactics that I find distasteful about SJWs in the first place. If I use those tactics, I’m’ no different.\nNate @bloggerblaster\nYou’d rather lose than win wrong. Then go away loser. We want to win.\nMr. Scary Cell @gameragodzilla\nNever compromise. Not even in the face of Armageddon.\nVox Day @voxday\nCompromise what? You have no principles. You dislike certain TACTICS. That’s just style over substance. That’s etiquette!\nMr. Scary Cell @gameragodzilla\nMy principles forbids the use of certain tactics.\nNate @bloggerblaster\nso you admit it. You’d rather lose than win wrong.\nMr. Scary Cell @gameragodzilla\nWinning by becoming just like SJWs is no victory at all.\nVox Day @voxday\nYou’re being a complete idiot. TACTICS do not make you like the other side. They have different objectives.\nNate @bloggerblaster\nI would tell you that history is full of losers with your view. but it was written by those that killed them. so no.\nMr. Scary Cell @gameragodzilla\nAnd history is also full of people who fought against monsters and eventually became them in the end.\nNOTE: I actually double face-palmed here…\nVox Day @voxday\nNo, it’s not. That’s a stupid aphorism that isn’t even remotely close to being true.\nMr. Scary Cell @gameragodzilla\nAnd I’m supposed to just accept that so I can beat whichever enemy is in vogue right now? No thanks.\nVox Day @voxday\nThat’s fine. Then lose. That’s what moderates always do.\nMr. Scary Cell @gameragodzilla\nIf the extremist tactics on either side win, I lose either way\nNate @bloggerblaster\nsounds like you’re used to losing already. So honorable!\nVox Day @voxday\nThat’s what we’ve been telling you.",
  "tags": [
    "#GamerGate",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-27T16:00:00+00:00"
}