{
  "url": "https://voxday.net/2015/10/30/disqualify/",
  "scraped_at": "2025-12-17T17:31:52.623145",
  "title": "Disqualify!",
  "date_display": "October 30, 2015",
  "date_iso": "2015-10-30T15:00:00+00:00",
  "date_from_url": "2015-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s funny how even though it repeatedly backfires on them, they keep trying and trying and trying, not only using the same tactic, but <a href=\"http://www.wired.com/2015/10/hugo-awards-controversy/\">relying on exactly the same quote</a>. Because, as you surely know, anyone who dares to make a factual observation is <i>raciss</i>. Ergo, disqualified!</p><blockquote class=\"tr_bq\"><p> When I point out that he was intentionally baiting a person of color with a term that has racial overtones, his answer sounds positively gleeful. “I’m calling her a half-savage because I know it’s going to offend the crap out of her,” Beale says. “She’s going to run around screaming ‘Racist! Racist!’ for the next 10 years.” A beat, and then he adds: “I don’t consider all black people to be half-savages. I mean, some people are. Here in Europe, for example, we have actual proper Africans, not African-Americans. This leads to problems, like people shitting on top of the closed toilets. They don’t know how to use indoor plumbing, OK? This is not civilized behavior.”</p></blockquote><p>She seems to seriously believe I was making that up or something. <a href=\"http://indianexpress.com/article/trending/swiss-railway-posts-how-to-toilet-signs-for-asian-tourists/\">Not so much</a>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CSk1GCvUsAAb6VT.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"247\" src=\"https://pbs.twimg.com/media/CSk1GCvUsAAb6VT.jpg\" width=\"400\"/></a></div><p> <i>Fed up with having to clean up messes in the public toilets, a Swiss railway company has come up with a series of graphic illustrations for visitors from Asia and the Middle East to instruct them how to sit on a toilet seat.</i></p><p>The pictograms, that have appeared on trains in the popular tourist destination of Mount Rigi in the Swiss Alps, instruct users to sit on toilet seats rather than to squat on them and to discard used toilet paper in the lavatory and not in the waste bin.</p><p>“It happens that guests mount the toilet seats to do their business – and sometimes they don’t know where to put the toilet paper,” said Roger Joss, director of marketing for the Mount Rigi railway at Lake Lucerne in central Switzerland.</p><p>The Swiss tourist board has also accused foreign tourists of defecating in the shower…. In March last year, Lloyds Bank’s Old Broad Street office in central<br> London also put up instructions telling foreign staff how to use the<br> loo, with details such as ‘sit on the toilet – do not stand on it’, and<br> ‘please flush it with your hand and not your foot’.</br></br></br></p><p>Those of us who aren’t parochial Americans who have apparently never traveled outside their little white enclaves know that many immigrants really don’t abide by civilized standards. I have not only seen the above signs as well as the occasional shit left on the toilet seat, I once watched a pair of Africans spend 7 minutes carefully studying a roundabout before getting back in the car and going the wrong way, very nearly causing a head-on collision as they took out the floral arrangement in the center.</p><p>This is something we are supposed to believe is a good thing? A sustainable thing? A progressive thing? A desirable thing? How is the West going to help the rest of the world in the future if it <i>becomes </i>the rest of the world? Do SJWs just really enjoy train stations and restaurants that smell like shit?</p><p>As for Jemisin, I note that she is still doing exactly what I expected her to do. It’s already been, what, two years? It’s not my fault she’s an easily predictable half-savage, any more than it is my fault that the, shall we say, <i>differently civilized</i> find it difficult to master indoor plumbing and roundabouts.</p></div>",
  "content_text": "It’s funny how even though it repeatedly backfires on them, they keep trying and trying and trying, not only using the same tactic, but\nrelying on exactly the same quote\n. Because, as you surely know, anyone who dares to make a factual observation is\nraciss\n. Ergo, disqualified!\nWhen I point out that he was intentionally baiting a person of color with a term that has racial overtones, his answer sounds positively gleeful. “I’m calling her a half-savage because I know it’s going to offend the crap out of her,” Beale says. “She’s going to run around screaming ‘Racist! Racist!’ for the next 10 years.” A beat, and then he adds: “I don’t consider all black people to be half-savages. I mean, some people are. Here in Europe, for example, we have actual proper Africans, not African-Americans. This leads to problems, like people shitting on top of the closed toilets. They don’t know how to use indoor plumbing, OK? This is not civilized behavior.”\nShe seems to seriously believe I was making that up or something.\nNot so much\n.\nFed up with having to clean up messes in the public toilets, a Swiss railway company has come up with a series of graphic illustrations for visitors from Asia and the Middle East to instruct them how to sit on a toilet seat.\nThe pictograms, that have appeared on trains in the popular tourist destination of Mount Rigi in the Swiss Alps, instruct users to sit on toilet seats rather than to squat on them and to discard used toilet paper in the lavatory and not in the waste bin.\n“It happens that guests mount the toilet seats to do their business – and sometimes they don’t know where to put the toilet paper,” said Roger Joss, director of marketing for the Mount Rigi railway at Lake Lucerne in central Switzerland.\nThe Swiss tourist board has also accused foreign tourists of defecating in the shower…. In March last year, Lloyds Bank’s Old Broad Street office in central\nLondon also put up instructions telling foreign staff how to use the\nloo, with details such as ‘sit on the toilet – do not stand on it’, and\n‘please flush it with your hand and not your foot’.\nThose of us who aren’t parochial Americans who have apparently never traveled outside their little white enclaves know that many immigrants really don’t abide by civilized standards. I have not only seen the above signs as well as the occasional shit left on the toilet seat, I once watched a pair of Africans spend 7 minutes carefully studying a roundabout before getting back in the car and going the wrong way, very nearly causing a head-on collision as they took out the floral arrangement in the center.\nThis is something we are supposed to believe is a good thing? A sustainable thing? A progressive thing? A desirable thing? How is the West going to help the rest of the world in the future if it\nbecomes\nthe rest of the world? Do SJWs just really enjoy train stations and restaurants that smell like shit?\nAs for Jemisin, I note that she is still doing exactly what I expected her to do. It’s already been, what, two years? It’s not my fault she’s an easily predictable half-savage, any more than it is my fault that the, shall we say,\ndifferently civilized\nfind it difficult to master indoor plumbing and roundabouts.",
  "tags": [
    "media",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-30T15:00:00+00:00"
}