{
  "url": "https://voxday.net/2015/10/30/exposing-true-face-of-sjw/",
  "scraped_at": "2025-12-17T17:31:48.941157",
  "title": "Exposing the true face of SJW",
  "date_display": "October 30, 2015",
  "date_iso": "2015-10-30T10:14:00+00:00",
  "date_from_url": "2015-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rosarior <a href=\"https://github.com/rosarior/awesome-django/issues/176\">beats back and exposes an SJW entryist</a> attempting to impose a Code of Conduct on the Awesome-Django project:</p><blockquote class=\"tr_bq\"><p> great project!! I have one observation and a suggestion. I noticed you have rejected some pull requests to add some good django libraries and that the people submitting those pull requests are POCs (People of Colour). As a suggestion I recommend adopting the Contributor Code of Conduct (http://contributor-covenant.org) to ensure everybody’s contributions are accepted regarless of their sex, sexual orientation, skin color, religion, height, place of origin, etc, etc, etc. As a white straight male and lead of this trending repository, your adoption of this Code of Conduct will send a loud and clear message that inclusion is a primary objective of the Django community and of the software development community in general. D.</p></blockquote><p>A few things about this. First, the name is generic. Second, this comment is literally the SJW’s first “contribution to the project. Third, while the SJW uses the correct terminology, he offers no evidence whatsoever for his claims. Fourth, his claim that the people whose pull requests were rejected are People of Colour are likely false considering that he doesn’t know that the individual he is addressing is Hispanic, not white.</p><p>Fortunately, rosarior recognizes the nature of the stealth attack. While he politely addresses the nominal suggestions, he makes it clear that this project is not a soft target and shuts down the SJW’s line of entry</p><blockquote class=\"tr_bq\"><p> The pull request was rejected not the person. Of the people who did not had their patches accepted at least one submitted another pull request and was accepted or are contributors in my other repositories, disproving your basic premise.</p><p>There is no need for a code of conduct, there hasn’t been a conduct related incident with the repository and nothing about a contributor comes into play when rejecting or accepting a patch (as proved above). An explanation is provided when a patch is rejected, and some have been left open to re-asses in a future time.</p><p>I’m not white and please don’t make any other assumptions about me, they hold no relevance to the matter at hand.</p><p>I already work on several projects that hold inclusion as one of their primary goals.</p><p>I’m closing this issue based on the explanations given.</p></blockquote><p>The wording allows just a little more wiggle room than is ideal, but it is a strong and effective response, particularly the implicit statement that “inclusion” is not a primary goal of this particular project. Perhaps due to the wiggle room, the SJW tries again.</p><blockquote class=\"tr_bq\"><p> You seem to have taken personal issue with well the issue 🙂   I opened<br> this issue not to attack you or your decisions,but to help improve a<br> part of the project in which it seemed lacking.  Most projects on Github<br> have adopted the Contributor Covenant or a variant of it.   It is a<br> very straight forward document that protects all parties,I don’t<br> understand your negative attitude towards that philosophy.   You may not<br> be “white” [ in your profile picture you sure seem white 🙂 ] but you<br> are not a woman or a trans-gendered person so you can’t possibly<br> understand what they go through  (harassment,exclusion,threats) and why a<br> code of conduct is necessary.  Even the Django Software Foundation has<br> adopted one to protect it’s future,for me it’s very obvious Django<br> related projects would naturally follow suite and adopt the same if not<br> similar Code of Conducts.   I urge you to reconsider for the good and<br> future of this project 🙂    Thank you</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Now the rhetorical gloves come off. The SJW tries to play on rosarior’s insecurities and emotions, then throws out an appeal to the herd animal instinct before issuing an implicit threat. The code of conduct is now declared “necessary” in order to protect the future of the project, which is twice mentioned in a threatening manner. Notice that the SJW doesn’t even address the fact that his original claimed concerns were addressed, thereby negating any need for the requested code, he simply moves the goalposts and moves on to more high-pressure rhetorical tactics. This is why dialectical arguments are totally useless; the SJWs simply ignore the effective ones.</p><div class=\"comment-content\"><div class=\"edit-comment-hide\"><div class=\"comment-body markdown-body markdown-format js-comment-body\"><blockquote class=\"tr_bq\"><p> 1- You opened an issue to raise concern about the relationship of a contributor’s race and the rejection of their patches.<br> 2- Only I can accept or reject patches in this repository.<br> You made it clear who this was about.<br> Apart from this issue, we’ve had no conduct problems, so no need for a code of conduct.<br> I’m very certain of my race: I’m Latino, Puertorican, a Mestizo from a<br> Castiza mother and a Mulato father. There are many more races than just<br> black and white (<a href=\"https://en.wikipedia.org/wiki/Miscegenation\">https://en.wikipedia.org/wiki/Miscegenation</a>).<br> Yes, I’m not a woman or a transgendered individual and I don’t intend<br> to even try to understand what they have to put up with, never said<br> that. But you assume women and transgendered individual are the only<br> targets of harassment, exclusion and threats.<br> <a href=\"https://twitter.com/siloraptor/status/624257540948393988\"></a><br> English is not my first language and I hope I’m mistaken but your last line “I urge you to reconsider for the good and future of this project 🙂 ” sounded like a threat, please clarify.</br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote></div></div></div><p>This response could be described as overly long and dialectical; rhetoric has ZERO informational content so responding to the feigned issues serves no purpose unless one is doing it to expose pseudo-dialectic on behalf of any onlookers. However, expecting a programmer to not respond in a systematic manner to the issues raised is rather like expecting sight hounds not to chase running rabbits, so it’s harmless. What is particularly important, however, is the way rosarior calls out the SJW for his implicit threats and requests clarification; in doing so he causes the SJW to unmask completely and show his fangs.</p><blockquote class=\"tr_bq\"><p> I really have no idea why you are responding the way you are! Really!! Code of Conducts are not JUST about conduct,they cover all the spectrum of behaviours expected from civilized human beings that are more and more absend in the software industry. You are evading the topic at hand and I can only wonder why,why deny equal opportunity for all to join and contribute to your project Roberto?</p><p>That you have not “seen” harassment doesn’t mean it is not happening all around us. And turning a blind eye makes it worst. I was not threaning you,but your reaction is a projection of your feelings and now I feel threated by you. Reading the links you posted I only have one thing to say to you:reevaluate your actions,you are becoming a toxic individual who is harming the Python and Django communities and haven’t even realized it yet. You are a member of the Django Software Foundation and are supposed to be setting the example. I will be forwarding the content of this issue to the Chair to evaluate your continued presence in the DSF. best regards.</p></blockquote><p>It’s all there. Threats, point-and-shriek, playing the victim, false accusations, and the inevitable appeal to the amenable authority. In the interest of Social Justice Convergence, the SJW demonstrates that he will try to destroy the project rather than permit it to continue if it cannot be captured and forcibly submitted to the SJW Narrative. Rosarior’s response was the best one I have seen in technology yet, as he not only defeated the assault, but exposed the SJW for what he is in the process.</p><p>This is not a joke. These people are genuinely dangerous and will destroy everything they touch. Resist them. Expose them. Seek them out in your own organizations, hunt them down and root them out. SJW delenda est.</p><p>It’s time to go on the offensive. If your group or organization has a Code of Conduct, start the campaign to get rid of it now. There is a reason the SJWs are so intent on imposing them everywhere; that is how they intend to institute their thought policing.</p><p>And since you know the SJWs are going to be coming after him, show the man he’s got support behind him. If you’re on Twitter, <a href=\"https://twitter.com/siloraptor\">follow the man</a>.<br> <i><br/></i><br> <i>“Those who can code do, those who can’t write code of conducts.”</i><br> – Roberto Rosario</br></br></br></p></div>",
  "content_text": "Rosarior\nbeats back and exposes an SJW entryist\nattempting to impose a Code of Conduct on the Awesome-Django project:\ngreat project!! I have one observation and a suggestion. I noticed you have rejected some pull requests to add some good django libraries and that the people submitting those pull requests are POCs (People of Colour). As a suggestion I recommend adopting the Contributor Code of Conduct (http://contributor-covenant.org) to ensure everybody’s contributions are accepted regarless of their sex, sexual orientation, skin color, religion, height, place of origin, etc, etc, etc. As a white straight male and lead of this trending repository, your adoption of this Code of Conduct will send a loud and clear message that inclusion is a primary objective of the Django community and of the software development community in general. D.\nA few things about this. First, the name is generic. Second, this comment is literally the SJW’s first “contribution to the project. Third, while the SJW uses the correct terminology, he offers no evidence whatsoever for his claims. Fourth, his claim that the people whose pull requests were rejected are People of Colour are likely false considering that he doesn’t know that the individual he is addressing is Hispanic, not white.\nFortunately, rosarior recognizes the nature of the stealth attack. While he politely addresses the nominal suggestions, he makes it clear that this project is not a soft target and shuts down the SJW’s line of entry\nThe pull request was rejected not the person. Of the people who did not had their patches accepted at least one submitted another pull request and was accepted or are contributors in my other repositories, disproving your basic premise.\nThere is no need for a code of conduct, there hasn’t been a conduct related incident with the repository and nothing about a contributor comes into play when rejecting or accepting a patch (as proved above). An explanation is provided when a patch is rejected, and some have been left open to re-asses in a future time.\nI’m not white and please don’t make any other assumptions about me, they hold no relevance to the matter at hand.\nI already work on several projects that hold inclusion as one of their primary goals.\nI’m closing this issue based on the explanations given.\nThe wording allows just a little more wiggle room than is ideal, but it is a strong and effective response, particularly the implicit statement that “inclusion” is not a primary goal of this particular project. Perhaps due to the wiggle room, the SJW tries again.\nYou seem to have taken personal issue with well the issue 🙂   I opened\nthis issue not to attack you or your decisions,but to help improve a\npart of the project in which it seemed lacking.  Most projects on Github\nhave adopted the Contributor Covenant or a variant of it.   It is a\nvery straight forward document that protects all parties,I don’t\nunderstand your negative attitude towards that philosophy.   You may not\nbe “white” [ in your profile picture you sure seem white 🙂 ] but you\nare not a woman or a trans-gendered person so you can’t possibly\nunderstand what they go through  (harassment,exclusion,threats) and why a\ncode of conduct is necessary.  Even the Django Software Foundation has\nadopted one to protect it’s future,for me it’s very obvious Django\nrelated projects would naturally follow suite and adopt the same if not\nsimilar Code of Conducts.   I urge you to reconsider for the good and\nfuture of this project 🙂    Thank you\nNow the rhetorical gloves come off. The SJW tries to play on rosarior’s insecurities and emotions, then throws out an appeal to the herd animal instinct before issuing an implicit threat. The code of conduct is now declared “necessary” in order to protect the future of the project, which is twice mentioned in a threatening manner. Notice that the SJW doesn’t even address the fact that his original claimed concerns were addressed, thereby negating any need for the requested code, he simply moves the goalposts and moves on to more high-pressure rhetorical tactics. This is why dialectical arguments are totally useless; the SJWs simply ignore the effective ones.\n1- You opened an issue to raise concern about the relationship of a contributor’s race and the rejection of their patches.\n2- Only I can accept or reject patches in this repository.\nYou made it clear who this was about.\nApart from this issue, we’ve had no conduct problems, so no need for a code of conduct.\nI’m very certain of my race: I’m Latino, Puertorican, a Mestizo from a\nCastiza mother and a Mulato father. There are many more races than just\nblack and white (\nhttps://en.wikipedia.org/wiki/Miscegenation\n).\nYes, I’m not a woman or a transgendered individual and I don’t intend\nto even try to understand what they have to put up with, never said\nthat. But you assume women and transgendered individual are the only\ntargets of harassment, exclusion and threats.\nEnglish is not my first language and I hope I’m mistaken but your last line “I urge you to reconsider for the good and future of this project 🙂 ” sounded like a threat, please clarify.\nThis response could be described as overly long and dialectical; rhetoric has ZERO informational content so responding to the feigned issues serves no purpose unless one is doing it to expose pseudo-dialectic on behalf of any onlookers. However, expecting a programmer to not respond in a systematic manner to the issues raised is rather like expecting sight hounds not to chase running rabbits, so it’s harmless. What is particularly important, however, is the way rosarior calls out the SJW for his implicit threats and requests clarification; in doing so he causes the SJW to unmask completely and show his fangs.\nI really have no idea why you are responding the way you are! Really!! Code of Conducts are not JUST about conduct,they cover all the spectrum of behaviours expected from civilized human beings that are more and more absend in the software industry. You are evading the topic at hand and I can only wonder why,why deny equal opportunity for all to join and contribute to your project Roberto?\nThat you have not “seen” harassment doesn’t mean it is not happening all around us. And turning a blind eye makes it worst. I was not threaning you,but your reaction is a projection of your feelings and now I feel threated by you. Reading the links you posted I only have one thing to say to you:reevaluate your actions,you are becoming a toxic individual who is harming the Python and Django communities and haven’t even realized it yet. You are a member of the Django Software Foundation and are supposed to be setting the example. I will be forwarding the content of this issue to the Chair to evaluate your continued presence in the DSF. best regards.\nIt’s all there. Threats, point-and-shriek, playing the victim, false accusations, and the inevitable appeal to the amenable authority. In the interest of Social Justice Convergence, the SJW demonstrates that he will try to destroy the project rather than permit it to continue if it cannot be captured and forcibly submitted to the SJW Narrative. Rosarior’s response was the best one I have seen in technology yet, as he not only defeated the assault, but exposed the SJW for what he is in the process.\nThis is not a joke. These people are genuinely dangerous and will destroy everything they touch. Resist them. Expose them. Seek them out in your own organizations, hunt them down and root them out. SJW delenda est.\nIt’s time to go on the offensive. If your group or organization has a Code of Conduct, start the campaign to get rid of it now. There is a reason the SJWs are so intent on imposing them everywhere; that is how they intend to institute their thought policing.\nAnd since you know the SJWs are going to be coming after him, show the man he’s got support behind him. If you’re on Twitter,\nfollow the man\n.\n“Those who can code do, those who can’t write code of conducts.”\n– Roberto Rosario",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-30T10:14:00+00:00"
}