{
  "url": "https://voxday.net/2015/10/10/feminism-is-losers-game/",
  "scraped_at": "2025-12-17T17:29:34.634835",
  "title": "Feminism is a loser’s game",
  "date_display": "October 10, 2015",
  "date_iso": "2015-10-10T20:42:00+00:00",
  "date_from_url": "2015-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It has always been observable that feminism is a loser’s game, but many have not understand exactly why. This commenter at Heartiste does a nice job of <a href=\"https://heartiste.wordpress.com/2015/10/10/comment-of-the-week-minimizing-strengths-maximizing-weaknesses/\">explaining why failure is inevitable</a>.</p><blockquote class=\"tr_bq\"><p> Peter Drucker, in his famous essay <i>Managing Oneself</i>, advised strongly<br> the need to understand your strengths and weaknesses, and observed that<br> you can never win by improving your weaknesses, only by improving your<br> strengths. In broader socio-economic terms, feminism has pressured women<br> to build on their weaknesses (ability to compete against men) and<br> discouraged them from capitalizing on their strengths (youth and<br> fertility). Young women have taken up this mantra to the extreme as<br> their innate herd behavior has driven millions of them dominate<br> universities and commit to a life of cubicle drudgery over hearth and<br> home. They would rather have a crappy job with vicious co-workers that<br> provides them money to spend on frivolities than a humble home domain<br> where they rule and experience the joy of children. It is unfortunate<br> that so many of our most intelligent and well-bred women are buying into<br> this lie only to discover just 10 years after starting that they have<br> missed the boat on marriage and childbearing opportunities.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Adding to<br> this cruel feminist hoax inflicted on impressionable women, some<br> companies make a spectacle of offering to freeze their female worker’s<br> eggs so they can devote their youth to the corporation and attempt<br> childbirth long after the ideal window for this has passed. This is not<br> to imply that women should not be educated; a woman should have an<br> education as a financial backup and to use after child-rearing.</br></br></br></br></br></br></p></blockquote><p>As a general rule, if you’re fighting a) your own biology, b) history, and c) Mother Nature, you should not be terribly surprised when the results are less than entirely triumphant.</p></div>",
  "content_text": "It has always been observable that feminism is a loser’s game, but many have not understand exactly why. This commenter at Heartiste does a nice job of\nexplaining why failure is inevitable\n.\nPeter Drucker, in his famous essay\nManaging Oneself\n, advised strongly\nthe need to understand your strengths and weaknesses, and observed that\nyou can never win by improving your weaknesses, only by improving your\nstrengths. In broader socio-economic terms, feminism has pressured women\nto build on their weaknesses (ability to compete against men) and\ndiscouraged them from capitalizing on their strengths (youth and\nfertility). Young women have taken up this mantra to the extreme as\ntheir innate herd behavior has driven millions of them dominate\nuniversities and commit to a life of cubicle drudgery over hearth and\nhome. They would rather have a crappy job with vicious co-workers that\nprovides them money to spend on frivolities than a humble home domain\nwhere they rule and experience the joy of children. It is unfortunate\nthat so many of our most intelligent and well-bred women are buying into\nthis lie only to discover just 10 years after starting that they have\nmissed the boat on marriage and childbearing opportunities.\nAdding to\nthis cruel feminist hoax inflicted on impressionable women, some\ncompanies make a spectacle of offering to freeze their female worker’s\neggs so they can devote their youth to the corporation and attempt\nchildbirth long after the ideal window for this has passed. This is not\nto imply that women should not be educated; a woman should have an\neducation as a financial backup and to use after child-rearing.\nAs a general rule, if you’re fighting a) your own biology, b) history, and c) Mother Nature, you should not be terribly surprised when the results are less than entirely triumphant.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-10T19:42:00+00:00"
}