{
  "url": "https://voxday.net/2015/10/27/free-delivery-worldwide/",
  "scraped_at": "2025-12-17T17:31:30.533593",
  "title": "Free delivery worldwide",
  "date_display": "October 27, 2015",
  "date_iso": "2015-10-27T19:00:00+00:00",
  "date_from_url": "2015-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“The most dangerous book in America”,<b> </b><i><b>SJWs Always Lie</b></i>, <a href=\"http://www.bookdepository.com/Sjws-Always-Lie-Taking-Down-Thought-Police-Vox-Day/9789527065686\">is now available at BookDepository</a>.</p><p>In case you’re still on the fence about reading it, it is also <a href=\"http://www.brianniemeier.com/2015/10/book-review-sjws-always-lie.html\">reviewed at Kairos</a>:</p><blockquote class=\"tr_bq\"><p> The book was originally conceived as a polemic, but the end result is<br> more like a field guide to navigating the SJW-riddled minefields of<br> Western academia, business, and media. Vox shares accounts of people who<br> lost their employment and reputations to social justice witch hunts,<br> walks the reader through a step by step analysis of the SJW attack<br> sequence, and offers actionable advice for what to do when you come<br> under fire for alleged violations of ever-shifting social justice<br> doctrine.</br></br></br></br></br></br></br></p><p>In reading <i>SJWAL</i>, it fascinated me how much SJWs’ elitist, polarizing, and unaccountable attitudes <a href=\"http://www.csj.org/infoserv_cult101/checklis.htm\" rel=\"noopener\" target=\"_blank\">resemble those of a cult</a>.<br> This observation is consistent with the fact that all malignant<br> ideologies now threatening Western civilization are Christian heresies<br> to some degree.</br></br></br></p><p>Heresy isn’t simply untruth. It’s a truth unhinged from other balancing<br> truths and exaggerated out of proportion. Pelagianism was the<br> overemphasis on human will to the exclusion of grace. Arianism focused<br> on Christ’s divine Sonship to the point of denying His divinity.<br> Similarly, the SJW cult absolutizes social justice while rejecting the<br> immutable nature from which human rights are derived.</br></br></br></br></br></p><p>The mental state required to embrace such a self-contradictory worldview<br> is responsible for Vox’s First Law of SJWs and the title of his book.<br> Because they believe that adopting an irrational ideology makes them<br> morally superior to everyone else, SJWs have no qualms about lying to<br> advance their goals. This includes <a href=\"http://www.thedailybeast.com/articles/2015/04/28/the-avengers-black-widow-problem-how-marvel-slut-shamed-their-most-badass-superheroine.html\" rel=\"noopener\" target=\"_blank\">smearing</a>, <a href=\"http://www.ew.com/article/2015/04/06/hugo-award-nominations-sad-puppies\" rel=\"noopener\" target=\"_blank\">libeling</a>, and <a href=\"http://monsterhunternation.com/2014/04/24/an-explanation-about-the-hugo-awards-controversy/\" rel=\"noopener\" target=\"_blank\">falsely accusing</a> others.</br></br></br></br></p><p><i>SJWAL</i>‘s most valuable public service has been sounding a wake-up<br> call to ordinary people whose well-meant misconception that SJWs could<br> be reasoned or compromised with allowed their witch hunts to gain so<br> much traction.</br></br></br></p></blockquote><p>Meanwhile, having been roundly trounced on the rhetorical front, SJWs are trying to think of what they can call us. Presumably besides “racist, sexist, homophobic, transphobic, bigot hater”.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://pbs.twimg.com/media/CSVibLfUcAAMzm_.png:large\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"36\" src=\"https://pbs.twimg.com/media/CSVibLfUcAAMzm_.png:large\" width=\"400\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://pbs.twimg.com/media/CSVibLfUcAAMzm_.png:large\" decoding=\"async\" height=\"36\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20400%2036%22%3E%3C/svg%3E\" width=\"400\"/></a></div><p></p></div>",
  "content_text": "“The most dangerous book in America”,\nSJWs Always Lie\n,\nis now available at BookDepository\n.\nIn case you’re still on the fence about reading it, it is also\nreviewed at Kairos\n:\nThe book was originally conceived as a polemic, but the end result is\nmore like a field guide to navigating the SJW-riddled minefields of\nWestern academia, business, and media. Vox shares accounts of people who\nlost their employment and reputations to social justice witch hunts,\nwalks the reader through a step by step analysis of the SJW attack\nsequence, and offers actionable advice for what to do when you come\nunder fire for alleged violations of ever-shifting social justice\ndoctrine.\nIn reading\nSJWAL\n, it fascinated me how much SJWs’ elitist, polarizing, and unaccountable attitudes\nresemble those of a cult\n.\nThis observation is consistent with the fact that all malignant\nideologies now threatening Western civilization are Christian heresies\nto some degree.\nHeresy isn’t simply untruth. It’s a truth unhinged from other balancing\ntruths and exaggerated out of proportion. Pelagianism was the\noveremphasis on human will to the exclusion of grace. Arianism focused\non Christ’s divine Sonship to the point of denying His divinity.\nSimilarly, the SJW cult absolutizes social justice while rejecting the\nimmutable nature from which human rights are derived.\nThe mental state required to embrace such a self-contradictory worldview\nis responsible for Vox’s First Law of SJWs and the title of his book.\nBecause they believe that adopting an irrational ideology makes them\nmorally superior to everyone else, SJWs have no qualms about lying to\nadvance their goals. This includes\nsmearing\n,\nlibeling\n, and\nfalsely accusing\nothers.\nSJWAL\n‘s most valuable public service has been sounding a wake-up\ncall to ordinary people whose well-meant misconception that SJWs could\nbe reasoned or compromised with allowed their witch hunts to gain so\nmuch traction.\nMeanwhile, having been roundly trounced on the rhetorical front, SJWs are trying to think of what they can call us. Presumably besides “racist, sexist, homophobic, transphobic, bigot hater”.",
  "tags": [
    "Book Review",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-27T19:00:00+00:00"
}