{
  "url": "https://voxday.net/2015/10/23/immigrants-dont-share-american-values/",
  "scraped_at": "2025-12-17T17:31:00.081069",
  "title": "Immigrants don’t share American values",
  "date_display": "October 23, 2015",
  "date_iso": "2015-10-23T12:22:00+00:00",
  "date_from_url": "2015-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Magic Dirt Theory is clearly not working as advertised. <a href=\"http://www.breitbart.com/big-journalism/2015/10/20/washington-post-op-ed-cheers-mass-immigration-will-destroy-nra-second-amendment/\">Immigrants are heavily anti-gun rights</a>:</p><blockquote class=\"tr_bq\"><p> The millions of foreigners the U.S. government voluntarily imports each year can be counted on to vote en-masse in favor of unconstitutional restrictions on the right to keep and bear arms, Winkler explains:</p><p><i>Polls show that whites tend to favor gun rights over gun control by a significant margin (57 percent to 40 percent). Yet whites, who comprise 63 percent of the population today, won’t be in the majority for long. Racial minorities are soon to be a majority, and they are the nation’s strongest supporters of strict gun laws.</i></p><p>The fastest-growing minority group in America is Latinos. Between 2000 and 2010, the nation’s Latino population grew by 43 percent. Hispanics, which make up 17 percent of the population today, are expected to grow to 30 percent of the population in the coming decades.</p><p>Gun control is extremely popular among Hispanics, with 75 percent favoring gun safety over gun rights.</p><p>Asian Americans also represent a growing anti-gun demographic. Although only about 5 percent of the population today, the Asian American population is predicted to triple over the next few decades. A recent poll of Asian American registered voters found that 80 percent supported stricter gun laws.</p></blockquote><p>I find it remarkable, although not exactly surprising, that so many people are so determined to defend their idiotic theory that all immigrants will magically become Real Americans, real life nephews of their Uncle Sam, reborn on the Fourth of July by virtue of geographical relocation, thereby instantly negating of all of their racial, ethnic, religious, political, and cultural traditions.</p><p>How very shocking to discover that immigrants place no value on “rights” that don’t exist, and have never existed, in their alien cultures. As I have repeatedly pointed out, immigrants have no understanding of limited government nor do they harbor any love for it. None. Let’s face it, even after generations in the USA, many descendants of the previous waves of European immigration still don’t grasp the basic concept.</p><p>It’s bad enough that the Magic Dirt theory is absurdly stupid; logical criticism <i>should </i>be sufficient to convince those who subscribe to it to abandon it entirely. But when they first reject the logic and then continue to cling to their theory in the face of actual evidence of the sort cited above, well, at that point we might as well just call them fat, ugly, and out-of-date. That sort of rhetoric will be more likely to persuade them that they are wrong, because it is obvious that neither facts nor reason are enough to do the trick.</p></div>",
  "content_text": "The Magic Dirt Theory is clearly not working as advertised.\nImmigrants are heavily anti-gun rights\n:\nThe millions of foreigners the U.S. government voluntarily imports each year can be counted on to vote en-masse in favor of unconstitutional restrictions on the right to keep and bear arms, Winkler explains:\nPolls show that whites tend to favor gun rights over gun control by a significant margin (57 percent to 40 percent). Yet whites, who comprise 63 percent of the population today, won’t be in the majority for long. Racial minorities are soon to be a majority, and they are the nation’s strongest supporters of strict gun laws.\nThe fastest-growing minority group in America is Latinos. Between 2000 and 2010, the nation’s Latino population grew by 43 percent. Hispanics, which make up 17 percent of the population today, are expected to grow to 30 percent of the population in the coming decades.\nGun control is extremely popular among Hispanics, with 75 percent favoring gun safety over gun rights.\nAsian Americans also represent a growing anti-gun demographic. Although only about 5 percent of the population today, the Asian American population is predicted to triple over the next few decades. A recent poll of Asian American registered voters found that 80 percent supported stricter gun laws.\nI find it remarkable, although not exactly surprising, that so many people are so determined to defend their idiotic theory that all immigrants will magically become Real Americans, real life nephews of their Uncle Sam, reborn on the Fourth of July by virtue of geographical relocation, thereby instantly negating of all of their racial, ethnic, religious, political, and cultural traditions.\nHow very shocking to discover that immigrants place no value on “rights” that don’t exist, and have never existed, in their alien cultures. As I have repeatedly pointed out, immigrants have no understanding of limited government nor do they harbor any love for it. None. Let’s face it, even after generations in the USA, many descendants of the previous waves of European immigration still don’t grasp the basic concept.\nIt’s bad enough that the Magic Dirt theory is absurdly stupid; logical criticism\nshould\nbe sufficient to convince those who subscribe to it to abandon it entirely. But when they first reject the logic and then continue to cling to their theory in the face of actual evidence of the sort cited above, well, at that point we might as well just call them fat, ugly, and out-of-date. That sort of rhetoric will be more likely to persuade them that they are wrong, because it is obvious that neither facts nor reason are enough to do the trick.",
  "tags": [
    "gun control",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-23T11:22:00+00:00"
}