{
  "url": "https://voxday.net/2015/10/08/lunatics-wanted/",
  "scraped_at": "2025-12-17T17:29:21.747419",
  "title": "Lunatics wanted",
  "date_display": "October 8, 2015",
  "date_iso": "2015-10-08T19:00:00+00:00",
  "date_from_url": "2015-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is apparently <a href=\"http://ahorbinski.dreamwidth.org/82394.html\">an opening for mentally unstable shoggoths</a>, in case any of you happen to be looking for unpaid employment:</p><blockquote class=\"tr_bq\"><p> I’m sorry to say that my co-chair s.e. smith and I have resigned as<br> Wiscon 40 chairs and as members of the Wiscon concom, effective<br> immediately. This is a really unfortunate decision to have had to make,<br> and we very much regret placing the con in this position. That said, it<br> seems clear that we are a poor culture fit for the concom, and we feel<br> the need to prioritize self-care rather than further risk our own mental<br> health and well-being.</br></br></br></br></br></br></p></blockquote><p>I can’t help but wonder what makes them poor culture fits for the zoo-like freakfest that is Wiscon. Are they attracted to men? Do they weigh less than 200 kilograms? Did they Question the Narrative or did they simply fail to keep up with its rapid mutations?</p><p>In any case, “I feel the need to prioritize self-care” is now my go-to excuse for, well, anything. I was going to mow the lawn today, but regretfully, I felt the need to prioritize self-care. I’m sure you understand.</p><p></p></div>",
  "content_text": "There is apparently\nan opening for mentally unstable shoggoths\n, in case any of you happen to be looking for unpaid employment:\nI’m sorry to say that my co-chair s.e. smith and I have resigned as\nWiscon 40 chairs and as members of the Wiscon concom, effective\nimmediately. This is a really unfortunate decision to have had to make,\nand we very much regret placing the con in this position. That said, it\nseems clear that we are a poor culture fit for the concom, and we feel\nthe need to prioritize self-care rather than further risk our own mental\nhealth and well-being.\nI can’t help but wonder what makes them poor culture fits for the zoo-like freakfest that is Wiscon. Are they attracted to men? Do they weigh less than 200 kilograms? Did they Question the Narrative or did they simply fail to keep up with its rapid mutations?\nIn any case, “I feel the need to prioritize self-care” is now my go-to excuse for, well, anything. I was going to mow the lawn today, but regretfully, I felt the need to prioritize self-care. I’m sure you understand.",
  "tags": [
    "freakshow",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-08T18:00:00+00:00"
}