{
  "url": "https://voxday.net/2015/10/14/mailvox-we-didnt-destroy-your-drea/",
  "scraped_at": "2025-12-17T17:30:00.536004",
  "title": "Mailvox: We didn’t destroy your dream",
  "date_display": "October 14, 2015",
  "date_iso": "2015-10-14T16:00:00+00:00",
  "date_from_url": "2015-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Remper, if your dream is destroyed, the only individual responsible will be the only one with the power to do so, Chris Roberts:</p><blockquote class=\"tr_bq\"><p> 1) Don’t give a damn about Star Citizen for about 2 years<br>2) Poorly-written article in the Escapist appears<br>3) Don’t research anything or catch up on what is happening in Star Citizen right now<br>4) Write a post full of concerns about Star Citizen future<br>5) ???<br>6) PROFIT</br></br></br></br></br></p><p>Guys, Star Citizen has the most open development process ever done for a AAA-game. Everything they did so far is perfectly reasonable and what they promise is doable. No one had a single concern about game’s eventual completion before Derek Smart’s posts and the Escapist article. Not because we (backers) are stupid zealots, but because every week we are given a detailed explanation on how things are going.</p><p>Keep in mind: most of the Star Citizen backers doesn’t give a shit when the game will be released. This is the project that has to be done right. For now, we trust Chris Roberts with taking as much time as he needs to create the game we asked for. And for the last 2 years he hasn’t done anything to cast any doubt on his decisions.</p><p>What I’m really afraid of is that baseless allegations in the game press will scare potential partnerships with other companies and the constant intake from the new backers, which will make Chris to downsize the project – that would be really a shame. So until you have actual facts about Star Citizen development going south, I would kindly ask you not to generate any additional shitstorm. Don’t try to destroy our dream.</p></blockquote><p>A few things. First, Star Citizen is shaping up to be the one of the most epic events in game development history one way or another. To expect professional game developers to ignore their decades of experience as well as their personal knowledge of the various parties involved and keep their mouths shut until events play out is simply not reasonable. We have observations, we have opinions, and we have platforms. Deal with it.</p><p>Second, everything they have done so far is not perfectly reasonable. Everything they are promising is not doable. Saying that “it’s done when it’s done” sounds great and all, but there is this little problem called “burn rate” that means Chris cannot take as much time as he needs. That’s precisely why Derek Smart believes Chris is going to run out of both time and money long before the dream is realized.</p><p>Third, the allegations are far from baseless. There is a considerable amount of information that has not yet been made available to the public to which many of us in the industry are privy. It’s not a massive industry and everyone is, at the very least, a friend of a friend of a friend. Unfortunately, none of it tends to indicate the Star Citizen project is in any better than the coverage by <i>The Escapist</i> tends to indicate.</p><p>It is important to understand that NO ONE wants to see Chris fail. That would be a bad thing for everyone, including Derek Smart. Hell, if Chris wanted my help, I would donate it pro bono. But I very much doubt that insufficient or inept design is the problem, but rather, altogether too much of it and not enough production focus.</p></div>",
  "content_text": "Remper, if your dream is destroyed, the only individual responsible will be the only one with the power to do so, Chris Roberts:\n1) Don’t give a damn about Star Citizen for about 2 years\n2) Poorly-written article in the Escapist appears\n3) Don’t research anything or catch up on what is happening in Star Citizen right now\n4) Write a post full of concerns about Star Citizen future\n5) ???\n6) PROFIT\nGuys, Star Citizen has the most open development process ever done for a AAA-game. Everything they did so far is perfectly reasonable and what they promise is doable. No one had a single concern about game’s eventual completion before Derek Smart’s posts and the Escapist article. Not because we (backers) are stupid zealots, but because every week we are given a detailed explanation on how things are going.\nKeep in mind: most of the Star Citizen backers doesn’t give a shit when the game will be released. This is the project that has to be done right. For now, we trust Chris Roberts with taking as much time as he needs to create the game we asked for. And for the last 2 years he hasn’t done anything to cast any doubt on his decisions.\nWhat I’m really afraid of is that baseless allegations in the game press will scare potential partnerships with other companies and the constant intake from the new backers, which will make Chris to downsize the project – that would be really a shame. So until you have actual facts about Star Citizen development going south, I would kindly ask you not to generate any additional shitstorm. Don’t try to destroy our dream.\nA few things. First, Star Citizen is shaping up to be the one of the most epic events in game development history one way or another. To expect professional game developers to ignore their decades of experience as well as their personal knowledge of the various parties involved and keep their mouths shut until events play out is simply not reasonable. We have observations, we have opinions, and we have platforms. Deal with it.\nSecond, everything they have done so far is not perfectly reasonable. Everything they are promising is not doable. Saying that “it’s done when it’s done” sounds great and all, but there is this little problem called “burn rate” that means Chris cannot take as much time as he needs. That’s precisely why Derek Smart believes Chris is going to run out of both time and money long before the dream is realized.\nThird, the allegations are far from baseless. There is a considerable amount of information that has not yet been made available to the public to which many of us in the industry are privy. It’s not a massive industry and everyone is, at the very least, a friend of a friend of a friend. Unfortunately, none of it tends to indicate the Star Citizen project is in any better than the coverage by\nThe Escapist\ntends to indicate.\nIt is important to understand that NO ONE wants to see Chris fail. That would be a bad thing for everyone, including Derek Smart. Hell, if Chris wanted my help, I would donate it pro bono. But I very much doubt that insufficient or inept design is the problem, but rather, altogether too much of it and not enough production focus.",
  "tags": [
    "games",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-14T15:00:00+00:00"
}