{
  "url": "https://voxday.net/2015/10/03/mailvox-catalonian-independence/",
  "scraped_at": "2025-12-17T17:28:50.730170",
  "title": "Mailvox: Catalonian independence",
  "date_display": "October 3, 2015",
  "date_iso": "2015-10-03T13:00:00+00:00",
  "date_from_url": "2015-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>MT writes what amounts to a primer on Catalonia and the complications surrounding its independence movement in asking about the American Right’s response to it. I will respond to it in a future post.</i></p><p>I’m writing to ask you a question that has puzzled me for some time. The American right (without a single exception that I know of) enthusiastically supports independence movements in Europe even when these movements hold views radically opposed to those of the American right. I understand that the American right may consider independence so good in and of itself that it is desirable even when pursued by the ideological antagonists of the American right. And so they would be delighted to see the South and each of the leftists coasts abandon the Union because that would leave a more decent, more genuine America. OK. But my question is: why does the American right persist in speaking of these movements as if these European independentists actually held the ideals of 1776?</p><p>I find this attitude of the American right strange because most of these movements espouse views that are diametrically opposed to anything that one might call right-wing (anti-austerity, pro-multiculturalism, pro-homosexuality, pro-EU, anti-State-church separation, vastly corrupt schemes, pro-environmentalism, pro-feminism, politically-controlled media, politically-controlled education, politically-controlled language usage, etc.) But the American right invariably ignores—indeed they don’t seem to care at all—about the actual views or deeds of the pro-independence movement. They are so determined to defend the independentists that they always take it absolutely for granted that the pro-independence movements just espouse the ideals of the Founding Fathers.</p><p>And this goes against all evidence.</p><p>This is truly spectacular in the case of Catalan secessionism (the case I know best) because they have actually been ruling their region for about 40 years now. So it’s not like their views, policies, speeches and attitudes are a matter of abstract speculation or inventive futurology. This is not like wondering what would happen if the Free State Project achieved its goal or how a Rand Paul administration might be like. These people have already done plenty of actual politics, actual ruling. Their actions are not a state secret.</p><p><a name=\"more\"></a>For decades the independentists have spread their propaganda while the other side only broke their silence from time to time to agree with their supposed adversaries (a typical feature of the modern left-right divide), so it is only natural that foreigners will be much more acquainted with the Catalanist point of view. And since the ideals of the American right are inseparable from the ideals of 1776 (perhaps with the exception of the likes of Moldbug and maybe Hoppe, I guess), it is perfectly understandable that the American right will tend to side with other peoples who also seek to break free from another European monarch. The problem is that this sympathy is explained under the pretense or delusion that these particular independentists are carbon copies of the Minutemen whereas they hold views and actually enforce policies that are as far removed from the ideals of the Revolutionary War as you can get in modern politics, and that’s very far away indeed.</p><p>If I go to one of these American conservatives and comment that I am surprised that the American government could make this or that blunder, they’ll quickly inform me that I’m being naïve—it’s not a blunder, it’s a feature! The leftist politicians in Washington, DC are not acting in the best interests of the American people, and the Republicans—they’ll quickly add—are not much better. But mention instead the Catalan politicians and suddenly it is all milk and honey: brave, well-meaning, freedom-lovers who only want to get rid of an oppressive government. Braveheart in the 21st century, seems to be the way they think of it. A reenactment of 1776 in another land. They usually can’t name more than one of these politicians and not even one of their policies, but that doesn’t stop them.</p><p>I understand that American conservatives are very comfortable with this unique interpretation, but most of these Americans are people who have gone to great lengths to free themselves from political naiveté when it comes to their own politicians.</p><p>By the way, I am not against independence per se. I do believe that it may be good in some cases. Yes, maybe even in the Catalan case. But to me, that’s entirely beside the point. What perplexes me to no end is how the American right stubbornly keeps misinterpreting the pro-independence movements.</p><p>Also, I speak the Catalan language as a native speaker because I am from a region where we speak what the Catalonians consider a dialect of their own Catalan language. I lived in that Catalan-influenced region for two decades. I also lived in Catalonia itself for fifteen years. Now I live in Madrid where Spanish-speakers routinely mistake me for a Catalan, because of my accent and family names (Spanish people have two family names). Indeed, a Catalanist taking a look at my family tree would have an orgasm seeing only Catalan-sounding names for, at least, half a millennium. Not that this should matter, but Catalanists have repeatedly stated the capital importance of one’s family names, so there is that.</p><p>And so I find myself in the privileged position of witnessing this whole mess with an unusual amount of knowledge and an ideological open-mind. I’ve had countless conversations about this with people from all over, mostly with Catalanists. And yet, a conversation about this with the American right is always doomed to fail. Much more doomed to fail than with the usual pro-independence Catalanist. I speak of Catalonia, and the American conservative says “Catalonia” but his mind is in the Thirteen Colonies over two centuries ago. His entire worldview: every secessionist is a George Washington, everybody else a vampire.</p><p>When I speak of the Catalan issue I mention economic policies, electoral laws, legislations of all sorts, political corruption, ideological values, but the American right only hears: redcoats, redcoats, redcoats everywhere! When speaking about the facts of Catalonia to the American right, the facts of Catalonia are entirely irrelevant, it is all about the Boston tea party. I find this militant solipsism quite alien to conservatism, but there it is.</p><p>I mentioned in your blog that since 1992 the population of Catalonia has grown from 6 to 7 million due to the Catalanist policy of favoring North African and Middle East immigration to counter the Hispanic immigration from the American continent. Yet the American right keeps talking about a would-be independent Catalonia that would have “less forced Muslim invasion”. http://www.anonymousconservative.com/blog/catalonia-votes-for-independence/ This is not a matter of supposition or futurology, this is already fact. Catalanism has deliberately engaged for years now in massive Islamic immigration, yet the American right dreams that a triumphant Catalanism will actually help reverse the very trend that Catalanism initiated. This is bizarre.</p><p>I’ve mentioned repeatedly to many American conservatives how the Catalan-designed tariffs—particularly the “Arancel Cambó”—prevented the industrialization of most of Spain while protecting the industry in Catalonia and the Basque Provinces. But the American right keeps repeating the inverted tale that wronged industrious Catalonians have been robbed by Spain.</p><p>Catalonia has been receiving enormous amounts of tax money and extra benefits at the expense of the rest of the nation, in part due to the unfair Spanish electoral law which vastly over-represents Catalonia in the national parliament, often leaving the two big Spanish parties in the uncomfortable position of literally having to buy the support of the Catalanist party to form a national government in Spain. And they have repeatedly bought it with money that went from Spanish taxpayers to Spanish politicians to Catalanist politicians to accounts in tax havens.</p><p>For many years now, the rest of Spain has had to pay for the Catalan Social Security that seems doomed to eternal deficits. And the Spanish government has bailed out the Catalan regional government in excess of 20,000,000,000 euros already since the crisis began. And Catalonia (since before the days of the Franco regime) has received more money for public infrastructure than anyone else. Presently, it is the only region in the nation that has each one of its 4 provincial capitals linked by the Spanish-funded high speed train. Obviously an irresponsible extravagance, but this is reported in the Catalan media as “Madrid steals from us”.</p><p>Not all regional governments are funded according to the same laws: Navarra and the Basque Provinces have a unique system—popularly known as “el cupo vasco” and supposedly a continuation of the historic “fueros” that have limited the power of kings for a thousand years—which allows their regional governments to collect their own taxes while at the same time strictly limits the contribution of these regions to the national tax revenue. This has made it very difficult for Basque and Navarrese leaders to engage in nonsensical spending and has allowed these regions to have an unparalleled prosperity. Interestingly, very few in the rest of Spain have complained, and a growing number suggest the system should be extended to every corner of the kingdom. The Eurocrats, on the other hand, insist it should be abolished.</p><p>But why am I mentioning how the Basque regional government is funded? The Catalan leaders were offered this system in 1978 but they refused it because they didn’t want to appear as tax collectors to their people: let Madrid play bad cop and then let the Catalan politicians go to Madrid and sell their votes for money. And in each new election the Catalan votes are overrepresented and then there is a new charade where the two main Spanish parties bid for the Catalanist whore. But as years passed, these Spanish parties raised their bids by offering to share ever larger percentages of tax revenues. The national government keeps looking as the bad guy for collecting the taxes, and the Catalonian politicians keep looking as the good guys for (over)spending it. Then Catalonia runs into preposterous deficits and the regional leaders run to Madrid to get more Spanish tax money. And the singsong goes on about Madrid being a thief. This is systematically described among the American right as Catalans needing tax freedom from oppressive Spain.</p><p>In the early 2000s, the Spanish conservative government made a zero-deficit law. The problem was that most spending was done by the regions while most tax collecting was done by the central government. So long as most regions were ruled by the conservative party, things were manageable, and the deficit problem seemed to be solvable at last. But by the time the crisis came, the new socialist government had eliminated the zero deficit rule. And they also reformed the law regulating the financing of regional governments explicitly bragging that it was to the detriment of Madrid, Baleares and Valencia and to the benefit of Catalonia (the Spanish government that did this was socialist, while the conservatives were running the abused regions). When the socialists lost the last national elections, the conservatives now in power could not reintroduce the no-deficit rule in part because Catalonia had gotten very cozy with its overspending practices. Catalonia has about 14% of the population but has incurred in about 25% of the debt.</p><p>All this while the government of the region of Madrid lowered taxes and embarked in liberalizing reforms. Last year alone, of the 4.000 businesses that left Catalonia, nearly half of them relocated to Madrid. When this trend began, the media was quick to inform us that this had nothing to do with Catalanist interventionism, now the pretense is over. The farce has gone so far that it can only be sold in Catalonia to a brain-washed populace. Even one of the sons of the Pujol clan (the family who created and embodied modern-day Catalanism) moved to Madrid to avoid the taxes imposed by his own family in Catalonia! This is where I’d expect the American right to say “you can’t make this shit up” but no. They are a very smart family, always bragged about being humble middle class from the rural heartland, all they’ve done is politics, and now they have a collection of luxury cars, and bank accounts in several tax havens… meanwhile patriotic Catalanists dream of having “their own” tax agency so they can pay all their taxes to the likes of the Pujol clan. And the American right goes on with their stories about Spain sucking the blood of the hard-working Catalans, because the British Crown invented the unconstitutional IRS to piss off the colonists, or something.</p><p>The Catalan government refused to make any spending cuts in its gigantic media conglomerate that includes six TV channels (in a region of 7 million people) while they stopped paying their share of publicly-paid medicine. The Spanish government, again, sent extra funds to the Catalan government AND extra funds to the medicine suppliers. But somehow Spain is the thief.</p><p>This reminds me of how scientists initially thought that electric current moved in the direction of positive charges but when they found it was actually the negative electron that moved, they kept the criterion: it goes this way but we’ll say it goes that way. Scientists can do this because it doesn’t interfere with their understanding of the actual phenomenon, the same cannot be said of the American right.</p><p>Obviously, the Catalan media conglomerate runs its own huge deficit, which is paid by Spanish taxpayers to convince the Catalan population of how evil Spain is. And the conglomerate kept hammering the same old tune about “Madrid is robbing us”. With the crisis, other regions have had to downsize and in some cases close altogether their public regional TV stations, but the Catalanist propaganda machine remains untouched. Patients can live without their medicine, medicine suppliers can live without their money, but Catalans can’t live without their six public TV channels.</p><p>As an economist I tend to focus on the financial and fiscal aspects of all this aberration, this “Himalaya of lies” as Besteiro said. But it goes far, far, far beyond that. The tip of the iceberg: the Catalonian regional government ran <a href=\"https://youtu.be/ajf1d10lEvg?t=2m32s\">an over-the-top TV ad</a> bluntly promoting sexual promiscuity, pedophilia, homosexuality and even sexual violence but when a Spanish conservative commentator criticized it, he was severely fined for saying that the political leader (a Catalanist woman) responsible for this was a “swine”. Catalanism has devastated Catalan society to the point that nobody from Catalonia dared criticize this ad: no media, no church, no heart-bleeding NGO. It had to be someone from evil, evil Madrid. Sexual promiscuity, pedophilia, homosexuality and even sexual violence are a-ok but to call a female pro-independence politician a “swine” is an intolerable offense. The American right that is so quick to criticize these things everywhere mysteriously went blind, deaf, and mute that day. Just like the feminists, sexual degeneracy is evil, except when it’s perpetrated by “one of ours”, I guess.</p><p>Then, of course, there are the huge money-laundering scams by the Catalanist leaders. Which became public knowledge in the early 1980s, the first one being the Banca Catalana case. But the Spanish government chose to manipulate the judiciary and the media to save the Catalanist leadership and make people forget the whole business. Yes, I know, this planet is overflowing with governmental wisdom and journalistic integrity. Mysteriously, silencing the judiciary and the media about the first cases of corruption did nothing to prevent further Catalanist corruption. Actually, more cases appeared over the years: De la Rosa, Casinos, Planes de Muns, Estivill, Hacienda, Palau de la Musica, Cullell, Alavedra, Pallerols, etc…. Eventually, the headquarters of Pujol’s party had to be foreclosed due to the debts caused by the scandals. And the show goes on.</p><p>An innocent mortal can be accused of faults much milder than any of these cases and his life as a free man is ruined forever. But the Catalanist leaders engage in this behavior all the time and they are the figureheads of the eternal victims. “Bizarre” doesn’t begin to describe this.</p><p>When the national government is covering your back and you have a media empire of newspapers, radio stations and 6 TV channels, and the nominally private media busy licking your parts, then nobody among The People seems to know a thing about corruption. That’s why for years Catalonia was known as “<i>el estanque dorado</i>” (the golden pond): a piss puddle that stinks but where nobody dares make waves and so it looks gilded and peaceful.</p><p>A turning point for the golden pond came one day when the supposedly private media had become so much part of the Catalanist elite’s scam machine that they began issuing unanimous op-eds. I mean, literally unanimous. Each and every major newspaper in the region printed the very same op-ed. Word by word. Suddenly everybody in Catalonia had one single idea about one single issue and, of course, it just happened to be 100% in sync with what the Catalanist-controlled media had been preaching for decades. Oh, did I forget to mention that the regional elite also controls the education system and the regional police?</p><p>So, when Pujol had to publicly explain to his people that he had been hoarding large amounts of money in tax havens, well, it was a big shock. Good old Pujol stealing from his own people of Catalonia! Impossible, stealing is what Madrid does! The TV says so! All TVs say so! And the teachers say so! It can’t be true! But Pujol has said so, therefore it can’t be false! Robbie the Robot’s circuitry didn’t suffer that much.</p><p>Spain would be much better off without the parasitical Catalonian elite. Except that the place is already a Muslim beachhead, and sooner than later someone will have to deal with that mess. And I don’t mean hashtags. But who? The Catalanists will be the dhimmis of the Muslims, the EU is already cheering the Muslims, as is the red-profaned Vatican and the UN, the Americans are already busy in their War against Christendom, and Spain will perhaps not exist—to everybody’s delight. Which reminds me of Don Pelayo and his battle at Covadonga. But it also reminds me that in 1770, the 4-year-old Russian Imperial Navy anchored at the Spanish coastal city where I was born—where hundreds of Russian sailors are buried—on its way to defeat the Turks at Chesma.</p><p>This is just the tip of the iceberg of the many, many things that can be said about the Catalanist movement. I’ve mentioned many of these things to many an American conservative, but until this day I’ve never found one who even wanted to listen, they just want to dream on with their mental movie about Braveheart in the 21st century. I am perplexed by this attitude of the American right.</p></div>",
  "content_text": "MT writes what amounts to a primer on Catalonia and the complications surrounding its independence movement in asking about the American Right’s response to it. I will respond to it in a future post.\nI’m writing to ask you a question that has puzzled me for some time. The American right (without a single exception that I know of) enthusiastically supports independence movements in Europe even when these movements hold views radically opposed to those of the American right. I understand that the American right may consider independence so good in and of itself that it is desirable even when pursued by the ideological antagonists of the American right. And so they would be delighted to see the South and each of the leftists coasts abandon the Union because that would leave a more decent, more genuine America. OK. But my question is: why does the American right persist in speaking of these movements as if these European independentists actually held the ideals of 1776?\nI find this attitude of the American right strange because most of these movements espouse views that are diametrically opposed to anything that one might call right-wing (anti-austerity, pro-multiculturalism, pro-homosexuality, pro-EU, anti-State-church separation, vastly corrupt schemes, pro-environmentalism, pro-feminism, politically-controlled media, politically-controlled education, politically-controlled language usage, etc.) But the American right invariably ignores—indeed they don’t seem to care at all—about the actual views or deeds of the pro-independence movement. They are so determined to defend the independentists that they always take it absolutely for granted that the pro-independence movements just espouse the ideals of the Founding Fathers.\nAnd this goes against all evidence.\nThis is truly spectacular in the case of Catalan secessionism (the case I know best) because they have actually been ruling their region for about 40 years now. So it’s not like their views, policies, speeches and attitudes are a matter of abstract speculation or inventive futurology. This is not like wondering what would happen if the Free State Project achieved its goal or how a Rand Paul administration might be like. These people have already done plenty of actual politics, actual ruling. Their actions are not a state secret.\nFor decades the independentists have spread their propaganda while the other side only broke their silence from time to time to agree with their supposed adversaries (a typical feature of the modern left-right divide), so it is only natural that foreigners will be much more acquainted with the Catalanist point of view. And since the ideals of the American right are inseparable from the ideals of 1776 (perhaps with the exception of the likes of Moldbug and maybe Hoppe, I guess), it is perfectly understandable that the American right will tend to side with other peoples who also seek to break free from another European monarch. The problem is that this sympathy is explained under the pretense or delusion that these particular independentists are carbon copies of the Minutemen whereas they hold views and actually enforce policies that are as far removed from the ideals of the Revolutionary War as you can get in modern politics, and that’s very far away indeed.\nIf I go to one of these American conservatives and comment that I am surprised that the American government could make this or that blunder, they’ll quickly inform me that I’m being naïve—it’s not a blunder, it’s a feature! The leftist politicians in Washington, DC are not acting in the best interests of the American people, and the Republicans—they’ll quickly add—are not much better. But mention instead the Catalan politicians and suddenly it is all milk and honey: brave, well-meaning, freedom-lovers who only want to get rid of an oppressive government. Braveheart in the 21st century, seems to be the way they think of it. A reenactment of 1776 in another land. They usually can’t name more than one of these politicians and not even one of their policies, but that doesn’t stop them.\nI understand that American conservatives are very comfortable with this unique interpretation, but most of these Americans are people who have gone to great lengths to free themselves from political naiveté when it comes to their own politicians.\nBy the way, I am not against independence per se. I do believe that it may be good in some cases. Yes, maybe even in the Catalan case. But to me, that’s entirely beside the point. What perplexes me to no end is how the American right stubbornly keeps misinterpreting the pro-independence movements.\nAlso, I speak the Catalan language as a native speaker because I am from a region where we speak what the Catalonians consider a dialect of their own Catalan language. I lived in that Catalan-influenced region for two decades. I also lived in Catalonia itself for fifteen years. Now I live in Madrid where Spanish-speakers routinely mistake me for a Catalan, because of my accent and family names (Spanish people have two family names). Indeed, a Catalanist taking a look at my family tree would have an orgasm seeing only Catalan-sounding names for, at least, half a millennium. Not that this should matter, but Catalanists have repeatedly stated the capital importance of one’s family names, so there is that.\nAnd so I find myself in the privileged position of witnessing this whole mess with an unusual amount of knowledge and an ideological open-mind. I’ve had countless conversations about this with people from all over, mostly with Catalanists. And yet, a conversation about this with the American right is always doomed to fail. Much more doomed to fail than with the usual pro-independence Catalanist. I speak of Catalonia, and the American conservative says “Catalonia” but his mind is in the Thirteen Colonies over two centuries ago. His entire worldview: every secessionist is a George Washington, everybody else a vampire.\nWhen I speak of the Catalan issue I mention economic policies, electoral laws, legislations of all sorts, political corruption, ideological values, but the American right only hears: redcoats, redcoats, redcoats everywhere! When speaking about the facts of Catalonia to the American right, the facts of Catalonia are entirely irrelevant, it is all about the Boston tea party. I find this militant solipsism quite alien to conservatism, but there it is.\nI mentioned in your blog that since 1992 the population of Catalonia has grown from 6 to 7 million due to the Catalanist policy of favoring North African and Middle East immigration to counter the Hispanic immigration from the American continent. Yet the American right keeps talking about a would-be independent Catalonia that would have “less forced Muslim invasion”. http://www.anonymousconservative.com/blog/catalonia-votes-for-independence/ This is not a matter of supposition or futurology, this is already fact. Catalanism has deliberately engaged for years now in massive Islamic immigration, yet the American right dreams that a triumphant Catalanism will actually help reverse the very trend that Catalanism initiated. This is bizarre.\nI’ve mentioned repeatedly to many American conservatives how the Catalan-designed tariffs—particularly the “Arancel Cambó”—prevented the industrialization of most of Spain while protecting the industry in Catalonia and the Basque Provinces. But the American right keeps repeating the inverted tale that wronged industrious Catalonians have been robbed by Spain.\nCatalonia has been receiving enormous amounts of tax money and extra benefits at the expense of the rest of the nation, in part due to the unfair Spanish electoral law which vastly over-represents Catalonia in the national parliament, often leaving the two big Spanish parties in the uncomfortable position of literally having to buy the support of the Catalanist party to form a national government in Spain. And they have repeatedly bought it with money that went from Spanish taxpayers to Spanish politicians to Catalanist politicians to accounts in tax havens.\nFor many years now, the rest of Spain has had to pay for the Catalan Social Security that seems doomed to eternal deficits. And the Spanish government has bailed out the Catalan regional government in excess of 20,000,000,000 euros already since the crisis began. And Catalonia (since before the days of the Franco regime) has received more money for public infrastructure than anyone else. Presently, it is the only region in the nation that has each one of its 4 provincial capitals linked by the Spanish-funded high speed train. Obviously an irresponsible extravagance, but this is reported in the Catalan media as “Madrid steals from us”.\nNot all regional governments are funded according to the same laws: Navarra and the Basque Provinces have a unique system—popularly known as “el cupo vasco” and supposedly a continuation of the historic “fueros” that have limited the power of kings for a thousand years—which allows their regional governments to collect their own taxes while at the same time strictly limits the contribution of these regions to the national tax revenue. This has made it very difficult for Basque and Navarrese leaders to engage in nonsensical spending and has allowed these regions to have an unparalleled prosperity. Interestingly, very few in the rest of Spain have complained, and a growing number suggest the system should be extended to every corner of the kingdom. The Eurocrats, on the other hand, insist it should be abolished.\nBut why am I mentioning how the Basque regional government is funded? The Catalan leaders were offered this system in 1978 but they refused it because they didn’t want to appear as tax collectors to their people: let Madrid play bad cop and then let the Catalan politicians go to Madrid and sell their votes for money. And in each new election the Catalan votes are overrepresented and then there is a new charade where the two main Spanish parties bid for the Catalanist whore. But as years passed, these Spanish parties raised their bids by offering to share ever larger percentages of tax revenues. The national government keeps looking as the bad guy for collecting the taxes, and the Catalonian politicians keep looking as the good guys for (over)spending it. Then Catalonia runs into preposterous deficits and the regional leaders run to Madrid to get more Spanish tax money. And the singsong goes on about Madrid being a thief. This is systematically described among the American right as Catalans needing tax freedom from oppressive Spain.\nIn the early 2000s, the Spanish conservative government made a zero-deficit law. The problem was that most spending was done by the regions while most tax collecting was done by the central government. So long as most regions were ruled by the conservative party, things were manageable, and the deficit problem seemed to be solvable at last. But by the time the crisis came, the new socialist government had eliminated the zero deficit rule. And they also reformed the law regulating the financing of regional governments explicitly bragging that it was to the detriment of Madrid, Baleares and Valencia and to the benefit of Catalonia (the Spanish government that did this was socialist, while the conservatives were running the abused regions). When the socialists lost the last national elections, the conservatives now in power could not reintroduce the no-deficit rule in part because Catalonia had gotten very cozy with its overspending practices. Catalonia has about 14% of the population but has incurred in about 25% of the debt.\nAll this while the government of the region of Madrid lowered taxes and embarked in liberalizing reforms. Last year alone, of the 4.000 businesses that left Catalonia, nearly half of them relocated to Madrid. When this trend began, the media was quick to inform us that this had nothing to do with Catalanist interventionism, now the pretense is over. The farce has gone so far that it can only be sold in Catalonia to a brain-washed populace. Even one of the sons of the Pujol clan (the family who created and embodied modern-day Catalanism) moved to Madrid to avoid the taxes imposed by his own family in Catalonia! This is where I’d expect the American right to say “you can’t make this shit up” but no. They are a very smart family, always bragged about being humble middle class from the rural heartland, all they’ve done is politics, and now they have a collection of luxury cars, and bank accounts in several tax havens… meanwhile patriotic Catalanists dream of having “their own” tax agency so they can pay all their taxes to the likes of the Pujol clan. And the American right goes on with their stories about Spain sucking the blood of the hard-working Catalans, because the British Crown invented the unconstitutional IRS to piss off the colonists, or something.\nThe Catalan government refused to make any spending cuts in its gigantic media conglomerate that includes six TV channels (in a region of 7 million people) while they stopped paying their share of publicly-paid medicine. The Spanish government, again, sent extra funds to the Catalan government AND extra funds to the medicine suppliers. But somehow Spain is the thief.\nThis reminds me of how scientists initially thought that electric current moved in the direction of positive charges but when they found it was actually the negative electron that moved, they kept the criterion: it goes this way but we’ll say it goes that way. Scientists can do this because it doesn’t interfere with their understanding of the actual phenomenon, the same cannot be said of the American right.\nObviously, the Catalan media conglomerate runs its own huge deficit, which is paid by Spanish taxpayers to convince the Catalan population of how evil Spain is. And the conglomerate kept hammering the same old tune about “Madrid is robbing us”. With the crisis, other regions have had to downsize and in some cases close altogether their public regional TV stations, but the Catalanist propaganda machine remains untouched. Patients can live without their medicine, medicine suppliers can live without their money, but Catalans can’t live without their six public TV channels.\nAs an economist I tend to focus on the financial and fiscal aspects of all this aberration, this “Himalaya of lies” as Besteiro said. But it goes far, far, far beyond that. The tip of the iceberg: the Catalonian regional government ran\nan over-the-top TV ad\nbluntly promoting sexual promiscuity, pedophilia, homosexuality and even sexual violence but when a Spanish conservative commentator criticized it, he was severely fined for saying that the political leader (a Catalanist woman) responsible for this was a “swine”. Catalanism has devastated Catalan society to the point that nobody from Catalonia dared criticize this ad: no media, no church, no heart-bleeding NGO. It had to be someone from evil, evil Madrid. Sexual promiscuity, pedophilia, homosexuality and even sexual violence are a-ok but to call a female pro-independence politician a “swine” is an intolerable offense. The American right that is so quick to criticize these things everywhere mysteriously went blind, deaf, and mute that day. Just like the feminists, sexual degeneracy is evil, except when it’s perpetrated by “one of ours”, I guess.\nThen, of course, there are the huge money-laundering scams by the Catalanist leaders. Which became public knowledge in the early 1980s, the first one being the Banca Catalana case. But the Spanish government chose to manipulate the judiciary and the media to save the Catalanist leadership and make people forget the whole business. Yes, I know, this planet is overflowing with governmental wisdom and journalistic integrity. Mysteriously, silencing the judiciary and the media about the first cases of corruption did nothing to prevent further Catalanist corruption. Actually, more cases appeared over the years: De la Rosa, Casinos, Planes de Muns, Estivill, Hacienda, Palau de la Musica, Cullell, Alavedra, Pallerols, etc…. Eventually, the headquarters of Pujol’s party had to be foreclosed due to the debts caused by the scandals. And the show goes on.\nAn innocent mortal can be accused of faults much milder than any of these cases and his life as a free man is ruined forever. But the Catalanist leaders engage in this behavior all the time and they are the figureheads of the eternal victims. “Bizarre” doesn’t begin to describe this.\nWhen the national government is covering your back and you have a media empire of newspapers, radio stations and 6 TV channels, and the nominally private media busy licking your parts, then nobody among The People seems to know a thing about corruption. That’s why for years Catalonia was known as “\nel estanque dorado\n” (the golden pond): a piss puddle that stinks but where nobody dares make waves and so it looks gilded and peaceful.\nA turning point for the golden pond came one day when the supposedly private media had become so much part of the Catalanist elite’s scam machine that they began issuing unanimous op-eds. I mean, literally unanimous. Each and every major newspaper in the region printed the very same op-ed. Word by word. Suddenly everybody in Catalonia had one single idea about one single issue and, of course, it just happened to be 100% in sync with what the Catalanist-controlled media had been preaching for decades. Oh, did I forget to mention that the regional elite also controls the education system and the regional police?\nSo, when Pujol had to publicly explain to his people that he had been hoarding large amounts of money in tax havens, well, it was a big shock. Good old Pujol stealing from his own people of Catalonia! Impossible, stealing is what Madrid does! The TV says so! All TVs say so! And the teachers say so! It can’t be true! But Pujol has said so, therefore it can’t be false! Robbie the Robot’s circuitry didn’t suffer that much.\nSpain would be much better off without the parasitical Catalonian elite. Except that the place is already a Muslim beachhead, and sooner than later someone will have to deal with that mess. And I don’t mean hashtags. But who? The Catalanists will be the dhimmis of the Muslims, the EU is already cheering the Muslims, as is the red-profaned Vatican and the UN, the Americans are already busy in their War against Christendom, and Spain will perhaps not exist—to everybody’s delight. Which reminds me of Don Pelayo and his battle at Covadonga. But it also reminds me that in 1770, the 4-year-old Russian Imperial Navy anchored at the Spanish coastal city where I was born—where hundreds of Russian sailors are buried—on its way to defeat the Turks at Chesma.\nThis is just the tip of the iceberg of the many, many things that can be said about the Catalanist movement. I’ve mentioned many of these things to many an American conservative, but until this day I’ve never found one who even wanted to listen, they just want to dream on with their mental movie about Braveheart in the 21st century. I am perplexed by this attitude of the American right.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-03T12:00:00+00:00"
}