{
  "url": "https://voxday.net/2015/10/26/mailvox-blaming-victi/",
  "scraped_at": "2025-12-17T17:31:20.485789",
  "title": "Mailvox: blaming the victim",
  "date_display": "October 26, 2015",
  "date_iso": "2015-10-26T16:51:00+00:00",
  "date_from_url": "2015-10-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RS mistakenly blames Christianity for the West’s civilizational suicide:</p><blockquote class=\"tr_bq\"><p> I’ve never read any of your books; just snippets of things here and<br> there.  Its safe to say we share the same politics, which is the reason<br> for my writing you. I am a wannabe Christian, but I am running up<br> against that wall of egalitarianism that seems to be a big part of the<br> faith.  Love your enemies and all that. Specifically, the Muslim<br> invasion that is happening in Europe right now.  I am furious over<br> that.  I have the suspicion that at the root of this civilizational<br> suicide is Christianity’s egalitarianism.  Now my concerns about this<br> “migration” are not racial or ethnic but rather cultural and<br> ideological.  I have a lot of sympathy for Christians who are fleeing<br> trouble; even if they are fleeing economic trouble.  Its the muslims I<br> fear and yes, detest.</br></br></br></br></br></br></br></br></br></br></br></p><div></div><div> Do you struggle with this?  How<br> can one be a Christian and still want to fight to protect the West<br> (since we are supposed to love even our enemies)?</br></br></div></blockquote><p>Considering that Europe no longer calls itself “Christendom” and collectively flaunts its post-Christian status, I think it is absolutely bizarre to postulate that the roots of the civilizational suicide are to be found in <i>Christian </i>egalitarianism. After all, according to Christianity, there is neither Jew nor Gentile <i>in Christ Jesus</i>, but Christianity deems itself “in but not of the world” and does not even concern itself with interfering in the relationship between master and slave, let alone global wealth redistribution and population flows.</p><p>What you are reacting to is Churchianity and it has absolutely nothing to do with Christian theology, it is merely one of the wolves in sheep’s clothing about which the Apostle Paul warned us. Never confuse the wolf in sheep’s clothing for the sheep or the sheep-stealing thief for the shepherd.</p><p>In fact, the religion of Churchianity is the same as the religion of the multiculturalists and globalists, it is the worldly religion of Babel. The Christian perspective intrinsically takes “the nations” into account, each with their own identity and even ruling spirits. Transnational egalitarianism and globalism are not Christian; quite to the contrary, they are rabidly, viciously, feverishly opposed to Christianity. It was not Christians who made “<i>egalite’</i>” the motto of the French Revolution.</p><p>And don’t be surprised if the rise of European nationalism is accompanied by the widespread rejection of European post-Christianity. What you are seeing is the failure of secularism, not the failure of Christianity.</p></div>",
  "content_text": "RS mistakenly blames Christianity for the West’s civilizational suicide:\nI’ve never read any of your books; just snippets of things here and\nthere.  Its safe to say we share the same politics, which is the reason\nfor my writing you. I am a wannabe Christian, but I am running up\nagainst that wall of egalitarianism that seems to be a big part of the\nfaith.  Love your enemies and all that. Specifically, the Muslim\ninvasion that is happening in Europe right now.  I am furious over\nthat.  I have the suspicion that at the root of this civilizational\nsuicide is Christianity’s egalitarianism.  Now my concerns about this\n“migration” are not racial or ethnic but rather cultural and\nideological.  I have a lot of sympathy for Christians who are fleeing\ntrouble; even if they are fleeing economic trouble.  Its the muslims I\nfear and yes, detest.\nDo you struggle with this?  How\ncan one be a Christian and still want to fight to protect the West\n(since we are supposed to love even our enemies)?\nConsidering that Europe no longer calls itself “Christendom” and collectively flaunts its post-Christian status, I think it is absolutely bizarre to postulate that the roots of the civilizational suicide are to be found in\nChristian\negalitarianism. After all, according to Christianity, there is neither Jew nor Gentile\nin Christ Jesus\n, but Christianity deems itself “in but not of the world” and does not even concern itself with interfering in the relationship between master and slave, let alone global wealth redistribution and population flows.\nWhat you are reacting to is Churchianity and it has absolutely nothing to do with Christian theology, it is merely one of the wolves in sheep’s clothing about which the Apostle Paul warned us. Never confuse the wolf in sheep’s clothing for the sheep or the sheep-stealing thief for the shepherd.\nIn fact, the religion of Churchianity is the same as the religion of the multiculturalists and globalists, it is the worldly religion of Babel. The Christian perspective intrinsically takes “the nations” into account, each with their own identity and even ruling spirits. Transnational egalitarianism and globalism are not Christian; quite to the contrary, they are rabidly, viciously, feverishly opposed to Christianity. It was not Christians who made “\negalite’\n” the motto of the French Revolution.\nAnd don’t be surprised if the rise of European nationalism is accompanied by the widespread rejection of European post-Christianity. What you are seeing is the failure of secularism, not the failure of Christianity.",
  "tags": [
    "Christianity",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-26T16:51:00+00:00"
}