{
  "url": "https://voxday.net/2015/10/13/mailvox-irrelevan/",
  "scraped_at": "2025-12-17T17:29:47.148046",
  "title": "Mailvox: Irrelevant",
  "date_display": "October 13, 2015",
  "date_iso": "2015-10-13T00:11:00+00:00",
  "date_from_url": "2015-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To be more specific, irrelevant and outdated drivel written by a coward and a liar. That’s the answer to a question I was asked by a reader concerning my response to <a href=\"http://monsterhunternation.com/2015/10/12/sad-puppies-guest-post-by-chuck-gannon/\">this ridiculous guest post</a> at Monster Hunter Nation by Charles Gannon:</p><blockquote class=\"tr_bq\"><p> My thought for the day:</p><p>Choose your battles carefully.</p><p>If you find yourself constantly in combat, you’re not being choosy enough.</p><p>Or you’ve decided that you are actually at war. Which means that you are now committed to destruction, not discourse.</p><p>No value judgments implied, but it was a call for courteous self-awareness when in discourse, and, more directly, a kind of diagram of what our discursive behavior tells us about our deepest motivations: are we talking to communicate or do battle? At no point do I imply that battle is always avoidable, or even wrong; just that it’s important to know when you’ve crossed the line, and what that really means.</p></blockquote><p>This is remarkably stupid on two counts. First, you can’t always choose your battles. When it comes to war, it takes one to tangle. I didn’t choose my battles with SFWA, Patrick Nielsen Hayden, the Toad of Tor, McRapey, McRacist, George Rape Rape Martin, or Worldcon. They chose to attack me, completely unprovoked, and with the exception of Martin, I had never even heard of any of the losers prior to them attacking me. I didn’t cross any lines. They did.</p><p>What separated me from everyone else they attacked was that I was willing and able to not only fight back, but break their megaphones. Clueless and cowardly suckups like Gannon find self-defense reprehensible; he is just hoping that he’ll be eaten last. That’s why he favors unilateral disarmament with regards to rhetoric.</p><p>Second, we are in, at the very least, the fourth decade of a cultural war that has its roots in the social justice ideals of JS Mill. You could quite reasonably argue that we are actually in its second century. The time for discourse is long over. There is literally nothing to discuss. Either all individuals and institutions are wholly given over to social justice, as Mill declared, or the war continues. Would-be fence sitting moderates (who, like all moderates, only shoot at the side they supposedly, nominally, support), are totally useless, yammering about the dire need for something that is both impossible and irrelevant.</p><blockquote class=\"tr_bq\"><p> On the other hand, Trial by Fire was the only SP-recommended novel that did not make the Hugo ballot. It was also the only SP-recommended novel not included on Vox Day’s authoritarian slate. I will let you decide if there might be some relationship between those two data points…</p><p>As many know, my presence on the SP recommendation list came as a surprise; I did not learn about it until a few days (a week?) later, when someone commented on it on my FB account. Perceiving it as a list akin to dozens I’d seen floated during Hugo and Nebula seasons since I first became an SFWA member in 1990 (I think), the one concern I voiced to Brad (Torgerson) was that I was only comfortable being included if Vox Day (whose proclivities were known to me only via general third-hand report) was not on the list. Which he wasn’t. So then I went back to work (I’m fortunate to have a number of novels under contract) and pretty much stopped following the Hugo process. (I’m the parent-on-call for four kids, so I don’t browse FB feed much and sometimes wonder why I even have a Twitter account…)</p><p>When I learned about the Rabid Puppies and Vox Day’s activities (which prompted my research into the details of his prior commentaries upon race, women, and more), I contacted Brad and we agreed that everyone must follow their own conscience if push came to shove. I should add, for the record, that I not only respect fellow-novelist Marko Kloos immensely for the choice he made, but I also understand what may have been his instinct not to add to the unfortunate spectacle until and unless circumstances made it incumbent upon him to do so.</p></blockquote><p>There is a relationship, without question. Had I included Gannon’s novel on the RP list, it would have been nominated, just like Kloos’s. I didn’t include it because I hadn’t read it, I’d never heard of him, and now I’m glad I didn’t because apparently Gannon is the same sort of cowardly SJW kiss-ass that Kloos is. Gannon and Kloos are like the <i>National Review</i> of science fiction. I was quite happy to see Kloos withdraw his nomination too; I warned Brad that it was useless trying to support moderates like him because they always run away from the heat. They come up with all sorts of noble excuses, but you can’t help but notice that the direction is always the same: away from criticism and conflict.</p><p>I can’t claim those various declined nominations were any part of my strategy, but I certainly expected to see them. Because moderates are always cowards, that’s the real reason they’re moderates.</p><p>Anyhow, Gannon is not only a liar, he’s a rather stupid one to boot. Not only am I not an authoritarian, but it would be hard to find anyone on the planet who gives less of a damn what people do so long as they don’t a) bother me or b) destroy Western civilization. And really, b) is pretty much a subset of a).</p><p>Notice that Gannon was willing to write me off entirely on the basis of “general third-hand report” while openly palling around with the likes of Scalzi. That means that his calls for civility and discourse are entirely meaningless. To claim that someone is outside the bounds of discourse means YOU have declared yourself their enemy and you do not merit any civility or respect from them in return.</p><p>Gannon poses as a moderate, but he isn’t actually one. He’s on the side of the speech police. He’s on the side of the thought police. He may not be an SJW, but he is on their side, no matter what those who believe they are his friends might think. He’ll turn on them eventually, of course. And when he calls my slate “authoritarian”, he’s doing what SJWs always do. He’s projecting.</p><p>What the likes of Gannon don’t realize is that they’re entirely behind the times. They’re still living in the 1990s. They think their pointing-and-shrieking, and false equivalences, and attempted disqualifications will somehow magically achieve disqualify “extremists” like me. But neither truth nor reality are on their side, and it’s rather remarkable that someone who is supposedly intelligent still hasn’t realized that yet.</p><p>Especially when the other side is writing delusional things like Laura Mixon:</p><blockquote class=\"tr_bq\"><p> “Bullies and abusers rely on the larger community’s desire for comity—our willingness to live and let live—to impose their will and silence dissent. In such a case, it’s incumbent on people with standing in the community to speak up against them, providing a counterweight to their destructive ideas. By speaking when she did, in my view, Irene was doing what other thought leaders in our field like N. K. Jemisin, John Scalzi, and the Nielsen Haydens have done: guarding the health and well-being of our SFF community by standing up against hate speech.”</p></blockquote><p>I absolutely refuse to be a part of any community that has “thought leaders” of such an observably low quality. They are not only thought and speech police, they are proud of policing what they denounce as “hate speech”. What they call “destructive ideas” are better described as “history, science, and logic”.</p></div>",
  "content_text": "To be more specific, irrelevant and outdated drivel written by a coward and a liar. That’s the answer to a question I was asked by a reader concerning my response to\nthis ridiculous guest post\nat Monster Hunter Nation by Charles Gannon:\nMy thought for the day:\nChoose your battles carefully.\nIf you find yourself constantly in combat, you’re not being choosy enough.\nOr you’ve decided that you are actually at war. Which means that you are now committed to destruction, not discourse.\nNo value judgments implied, but it was a call for courteous self-awareness when in discourse, and, more directly, a kind of diagram of what our discursive behavior tells us about our deepest motivations: are we talking to communicate or do battle? At no point do I imply that battle is always avoidable, or even wrong; just that it’s important to know when you’ve crossed the line, and what that really means.\nThis is remarkably stupid on two counts. First, you can’t always choose your battles. When it comes to war, it takes one to tangle. I didn’t choose my battles with SFWA, Patrick Nielsen Hayden, the Toad of Tor, McRapey, McRacist, George Rape Rape Martin, or Worldcon. They chose to attack me, completely unprovoked, and with the exception of Martin, I had never even heard of any of the losers prior to them attacking me. I didn’t cross any lines. They did.\nWhat separated me from everyone else they attacked was that I was willing and able to not only fight back, but break their megaphones. Clueless and cowardly suckups like Gannon find self-defense reprehensible; he is just hoping that he’ll be eaten last. That’s why he favors unilateral disarmament with regards to rhetoric.\nSecond, we are in, at the very least, the fourth decade of a cultural war that has its roots in the social justice ideals of JS Mill. You could quite reasonably argue that we are actually in its second century. The time for discourse is long over. There is literally nothing to discuss. Either all individuals and institutions are wholly given over to social justice, as Mill declared, or the war continues. Would-be fence sitting moderates (who, like all moderates, only shoot at the side they supposedly, nominally, support), are totally useless, yammering about the dire need for something that is both impossible and irrelevant.\nOn the other hand, Trial by Fire was the only SP-recommended novel that did not make the Hugo ballot. It was also the only SP-recommended novel not included on Vox Day’s authoritarian slate. I will let you decide if there might be some relationship between those two data points…\nAs many know, my presence on the SP recommendation list came as a surprise; I did not learn about it until a few days (a week?) later, when someone commented on it on my FB account. Perceiving it as a list akin to dozens I’d seen floated during Hugo and Nebula seasons since I first became an SFWA member in 1990 (I think), the one concern I voiced to Brad (Torgerson) was that I was only comfortable being included if Vox Day (whose proclivities were known to me only via general third-hand report) was not on the list. Which he wasn’t. So then I went back to work (I’m fortunate to have a number of novels under contract) and pretty much stopped following the Hugo process. (I’m the parent-on-call for four kids, so I don’t browse FB feed much and sometimes wonder why I even have a Twitter account…)\nWhen I learned about the Rabid Puppies and Vox Day’s activities (which prompted my research into the details of his prior commentaries upon race, women, and more), I contacted Brad and we agreed that everyone must follow their own conscience if push came to shove. I should add, for the record, that I not only respect fellow-novelist Marko Kloos immensely for the choice he made, but I also understand what may have been his instinct not to add to the unfortunate spectacle until and unless circumstances made it incumbent upon him to do so.\nThere is a relationship, without question. Had I included Gannon’s novel on the RP list, it would have been nominated, just like Kloos’s. I didn’t include it because I hadn’t read it, I’d never heard of him, and now I’m glad I didn’t because apparently Gannon is the same sort of cowardly SJW kiss-ass that Kloos is. Gannon and Kloos are like the\nNational Review\nof science fiction. I was quite happy to see Kloos withdraw his nomination too; I warned Brad that it was useless trying to support moderates like him because they always run away from the heat. They come up with all sorts of noble excuses, but you can’t help but notice that the direction is always the same: away from criticism and conflict.\nI can’t claim those various declined nominations were any part of my strategy, but I certainly expected to see them. Because moderates are always cowards, that’s the real reason they’re moderates.\nAnyhow, Gannon is not only a liar, he’s a rather stupid one to boot. Not only am I not an authoritarian, but it would be hard to find anyone on the planet who gives less of a damn what people do so long as they don’t a) bother me or b) destroy Western civilization. And really, b) is pretty much a subset of a).\nNotice that Gannon was willing to write me off entirely on the basis of “general third-hand report” while openly palling around with the likes of Scalzi. That means that his calls for civility and discourse are entirely meaningless. To claim that someone is outside the bounds of discourse means YOU have declared yourself their enemy and you do not merit any civility or respect from them in return.\nGannon poses as a moderate, but he isn’t actually one. He’s on the side of the speech police. He’s on the side of the thought police. He may not be an SJW, but he is on their side, no matter what those who believe they are his friends might think. He’ll turn on them eventually, of course. And when he calls my slate “authoritarian”, he’s doing what SJWs always do. He’s projecting.\nWhat the likes of Gannon don’t realize is that they’re entirely behind the times. They’re still living in the 1990s. They think their pointing-and-shrieking, and false equivalences, and attempted disqualifications will somehow magically achieve disqualify “extremists” like me. But neither truth nor reality are on their side, and it’s rather remarkable that someone who is supposedly intelligent still hasn’t realized that yet.\nEspecially when the other side is writing delusional things like Laura Mixon:\n“Bullies and abusers rely on the larger community’s desire for comity—our willingness to live and let live—to impose their will and silence dissent. In such a case, it’s incumbent on people with standing in the community to speak up against them, providing a counterweight to their destructive ideas. By speaking when she did, in my view, Irene was doing what other thought leaders in our field like N. K. Jemisin, John Scalzi, and the Nielsen Haydens have done: guarding the health and well-being of our SFF community by standing up against hate speech.”\nI absolutely refuse to be a part of any community that has “thought leaders” of such an observably low quality. They are not only thought and speech police, they are proud of policing what they denounce as “hate speech”. What they call “destructive ideas” are better described as “history, science, and logic”.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-12T23:11:00+00:00"
}