{
  "url": "https://voxday.net/2015/10/03/mea-culpa/",
  "scraped_at": "2025-12-17T17:28:52.554767",
  "title": "Mea culpa",
  "date_display": "October 3, 2015",
  "date_iso": "2015-10-03T16:00:00+00:00",
  "date_from_url": "2015-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently one of my game design innovations is a “<a href=\"http://www.escapistmagazine.com/articles/view/video-games/features/galleryoftheday/14718-8-Video-Game-Trends-that-Need-to-Die.2\">trend that needs to die</a>“, as far as <i>The Escapist</i> is concerned:</p><blockquote class=\"tr_bq\"><p> Escort missions</p><p>Is there anything more annoying than an escort mission? You have to make sure that one NPC get from point A to point B, and you have to make sure they get there alive. Almost invariably, the NPC gets himself into trouble. Maybe he walks too slow and you’re constantly waiting on him, or he walks too fast, plunging into danger before you clear the way. Sometimes they take a path all their own, and it’s never the shortest one to your destination. In a similar vein, let’s do away with Assassin’s Creed’s eavesdropping missions as well, since they’re just escort missions wearing a Halloween disguise.</p></blockquote><p>Yes, believe it or not, <i>Rebel Moon Rising</i> was publicly recognized by <i>Computer Gaming World</i> for being the first shooter to introduce escort missions. The issues the writer mentions are all legitimate, but they were obvious from the start and I believe we handled them pretty well. Other designers would not have followed in our footsteps if it hadn’t worked, but it seems not all of them have been as successful in addressing them.</p><p>Of course, the pathing is considerably easier in a 2.5D game than a 3D one, although I don’t know why escorted NPCs wouldn’t have an optimal path pre-programmed into them in the first place.</p><p>What I find a bigger problem with the escort mission is the way in which the story situation is so often handled ineptly. That first escort mission in RMR involved escorting baby aliens, who naturally wouldn’t know to run or to defend themselves if attacked by soldiers with lasers. But escort missions where armed adult warriors don’t defend themselves or even run away when attacked are just poorly designed, so it shouldn’t be a surprise if there are other problems with the implementation.</p></div>",
  "content_text": "Apparently one of my game design innovations is a “\ntrend that needs to die\n“, as far as\nThe Escapist\nis concerned:\nEscort missions\nIs there anything more annoying than an escort mission? You have to make sure that one NPC get from point A to point B, and you have to make sure they get there alive. Almost invariably, the NPC gets himself into trouble. Maybe he walks too slow and you’re constantly waiting on him, or he walks too fast, plunging into danger before you clear the way. Sometimes they take a path all their own, and it’s never the shortest one to your destination. In a similar vein, let’s do away with Assassin’s Creed’s eavesdropping missions as well, since they’re just escort missions wearing a Halloween disguise.\nYes, believe it or not,\nRebel Moon Rising\nwas publicly recognized by\nComputer Gaming World\nfor being the first shooter to introduce escort missions. The issues the writer mentions are all legitimate, but they were obvious from the start and I believe we handled them pretty well. Other designers would not have followed in our footsteps if it hadn’t worked, but it seems not all of them have been as successful in addressing them.\nOf course, the pathing is considerably easier in a 2.5D game than a 3D one, although I don’t know why escorted NPCs wouldn’t have an optimal path pre-programmed into them in the first place.\nWhat I find a bigger problem with the escort mission is the way in which the story situation is so often handled ineptly. That first escort mission in RMR involved escorting baby aliens, who naturally wouldn’t know to run or to defend themselves if attacked by soldiers with lasers. But escort missions where armed adult warriors don’t defend themselves or even run away when attacked are just poorly designed, so it shouldn’t be a surprise if there are other problems with the implementation.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-03T15:00:00+00:00"
}