{
  "url": "https://voxday.net/2015/10/16/sjws-in-church-of-scotland/",
  "scraped_at": "2025-12-17T17:30:10.119428",
  "title": "SJWs in the Church of Scotland",
  "date_display": "October 16, 2015",
  "date_iso": "2015-10-16T08:11:00+00:00",
  "date_from_url": "2015-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here we not only see the consequences of entryism, but further evidence in support of the truism: <i>SJWs always lie</i>. In which David Robertson learns that he should have read the book <a href=\"https://theweeflea.wordpress.com/2015/10/06/the-scottgate-tapes-a-revealing-insight-into-the-current-state-of-the-church-of-scotland/\">before debating a Scottish wolf in sheep’s clothing</a>:</p><blockquote class=\"tr_bq\"><p> At one level I was excited. Because the church was packed with over 250 people on a midweek evening to discuss theology; because I liked Scott when I had met him previously and believed that he genuinely wanted to have an open discussion about these vital issues; because it was a great opportunity to speak the good news in a different context. But I was also aware there was something else going on. I won’t go into details but I was under considerable pressure to back off and indeed even to give up and walk away. Even as I walked into the church I sensed not only the sense of anticipation but also the hostility from some, and also a strange sense that something was wrong.</p><p>This was made worse when I went into the vestry and met with Scott and Rev John Chalmers, the former Moderator who was there to replace the current Moderator, Rev Angus Morrison, who had called off because of a sore throat. John informed me at 7:25pm that the event would not be recorded. I was somewhat surprised at this because in setting up the event we had offered to film it and we were assured that there was no need to do so because the Church would do so and put it online.   This was an important aspect of the evening as this was a public discussion about subjects of vital importance to the whole church, and rather than rely on out of context quotes and sound bites reported on social media, it was important that people could hear and see the whole debate for themselves.(the interest and demand from people from people has been phenomenal). So I insisted that it be recorded and they agreed.</p><p>We went out, had the debate which went much as I had expected. Scott denied the Bible, called the atoning work of Christ on the cross barbaric (and Calvinist!) and at the end suggested that the future of the Church in Scotland rested on leadership styles like the Pope and the Archbishop of Canterbury as well as ‘mindfulness’.  I did my best to answer him in as biblical and gracious a way as possible. (I accept that I got some things wrong, said some things in a wrong way, wish I had said others,  and sometimes let my tongue run away with things-  God have mercy on me, a sinner).  My concern was for Scott and also for those who hear him preach, that he would turn away from his heresy and man-made gospel which is no gospel at all.   At this point I would normally suggest that you go to the video and judge for yourselves. Except even as I write, the video has been destroyed…. I was informed on the Thursday that the video would not be put online because I had hurt Scott’s feelings by suggesting that I would excommunicate him if he were a member of my church.   He also thought that it would not be a good witness, and he did not want that statement put online (ironically of course it was put on line immediately and tweeted all over the place by some of his supporters).  He informed me today, after further correspondence that he had instructed that the tapes be destroyed.</p><p>Why destroy the tapes? What was so incriminating on them?  It was not to<br> preserve Scott’s hurt feelings. Nor was it because they are concerned<br> about Christian witness.</br></br></p><p>This quote from the following letter I received from a life long Church of Scotland couple helps explain why: “<i>We<br> too were horrified to learn in March of Mr. McKenna’s denial of the<br> atonement. We protested to Edinburgh Presbytery expecting disciplinary<br> action. None was forthcoming and we felt made to feel wrong for<br> mentioning this fundamental aspect of the faith. We fear that Mr.<br> McKenna is not only risking God’s judgement on himself but also on his<br> congregation and the rest of us for doing nothing.”</br></br></br></br></br></br></i></p><p>The<br> unpalatable truth for evangelicals and traditional Presbyterians is that<br> Scott McKenna is not on the eccentric fringes of the Church of<br> Scotland. He is one of its mainstream leaders who I suspect is being<br> lined up for higher office. To have such a man openly and publicly<br> teach such heresy (which itself is against the standards and teachings<br> of the C of S) would be the last straw for many such people. So in order<br> to do damage limitation, and prevent more people joining the growing<br> exodus from the C of S, they decided to try and bury the evidence.</br></br></br></br></br></br></br></br></p></blockquote><p>This is why you ALWAYS record interviews and debates YOURSELF. ALWAYS. No exceptions. It won’t prevent the media from cherry-picking any mistakes or controversies and making the most of them, but it will prevent them from lying about what you have said and hiding the mistakes and infelicities of their own side.</p><p>David Robertson made the mistake that most people make when dealing with SJWs. He fucked up; he trusted them. But SJWs always lie! You cannot trust them, you cannot trust <i>one single thing</i> they say.</p><p>The problem is that until recently, no one who has dealt with an SJW and been played for a fool has seen the pattern, much less explained it to anyone else. That’s why it is important to understand the pattern and spread the word about it; SJWs are a civilization-wide menace as Western civilization is under massive assault by the servitors of social justice.</p><p>So that is a prime directive. ALWAYS RECORD ALL INTERACTIONS WITH SJWs. Because First Law of SJW. If the law requires their permission and they won’t grant it, then don’t talk to them. I’ve put this into practice myself, as whenever I get a request for an interview these days, I inform them that I will be recording it myself.</p><p>UPDATE: Fortunately, someone recorded the audio and <a href=\"https://theweeflea.wordpress.com/2015/10/08/a-theological-conversation-with-scott-mckenna/#more-1819\">provided a transcript</a>. And it is no wonder that the SJWs in the Church of Scotland tried to erase Scott McKenna’s words. They clearly demonstrate that he isn’t a Christian and he should be excommunicated from the Church without any need for further discussion.</p><blockquote class=\"tr_bq\"><p> I was talking about penal substitutionary atonement which is the notion that, in order to satisfy the wrath, the anger of God who had been offended by the wrath of God, that Jesus had to die as a blood sacrifice to pay for this sin, in order to satisfy the wrath of God. Now I would be saying that I think this leaves us with a fairly despotic… despot of a god; a barbaric god who is vindictive and immoral. Now this is not unique to me. This is not radical theology. You will find this theology in numerous places including a number of evangelicals.</p></blockquote><p>That may not be radical theology, but it also isn’t Christian theology. And while some “evangelicals” do subscribe to it, they are not evangelical Christians, they are atheist evangelicals in the mode of Richard Dawkins.</p></div>",
  "content_text": "Here we not only see the consequences of entryism, but further evidence in support of the truism:\nSJWs always lie\n. In which David Robertson learns that he should have read the book\nbefore debating a Scottish wolf in sheep’s clothing\n:\nAt one level I was excited. Because the church was packed with over 250 people on a midweek evening to discuss theology; because I liked Scott when I had met him previously and believed that he genuinely wanted to have an open discussion about these vital issues; because it was a great opportunity to speak the good news in a different context. But I was also aware there was something else going on. I won’t go into details but I was under considerable pressure to back off and indeed even to give up and walk away. Even as I walked into the church I sensed not only the sense of anticipation but also the hostility from some, and also a strange sense that something was wrong.\nThis was made worse when I went into the vestry and met with Scott and Rev John Chalmers, the former Moderator who was there to replace the current Moderator, Rev Angus Morrison, who had called off because of a sore throat. John informed me at 7:25pm that the event would not be recorded. I was somewhat surprised at this because in setting up the event we had offered to film it and we were assured that there was no need to do so because the Church would do so and put it online.   This was an important aspect of the evening as this was a public discussion about subjects of vital importance to the whole church, and rather than rely on out of context quotes and sound bites reported on social media, it was important that people could hear and see the whole debate for themselves.(the interest and demand from people from people has been phenomenal). So I insisted that it be recorded and they agreed.\nWe went out, had the debate which went much as I had expected. Scott denied the Bible, called the atoning work of Christ on the cross barbaric (and Calvinist!) and at the end suggested that the future of the Church in Scotland rested on leadership styles like the Pope and the Archbishop of Canterbury as well as ‘mindfulness’.  I did my best to answer him in as biblical and gracious a way as possible. (I accept that I got some things wrong, said some things in a wrong way, wish I had said others,  and sometimes let my tongue run away with things-  God have mercy on me, a sinner).  My concern was for Scott and also for those who hear him preach, that he would turn away from his heresy and man-made gospel which is no gospel at all.   At this point I would normally suggest that you go to the video and judge for yourselves. Except even as I write, the video has been destroyed…. I was informed on the Thursday that the video would not be put online because I had hurt Scott’s feelings by suggesting that I would excommunicate him if he were a member of my church.   He also thought that it would not be a good witness, and he did not want that statement put online (ironically of course it was put on line immediately and tweeted all over the place by some of his supporters).  He informed me today, after further correspondence that he had instructed that the tapes be destroyed.\nWhy destroy the tapes? What was so incriminating on them?  It was not to\npreserve Scott’s hurt feelings. Nor was it because they are concerned\nabout Christian witness.\nThis quote from the following letter I received from a life long Church of Scotland couple helps explain why: “\nWe\ntoo were horrified to learn in March of Mr. McKenna’s denial of the\natonement. We protested to Edinburgh Presbytery expecting disciplinary\naction. None was forthcoming and we felt made to feel wrong for\nmentioning this fundamental aspect of the faith. We fear that Mr.\nMcKenna is not only risking God’s judgement on himself but also on his\ncongregation and the rest of us for doing nothing.”\nThe\nunpalatable truth for evangelicals and traditional Presbyterians is that\nScott McKenna is not on the eccentric fringes of the Church of\nScotland. He is one of its mainstream leaders who I suspect is being\nlined up for higher office. To have such a man openly and publicly\nteach such heresy (which itself is against the standards and teachings\nof the C of S) would be the last straw for many such people. So in order\nto do damage limitation, and prevent more people joining the growing\nexodus from the C of S, they decided to try and bury the evidence.\nThis is why you ALWAYS record interviews and debates YOURSELF. ALWAYS. No exceptions. It won’t prevent the media from cherry-picking any mistakes or controversies and making the most of them, but it will prevent them from lying about what you have said and hiding the mistakes and infelicities of their own side.\nDavid Robertson made the mistake that most people make when dealing with SJWs. He fucked up; he trusted them. But SJWs always lie! You cannot trust them, you cannot trust\none single thing\nthey say.\nThe problem is that until recently, no one who has dealt with an SJW and been played for a fool has seen the pattern, much less explained it to anyone else. That’s why it is important to understand the pattern and spread the word about it; SJWs are a civilization-wide menace as Western civilization is under massive assault by the servitors of social justice.\nSo that is a prime directive. ALWAYS RECORD ALL INTERACTIONS WITH SJWs. Because First Law of SJW. If the law requires their permission and they won’t grant it, then don’t talk to them. I’ve put this into practice myself, as whenever I get a request for an interview these days, I inform them that I will be recording it myself.\nUPDATE: Fortunately, someone recorded the audio and\nprovided a transcript\n. And it is no wonder that the SJWs in the Church of Scotland tried to erase Scott McKenna’s words. They clearly demonstrate that he isn’t a Christian and he should be excommunicated from the Church without any need for further discussion.\nI was talking about penal substitutionary atonement which is the notion that, in order to satisfy the wrath, the anger of God who had been offended by the wrath of God, that Jesus had to die as a blood sacrifice to pay for this sin, in order to satisfy the wrath of God. Now I would be saying that I think this leaves us with a fairly despotic… despot of a god; a barbaric god who is vindictive and immoral. Now this is not unique to me. This is not radical theology. You will find this theology in numerous places including a number of evangelicals.\nThat may not be radical theology, but it also isn’t Christian theology. And while some “evangelicals” do subscribe to it, they are not evangelical Christians, they are atheist evangelicals in the mode of Richard Dawkins.",
  "tags": [
    "Christianity",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-16T07:11:00+00:00"
}