{
  "url": "https://voxday.net/2015/10/02/the-90m-crash-of-star-citizen/",
  "scraped_at": "2025-12-17T17:28:41.372796",
  "title": "The $90M crash of Star Citizen",
  "date_display": "October 2, 2015",
  "date_iso": "2015-10-02T08:47:00+00:00",
  "date_from_url": "2015-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lizzy Finnegan <a href=\"http://www.escapistmagazine.com/articles/view/features/14695-Star-Citizen-Controversy-Reaches-a-Boiling-Point\">opens the floodgates</a> on what is looking like one of the biggest crash-and-burns in the game industry since 38 Studios and Flagship, if not Atari’s ET.</p><blockquote class=\"tr_bq\"><p> Crowdfunding in general has seen a harsh decline in consumer trust in the past year, particularly when more prominent names are behind the projects. Mighty No. 9 has seen repeated delays, and fans voiced concerns when Shenmue 3 reopened crowdfunding after more than tripling their initial goal.</p><p>On September 22, independent developer Derek Smart penned a lengthy blog post that called into question Star Citizen, a title from game designer and producer Chris Roberts that was successfully funded on Kickstarter, raising over $2 million through the popular crowdfunding website. The game raised over $89 million total through a variety of sources, and remains the most crowdfunded video game project of all time.</p><p>Smart has been regularly critical of Roberts’ company Cloud Imperium Games, subsidiary Roberts Space Industries, and the development of Star Citizen, writing a total of five bulky blog posts since July. In these posts, Smart questions the allocation of funds, delays in the game’s release, changes to the format and features, silent changes to the Terms of Service agreement, and the ability for the company to produce the game at all.</p><p>Not all backers share Smart’s concerns, with a Change.org petition demanding that Smart “immediately desist in your ongoing actions against “RSI” (CIG) and Star Citizen.” The petition has garnered over 2,000 signatures.</p><p>In August, Smart wrote of his intention to send a “demand letter” to Cloud Imperium Games insisting on a “complete forensic accounting” of the money that has been spent on the game, as well as a solid release date and a refund option for anyone who wants one. Smart offered to pay for the forensic accounting out of his own pocket. In addition, he said that failure to deliver on any of those demands would lead to the immediate filing of a class-action lawsuit. That demand letter was sent on August 21.</p><p>Lawyers for CIG reportedly responded in a letter, which Smart shared online, stating that Smart had been a backer for the project, contributing $250 in 2012. The letter continued, stating that Smart “commenced his defamatory actions in early July 2015 on his blog – without any basis or backup, and with many links to his own game in development – that the “Star Citizen” project was a fraud and that it was never going to be delivered.” The money that Smart contributed to the project had previously been refunded to him, a refund that was not requested but rather initiated by CIG. The letter then points to Smart’s career and financial issues, accuses him of “desperate efforts to harm [Star Citizen] for his own publicity gains,” and concluded with the assertion that Smart has no legal basis and the demands were being rejected.</p><p>One major point of concern includes the seemingly silent alterations to the Terms of Service. In total, a revision to the Terms of Service includes 178 removals and 199 additions, and was instated after the initial release window for Star Citizen had already passed. The original ToS that backers agreed to when contributing the project was ToS v1.1 listed on the RSI website, and stated that if the game failed to be delivered within 12 months of the original Kickstarter estimated delivery date, refunds would be available. At the time, the project held a November 2014 release date, making the non-delivery period November 2015. This was changed on February 1, 2015 to ToS v1.2 to reflect a new timeframe of 18 months. The anticipated delivery date had also changed at this time, to the end of 2016.</p><p>“This company was given millions of dollars to deliver a product. They have not delivered that product. And in all likelihood, the company – and project – will both fail before they even get to delivering even 50% of what’s promised,” Smart asserted in his most recent post. “There isn’t a single pro developer on this planet, who after looking at what has thus far been delivered, compared to what was promised up to $65m funded, will say that they can deliver this product within the next three years.”</p></blockquote><p>As it happens, I have been casually acquainted with Chris Roberts since the <i>Wing Commander </i>days and I consider him to be one of the game design greats. Along with Richard Garriott, John Romero, and Steve Fawkner, he is one of my game design heroes. I don’t merely like and respect Chris, I look up to him. The five or six hours I spent talking with him, John Romero, and Epic’s current audio director over drinks at the Santa Clara Westin one evening was one of the most fascinating, informative, and educational experiences of my life… and Chris paid the entire $700+ bill himself. I am still an Origin fan and <i>Wing Commander</i> is one of my all-time favorite games; I even gave Ender a fancy joystick last Christmas just so he could play through the first two games and the secret missions, which he greatly enjoyed doing. I was absolutely delighted when I heard that <i>Star Citizen</i> was in the works.</p><p>As it happens, I also had the responsibility of going through Chris’s plans in great detail when <i>Star Citizen</i> was still a <i>Wing Commander</i> reboot with a license from EA and a $25M budget. I ran into one of the guys from the fund this summer and we talked about whether the top man’s decision to reject it had been a mistake in light of Chris’s unprecedented crowdsourcing success; it is now looking as if the decision to not fund the game <i>may </i>have been the right call after all. I strongly recommended that we do it; I still think that an updated <i>Wing Commander</i> would have been hugely successful as it was originally conceived.</p><p>At one point, Chris and I even discussed the idea of <i>Star Citizen</i> making use of my Psy-AI design for wingmen, but I didn’t seriously pursue it, partly because I couldn’t tell if Chris’s interest was genuine or if he was simply being polite, and partly because the new game was bigger in scope and I didn’t see the focus being on wingmen the way it was in <i>Wing Commander</i>. And as time has gone on, and the scope of the project continued to grow, my dev-spidey sense began to twitch just like every other experienced producer’s has even though I wasn’t paying close attention to it anymore.</p><p><i>“Without disrespect to anyone, I’m just going to say it: it is my opinion that, this game, as has been pitched, will never get made. Ever. There isn’t a single publisher or developer on this planet who could build this game as pitched, let alone for anything less than $150 million. The original vision which I backed in 2012? Yes, that was totally doable. This new vision? Not a chance. The technical scope of this game surpasses GTAV, not to mention the likes of Halo. Do you have any idea what those games cost to make and how long they took? Do you know how many games which cost $50 million to make took almost five years to release? And they were nowhere [as big] in scope as Star Citizen?”</i> <br> – Derek Smart, <a href=\"http://www.dereksmart.org/2015/07/interstellar-citizens/\">6 July 2015</a></br></p><p>Every producer and executive producer knows the feeling of a project that is beginning to slip its date. And every producer and executive producer learns to distinguish between a game that is going to be late and a game that is simply never going to be the game it was promised to be. Unfortunately, when seen from the outside at this point, <i>Star Citizen</i> could not look more like the latter if it was called <i>Battlecruiser 2015 AD</i>.</p><p>Derek Smart has a reputation for spectacular failure in the industry, but it’s not really a fair one, and more importantly, <a href=\"https://en.wikipedia.org/wiki/Battlecruiser_3000AD\">that particular failure</a> took place a long time ago. Nor was it anywhere nearly as bad as most people who have only heard about it secondhand tend to believe. And one very significant thing that the <i>Star Citizen</i> defenders are neglecting to note is that besides David Braben, there is no one in the industry who is <a href=\"http://www.dereksmart.org/2015/09/star-citizen-the-long-con/\">better suited to recognize the danger signs</a> of a large-scale space combat development project going awry than Derek. Now others are starting to look more closely into the situation, <i>Forbes</i>, for one, and unfortunately, <a href=\"https://robertsspaceindustries.com/comm-link/transmission/14979-Chairmans-Response-To-The-Escapist\">Chris Roberts’s response</a> to Smart’s observations and Finnigan’s article sounds a lot more like messenger-killing than allaying what increasingly appear to be substantive fears for what has become a gargantuan project.</p><p>The problem, I suspect, is not uncommon in the game industry. Chris is a visionary and a brilliant game designer. He is not a producer despite having successfully produced games in the past. But as too many developers have done before him, he appears to have effectively combined the lead designer’s role with the lead producer’s role into a single Game Director’s role for which he and many other designers – including me – are temperamentally unsuited, and as a consequence the project appears to have gone off the rails as a direct result of too much money combined with too many good ideas and too little focus on actually implementing those ideas and getting things done.</p><p>One thing game developers scraping by and wishing for more resources need to recognize is that funding is as much problem as panacea. Just as the crude state of early graphics technology partially dictated the gameplay and made it easier to focus by virtue of its limitations, a lack of money forces the development focus that is always needed to complete a project. Too much money means no strict externally imposed limitations, and if those limitations are not internally imposed by the producer, the project will tend to grow in scope and scale before collapsing.</p><p>I sincerely hope that’s not the case with <i>Star Citizen</i>. The success of <i>Star Citizen</i> after such a brilliant crowdfunding campaign would be absolutely wonderful for the entire industry and could launch a much-needed new era of creativity and innovation. The success of <i>Star Citizen</i> is in the material interest of every professional game developer. But after more than two decades in the game industry, I’ve learned to recognize the danger signs of a derailing development project and more than a few of them are observable around RSI of late.</p></div>",
  "content_text": "Lizzy Finnegan\nopens the floodgates\non what is looking like one of the biggest crash-and-burns in the game industry since 38 Studios and Flagship, if not Atari’s ET.\nCrowdfunding in general has seen a harsh decline in consumer trust in the past year, particularly when more prominent names are behind the projects. Mighty No. 9 has seen repeated delays, and fans voiced concerns when Shenmue 3 reopened crowdfunding after more than tripling their initial goal.\nOn September 22, independent developer Derek Smart penned a lengthy blog post that called into question Star Citizen, a title from game designer and producer Chris Roberts that was successfully funded on Kickstarter, raising over $2 million through the popular crowdfunding website. The game raised over $89 million total through a variety of sources, and remains the most crowdfunded video game project of all time.\nSmart has been regularly critical of Roberts’ company Cloud Imperium Games, subsidiary Roberts Space Industries, and the development of Star Citizen, writing a total of five bulky blog posts since July. In these posts, Smart questions the allocation of funds, delays in the game’s release, changes to the format and features, silent changes to the Terms of Service agreement, and the ability for the company to produce the game at all.\nNot all backers share Smart’s concerns, with a Change.org petition demanding that Smart “immediately desist in your ongoing actions against “RSI” (CIG) and Star Citizen.” The petition has garnered over 2,000 signatures.\nIn August, Smart wrote of his intention to send a “demand letter” to Cloud Imperium Games insisting on a “complete forensic accounting” of the money that has been spent on the game, as well as a solid release date and a refund option for anyone who wants one. Smart offered to pay for the forensic accounting out of his own pocket. In addition, he said that failure to deliver on any of those demands would lead to the immediate filing of a class-action lawsuit. That demand letter was sent on August 21.\nLawyers for CIG reportedly responded in a letter, which Smart shared online, stating that Smart had been a backer for the project, contributing $250 in 2012. The letter continued, stating that Smart “commenced his defamatory actions in early July 2015 on his blog – without any basis or backup, and with many links to his own game in development – that the “Star Citizen” project was a fraud and that it was never going to be delivered.” The money that Smart contributed to the project had previously been refunded to him, a refund that was not requested but rather initiated by CIG. The letter then points to Smart’s career and financial issues, accuses him of “desperate efforts to harm [Star Citizen] for his own publicity gains,” and concluded with the assertion that Smart has no legal basis and the demands were being rejected.\nOne major point of concern includes the seemingly silent alterations to the Terms of Service. In total, a revision to the Terms of Service includes 178 removals and 199 additions, and was instated after the initial release window for Star Citizen had already passed. The original ToS that backers agreed to when contributing the project was ToS v1.1 listed on the RSI website, and stated that if the game failed to be delivered within 12 months of the original Kickstarter estimated delivery date, refunds would be available. At the time, the project held a November 2014 release date, making the non-delivery period November 2015. This was changed on February 1, 2015 to ToS v1.2 to reflect a new timeframe of 18 months. The anticipated delivery date had also changed at this time, to the end of 2016.\n“This company was given millions of dollars to deliver a product. They have not delivered that product. And in all likelihood, the company – and project – will both fail before they even get to delivering even 50% of what’s promised,” Smart asserted in his most recent post. “There isn’t a single pro developer on this planet, who after looking at what has thus far been delivered, compared to what was promised up to $65m funded, will say that they can deliver this product within the next three years.”\nAs it happens, I have been casually acquainted with Chris Roberts since the\nWing Commander\ndays and I consider him to be one of the game design greats. Along with Richard Garriott, John Romero, and Steve Fawkner, he is one of my game design heroes. I don’t merely like and respect Chris, I look up to him. The five or six hours I spent talking with him, John Romero, and Epic’s current audio director over drinks at the Santa Clara Westin one evening was one of the most fascinating, informative, and educational experiences of my life… and Chris paid the entire $700+ bill himself. I am still an Origin fan and\nWing Commander\nis one of my all-time favorite games; I even gave Ender a fancy joystick last Christmas just so he could play through the first two games and the secret missions, which he greatly enjoyed doing. I was absolutely delighted when I heard that\nStar Citizen\nwas in the works.\nAs it happens, I also had the responsibility of going through Chris’s plans in great detail when\nStar Citizen\nwas still a\nWing Commander\nreboot with a license from EA and a $25M budget. I ran into one of the guys from the fund this summer and we talked about whether the top man’s decision to reject it had been a mistake in light of Chris’s unprecedented crowdsourcing success; it is now looking as if the decision to not fund the game\nmay\nhave been the right call after all. I strongly recommended that we do it; I still think that an updated\nWing Commander\nwould have been hugely successful as it was originally conceived.\nAt one point, Chris and I even discussed the idea of\nStar Citizen\nmaking use of my Psy-AI design for wingmen, but I didn’t seriously pursue it, partly because I couldn’t tell if Chris’s interest was genuine or if he was simply being polite, and partly because the new game was bigger in scope and I didn’t see the focus being on wingmen the way it was in\nWing Commander\n. And as time has gone on, and the scope of the project continued to grow, my dev-spidey sense began to twitch just like every other experienced producer’s has even though I wasn’t paying close attention to it anymore.\n“Without disrespect to anyone, I’m just going to say it: it is my opinion that, this game, as has been pitched, will never get made. Ever. There isn’t a single publisher or developer on this planet who could build this game as pitched, let alone for anything less than $150 million. The original vision which I backed in 2012? Yes, that was totally doable. This new vision? Not a chance. The technical scope of this game surpasses GTAV, not to mention the likes of Halo. Do you have any idea what those games cost to make and how long they took? Do you know how many games which cost $50 million to make took almost five years to release? And they were nowhere [as big] in scope as Star Citizen?”\n– Derek Smart,\n6 July 2015\nEvery producer and executive producer knows the feeling of a project that is beginning to slip its date. And every producer and executive producer learns to distinguish between a game that is going to be late and a game that is simply never going to be the game it was promised to be. Unfortunately, when seen from the outside at this point,\nStar Citizen\ncould not look more like the latter if it was called\nBattlecruiser 2015 AD\n.\nDerek Smart has a reputation for spectacular failure in the industry, but it’s not really a fair one, and more importantly,\nthat particular failure\ntook place a long time ago. Nor was it anywhere nearly as bad as most people who have only heard about it secondhand tend to believe. And one very significant thing that the\nStar Citizen\ndefenders are neglecting to note is that besides David Braben, there is no one in the industry who is\nbetter suited to recognize the danger signs\nof a large-scale space combat development project going awry than Derek. Now others are starting to look more closely into the situation,\nForbes\n, for one, and unfortunately,\nChris Roberts’s response\nto Smart’s observations and Finnigan’s article sounds a lot more like messenger-killing than allaying what increasingly appear to be substantive fears for what has become a gargantuan project.\nThe problem, I suspect, is not uncommon in the game industry. Chris is a visionary and a brilliant game designer. He is not a producer despite having successfully produced games in the past. But as too many developers have done before him, he appears to have effectively combined the lead designer’s role with the lead producer’s role into a single Game Director’s role for which he and many other designers – including me – are temperamentally unsuited, and as a consequence the project appears to have gone off the rails as a direct result of too much money combined with too many good ideas and too little focus on actually implementing those ideas and getting things done.\nOne thing game developers scraping by and wishing for more resources need to recognize is that funding is as much problem as panacea. Just as the crude state of early graphics technology partially dictated the gameplay and made it easier to focus by virtue of its limitations, a lack of money forces the development focus that is always needed to complete a project. Too much money means no strict externally imposed limitations, and if those limitations are not internally imposed by the producer, the project will tend to grow in scope and scale before collapsing.\nI sincerely hope that’s not the case with\nStar Citizen\n. The success of\nStar Citizen\nafter such a brilliant crowdfunding campaign would be absolutely wonderful for the entire industry and could launch a much-needed new era of creativity and innovation. The success of\nStar Citizen\nis in the material interest of every professional game developer. But after more than two decades in the game industry, I’ve learned to recognize the danger signs of a derailing development project and more than a few of them are observable around RSI of late.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-02T07:47:00+00:00"
}