{
  "url": "https://voxday.net/2015/10/07/the-collapse-of-star-citizen/",
  "scraped_at": "2025-12-17T17:29:12.861816",
  "title": "The collapse of Star Citizen",
  "date_display": "October 7, 2015",
  "date_iso": "2015-10-07T07:40:00+00:00",
  "date_from_url": "2015-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Derek Smart <a href=\"http://www.dereksmart.com/2015/10/star-citizen-the-endgame/\">contemplates the inevitable end game</a> of a project that appears to be in severe distress:</p><blockquote class=\"tr_bq\"><p> Last week, The Escapist magazine wrote a <a href=\"http://www.escapistmagazine.com/articles/view/video-games/features/14715-CIG-Employees-Talk-Star-Citizen-and-the-State-of-the-Company\" rel=\"noopener\" target=\"_blank\">scathing investigative report</a> (follow-up <a href=\"http://www.escapistmagazine.com/videos/view/escapist-podcast/57500-Crowdfunding-Podcast\" rel=\"noopener\" target=\"_blank\">podcast</a>) into this project. Something that no other media outlet had done before regarding this project. As they have said, I was <b>not</b><br> their source. In fact, only an incompetent media person would use me as<br> a source. Given how close I am to all of this, the fact that I could<br> not be regarded as an unbiased source even if I swore on a stack of<br> Bibles to be unbiased etc.</br></br></br></br></p><p>For the purposes of full disclosure: What I <i>did</i> do, as I’ve been doing since July, was made contact with some mainstream (<i>names withheld as per legal</i>) media sources, trying to get them to investigate this project. This was as per my July 10th blog, <a href=\"http://www.dereksmart.org/2015/07/interstellar-discourse/\" rel=\"noopener\" target=\"_blank\">Interstellar Discourse</a><br> in which, right at the top, I had called for the investigation of this<br> project and all its creators. This was because I had already been made<br> aware of most of what is now coming to light as portrayed in The<br> Escapist article.</br></br></br></br></p><p>As part of that effort, I gave them some of my credible sources,<br> along with an overview of what I had uncovered and why I simply wasn’t<br> the one to investigate this any further, due in part by information that<br> I had access to and which was better off being in the hands of those<br> same people (the media) who helped hype this project to what it is<br> today.</br></br></br></br></br></p><p>I was wrong in making this decision and thinking that anything would come from it. They <i>all</i> chose to bury the story….</p><p>My question is that, with all the numerous articles out there,<br> interviews, visits, face time etc. Why is it that nobody wants to ask<br> the tough questions about this project? Primary question being, where<br> did <b>ALL</b> this money go? We have pretty much nothing to show for it – four years later.</br></br></br></p><p>In response to the article, Chris Roberts, in continuing the downward trend to disaster, wrote a <a href=\"https://robertsspaceindustries.com/comm-link/transmission/14979-Chairmans-Response-To-The-Escapist\" rel=\"noopener\" target=\"_blank\">scathing diatribe</a><br> that, on the face of it, looks like you’d have to be high to unleash<br> that sort of tirade into the public domain. From the CEO of a $90m+<br> company no less. And clearly it wasn’t vetted by legal (LOL!! that would<br> be Ortwin). It’s a Gold mine of actionable legal liability. And all it<br> did was lend credence to some of the things being said behind closed<br> doors about him, and which were now coming to light via these sources<br> talking to the media.</br></br></br></br></br></br></br></p><p>The gist of it was that <i>“Derek Smart is bad, this was all his fault, and he was the puppet master”</i>.<br> Oh, and GamerGate. He mentions me a total of 20 times. The author of<br> the article got a single mention. And I didn’t even write the damn thing.</br></br></p><p>Sound familiar? Yes, that’s the blame game.</p></blockquote><p>I was concerned about Star Citizen about a year ago, but I wasn’t half as convinced that the project was on the verge of collapse by Derek Smart as I was by Chris Roberts’s disastrous and very poorly considered response to Derek’s questions. What Chris should have done, what I advise him to do, is to invite Derek to visit and see how development is going for himself. Give him a personal tour. Explain to him how well things are going and how good the game is going to be. Then do the same thing with Lizzy and anyone else The Escapist is willing to send.</p><p>This is a GOLDEN opportunity to show off and sell Star Citizen. Instead, Chris and his team have reacted if they have something radioactive to hide. They have reacted as if they are on the verge of being caught red-handed. There is absolutely no reason to react with anger, lengthy diatribes, and legal threats to someone who has doubts about how your project is going.</p><p>Whoever is advising Chris is going about it the completely wrong way. I know both Chris and David, and when I get the time I’m going to give them a call and urge them to rethink RSI’s response to critics and doubters, because this simply is not the way to reassure anyone, not even the most sincere Star Citizen supporters and true believers.</p><p>And #GamerGate? Seriously? Derek Smart isn’t #GamerGate. I am #GamerGate as are many others who wish both Chris and Star Citizen well. I don’t know what that is supposed to be, other than an ill-advised attempt to dog-whistle corrupt game journos who didn’t do their job covering Star Citizen in the first place.</p><p>Derek is correct. None of this has ANYTHING to do with him. Like him or loathe him, his opinions and his history are irrelevant. All that matters is the very relevant observations he has made and the very pertinent questions he has raised. And for RSI to engage in <i>argumentum ad impertinens hominem</i> is not merely self-defeating bad public relations, it tends to call their own credibility, as well as the future of Star Citizen, into serious question.</p><p>Ultimately, Star Citizen may well prove to be another painful lesson in “Beware the Awesome” <a href=\"http://www.polygon.com/2012/11/1/3560318/homefront-kaos-studios-thq\">ala Homefront</a>:<br/></p><blockquote><p> Dave Schulman was a really good salesman at telling THQ what we could<br> deliver, and turning back to us to say, ‘Hey, sky’s the limit. Just pack<br> more features in. Make it great. Put as many bullet points as you can<br> on the back of the box.’ When Kaos turned that into a demo to show THQ, the ideas<br> practically sold themselves. THQ executives loved it,  and gave Kaos a<br> green light to complete the game. “Now beyond that initial preproduction phase,” said one producer,<br> “then you actually have to pay your dues. You have to actually make the<br> thing you’ve been promising. I think that’s where Dave Schulman’s<br> expertise fell short. He had promised so much that there was absolutely<br> no way we could deliver.”</br></br></br></br></br></br></br></br></br></p></blockquote><p>The damning phrase: <i>“We spent about a total of eight months of our production time making a<br> five minute demo that was … not an actual game. It was a very nice demo.<br> But it was all smoke and mirrors.”</br></br></i></p></div>",
  "content_text": "Derek Smart\ncontemplates the inevitable end game\nof a project that appears to be in severe distress:\nLast week, The Escapist magazine wrote a\nscathing investigative report\n(follow-up\npodcast\n) into this project. Something that no other media outlet had done before regarding this project. As they have said, I was\nnot\ntheir source. In fact, only an incompetent media person would use me as\na source. Given how close I am to all of this, the fact that I could\nnot be regarded as an unbiased source even if I swore on a stack of\nBibles to be unbiased etc.\nFor the purposes of full disclosure: What I\ndid\ndo, as I’ve been doing since July, was made contact with some mainstream (\nnames withheld as per legal\n) media sources, trying to get them to investigate this project. This was as per my July 10th blog,\nInterstellar Discourse\nin which, right at the top, I had called for the investigation of this\nproject and all its creators. This was because I had already been made\naware of most of what is now coming to light as portrayed in The\nEscapist article.\nAs part of that effort, I gave them some of my credible sources,\nalong with an overview of what I had uncovered and why I simply wasn’t\nthe one to investigate this any further, due in part by information that\nI had access to and which was better off being in the hands of those\nsame people (the media) who helped hype this project to what it is\ntoday.\nI was wrong in making this decision and thinking that anything would come from it. They\nall\nchose to bury the story….\nMy question is that, with all the numerous articles out there,\ninterviews, visits, face time etc. Why is it that nobody wants to ask\nthe tough questions about this project? Primary question being, where\ndid\nALL\nthis money go? We have pretty much nothing to show for it – four years later.\nIn response to the article, Chris Roberts, in continuing the downward trend to disaster, wrote a\nscathing diatribe\nthat, on the face of it, looks like you’d have to be high to unleash\nthat sort of tirade into the public domain. From the CEO of a $90m+\ncompany no less. And clearly it wasn’t vetted by legal (LOL!! that would\nbe Ortwin). It’s a Gold mine of actionable legal liability. And all it\ndid was lend credence to some of the things being said behind closed\ndoors about him, and which were now coming to light via these sources\ntalking to the media.\nThe gist of it was that\n“Derek Smart is bad, this was all his fault, and he was the puppet master”\n.\nOh, and GamerGate. He mentions me a total of 20 times. The author of\nthe article got a single mention. And I didn’t even write the damn thing.\nSound familiar? Yes, that’s the blame game.\nI was concerned about Star Citizen about a year ago, but I wasn’t half as convinced that the project was on the verge of collapse by Derek Smart as I was by Chris Roberts’s disastrous and very poorly considered response to Derek’s questions. What Chris should have done, what I advise him to do, is to invite Derek to visit and see how development is going for himself. Give him a personal tour. Explain to him how well things are going and how good the game is going to be. Then do the same thing with Lizzy and anyone else The Escapist is willing to send.\nThis is a GOLDEN opportunity to show off and sell Star Citizen. Instead, Chris and his team have reacted if they have something radioactive to hide. They have reacted as if they are on the verge of being caught red-handed. There is absolutely no reason to react with anger, lengthy diatribes, and legal threats to someone who has doubts about how your project is going.\nWhoever is advising Chris is going about it the completely wrong way. I know both Chris and David, and when I get the time I’m going to give them a call and urge them to rethink RSI’s response to critics and doubters, because this simply is not the way to reassure anyone, not even the most sincere Star Citizen supporters and true believers.\nAnd #GamerGate? Seriously? Derek Smart isn’t #GamerGate. I am #GamerGate as are many others who wish both Chris and Star Citizen well. I don’t know what that is supposed to be, other than an ill-advised attempt to dog-whistle corrupt game journos who didn’t do their job covering Star Citizen in the first place.\nDerek is correct. None of this has ANYTHING to do with him. Like him or loathe him, his opinions and his history are irrelevant. All that matters is the very relevant observations he has made and the very pertinent questions he has raised. And for RSI to engage in\nargumentum ad impertinens hominem\nis not merely self-defeating bad public relations, it tends to call their own credibility, as well as the future of Star Citizen, into serious question.\nUltimately, Star Citizen may well prove to be another painful lesson in “Beware the Awesome”\nala Homefront\n:\nDave Schulman was a really good salesman at telling THQ what we could\ndeliver, and turning back to us to say, ‘Hey, sky’s the limit. Just pack\nmore features in. Make it great. Put as many bullet points as you can\non the back of the box.’ When Kaos turned that into a demo to show THQ, the ideas\npractically sold themselves. THQ executives loved it,  and gave Kaos a\ngreen light to complete the game. “Now beyond that initial preproduction phase,” said one producer,\n“then you actually have to pay your dues. You have to actually make the\nthing you’ve been promising. I think that’s where Dave Schulman’s\nexpertise fell short. He had promised so much that there was absolutely\nno way we could deliver.”\nThe damning phrase:\n“We spent about a total of eight months of our production time making a\nfive minute demo that was … not an actual game. It was a very nice demo.\nBut it was all smoke and mirrors.”",
  "tags": [
    "#GamerGate",
    "games",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-07T06:40:00+00:00"
}