{
  "url": "https://voxday.net/2015/10/07/there-is-no-diversity-crisis-in-tec/",
  "scraped_at": "2025-12-17T17:29:14.704768",
  "title": "There is no diversity crisis in tech",
  "date_display": "October 7, 2015",
  "date_iso": "2015-10-07T15:46:00+00:00",
  "date_from_url": "2015-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Repeat it, understand it, grok it, live it. <a href=\"http://techraptor.net/content/there-is-no-diversity-crisis-in-tech-by-brian-hall\">There is no diversity crisis in tech</a>.</p><blockquote class=\"tr_bq\"><p> Repeat after me: there is no “diversity crisis” in Silicon Valley.<br> None. In fact, there is no crisis at all in Silicon Valley. Silicon<br> Valley is doing absolutely gangbusters. Apple has $200 billion in <a class=\"external\" href=\"http://money.cnn.com/2015/07/22/investing/apple-stock-cash-earnings/\" rel=\"nofollow noopener\" target=\"_blank\">cash reserves and equivalents</a> — and a market valuation of about $630 billion. Amazing. Facebook now garners <a class=\"external\" href=\"http://newsroom.fb.com/company-info/\" rel=\"nofollow noopener\" target=\"_blank\">a billion daily users</a>. This is a nearly unfathomable number. Google is worth nearly $450 billion and has $70 billion in cash on hand.</br></br></p><p>This is not a crisis. Silicon Valley is swimming in money and in<br> success. Uber is valued at around $50 billion. Companies like Airbnb are<br> remaking travel and lodging. Intel is moving forward into the global<br> Internet of Things market. South Korea’s Samsung just opened a giant<br> R&amp;D facility in the heart of Silicon Valley. Google and Facebook are<br> working to connect the entire world. Netflix is re-making how we<br> consume entertainment.</br></br></br></br></br></br></p><p>Silicon Valley is home to the next phase of the global auto industry.<br> Fintech and biotech are transforming banking and medicine. The success<br> of Silicon Valley is not due to diversity — or to any bias. Rather, to<br> brilliance, hard work, risk taking, big ideas and money.</br></br></br></p><p>Want to be part of this? Great! Follow the example of the millions<br> who came before you. Their parents made school a priority. They took<br> math and science classes, and did their homework every night. They<br> practiced ACT tests over and over. They enrolled in good schools and<br> focused on English, Political Science and Humanities.</br></br></br></br></p><p>Okay, that last bit is not true. They took computer programming,<br> engineering, chemistry — hard subjects that demand hard work. They then<br> left their home, their family, their community, and moved to Silicon<br> Valley. They worked hard, staying late night after night. They didn’t<br> blog, they didn’t let their skills go stale, they didn’t blame others<br> when not everything worked out exactly as hoped.<br> Are you doing all of these? Are you doing any of these? Do them!</br></br></br></br></br></br></p></blockquote><p>The “diversity crisis” is a fake crisis manufactured by SJW parasites who want to leech off the success of others. Tech doesn’t need more women. Tech doesn’t need more blacks, American Indians, Eskimos, walruses, penguins, or meerkats.</p><p>And, as the Impossibility of Social Justice Convergence predicts, as the observation of previous diversity crises will demonstrate, the continued success of tech actually depends upon IGNORING those who are attempting to sell the diversity crisis scam and actively RESISTING all of their “solutions”.</p></div>",
  "content_text": "Repeat it, understand it, grok it, live it.\nThere is no diversity crisis in tech\n.\nRepeat after me: there is no “diversity crisis” in Silicon Valley.\nNone. In fact, there is no crisis at all in Silicon Valley. Silicon\nValley is doing absolutely gangbusters. Apple has $200 billion in\ncash reserves and equivalents\n— and a market valuation of about $630 billion. Amazing. Facebook now garners\na billion daily users\n. This is a nearly unfathomable number. Google is worth nearly $450 billion and has $70 billion in cash on hand.\nThis is not a crisis. Silicon Valley is swimming in money and in\nsuccess. Uber is valued at around $50 billion. Companies like Airbnb are\nremaking travel and lodging. Intel is moving forward into the global\nInternet of Things market. South Korea’s Samsung just opened a giant\nR&D facility in the heart of Silicon Valley. Google and Facebook are\nworking to connect the entire world. Netflix is re-making how we\nconsume entertainment.\nSilicon Valley is home to the next phase of the global auto industry.\nFintech and biotech are transforming banking and medicine. The success\nof Silicon Valley is not due to diversity — or to any bias. Rather, to\nbrilliance, hard work, risk taking, big ideas and money.\nWant to be part of this? Great! Follow the example of the millions\nwho came before you. Their parents made school a priority. They took\nmath and science classes, and did their homework every night. They\npracticed ACT tests over and over. They enrolled in good schools and\nfocused on English, Political Science and Humanities.\nOkay, that last bit is not true. They took computer programming,\nengineering, chemistry — hard subjects that demand hard work. They then\nleft their home, their family, their community, and moved to Silicon\nValley. They worked hard, staying late night after night. They didn’t\nblog, they didn’t let their skills go stale, they didn’t blame others\nwhen not everything worked out exactly as hoped.\nAre you doing all of these? Are you doing any of these? Do them!\nThe “diversity crisis” is a fake crisis manufactured by SJW parasites who want to leech off the success of others. Tech doesn’t need more women. Tech doesn’t need more blacks, American Indians, Eskimos, walruses, penguins, or meerkats.\nAnd, as the Impossibility of Social Justice Convergence predicts, as the observation of previous diversity crises will demonstrate, the continued success of tech actually depends upon IGNORING those who are attempting to sell the diversity crisis scam and actively RESISTING all of their “solutions”.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-07T14:46:00+00:00"
}