{
  "url": "https://voxday.net/2015/10/05/they-should-have-started-with-hi/",
  "scraped_at": "2025-12-17T17:29:01.807380",
  "title": "They should have started with him",
  "date_display": "October 5, 2015",
  "date_iso": "2015-10-05T06:21:00+00:00",
  "date_from_url": "2015-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ben Bernanke says financial executives <a href=\"http://www.usatoday.com/story/news/politics/2015/10/04/ben-bernanke-execs-jail-great-recession-federal-reserve/72959402/\">should have been arrested</a> and charged with crimes:</p><blockquote class=\"tr_bq\"><p> With publication of his memoir, <i>The Courage to Act</i>, on<br> Tuesday by W.W. Norton &amp; Co., Bernanke has some thoughts about what<br> went right and what went wrong. For one thing, he says that more<br> corporate executives should have gone to jail for their misdeeds. The<br> Justice Department and other law-enforcement agencies focused on<br> indicting or threatening to indict financial firms, he notes, “but it<br> would have been my preference to have more investigation of individual<br> action, since obviously everything what went wrong or was illegal was<br> done by some individual, not by an abstract firm.”</br></br></br></br></br></br></br></br></p><p>He also offers a<br> detailed rebuttal to critics who argue the government could and should<br> have done more to rescue Lehman Brothers from bankruptcy in the worst<br> weekend of a tumultuous time. “We were very, very determined not to let<br> it collapse,” he says. “But we were out of bullets at that point.”</br></br></br></br></p><p>Still,<br> he does acknowledge some missteps by the Fed. Analysts were slow to<br> realize just how serious the economic downturn would become, and he<br> faults himself for not doing more to explain to Americans why it was in<br> their interests to rescue the financial firms that had helped cause it.</br></br></br></br></p></blockquote><p>Needless to say, I will be reading and reviewing this book in the near future. And I will be very, very, very surprised if Mr. Bernanke manages to convince me that he is doing anything except whitewash his record. The idea that it was essential to rescue the financial firms that are still preying on the American economy and weighing it down is simply nonsensical. The Federal Reserve didn’t succeed in anything except kicking the can down the road and ensure that the next crisis will be even more severe.</p></div>",
  "content_text": "Ben Bernanke says financial executives\nshould have been arrested\nand charged with crimes:\nWith publication of his memoir,\nThe Courage to Act\n, on\nTuesday by W.W. Norton & Co., Bernanke has some thoughts about what\nwent right and what went wrong. For one thing, he says that more\ncorporate executives should have gone to jail for their misdeeds. The\nJustice Department and other law-enforcement agencies focused on\nindicting or threatening to indict financial firms, he notes, “but it\nwould have been my preference to have more investigation of individual\naction, since obviously everything what went wrong or was illegal was\ndone by some individual, not by an abstract firm.”\nHe also offers a\ndetailed rebuttal to critics who argue the government could and should\nhave done more to rescue Lehman Brothers from bankruptcy in the worst\nweekend of a tumultuous time. “We were very, very determined not to let\nit collapse,” he says. “But we were out of bullets at that point.”\nStill,\nhe does acknowledge some missteps by the Fed. Analysts were slow to\nrealize just how serious the economic downturn would become, and he\nfaults himself for not doing more to explain to Americans why it was in\ntheir interests to rescue the financial firms that had helped cause it.\nNeedless to say, I will be reading and reviewing this book in the near future. And I will be very, very, very surprised if Mr. Bernanke manages to convince me that he is doing anything except whitewash his record. The idea that it was essential to rescue the financial firms that are still preying on the American economy and weighing it down is simply nonsensical. The Federal Reserve didn’t succeed in anything except kicking the can down the road and ensure that the next crisis will be even more severe.",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-05T05:21:00+00:00"
}