{
  "url": "https://voxday.net/2015/10/27/this-is-not-theoretical-proble/",
  "scraped_at": "2025-12-17T17:31:25.155285",
  "title": "This is not a theoretical matter",
  "date_display": "October 27, 2015",
  "date_iso": "2015-10-27T09:50:00+00:00",
  "date_from_url": "2015-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MD emails to tell of SJWs getting a friend coming under media assault for a Halloween costume:</p><blockquote class=\"tr_bq\"><p> SJWAL hit close to home today as a family friend was <a href=\"http://www.foxcarolina.com/story/30349647/decatur-teacher-apologizes-for-wearing-blackface\">FIRED from his teaching position</a> after posting a picture at a party in a harmless Kanye get-up. His wife being a ‘Kim with a bootay’ tag-a-long.</p><p>All hell broke loose when the pic was posted and he quickly lost his job and issued sort of an apology. From your material I believe this was still a wrong move.</p><p>Now, the media leads with the title of “Teacher apologizes for wearing blackface” instead of “Teacher fired for dressing as Kanye”</p><p>You’ve taught me to see through the rhetoric and never give them a tiny opportunity to redirect the narrative. He was apparently an amazing teacher and benefactor to all his students, who were mostly inner city. It’s blown to huge proportion now and experts are stating that he shouldn’t have been fired but “re-educated” on the issue of blackface.</p><p>What would be your tactics in handling this situation now that he’s dug himself into a little larger hole? Amazing to see your book come to life.</p></blockquote><p>I don’t know if it is true that the teacher lost his job – that seems unlikely given the teachers unions have made it all but impossible to actually fire a teacher for anything short of serial killing students – but the apology was absolutely the wrong move.</p><p>As I explained in SJWAL, the apology has been taken for a confession and is now being used to prosecute and further humiliate him. The correct thing to do would have been to inform the school that Halloween costumes often involve dressing up like celebrities and it would be racist to refuse to dress up like a black man. Then he should have arranged to have a picture taken in the classroom, dressed up like Kanye West and surrounded by his smiling black students.</p><p>Remember, always fight rhetoric with rhetoric. An apology is a form of dialectic, and we all know that the only thing replying to rhetoric with dialectic produces is more rhetoric.</p><p>Remember: never apologize.</p><p>And don’t even think about resorting to the stupid “I have never seen color in my life” bullshit that features in the guy’s craven, futile, “please don’t hit me” apology. If you’re not completely retarded, you see “color”. Even <i>the literally color-blind</i> see color in this regard. All that sort of statement amounts to is publicly declaring that you are not only a brainwashed coward, but there are five lights too.</p><p>As far as what he should do now, all I can say is: stop digging. Stop apologizing. Stop cringing and cowering. He chose his course out of fear and it has already metastasized in the media. Now he has to let the chosen scenario play out. If nothing else, he will serve as yet another cautionary tale demonstrating the foolishness of apologizing to SJWs.</p></div>",
  "content_text": "MD emails to tell of SJWs getting a friend coming under media assault for a Halloween costume:\nSJWAL hit close to home today as a family friend was\nFIRED from his teaching position\nafter posting a picture at a party in a harmless Kanye get-up. His wife being a ‘Kim with a bootay’ tag-a-long.\nAll hell broke loose when the pic was posted and he quickly lost his job and issued sort of an apology. From your material I believe this was still a wrong move.\nNow, the media leads with the title of “Teacher apologizes for wearing blackface” instead of “Teacher fired for dressing as Kanye”\nYou’ve taught me to see through the rhetoric and never give them a tiny opportunity to redirect the narrative. He was apparently an amazing teacher and benefactor to all his students, who were mostly inner city. It’s blown to huge proportion now and experts are stating that he shouldn’t have been fired but “re-educated” on the issue of blackface.\nWhat would be your tactics in handling this situation now that he’s dug himself into a little larger hole? Amazing to see your book come to life.\nI don’t know if it is true that the teacher lost his job – that seems unlikely given the teachers unions have made it all but impossible to actually fire a teacher for anything short of serial killing students – but the apology was absolutely the wrong move.\nAs I explained in SJWAL, the apology has been taken for a confession and is now being used to prosecute and further humiliate him. The correct thing to do would have been to inform the school that Halloween costumes often involve dressing up like celebrities and it would be racist to refuse to dress up like a black man. Then he should have arranged to have a picture taken in the classroom, dressed up like Kanye West and surrounded by his smiling black students.\nRemember, always fight rhetoric with rhetoric. An apology is a form of dialectic, and we all know that the only thing replying to rhetoric with dialectic produces is more rhetoric.\nRemember: never apologize.\nAnd don’t even think about resorting to the stupid “I have never seen color in my life” bullshit that features in the guy’s craven, futile, “please don’t hit me” apology. If you’re not completely retarded, you see “color”. Even\nthe literally color-blind\nsee color in this regard. All that sort of statement amounts to is publicly declaring that you are not only a brainwashed coward, but there are five lights too.\nAs far as what he should do now, all I can say is: stop digging. Stop apologizing. Stop cringing and cowering. He chose his course out of fear and it has already metastasized in the media. Now he has to let the chosen scenario play out. If nothing else, he will serve as yet another cautionary tale demonstrating the foolishness of apologizing to SJWs.",
  "tags": [
    "education",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-27T09:50:00+00:00"
}