{
  "url": "https://voxday.net/2015/10/19/what-state-is-tha/",
  "scraped_at": "2025-12-17T17:30:30.938869",
  "title": "What state is that?",
  "date_display": "October 19, 2015",
  "date_iso": "2015-10-19T09:06:00+00:00",
  "date_from_url": "2015-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Minnesota Governor Mark Dayton tells Minnesotans who prefer the real Minnesota <a href=\"http://whitegenocideproject.com/governor-tells-minnesotans-to-find-another-state-if-they-dont-like-african-immigration/\">to leave the state</a> if they don’t like living next door to squalid third-world Africans:</p><blockquote class=\"tr_bq\"><p> Governor Mark Dayton was one of the speakers at the NAACP Community Conversation, hosted in St. Cloud, Minnesota.</p><p>For several years now, St. Cloud has been one of the locations specifically targeted for “refugee resettlement”. The large influx of East African immigrants has caused racial tension between the White St. Cloud residents, and the East African immigrants.</p><p><i>“Look around you. This is Minnesota,”</i> he said. <i>“Minnesota is not like it was 30, 50 years ago. … This is Minnesota and you [Africans] have every right to be here. And anybody who cannot accept your right to be here, and this is Minnesota, should find another state.”</i></p><p>He described alternative views to his own as <i>“unacceptable, un-Minnesotan, illegal and immoral”.</i></p><p><i>“If you are that intolerant, if you are that much of a racist or a bigot, then find another state.” </i>said Dayton. <i>“Find a state where the minority population is 1 percent or whatever. It’s not that in Minnesota. It’s not going to be again. It’s not going to be that in St. Cloud, or Rochester or Worthington.”</i></p></blockquote><p>Where are they going to go? What would be the point? When I grew up in Minnesota, it was one of the whitest states in the country: 96.1 percent in 1980. First, aside from California or possibly Texas, there isn’t a state that can hold 100 million white Americans, which is about how many people would move to a state that was guaranteed to be Asian, Hispanic, and African-free. Second, even if a state is completely white, what is to prevent it from being invaded just like Minnesota and Germany have been invaded? Third, it is outrageous to state that alien invaders have the same right to be there as native citizens. They simply don’t, by any legal or moral standard.</p><p>History strongly suggests that Dayton is wrong. I can safely predict that the land presently called “Minnesota” will again feature a strong majority population with a minority population below five percent at some point in the future. After all, it already has <i>twice </i>within the past 165 years. All this imposed “refugee resettlement” means is that a lot of people are going to die and a lot of people are going to be forcibly expelled from the land. Whoever is willing to fight for it will hold it.</p><p>Where does Dayton think these homogeneous populations that he hates so much come from in the first place? Except in some extreme circumstances they don’t occur due to geography; mass migrations have taken place for millennia. They arise out of invasions, ethnic cleansings, and wars of the sort that are taking place right now everywhere from Myanmar to the Crimea. Of course, speaking as an American Indian from a tribe that bravely and repeatedly, and in the end, unsuccessfully battled the immigrants invading their land, I can also state with some authority that there is no guarantee the majority population that ends up living in that territory mostly unsullied by minorities will be of European descent.</p><p>For decades, Americans have assumed that all the terrible things that happened in Bangladesh and the Congo and China could not happen in the USA. And that assumption was true, mostly due to the halt in immigration in the 1920s. Now, thanks to diversity, labor mobility, the 1965 Immigration Reform Act, and the European Union, both the USA and Europe are going to see an insane amount of violence that will probably surpass the Holocaust and the Holodomor over the next three decades.</p><p>The lesson of history is very clear. <a href=\"https://www.rt.com/op-edge/318986-america-bomb-society-crisis/\">The killing season is coming</a>. And those with the eyes to see are well aware of it.</p><blockquote class=\"tr_bq\"><p> I am saying that all the ingredients are there for complete breakdown and large-scale deaths given the right initiating incident. I am saying that volatility is baked into the cake – even into the cake of what today looks and feels normal. I am saying that while it may be possible to keep loading box upon box of societal Semtex into the truck, given the right detonator the collapse will be swift, unstoppable and devastating.</p></blockquote><p>And when it comes, as it always does sooner or later, don’t think that the explosives or the truck were responsible. The blame lies with those who loaded it.</p></div>",
  "content_text": "Minnesota Governor Mark Dayton tells Minnesotans who prefer the real Minnesota\nto leave the state\nif they don’t like living next door to squalid third-world Africans:\nGovernor Mark Dayton was one of the speakers at the NAACP Community Conversation, hosted in St. Cloud, Minnesota.\nFor several years now, St. Cloud has been one of the locations specifically targeted for “refugee resettlement”. The large influx of East African immigrants has caused racial tension between the White St. Cloud residents, and the East African immigrants.\n“Look around you. This is Minnesota,”\nhe said.\n“Minnesota is not like it was 30, 50 years ago. … This is Minnesota and you [Africans] have every right to be here. And anybody who cannot accept your right to be here, and this is Minnesota, should find another state.”\nHe described alternative views to his own as\n“unacceptable, un-Minnesotan, illegal and immoral”.\n“If you are that intolerant, if you are that much of a racist or a bigot, then find another state.”\nsaid Dayton.\n“Find a state where the minority population is 1 percent or whatever. It’s not that in Minnesota. It’s not going to be again. It’s not going to be that in St. Cloud, or Rochester or Worthington.”\nWhere are they going to go? What would be the point? When I grew up in Minnesota, it was one of the whitest states in the country: 96.1 percent in 1980. First, aside from California or possibly Texas, there isn’t a state that can hold 100 million white Americans, which is about how many people would move to a state that was guaranteed to be Asian, Hispanic, and African-free. Second, even if a state is completely white, what is to prevent it from being invaded just like Minnesota and Germany have been invaded? Third, it is outrageous to state that alien invaders have the same right to be there as native citizens. They simply don’t, by any legal or moral standard.\nHistory strongly suggests that Dayton is wrong. I can safely predict that the land presently called “Minnesota” will again feature a strong majority population with a minority population below five percent at some point in the future. After all, it already has\ntwice\nwithin the past 165 years. All this imposed “refugee resettlement” means is that a lot of people are going to die and a lot of people are going to be forcibly expelled from the land. Whoever is willing to fight for it will hold it.\nWhere does Dayton think these homogeneous populations that he hates so much come from in the first place? Except in some extreme circumstances they don’t occur due to geography; mass migrations have taken place for millennia. They arise out of invasions, ethnic cleansings, and wars of the sort that are taking place right now everywhere from Myanmar to the Crimea. Of course, speaking as an American Indian from a tribe that bravely and repeatedly, and in the end, unsuccessfully battled the immigrants invading their land, I can also state with some authority that there is no guarantee the majority population that ends up living in that territory mostly unsullied by minorities will be of European descent.\nFor decades, Americans have assumed that all the terrible things that happened in Bangladesh and the Congo and China could not happen in the USA. And that assumption was true, mostly due to the halt in immigration in the 1920s. Now, thanks to diversity, labor mobility, the 1965 Immigration Reform Act, and the European Union, both the USA and Europe are going to see an insane amount of violence that will probably surpass the Holocaust and the Holodomor over the next three decades.\nThe lesson of history is very clear.\nThe killing season is coming\n. And those with the eyes to see are well aware of it.\nI am saying that all the ingredients are there for complete breakdown and large-scale deaths given the right initiating incident. I am saying that volatility is baked into the cake – even into the cake of what today looks and feels normal. I am saying that while it may be possible to keep loading box upon box of societal Semtex into the truck, given the right detonator the collapse will be swift, unstoppable and devastating.\nAnd when it comes, as it always does sooner or later, don’t think that the explosives or the truck were responsible. The blame lies with those who loaded it.",
  "tags": [
    "history",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-19T08:06:00+00:00"
}