{
  "url": "https://voxday.net/2015/10/16/you-heard-it-here-firs/",
  "scraped_at": "2025-12-17T17:30:13.468517",
  "title": "You heard it here first",
  "date_display": "October 16, 2015",
  "date_iso": "2015-10-16T15:21:00+00:00",
  "date_from_url": "2015-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From <a href=\"http://www.milobookclub.com/2015/10/15/mailvox-more-border-closures-coming/\">our Eastern European friends</a>:</p><blockquote class=\"tr_bq\"><p> It’s official, foreign relations minister Péter Szijjártó announced that tonight at midnight Croatian border will be shut down.</p></blockquote><p>UPDATE:</p><blockquote class=\"tr_bq\"><p> Funny thing is happening, probably this news really appeared first on<br> your blog in English, there is almost no coverage of this. Now it is 19:44, the announcement was at about 15.00 hungarian time. I was checking news pages many times today, both Hungarian and English/American. Now<br> it is on front page in the Hungarian ones, but it wasn’t like this a<br> few hours before, and for example on very popular liberal news page<br> ORIGO, you can barely see it between the first 10 bullshit/less<br> important news.</br></br></br></br></br></p><div></div><div> Just now it is on the front<br> page of CNN, hidden between a lot of other news, it is not even on the<br> front page of BBC, you can only find it if you search. Same with<br> Reuters, only if you search. One of the “news line” short news on<br> RT.com. For some reason, they are not enthusiastic covering this.</br></br></br></br></div><div></div><div> With<br> the serbian closure, it was all over the place, because people were<br> expecting riots and finger pointing poor treatment of migrants. They got a little of what they expected.</br></br></div><div></div><div> Croatian<br> interior minister Ranko Ostojic just announced that they will take<br> people to Slovenian border, and another Slovenian politician said that<br> they are prepared for the influx, until countries further north keep<br> their borders open (Germany). So they will basically continue the same organized transport of migrants to Germany, only through Slovenia. </br></br></br></br></div><div>  </div><div> I don’t expect riots, neither does mainstream media. So<br> they do not want to tell people, that Hungary just quietly but surely<br> stuck to its plan, closed the borders, and is not doing it<br> alone, but in cooperation with 4 other countries.</br></br></br></div><div></div><div> The<br> other day I wrote that Czech soldiers already arrived, Slovak soldiers<br> and policemen will arrive, and the Poles will probably help with<br> something also. Well, Ewa Kopacz Polish PM announced today, that they<br> are sending to Hungary 70 border police officials, many jeeps, including<br> 5 that have night vision devices built in.</br></br></br></br></br></div></blockquote><p>The coverage of the first border closing backfired on the multicultis. Nearly everyone applauded the Hungarian action. That’s why they’re keeping the cameras away from this one.</p></div>",
  "content_text": "From\nour Eastern European friends\n:\nIt’s official, foreign relations minister Péter Szijjártó announced that tonight at midnight Croatian border will be shut down.\nUPDATE:\nFunny thing is happening, probably this news really appeared first on\nyour blog in English, there is almost no coverage of this. Now it is 19:44, the announcement was at about 15.00 hungarian time. I was checking news pages many times today, both Hungarian and English/American. Now\nit is on front page in the Hungarian ones, but it wasn’t like this a\nfew hours before, and for example on very popular liberal news page\nORIGO, you can barely see it between the first 10 bullshit/less\nimportant news.\nJust now it is on the front\npage of CNN, hidden between a lot of other news, it is not even on the\nfront page of BBC, you can only find it if you search. Same with\nReuters, only if you search. One of the “news line” short news on\nRT.com. For some reason, they are not enthusiastic covering this.\nWith\nthe serbian closure, it was all over the place, because people were\nexpecting riots and finger pointing poor treatment of migrants. They got a little of what they expected.\nCroatian\ninterior minister Ranko Ostojic just announced that they will take\npeople to Slovenian border, and another Slovenian politician said that\nthey are prepared for the influx, until countries further north keep\ntheir borders open (Germany). So they will basically continue the same organized transport of migrants to Germany, only through Slovenia.\nI don’t expect riots, neither does mainstream media. So\nthey do not want to tell people, that Hungary just quietly but surely\nstuck to its plan, closed the borders, and is not doing it\nalone, but in cooperation with 4 other countries.\nThe\nother day I wrote that Czech soldiers already arrived, Slovak soldiers\nand policemen will arrive, and the Poles will probably help with\nsomething also. Well, Ewa Kopacz Polish PM announced today, that they\nare sending to Hungary 70 border police officials, many jeeps, including\n5 that have night vision devices built in.\nThe coverage of the first border closing backfired on the multicultis. Nearly everyone applauded the Hungarian action. That’s why they’re keeping the cameras away from this one.",
  "tags": [
    "EU",
    "mailvox",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-16T14:21:00+00:00"
}