{
  "url": "https://voxday.net/2015/10/31/you-invited-them-you-deal-with-the/",
  "scraped_at": "2025-12-17T17:31:56.263083",
  "title": "You invited them, you deal with them",
  "date_display": "October 31, 2015",
  "date_iso": "2015-10-31T11:01:00+00:00",
  "date_from_url": "2015-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sweden’s government <a href=\"http://www.dailymail.co.uk/news/article-3297317/Swedish-Foreign-Minister-claims-country-facing-collapse-mass-influx-refugees.html\">is going to collapse</a> and the other EU member states are not going to prevent it:</p><blockquote class=\"tr_bq\"><p> The Swedish Foreign Minister has claimed her country is facing collapse due to the mass influx of refugees as the migrant crisis deepens. Margot Wallstrom has said that Sweden cannot cope with taking in refugees at its current level, without it affecting services.</p><p>She says that Stockholm will now have to pressure the European Union in a bid to force other member states to share the burden of those coming from the Middle East, mainly Syria.</p><p>It is expected that Sweden will take in around 190,000 migrants by the end of 2015. In the first nine months of the year, more than 73,000 people applied for asylum in Sweden.</p><p>And Mrs Wallstrom said in an interview: ‘I think most people feel that we cannot maintain a system where perhaps 190,000 people will arrive every year – in the long run, our system will collapse. And that welcome is not going to receive popular support. I have to admit that there have been moments recently of very great disappointment. I have heard statements from member states that have been completely astonishing and very discouraging.’</p><p>The Foreign Minister’s comments come after arsonists attacked housing for asylum seekers in the small town of Munkedal, in the south of the country. No one was seriously injured, although some of the 14 migrants living there suffered slight smoke inhalation. They were swiftly rehoused.</p></blockquote><p>It’s remarkable to see idiot female politicians like Merkel and Wallstrom whining and crying about the fact that no one will fix the problem that they caused. They ought to own up to the consequences of their failures and resign immediately. The other member states aren’t going to let them off the hook. The Swedes should let the Swedish Democrats deal with it. They will have a robust means of dealing with these unwelcome migrants. If it happens soon enough, they will simply repatriate them with a minimum of fuss and bother.</p><p>Otherwise, history clearly dictates that there are three alternatives. One, the invaders conquer the natives and rule over them. Two, the invaders excise territory from the natives and establish a new country; Israel and Bosnia-Herzogovina being two such examples. Three, the natives kill all the invaders.</p><p>The pipe dreams of the multicultis notwithstanding, peaceful integration is not a credible scenario.</p><p>I’ve been editing the excellent essay on migration that Martin van Creveld wrote, originally for <i>Riding the Red Horse Vol. 2</i>, and it is very clear that, statistically speaking, the world is overdue for another of its periodic ethnic cleansings. Assuming it happens in the next five years, the next European one won’t even be particularly large by continental standards.</p></div>",
  "content_text": "Sweden’s government\nis going to collapse\nand the other EU member states are not going to prevent it:\nThe Swedish Foreign Minister has claimed her country is facing collapse due to the mass influx of refugees as the migrant crisis deepens. Margot Wallstrom has said that Sweden cannot cope with taking in refugees at its current level, without it affecting services.\nShe says that Stockholm will now have to pressure the European Union in a bid to force other member states to share the burden of those coming from the Middle East, mainly Syria.\nIt is expected that Sweden will take in around 190,000 migrants by the end of 2015. In the first nine months of the year, more than 73,000 people applied for asylum in Sweden.\nAnd Mrs Wallstrom said in an interview: ‘I think most people feel that we cannot maintain a system where perhaps 190,000 people will arrive every year – in the long run, our system will collapse. And that welcome is not going to receive popular support. I have to admit that there have been moments recently of very great disappointment. I have heard statements from member states that have been completely astonishing and very discouraging.’\nThe Foreign Minister’s comments come after arsonists attacked housing for asylum seekers in the small town of Munkedal, in the south of the country. No one was seriously injured, although some of the 14 migrants living there suffered slight smoke inhalation. They were swiftly rehoused.\nIt’s remarkable to see idiot female politicians like Merkel and Wallstrom whining and crying about the fact that no one will fix the problem that they caused. They ought to own up to the consequences of their failures and resign immediately. The other member states aren’t going to let them off the hook. The Swedes should let the Swedish Democrats deal with it. They will have a robust means of dealing with these unwelcome migrants. If it happens soon enough, they will simply repatriate them with a minimum of fuss and bother.\nOtherwise, history clearly dictates that there are three alternatives. One, the invaders conquer the natives and rule over them. Two, the invaders excise territory from the natives and establish a new country; Israel and Bosnia-Herzogovina being two such examples. Three, the natives kill all the invaders.\nThe pipe dreams of the multicultis notwithstanding, peaceful integration is not a credible scenario.\nI’ve been editing the excellent essay on migration that Martin van Creveld wrote, originally for\nRiding the Red Horse Vol. 2\n, and it is very clear that, statistically speaking, the world is overdue for another of its periodic ethnic cleansings. Assuming it happens in the next five years, the next European one won’t even be particularly large by continental standards.",
  "tags": [
    "EU",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-10-31T11:01:00+00:00"
}