{
  "url": "https://voxday.net/2021/04/01/a-wholly-owned-subsidiary/",
  "scraped_at": "2025-12-21T22:43:00.675189",
  "title": "A wholly-owned subsidiary",
  "date_display": "April 1, 2021",
  "date_iso": "2021-04-01T10:02:33+00:00",
  "date_from_url": "2021-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The  professional “conservative movement” is a wholly-owned subsidiary of the Democratic Party. They’re literally <a href=\"https://whnt.com/news/republican-accountability-project-targets-mo-brooks-and-matt-gaetz-in-1m-ad-campaign/\" rel=\"noopener\" target=\"_blank\">playing for the other side</a>.</p><blockquote><p>A conservative political action committee is about to unleash a flurry of ads targeting six House Republicans who objected to certifying the Presidential election in January. Among the house members being targeted in the ads are Alabama Republican Representative Mo Brooks, and Northwest Florida Congressman Matt Gaetz.</p><p>The Republican Accountability Project says among their goals with the ad campaign is to work to unseat those who have tried to overturn a legitimate election and supported impunity for political violence, and to push back against lies and conspiracy theories about widespread voter fraud and “rigged” elections.</p></blockquote><p>Never trust anyone who describes himself as a “conservative” these days. In the 68 years since the publication of <i>The Conservative Mind</i>, conservatism hasn’t conserved anything at all. It’s “nationalist” or nothing, because that is literally the only issue that actually matters anymore. The age of ideology ended in the USA in 1965, but it took until 2015 for Americans to even begin to realize this due to the slow-moving cancer of negative demographics.</p><p>Conservatism is cuckservatism. They are one and the same.</p></div>",
  "content_text": "The  professional “conservative movement” is a wholly-owned subsidiary of the Democratic Party. They’re literally\nplaying for the other side\n.\nA conservative political action committee is about to unleash a flurry of ads targeting six House Republicans who objected to certifying the Presidential election in January. Among the house members being targeted in the ads are Alabama Republican Representative Mo Brooks, and Northwest Florida Congressman Matt Gaetz.\nThe Republican Accountability Project says among their goals with the ad campaign is to work to unseat those who have tried to overturn a legitimate election and supported impunity for political violence, and to push back against lies and conspiracy theories about widespread voter fraud and “rigged” elections.\nNever trust anyone who describes himself as a “conservative” these days. In the 68 years since the publication of\nThe Conservative Mind\n, conservatism hasn’t conserved anything at all. It’s “nationalist” or nothing, because that is literally the only issue that actually matters anymore. The age of ideology ended in the USA in 1965, but it took until 2015 for Americans to even begin to realize this due to the slow-moving cancer of negative demographics.\nConservatism is cuckservatism. They are one and the same.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-01T09:02:33+00:00"
}