{
  "url": "https://voxday.net/2021/04/22/alone-you-will-fall/",
  "scraped_at": "2025-12-21T22:45:29.315927",
  "title": "Alone, you will fall",
  "date_display": "April 22, 2021",
  "date_iso": "2021-04-22T10:41:39+00:00",
  "date_from_url": "2021-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They’re not going to let you pass unnoticed and unhindered anymore.</p><p>For the last 20 years, I’ve been hearing from people who read my work and secretly agree with me, but keep silent in public for fear of endangering their jobs, their social position, or their professional contracts. They’ve operated, successfully for the most part, in a stealth mode where they pretend to go along to get along, and in the past they were generally able to presever whatever it was they were trying to preserve. But it is increasingly obvious that <a href=\"https://www.outkick.com/va-tech-soccer-player-files-lawsuit-against-coach-claims-she-was-targeted-for-not-kneeling/\" rel=\"noopener\" target=\"_blank\">the days of free silence are now over</a> thanks to the fake election of 2020, BLM, the Covid Flu, and the various organizational witchhunts that have followed in their wake:</p><blockquote><p>Former Virginia Tech soccer player Kiersten Hening has filed a federal lawsuit against Hokies coach Charles “Chugger” Adair, claiming the coach benched her and “subjected her to verbal abuse” and ultimately forced her off the women’s soccer team because she refused to kneel before soccer matches.</p><p>According to the lawsuit first reported by the Richmond Times-Dispatch, Hening, a junior out of Midlothian, Va., was a “talented defender” who started her freshman and sophomore seasons and played the third-most minutes on the team in 2019. As she began her junior season in 2020, the suit alleges, Hening had the most minutes played on the roster and she was even selected to talk to the media before the season began.</p><p>The lawsuit alleges that on September 1, 2020, a student-athlete advisory committee discussed proposals for student-athletes to wear BLM COVID masks, BLM wristbands, armbands and BLM shirts during warmups. The soccer team discussed the proposal and “most” players supported the idea. Hening claims Adair supported the proposals and went even further with an idea to replace “Hokies” on the back of the team uniform with the names of alleged victims of police misconduct….</p><p>Hening states in her suit that at a September 12 game against Virginia, Adair made her the subject of a tirade because she wouldn’t take a knee with the rest of the starters before the match. The “campaign of abuse,” as Hening calls it in court documents, continued until she ultimately left the program on September 20.</p></blockquote><p>There are several problems with this strategy, not least of all the psychological stress it imposes upon the individual who adopts it. First, it’s not honest and living a lie is always difficult. Second, it requires one to remain alone and without allies in the event of trouble. Third, it prevents others from knowing that they are not alone. Fourth, it renders one useless and hors de combat.</p><p>And then, of course, there is the problem that it simply can’t be relied upon to work anymore. </p><p>You might say, with Theoden, that you will not risk open war. But I reply, with Aragorn, that open war is upon you whether you would risk it or not. Embrace the conflict. Join forces with your allies. Because neither neutrality nor invisibility is an option, and you will either stand with them or you will fall alone.</p><p>One of the reasons I will always have great respect for John C. Wright is that he did not hesitate to stand with Castalia House when we first raised the anti-SJW banner in science fiction. It is the first ally that is so very important, because it is that first ally who opens one’s eyes to the realization that one is not alone, that there are others who will not bend the knee to the wickedness, and that there is someone who will guard your back.</p></div>",
  "content_text": "They’re not going to let you pass unnoticed and unhindered anymore.\nFor the last 20 years, I’ve been hearing from people who read my work and secretly agree with me, but keep silent in public for fear of endangering their jobs, their social position, or their professional contracts. They’ve operated, successfully for the most part, in a stealth mode where they pretend to go along to get along, and in the past they were generally able to presever whatever it was they were trying to preserve. But it is increasingly obvious that\nthe days of free silence are now over\nthanks to the fake election of 2020, BLM, the Covid Flu, and the various organizational witchhunts that have followed in their wake:\nFormer Virginia Tech soccer player Kiersten Hening has filed a federal lawsuit against Hokies coach Charles “Chugger” Adair, claiming the coach benched her and “subjected her to verbal abuse” and ultimately forced her off the women’s soccer team because she refused to kneel before soccer matches.\nAccording to the lawsuit first reported by the Richmond Times-Dispatch, Hening, a junior out of Midlothian, Va., was a “talented defender” who started her freshman and sophomore seasons and played the third-most minutes on the team in 2019. As she began her junior season in 2020, the suit alleges, Hening had the most minutes played on the roster and she was even selected to talk to the media before the season began.\nThe lawsuit alleges that on September 1, 2020, a student-athlete advisory committee discussed proposals for student-athletes to wear BLM COVID masks, BLM wristbands, armbands and BLM shirts during warmups. The soccer team discussed the proposal and “most” players supported the idea. Hening claims Adair supported the proposals and went even further with an idea to replace “Hokies” on the back of the team uniform with the names of alleged victims of police misconduct….\nHening states in her suit that at a September 12 game against Virginia, Adair made her the subject of a tirade because she wouldn’t take a knee with the rest of the starters before the match. The “campaign of abuse,” as Hening calls it in court documents, continued until she ultimately left the program on September 20.\nThere are several problems with this strategy, not least of all the psychological stress it imposes upon the individual who adopts it. First, it’s not honest and living a lie is always difficult. Second, it requires one to remain alone and without allies in the event of trouble. Third, it prevents others from knowing that they are not alone. Fourth, it renders one useless and hors de combat.\nAnd then, of course, there is the problem that it simply can’t be relied upon to work anymore.\nYou might say, with Theoden, that you will not risk open war. But I reply, with Aragorn, that open war is upon you whether you would risk it or not. Embrace the conflict. Join forces with your allies. Because neither neutrality nor invisibility is an option, and you will either stand with them or you will fall alone.\nOne of the reasons I will always have great respect for John C. Wright is that he did not hesitate to stand with Castalia House when we first raised the anti-SJW banner in science fiction. It is the first ally that is so very important, because it is that first ally who opens one’s eyes to the realization that one is not alone, that there are others who will not bend the knee to the wickedness, and that there is someone who will guard your back.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-22T09:41:39+00:00"
}