{
  "url": "https://voxday.net/2021/04/02/corporate-communism/",
  "scraped_at": "2025-12-21T22:43:08.038619",
  "title": "Corporate communism",
  "date_display": "April 2, 2021",
  "date_iso": "2021-04-02T09:03:39+00:00",
  "date_from_url": "2021-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Clay Travis is right… although the literal Communists in China <a href=\"https://www.outkick.com/clay-american-big-tech-is-no-different-than-china/\" rel=\"noopener\" target=\"_blank\">actually permit more freedom of expression</a> than the converged US tech corporations do:</p><blockquote><p>Facebook? Or communist China? You tell us the difference. Because anymore, it’s hard to tell if there is one — especially after Facebook refused to allow Donald Trump’s daughter-in-law to post an interview with the former president.</p><p>That’s right. Lara Trump wanted to post something to Facebook. The social media giant said no. And its lone reason was entirely based on the fact the post involved Donald Trump.</p><p>“This is outlandish,” said OutKick founder Clay Travis. “And it’s crazy to me how many members of the blue-checkmark brigade are cheering blatant censorship. What’s happened in America — and I don’t think most people have recognized this, or it certainly hasn’t been talked about in a big way — is that China has the Great Wall of China for the Internet, right? They filter what people in China are able to see, the government does, in an effort to promote nationalism and respect for their country.”</p><p>In other words, China does not have a “free and open” Internet, Clay adds. And guess what? Neither does Big Tech in America.</p></blockquote><p>The problem is that “free and open”, which is a form of “freedom of expression” was always a lie put forth by the 19th century Prometheans who wanted to blaspheme against Jesus Christ and the living God. One doesn’t need “freedom of thought”, one literally has complete freedom of thought.</p><p>Expression and speech, on the other hand, have always been restricted. That’s why we have concepts such as “blasphemy”, “slander”, and “<i>lese majeste</i>“. The only thing that has changed is a) who is doing the restricting and b) what they are restricting. And since the wicked are now making the rules, what they are restricting is the truth.</p></div>",
  "content_text": "Clay Travis is right… although the literal Communists in China\nactually permit more freedom of expression\nthan the converged US tech corporations do:\nFacebook? Or communist China? You tell us the difference. Because anymore, it’s hard to tell if there is one — especially after Facebook refused to allow Donald Trump’s daughter-in-law to post an interview with the former president.\nThat’s right. Lara Trump wanted to post something to Facebook. The social media giant said no. And its lone reason was entirely based on the fact the post involved Donald Trump.\n“This is outlandish,” said OutKick founder Clay Travis. “And it’s crazy to me how many members of the blue-checkmark brigade are cheering blatant censorship. What’s happened in America — and I don’t think most people have recognized this, or it certainly hasn’t been talked about in a big way — is that China has the Great Wall of China for the Internet, right? They filter what people in China are able to see, the government does, in an effort to promote nationalism and respect for their country.”\nIn other words, China does not have a “free and open” Internet, Clay adds. And guess what? Neither does Big Tech in America.\nThe problem is that “free and open”, which is a form of “freedom of expression” was always a lie put forth by the 19th century Prometheans who wanted to blaspheme against Jesus Christ and the living God. One doesn’t need “freedom of thought”, one literally has complete freedom of thought.\nExpression and speech, on the other hand, have always been restricted. That’s why we have concepts such as “blasphemy”, “slander”, and “\nlese majeste\n“. The only thing that has changed is a) who is doing the restricting and b) what they are restricting. And since the wicked are now making the rules, what they are restricting is the truth.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-02T08:03:39+00:00"
}