{
  "url": "https://voxday.net/2021/04/29/excising-social-justice-at-basecamp/",
  "scraped_at": "2025-12-21T22:46:31.560435",
  "title": "Excising social justice at Basecamp",
  "date_display": "April 29, 2021",
  "date_iso": "2021-04-29T10:35:08+00:00",
  "date_from_url": "2021-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> A few smart corporations are finally beginning to grasp that convergence is corporate cancer that will destroy their businesses and are actively attempting to surgically remove the SJWs that infest them. Basecamp <a href=\"https://archive.is/WrDdK#selection-93.0-149.1151\" rel=\"noopener\" target=\"_blank\">has taken a strong anti-social justice stance</a> that might just turn things around there:</p><blockquote><p>1. No more societal and political discussions on our company Basecamp account. Today’s social and political waters are especially choppy. Sensitivities are at 11, and every discussion remotely related to politics, advocacy, or society at large quickly spins away from pleasant. You shouldn’t have to wonder if staying out of it means you’re complicit, or wading into it means you’re a target. These are difficult enough waters to navigate in life, but significantly more so at work. It’s become too much. It’s a major distraction. It saps our energy, and redirects our dialog towards dark places. It’s not healthy, it hasn’t served us well. And we’re done with it on our company Basecamp account where the work happens. People can take the conversations with willing co-workers to Signal, Whatsapp, or even a personal Basecamp account, but it can’t happen where the work happens anymore. Update: David has shared some more details and more of the internal announcement on his HEY World blog.</p><p>2. No more paternalistic benefits. For years we’ve offered a fitness benefit, a wellness allowance, a farmer’s market share, and continuing education allowances. They felt good at the time, but we’ve had a change of heart. It’s none of our business what you do outside of work, and it’s not Basecamp’s place to encourage certain behaviors — regardless of good intention. By providing funds for certain things, we’re getting too deep into nudging people’s personal, individual choices. So we’ve ended these benefits, and, as compensation, paid every employee the full cash value of the benefits for this year. In addition, we recently introduced a 10{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} profit sharing plan to provide direct compensation that people can spend on whatever they’d like, privately, without company involvement or judgement.</p><p>3. No more committees. For nearly all of our 21 year existence, we were proudly committee-free. No big working groups making big decisions, or putting forward formalized, groupthink recommendations. No bureaucracy. But recently, a few sprung up. No longer. We’re turning things back over to the person (or people) who were distinctly hired to make those decisions. The responsibility for DEI work returns to Andrea, our head of People Ops. The responsibility for negotiating use restrictions and moral quandaries returns to me and David. A long-standing group of managers called “Small Council” will disband — when we need advice or counsel we’ll ask individuals with direct relevant experience rather than a pre-defined group at large. Back to basics, back to individual responsibility, back to work.</p><p>4. No more lingering or dwelling on past decisions. We’ve become a bit too precious with decision making over the last few years. Either by wallowing in indecisiveness, worrying ourselves into overthinking things, taking on a defensive posture and assuming the worst outcome is the likely outcome, putting too much energy into something that only needed a quick fix, inadvertently derailing projects when casual suggestions are taken as essential imperatives, or rehashing decisions in different forums or mediums. It’s time to get back to making calls, explaining why once, and moving on.</p><p>5. No more 360 reviews. Employee performance reviews used to be straightforward. A meeting with your manager or team lead, direct feedback, and recommendations for improvement. Then a few years ago we made it hard. Worse, really. We introduced 360s, which required peers to provide feedback on peers. The problem is, peer feedback is often positive and reassuring, which is fun to read but not very useful. Assigning peer surveys started to feel like assigning busy work. Manager/employee feedback should be flowing pretty freely back and forth throughout the year. No need to add performative paperwork on top of that natural interaction. So we’re done with 360s, too.</p><p>6. No forgetting what we do here. We make project management, team communication, and email software. We are not a social impact company. Our impact is contained to what we do and how we do it. We write business books, blog a ton, speak regularly, we open source software, we give back an inordinate amount to our industry given our size. And we’re damn proud of it. Our work, plus that kind of giving, should occupy our full attention. We don’t have to solve deep social problems, chime in publicly whenever the world requests our opinion on the major issues of the day, or get behind one movement or another with time or treasure. These are all important topics, but they’re not our topics at work — they’re not what we collectively do here. Employees are free to take up whatever cause they want, support whatever movements they’d like, and speak out on whatever horrible injustices are being perpetrated on this group or that (and, unfortunately, there are far too many to choose from). But that’s their business, not ours. We’re in the business of making software, and a few tangential things that touch that edge. We’re responsible for ourselves. That’s more than enough for us.</p></blockquote><p>Of course, the SJWs <a href=\"https://archive.is/OzmWV#selection-181.0-181.469\" rel=\"noopener\" target=\"_blank\">are trying to hold their ground</a>, utilizing the popular “you are the problem” defense, complete with a nuclear <i>MARTIN LUTHER KING JR.</i> quote. Damn, they really aren’t pulling any punches, are they? What’s crazy is that this tactic actually works in some corporate circles instead of simply getting the lunatic fired for insubordination.</p><blockquote><p>Jason and David, I believe that your recent company policy changes are both terrible and redeemable. But to be redeemable, you first must recognize that you are a BIG part of the problem. That you too perpetrate the myth that some people deserve to oppress and repress others. Once you hold yourselves publicly self-accountable, then the next step is transparency. Show us all the warts along with the unblemished skin. And from there, we can go about healing Basecamp.</p></blockquote></div>",
  "content_text": "A few smart corporations are finally beginning to grasp that convergence is corporate cancer that will destroy their businesses and are actively attempting to surgically remove the SJWs that infest them. Basecamp\nhas taken a strong anti-social justice stance\nthat might just turn things around there:\n1. No more societal and political discussions on our company Basecamp account. Today’s social and political waters are especially choppy. Sensitivities are at 11, and every discussion remotely related to politics, advocacy, or society at large quickly spins away from pleasant. You shouldn’t have to wonder if staying out of it means you’re complicit, or wading into it means you’re a target. These are difficult enough waters to navigate in life, but significantly more so at work. It’s become too much. It’s a major distraction. It saps our energy, and redirects our dialog towards dark places. It’s not healthy, it hasn’t served us well. And we’re done with it on our company Basecamp account where the work happens. People can take the conversations with willing co-workers to Signal, Whatsapp, or even a personal Basecamp account, but it can’t happen where the work happens anymore. Update: David has shared some more details and more of the internal announcement on his HEY World blog.\n2. No more paternalistic benefits. For years we’ve offered a fitness benefit, a wellness allowance, a farmer’s market share, and continuing education allowances. They felt good at the time, but we’ve had a change of heart. It’s none of our business what you do outside of work, and it’s not Basecamp’s place to encourage certain behaviors — regardless of good intention. By providing funds for certain things, we’re getting too deep into nudging people’s personal, individual choices. So we’ve ended these benefits, and, as compensation, paid every employee the full cash value of the benefits for this year. In addition, we recently introduced a 10{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08} profit sharing plan to provide direct compensation that people can spend on whatever they’d like, privately, without company involvement or judgement.\n3. No more committees. For nearly all of our 21 year existence, we were proudly committee-free. No big working groups making big decisions, or putting forward formalized, groupthink recommendations. No bureaucracy. But recently, a few sprung up. No longer. We’re turning things back over to the person (or people) who were distinctly hired to make those decisions. The responsibility for DEI work returns to Andrea, our head of People Ops. The responsibility for negotiating use restrictions and moral quandaries returns to me and David. A long-standing group of managers called “Small Council” will disband — when we need advice or counsel we’ll ask individuals with direct relevant experience rather than a pre-defined group at large. Back to basics, back to individual responsibility, back to work.\n4. No more lingering or dwelling on past decisions. We’ve become a bit too precious with decision making over the last few years. Either by wallowing in indecisiveness, worrying ourselves into overthinking things, taking on a defensive posture and assuming the worst outcome is the likely outcome, putting too much energy into something that only needed a quick fix, inadvertently derailing projects when casual suggestions are taken as essential imperatives, or rehashing decisions in different forums or mediums. It’s time to get back to making calls, explaining why once, and moving on.\n5. No more 360 reviews. Employee performance reviews used to be straightforward. A meeting with your manager or team lead, direct feedback, and recommendations for improvement. Then a few years ago we made it hard. Worse, really. We introduced 360s, which required peers to provide feedback on peers. The problem is, peer feedback is often positive and reassuring, which is fun to read but not very useful. Assigning peer surveys started to feel like assigning busy work. Manager/employee feedback should be flowing pretty freely back and forth throughout the year. No need to add performative paperwork on top of that natural interaction. So we’re done with 360s, too.\n6. No forgetting what we do here. We make project management, team communication, and email software. We are not a social impact company. Our impact is contained to what we do and how we do it. We write business books, blog a ton, speak regularly, we open source software, we give back an inordinate amount to our industry given our size. And we’re damn proud of it. Our work, plus that kind of giving, should occupy our full attention. We don’t have to solve deep social problems, chime in publicly whenever the world requests our opinion on the major issues of the day, or get behind one movement or another with time or treasure. These are all important topics, but they’re not our topics at work — they’re not what we collectively do here. Employees are free to take up whatever cause they want, support whatever movements they’d like, and speak out on whatever horrible injustices are being perpetrated on this group or that (and, unfortunately, there are far too many to choose from). But that’s their business, not ours. We’re in the business of making software, and a few tangential things that touch that edge. We’re responsible for ourselves. That’s more than enough for us.\nOf course, the SJWs\nare trying to hold their ground\n, utilizing the popular “you are the problem” defense, complete with a nuclear\nMARTIN LUTHER KING JR.\nquote. Damn, they really aren’t pulling any punches, are they? What’s crazy is that this tactic actually works in some corporate circles instead of simply getting the lunatic fired for insubordination.\nJason and David, I believe that your recent company policy changes are both terrible and redeemable. But to be redeemable, you first must recognize that you are a BIG part of the problem. That you too perpetrate the myth that some people deserve to oppress and repress others. Once you hold yourselves publicly self-accountable, then the next step is transparency. Show us all the warts along with the unblemished skin. And from there, we can go about healing Basecamp.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-29T09:35:08+00:00"
}