{
  "url": "https://voxday.net/2021/04/28/ideas-dont-have-consequences/",
  "scraped_at": "2025-12-21T22:46:29.744531",
  "title": "Ideas don’t have consequences",
  "date_display": "April 28, 2021",
  "date_iso": "2021-04-28T23:59:34+00:00",
  "date_from_url": "2021-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The American Conservatives points out that if they did, all the neoclowns in the media <a href=\"https://www.theamericanconservative.com/articles/ideas-dont-have-consequences/\" rel=\"noopener\" target=\"_blank\">would be unemployed</a>:</p><blockquote><p>When the University of Chicago Press brought out Richard Weaver’s book <i>Ideas Have Consequences</i> in 1948, it was instantly hailed as a landmark text on American conservatism. The title itself has become a sort of rallying cry for the conservative intelligentsia. I’d wager that 98 percent of those who utter the phrase “Ideas have consequences!” have never read the book, nor even heard of Richard Weaver.</p><p>What’s ironic is that Weaver himself hated the title. He hated it so much, in fact, that he nearly pulled the book. Looking back, his objection was prophetic. When it comes to the American right, ideas—good or bad—have no consequences whatsoever.</p><p>Take the war in Iraq, the greatest policy snafu in American history. Our crusade to depose Saddam Hussein was built on lies: that he was in possession of nuclear weapons, that he was sheltering Al Qaeda, etc. Granted, many of those lies came straight from the “intelligence community.” But, from day one, there were voices on the right who called B.S. Many of them gathered together in a magazine called The American Conservative; maybe you’ve heard of it.</p><p>Even if one can be forgiven for trusting the U.S. government back in those halcyon days, pro-war pundits also promised that Iraq would be over in five months, tops. That wasn’t just wrong; it was insane. The idea that we could purge the Iraqi government of Ba’athists right down to the last postman, install a stable transitional government, and leave Afghanistan a functional modern democracy—all in five months—was insane. Anyone who repeated that line was either stupid, evil, or both.</p><p>Some, like Bill Kristol, went even further. In November of 2002, he said: “We can remove Saddam because that could start a chain reaction in the Arab world that would be very healthy.” That’s nuts. It’s just nuts.</p><p>Now, tell me this. Once every single argument in favor of the Iraq war was proved categorically false, did anyone lose their jobs? Did any politicians or pundits suddenly disappear from the airwaves? Did their bad, stupid, evil ideas have any consequences? (For their careers, I mean. Their ideas certainly had consequences for the hundreds of thousands of dead soldiers and civilians.) Of course not.</p><p>What about those hawks who referred to the war’s critics as “unpatriotic conservatives”? Most of them are making six figures in the legacy media. Others are “senior fellows” at any of the millions of think-tanks across the Beltway. Because ideas don’t have consequences.</p></blockquote><p>It is astonishing how many conservatives still listen to morons like Ben Shapiro or definitely-not-methheads like Jordan Peterson despite the fact that their ideas have repeatedly been proven to be false, harmful, or false and harmful.</p><p>Yes, people are wrong from time to time. Even smart, handsome individuals who correctly call economic crisis in advance are occasionally wrong. But there is a difference between not being perfectly omniscient and repeatedly pushing bad, stupid, and evil ideas on the public.</p><p>Also, America First is the new Tea Party. The once-nationalist rhetoric has already been subsumed and subverted by the Buckley wing of the Republican faction of the bifactional ruling party.</p></div>",
  "content_text": "The American Conservatives points out that if they did, all the neoclowns in the media\nwould be unemployed\n:\nWhen the University of Chicago Press brought out Richard Weaver’s book\nIdeas Have Consequences\nin 1948, it was instantly hailed as a landmark text on American conservatism. The title itself has become a sort of rallying cry for the conservative intelligentsia. I’d wager that 98 percent of those who utter the phrase “Ideas have consequences!” have never read the book, nor even heard of Richard Weaver.\nWhat’s ironic is that Weaver himself hated the title. He hated it so much, in fact, that he nearly pulled the book. Looking back, his objection was prophetic. When it comes to the American right, ideas—good or bad—have no consequences whatsoever.\nTake the war in Iraq, the greatest policy snafu in American history. Our crusade to depose Saddam Hussein was built on lies: that he was in possession of nuclear weapons, that he was sheltering Al Qaeda, etc. Granted, many of those lies came straight from the “intelligence community.” But, from day one, there were voices on the right who called B.S. Many of them gathered together in a magazine called The American Conservative; maybe you’ve heard of it.\nEven if one can be forgiven for trusting the U.S. government back in those halcyon days, pro-war pundits also promised that Iraq would be over in five months, tops. That wasn’t just wrong; it was insane. The idea that we could purge the Iraqi government of Ba’athists right down to the last postman, install a stable transitional government, and leave Afghanistan a functional modern democracy—all in five months—was insane. Anyone who repeated that line was either stupid, evil, or both.\nSome, like Bill Kristol, went even further. In November of 2002, he said: “We can remove Saddam because that could start a chain reaction in the Arab world that would be very healthy.” That’s nuts. It’s just nuts.\nNow, tell me this. Once every single argument in favor of the Iraq war was proved categorically false, did anyone lose their jobs? Did any politicians or pundits suddenly disappear from the airwaves? Did their bad, stupid, evil ideas have any consequences? (For their careers, I mean. Their ideas certainly had consequences for the hundreds of thousands of dead soldiers and civilians.) Of course not.\nWhat about those hawks who referred to the war’s critics as “unpatriotic conservatives”? Most of them are making six figures in the legacy media. Others are “senior fellows” at any of the millions of think-tanks across the Beltway. Because ideas don’t have consequences.\nIt is astonishing how many conservatives still listen to morons like Ben Shapiro or definitely-not-methheads like Jordan Peterson despite the fact that their ideas have repeatedly been proven to be false, harmful, or false and harmful.\nYes, people are wrong from time to time. Even smart, handsome individuals who correctly call economic crisis in advance are occasionally wrong. But there is a difference between not being perfectly omniscient and repeatedly pushing bad, stupid, and evil ideas on the public.\nAlso, America First is the new Tea Party. The once-nationalist rhetoric has already been subsumed and subverted by the Buckley wing of the Republican faction of the bifactional ruling party.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-28T22:59:34+00:00"
}