{
  "url": "https://voxday.net/2021/04/29/its-over-hes-done/",
  "scraped_at": "2025-12-21T22:46:35.263443",
  "title": "It’s over. He’s done.",
  "date_display": "April 29, 2021",
  "date_iso": "2021-04-29T15:17:41+00:00",
  "date_from_url": "2021-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking as an author of a long-awaited epic fantasy novel that is years behind schedule and has yet to be finished, I think I am one of the few people on Earth who can speak with authority <a href=\"https://www.outkick.com/george-rr-martin-hugely-behind-on-the-winds-of-winter/\" rel=\"noopener\" target=\"_blank\">on the matter of George RR Martin</a> and the likelihood that he will ever finish <i>A Song of Ice and Fire.</i></p><blockquote><p>I’ve said since the 7th season of Game of Thrones that George RR Martin would fail to finish his book series, A Song of Ice and Fire. There are now concerns that Martin won’t even finish The Winds of Winter, the planned penultimate novel of the series. Martin revealed this week on his blog that he has, again, fallen “hugely behind” on a project, which we assume means The Winds of Winter.</p><p>“When a lot of stuff happens very fast, I fall further and further behind. I am hugely behind right now, and the prospect of trying to catch up is feeling increasingly oppressive,” Martin writes.</p><p>That doesn’t sound good.</p><p>It has been 10 years since the last book of the series, A Dance with Dragons, was released. If Martin can’t finish Winds in a decade, how long will A Dream of Spring, the final and longest novel of the series, take?</p><p>Perhaps, there is not enough time in life to close every Martin-formed storyline. Maybe this book series grew too large, too deep, too in-depth for a conclusion. That TV ending may be all we get. </p></blockquote><p>The Outkick writer is right. Martin won’t finish the series. He almost certainly won’t even finish <i>The Winds of Winter</i>. He’s not only lost his fastball, he’s lost his ability to pitch.</p><p>I, however, have not. I will finish <i>A Sea of Skulls</i> and continue with <i>The Arts of Dark and Light</i>. In fact, if fans of the epic fantasy series here are genuinely interested, I can even post a chapter or two of new material here at some point, although I will certainly understand if you would prefer that I reserve all of the new content for the completed book.</p></div>",
  "content_text": "Speaking as an author of a long-awaited epic fantasy novel that is years behind schedule and has yet to be finished, I think I am one of the few people on Earth who can speak with authority\non the matter of George RR Martin\nand the likelihood that he will ever finish\nA Song of Ice and Fire.\nI’ve said since the 7th season of Game of Thrones that George RR Martin would fail to finish his book series, A Song of Ice and Fire. There are now concerns that Martin won’t even finish The Winds of Winter, the planned penultimate novel of the series. Martin revealed this week on his blog that he has, again, fallen “hugely behind” on a project, which we assume means The Winds of Winter.\n“When a lot of stuff happens very fast, I fall further and further behind. I am hugely behind right now, and the prospect of trying to catch up is feeling increasingly oppressive,” Martin writes.\nThat doesn’t sound good.\nIt has been 10 years since the last book of the series, A Dance with Dragons, was released. If Martin can’t finish Winds in a decade, how long will A Dream of Spring, the final and longest novel of the series, take?\nPerhaps, there is not enough time in life to close every Martin-formed storyline. Maybe this book series grew too large, too deep, too in-depth for a conclusion. That TV ending may be all we get.\nThe Outkick writer is right. Martin won’t finish the series. He almost certainly won’t even finish\nThe Winds of Winter\n. He’s not only lost his fastball, he’s lost his ability to pitch.\nI, however, have not. I will finish\nA Sea of Skulls\nand continue with\nThe Arts of Dark and Light\n. In fact, if fans of the epic fantasy series here are genuinely interested, I can even post a chapter or two of new material here at some point, although I will certainly understand if you would prefer that I reserve all of the new content for the completed book.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-29T14:17:41+00:00"
}