{
  "url": "https://voxday.net/2021/04/18/let-them-go/",
  "scraped_at": "2025-12-21T22:45:05.378446",
  "title": "Let them go",
  "date_display": "April 18, 2021",
  "date_iso": "2021-04-18T23:09:38+00:00",
  "date_from_url": "2021-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The love of money is the root of all evil. <a href=\"https://www.dailymail.co.uk/sport/football/article-9484141/FIVE-Premier-League-teams-sign-European-Super-League-snub-UEFA.html\" rel=\"noopener\" target=\"_blank\">70 years of success isn’t enough</a> to prevent Europe’s biggest soccer teams from falling into the clutches of the bankers:</p><blockquote><p> A group made up of the biggest soccer clubs in Spain, England and Italy has agreed to join a breakaway league that has the potential to change the landscape of world soccer, according to The New York Times. </p><p>So far, 12 teams have reportedly endorsed or signed up for the super league, including Real Madrid, Barcelona and Atlético Madrid from Spain; Manchester United, Liverpool, Manchester City, Arsenal, Chelsea and Tottenham from England; and Juventus, A.C. Milan and Inter from Italy. </p><p>The report suggested that each permanent member of the proposed breakaway league, which would begin in 2022, has been promised €350 million ($425 million) with JPMorgan Chase &amp; Co. in discussions to help finance the league….</p><p>Under the proposals reviewed at the time, the super league, which would play its matches in the middle of the week, sought to secure 16 top soccer franchises as permanent members and to add four qualifiers from domestic competitions. The clubs would be split into two groups of 10, with the top four teams in each group qualifying for the knockout stages, culminating in a final that would take place on a weekend.</p><p>The event would, according to the documents, generate hundreds of millions of dollars in additional revenue for the participating teams, which are already the richest clubs in the sport. (An alternative version of the plan proposed 15 permanent members and five qualification spots.) The group had entered into discussions with JPMorgan Chase &amp; Co. to raise financing for the project, according to people with knowledge of the matter. The firm has so far declined to comment.</p><p>UEFA found a powerful ally in opposition to the plans in FIFA, soccer’s global governing body. FIFA warned that any player who took part in such an unsanctioned league would be banned from appearing in the World Cup. The statement came after UEFAs president, Aleksander Ceferin, demanded support from his FIFA counterpart, Gianni Infantino, amid mounting speculation that the breakaway would have FIFA’s backing.</p><p>European soccer leaders huddled on the telephone and in video conferences over the weekend to forge a counterattack. However, finding a solution to the potential loss of the biggest brands in soccer is not an easy task. The Premier League, for example, would lose much of its sheen — and almost certainly a lot of the commercial appeal that has turned it into the richest league in soccer — should it move to banish its top six teams.</p></blockquote><p>My prediction is that severing the big teams from their domestic leagues is going to backfire, as the combination of foreign players and foreign competition, combined with the extreme convergence that will be imposed upon the new league, will cause them to be replaced by new domestic favorites.</p><p>I’m a longtime Arsenal and AC Milan supporter, but I can’t even imagine having any interest in this super league. It’s basically going to be like an All-Star game all season long. UEFA and FIFA are among the most corrupt organizations on the planet, but at least they have a genuine and substantial commitment to supporting the sport at all levels. This new league doesn’t, won’t, and can’t, it’s about nothing but TV money. Which is why <a href=\"https://www.dailymail.co.uk/sport/football/article-9484141/FIVE-Premier-League-teams-sign-European-Super-League-snub-UEFA.html\" rel=\"noopener\" target=\"_blank\">kicking out every organization and player involved</a> is the right response.</p><blockquote><p>UEFA were strong in response, announcing that every club and player that takes part in the Super League will be banned from all competitions at both European and  international level – and extends to international level and competitions including the European Championship…. The new league represents the American takeover of elite European football, which will become a closed shop run by its founder members. It is bankrolled by US banking giant JP Morgan and is the brainchild of Real Madrid president Florentino Perez and the American owners of three leading English clubs. </p></blockquote><p>In addition to being proof that too much money ruins everything, it will be an interesting test of nationalism vs financial capitalism. I won’t be surprised if the top six English teams that leave for it eventually become less popular than the teams that stay in the Premier League. </p></div>",
  "content_text": "The love of money is the root of all evil.\n70 years of success isn’t enough\nto prevent Europe’s biggest soccer teams from falling into the clutches of the bankers:\nA group made up of the biggest soccer clubs in Spain, England and Italy has agreed to join a breakaway league that has the potential to change the landscape of world soccer, according to The New York Times.\nSo far, 12 teams have reportedly endorsed or signed up for the super league, including Real Madrid, Barcelona and Atlético Madrid from Spain; Manchester United, Liverpool, Manchester City, Arsenal, Chelsea and Tottenham from England; and Juventus, A.C. Milan and Inter from Italy.\nThe report suggested that each permanent member of the proposed breakaway league, which would begin in 2022, has been promised €350 million ($425 million) with JPMorgan Chase & Co. in discussions to help finance the league….\nUnder the proposals reviewed at the time, the super league, which would play its matches in the middle of the week, sought to secure 16 top soccer franchises as permanent members and to add four qualifiers from domestic competitions. The clubs would be split into two groups of 10, with the top four teams in each group qualifying for the knockout stages, culminating in a final that would take place on a weekend.\nThe event would, according to the documents, generate hundreds of millions of dollars in additional revenue for the participating teams, which are already the richest clubs in the sport. (An alternative version of the plan proposed 15 permanent members and five qualification spots.) The group had entered into discussions with JPMorgan Chase & Co. to raise financing for the project, according to people with knowledge of the matter. The firm has so far declined to comment.\nUEFA found a powerful ally in opposition to the plans in FIFA, soccer’s global governing body. FIFA warned that any player who took part in such an unsanctioned league would be banned from appearing in the World Cup. The statement came after UEFAs president, Aleksander Ceferin, demanded support from his FIFA counterpart, Gianni Infantino, amid mounting speculation that the breakaway would have FIFA’s backing.\nEuropean soccer leaders huddled on the telephone and in video conferences over the weekend to forge a counterattack. However, finding a solution to the potential loss of the biggest brands in soccer is not an easy task. The Premier League, for example, would lose much of its sheen — and almost certainly a lot of the commercial appeal that has turned it into the richest league in soccer — should it move to banish its top six teams.\nMy prediction is that severing the big teams from their domestic leagues is going to backfire, as the combination of foreign players and foreign competition, combined with the extreme convergence that will be imposed upon the new league, will cause them to be replaced by new domestic favorites.\nI’m a longtime Arsenal and AC Milan supporter, but I can’t even imagine having any interest in this super league. It’s basically going to be like an All-Star game all season long. UEFA and FIFA are among the most corrupt organizations on the planet, but at least they have a genuine and substantial commitment to supporting the sport at all levels. This new league doesn’t, won’t, and can’t, it’s about nothing but TV money. Which is why\nkicking out every organization and player involved\nis the right response.\nUEFA were strong in response, announcing that every club and player that takes part in the Super League will be banned from all competitions at both European and  international level – and extends to international level and competitions including the European Championship…. The new league represents the American takeover of elite European football, which will become a closed shop run by its founder members. It is bankrolled by US banking giant JP Morgan and is the brainchild of Real Madrid president Florentino Perez and the American owners of three leading English clubs.\nIn addition to being proof that too much money ruins everything, it will be an interesting test of nationalism vs financial capitalism. I won’t be surprised if the top six English teams that leave for it eventually become less popular than the teams that stay in the Premier League.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-18T22:09:38+00:00"
}