{
  "url": "https://voxday.net/2021/04/29/mailvox-thats-not-a-victory/",
  "scraped_at": "2025-12-21T22:46:37.470831",
  "title": "Mailvox: that’s not a victory",
  "date_display": "April 29, 2021",
  "date_iso": "2021-04-29T18:22:07+00:00",
  "date_from_url": "2021-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>That’s a <b>fatality! </b>A reader of Corporate Cancer writes to tell of her experience fighting back against, and roundly defeating, a pair of infesting SJWs.</i></p><p>Just a note to thank you both for your book <i>Corporate Cancer</i> and for the constant refrain on your blog to never apologize and to embrace the conflict. With the help of your writing, I’ve had a complete victory over an SJW-infiltration campaign, albeit at a small and very local level.</p><p>I’m a board member of an organization that provides a direct, well regarded program to help families in our rural community gain a financial toehold. In the time that I was away from the board on maternity-leave, a Boomer-SJW and a GenX-SJW, so stereotypical they could be caricatures of themselves, took over the board and made great efforts to redirect the program so that it would primarily benefit single white women like themselves, instead of our target group of young families. We were on the verge of having our bank pull out and the entire program dying as a result. A banker friend on the board had been complaining to me about it all year, but didn’t have the tools to lead a counteroffensive.</p><p>In my first meeting back on the board, Boomer-SJW and GenX-SJW pressured the board into passing a vote that was a blatantly illegal act of self-dealing, in favor of their SJW-oriented vision. It also became clear that GenX-SJW had A LOT of time on her hands and was making up problems for herself to spend months solving. </p><p><i>Corporate Cancer</i> and a search of your blog for relevant posts, gave me the framework to explain to Banker what was happening. I was able to pull out a copy of <i>Rules for Radicals</i> and show Banker that GenX-SJW was applying about five of the rules to purposefully derail our organization in favor of her vision, that she likely had training in how to do this, and was doing it on purpose. Banker was astounded. We were able to build an anti-SJW coalition that included our executive director, treasurer, and vice president.</p><p>Following the advice in<i> Corporate Cancer</i> to kill them with the rules, I sent out a lengthy email holding up the illegal vote against our bylaws and state laws, and asking the board to rescind the vote and conduct it legally. </p><p><span><a name=\"more\"></a></span></p><p>I promptly received an email, copied to the whole board, from Boomer-SJW about how she was too upset to even consider my arguments because my email was so mean that she had been crying since receiving it. I “replied all” to the entire board with a one liner saying “Regardless of your feelings on the matter, the action is still illegal and needs to be rescinded.” </p><p>She followed up, to me alone, with a long wall-of-text email about her feelings and how she had been crying for three days and how mean I was by “sea-gulling” her (apparently this means, swooping in and “crapping” on someone’s head). She insisted that I owed the whole board a public apology for being mean.</p><p>At this point you happened to have a week of posts about not surrendering, never apologizing, and embracing conflict that could not have been better timed for encouraging me to stay the course. After consulting with the ED and Banker, and laying out a six-month plan with the Banker to “trigger” the SJWs into quitting, I re-read many of your posts on these topics, and found the courage to pen a response including lines such as “If you think that a homeschooling mother three taking six hours of her Sunday to provide you with over $1500 of free legal advice is “crapping” on you – I can’t help you with that,” “I will not apologize. I have done nothing wrong and am not in the business of issuing insincere apologies,” and “I’m also a sensitive person – in this case sensitive to our board deciding to take illegal action that harms our beneficiaries.” </p><p>She stopped telling me about how much she was crying.</p><p>From there, I launched a campaign to take away GenX-SJW’s biggest pet projects by outsourcing them to a specialist attorney, effectively sidelining her. Throughout, I maintained a calm, professional demeanor, and expressed my bafflement that Boomer-SJW and GenX-SJW were so emotional about it all. I reassured the board president and the executive director that I wasn’t upset, wasn’t taking it personally, and was not at all considering quitting. </p><p>And the drama seriously escalated, with GenX-SWJ losing her mind in Zoom meeting – head in hands, pulling at her hair, accusing everyone on the board personally of corruption for not giving her what she wanted, and declaring our employees to be derelict in their duty because in their shoes she would do more [magically impossible things, like having our bank recruit other banks to fund us] “BECAUSE I’M AN ACTIVIST!” In private conversations afterwards, the employees and other board members were actually using the words “mentally unwell,” “unstable,” and “needs help.”  She followed up with an email making mountains out of mole hills, and appointing all of the work of fixing it to herself, or else she would quit. I’m not privy to what actions the board president took, but the next communication was her resignation letter.</p><p>Left on her lonesome, Boomer-SJW and her feelings didn’t know what to do with themselves, and she resigned just a month later. All-in-all our six month counteroffensive only took four months to come to completion, and really only three actions: holding them to the rules, not apologizing, and focusing on deliverables and deadlines to be performed by the most competent person available. </p><p>To the best of my knowledge, GenX SJW is devoting her newfound freetime to “Conversations about Decolonization” and Boomer-SJW is “Working on Climate Change.”</p><p>Our meetings are back on track, our program is focusing on our intended beneficiaries, we have a competent lawyer helping us, and we’re getting ready for our phase-two roll out. We’ve cut both the meeting times and the number of committee meetings in half and are getting twice as much work done. </p><p>All of which is to say thank you – for providing the framework, vocabulary, and encouragement that helped me excise the cancer from our organization. In terms of real-world impact, your writings and blog posts on this topic have helped keep [families] on the path to homeownership, when the project would otherwise be dead.</p></div>",
  "content_text": "That’s a\nfatality!\nA reader of Corporate Cancer writes to tell of her experience fighting back against, and roundly defeating, a pair of infesting SJWs.\nJust a note to thank you both for your book\nCorporate Cancer\nand for the constant refrain on your blog to never apologize and to embrace the conflict. With the help of your writing, I’ve had a complete victory over an SJW-infiltration campaign, albeit at a small and very local level.\nI’m a board member of an organization that provides a direct, well regarded program to help families in our rural community gain a financial toehold. In the time that I was away from the board on maternity-leave, a Boomer-SJW and a GenX-SJW, so stereotypical they could be caricatures of themselves, took over the board and made great efforts to redirect the program so that it would primarily benefit single white women like themselves, instead of our target group of young families. We were on the verge of having our bank pull out and the entire program dying as a result. A banker friend on the board had been complaining to me about it all year, but didn’t have the tools to lead a counteroffensive.\nIn my first meeting back on the board, Boomer-SJW and GenX-SJW pressured the board into passing a vote that was a blatantly illegal act of self-dealing, in favor of their SJW-oriented vision. It also became clear that GenX-SJW had A LOT of time on her hands and was making up problems for herself to spend months solving.\nCorporate Cancer\nand a search of your blog for relevant posts, gave me the framework to explain to Banker what was happening. I was able to pull out a copy of\nRules for Radicals\nand show Banker that GenX-SJW was applying about five of the rules to purposefully derail our organization in favor of her vision, that she likely had training in how to do this, and was doing it on purpose. Banker was astounded. We were able to build an anti-SJW coalition that included our executive director, treasurer, and vice president.\nFollowing the advice in\nCorporate Cancer\nto kill them with the rules, I sent out a lengthy email holding up the illegal vote against our bylaws and state laws, and asking the board to rescind the vote and conduct it legally.\nI promptly received an email, copied to the whole board, from Boomer-SJW about how she was too upset to even consider my arguments because my email was so mean that she had been crying since receiving it. I “replied all” to the entire board with a one liner saying “Regardless of your feelings on the matter, the action is still illegal and needs to be rescinded.”\nShe followed up, to me alone, with a long wall-of-text email about her feelings and how she had been crying for three days and how mean I was by “sea-gulling” her (apparently this means, swooping in and “crapping” on someone’s head). She insisted that I owed the whole board a public apology for being mean.\nAt this point you happened to have a week of posts about not surrendering, never apologizing, and embracing conflict that could not have been better timed for encouraging me to stay the course. After consulting with the ED and Banker, and laying out a six-month plan with the Banker to “trigger” the SJWs into quitting, I re-read many of your posts on these topics, and found the courage to pen a response including lines such as “If you think that a homeschooling mother three taking six hours of her Sunday to provide you with over $1500 of free legal advice is “crapping” on you – I can’t help you with that,” “I will not apologize. I have done nothing wrong and am not in the business of issuing insincere apologies,” and “I’m also a sensitive person – in this case sensitive to our board deciding to take illegal action that harms our beneficiaries.”\nShe stopped telling me about how much she was crying.\nFrom there, I launched a campaign to take away GenX-SJW’s biggest pet projects by outsourcing them to a specialist attorney, effectively sidelining her. Throughout, I maintained a calm, professional demeanor, and expressed my bafflement that Boomer-SJW and GenX-SJW were so emotional about it all. I reassured the board president and the executive director that I wasn’t upset, wasn’t taking it personally, and was not at all considering quitting.\nAnd the drama seriously escalated, with GenX-SWJ losing her mind in Zoom meeting – head in hands, pulling at her hair, accusing everyone on the board personally of corruption for not giving her what she wanted, and declaring our employees to be derelict in their duty because in their shoes she would do more [magically impossible things, like having our bank recruit other banks to fund us] “BECAUSE I’M AN ACTIVIST!” In private conversations afterwards, the employees and other board members were actually using the words “mentally unwell,” “unstable,” and “needs help.”  She followed up with an email making mountains out of mole hills, and appointing all of the work of fixing it to herself, or else she would quit. I’m not privy to what actions the board president took, but the next communication was her resignation letter.\nLeft on her lonesome, Boomer-SJW and her feelings didn’t know what to do with themselves, and she resigned just a month later. All-in-all our six month counteroffensive only took four months to come to completion, and really only three actions: holding them to the rules, not apologizing, and focusing on deliverables and deadlines to be performed by the most competent person available.\nTo the best of my knowledge, GenX SJW is devoting her newfound freetime to “Conversations about Decolonization” and Boomer-SJW is “Working on Climate Change.”\nOur meetings are back on track, our program is focusing on our intended beneficiaries, we have a competent lawyer helping us, and we’re getting ready for our phase-two roll out. We’ve cut both the meeting times and the number of committee meetings in half and are getting twice as much work done.\nAll of which is to say thank you – for providing the framework, vocabulary, and encouragement that helped me excise the cancer from our organization. In terms of real-world impact, your writings and blog posts on this topic have helped keep [families] on the path to homeownership, when the project would otherwise be dead.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-29T17:22:07+00:00"
}