{
  "url": "https://voxday.net/2021/04/29/marvel-is-very-unhappy/",
  "scraped_at": "2025-12-21T22:46:33.414035",
  "title": "“Marvel is very unhappy”",
  "date_display": "April 29, 2021",
  "date_iso": "2021-04-29T14:31:04+00:00",
  "date_from_url": "2021-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i> EXTERIOR. Day. A Jurassic jungle. </i></p><p><i>Dinosaurs amble about doing nothing in particular. A light flashes across the sky. A few dinosaurs look up at the light, but most don’t even notice. In the distance, somewhere far beyond the horizon, there is a faint booming sound.</i></p><p><i>MARVELSAURUS REX: What was that?</i></p><p><i>DEECEEATOPS: What was what?</i></p><p><i>DARKEQUESAURUS: Wha? I didn’t see nothin’!</i></p><p><i>MARVELSAURUS REX: I just… I just have a very bad feeling about this.</i></p><p>And…scene!</p><p>A writer who is almost entirely unfamiliar with comics sent me the following email two days ago, which demonstrates that unlike the independent comic scene and its mainstream peers, Marvel is already beginning to grasp that <a href=\"https://www.arkhaven.com/\" rel=\"noopener\" target=\"_blank\">Arkhaven’s new digital comics site, Arktoons</a>, poses a serious existential threat to the mainstream comics industry:</p><blockquote><p>I was in [top ten US city by population] recently, and dropped into a comic book store to see what they looked like. I’ve never been into comics at all, so this is a new field to me.</p><p>The manager was having a discussion behind the cash register with two of his staff, and I couldn’t help overhearing their conversation as I looked around.  Paraphrased, the manager was telling them that Marvel was “very unhappy” about the new Arktoons initiative, coming as it does on top of the Arkhaven Comics venture.  The money quote was something like, “They say the industry’s overcrowded and underfunded enough as it is – we don’t need more competition trying to muscle in and make everybody unprofitable”.</p><p>Arktoons is already making an impact, along with Arkhaven.  Congratulations!</p></blockquote><p>I’m genuinely impressed that someone at Marvel managed to figure out the situation so quickly. They realize that none of the market leaders will be able to even begin to compete with high-quality independent comics offering a 30x value proposition to their readers. It could take a year, it could take five years, but it’s just a matter of the inevitable playing out over time now.</p><p>Meanwhile, DC is too busy <a href=\"https://boundingintocomics.com/2021/04/28/rumor-snyderverse-over-as-walter-hamada-seeks-to-keep-costs-down-hand-dc-films-over-to-bad-robot/\" rel=\"noopener\" target=\"_blank\">slitting its own metaphorical wrists</a> to even notice that its extinction event just took place.</p><blockquote><p>New intel suggests DC Films President Walter Hamada has one job WarnerMedia expects him to accomplish: produce projects on the cheap to keep costs down. Sadly, this could mean the end of the Snyderverse.</p><p>A source close to Small Screen gave the site a full scoop that details Warner’s goals, Hamada’s task, and how JJ Abrams’ and his firm Bad Robot fits in to their plan. Long story short, Hamada is allegedly counting on Bad Robot to do most of the heavy lifting and take over operations of DC behind and in front of the camera.</p><p>“What I can tell you is that the last I heard, Walter wanted to hand over almost all the DC stuff over to BR [Bad Robot],” said the source. </p></blockquote><p>JJ Abrams is a serial killer of popular franchises. It’s at the point where I’m beginning to wonder if he is a secret agent in the employ of the Chinese movie industry on a mission to destroy the Hellmouth. </p><p>Impact Day was entirely successful, as Episode 1 of THE HAMMER OF FREEDOM eked out a surprise victory on the popularity front, beating out Episode 1 of MIDNIGHT’S WAR by just 2 likes. This was a bit of a surprise, to be honest, as prior to launch, most of the team felt that MW and AH would be the most popular, with GO MONSTER GO! having an outside shot at the Day One title simply by virtue of being created and written by The Legend.  And DEUS VULT more than held its own.</p><p>This just testifies to what a strong lineup is being featured on Wednesdays. But as you’ll see later today, the Thursday lineup is very nearly as formidable. And if this inspires those of you with soft hearts to help those poor converged dinosaurs go extinct sooner rather than later, don’t hesitate to <a href=\"https://arkhavencomics.com/product-category/subscriptions/arktoons/?orderby=price&amp;q={3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08}2Fproduct-category{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08}2Fsubscriptions{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08}2Farktoons{3549d4179a0cbfd35266a886b325f66920645bb4445f165578a9e086cbc22d08}2F\" rel=\"noopener\" target=\"_blank\">subscribe to Arktoons</a>.</p><p>So congratulations to Luciano and the Super Prumo team for winning Day One. As a consolation prize, however, MIDNIGHT’S WAR does already boast <a href=\"https://astalnar.blogspot.com/2021/04/heroforge-midnights-war.html\" rel=\"noopener\" target=\"_blank\">its own fan-created Heroforge version</a> of Andre St. Jean, the iconic Knight of St. Michael and the Catacombs of Rome.</p><p><b>NOTE TO SUBSCRIBERS: </b>You have absolutely no need to log in to the Arktoons site. The login there is for the creators and publishers. To read the comics,<i> just click on them.</i> When subscription-dependent features are added, such as comments and ratings, you will be informed.</p></div>",
  "content_text": "EXTERIOR. Day. A Jurassic jungle.\nDinosaurs amble about doing nothing in particular. A light flashes across the sky. A few dinosaurs look up at the light, but most don’t even notice. In the distance, somewhere far beyond the horizon, there is a faint booming sound.\nMARVELSAURUS REX: What was that?\nDEECEEATOPS: What was what?\nDARKEQUESAURUS: Wha? I didn’t see nothin’!\nMARVELSAURUS REX: I just… I just have a very bad feeling about this.\nAnd…scene!\nA writer who is almost entirely unfamiliar with comics sent me the following email two days ago, which demonstrates that unlike the independent comic scene and its mainstream peers, Marvel is already beginning to grasp that\nArkhaven’s new digital comics site, Arktoons\n, poses a serious existential threat to the mainstream comics industry:\nI was in [top ten US city by population] recently, and dropped into a comic book store to see what they looked like. I’ve never been into comics at all, so this is a new field to me.\nThe manager was having a discussion behind the cash register with two of his staff, and I couldn’t help overhearing their conversation as I looked around.  Paraphrased, the manager was telling them that Marvel was “very unhappy” about the new Arktoons initiative, coming as it does on top of the Arkhaven Comics venture.  The money quote was something like, “They say the industry’s overcrowded and underfunded enough as it is – we don’t need more competition trying to muscle in and make everybody unprofitable”.\nArktoons is already making an impact, along with Arkhaven.  Congratulations!\nI’m genuinely impressed that someone at Marvel managed to figure out the situation so quickly. They realize that none of the market leaders will be able to even begin to compete with high-quality independent comics offering a 30x value proposition to their readers. It could take a year, it could take five years, but it’s just a matter of the inevitable playing out over time now.\nMeanwhile, DC is too busy\nslitting its own metaphorical wrists\nto even notice that its extinction event just took place.\nNew intel suggests DC Films President Walter Hamada has one job WarnerMedia expects him to accomplish: produce projects on the cheap to keep costs down. Sadly, this could mean the end of the Snyderverse.\nA source close to Small Screen gave the site a full scoop that details Warner’s goals, Hamada’s task, and how JJ Abrams’ and his firm Bad Robot fits in to their plan. Long story short, Hamada is allegedly counting on Bad Robot to do most of the heavy lifting and take over operations of DC behind and in front of the camera.\n“What I can tell you is that the last I heard, Walter wanted to hand over almost all the DC stuff over to BR [Bad Robot],” said the source.\nJJ Abrams is a serial killer of popular franchises. It’s at the point where I’m beginning to wonder if he is a secret agent in the employ of the Chinese movie industry on a mission to destroy the Hellmouth.\nImpact Day was entirely successful, as Episode 1 of THE HAMMER OF FREEDOM eked out a surprise victory on the popularity front, beating out Episode 1 of MIDNIGHT’S WAR by just 2 likes. This was a bit of a surprise, to be honest, as prior to launch, most of the team felt that MW and AH would be the most popular, with GO MONSTER GO! having an outside shot at the Day One title simply by virtue of being created and written by The Legend.  And DEUS VULT more than held its own.\nThis just testifies to what a strong lineup is being featured on Wednesdays. But as you’ll see later today, the Thursday lineup is very nearly as formidable. And if this inspires those of you with soft hearts to help those poor converged dinosaurs go extinct sooner rather than later, don’t hesitate to\nsubscribe to Arktoons\n.\nSo congratulations to Luciano and the Super Prumo team for winning Day One. As a consolation prize, however, MIDNIGHT’S WAR does already boast\nits own fan-created Heroforge version\nof Andre St. Jean, the iconic Knight of St. Michael and the Catacombs of Rome.\nNOTE TO SUBSCRIBERS:\nYou have absolutely no need to log in to the Arktoons site. The login there is for the creators and publishers. To read the comics,\njust click on them.\nWhen subscription-dependent features are added, such as comments and ratings, you will be informed.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-29T13:31:04+00:00"
}