{
  "url": "https://voxday.net/2021/04/08/michelle-calls-out-the-neoclowns/",
  "scraped_at": "2025-12-21T22:43:48.162521",
  "title": "Michelle calls out the neoclowns",
  "date_display": "April 8, 2021",
  "date_iso": "2021-04-08T00:04:19+00:00",
  "date_from_url": "2021-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been justifiably hard on Michelle Malkin over the years. She’s still never, to my knowledge, come clean about her lack of research concerning the complete absence of any threat posed to the US West Coast by Japan in 1941. But she’s clearly got no shortage of steel in her spine, because she’s openly calling out what appears to be the latest subversion by the country that publicly claims to be a great ally, but too often <a href=\"https://gab.com/MichelleMalkin/posts/106024531547934977\" rel=\"noopener\" target=\"_blank\">behaves like a mortal enemy</a>:</p><blockquote><p>Two things can be true: 1) Gaetz may well have engaged in vile behavior, perhaps even worse and more sordid than what has been alleged so far AND 2) Israel/Mossad is at work using all of the involved Beltway and Florida figures as honey-pot puppets on a much grander theatrical stage…as they have done in the past and continue to do in the present. I don’t know what specifically the aim is here — drawing the US into war with Iran, something to do with Ukraine/Russia, who the hell knows. </p><p>But the most important takeaway is this isn’t what “greatest allies” are supposed to be doing to each other, right? It is, however, what Russia and China and Israel and other sovereign nations’ intelligence apparatuses do to their rivals. Pattern recognition is fundamental. </p><p>The second most important takeaway is to recruit and promote a better generation of upright, disciplined, un-blackmail-able America First politicians and leaders. Otherwise, it will be business as usual in the spook-infested America Last Swamp. Time for normie Republicans to open their eyes and de-condition themselves from their reflexive stances on so many things. “Greatest ally” my ass. Stop staring at the shadows inside the cave. Look behind you.</p></blockquote><p>Blackmail culture is subversive, destructive, and literally both unAmerican and anti-Western. As I mentioned in tonight’s Darkstream, the only way to stay afloat in a sea of lies is to relentlessly tell the truth. That’s not possible for ticket takers and those who “succeed” by selling their souls.</p><p>And the only way to combat the evil, the ugly, and the lie is to relentlessly stand up and support the Good, the Beautiful, and the True.</p></div>",
  "content_text": "I’ve been justifiably hard on Michelle Malkin over the years. She’s still never, to my knowledge, come clean about her lack of research concerning the complete absence of any threat posed to the US West Coast by Japan in 1941. But she’s clearly got no shortage of steel in her spine, because she’s openly calling out what appears to be the latest subversion by the country that publicly claims to be a great ally, but too often\nbehaves like a mortal enemy\n:\nTwo things can be true: 1) Gaetz may well have engaged in vile behavior, perhaps even worse and more sordid than what has been alleged so far AND 2) Israel/Mossad is at work using all of the involved Beltway and Florida figures as honey-pot puppets on a much grander theatrical stage…as they have done in the past and continue to do in the present. I don’t know what specifically the aim is here — drawing the US into war with Iran, something to do with Ukraine/Russia, who the hell knows.\nBut the most important takeaway is this isn’t what “greatest allies” are supposed to be doing to each other, right? It is, however, what Russia and China and Israel and other sovereign nations’ intelligence apparatuses do to their rivals. Pattern recognition is fundamental.\nThe second most important takeaway is to recruit and promote a better generation of upright, disciplined, un-blackmail-able America First politicians and leaders. Otherwise, it will be business as usual in the spook-infested America Last Swamp. Time for normie Republicans to open their eyes and de-condition themselves from their reflexive stances on so many things. “Greatest ally” my ass. Stop staring at the shadows inside the cave. Look behind you.\nBlackmail culture is subversive, destructive, and literally both unAmerican and anti-Western. As I mentioned in tonight’s Darkstream, the only way to stay afloat in a sea of lies is to relentlessly tell the truth. That’s not possible for ticket takers and those who “succeed” by selling their souls.\nAnd the only way to combat the evil, the ugly, and the lie is to relentlessly stand up and support the Good, the Beautiful, and the True.",
  "tags": [
    "neoclowns"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-07T23:04:19+00:00"
}