{
  "url": "https://voxday.net/2021/04/20/portland-envy/",
  "scraped_at": "2025-12-21T22:45:16.403204",
  "title": "Portland envy",
  "date_display": "April 20, 2021",
  "date_iso": "2021-04-20T12:30:04+00:00",
  "date_from_url": "2021-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Back in the day, the city that used to call itself “The Minneapple” had New York City envy. The local media wouldn’t cover any local figure who hadn’t proved himself on the big stage of the national scene, which in practical terms usually meant a mention somewhere in <i>The New York Times</i>. These days, however, Minneapolis has Portland envy, as the City Council and the Mayor are clearly hell-bent on obtaining more international publicity <a href=\"https://pjmedia.com/news-and-politics/stacey-lennox/2021/04/19/minneapolis-city-council-seeks-to-ensure-the-city-will-burn-by-signaling-they-wish-to-cripple-police-response-n1440964?utm_source=piano&amp;utm_medium=onsite&amp;utm_campaign=582\" rel=\"noopener\" target=\"_blank\">by allowing the city to burn</a> later this week:</p><blockquote><p>The Minneapolis City Council, in an unbelievable move, given the powder keg on their doorstep, voted 11-1 to oppose the use of tear gas and other non-lethal munitions in response to civil disorder. It would be fair to wonder if someone dropped these 11 elected leaders on their heads as children. In the last 48 hours, we have had a sitting member of Congress, Representative Maxine Waters (D-Calif.), inciting violence if former officer Derek Chauvin is convicted of murder, and two National Guardsman injured in a drive-by shooting. The Chauvin trial is in closing arguments, and the jury is expected to begin deliberating with the threat of mob justice over their heads.</p><p>Luckily, this vote is, to some extent, worthless virtue signaling. Mayor Jacob Frey controls the Minneapolis Police Department, which he completely demoralized and ruined during last summer’s riots. Hopefully, he will ignore the insane members of the city council. </p></blockquote><p>The mayor isn’t going to ignore the insane City Council. To the contrary, he’s going to literally fan the flames of their lunacy. Frey doesn’t give a fragment of a damn about Minneapolis or Minnesotans, being yet another Jew parachuted into the state from the East Coast in order to win his political spurs prior to a career on the national stage, like Senators Boschwitz, Wellstone, and Coleman before him. </p><p>The point is that preventing a riot that would lead the international news for days doesn’t serve Frey’s political ambitions. Remember how he milked the moment when he put on that little show of sobbing before St. Floyd’s golden coffin? Sure, he’s a terrible actor, but there is no chance he’s going to miss the moment to put himself on center stage again with the backdrop of a city in flames.</p></div>",
  "content_text": "Back in the day, the city that used to call itself “The Minneapple” had New York City envy. The local media wouldn’t cover any local figure who hadn’t proved himself on the big stage of the national scene, which in practical terms usually meant a mention somewhere in\nThe New York Times\n. These days, however, Minneapolis has Portland envy, as the City Council and the Mayor are clearly hell-bent on obtaining more international publicity\nby allowing the city to burn\nlater this week:\nThe Minneapolis City Council, in an unbelievable move, given the powder keg on their doorstep, voted 11-1 to oppose the use of tear gas and other non-lethal munitions in response to civil disorder. It would be fair to wonder if someone dropped these 11 elected leaders on their heads as children. In the last 48 hours, we have had a sitting member of Congress, Representative Maxine Waters (D-Calif.), inciting violence if former officer Derek Chauvin is convicted of murder, and two National Guardsman injured in a drive-by shooting. The Chauvin trial is in closing arguments, and the jury is expected to begin deliberating with the threat of mob justice over their heads.\nLuckily, this vote is, to some extent, worthless virtue signaling. Mayor Jacob Frey controls the Minneapolis Police Department, which he completely demoralized and ruined during last summer’s riots. Hopefully, he will ignore the insane members of the city council.\nThe mayor isn’t going to ignore the insane City Council. To the contrary, he’s going to literally fan the flames of their lunacy. Frey doesn’t give a fragment of a damn about Minneapolis or Minnesotans, being yet another Jew parachuted into the state from the East Coast in order to win his political spurs prior to a career on the national stage, like Senators Boschwitz, Wellstone, and Coleman before him.\nThe point is that preventing a riot that would lead the international news for days doesn’t serve Frey’s political ambitions. Remember how he milked the moment when he put on that little show of sobbing before St. Floyd’s golden coffin? Sure, he’s a terrible actor, but there is no chance he’s going to miss the moment to put himself on center stage again with the backdrop of a city in flames.",
  "tags": [
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-20T11:30:04+00:00"
}