{
  "url": "https://voxday.net/2021/04/03/the-media-discovers-2033/",
  "scraped_at": "2025-12-21T22:43:19.058439",
  "title": "The media discovers 2033",
  "date_display": "April 3, 2021",
  "date_iso": "2021-04-03T12:30:03+00:00",
  "date_from_url": "2021-04-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Laura Ingraham talked to a historian about the coming breakup of the USA on Fox:</p><div></div><blockquote><div><b>Ingraham:</b> Historian Craig Shirley writes our country is in a vicious toxic relationship with itself. Like any toxic relationship, the only inevitable eventuality is that it will mercifully end with breakup. I don’t see any sort of viable path forward at the rate we’re going. Author and historian Craig Shirley joins me now. Is there really no path in your mind to reconciliation?</div><div></div><div><b>Shirley:</b> No, I don’t think so, Laura. Look, we had national glue in the past to hold us together as a nation. We had Manifest Destiny, the Great Depression, we had wars and other activities. Covid should have been the national glue holding us together but it wasn’t. In fact, it drove us further apart. You saw states arguing with states, and states arguing with the national government about how to proceed, how to distribute vaccines. No, I don’t see any choice going forward. It may be a natural thing. Like a Brexit only in the United States, where states, blue states and red states, separate and have some type of friendly trading relationship or friendly transportation relationship, but they are all self-governed. Which is really what the founders intended in the first place.</div></blockquote><p>Demographics is destiny. The dirt is not magic. The civnats have inverted reality and their basic concept entirely backwards: Mexicans are not people who happen to live inside lines on a map called Mexico, Mexico is where Mexicans live. The breakup of the USA is already inevitable and it has been since 1965. But now the concept is being normalized. </p><p>Therefore, it’s time to make sure you’re on the right side of the borders-to-be.</p><div></div></div>",
  "content_text": "Laura Ingraham talked to a historian about the coming breakup of the USA on Fox:\nIngraham:\nHistorian Craig Shirley writes our country is in a vicious toxic relationship with itself. Like any toxic relationship, the only inevitable eventuality is that it will mercifully end with breakup. I don’t see any sort of viable path forward at the rate we’re going. Author and historian Craig Shirley joins me now. Is there really no path in your mind to reconciliation?\nShirley:\nNo, I don’t think so, Laura. Look, we had national glue in the past to hold us together as a nation. We had Manifest Destiny, the Great Depression, we had wars and other activities. Covid should have been the national glue holding us together but it wasn’t. In fact, it drove us further apart. You saw states arguing with states, and states arguing with the national government about how to proceed, how to distribute vaccines. No, I don’t see any choice going forward. It may be a natural thing. Like a Brexit only in the United States, where states, blue states and red states, separate and have some type of friendly trading relationship or friendly transportation relationship, but they are all self-governed. Which is really what the founders intended in the first place.\nDemographics is destiny. The dirt is not magic. The civnats have inverted reality and their basic concept entirely backwards: Mexicans are not people who happen to live inside lines on a map called Mexico, Mexico is where Mexicans live. The breakup of the USA is already inevitable and it has been since 1965. But now the concept is being normalized.\nTherefore, it’s time to make sure you’re on the right side of the borders-to-be.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-03T11:30:03+00:00"
}