{
  "url": "https://voxday.net/2021/04/01/the-cucks-cry/",
  "scraped_at": "2025-12-21T22:43:06.171365",
  "title": "The cucks cry",
  "date_display": "April 1, 2021",
  "date_iso": "2021-04-01T16:18:05+00:00",
  "date_from_url": "2021-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Perhaps if elected Republicans had ever done a single damn thing to fight the growth of Cancel Culture instead of desperately reassuring everyone that they love blacks, Jews, and foreigners more than their own children, one might be inclined to feel a modicum of sympathy for <a href=\"https://townhall.com/columnists/johnalbers/2021/03/30/cancel-culture-comes-to-georgia-and-comes-for-me-n2587091\" rel=\"noopener\" target=\"_blank\">two Georgia state legislators who lost their job</a>s due to “a series of tweets” by the sexual predators at The Lincoln Project.</p><blockquote><p>Last week, in a span of 24 hours, my reputation and business were destroyed by a series of tweets in which The Lincoln Project knowingly lied about me. Among other things, they falsely accused me of trying to “suppress voters and people” in several tweets that also tagged my employer and several of its well-known clients. The goal was to cancel me and inflict as much harm as possible, and they succeeded. Unfortunately, disgusting tactics like these are becoming the norm and the truth does not seem to matter anymore.</p><p>The truth is that I co-sponsored and voted for bi-partisan Georgia Senate Bill 62, which provides ballots in the state of Georgia to have a watermark, seal, and other security elements to include the precinct number—which are best practices. I did not sponsor or vote in favor of other recent bills in Georgia that sought to limit no excuse absentee balloting and reduce weekend voting. As a matter of fact, some groups attacked me for not supporting these other measures. My record is crystal clear. I believe voting is a sacred right and should be available, transparent, and secure for all citizens. I am proud of my work in this area.</p><p>The fact that I serve in elected office does not justify what happened to me. I am also a husband and father, as well as a source of income for my family and many other people who worked for me in the private sector. In Georgia, we are a citizen’s legislature and considered part-time. I do not earn my living serving as a state Senator. In fact, I donated my $17,000 a year salary to charity. I earned a living in business. I worked with incredible people, built a great team, and we were very successful.</p><p>Even though The Lincoln Project is plagued by well-publicized allegations of sexual harassment and financial impropriety that have been covered by almost every major media outlet, its “words matter” and have had devastating consequences. Because of their tweets, I have already been falsely labeled, lost my job, and received threats against my entire family.</p></blockquote><p>Even after being successfully canceled, conservatives still don’t learn. They would rather cry about “disgusting tactics” to the enemy media rather than author a fucking law to do something about it. But those “disgusting tactics” are not becoming the norm, they are the norm. They were becoming the norm back in 2005 when people like me were being attacked by the SFWA and the ADL, with the full approval of conservatives who were more than happy to distance themselves from “extremists” and “nationalists” and “supremacists”.</p><p>Don’t ever support a conservative. There is absolutely no point in doing so. They don’t fight. They will never fight, not even when their backs are up against the wall. They permitted the weaponization of social media by making the technology companies legally unaccountable under Section 230 and their own literally blasphemous free speech dogma.</p><p>I see that people sometimes wonder why the Left keeps pushing its agenda when so many conservative Americans are armed.</p><p>It’s because they know perfectly well that all those conservatives are ever going to do is issue dire warnings and wag their fingers about the possibility that someone else is eventually going to do something about it.</p></div>",
  "content_text": "Perhaps if elected Republicans had ever done a single damn thing to fight the growth of Cancel Culture instead of desperately reassuring everyone that they love blacks, Jews, and foreigners more than their own children, one might be inclined to feel a modicum of sympathy for\ntwo Georgia state legislators who lost their job\ns due to “a series of tweets” by the sexual predators at The Lincoln Project.\nLast week, in a span of 24 hours, my reputation and business were destroyed by a series of tweets in which The Lincoln Project knowingly lied about me. Among other things, they falsely accused me of trying to “suppress voters and people” in several tweets that also tagged my employer and several of its well-known clients. The goal was to cancel me and inflict as much harm as possible, and they succeeded. Unfortunately, disgusting tactics like these are becoming the norm and the truth does not seem to matter anymore.\nThe truth is that I co-sponsored and voted for bi-partisan Georgia Senate Bill 62, which provides ballots in the state of Georgia to have a watermark, seal, and other security elements to include the precinct number—which are best practices. I did not sponsor or vote in favor of other recent bills in Georgia that sought to limit no excuse absentee balloting and reduce weekend voting. As a matter of fact, some groups attacked me for not supporting these other measures. My record is crystal clear. I believe voting is a sacred right and should be available, transparent, and secure for all citizens. I am proud of my work in this area.\nThe fact that I serve in elected office does not justify what happened to me. I am also a husband and father, as well as a source of income for my family and many other people who worked for me in the private sector. In Georgia, we are a citizen’s legislature and considered part-time. I do not earn my living serving as a state Senator. In fact, I donated my $17,000 a year salary to charity. I earned a living in business. I worked with incredible people, built a great team, and we were very successful.\nEven though The Lincoln Project is plagued by well-publicized allegations of sexual harassment and financial impropriety that have been covered by almost every major media outlet, its “words matter” and have had devastating consequences. Because of their tweets, I have already been falsely labeled, lost my job, and received threats against my entire family.\nEven after being successfully canceled, conservatives still don’t learn. They would rather cry about “disgusting tactics” to the enemy media rather than author a fucking law to do something about it. But those “disgusting tactics” are not becoming the norm, they are the norm. They were becoming the norm back in 2005 when people like me were being attacked by the SFWA and the ADL, with the full approval of conservatives who were more than happy to distance themselves from “extremists” and “nationalists” and “supremacists”.\nDon’t ever support a conservative. There is absolutely no point in doing so. They don’t fight. They will never fight, not even when their backs are up against the wall. They permitted the weaponization of social media by making the technology companies legally unaccountable under Section 230 and their own literally blasphemous free speech dogma.\nI see that people sometimes wonder why the Left keeps pushing its agenda when so many conservative Americans are armed.\nIt’s because they know perfectly well that all those conservatives are ever going to do is issue dire warnings and wag their fingers about the possibility that someone else is eventually going to do something about it.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-01T15:18:05+00:00"
}