{
  "url": "https://voxday.net/2021/04/27/the-noble-lie-of-the-proposition-nation/",
  "scraped_at": "2025-12-21T22:46:15.455304",
  "title": "The Noble Lie of the Proposition Nation",
  "date_display": "April 27, 2021",
  "date_iso": "2021-04-27T10:38:34+00:00",
  "date_from_url": "2021-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Conservative civnattery can never save the USA because civic nationalism was always a banner waved by those who sought to destroy the American nation and replace the republic of the sovereign States with an empire. Brion McClanahan demonstrates that both the 1619 Project of the SJWs and the 1776 Commission of the conservatives are designed<a href=\"https://www.chroniclesmagazine.org/rejecting-the--proposition-nation-/\" rel=\"noopener\" target=\"_blank\"> to push an entirely false and ahistoric revision of the founding of the United States of America</a> on the maleducated children of the empire:</p><blockquote><p>Hannah-Jones considers the United States to be a “nation founded on both an ideal and a lie.” The ideal is that “all mean are created equal” with “certain unalienable rights,” i.e., the “proposition nation.” But, unlike the Straussians, Hannah-Jones does not let Northern white men off the hook, for she sees them as as complicit as Southerners in betraying that ideal. She summarizes the core position of “The 1619 Project” as follows:</p><p> Yet despite being violently denied the freedom and justice promised to all, black Americans believed fervently in the American creed. Through centuries of black resistance and protest, we have helped the country live up to its founding ideals. And not only for ourselves—black rights struggles paved the way for every other rights struggle, including women’s and gay rights, immigrant and disability rights.</p><p> To the Straussians who crafted “The 1776 Report” and their conservative pundit allies like Dinesh D’Souza, Glenn Beck, and the late Rush Limbaugh, not all white Americans should be blamed for the sins of the South. In their view, there were “good” white Americans—abolitionists, Northern members of the founding generation, and Lincoln—who recognized the inhumanity of slavery and tried to end it. Even Southern members of the founding generation, including Jefferson himself, but also Washington, Madison, Mason, and a host of other Virginians, thought enough of humanity to pave the way for Lincoln to revolutionize the Revolution in the Gettysburg Address.</p><p> “The 1776 Report” suggests that the founders (not excluding those who hailed from Southern states) created the mechanism to end slavery through the Constitution and cannot be blamed for the evil deeds of later pro-slavery Southerners who ignored the true founding of America. More importantly, the report’s authors believe they are free from the stain of racism because they adhere to the “correct” view of American history. In other words, “Don’t blame us. We voted for Lincoln.”</p><p> Hannah-Jones, on the other hand, does not make this distinction, nor does she differentiate between Lincoln and Calhoun. Both were guilty of America’s “original sin” of racism. Neither man held views on race that are acceptable to modern Americans, let alone “woke” social justice warriors. Hannah-Jones is as critical of Lincoln’s colonization plans as of Calhoun’s “positive good” speech. Frankly, she is at least being more consistent than the self-righteous conservatives on the 1776 Commission.</p><p> The attempt by the authors of “The 1776 Report” to beg absolution from the political left for the sin of slavery is a fatal miscalculation. The left’s game is cancel culture, and it’s a game in which conservatives will always be playing defense. You cannot play the left’s game on their field and by their rules and hope for success. Charges of racism are emotional, not intellectual, and are used—successfully—to change the narrative. Instead of focusing on the contributions antebellum Americans made to Western civilization, we are instead debating who was the least racist and bigoted among them. This is unproductive.</p><p>Conservatives cannot appease the left by regurgitating its distorted vision of the founding. Placing the lofty ideals of the Declaration at the center of the founding is a distortion of history.</p><p>Consider that Jefferson himself downplayed the importance of the Declaration’s phrase “all men are created equal,” and that, for much of the period leading up to the Civil War, Jeffersonians in both the North and South championed the principles of state sovereignty, rather than those of an egalitarian, propositional nation. To Jefferson, the last paragraph, not the second, provided the most important language of the Declaration. Most of the founding generation agreed.</p><p>The story written during the debates over the Constitution in 1787 and 1788 provides a more robust and authentic American vision of the founding. The principles that predominated in those debates unified most Americans for decades and created a populist national base.</p><p>The founders drafted two constitutions for the central government and a host of state constitutions that reaffirmed their commitment to a union of states and the principles of federalism. The Constitution would not have been ratified in 1788 had the founding generation believed that the states would be consolidated into one national government.</p><p>That argument took center stage in every state ratifying convention in 1787 and 1788. Rarely was the Declaration mentioned, even in passing, and none of the founders ever referred to the line “all men are created equal” with religious reverence, contrary to what the Straussians and their leftist allies would have you believe.</p><p>For example, James Wilson of Pennsylvania made federalism a central theme of his State House Yard Speech in October 1787, just a few weeks after the Constitution had been signed in Philadelphia. Wilson mentioned the Declaration in one of his speeches before the Pennsylvania Ratifying Convention in December 1787, but only to show that the people had a right to “alter or abolish” either a state government or a central government. That was the American tradition.</p><p>Delegates to the Massachusetts Ratifying Convention in January 1788 were told that the powers of the central government would be limited to those “expressly delegated” and that the language of what would become the Tenth Amendment to the Constitution imported the same meaning as the second article of the Articles of Confederation, namely that each state retained its “sovereignty and independence.” No one mentioned Jefferson’s “all men are created equal” phrase.</p><p>Even in Virginia, the state that gave the United States the Declaration, the delegates never mentioned that document when debating the Constitution. And it was only mentioned twice during the Philadelphia Convention in 1787, in both instances by nationalists for the purpose of  arguing that the Union predated the states—a position flatly rejected by most of the men in attendance.</p><p>Despite these historical facts, the authors of “The 1776 Report” insist that “The meaning and purpose of the Constitution of 1787…cannot be understood without recourse to the principles of the Declaration of Independence….” If that’s true, then the founding generation should have made that meaning explicit during the ratification debates, or at the very least in Philadelphia. But they didn’t. “States’ rights,” not the phantasm of a proposition nation, dominated the debates between the Founding Fathers. </p></blockquote><p>Race, equality, and history make liars of every conservative. The undeniable fact that they are not dedicated to the truth, but are rather committed to the Noble Lie in the interests of a false and wordly ideal, is why they have relentlessly failed to conserve so much as the women’s bathroom, and why no honest person should consider himself a conservative.</p></div>",
  "content_text": "Conservative civnattery can never save the USA because civic nationalism was always a banner waved by those who sought to destroy the American nation and replace the republic of the sovereign States with an empire. Brion McClanahan demonstrates that both the 1619 Project of the SJWs and the 1776 Commission of the conservatives are designed\nto push an entirely false and ahistoric revision of the founding of the United States of America\non the maleducated children of the empire:\nHannah-Jones considers the United States to be a “nation founded on both an ideal and a lie.” The ideal is that “all mean are created equal” with “certain unalienable rights,” i.e., the “proposition nation.” But, unlike the Straussians, Hannah-Jones does not let Northern white men off the hook, for she sees them as as complicit as Southerners in betraying that ideal. She summarizes the core position of “The 1619 Project” as follows:\nYet despite being violently denied the freedom and justice promised to all, black Americans believed fervently in the American creed. Through centuries of black resistance and protest, we have helped the country live up to its founding ideals. And not only for ourselves—black rights struggles paved the way for every other rights struggle, including women’s and gay rights, immigrant and disability rights.\nTo the Straussians who crafted “The 1776 Report” and their conservative pundit allies like Dinesh D’Souza, Glenn Beck, and the late Rush Limbaugh, not all white Americans should be blamed for the sins of the South. In their view, there were “good” white Americans—abolitionists, Northern members of the founding generation, and Lincoln—who recognized the inhumanity of slavery and tried to end it. Even Southern members of the founding generation, including Jefferson himself, but also Washington, Madison, Mason, and a host of other Virginians, thought enough of humanity to pave the way for Lincoln to revolutionize the Revolution in the Gettysburg Address.\n“The 1776 Report” suggests that the founders (not excluding those who hailed from Southern states) created the mechanism to end slavery through the Constitution and cannot be blamed for the evil deeds of later pro-slavery Southerners who ignored the true founding of America. More importantly, the report’s authors believe they are free from the stain of racism because they adhere to the “correct” view of American history. In other words, “Don’t blame us. We voted for Lincoln.”\nHannah-Jones, on the other hand, does not make this distinction, nor does she differentiate between Lincoln and Calhoun. Both were guilty of America’s “original sin” of racism. Neither man held views on race that are acceptable to modern Americans, let alone “woke” social justice warriors. Hannah-Jones is as critical of Lincoln’s colonization plans as of Calhoun’s “positive good” speech. Frankly, she is at least being more consistent than the self-righteous conservatives on the 1776 Commission.\nThe attempt by the authors of “The 1776 Report” to beg absolution from the political left for the sin of slavery is a fatal miscalculation. The left’s game is cancel culture, and it’s a game in which conservatives will always be playing defense. You cannot play the left’s game on their field and by their rules and hope for success. Charges of racism are emotional, not intellectual, and are used—successfully—to change the narrative. Instead of focusing on the contributions antebellum Americans made to Western civilization, we are instead debating who was the least racist and bigoted among them. This is unproductive.\nConservatives cannot appease the left by regurgitating its distorted vision of the founding. Placing the lofty ideals of the Declaration at the center of the founding is a distortion of history.\nConsider that Jefferson himself downplayed the importance of the Declaration’s phrase “all men are created equal,” and that, for much of the period leading up to the Civil War, Jeffersonians in both the North and South championed the principles of state sovereignty, rather than those of an egalitarian, propositional nation. To Jefferson, the last paragraph, not the second, provided the most important language of the Declaration. Most of the founding generation agreed.\nThe story written during the debates over the Constitution in 1787 and 1788 provides a more robust and authentic American vision of the founding. The principles that predominated in those debates unified most Americans for decades and created a populist national base.\nThe founders drafted two constitutions for the central government and a host of state constitutions that reaffirmed their commitment to a union of states and the principles of federalism. The Constitution would not have been ratified in 1788 had the founding generation believed that the states would be consolidated into one national government.\nThat argument took center stage in every state ratifying convention in 1787 and 1788. Rarely was the Declaration mentioned, even in passing, and none of the founders ever referred to the line “all men are created equal” with religious reverence, contrary to what the Straussians and their leftist allies would have you believe.\nFor example, James Wilson of Pennsylvania made federalism a central theme of his State House Yard Speech in October 1787, just a few weeks after the Constitution had been signed in Philadelphia. Wilson mentioned the Declaration in one of his speeches before the Pennsylvania Ratifying Convention in December 1787, but only to show that the people had a right to “alter or abolish” either a state government or a central government. That was the American tradition.\nDelegates to the Massachusetts Ratifying Convention in January 1788 were told that the powers of the central government would be limited to those “expressly delegated” and that the language of what would become the Tenth Amendment to the Constitution imported the same meaning as the second article of the Articles of Confederation, namely that each state retained its “sovereignty and independence.” No one mentioned Jefferson’s “all men are created equal” phrase.\nEven in Virginia, the state that gave the United States the Declaration, the delegates never mentioned that document when debating the Constitution. And it was only mentioned twice during the Philadelphia Convention in 1787, in both instances by nationalists for the purpose of  arguing that the Union predated the states—a position flatly rejected by most of the men in attendance.\nDespite these historical facts, the authors of “The 1776 Report” insist that “The meaning and purpose of the Constitution of 1787…cannot be understood without recourse to the principles of the Declaration of Independence….” If that’s true, then the founding generation should have made that meaning explicit during the ratification debates, or at the very least in Philadelphia. But they didn’t. “States’ rights,” not the phantasm of a proposition nation, dominated the debates between the Founding Fathers.\nRace, equality, and history make liars of every conservative. The undeniable fact that they are not dedicated to the truth, but are rather committed to the Noble Lie in the interests of a false and wordly ideal, is why they have relentlessly failed to conserve so much as the women’s bathroom, and why no honest person should consider himself a conservative.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-04-27T09:38:34+00:00"
}