{
  "url": "https://voxday.net/2016/03/02/a-churchian-sermon-on-politics/",
  "scraped_at": "2025-12-17T17:48:12.453183",
  "title": "A Churchian sermon on politics",
  "date_display": "March 2, 2016",
  "date_iso": "2016-03-02T13:00:00+00:00",
  "date_from_url": "2016-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Churchian cuckservative, appropriately named Peter Wehner, <a href=\"http://www.nytimes.com/2016/03/01/opinion/campaign-stops/what-wouldnt-jesus-do.html\">preaches a sermon against Donald Trump</a> in the New York Times:</p><blockquote class=\"tr_bq\"><p> Among the most inexplicable developments in this bizarre political year is that Donald Trump is the candidate of choice of many evangelical Christians.</p><p>Mr. Trump won a plurality of evangelical votes in each of the last three Republican contests, in New Hampshire, South Carolina and Nevada. He won the glowing endorsement of Jerry Falwell Jr., the president of Liberty University, who has called him “one of the greatest visionaries of our time.” Last week, Pat Robertson, the founder and chairman of the Christian Broadcasting Network, told Mr. Trump during an interview, “You inspire us all.”</p><p>If this embrace strikes you as discordant, it should. This visionary and inspiring man humiliated his first wife by conducting a very public affair, chronically bullies and demeans people, and says he has never asked God for forgiveness. His name is emblazoned on a casino that features a strip club; he has discussed anal sex on the air with Howard Stern and, after complimenting his daughter Ivanka’s figure, pointed out that if she “weren’t my daughter, perhaps I would be dating her.” He once supported partial-birth abortion and to this day praises Planned Parenthood, the nation’s largest abortion provider. He is a narcissist appealing to people whose faith declares that pride goes before a fall.</p><p>Mr. Trump’s character is antithetical to many of the qualities evangelicals should prize in a political leader: integrity, compassion and reasoned convictions, wisdom and prudence, trustworthiness, a commitment to the moral good…. At its core, Christianity teaches that everyone, no matter at what<br> station or in what season in life, has inherent dignity and worth.<br> “Follow justice and justice alone,” Deuteronomy says, “so that you may<br> live and possess the land the Lord your God is giving you.” The attitude<br> of Thrasymachus is foreign to biblical Christianity. So is Trumpism. In<br> embracing it, evangelical Christians are doing incalculable damage to<br> their witness.</br></br></br></br></br></br></p></blockquote><p>There are few Churchian phrases I hold in more contempt than “damage to their witness”. It’s passive-aggressive manipulative nonsense. In combination with their actions, use of the phrase shows what forked-tongued liars the Churchians are. The Churchian “witness” is pure poison. They preen and posture and virtue-signal and criticize and condemn, driving genuine believers from the pews while simultaneously welcoming women and sexual deviants and atheists to the pulpits.</p><p>Any decent, honest, self-respecting man would rather pledge his life to Satan, Cthulhu, or the Nameless Spirit of the Abyss than live life the way these mealy-mouthed, nominal Christians do. They don’t follow Jesus Christ and worship God, they follow public opinion and worship at the altar of social approval.</p><p>The punchline: <i>Peter Wehner, a senior fellow at the Ethics and Public Policy Center, served in the last three Republican administrations.</i></p><p>I don’t know if Jesus would vote for Donald Trump or not, but I know that he wouldn’t constantly lie like the Churchians do. And frankly, I think he’d drive an awful lot of Churchian sermonizers out of the Church with bullwhips, just as he drove the moneylenders out of the Temple.<i> </i></p></div>",
  "content_text": "A Churchian cuckservative, appropriately named Peter Wehner,\npreaches a sermon against Donald Trump\nin the New York Times:\nAmong the most inexplicable developments in this bizarre political year is that Donald Trump is the candidate of choice of many evangelical Christians.\nMr. Trump won a plurality of evangelical votes in each of the last three Republican contests, in New Hampshire, South Carolina and Nevada. He won the glowing endorsement of Jerry Falwell Jr., the president of Liberty University, who has called him “one of the greatest visionaries of our time.” Last week, Pat Robertson, the founder and chairman of the Christian Broadcasting Network, told Mr. Trump during an interview, “You inspire us all.”\nIf this embrace strikes you as discordant, it should. This visionary and inspiring man humiliated his first wife by conducting a very public affair, chronically bullies and demeans people, and says he has never asked God for forgiveness. His name is emblazoned on a casino that features a strip club; he has discussed anal sex on the air with Howard Stern and, after complimenting his daughter Ivanka’s figure, pointed out that if she “weren’t my daughter, perhaps I would be dating her.” He once supported partial-birth abortion and to this day praises Planned Parenthood, the nation’s largest abortion provider. He is a narcissist appealing to people whose faith declares that pride goes before a fall.\nMr. Trump’s character is antithetical to many of the qualities evangelicals should prize in a political leader: integrity, compassion and reasoned convictions, wisdom and prudence, trustworthiness, a commitment to the moral good…. At its core, Christianity teaches that everyone, no matter at what\nstation or in what season in life, has inherent dignity and worth.\n“Follow justice and justice alone,” Deuteronomy says, “so that you may\nlive and possess the land the Lord your God is giving you.” The attitude\nof Thrasymachus is foreign to biblical Christianity. So is Trumpism. In\nembracing it, evangelical Christians are doing incalculable damage to\ntheir witness.\nThere are few Churchian phrases I hold in more contempt than “damage to their witness”. It’s passive-aggressive manipulative nonsense. In combination with their actions, use of the phrase shows what forked-tongued liars the Churchians are. The Churchian “witness” is pure poison. They preen and posture and virtue-signal and criticize and condemn, driving genuine believers from the pews while simultaneously welcoming women and sexual deviants and atheists to the pulpits.\nAny decent, honest, self-respecting man would rather pledge his life to Satan, Cthulhu, or the Nameless Spirit of the Abyss than live life the way these mealy-mouthed, nominal Christians do. They don’t follow Jesus Christ and worship God, they follow public opinion and worship at the altar of social approval.\nThe punchline:\nPeter Wehner, a senior fellow at the Ethics and Public Policy Center, served in the last three Republican administrations.\nI don’t know if Jesus would vote for Donald Trump or not, but I know that he wouldn’t constantly lie like the Churchians do. And frankly, I think he’d drive an awful lot of Churchian sermonizers out of the Church with bullwhips, just as he drove the moneylenders out of the Temple.",
  "tags": [
    "Christianity",
    "cuckservative",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-02T13:00:00+00:00"
}