{
  "url": "https://voxday.net/2016/03/30/an-ominous-pattern/",
  "scraped_at": "2025-12-17T17:51:51.561506",
  "title": "An ominous pattern",
  "date_display": "March 30, 2016",
  "date_iso": "2016-03-30T09:18:00+00:00",
  "date_from_url": "2016-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Consider the following facts:</p><ol><li>Russia has <a href=\"http://www.unz.com/tsaker/week-twenty-two-of-the-russian-military-intervention-in-syria-putin-announces-a-new-strategy/\">withdrawn elements of its tactical forces</a> in Syria, while leaving most of its anti-aircraft and strategic air strike capabilities in place.</li><li>ISIS <a href=\"http://www.independent.co.uk/news/world/middle-east/isis-palmyra-syrian-state-forces-driven-out-of-retake-complete-control-of-ancient-city-a6954771.html\">lost control of Palmyra</a> to Assad and the Syrian army.</li><li>For over a month, there have been repeated stories about a joint Saudi-Turkish alliance <a href=\"http://www.express.co.uk/news/world/647145/Saudi-Turkey-war-Assad-syria\">preparing to invade Syria</a>, ostensibly to fight ISIS, but actually to attack Assad and the legitimate Syrian government.</li><li>The US government just <a href=\"https://www.washingtonpost.com/news/checkpoint/wp/2016/03/29/pentagon-and-state-department-order-family-members-of-u-s-troops-and-diplomats-to-leave-turkey/\">withdrew all family members</a> of U.S. troops and diplomats from its installations in Turkey, ostensibly out of fears of terrorist attack.</li><li>The NATO treaty requires the USA to defend Turkey if attacked.</li><li>Donald Trump has, for the first time in decades, raised serious questions, in public, about US membership in NATO.</li><li>ISIS is a creation, at least in part of the USA, and the US military made no serious attempts to defeat ISIS in Syria whereas the Russian-Syrian-Iranian alliance managed to repeatedly defeat ISIS and drive it back in just 22 weeks of operations.</li></ol><p>What does this suggest? I think it indicates that all sides are preparing for a Turko-Syrian war, which <i>may</i> be a proxy for a US-Russian war in the same way that the war in the Crimea was. I’m not certain whether the US is actively on the side of Turkey or if it is washing its hands of what looks like an increasingly unstable pair of proxies in Turkey and the Islamic State. For the sake of global stability, I sincerely hope the latter is the case.</p><p>There are some indications that the US has wisely decided to stay out of it. Just over a month ago, the American Free Press <a href=\"http://americanfreepress.net/russia-readies-war-turkey/\">reported</a>:</p><blockquote class=\"tr_bq\"><p> Moscow has made it clear to Washington it will retaliate if the Turks send forces into Syria. Moscow has made it clear to Washington it will retaliate if the Turks send forces into Syria. The Russians are convinced the Saudis are pressing Turkey to so something militarily before Russian airpower eliminates all the extreme Islamic groups the Turks and Saudis have been supporting. The source says NATO leaders in Europe have told Washington that Turkey and the Saudis will have to go it alone if they engage Russia.</p></blockquote><p>Also, the fact that the <a href=\"https://www.washingtonpost.com/blogs/post-partisan/wp/2016/03/03/the-growing-risk-of-civil-war-in-turkey/\">US refused Turkey’s demands</a> that it cut ties with a Kurdish group fighting in Syria bodes well for avoiding a US-Russian war. The fact that Turkey might also be facing a civil war in its south may be an important factor in its apparent decision to get directly involved in Syria before the government forces wipe out ISIS there.</p><p>In any event, the recent withdrawal of Russian and US personnel suggests that things are likely to heat up in Syria soon. It is worth noting, too, that these recent events show how insanely wrong John McCain was to advocate expanding NATO to include Ukraine, as that would have either a) shattered NATO or b) triggered a US-Russian war last year. The fact that the USA appears to be leaving its NATO ally Turkey to go to war on its own tends to indicate the former.</p></div>",
  "content_text": "Consider the following facts:\nRussia has\nwithdrawn elements of its tactical forces\nin Syria, while leaving most of its anti-aircraft and strategic air strike capabilities in place.\nISIS\nlost control of Palmyra\nto Assad and the Syrian army.\nFor over a month, there have been repeated stories about a joint Saudi-Turkish alliance\npreparing to invade Syria\n, ostensibly to fight ISIS, but actually to attack Assad and the legitimate Syrian government.\nThe US government just\nwithdrew all family members\nof U.S. troops and diplomats from its installations in Turkey, ostensibly out of fears of terrorist attack.\nThe NATO treaty requires the USA to defend Turkey if attacked.\nDonald Trump has, for the first time in decades, raised serious questions, in public, about US membership in NATO.\nISIS is a creation, at least in part of the USA, and the US military made no serious attempts to defeat ISIS in Syria whereas the Russian-Syrian-Iranian alliance managed to repeatedly defeat ISIS and drive it back in just 22 weeks of operations.\nWhat does this suggest? I think it indicates that all sides are preparing for a Turko-Syrian war, which\nmay\nbe a proxy for a US-Russian war in the same way that the war in the Crimea was. I’m not certain whether the US is actively on the side of Turkey or if it is washing its hands of what looks like an increasingly unstable pair of proxies in Turkey and the Islamic State. For the sake of global stability, I sincerely hope the latter is the case.\nThere are some indications that the US has wisely decided to stay out of it. Just over a month ago, the American Free Press\nreported\n:\nMoscow has made it clear to Washington it will retaliate if the Turks send forces into Syria. Moscow has made it clear to Washington it will retaliate if the Turks send forces into Syria. The Russians are convinced the Saudis are pressing Turkey to so something militarily before Russian airpower eliminates all the extreme Islamic groups the Turks and Saudis have been supporting. The source says NATO leaders in Europe have told Washington that Turkey and the Saudis will have to go it alone if they engage Russia.\nAlso, the fact that the\nUS refused Turkey’s demands\nthat it cut ties with a Kurdish group fighting in Syria bodes well for avoiding a US-Russian war. The fact that Turkey might also be facing a civil war in its south may be an important factor in its apparent decision to get directly involved in Syria before the government forces wipe out ISIS there.\nIn any event, the recent withdrawal of Russian and US personnel suggests that things are likely to heat up in Syria soon. It is worth noting, too, that these recent events show how insanely wrong John McCain was to advocate expanding NATO to include Ukraine, as that would have either a) shattered NATO or b) triggered a US-Russian war last year. The fact that the USA appears to be leaving its NATO ally Turkey to go to war on its own tends to indicate the former.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-30T08:18:00+00:00"
}