{
  "url": "https://voxday.net/2016/03/31/clutter-and-clean-cycles/",
  "scraped_at": "2025-12-17T17:52:02.819799",
  "title": "Clutter and Clean Cycles",
  "date_display": "March 31, 2016",
  "date_iso": "2016-03-31T15:30:00+00:00",
  "date_from_url": "2016-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thanks to all those Americans born everywhere from Afghanistan to Zimbabwe, even those who are enamored of diversity are beginning to notice that ethnically heterogeneous societies <a href=\"http://20committee.com/2015/03/02/yugoslavias-warning-to-america/\">don’t tend to survive economic crashes</a> very well:</p><blockquote class=\"tr_bq\"><p> While it is difficult for anybody who knows the Pentagon well to<br> imagine American generals and admirals getting together to overthrow the<br> civilian government — that would require obscene amounts of PowerPoint<br> and might endanger top brass golden parachutes with Beltway Bandits —<br> the notion of a Civil War 2.0, however terrifying it may be, needs to be<br> faced squarely, if we wish to avoid that awful fate.</br></br></br></br></br></p><p>America in the 21st century runs little risk of becoming <em>Honduras Grande</em>,<br> but if current politico-economic trends continue much longer, we might<br> well wind up a lot like Yugoslavia. That statement is sure to be<br> controversial, since few Americans, citizens of the global hegemon and<br> to many of them a most exceptional country, like to be compared with a<br> relatively small Balkan federation that collapsed into wars and genocide<br> a generation ago.</br></br></br></br></br></br></p><p>Yet the collapse of Yugoslavia offers several cautionary tales to<br> Americans today, and if they are wise they will heed them and set the<br> United States on a correction course before it is too late. As one who<br> witnessed the dreadful collapse of Yugoslavia and its terrible<br> aftermaths — including the seemingly permanent impoverishment of<br> Southeastern Europe, mired in crime, corruption, and extremism — I would<br> very much like America to discover a far happier fate. However, some of the parallels are eerie and troubling….</br></br></br></br></br></br></p><p>Managing this increasingly fissiparous country as economic prospects diminish will challenge the most gifted politicians. Indulging in ethnic resentments as a substitute for solutions to vexing politico-economic problems only makes things go from bad to worse, sometimes rapidly and painfully. With both our parties increasingly beholden to Wall Street at the expense of Main Street, average Americans of all backgrounds will not be happy that they are bequeathing a life of less affluence and opportunity to their children. In such a time of troubles, playing ethno-racial political games as a substitute for reform is deeply irresponsible.</p><p>It would be nice if Democrats and Republicans played better together, particularly on the budget and borrowing money. It would be especially nice if they seriously addressed issues of rising economic inequality and diminishing opportunities for average Americans.  But it is imperative that they not fan the flames of ethnic and racial resentments if they wish to avoid a terrible outcome for our country.</p></blockquote><p>The nation is already broken and divided. What is now being done to the nations of Europe was already done to the USA back in 1965. There is no longer an Anglo-American nation with a moderate admixture of other European nations, now it is a merely a political entity with dozens of rival ethnic and religious interest groups jockeying for power and a share of the income redistribution.</p><p>As with Yugoslavia, the structure will hold so long as it doesn’t come under excessive financial stress. This is why I have long predicted the 2033 timeframe, as I thought that’s about when the US dollar will fail as the global reserve currency. Considering the current state of China, it’s possible that timeframe is too optimistic, but regardless, there is still time to prepare for the Yugoslavication and dissolution of the USA.</p><p>Choose your location carefully, and with an eye to the future, as who and what you are is likely to matter with regards to your ability to remain there. I can assure you that the idea of ethnic cleansing and forced relocations on the North American continent is neither a new nor an unthinkable idea. Just ask any American Indian.</p><p>Just as there are economic boom and bust cycles, there are longer-term demographic clutter and clean cycles. We are at the peak of the greatest demographic clutter cycle in human history, one that has lasted nearly 200 years. This tends to suggest that we are in for the mother of all clean cycles.</p></div>",
  "content_text": "Thanks to all those Americans born everywhere from Afghanistan to Zimbabwe, even those who are enamored of diversity are beginning to notice that ethnically heterogeneous societies\ndon’t tend to survive economic crashes\nvery well:\nWhile it is difficult for anybody who knows the Pentagon well to\nimagine American generals and admirals getting together to overthrow the\ncivilian government — that would require obscene amounts of PowerPoint\nand might endanger top brass golden parachutes with Beltway Bandits —\nthe notion of a Civil War 2.0, however terrifying it may be, needs to be\nfaced squarely, if we wish to avoid that awful fate.\nAmerica in the 21st century runs little risk of becoming\nHonduras Grande\n,\nbut if current politico-economic trends continue much longer, we might\nwell wind up a lot like Yugoslavia. That statement is sure to be\ncontroversial, since few Americans, citizens of the global hegemon and\nto many of them a most exceptional country, like to be compared with a\nrelatively small Balkan federation that collapsed into wars and genocide\na generation ago.\nYet the collapse of Yugoslavia offers several cautionary tales to\nAmericans today, and if they are wise they will heed them and set the\nUnited States on a correction course before it is too late. As one who\nwitnessed the dreadful collapse of Yugoslavia and its terrible\naftermaths — including the seemingly permanent impoverishment of\nSoutheastern Europe, mired in crime, corruption, and extremism — I would\nvery much like America to discover a far happier fate. However, some of the parallels are eerie and troubling….\nManaging this increasingly fissiparous country as economic prospects diminish will challenge the most gifted politicians. Indulging in ethnic resentments as a substitute for solutions to vexing politico-economic problems only makes things go from bad to worse, sometimes rapidly and painfully. With both our parties increasingly beholden to Wall Street at the expense of Main Street, average Americans of all backgrounds will not be happy that they are bequeathing a life of less affluence and opportunity to their children. In such a time of troubles, playing ethno-racial political games as a substitute for reform is deeply irresponsible.\nIt would be nice if Democrats and Republicans played better together, particularly on the budget and borrowing money. It would be especially nice if they seriously addressed issues of rising economic inequality and diminishing opportunities for average Americans.  But it is imperative that they not fan the flames of ethnic and racial resentments if they wish to avoid a terrible outcome for our country.\nThe nation is already broken and divided. What is now being done to the nations of Europe was already done to the USA back in 1965. There is no longer an Anglo-American nation with a moderate admixture of other European nations, now it is a merely a political entity with dozens of rival ethnic and religious interest groups jockeying for power and a share of the income redistribution.\nAs with Yugoslavia, the structure will hold so long as it doesn’t come under excessive financial stress. This is why I have long predicted the 2033 timeframe, as I thought that’s about when the US dollar will fail as the global reserve currency. Considering the current state of China, it’s possible that timeframe is too optimistic, but regardless, there is still time to prepare for the Yugoslavication and dissolution of the USA.\nChoose your location carefully, and with an eye to the future, as who and what you are is likely to matter with regards to your ability to remain there. I can assure you that the idea of ethnic cleansing and forced relocations on the North American continent is neither a new nor an unthinkable idea. Just ask any American Indian.\nJust as there are economic boom and bust cycles, there are longer-term demographic clutter and clean cycles. We are at the peak of the greatest demographic clutter cycle in human history, one that has lasted nearly 200 years. This tends to suggest that we are in for the mother of all clean cycles.",
  "tags": [
    "decline and fall",
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-31T14:30:00+00:00"
}