{
  "url": "https://voxday.net/2016/03/01/combined-arms-take-two/",
  "scraped_at": "2025-12-17T17:48:02.770685",
  "title": "Combined Arms, take two, turn one",
  "date_display": "March 1, 2016",
  "date_iso": "2016-03-01T10:22:00+00:00",
  "date_from_url": "2016-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As <a href=\"http://www.milobookclub.com/2016/02/22/a-lesson-in-combined-arms/\">the previous game of S23</a> ended as quickly as I’d expected – Ender’s last German platoon didn’t manage to take out the gun or make it across the street before being broken and I didn’t even need to reveal my squad in L8 to stop them – we decided to tackle something bigger. This time he picked S26: Last Ally, Last Victory and gave me the challenge of attacking the village and taking nine of the multi-hex buildings with the Germans.</p><p>It’s a late-war 1944 scenario set in Hungary, so the Germans are outgunned despite having two Tigers at their disposal; the Soviet main armaments range from 76L to a nightmarish 122L although their armor can’t compare with the 26 To Kill of the Tigers’ front armor.<br> It’s a complicated setup, with two German formations coming in from the east and west, and Soviet armored reinforcements arriving from the north. As the German commander, I had to decide which group would enter in Turn One and which in Turn Two, SchwerePanzerAbteiling 503rd platoon in the west (top) or a company from the 1st Panzer Division in the east(bottom) prior to the Soviet setup.</br></p><p>I assumed the Soviets would focus on stopping the larger, well-led company, plus the open fields gave them the opportunity to set up a deadly killzone to the east, so I decided the focus of my attack would have to come from the west and thereby decided to make my Turn One entry and subsequent push for the village there.</p><p>I decided I’d use my armor to screen the platoon, but kept my Panthers out of the line of sight of the anti-tank gun and lone T-34 by daring them to take on the Tigers and their massive front armor. The Panthers took up positions to the north, where I hoped to slow down the coming Soviet reinforcements and prevent them from disrupting the infantry before they could reach the safety of the stone buildings. So, there was virtually no fire exchanged during the first German turn, which ended like this.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://1.bp.blogspot.com/-1cTvDzfs1lM/VtVkyhgS0MI/AAAAAAAAByc/ay4985RCe94/s1600/s26_postgeturn1.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"572\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/03/s26_postgeturn1.jpg\" width=\"512\"/></a></div><p> I was a little surprised by the placement of the two Soviet platoons in the woods to the north, which gave me some degree of encouragement that I’d be able to quickly take the two multihex wooden buildings with the 1st Panzer when they entered from the east on Turn Two. My armor wasn’t able to take out the one T-34 defending the western approach, but with two 88Ls and one 75L trained on it, I was confident it wasn’t going to survive for long, after which the big cats could turn their attention to the single platoon of the 6th Guards and give me easy entry to the village.</p></div>",
  "content_text": "As\nthe previous game of S23\nended as quickly as I’d expected – Ender’s last German platoon didn’t manage to take out the gun or make it across the street before being broken and I didn’t even need to reveal my squad in L8 to stop them – we decided to tackle something bigger. This time he picked S26: Last Ally, Last Victory and gave me the challenge of attacking the village and taking nine of the multi-hex buildings with the Germans.\nIt’s a late-war 1944 scenario set in Hungary, so the Germans are outgunned despite having two Tigers at their disposal; the Soviet main armaments range from 76L to a nightmarish 122L although their armor can’t compare with the 26 To Kill of the Tigers’ front armor.\nIt’s a complicated setup, with two German formations coming in from the east and west, and Soviet armored reinforcements arriving from the north. As the German commander, I had to decide which group would enter in Turn One and which in Turn Two, SchwerePanzerAbteiling 503rd platoon in the west (top) or a company from the 1st Panzer Division in the east(bottom) prior to the Soviet setup.\nI assumed the Soviets would focus on stopping the larger, well-led company, plus the open fields gave them the opportunity to set up a deadly killzone to the east, so I decided the focus of my attack would have to come from the west and thereby decided to make my Turn One entry and subsequent push for the village there.\nI decided I’d use my armor to screen the platoon, but kept my Panthers out of the line of sight of the anti-tank gun and lone T-34 by daring them to take on the Tigers and their massive front armor. The Panthers took up positions to the north, where I hoped to slow down the coming Soviet reinforcements and prevent them from disrupting the infantry before they could reach the safety of the stone buildings. So, there was virtually no fire exchanged during the first German turn, which ended like this.\nI was a little surprised by the placement of the two Soviet platoons in the woods to the north, which gave me some degree of encouragement that I’d be able to quickly take the two multihex wooden buildings with the 1st Panzer when they entered from the east on Turn Two. My armor wasn’t able to take out the one T-34 defending the western approach, but with two 88Ls and one 75L trained on it, I was confident it wasn’t going to survive for long, after which the big cats could turn their attention to the single platoon of the 6th Guards and give me easy entry to the village.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-01T10:22:00+00:00"
}