{
  "url": "https://voxday.net/2016/03/06/combined-arms-take-two-turn-three/",
  "scraped_at": "2025-12-17T17:48:41.726742",
  "title": "Combined Arms, Take Two, turn three",
  "date_display": "March 6, 2016",
  "date_iso": "2016-03-06T07:00:00+00:00",
  "date_from_url": "2016-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While the battle to the east is fast, brutal, and direct, with the big-gunned tanks blowing holes in each other at an alarming rate, the 1st Panzer Division has recovered from its initial setbacks and is beginning to make some headway by outflanking the Soviet’s western defenses. This is the situation after the end of Turn 3. <a href=\"http://www.milobookclub.com/2016/03/04/combined-arms-take-two-turn-two/\">The second turn</a>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://4.bp.blogspot.com/-kzMiZOC8jhc/VtuMfDQINDI/AAAAAAAAB0w/lluqM8p-63Q/s1600/A26_T3_end.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"640\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/03/A26_T3_end.png\" width=\"593\"/></a></div><p> The most important action was the armor battle in the east (top). My Tiger first took out the T-34 at the crossroads it had already acquired, then, with a nearly 500-meter side shot, killed the Stalin that had traversed the big northeastern hill and took out my Panther guarding the northern road. Three kills in three turns for the crew, but in doing so, the Tiger left its much weaker side armor exposed to the AT gun in the village. Fortunately the 57L gun missed its first shot and although the second shot hit, it didn’t penetrate the Tiger’s armor.</p><p>The combination of the second Tiger, the Panther, and the infantry all pounding away at the Guards platoon defending the eastern approach to the village killed the leader and two of the three squads, but the Soviet commander somehow managed to extricate the surviving squad safely, thereby preventing me from rapidly exploiting my chosen <i>schwerpunkt</i>. That squad fell back and reclaimed the first building I’d taken, but soon found itself surrounded on three sides as the troops I’d sent around the southern side of the village moved in and took possession two of the buildings there. They kept the well-led Soviet platoon that was established in the village occupied while the German officer leading the assault headed north to try to take out the anti-tank gun before it could kill the Tiger with a third shot.</p><p>In the west, the key development was the immediate rallying of my surviving infantry platoon combined with the two Panthers taking out the T-34 on the north side of the building. Also, the assault engineers who rushed the building in the center were able to break the two Soviet squads that had been holding the nearby hill, catching them out in the open as they tried to fall back to the village. And to the southwest, lacking any infantry support, the one T-34 proved unable to stop the dispersed platoon that was seeking to link up with the panzergrenadiers attacking the village from the southeast.</p><p>All in all, it was a very favorable series of three half-turns for the attacking Germans, and although the battle isn’t over, I feel quite confident that I’ll be able to secure the necessary nine buildings well before Turn 7. I was able to crack the village in the east while simultaneously flanking his massed firepower in the west to the north and south, which was exactly what I intended.</p></div>",
  "content_text": "While the battle to the east is fast, brutal, and direct, with the big-gunned tanks blowing holes in each other at an alarming rate, the 1st Panzer Division has recovered from its initial setbacks and is beginning to make some headway by outflanking the Soviet’s western defenses. This is the situation after the end of Turn 3.\nThe second turn\n.\nThe most important action was the armor battle in the east (top). My Tiger first took out the T-34 at the crossroads it had already acquired, then, with a nearly 500-meter side shot, killed the Stalin that had traversed the big northeastern hill and took out my Panther guarding the northern road. Three kills in three turns for the crew, but in doing so, the Tiger left its much weaker side armor exposed to the AT gun in the village. Fortunately the 57L gun missed its first shot and although the second shot hit, it didn’t penetrate the Tiger’s armor.\nThe combination of the second Tiger, the Panther, and the infantry all pounding away at the Guards platoon defending the eastern approach to the village killed the leader and two of the three squads, but the Soviet commander somehow managed to extricate the surviving squad safely, thereby preventing me from rapidly exploiting my chosen\nschwerpunkt\n. That squad fell back and reclaimed the first building I’d taken, but soon found itself surrounded on three sides as the troops I’d sent around the southern side of the village moved in and took possession two of the buildings there. They kept the well-led Soviet platoon that was established in the village occupied while the German officer leading the assault headed north to try to take out the anti-tank gun before it could kill the Tiger with a third shot.\nIn the west, the key development was the immediate rallying of my surviving infantry platoon combined with the two Panthers taking out the T-34 on the north side of the building. Also, the assault engineers who rushed the building in the center were able to break the two Soviet squads that had been holding the nearby hill, catching them out in the open as they tried to fall back to the village. And to the southwest, lacking any infantry support, the one T-34 proved unable to stop the dispersed platoon that was seeking to link up with the panzergrenadiers attacking the village from the southeast.\nAll in all, it was a very favorable series of three half-turns for the attacking Germans, and although the battle isn’t over, I feel quite confident that I’ll be able to secure the necessary nine buildings well before Turn 7. I was able to crack the village in the east while simultaneously flanking his massed firepower in the west to the north and south, which was exactly what I intended.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-06T07:00:00+00:00"
}