{
  "url": "https://voxday.net/2016/03/22/donald-trump-speech-to-aipac/",
  "scraped_at": "2025-12-17T17:50:57.271573",
  "title": "Donald Trump speech to AIPAC",
  "date_display": "March 22, 2016",
  "date_iso": "2016-03-22T17:00:00+00:00",
  "date_from_url": "2016-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Good evening. I speak to you today as a lifelong supporter and true<br> friend of Israel. I am a newcomer to politics but not to backing the<br> Jewish state.</br></br></p><p>In late 2001, weeks after the attacks on New York City and Washington<br> – attacks perpetrated by Islamic fundamentalists, Mayor Giuliani<br> visited Israel to show solidarity with terror victims. I sent him in my<br> plane because I backed the mission 100%.</br></br></br></p><p>In Spring 2004, at the height of violence in the Gaza Strip, I was<br> the Grand Marshal of the 40th Salute to Israel Parade, the largest<br> single gathering in support of the Jewish state.</br></br></p><p>It was a very dangerous time for Israel and frankly for anyone<br> supporting Israel – many people turned down this honor –I did not, I<br> took the risk.</br></br></p><p>I didn’t come here tonight to pander to you about Israel. That’s what<br> politicians do: all talk, no action. I came here to speak to you about<br> where I stand on the future of American relations with our strategic<br> ally, our unbreakable friendship, and our cultural brother, the only<br> democracy in the Middle East, the State of Israel.</br></br></br></br></p><p>My number one priority is to dismantle the disastrous deal with Iran.<br> I have been in business a long time. I know deal-making and let me tell<br> you, this deal is catastrophic – for America, for Israel, and for the<br> whole Middle East.</br></br></br></p><p>The problem here is fundamental. We have rewarded the world’s leading<br> state sponsor of terror with $150 billion and we received absolutely<br> nothing in return.</br></br></p><p><a name=\"more\"></a><br> I’ve studied this issue in greater detail than almost anybody. The<br> biggest concern with the deal is not necessarily that Iran is going to<br> violate it, although it already has, the bigger problem is that they can<br> keep the terms and still get to the bomb by simply running out the<br> clock, and, of course, they keep the billions.</br></br></br></br></br></p><p>The deal doesn’t even require Iran to dismantle its military nuclear<br> capability! Yes, it places limits on its military nuclear program for<br> only a certain number of years. But when those restrictions expire, Iran<br> will have an industrial-size military nuclear capability ready to go,<br> and with zero provision for delay no matter how bad Iran’s behavior is.<br> When I am president, I will adopt a strategy that focuses on three<br> things when it comes to Iran.</br></br></br></br></br></br></p><p>First, we will stand up to Iran’s aggressive push to destabilize and<br> dominate the region. Iran is a very big problem and will continue to be,<br> but if I’m elected President, I know how to deal with trouble. Iran is a<br> problem in Iraq, a problem in Syria, a problem in Lebanon, a problem in<br> Yemen, and will be a very major problem for Saudi Arabia. Literally<br> every day, Iran provides more and better weapons to their puppet states.<br> Hezbollah in Lebanon has received sophisticated anti-ship weapons,<br> anti-aircraft weapons, and GPS systems on rockets. Now they’re in Syria<br> trying to establish another front against Israel from the Syrian side of<br> the Golan Heights.</br></br></br></br></br></br></br></br></br></p><p>In Gaza, Iran is supporting Hamas and Islamic Jihad – and in the West<br> Bank they are openly offering Palestinians $7,000 per terror attack and<br> $30,000 for every Palestinian terrorist’s home that’s been destroyed.</br></br></p><p>Iran is financing military forces throughout the Middle East and it<br> is absolutely indefensible that we handed them over $150 billion to<br> facilitate even more acts of terror.</br></br></p><p>Secondly, we will totally dismantle Iran’s global terror network.<br> Iran has seeded terror groups all over the world. During the last five<br> years, Iran has perpetrated terror attacks in 25 different countries on<br> five continents. They’ve got terror cells everywhere, including in the<br> western hemisphere very close to home. Iran is the biggest sponsor of<br> terrorism around the world and we will work to dismantle that reach.</br></br></br></br></br></p><p>Third, at the very least, we must hold Iran accountable by<br> restructuring the terms of the previous deal. Iran has already – since<br> the deal is in place – test-fired ballistic missiles three times. Those<br> ballistic missiles, with a range of 1,250 miles, were designed to<br> intimidate not only Israel, which is only 600 miles away but also<br> intended to frighten Europe, and, someday, the United States.</br></br></br></br></br></p><p>Do you want to hear something really shocking? As many of the great<br> people in this room know, painted on those missiles – in both Hebrew and<br> Farsi – were the words “Israel must be wiped off the face of the<br> earth.”</br></br></br></p><p>What kind of demented minds write that in Hebrew? And here’s another<br> twisted part – testing these missiles does not even violate the horrible<br> deal that we made!</br></br></p><p>The deal is silent on test missiles but those tests DO violate UN<br> Security Council Resolutions. The problem is, no one has done anything<br> about it. Which brings me to my next point – the utter weakness and<br> incompetence of the United Nations.</br></br></br></p><p>The United Nations is not a friend of democracy. It’s not a friend to<br> freedom. It’s not a friend even to the United States of America, where<br> as all know, it has its home. And it surely isn’t a friend to Israel.</br></br></p><p>With President Obama in his final year, discussions have been<br> swirling about an attempt to bring a security council resolution on the<br> terms of an eventual agreement between Israel and Palestine. Let me be<br> clear: An agreement imposed by the UN would be a total and complete<br/> disaster. The United States must oppose this resolution and use the<br/> power of our veto. Why? Because that’s not how you make a deal.</br></br></br></p><p>Deals are made when parties come to the table and negotiate. Each<br/> side must give up something it values in exchange for something it<br/> requires. A deal that imposes conditions on Israel and the Palestinian<br/> Authority will do nothing to bring peace. It will only further<br/> delegitimize Israel and it would reward Palestinian terrorism, because<br/> every day they are stabbing Israelis – and even Americans.</p><p>Just last week, American Taylor Allen Force, a West Point grad who<br/> served in Iraq and Afghanistan, was murdered in the street by a<br/> knife-wielding Palestinian. You don’t reward that behavior, you confront<br/> it!</p><p>It’s not up the United Nations to impose a solution. The parties must<br/> negotiate a resolution themselves. The United States can be useful as a<br/> facilitator of negotiations, but no one should be telling Israel it<br/> must abide by some agreement made by others thousands of miles away that<br/> don’t even really know what’s happening.</p><p>When I’m president, believe me, I will veto any attempt by the UN to<br/> impose its will on the Jewish state. You see, I know about deal-making –<br/> that’s what I do. I wrote The Art of the Deal, one of the all-time<br/> best-selling books about deals and deal making. To make a great deal,<br/> you need two willing participants.</p><p>We know Israel is willing to deal. Israel has been trying to sit down<br/> at the negotiating table, without pre-conditions, for years. You had<br/> Camp David in 2000, where Prime Minister Barak made an incredible offer –<br/> maybe even too generous. Arafat rejected it.</p><p>In 2008, Prime Minister Olmert made an equally generous offer. The<br/> Palestinian Authority rejected it. Then John Kerry tried to come up with<br/> a framework and Abbas didn’t even respond, not even to the Secretary of<br/> State of the United States of America!</p><p>When I become President, the days of treating Israel like a<br/> second-class citizen will end on Day One. I will meet with Prime<br/> Minister Netanyahu immediately. I have known him for many years and we<br/> will be able to work closely together to help bring stability and peace<br/> to Israel and to the entire region.</p><p>Meanwhile, every single day, you have rampant incitement and children<br/> being taught to hate Israel and hate the Jews. When you live in a<br/> society where the firefighters are the hero’s little kids want to be<br/> firefighters.</p><p>When you live in a society where athletes and movie stars are heroes,<br/> little kids want to be athletes and movie stars. In Palestinian<br/> society, the heroes are those who murder Jews – we can’t let this<br/> continue. You cannot achieve peace if terrorists are treated as martyrs.<br/> Glorifying terrorists is a tremendous barrier to peace.</p><p>In Palestinian textbooks and mosques, you’ve got a culture of hatred<br/> that has been fermenting there for years, and if we want to achieve<br/> peace, they’ve got to end this indoctrination of hatred. There is no<br/> moral equivalency. Israel does not name public squares after terrorists.<br/> Israel does not pay its children to stab random Palestinians.</p><p>You see, what President Obama gets wrong about deal making is that he<br/> constantly applies pressure to our friends and rewards our enemies.<br/> That pattern, practiced by the President and his administration,<br/> including former Secretary of State, Hillary Clinton, has repeated<br/> itself over and over and has done nothing but embolden those who hate<br/> America. We saw that with releasing $150 billion to Iran in the hope<br/> that they would magically join the world community – It’s the same with<br/> Israel and Palestine.</p><p>President Obama thinks that applying pressure to Israel will force<br/> the issue, but it’s precisely the opposite. Already, half the population<br/> of Palestine has been taken over by the Palestinian ISIS in Hamas, and<br/> the other half refuses to confront the first half, so it’s a very<br/> difficult situation but when the United States stands with Israel, the<br/> chances of peace actually rise. That’s what will happen when I’m<br/> president.</p><p>We will move the American embassy to the eternal capital of the<br/> Jewish people, Jerusalem – and we will send a clear signal that there is<br/> no daylight between America and our most reliable ally, the state of<br/> Israel.</p><p>The Palestinians must come to the table knowing that the bond between<br/> the United States and Israel is unbreakable. They must come to the<br/> table willing and able to stop the terror being committed on a daily<br/> basis against Israel and they must come to the table willing to accept<br/> that Israel is a Jewish State and it will forever exist as a Jewish<br/> State.</p><p>Thank you very much, its been a great honor to be with you.</p><p>——————–</p><p>My comment: This is better than I would have expected, not as good as I would have hoped. It is not a ritual genuflection, but a practical acknowledgement of the current realities. The deal with Iran is ridiculous. Attacking the UN is the right thing to do and may be a harbinger of more positive developments on that front. Moving the embassy is irrelevant, but a nice gesture.</p><p>At no point is there any indication that he is inclined to wage Israel’s wars for them as the previous two presidents have done, and that is the main thing.</p></div>",
  "content_text": "Good evening. I speak to you today as a lifelong supporter and true\nfriend of Israel. I am a newcomer to politics but not to backing the\nJewish state.\nIn late 2001, weeks after the attacks on New York City and Washington\n– attacks perpetrated by Islamic fundamentalists, Mayor Giuliani\nvisited Israel to show solidarity with terror victims. I sent him in my\nplane because I backed the mission 100%.\nIn Spring 2004, at the height of violence in the Gaza Strip, I was\nthe Grand Marshal of the 40th Salute to Israel Parade, the largest\nsingle gathering in support of the Jewish state.\nIt was a very dangerous time for Israel and frankly for anyone\nsupporting Israel – many people turned down this honor –I did not, I\ntook the risk.\nI didn’t come here tonight to pander to you about Israel. That’s what\npoliticians do: all talk, no action. I came here to speak to you about\nwhere I stand on the future of American relations with our strategic\nally, our unbreakable friendship, and our cultural brother, the only\ndemocracy in the Middle East, the State of Israel.\nMy number one priority is to dismantle the disastrous deal with Iran.\nI have been in business a long time. I know deal-making and let me tell\nyou, this deal is catastrophic – for America, for Israel, and for the\nwhole Middle East.\nThe problem here is fundamental. We have rewarded the world’s leading\nstate sponsor of terror with $150 billion and we received absolutely\nnothing in return.\nI’ve studied this issue in greater detail than almost anybody. The\nbiggest concern with the deal is not necessarily that Iran is going to\nviolate it, although it already has, the bigger problem is that they can\nkeep the terms and still get to the bomb by simply running out the\nclock, and, of course, they keep the billions.\nThe deal doesn’t even require Iran to dismantle its military nuclear\ncapability! Yes, it places limits on its military nuclear program for\nonly a certain number of years. But when those restrictions expire, Iran\nwill have an industrial-size military nuclear capability ready to go,\nand with zero provision for delay no matter how bad Iran’s behavior is.\nWhen I am president, I will adopt a strategy that focuses on three\nthings when it comes to Iran.\nFirst, we will stand up to Iran’s aggressive push to destabilize and\ndominate the region. Iran is a very big problem and will continue to be,\nbut if I’m elected President, I know how to deal with trouble. Iran is a\nproblem in Iraq, a problem in Syria, a problem in Lebanon, a problem in\nYemen, and will be a very major problem for Saudi Arabia. Literally\nevery day, Iran provides more and better weapons to their puppet states.\nHezbollah in Lebanon has received sophisticated anti-ship weapons,\nanti-aircraft weapons, and GPS systems on rockets. Now they’re in Syria\ntrying to establish another front against Israel from the Syrian side of\nthe Golan Heights.\nIn Gaza, Iran is supporting Hamas and Islamic Jihad – and in the West\nBank they are openly offering Palestinians $7,000 per terror attack and\n$30,000 for every Palestinian terrorist’s home that’s been destroyed.\nIran is financing military forces throughout the Middle East and it\nis absolutely indefensible that we handed them over $150 billion to\nfacilitate even more acts of terror.\nSecondly, we will totally dismantle Iran’s global terror network.\nIran has seeded terror groups all over the world. During the last five\nyears, Iran has perpetrated terror attacks in 25 different countries on\nfive continents. They’ve got terror cells everywhere, including in the\nwestern hemisphere very close to home. Iran is the biggest sponsor of\nterrorism around the world and we will work to dismantle that reach.\nThird, at the very least, we must hold Iran accountable by\nrestructuring the terms of the previous deal. Iran has already – since\nthe deal is in place – test-fired ballistic missiles three times. Those\nballistic missiles, with a range of 1,250 miles, were designed to\nintimidate not only Israel, which is only 600 miles away but also\nintended to frighten Europe, and, someday, the United States.\nDo you want to hear something really shocking? As many of the great\npeople in this room know, painted on those missiles – in both Hebrew and\nFarsi – were the words “Israel must be wiped off the face of the\nearth.”\nWhat kind of demented minds write that in Hebrew? And here’s another\ntwisted part – testing these missiles does not even violate the horrible\ndeal that we made!\nThe deal is silent on test missiles but those tests DO violate UN\nSecurity Council Resolutions. The problem is, no one has done anything\nabout it. Which brings me to my next point – the utter weakness and\nincompetence of the United Nations.\nThe United Nations is not a friend of democracy. It’s not a friend to\nfreedom. It’s not a friend even to the United States of America, where\nas all know, it has its home. And it surely isn’t a friend to Israel.\nWith President Obama in his final year, discussions have been\nswirling about an attempt to bring a security council resolution on the\nterms of an eventual agreement between Israel and Palestine. Let me be\nclear: An agreement imposed by the UN would be a total and complete\ndisaster. The United States must oppose this resolution and use the\npower of our veto. Why? Because that’s not how you make a deal.\nDeals are made when parties come to the table and negotiate. Each\nside must give up something it values in exchange for something it\nrequires. A deal that imposes conditions on Israel and the Palestinian\nAuthority will do nothing to bring peace. It will only further\ndelegitimize Israel and it would reward Palestinian terrorism, because\nevery day they are stabbing Israelis – and even Americans.\nJust last week, American Taylor Allen Force, a West Point grad who\nserved in Iraq and Afghanistan, was murdered in the street by a\nknife-wielding Palestinian. You don’t reward that behavior, you confront\nit!\nIt’s not up the United Nations to impose a solution. The parties must\nnegotiate a resolution themselves. The United States can be useful as a\nfacilitator of negotiations, but no one should be telling Israel it\nmust abide by some agreement made by others thousands of miles away that\ndon’t even really know what’s happening.\nWhen I’m president, believe me, I will veto any attempt by the UN to\nimpose its will on the Jewish state. You see, I know about deal-making –\nthat’s what I do. I wrote The Art of the Deal, one of the all-time\nbest-selling books about deals and deal making. To make a great deal,\nyou need two willing participants.\nWe know Israel is willing to deal. Israel has been trying to sit down\nat the negotiating table, without pre-conditions, for years. You had\nCamp David in 2000, where Prime Minister Barak made an incredible offer –\nmaybe even too generous. Arafat rejected it.\nIn 2008, Prime Minister Olmert made an equally generous offer. The\nPalestinian Authority rejected it. Then John Kerry tried to come up with\na framework and Abbas didn’t even respond, not even to the Secretary of\nState of the United States of America!\nWhen I become President, the days of treating Israel like a\nsecond-class citizen will end on Day One. I will meet with Prime\nMinister Netanyahu immediately. I have known him for many years and we\nwill be able to work closely together to help bring stability and peace\nto Israel and to the entire region.\nMeanwhile, every single day, you have rampant incitement and children\nbeing taught to hate Israel and hate the Jews. When you live in a\nsociety where the firefighters are the hero’s little kids want to be\nfirefighters.\nWhen you live in a society where athletes and movie stars are heroes,\nlittle kids want to be athletes and movie stars. In Palestinian\nsociety, the heroes are those who murder Jews – we can’t let this\ncontinue. You cannot achieve peace if terrorists are treated as martyrs.\nGlorifying terrorists is a tremendous barrier to peace.\nIn Palestinian textbooks and mosques, you’ve got a culture of hatred\nthat has been fermenting there for years, and if we want to achieve\npeace, they’ve got to end this indoctrination of hatred. There is no\nmoral equivalency. Israel does not name public squares after terrorists.\nIsrael does not pay its children to stab random Palestinians.\nYou see, what President Obama gets wrong about deal making is that he\nconstantly applies pressure to our friends and rewards our enemies.\nThat pattern, practiced by the President and his administration,\nincluding former Secretary of State, Hillary Clinton, has repeated\nitself over and over and has done nothing but embolden those who hate\nAmerica. We saw that with releasing $150 billion to Iran in the hope\nthat they would magically join the world community – It’s the same with\nIsrael and Palestine.\nPresident Obama thinks that applying pressure to Israel will force\nthe issue, but it’s precisely the opposite. Already, half the population\nof Palestine has been taken over by the Palestinian ISIS in Hamas, and\nthe other half refuses to confront the first half, so it’s a very\ndifficult situation but when the United States stands with Israel, the\nchances of peace actually rise. That’s what will happen when I’m\npresident.\nWe will move the American embassy to the eternal capital of the\nJewish people, Jerusalem – and we will send a clear signal that there is\nno daylight between America and our most reliable ally, the state of\nIsrael.\nThe Palestinians must come to the table knowing that the bond between\nthe United States and Israel is unbreakable. They must come to the\ntable willing and able to stop the terror being committed on a daily\nbasis against Israel and they must come to the table willing to accept\nthat Israel is a Jewish State and it will forever exist as a Jewish\nState.\nThank you very much, its been a great honor to be with you.\n——————–\nMy comment: This is better than I would have expected, not as good as I would have hoped. It is not a ritual genuflection, but a practical acknowledgement of the current realities. The deal with Iran is ridiculous. Attacking the UN is the right thing to do and may be a harbinger of more positive developments on that front. Moving the embassy is irrelevant, but a nice gesture.\nAt no point is there any indication that he is inclined to wage Israel’s wars for them as the previous two presidents have done, and that is the main thing.",
  "tags": [
    "politics",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-22T17:00:00+00:00"
}