{
  "url": "https://voxday.net/2016/03/28/idolocracy-and-idiocracy/",
  "scraped_at": "2025-12-17T17:51:38.175715",
  "title": "Idolocracy and idiocracy",
  "date_display": "March 28, 2016",
  "date_iso": "2016-03-28T08:41:00+00:00",
  "date_from_url": "2016-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I saw part of an episode of American Idol last night, and what struck me immediately was that it, and the commercials run for its viewers, was entertainment for retards and children. There was an Angry Birds skit/commercial that was very nearly as embarrassing as it was insulting to the intelligence of the audience. As near as I could tell in the 10 minutes or so that I managed to endure it, it looked as if it was aiming for an audience with an IQ of around 85-90. This makes commercial sense, of course, given the fact that I’ve calculated the average US IQ has fallen at least four points based on demographic change alone.</p><p>I thought my calculation was pessimistic for the long-term fate of the USA, but it turns out that the situation <a href=\"http://charltonteaching.blogspot.com/2015/06/the-destruction-of-common-sense-and.html\">may well be <i>considerably</i> worse</a>. If Bruce Charlton and Michael Woodley are correct, idiocracy is already here and there appears to be no way to reverse the course of the intellectual decline short of either a) a cataclysmic collapse and rebuilding of Western society or b) totalitarian scientific eugenicism on steroids.</p><blockquote class=\"tr_bq\"><p> It has been a fascinating, and I must admit horrifying, three-and-a-bit years since Michael Woodley and I first discovered <a href=\"http://charltonteaching.blogspot.co.uk/2012/02/convincing-objective-and-direct.html\">the first objective evidence</a> that there has been a very substantial decline in general intelligence (‘g’) over the past two hundred years – the evidence was posted on this blog just a few hours after we discovered it:</p><p>Since then, Michael has taken the lead in replicating this finding in multiple other forms of data, and in a variety of paradigms; and learning more about the magnitude of change and its timescale. His industry has been astonishing! </p><p>We currently believe that general intelligence has declined by approximately two standard deviations (which is approximately 30 IQ points) since 1800 – that is, over about 8 generations.</p><p>Such a decline is astonishing – at first sight. But its magnitude has been obscured by social and medical changes so that we underestimate intelligence in 1800 and over-estimate intelligence now.</p><p>On the other hand, magnitude and rapidity of decline in world class geniuses in the West (and of major innovations) does imply a decline of intelligence of at least 2 SDs – so from that perspective the rate and size of decline is pretty much as-expected.</p></blockquote><p>So much for the quaint notions of a shiny, sexy, seculatopia where reason and logic would reign over all. If they are right, we’ll be fortunate if our great-great-grandchildren don’t return to the trees and seas, a-grunting as they go.</p><p>To a certain extent, the crisis facing the species is similar to that of Nigeria, only writ large. Whereas the Nigerian population used to be limited by high child mortality and was able to feed itself, the importation of Western science and medical care reduced the child mortality rate, caused the population to explode, and has rendered the nation both unable to feed itself, and less intelligent on average as well.</p><p>In the West, one need only compare the difference between the popular books of fifty, one hundred, and two hundred years ago with today’s bestsellers to observe that there has been a prodigious decline in reader’s tastes, despite the fact that the less-intelligent half of the population doesn’t read at all.</p><p>These changes are not merely dysgenic and dyscivic, they are dyscivilizational. Which causes me to suspect that the future trend is not merely going to be nationalistic, but highly eugenicist as well. The first nation to ensure its homogenuity and solve the declining intelligence challenge will have a significant advantage over all the rest. The only upside that I see is that there should be no desire whatsoever to attack and rule over other nations and populations, although that carries some potentially ominous implications too.</p><p>I certainly hope they’re wrong, because it’s enough to make even a hard-core atheist science-fetishist want to say: “Come, Lord Jesus, and soon!”</p></div>",
  "content_text": "I saw part of an episode of American Idol last night, and what struck me immediately was that it, and the commercials run for its viewers, was entertainment for retards and children. There was an Angry Birds skit/commercial that was very nearly as embarrassing as it was insulting to the intelligence of the audience. As near as I could tell in the 10 minutes or so that I managed to endure it, it looked as if it was aiming for an audience with an IQ of around 85-90. This makes commercial sense, of course, given the fact that I’ve calculated the average US IQ has fallen at least four points based on demographic change alone.\nI thought my calculation was pessimistic for the long-term fate of the USA, but it turns out that the situation\nmay well be\nconsiderably\nworse\n. If Bruce Charlton and Michael Woodley are correct, idiocracy is already here and there appears to be no way to reverse the course of the intellectual decline short of either a) a cataclysmic collapse and rebuilding of Western society or b) totalitarian scientific eugenicism on steroids.\nIt has been a fascinating, and I must admit horrifying, three-and-a-bit years since Michael Woodley and I first discovered\nthe first objective evidence\nthat there has been a very substantial decline in general intelligence (‘g’) over the past two hundred years – the evidence was posted on this blog just a few hours after we discovered it:\nSince then, Michael has taken the lead in replicating this finding in multiple other forms of data, and in a variety of paradigms; and learning more about the magnitude of change and its timescale. His industry has been astonishing!\nWe currently believe that general intelligence has declined by approximately two standard deviations (which is approximately 30 IQ points) since 1800 – that is, over about 8 generations.\nSuch a decline is astonishing – at first sight. But its magnitude has been obscured by social and medical changes so that we underestimate intelligence in 1800 and over-estimate intelligence now.\nOn the other hand, magnitude and rapidity of decline in world class geniuses in the West (and of major innovations) does imply a decline of intelligence of at least 2 SDs – so from that perspective the rate and size of decline is pretty much as-expected.\nSo much for the quaint notions of a shiny, sexy, seculatopia where reason and logic would reign over all. If they are right, we’ll be fortunate if our great-great-grandchildren don’t return to the trees and seas, a-grunting as they go.\nTo a certain extent, the crisis facing the species is similar to that of Nigeria, only writ large. Whereas the Nigerian population used to be limited by high child mortality and was able to feed itself, the importation of Western science and medical care reduced the child mortality rate, caused the population to explode, and has rendered the nation both unable to feed itself, and less intelligent on average as well.\nIn the West, one need only compare the difference between the popular books of fifty, one hundred, and two hundred years ago with today’s bestsellers to observe that there has been a prodigious decline in reader’s tastes, despite the fact that the less-intelligent half of the population doesn’t read at all.\nThese changes are not merely dysgenic and dyscivic, they are dyscivilizational. Which causes me to suspect that the future trend is not merely going to be nationalistic, but highly eugenicist as well. The first nation to ensure its homogenuity and solve the declining intelligence challenge will have a significant advantage over all the rest. The only upside that I see is that there should be no desire whatsoever to attack and rule over other nations and populations, although that carries some potentially ominous implications too.\nI certainly hope they’re wrong, because it’s enough to make even a hard-core atheist science-fetishist want to say: “Come, Lord Jesus, and soon!”",
  "tags": [
    "decline and fall",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-28T07:41:00+00:00"
}