{
  "url": "https://voxday.net/2016/03/12/introducing-devgame-blog/",
  "scraped_at": "2025-12-17T17:49:35.873732",
  "title": "Introducing DevGame the blog",
  "date_display": "March 12, 2016",
  "date_iso": "2016-03-12T16:30:00+00:00",
  "date_from_url": "2016-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The second course (and first online one) is coming to an end today, but in the interest of maintaining the little dev community that the course has inadvertently spawned, I have <a href=\"http://devgamecourse.blogspot.com/\">created a blog</a> to which a number of the course participants have author privileges.</p><p>The course itself has been extremely successful. The guests have included everything from programmers at cutting-edge studios to senior producers at EA, from game journalists like <i>The Escapist</i>‘s Oliver Campbell to well-known game developers like Mark Kern (<i>Diablo II</i> producer and <i>World of Warcraft</i> team lead.) And the attendees are working on five dev projects, all of which are updates of classic early 80’s games.</p><p>The course spawned a <i>Develop </i><a href=\"http://www.develop-online.net/opinions/the-art-of-imitative-design/0216094\">article on imitative design</a> requested by the editor who attended Session Three, and even <a href=\"http://devgamecourse.blogspot.com/2016/03/devgame-in-develop.html\">merited a mention</a> in this month’s GDC issue of the magazine.</p><p>The next course will begin in May. If you’re potentially interested in taking it or getting involved in one of the dev projects, I would encourage you to begin following <a href=\"http://devgamecourse.blogspot.com/\">the DevGame blog</a> and reading a few of the testimonials that can be found on the right sidebar.</p><p><i>“The Devgame course is great. It’s a fantastic opportunity to learn the<br> history of games and the industry, to get the real word on how the<br> industry is, and to receive practical information on how games are made.<br> It was obvious from the first seminar that this class was worth every<br> penny.”</br></br></br></br></i></p><p>And yes, Brainstorm members will be permitted to attend the next course as well.</p></div>",
  "content_text": "The second course (and first online one) is coming to an end today, but in the interest of maintaining the little dev community that the course has inadvertently spawned, I have\ncreated a blog\nto which a number of the course participants have author privileges.\nThe course itself has been extremely successful. The guests have included everything from programmers at cutting-edge studios to senior producers at EA, from game journalists like\nThe Escapist\n‘s Oliver Campbell to well-known game developers like Mark Kern (\nDiablo II\nproducer and\nWorld of Warcraft\nteam lead.) And the attendees are working on five dev projects, all of which are updates of classic early 80’s games.\nThe course spawned a\nDevelop\narticle on imitative design\nrequested by the editor who attended Session Three, and even\nmerited a mention\nin this month’s GDC issue of the magazine.\nThe next course will begin in May. If you’re potentially interested in taking it or getting involved in one of the dev projects, I would encourage you to begin following\nthe DevGame blog\nand reading a few of the testimonials that can be found on the right sidebar.\n“The Devgame course is great. It’s a fantastic opportunity to learn the\nhistory of games and the industry, to get the real word on how the\nindustry is, and to receive practical information on how games are made.\nIt was obvious from the first seminar that this class was worth every\npenny.”\nAnd yes, Brainstorm members will be permitted to attend the next course as well.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2016-03-12T16:30:00+00:00"
}