{
  "url": "https://voxday.net/2016/03/05/leave-kids-offline/",
  "scraped_at": "2025-12-17T17:48:34.974978",
  "title": "Hey, parent, leave the kids offline",
  "date_display": "March 5, 2016",
  "date_iso": "2016-03-05T10:53:00+00:00",
  "date_from_url": "2016-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some of you will recall that I have <a href=\"http://www.milobookclub.com/2013/03/20/get-fuck-off-facebook/\">repeatedly </a>urged everyone here to stop posting pictures of your children on social media. I consider it to be a reprehensible violation of their privacy and an abrogation of one’s parental responsibilities in two ways: it robs them of the ability to make their own decisions and it risks exposing them to unwanted attention and potential danger. Worse, it does so for nothing more than to feed the short-term attention-seeking fix of narcissistic parents.</p><p>This is not a new subject. Back in 2009, <a href=\"http://www.milobookclub.com/2009/08/11/dont-be-stupid-its-interne/\">I wrote</a>:</p><blockquote class=\"tr_bq\"><p> Never, ever, put pictures of children up on the Internet. Not on Facebook, not on invitation-only Live Journals, and certainly not on public blogs. It’s not only reprehensibly stupid, it is completely disrespectful of a child’s right to make his own decisions about his public profile in the future. True, sometimes this is unavoidable, such as when a child happens to be in the news for one reason or another. But barring that, no responsible parent should ever upload a picture of a child to the Internet, no matter how proud one might happen to be.</p></blockquote><p>I repeated that again <a href=\"http://www.milobookclub.com/2013/03/05/intergenerational-war/\">three years ago</a>:</p><blockquote class=\"tr_bq\"><p> Don’t put pictures of your kids on Facebook or Instagram.  It’s stupid.  It’s obnoxious.  It’s thoughtless and self-centered.  And it’s their life, not yours, that you’re putting on public display.</p></blockquote><p>And, of course, there is absolutely no excuse for <i>ever </i>putting a picture of another family’s child on social media, for any reason. So, you can’t say you weren’t warned, as it appears the law in some countries is finally beginning to catch up to the obvious privacy violations involved.</p><blockquote class=\"tr_bq\"><p> French parents are being warned to stop posting pictures of children on social networks in case their offspring later sue them for breaching their right to privacy or jeopardising their security.</p><p>Under France’s stringent privacy laws, parents could face penalties as severe as a year in prison and a fine of €45,000 (£35,000) if convicted of publicising intimate details of the private lives of others — including their children – without their consent.</p><p>Eric Delcroix, an expert on internet law and ethics, said: “In a few years, children could easily take their parents to court for publishing photos of them when they were younger.”</p><p>Grown-ups who sue their parents for breaching their right to privacy as children could obtain substantial compensation awards, according to French legal experts.</p></blockquote><p>I won’t have any sympathy for the parents who find themselves getting hoist by their own narcissistic petard in the future. They will whine and cry about their ungrateful children, who will rightly respond: “why should I harbor any concern for your financial interests when you demonstrably didn’t give a damn about my legal and moral right to not be put on display to the world like a pet or a trophy?”</p></div>",
  "content_text": "Some of you will recall that I have\nrepeatedly\nurged everyone here to stop posting pictures of your children on social media. I consider it to be a reprehensible violation of their privacy and an abrogation of one’s parental responsibilities in two ways: it robs them of the ability to make their own decisions and it risks exposing them to unwanted attention and potential danger. Worse, it does so for nothing more than to feed the short-term attention-seeking fix of narcissistic parents.\nThis is not a new subject. Back in 2009,\nI wrote\n:\nNever, ever, put pictures of children up on the Internet. Not on Facebook, not on invitation-only Live Journals, and certainly not on public blogs. It’s not only reprehensibly stupid, it is completely disrespectful of a child’s right to make his own decisions about his public profile in the future. True, sometimes this is unavoidable, such as when a child happens to be in the news for one reason or another. But barring that, no responsible parent should ever upload a picture of a child to the Internet, no matter how proud one might happen to be.\nI repeated that again\nthree years ago\n:\nDon’t put pictures of your kids on Facebook or Instagram.  It’s stupid.  It’s obnoxious.  It’s thoughtless and self-centered.  And it’s their life, not yours, that you’re putting on public display.\nAnd, of course, there is absolutely no excuse for\never\nputting a picture of another family’s child on social media, for any reason. So, you can’t say you weren’t warned, as it appears the law in some countries is finally beginning to catch up to the obvious privacy violations involved.\nFrench parents are being warned to stop posting pictures of children on social networks in case their offspring later sue them for breaching their right to privacy or jeopardising their security.\nUnder France’s stringent privacy laws, parents could face penalties as severe as a year in prison and a fine of €45,000 (£35,000) if convicted of publicising intimate details of the private lives of others — including their children – without their consent.\nEric Delcroix, an expert on internet law and ethics, said: “In a few years, children could easily take their parents to court for publishing photos of them when they were younger.”\nGrown-ups who sue their parents for breaching their right to privacy as children could obtain substantial compensation awards, according to French legal experts.\nI won’t have any sympathy for the parents who find themselves getting hoist by their own narcissistic petard in the future. They will whine and cry about their ungrateful children, who will rightly respond: “why should I harbor any concern for your financial interests when you demonstrably didn’t give a damn about my legal and moral right to not be put on display to the world like a pet or a trophy?”",
  "tags": [
    "law",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-05T10:53:00+00:00"
}