{
  "url": "https://voxday.net/2016/03/30/mailvox-atheism-and-motte-and-bailey/",
  "scraped_at": "2025-12-17T17:51:54.642416",
  "title": "Mailvox: atheism and the motte-and-bailey analogy",
  "date_display": "March 30, 2016",
  "date_iso": "2016-03-30T15:00:00+00:00",
  "date_from_url": "2016-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BJ, an atheist, didn’t feel the topic that was debated in <i><b><a href=\"http://amzn.to/25lBoDq\">On the Existence of Gods</a></b></i> was entirely fair.</p><blockquote class=\"tr_bq\"><p> As an atheist, I agree that Vox won the debate. His arguments were more<br> persuasive and coherent. Dominic was a good sport, but he was attacking a<br> castle with no cannons, no towers, no ram, not even a ladder. I don’t think it is a fair debate topic, though that is not Vox’s fault.<br> It’s what Myers originally claimed and what Dominic agreed to. But it’s<br> not a fair view on the subject.</br></br></br></br></p><p>This is the standard motte and<br> bailey for defending theism. You replace ‘proof of god’ with ‘doubt of<br> science’ and hope no one calls you on it (Dominic didn’t). Then you push<br> the atheist into admitting they can’t rule out the possibility of the<br> existence of something which may resemble a god or gods. Most people<br> consider that a win.</br></br></br></br></br></p><p>The problem I have with that is no priest<br> suggests the possibility of a god or gods, they talk about very specific<br> gods with very specific rules, demand very specific obedience, and ask<br> for very real money. None of them can prove their god is real but that<br> is the bailey position; when they are under attack they retreat to the<br> motte position, which is just “you can’t prove god(s) DON’T exist.”<br> Kinda weak basis for tithing 10% of my income.</br></br></br></br></br></br></p></blockquote><p>On the one hand, this is an entirely reasonable point with which I agree entirely. In fact, I repeatedly point out, in both <i>On the Existence of Gods</i> and in <i>The Irrational Atheist</i>, that the argument for the existence of the supernatural, the arguement for the existence of Gods, and the argument for the existence of the Creator God as described in the Bible are three entirely different arguments.</p><p>One could further observe, with equal justice, that none of these three arguments suffice to establish the Crucifixion and Resurrection of Jesus Christ of Nazareth or the existence of the Holy Trinity as described in the Constantinian revision of the original Nicene Creed.</p><p>The problem, however, is that BJ reverses the motte-and-bailey analogy as it is actually observed in the ongoing atheism-Christianity debate. For example, even in the debate he criticizes, Dominic’s sallies were initially directed at all forms of supernaturalism before being knocked back by my response which observed that the supernatural is a set of which gods are merely a subset.</p><p>More importantly, there was never any retreat to the Christian bailey. It simply wasn’t the subject at hand; the purpose of the debate was to challenge the atheist claim to the motte claimed by PZ Myers. And as for Dominic supposedly failing to call me on the very rational and substantive grounds to doubt the legitimacy of science, particularly as it relates to science’s ability to address the subject of gods, that was an intelligent tactical move on his part, because I would have easily demolished any attempt to rely upon science in that manner.</p><p>As readers of this blog know, I don’t regard science as being even remotely reliable in its own right, I consider its domain to be limited, and there is <i>considerable</i> documentary, logical, and even scientific evidence to support that position. It is certainly an effective tool, when utilized properly, but it is not a plausible arbiter of reality.</p><p>In any event, those interested in the subject appear to find <i><b><a href=\"http://amzn.to/25lBoDq\">On the Existence of Gods</a></b></i> to be a worthy addition to the historical discussion, as it is currently #2 in the Atheism category, sandwiched between a pair of books by Richard Dawkins. If you haven’t posted a review yet, I would encourage you to do so.</p></div>",
  "content_text": "BJ, an atheist, didn’t feel the topic that was debated in\nOn the Existence of Gods\nwas entirely fair.\nAs an atheist, I agree that Vox won the debate. His arguments were more\npersuasive and coherent. Dominic was a good sport, but he was attacking a\ncastle with no cannons, no towers, no ram, not even a ladder. I don’t think it is a fair debate topic, though that is not Vox’s fault.\nIt’s what Myers originally claimed and what Dominic agreed to. But it’s\nnot a fair view on the subject.\nThis is the standard motte and\nbailey for defending theism. You replace ‘proof of god’ with ‘doubt of\nscience’ and hope no one calls you on it (Dominic didn’t). Then you push\nthe atheist into admitting they can’t rule out the possibility of the\nexistence of something which may resemble a god or gods. Most people\nconsider that a win.\nThe problem I have with that is no priest\nsuggests the possibility of a god or gods, they talk about very specific\ngods with very specific rules, demand very specific obedience, and ask\nfor very real money. None of them can prove their god is real but that\nis the bailey position; when they are under attack they retreat to the\nmotte position, which is just “you can’t prove god(s) DON’T exist.”\nKinda weak basis for tithing 10% of my income.\nOn the one hand, this is an entirely reasonable point with which I agree entirely. In fact, I repeatedly point out, in both\nOn the Existence of Gods\nand in\nThe Irrational Atheist\n, that the argument for the existence of the supernatural, the arguement for the existence of Gods, and the argument for the existence of the Creator God as described in the Bible are three entirely different arguments.\nOne could further observe, with equal justice, that none of these three arguments suffice to establish the Crucifixion and Resurrection of Jesus Christ of Nazareth or the existence of the Holy Trinity as described in the Constantinian revision of the original Nicene Creed.\nThe problem, however, is that BJ reverses the motte-and-bailey analogy as it is actually observed in the ongoing atheism-Christianity debate. For example, even in the debate he criticizes, Dominic’s sallies were initially directed at all forms of supernaturalism before being knocked back by my response which observed that the supernatural is a set of which gods are merely a subset.\nMore importantly, there was never any retreat to the Christian bailey. It simply wasn’t the subject at hand; the purpose of the debate was to challenge the atheist claim to the motte claimed by PZ Myers. And as for Dominic supposedly failing to call me on the very rational and substantive grounds to doubt the legitimacy of science, particularly as it relates to science’s ability to address the subject of gods, that was an intelligent tactical move on his part, because I would have easily demolished any attempt to rely upon science in that manner.\nAs readers of this blog know, I don’t regard science as being even remotely reliable in its own right, I consider its domain to be limited, and there is\nconsiderable\ndocumentary, logical, and even scientific evidence to support that position. It is certainly an effective tool, when utilized properly, but it is not a plausible arbiter of reality.\nIn any event, those interested in the subject appear to find\nOn the Existence of Gods\nto be a worthy addition to the historical discussion, as it is currently #2 in the Atheism category, sandwiched between a pair of books by Richard Dawkins. If you haven’t posted a review yet, I would encourage you to do so.",
  "tags": [
    "atheism",
    "mailvox",
    "religion",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-30T14:00:00+00:00"
}