{
  "url": "https://voxday.net/2016/03/13/national-review-hates-working-class/",
  "scraped_at": "2025-12-17T17:49:42.811522",
  "title": "National Review hates working class whites",
  "date_display": "March 13, 2016",
  "date_iso": "2016-03-13T15:30:00+00:00",
  "date_from_url": "2016-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The beauty of the Trump campaign is that <a href=\"http://www.breitbart.com/big-government/2016/03/12/national-review-white-working-class-communities-morally-indefensible-they-deserve-to-die/\">it is unmasking all of the entryists, infiltrators, and cuckservatives</a> who have been leading conservatives astray for decades. Case in point, the white-hating “conservative” Kevin Williamson:</p><blockquote class=\"tr_bq\"><p> In a featured article for the prestigious conservative journal<br> entitled “The FatherFuhrer,” Williamson seeks to rebut criticism that he<br> and other conservatives don’t articulate any policies that would appeal<br> to Trump’s blue collar supporters.</br></br></br></p><p>Williamson, a long-time critic of The Donald, essentially agrees that<br> he doesn’t support any policies or rhetoric directly tailored to the<br> working-class — particularly about jobs being taken by outsourcing and<br> immigration — because it would be wrong to do so.</br></br></br></p><p>“It is immoral because it perpetuates a lie: that the white working<br> class that finds itself attracted to Trump has been victimized by<br> outside forces,” the NR roving correspondent writes. “[N]obody did this<br> to them. They failed themselves.”</br></br></br></p><p>He then goes on to make the conclusion that it’s great these<br> communities are dying out because they have a warped morality and are a<br> dead weight on the economy.</br></br></p><p>“The truth about these dysfunctional, downscale communities is that<br> they deserve to die. Economically, they are negative assets. Morally,<br> they are indefensible,” the conservative writer says.</br></br></p></blockquote><p>What is conservative about calling working class white communities morally indefensible and deserving of death?</p><p>It’s telling that National Review, which fired everyone from Sobran to Derbyshire, not only didn’t fire Williamson, they published his appalling, anti-white hate.</p></div>",
  "content_text": "The beauty of the Trump campaign is that\nit is unmasking all of the entryists, infiltrators, and cuckservatives\nwho have been leading conservatives astray for decades. Case in point, the white-hating “conservative” Kevin Williamson:\nIn a featured article for the prestigious conservative journal\nentitled “The FatherFuhrer,” Williamson seeks to rebut criticism that he\nand other conservatives don’t articulate any policies that would appeal\nto Trump’s blue collar supporters.\nWilliamson, a long-time critic of The Donald, essentially agrees that\nhe doesn’t support any policies or rhetoric directly tailored to the\nworking-class — particularly about jobs being taken by outsourcing and\nimmigration — because it would be wrong to do so.\n“It is immoral because it perpetuates a lie: that the white working\nclass that finds itself attracted to Trump has been victimized by\noutside forces,” the NR roving correspondent writes. “[N]obody did this\nto them. They failed themselves.”\nHe then goes on to make the conclusion that it’s great these\ncommunities are dying out because they have a warped morality and are a\ndead weight on the economy.\n“The truth about these dysfunctional, downscale communities is that\nthey deserve to die. Economically, they are negative assets. Morally,\nthey are indefensible,” the conservative writer says.\nWhat is conservative about calling working class white communities morally indefensible and deserving of death?\nIt’s telling that National Review, which fired everyone from Sobran to Derbyshire, not only didn’t fire Williamson, they published his appalling, anti-white hate.",
  "tags": [
    "cuckservative",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-13T15:30:00+00:00"
}