{
  "url": "https://voxday.net/2016/03/25/of-politicians-and-their-pants/",
  "scraped_at": "2025-12-17T17:51:17.303968",
  "title": "The Ted Cruz affair crisis",
  "date_display": "March 25, 2016",
  "date_iso": "2016-03-25T09:29:00+00:00",
  "date_from_url": "2016-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The National Enquirer has run a story about <a href=\"http://theconservativetreehouse.com/2016/03/24/the-national-enquirer-runs-story-of-multiple-ted-cruz-affairs/#more-114240\">“The 5 Romps that will destroy Ted Cruz”</a>, complete with pictures of the five women with whom he has supposedly had affairs.</p><blockquote class=\"tr_bq\"><p> Oh dear, the National Enquirer has come out with a story claiming evidence of multiple sexual trysts by presidential candidate Senator Ted Cruz.</p><p>Worse yet for the Cruz camp, the framework within the article is structurally very concerning:The National Enquirer is indeed <i>a tabloid</i> – and as such there are various grains of salt that should be applied when reviewing anything they present.</p><p>However, that said, they have been unfortunately accurate for more<br> than a few presidential hopefuls:  Gary Hart, Jesse Jackson and John<br> Edwards to name a few of the more infamous examples. Beyond the story itself there’s a few presenting elements which point<br> to a high degree of confidence, and as a consequence ‘legal<br> avoidance’, on the publishers’ part.</br></br></br></br></p><p>Firstly, they post pictures of the collective mistresses.  NE would never legally “<i>go there</i>” if they did not hold a very reasonable certainty the outlined players were factually part of the story.</p></blockquote><p>Despite being partially-obscured, three of the five women alleged to have been involved with Cruz have already been identified: Katrina Pierson, Sarah Isgur Flores and Amanda Carpenter. This story was already in the works at Breitbart, as Allum Bokhari had it back in February but was not permitted to run with it. The current timing strikes me as intriguing given the fact that Donald Trump already warned the Cruz campaign that there would be reprisals for their advertised attack on his wife Melania.</p><p>It also looks as if the Rubio campaign had the dirt on Cruz, <a href=\"https://t.co/vgmOznRFob\">but sat on it</a> in order to keep him viable against Donald Trump.</p></div>",
  "content_text": "The National Enquirer has run a story about\n“The 5 Romps that will destroy Ted Cruz”\n, complete with pictures of the five women with whom he has supposedly had affairs.\nOh dear, the National Enquirer has come out with a story claiming evidence of multiple sexual trysts by presidential candidate Senator Ted Cruz.\nWorse yet for the Cruz camp, the framework within the article is structurally very concerning:The National Enquirer is indeed\na tabloid\n– and as such there are various grains of salt that should be applied when reviewing anything they present.\nHowever, that said, they have been unfortunately accurate for more\nthan a few presidential hopefuls:  Gary Hart, Jesse Jackson and John\nEdwards to name a few of the more infamous examples. Beyond the story itself there’s a few presenting elements which point\nto a high degree of confidence, and as a consequence ‘legal\navoidance’, on the publishers’ part.\nFirstly, they post pictures of the collective mistresses.  NE would never legally “\ngo there\n” if they did not hold a very reasonable certainty the outlined players were factually part of the story.\nDespite being partially-obscured, three of the five women alleged to have been involved with Cruz have already been identified: Katrina Pierson, Sarah Isgur Flores and Amanda Carpenter. This story was already in the works at Breitbart, as Allum Bokhari had it back in February but was not permitted to run with it. The current timing strikes me as intriguing given the fact that Donald Trump already warned the Cruz campaign that there would be reprisals for their advertised attack on his wife Melania.\nIt also looks as if the Rubio campaign had the dirt on Cruz,\nbut sat on it\nin order to keep him viable against Donald Trump.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-25T09:29:00+00:00"
}