{
  "url": "https://voxday.net/2016/03/23/on-existence-of-gods/",
  "scraped_at": "2025-12-17T17:51:02.071364",
  "title": "On the Existence of Gods",
  "date_display": "March 23, 2016",
  "date_iso": "2016-03-23T08:52:00+00:00",
  "date_from_url": "2016-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://amzn.to/1RxIwlP\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2016/03/existence_480.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2016/03/existence_480.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p><a href=\"http://amzn.to/25lBoDq\"><b><i>ON THE EXISTENCE OF GODS</i></b></a> is the response to a public challenge posed by Dr. PZ Myers, a militant atheist who claimed to have never encountered any good arguments for the existence of gods. It is a competitive discourse between a Christian and an atheist, each of whom argue for their position on the subject, after which the arguments are adjudicated by a team of three judges, a Christian, an agnostic, and an atheist, before additional arguments are presented.</p><p>The format is compelling and the results are at times surprising, as the discussion takes unexpected twists and turns, while the judges exhibit ruthless impartiality as they criticize the arguments of both sides without mercy or favor. Vox Day, the author of <i>The Irrational Atheist</i>, presents the Christian perspective, while Dominic Saltarelli argues for the atheist position. The debate is wide-ranging and intelligent, but remains civil throughout, even as the momentum swings in favor of one side, and then the other. It also includes an appendix that addresses the argument for a science-based morality presented by Sam Harris in <i>The Moral Landscape</i>.</p><p><b><i><a href=\"http://amzn.to/25lBoDq\">ON THE EXISTENCE OF GODS</a></i></b> is a compelling test of how open the reader’s mind is to the various possibilities of reality, and is a worthy addition to the long history of Man’s contemplation of his own existence in the face of the divine.</p><p>From the reviewers:</p><ul><li><i>This is the first thing that I’ve read in a very long time that actually had new, novel, and interesting arguments – and both authors achieved this, on both sides of the debate. I find myself giving this book five stars purely for the astonishing<br> achievement of presenting novel arguments. After two thousand years of<br> debating the topic, that’s a remarkable achievement.</br></br></i></li><li><i>Watching a relentlessly logical mind like Vox Day at work is a sight to behold.</i></li><li><i>I enjoyed it very much, not least for the subtlety of the arguments.<br>This is a really enjoyable intellectual battle between a believer and an atheist which has the very unusual distinction, in such battles, of being courteous, humorous, and on a high intellectual level.</br></i></li></ul><p><i><b><a href=\"http://amzn.to/25lBoDq\">ON THE EXISTENCE OF GODS</a></b> </i>is 105 pages, $4.99, and DRM-free.</p></div>",
  "content_text": "ON THE EXISTENCE OF GODS\nis the response to a public challenge posed by Dr. PZ Myers, a militant atheist who claimed to have never encountered any good arguments for the existence of gods. It is a competitive discourse between a Christian and an atheist, each of whom argue for their position on the subject, after which the arguments are adjudicated by a team of three judges, a Christian, an agnostic, and an atheist, before additional arguments are presented.\nThe format is compelling and the results are at times surprising, as the discussion takes unexpected twists and turns, while the judges exhibit ruthless impartiality as they criticize the arguments of both sides without mercy or favor. Vox Day, the author of\nThe Irrational Atheist\n, presents the Christian perspective, while Dominic Saltarelli argues for the atheist position. The debate is wide-ranging and intelligent, but remains civil throughout, even as the momentum swings in favor of one side, and then the other. It also includes an appendix that addresses the argument for a science-based morality presented by Sam Harris in\nThe Moral Landscape\n.\nON THE EXISTENCE OF GODS\nis a compelling test of how open the reader’s mind is to the various possibilities of reality, and is a worthy addition to the long history of Man’s contemplation of his own existence in the face of the divine.\nFrom the reviewers:\nThis is the first thing that I’ve read in a very long time that actually had new, novel, and interesting arguments – and both authors achieved this, on both sides of the debate. I find myself giving this book five stars purely for the astonishing\nachievement of presenting novel arguments. After two thousand years of\ndebating the topic, that’s a remarkable achievement.\nWatching a relentlessly logical mind like Vox Day at work is a sight to behold.\nI enjoyed it very much, not least for the subtlety of the arguments.\nThis is a really enjoyable intellectual battle between a believer and an atheist which has the very unusual distinction, in such battles, of being courteous, humorous, and on a high intellectual level.\nON THE EXISTENCE OF GODS\nis 105 pages, $4.99, and DRM-free.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-23T08:52:00+00:00"
}