{
  "url": "https://voxday.net/2016/03/06/perception-vs-perspective/",
  "scraped_at": "2025-12-17T17:48:43.218510",
  "title": "Perception vs perspective",
  "date_display": "March 6, 2016",
  "date_iso": "2016-03-06T12:00:00+00:00",
  "date_from_url": "2016-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The anti-Trumpkins are strutting around the Internet and bellowing about how Ted Cruz blew away Donald Trump in the two states he won and narrowly lost to Trump in the two states Trump won. And that’s true, if you’re dumb enough to look only at the reported percentages rather than the actual numbers involved.</p><p>In Kansas and Maine, Cruz beat Trump by 18,145 and 2,480 votes, respectively. In Kentucky and Louisiana, Trump beat Cruz by 10,866 and 9,781 votes. So, Cruz actually lost to Trump on the overall vote count by a grand total of 22 votes, which is a) a dead heat and b) as irrelevant as who won what state.</p><p>On the delegate side, Cruz took 64 delegates to Trump’s 49. This, too, changed nothing, because Trump’s ability to reach the required number of delegates before the convention is going to be solely determined by the 391 delegates awarded by the winner-takes-all states so long as he can take 30 percent or more of the distribute-delegate states. Since he took 49 of the 112 delegates allocated yesterday, or 44 percent, Trump remains ahead of the game; the only real significance of Saturday was the implosion of Rubio.</p><p>Now, don’t get me wrong, it was a great night for Cruz, but it was a great night because <i>it showed he is the only alternative to Trump</i>, not because it demonstrated that his popularity had exploded or that he could actually beat Trump. The key result for him on Saturday was Rubio’s demise, who really should drop out of the race on Monday, and presumably, endorse Cruz before getting humiliated in his home state, virtually ensuring Trump’s nomination, and becoming entirely irrelevant.</p><p>Since Florida (99) and Ohio (66) account for nearly half of the remaining winner-takes-all delegates, Cruz has to prevent Trump from winning at least one of those states on March 15th. If Trump wins both, it will be extremely difficult to prevent him from collecting the additional 694 delegates he needs even if Cruz wins all of the proportional-distribution states.</p><p>The dilemma for Cruz is that if Rubio and Kasich drop out, it increases his slim chance of beating Trump in one of the two critical states. But if they stay in, they will continue to reduce the amount of proportional delegates that Trump collects. Cruz already knows he isn’t likely to get enough delegates himself, so his winning strategy is to try to stop Trump, not to try to win himself.</p><p>Game theory says that Cruz needs to get Rubio and Kasich out of the race and get their endorsements <i>right now</i> so they can campaign for him and help him poach either Florida or Ohio. Whether they are in or out, Trump is going to surpass the 30 percent threshold in the proportional states. Since Cruz was at 21 percent in Ohio and 12 percent in Florida, the key to the nomination is Kasich, not Rubio. And presumably, Kasich knows this, which is why he has stayed in the race up until now.</p><p>If I’m Trump, I’m making a deal with Kasich to get his endorsement and strike for the kill. Anything short of VP should be on the table. If I’m Kasich, I’m getting out of the race before Wednesday and cashing in at my peak value. And if I’m Cruz, I’m arranging for a quiet telephone call with Trump to see if what he’s willing to offer in exchange for an endorsement. There is a three-way Prisoner’s Dilemma here, as the first candidate to endorse Trump is the one who is the most valuable to him. Alternatively, Cruz should tell his supporters to vote Rubio in Florida and Kasich in Ohio.</p><p>On a side note, it’s interesting how this campaign has been largely consistent <a href=\"http://alphagameplan.blogspot.com/2016/03/sigma-vs-alpha.html\">with the socio-sexual interpretation</a> of the candidates from the start. It’s down to Sigma against Alpha, and the outcome will largely depend upon whom can do a better job of assembling popular support versus working the system. The situation appears to strongly favor the Alpha, but it is always dangerous to expect a Sigma to do the obvious or to count him out.</p><p>I am nagged by one serious doubt concerning what I’ve been told about Ted Cruz, and it’s not related to the obvious one concerning the extent to which he is the Goldman Sachs-preferred, CFR-approved candidate. If, as we are told, the establishment hates him so much more than Trump, why has Cruz been overperforming so dramatically in the states where the GOPe has more influence in the process.</p><p>I expect that we will soon learn whether Cruz fans have been telling the truth about whether the Republican establishment prefers him to Trump or not. If Fox and various GOP figures immediately begin fawning all over Cruz once Rubio withdraws, we will know they were, at the very least, incorrect.</p></div>",
  "content_text": "The anti-Trumpkins are strutting around the Internet and bellowing about how Ted Cruz blew away Donald Trump in the two states he won and narrowly lost to Trump in the two states Trump won. And that’s true, if you’re dumb enough to look only at the reported percentages rather than the actual numbers involved.\nIn Kansas and Maine, Cruz beat Trump by 18,145 and 2,480 votes, respectively. In Kentucky and Louisiana, Trump beat Cruz by 10,866 and 9,781 votes. So, Cruz actually lost to Trump on the overall vote count by a grand total of 22 votes, which is a) a dead heat and b) as irrelevant as who won what state.\nOn the delegate side, Cruz took 64 delegates to Trump’s 49. This, too, changed nothing, because Trump’s ability to reach the required number of delegates before the convention is going to be solely determined by the 391 delegates awarded by the winner-takes-all states so long as he can take 30 percent or more of the distribute-delegate states. Since he took 49 of the 112 delegates allocated yesterday, or 44 percent, Trump remains ahead of the game; the only real significance of Saturday was the implosion of Rubio.\nNow, don’t get me wrong, it was a great night for Cruz, but it was a great night because\nit showed he is the only alternative to Trump\n, not because it demonstrated that his popularity had exploded or that he could actually beat Trump. The key result for him on Saturday was Rubio’s demise, who really should drop out of the race on Monday, and presumably, endorse Cruz before getting humiliated in his home state, virtually ensuring Trump’s nomination, and becoming entirely irrelevant.\nSince Florida (99) and Ohio (66) account for nearly half of the remaining winner-takes-all delegates, Cruz has to prevent Trump from winning at least one of those states on March 15th. If Trump wins both, it will be extremely difficult to prevent him from collecting the additional 694 delegates he needs even if Cruz wins all of the proportional-distribution states.\nThe dilemma for Cruz is that if Rubio and Kasich drop out, it increases his slim chance of beating Trump in one of the two critical states. But if they stay in, they will continue to reduce the amount of proportional delegates that Trump collects. Cruz already knows he isn’t likely to get enough delegates himself, so his winning strategy is to try to stop Trump, not to try to win himself.\nGame theory says that Cruz needs to get Rubio and Kasich out of the race and get their endorsements\nright now\nso they can campaign for him and help him poach either Florida or Ohio. Whether they are in or out, Trump is going to surpass the 30 percent threshold in the proportional states. Since Cruz was at 21 percent in Ohio and 12 percent in Florida, the key to the nomination is Kasich, not Rubio. And presumably, Kasich knows this, which is why he has stayed in the race up until now.\nIf I’m Trump, I’m making a deal with Kasich to get his endorsement and strike for the kill. Anything short of VP should be on the table. If I’m Kasich, I’m getting out of the race before Wednesday and cashing in at my peak value. And if I’m Cruz, I’m arranging for a quiet telephone call with Trump to see if what he’s willing to offer in exchange for an endorsement. There is a three-way Prisoner’s Dilemma here, as the first candidate to endorse Trump is the one who is the most valuable to him. Alternatively, Cruz should tell his supporters to vote Rubio in Florida and Kasich in Ohio.\nOn a side note, it’s interesting how this campaign has been largely consistent\nwith the socio-sexual interpretation\nof the candidates from the start. It’s down to Sigma against Alpha, and the outcome will largely depend upon whom can do a better job of assembling popular support versus working the system. The situation appears to strongly favor the Alpha, but it is always dangerous to expect a Sigma to do the obvious or to count him out.\nI am nagged by one serious doubt concerning what I’ve been told about Ted Cruz, and it’s not related to the obvious one concerning the extent to which he is the Goldman Sachs-preferred, CFR-approved candidate. If, as we are told, the establishment hates him so much more than Trump, why has Cruz been overperforming so dramatically in the states where the GOPe has more influence in the process.\nI expect that we will soon learn whether Cruz fans have been telling the truth about whether the Republican establishment prefers him to Trump or not. If Fox and various GOP figures immediately begin fawning all over Cruz once Rubio withdraws, we will know they were, at the very least, incorrect.",
  "tags": [
    "Alpha Game",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-06T12:00:00+00:00"
}