{
  "url": "https://voxday.net/2016/03/12/queens-at-war/",
  "scraped_at": "2025-12-17T17:49:32.208937",
  "title": "Queens at war",
  "date_display": "March 12, 2016",
  "date_iso": "2016-03-12T06:39:00+00:00",
  "date_from_url": "2016-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A historical study of European queens <a href=\"http://nymag.com/scienceofus/2016/01/european-queens-waged-more-wars-than-kings.html\">produces some unexpected results</a>:</p><blockquote class=\"tr_bq\"><p> After sifting through historical data on queenly reigns across six centuries, two political scientists have found that it’s more complicated than that. In a recent working paper, New York University scholars Oeindrila Dube and S.P. Harish analyzed 28 European queenly reigns from 1480 to 1913 and found a 27 percent increase in wars when a queen was in power, as compared to the reign of a king. “People have this preconceived idea that states that are led by women engage in less conflict,” Dube told Pacific Standard, but her analysis of the data on European queens suggests another story.</p><p>Interestingly, Dube and Harish think the reason why queens were able to take part in more military policy can be explained by the division of labor that tended to happen when a queen — particularly a married queen — ruled. Queens managed foreign policy and war policies, which were often important to bring in cash, while their husbands managed the state (think taxes, crime, judicial issues, etc.). As the authors theorize, “greater division of labor under queenly reigns could have enabled queens to pursue more aggressive war policies.” Kings, on the other hand, didn’t tend to engage in division of labor like ruling queens — or, more specifically, they may have shared military and state duties with some close adviser, but not with the queen. And, Dube and Harish argue, it may be this “asymmetry in how queens relied on male spouses and kings relied on female spouses [that] strengthened the relative capacity of queenly reigns, facilitating their greater participation in warfare.”</p><p>The queens’ marital status made a difference here; as the authors write,<br> “among married monarchs, queens were more likely to participate as<br> attackers than kings.” If a queen were single — which was the case with<br> 13 of those they studied — she was more likely to be attacked compared<br> to the times when a king was in power, perhaps because her country was<br> seen in the outside world as being more vulnerable and thus easier to attack.</br></br></br></br></br></p></blockquote><p>Ironically, as Nate pointed out, this means that female leaders are more strongly correlated with warfare than religion. And it would be hard to argue that this relationship is not causal, given the fact that the queens were responsible for the decision to go to war.</p></div>",
  "content_text": "A historical study of European queens\nproduces some unexpected results\n:\nAfter sifting through historical data on queenly reigns across six centuries, two political scientists have found that it’s more complicated than that. In a recent working paper, New York University scholars Oeindrila Dube and S.P. Harish analyzed 28 European queenly reigns from 1480 to 1913 and found a 27 percent increase in wars when a queen was in power, as compared to the reign of a king. “People have this preconceived idea that states that are led by women engage in less conflict,” Dube told Pacific Standard, but her analysis of the data on European queens suggests another story.\nInterestingly, Dube and Harish think the reason why queens were able to take part in more military policy can be explained by the division of labor that tended to happen when a queen — particularly a married queen — ruled. Queens managed foreign policy and war policies, which were often important to bring in cash, while their husbands managed the state (think taxes, crime, judicial issues, etc.). As the authors theorize, “greater division of labor under queenly reigns could have enabled queens to pursue more aggressive war policies.” Kings, on the other hand, didn’t tend to engage in division of labor like ruling queens — or, more specifically, they may have shared military and state duties with some close adviser, but not with the queen. And, Dube and Harish argue, it may be this “asymmetry in how queens relied on male spouses and kings relied on female spouses [that] strengthened the relative capacity of queenly reigns, facilitating their greater participation in warfare.”\nThe queens’ marital status made a difference here; as the authors write,\n“among married monarchs, queens were more likely to participate as\nattackers than kings.” If a queen were single — which was the case with\n13 of those they studied — she was more likely to be attacked compared\nto the times when a king was in power, perhaps because her country was\nseen in the outside world as being more vulnerable and thus easier to attack.\nIronically, as Nate pointed out, this means that female leaders are more strongly correlated with warfare than religion. And it would be hard to argue that this relationship is not causal, given the fact that the queens were responsible for the decision to go to war.",
  "tags": [
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-12T06:39:00+00:00"
}