{
  "url": "https://voxday.net/2016/03/30/rabid-puppies-2016-updates-and-estimates/",
  "scraped_at": "2025-12-17T17:51:53.016710",
  "title": "Rabid Puppies 2016: updates and estimates",
  "date_display": "March 30, 2016",
  "date_iso": "2016-03-30T12:00:00+00:00",
  "date_from_url": "2016-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chaos Horizon estimates between 20 percent and 80 percent of the Rabid Puppies <a href=\"https://chaoshorizon.wordpress.com/2016/03/29/estimating-the-2016-hugo-nominations-part-2/\">will show up</a> to nominate:</p><blockquote class=\"tr_bq\"><p> If the Rabid Puppies had around 550 votes in 2015, how many will they bring to 2016? Since all those who voted in 2015 can nominate in 2016, I imagine it will be a big number. Even so, I can’t imagine carrying 100% over—the nomination stage is simply less interesting, less publicized, and more difficult to vote in. Let’s imagine three scenarios: an 80% scenario, a 60% scenario, and a 40% scenario. I think 80% is the most likely; this is the group most invested in impacting the Hugos and the most likely to team up again. And since they don’t have to pay an entry fee to participate in the nomination stage . . .</p><p>I also think this group will have solid slate discipline, voting the list as Vox Day published it. If you want to factor in some slate decay, I’d do so for lesser known books like Agent of the Imperium.</p></blockquote><p>I, personally, consider this to be an inadvertent affront. I would be surprised if only 80 percent of the Rabid Puppies could be bothered to show up and nominate – and remember, <i><b>tomorrow is the last day</b></i> in which you can <a href=\"http://midamericon2.org/the-hugo-awards/hugo-nominations/\">submit your nominations to MidAmericaCon II</a>. If you haven’t gotten around to it yet, don’t put it off any longer. Do it today.</p><p>What Chaos Horizon means by “slate decay” is a simple failure of discipline. Last year, for example, far more Puppies submitted nominations in Best Novel than in other, less important categories or went lone ranger on occasion. And while I can’t see what slate decay could possibly have to do with <a href=\"http://www.milobookclub.com/2016/03/21/rabid-puppies-2016-lis/\">what is merely a list of recommendations</a>, and by no means a direct order to<br> anyone, least of all the Rabid Puppies, the Sad Puppies, the Ilk, the<br> Dread Ilk, the Vile Faceless Minions, or the Evil Legion of Evil, by<br> their Supreme Dark Lord, I do think one would be remiss were one to fail to fill out the entire nominating ballot.</br></br></br></p><p>Speaking of which, I have <a href=\"http://www.milobookclub.com/2016/03/21/rabid-puppies-2016-lis/\">updated the Rabid Puppies 2016 list</a> with some of the additional information requested by the ballot form, such as the writers, directors, and editors in the Dramatic Presentation and Semiprozine categories. Be sure to check out your ballot before the end of day tomorrow to ensure that your voice is heard properly at the 2016 Hugo Awards. UPDATE: Note that as I have been unable to ascertain Rowena’s eligibility for Best Professional Artist, I am replacing her with <a href=\"http://rostant.com/fiction/\">LARRY ROSTANT</a> who does some excellent blended work.</p><p>There are two big questions that will dictate how the 2016 shortlist turns out. The first is whether the Tor cabal has enacted a whisper slate or not, although the one-year recusal of John Scalzi and others tends to indicate that the Torlings have elected to sit back and anticipate that events will provide the necessary support required to ratify EPH this year. Given the way EPH will ensure them at least one permanent nomination in every category, that would be a reasonable, if surprisingly strategic, approach. The second big question is how many Sad Puppies were converted to Rabid Puppies by the various antics of the Puppykickers; if this has actually happened, the RP turnout could potentially exceed 750.</p><p>But that, my dear canines, dolorous and corybantic, is entirely up to you. By the way, <i>be sure to save the copy of your ballot</i> that MidAmericaCon sends you after you enter your nominations. We will need them in order to verify the announced results.</p><p>UPDATE: MidAmeriCon II ‏has announced that the shortlist ballot will be announced on 26th April. Voting will open 15th May and close July 31st. Hugo/No Awards ceremony 20th August.</p></div>",
  "content_text": "Chaos Horizon estimates between 20 percent and 80 percent of the Rabid Puppies\nwill show up\nto nominate:\nIf the Rabid Puppies had around 550 votes in 2015, how many will they bring to 2016? Since all those who voted in 2015 can nominate in 2016, I imagine it will be a big number. Even so, I can’t imagine carrying 100% over—the nomination stage is simply less interesting, less publicized, and more difficult to vote in. Let’s imagine three scenarios: an 80% scenario, a 60% scenario, and a 40% scenario. I think 80% is the most likely; this is the group most invested in impacting the Hugos and the most likely to team up again. And since they don’t have to pay an entry fee to participate in the nomination stage . . .\nI also think this group will have solid slate discipline, voting the list as Vox Day published it. If you want to factor in some slate decay, I’d do so for lesser known books like Agent of the Imperium.\nI, personally, consider this to be an inadvertent affront. I would be surprised if only 80 percent of the Rabid Puppies could be bothered to show up and nominate – and remember,\ntomorrow is the last day\nin which you can\nsubmit your nominations to MidAmericaCon II\n. If you haven’t gotten around to it yet, don’t put it off any longer. Do it today.\nWhat Chaos Horizon means by “slate decay” is a simple failure of discipline. Last year, for example, far more Puppies submitted nominations in Best Novel than in other, less important categories or went lone ranger on occasion. And while I can’t see what slate decay could possibly have to do with\nwhat is merely a list of recommendations\n, and by no means a direct order to\nanyone, least of all the Rabid Puppies, the Sad Puppies, the Ilk, the\nDread Ilk, the Vile Faceless Minions, or the Evil Legion of Evil, by\ntheir Supreme Dark Lord, I do think one would be remiss were one to fail to fill out the entire nominating ballot.\nSpeaking of which, I have\nupdated the Rabid Puppies 2016 list\nwith some of the additional information requested by the ballot form, such as the writers, directors, and editors in the Dramatic Presentation and Semiprozine categories. Be sure to check out your ballot before the end of day tomorrow to ensure that your voice is heard properly at the 2016 Hugo Awards. UPDATE: Note that as I have been unable to ascertain Rowena’s eligibility for Best Professional Artist, I am replacing her with\nLARRY ROSTANT\nwho does some excellent blended work.\nThere are two big questions that will dictate how the 2016 shortlist turns out. The first is whether the Tor cabal has enacted a whisper slate or not, although the one-year recusal of John Scalzi and others tends to indicate that the Torlings have elected to sit back and anticipate that events will provide the necessary support required to ratify EPH this year. Given the way EPH will ensure them at least one permanent nomination in every category, that would be a reasonable, if surprisingly strategic, approach. The second big question is how many Sad Puppies were converted to Rabid Puppies by the various antics of the Puppykickers; if this has actually happened, the RP turnout could potentially exceed 750.\nBut that, my dear canines, dolorous and corybantic, is entirely up to you. By the way,\nbe sure to save the copy of your ballot\nthat MidAmericaCon sends you after you enter your nominations. We will need them in order to verify the announced results.\nUPDATE: MidAmeriCon II ‏has announced that the shortlist ballot will be announced on 26th April. Voting will open 15th May and close July 31st. Hugo/No Awards ceremony 20th August.",
  "tags": [
    "Hugo Award",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-30T11:00:00+00:00"
}