{
  "url": "https://voxday.net/2016/03/27/sanders-sweeps-saturday-caucuses/",
  "scraped_at": "2025-12-17T17:51:36.671019",
  "title": "Sanders sweeps Saturday caucuses",
  "date_display": "March 27, 2016",
  "date_iso": "2016-03-27T15:30:00+00:00",
  "date_from_url": "2016-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hillary’s meltdown <a href=\"http://www.politico.com/story/2016/03/democratic-primaries-2016-221256\">continues</a>:</p><blockquote class=\"tr_bq\"><p> Bernie Sanders swept all three Democratic caucuses Saturday — scoring<br> victories in Hawaii, Alaska and delegate-rich Washington state.</br></p><p>While the underdog’s West Coast wins are not nearly enough to trip up<br> former Secretary of State Hillary Clinton’s path to the nomination, his<br> wide margin of victory provides his campaign with a burst of momentum<br> heading into a 10-day break before the next primary contest. The Vermont<br> senator’s big victories are also typically followed by a considerable<br> fundraising bump.</br></br></br></br></br></p><p>Sanders was victorious in Washington state’s caucuses 72.7 percent<br> to Clinton’s 27.1 percent and won Alaska’s caucuses by a landslide,<br> defeating Clinton 81.6 percent to 18.4 percent. At 4 a.m. Sunday, with<br> 87.8 percent of precincts reporting, Sanders was declared the winner in<br> Hawaii, leading Clinton 70.6 percent to 29.2 percent.</br></br></br></br></p></blockquote><p>I will be surprised if Hillary Clinton doesn’t withdraw from the race for health reasons before the DNC. She quite clearly is not well and she won’t want to endure the humiliation of losing to such an obvious no-hoper as Sanders.</p></div>",
  "content_text": "Hillary’s meltdown\ncontinues\n:\nBernie Sanders swept all three Democratic caucuses Saturday — scoring\nvictories in Hawaii, Alaska and delegate-rich Washington state.\nWhile the underdog’s West Coast wins are not nearly enough to trip up\nformer Secretary of State Hillary Clinton’s path to the nomination, his\nwide margin of victory provides his campaign with a burst of momentum\nheading into a 10-day break before the next primary contest. The Vermont\nsenator’s big victories are also typically followed by a considerable\nfundraising bump.\nSanders was victorious in Washington state’s caucuses 72.7 percent\nto Clinton’s 27.1 percent and won Alaska’s caucuses by a landslide,\ndefeating Clinton 81.6 percent to 18.4 percent. At 4 a.m. Sunday, with\n87.8 percent of precincts reporting, Sanders was declared the winner in\nHawaii, leading Clinton 70.6 percent to 29.2 percent.\nI will be surprised if Hillary Clinton doesn’t withdraw from the race for health reasons before the DNC. She quite clearly is not well and she won’t want to endure the humiliation of losing to such an obvious no-hoper as Sanders.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-27T14:30:00+00:00"
}