{
  "url": "https://voxday.net/2016/03/27/stupidity-vs-psychopathy/",
  "scraped_at": "2025-12-17T17:51:35.191804",
  "title": "Stupidity vs psychopathy",
  "date_display": "March 27, 2016",
  "date_iso": "2016-03-27T13:07:00+00:00",
  "date_from_url": "2016-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That is the correct way <a href=\"http://blog.case.edu/think/2016/03/23/the_conflict_between_science_and_religion_lies_in_our_brains\">to describe the argumentum ad absurdum</a> of the religious mind versus the rational mind:</p><blockquote class=\"tr_bq\"><p> To believe in a supernatural god or universal spirit, people appear to suppress the brain network used for analytical thinking and engage the empathetic network, the scientists say. When thinking analytically about the physical world, people appear to do the opposite.</p><p>“When there’s a question of faith, from the analytic point of view, it may seem absurd,” said Tony Jack, who led the research. “But, from what we understand about the brain, the leap of faith to belief in the supernatural amounts to pushing aside the critical/analytical way of thinking to help us achieve greater social and emotional insight.”</p><p>Jack is an associate professor of philosophy at Case Western Reserve and research director of the university’s Inamori International Center of Ethics and Excellence, which helped sponsor the research.</p><p> ”A stream of research in cognitive psychology has shown and claims that people who have faith (i.e., are religious or spiritual) are not as smart as others. They actually might claim they are less intelligent.,” said Richard Boyatzis, distinguished university professor and professor of organizational behavior at Case Western Reserve, and a member of Jack’s team.</p><p>“Our studies confirmed that statistical relationship, but at the same time showed that people with faith are more prosocial and empathic,” he said.</p><p>In a series of eight experiments, the researchers found the more empathetic the person, the more likely he or she is religious.</p><p>That finding offers a new explanation for past research showing women tend to hold more religious or spiritual worldviews than men. The gap may be because women have a stronger tendency toward empathetic concern than men.</p><p>Atheists, the researchers found, are most closely aligned with psychopaths—not killers, but the vast majority of psychopaths classified as such due to their lack of empathy for others.</p></blockquote><p>This is yet another piece of scientific evidence in support of my hypothesis that atheism is nothing more than the predictable consequence of being neurologically atypical; that atheism is what might as reasonably be described as social autism.</p><p>Which, of course, is just another way of describing a lack of empathy. This makes sense, as I have all the attributes of the average atheist, with one key exception: I am highly empathetic. The short answer to the common question: “how can you believe in God when you are highly intelligent and well-educated” is “Because I am capable of empathizing with my fellow Man.”</p><p>As will be clear to anyone who has read the Metaphysics bestseller, <i>On the Existence of Gods</i>, atheism is not a rational position justified by reason and evidence. It is, quite to the contrary, an instinctive and emotional reaction to the atheist’s inability to identify with and relate to the world around him. This is why most atheists become atheists in their teenage years, and why so few are able to provide any justification for their atheism beyond a highly subjective appeal to their own credulity.</p><p>That doesn’t mean that atheism is not a legitimate expression of disbelief. It absolutely is, it simply isn’t what it purports to be.</p><p>However, it also explains the intrinsic distrust that normal individuals harbor for atheists; it is the same distrust they harbor for psychopaths and others who do not “read” normally.</p><p>As I once told Sam Harris in an email when I was helping him with the neurology experiment that led to <i>The Moral Landscape</i>, the scientific investigation into belief and unbelief is far more likely to discover things that trouble the atheist perspective considerably more than the religious one.</p><p>For example, if we can ever cure psychopathy by instilling empathy into those who lack it, one likely consequence will be the eventual elimination of atheism. And if the suppression of religious belief necessarily means the suppression of empathy, this renders all dreams of a functional post-religious society intrinsically impossible.</p><p>In any event, this will provide a useful rhetorical weapon for the theists. The next time an atheist tells you that you are less intelligent because you believe in God, the obvious response is that you are also, unlike the atheist, not a psychopath.</p></div>",
  "content_text": "That is the correct way\nto describe the argumentum ad absurdum\nof the religious mind versus the rational mind:\nTo believe in a supernatural god or universal spirit, people appear to suppress the brain network used for analytical thinking and engage the empathetic network, the scientists say. When thinking analytically about the physical world, people appear to do the opposite.\n“When there’s a question of faith, from the analytic point of view, it may seem absurd,” said Tony Jack, who led the research. “But, from what we understand about the brain, the leap of faith to belief in the supernatural amounts to pushing aside the critical/analytical way of thinking to help us achieve greater social and emotional insight.”\nJack is an associate professor of philosophy at Case Western Reserve and research director of the university’s Inamori International Center of Ethics and Excellence, which helped sponsor the research.\n”A stream of research in cognitive psychology has shown and claims that people who have faith (i.e., are religious or spiritual) are not as smart as others. They actually might claim they are less intelligent.,” said Richard Boyatzis, distinguished university professor and professor of organizational behavior at Case Western Reserve, and a member of Jack’s team.\n“Our studies confirmed that statistical relationship, but at the same time showed that people with faith are more prosocial and empathic,” he said.\nIn a series of eight experiments, the researchers found the more empathetic the person, the more likely he or she is religious.\nThat finding offers a new explanation for past research showing women tend to hold more religious or spiritual worldviews than men. The gap may be because women have a stronger tendency toward empathetic concern than men.\nAtheists, the researchers found, are most closely aligned with psychopaths—not killers, but the vast majority of psychopaths classified as such due to their lack of empathy for others.\nThis is yet another piece of scientific evidence in support of my hypothesis that atheism is nothing more than the predictable consequence of being neurologically atypical; that atheism is what might as reasonably be described as social autism.\nWhich, of course, is just another way of describing a lack of empathy. This makes sense, as I have all the attributes of the average atheist, with one key exception: I am highly empathetic. The short answer to the common question: “how can you believe in God when you are highly intelligent and well-educated” is “Because I am capable of empathizing with my fellow Man.”\nAs will be clear to anyone who has read the Metaphysics bestseller,\nOn the Existence of Gods\n, atheism is not a rational position justified by reason and evidence. It is, quite to the contrary, an instinctive and emotional reaction to the atheist’s inability to identify with and relate to the world around him. This is why most atheists become atheists in their teenage years, and why so few are able to provide any justification for their atheism beyond a highly subjective appeal to their own credulity.\nThat doesn’t mean that atheism is not a legitimate expression of disbelief. It absolutely is, it simply isn’t what it purports to be.\nHowever, it also explains the intrinsic distrust that normal individuals harbor for atheists; it is the same distrust they harbor for psychopaths and others who do not “read” normally.\nAs I once told Sam Harris in an email when I was helping him with the neurology experiment that led to\nThe Moral Landscape\n, the scientific investigation into belief and unbelief is far more likely to discover things that trouble the atheist perspective considerably more than the religious one.\nFor example, if we can ever cure psychopathy by instilling empathy into those who lack it, one likely consequence will be the eventual elimination of atheism. And if the suppression of religious belief necessarily means the suppression of empathy, this renders all dreams of a functional post-religious society intrinsically impossible.\nIn any event, this will provide a useful rhetorical weapon for the theists. The next time an atheist tells you that you are less intelligent because you believe in God, the obvious response is that you are also, unlike the atheist, not a psychopath.",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-27T12:07:00+00:00"
}