{
  "url": "https://voxday.net/2016/03/07/that-which-goes-unlinked/",
  "scraped_at": "2025-12-17T17:48:52.005652",
  "title": "That which goes unlinked",
  "date_display": "March 7, 2016",
  "date_iso": "2016-03-07T14:43:00+00:00",
  "date_from_url": "2016-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I found this <a href=\"http://accordingtohoyt.com/2016/03/07/sons-of-liberty-vs-national-front-jeb-kinnison/\">guest poster’s response</a>, to a commenter on a blog which may or may not be this one, to be interesting in its dedication to a) detail and b) avoiding the central issue at hand:</p><blockquote class=\"tr_bq\"><p> This is an interesting mix of “truthiness” and bigotry. Sarah is American by belief and choice, accused of being a “traitor” by people who think their ancestry and presence on the landmass of the US since birth make them guardians of the US nation-state. Aside from the incoherence (how can she be a traitor if she is not a member of the tribe?), the commenter attempts to other her by lumping her in with the virtue-signalling SJWs.</p><p>This commenter is sadly unAmerican in his resort to racist and sexist issue framing, completely misapplied to Sarah Hoyt. It’s unfortunate that the loud outpourings of these people, few in number but egging each other on in the fever swamps of sites like this blog-which-shall-go-unlinked, can so easily be used by progressive scribblers elsewhere to tar all dissenters from the Progressive program of thought control as racists, misogynists, and neo-Nazis (or worse!)</p><p>Which brings up a valid point these people have made: if Americanism is a bundle of individualist beliefs and attitudes, what about those with deep roots in the US, born and raised for generations there, who don’t accept those beliefs? If tolerance of difference is a watchword, then should those who don’t tolerate differences be suppressed or removed?</p><p>Our answer starts with looking at how we got to this point, where government has expanded and encroached on the private sphere of business and social organizations to the point where private action is viewed with suspicion, and a significant percentage of the population believes democracy means subjecting every action of business to the political process and regulation.</p><p>Americans were formerly known for their commitment to private charity and self-help organizations; the America of Alexis de Tocqueville in 1835 teemed with churches and private social organizations and lacked the inherited privilege and concentrations of unearned wealth and power seen in Europe. But he worried that “… a despotism under a democracy could see ‘a multitude of men’, uniformly alike, equal, ‘constantly circling for petty pleasures’, unaware of fellow citizens, and subject to the will of a powerful state which exerted an ‘immense protective power’. Tocqueville compared a potentially despotic democratic government to a protective parent who wants to keep its citizens (children) as ‘perpetual children’, and which doesn’t break men’s wills but rather guides it, and presides over people in the same way as a shepherd looking after a ‘flock of timid animals’. He also wrote that “The American Republic will endure until the day Congress discovers that it can bribe the public with the public’s money.”</p><p>He was prescient. We have arrived at that state.</p></blockquote><p>First, everyone would do well to settle down. Sarah Hoyt didn’t threaten to punch anyone. One of her white knights threatened to punch me if he ever encountered me, presumably due to my crimethink. As we see, their dedication to the propositions they profess doesn’t run terribly deep. But this is an intellectual dispute, and there is no need for anyone to get their panties in a bunch, or for fisticuffs.</p><p>Second, and more importantly, the post is mistitled. The situation is not “Sons of Liberty vs National Front” because in this particular case the Sons of Liberty <i>are </i>the National Front. Liberty and the Rights of Englishmen, are concepts that belong solely to the posterity of the American Founding Fathers, a posterity that excludes, among many, many other U.S. citizens, Sarah Hoyt.</p><p>Needless to say, they will try to redefine “posterity” just as they have redefined “American” and “democracy” and “liberal”. But if your position requires historical falsehoods, retrofittings, and redefinitions, your position is inherently flawed.</p><p>But the post does serve to nicely illustrate the intrinsically dishonest, pernicious, and untenable nature of the concept of the proposition nation, which anyone can join “by belief and choice”. Such a nation requires, <i>absolutely requires</i>, thought policing of the most stringent and ruthless variety, and is intrinsically totalitarian in a way that the most authoritarian “blood and soil” regime could never be.</p><p>It is no surprise that as a result of immigration and the necessary redefinition of what it is to be American, the country has become considerably less free despite the influx of these “belief and choice” citizens. The Know-Nothings were, more or less, correct. Indeed, the present situation is a direct consequence of the inability of 19th century immigrants to fully grasp the Rights of Englishmen, because they were never English and they will never be what might be described as Americans version 1.0. More recent arrivals are observably even less able to do so.</p><p>It’s rather ironic to observe that just as my maternal ancestors were robbed of their land and their heritage by one wave of colonists, my paternal ancesters are now being robbed of their birthright, their heritage, and <i>even their name</i> by succeeding waves of invaders.</p><p>The astonishing thing is that these advocates of the absurdity known as “the proposition nation” believe, genuinely believe, that they are the good guys. But they have confused rhetoric for reality, which is why their arguments inevitably end in either incoherence or untruths.</p><p>A Swedish reader comments: <i>“The only mystery is why Swedish politicians have got it in their heads that everyone who sets foot on Swedish soil will immediately embrace our values, our view of women and our traditions.”</i></p><p>And so we see, the pernicious lie of the proposition nation spreads.</p></div>",
  "content_text": "I found this\nguest poster’s response\n, to a commenter on a blog which may or may not be this one, to be interesting in its dedication to a) detail and b) avoiding the central issue at hand:\nThis is an interesting mix of “truthiness” and bigotry. Sarah is American by belief and choice, accused of being a “traitor” by people who think their ancestry and presence on the landmass of the US since birth make them guardians of the US nation-state. Aside from the incoherence (how can she be a traitor if she is not a member of the tribe?), the commenter attempts to other her by lumping her in with the virtue-signalling SJWs.\nThis commenter is sadly unAmerican in his resort to racist and sexist issue framing, completely misapplied to Sarah Hoyt. It’s unfortunate that the loud outpourings of these people, few in number but egging each other on in the fever swamps of sites like this blog-which-shall-go-unlinked, can so easily be used by progressive scribblers elsewhere to tar all dissenters from the Progressive program of thought control as racists, misogynists, and neo-Nazis (or worse!)\nWhich brings up a valid point these people have made: if Americanism is a bundle of individualist beliefs and attitudes, what about those with deep roots in the US, born and raised for generations there, who don’t accept those beliefs? If tolerance of difference is a watchword, then should those who don’t tolerate differences be suppressed or removed?\nOur answer starts with looking at how we got to this point, where government has expanded and encroached on the private sphere of business and social organizations to the point where private action is viewed with suspicion, and a significant percentage of the population believes democracy means subjecting every action of business to the political process and regulation.\nAmericans were formerly known for their commitment to private charity and self-help organizations; the America of Alexis de Tocqueville in 1835 teemed with churches and private social organizations and lacked the inherited privilege and concentrations of unearned wealth and power seen in Europe. But he worried that “… a despotism under a democracy could see ‘a multitude of men’, uniformly alike, equal, ‘constantly circling for petty pleasures’, unaware of fellow citizens, and subject to the will of a powerful state which exerted an ‘immense protective power’. Tocqueville compared a potentially despotic democratic government to a protective parent who wants to keep its citizens (children) as ‘perpetual children’, and which doesn’t break men’s wills but rather guides it, and presides over people in the same way as a shepherd looking after a ‘flock of timid animals’. He also wrote that “The American Republic will endure until the day Congress discovers that it can bribe the public with the public’s money.”\nHe was prescient. We have arrived at that state.\nFirst, everyone would do well to settle down. Sarah Hoyt didn’t threaten to punch anyone. One of her white knights threatened to punch me if he ever encountered me, presumably due to my crimethink. As we see, their dedication to the propositions they profess doesn’t run terribly deep. But this is an intellectual dispute, and there is no need for anyone to get their panties in a bunch, or for fisticuffs.\nSecond, and more importantly, the post is mistitled. The situation is not “Sons of Liberty vs National Front” because in this particular case the Sons of Liberty\nare\nthe National Front. Liberty and the Rights of Englishmen, are concepts that belong solely to the posterity of the American Founding Fathers, a posterity that excludes, among many, many other U.S. citizens, Sarah Hoyt.\nNeedless to say, they will try to redefine “posterity” just as they have redefined “American” and “democracy” and “liberal”. But if your position requires historical falsehoods, retrofittings, and redefinitions, your position is inherently flawed.\nBut the post does serve to nicely illustrate the intrinsically dishonest, pernicious, and untenable nature of the concept of the proposition nation, which anyone can join “by belief and choice”. Such a nation requires,\nabsolutely requires\n, thought policing of the most stringent and ruthless variety, and is intrinsically totalitarian in a way that the most authoritarian “blood and soil” regime could never be.\nIt is no surprise that as a result of immigration and the necessary redefinition of what it is to be American, the country has become considerably less free despite the influx of these “belief and choice” citizens. The Know-Nothings were, more or less, correct. Indeed, the present situation is a direct consequence of the inability of 19th century immigrants to fully grasp the Rights of Englishmen, because they were never English and they will never be what might be described as Americans version 1.0. More recent arrivals are observably even less able to do so.\nIt’s rather ironic to observe that just as my maternal ancestors were robbed of their land and their heritage by one wave of colonists, my paternal ancesters are now being robbed of their birthright, their heritage, and\neven their name\nby succeeding waves of invaders.\nThe astonishing thing is that these advocates of the absurdity known as “the proposition nation” believe, genuinely believe, that they are the good guys. But they have confused rhetoric for reality, which is why their arguments inevitably end in either incoherence or untruths.\nA Swedish reader comments:\n“The only mystery is why Swedish politicians have got it in their heads that everyone who sets foot on Swedish soil will immediately embrace our values, our view of women and our traditions.”\nAnd so we see, the pernicious lie of the proposition nation spreads.",
  "tags": [
    "cuckservative",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-07T14:43:00+00:00"
}