{
  "url": "https://voxday.net/2016/03/21/the-left-wing-mind/",
  "scraped_at": "2025-12-17T17:50:42.744795",
  "title": "The left-wing mind",
  "date_display": "March 21, 2016",
  "date_iso": "2016-03-21T09:13:00+00:00",
  "date_from_url": "2016-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.frontpagemag.com/fpm/262160/mind-left-insider-michael-faraday\">An explanation of it</a> from a red diaper baby now in recovery:</p><blockquote class=\"tr_bq\"><p> For the millions raised as leftists, it is not an ideology; it is a culture. Since childhood, they have lived and breathed it every day in the home. They know nothing else. Like any culture, it is a way of speaking, thinking and acting, with its own narratives and rituals. Narratives are held sacred, repeated, reinforced and, over time, added to. That which challenges sacred narratives, even reality itself, is met with confusion and hostility. As with any aggressive, intolerant culture, if you enter it, it enters you.</p><p>Contrary to opinion, leftism isn’t just about hate. Leftists are more complex than that. From my time as a red diaper leftist, I can tell you that a whole range of emotions are involved. Hate, anger, fear, bitterness, jealousy, envy, rage, greed, pride, smugness and paranoia (not technically an emotion, but it is widespread among leftists).</p><p>With such a parade of negative emotions, it is no surprise that so many leftists suffer from chronic depression, often from a young age. Even if they lose the anger, they still retain the attitude: that the government must fix everyone’s problems, regardless of cost and that there is an enormous right-wing conspiracy that is just around the corner.</p><p>The victim narrative of the Left is very infectious. You are always the victim and you are always owed something. The wealthy are always evil, while you are always good and wholesome. Converts are often more intense than those born into it. My father, raised a leftist, eventually mellowed and began to question some leftist beliefs. My mother, not raised a leftist, but having become one, never mellowed.</p><p>Leftism encourages and is driven by the most negative, damaging<br> emotions. It harnesses together childish emotions and paranoid thought<br> processes. Its narratives are a filter that reality has to try to<br> struggle through, often failing. The child-like thinking<br> solves all problems without pesky details and facts interfering, leading<br> to delusions of intellectual brilliance.</br></br></br></br></br></p></blockquote><p>It’s an interesting glimpse into what, for me, is an entirely alien mindset. I find it easier to understand those from very foreign cultures, including the English, the Italians, and even the Japanese, than I do a left-wing 2.0 American. While I correctly noted their fixation on narratives and the childish nature of their magical thinking, I was always mystified by their delusions of intellectual brilliance.</p><p>I put it down to their education and credential fetishes, but the author makes clear their belief in their intelligence is actually due to the fact that they are so deluded, they believe they are actually producing the solution to all the various problems they encounter by virtue of repeating their magic mantra: <i>more government spending</i>.</p><p>Of course, their concept of government is childish too; it is essentially a magic combination of a 365-day Santa Claus with a friendly Sunday School god whose got the whole world in his hands.</p><p>This is useful, as it provides several clues for rhetorical triggers that should prove devastating. It also explains why it is not merely my high intelligence, but my willingness to openly flaunt it, that reliably enrages them. This confirms my belief that if you assume emotional projection when attacked by a rhetoric speaker, you’ll be given the key to dismantle the attacker’s psyche.</p></div>",
  "content_text": "An explanation of it\nfrom a red diaper baby now in recovery:\nFor the millions raised as leftists, it is not an ideology; it is a culture. Since childhood, they have lived and breathed it every day in the home. They know nothing else. Like any culture, it is a way of speaking, thinking and acting, with its own narratives and rituals. Narratives are held sacred, repeated, reinforced and, over time, added to. That which challenges sacred narratives, even reality itself, is met with confusion and hostility. As with any aggressive, intolerant culture, if you enter it, it enters you.\nContrary to opinion, leftism isn’t just about hate. Leftists are more complex than that. From my time as a red diaper leftist, I can tell you that a whole range of emotions are involved. Hate, anger, fear, bitterness, jealousy, envy, rage, greed, pride, smugness and paranoia (not technically an emotion, but it is widespread among leftists).\nWith such a parade of negative emotions, it is no surprise that so many leftists suffer from chronic depression, often from a young age. Even if they lose the anger, they still retain the attitude: that the government must fix everyone’s problems, regardless of cost and that there is an enormous right-wing conspiracy that is just around the corner.\nThe victim narrative of the Left is very infectious. You are always the victim and you are always owed something. The wealthy are always evil, while you are always good and wholesome. Converts are often more intense than those born into it. My father, raised a leftist, eventually mellowed and began to question some leftist beliefs. My mother, not raised a leftist, but having become one, never mellowed.\nLeftism encourages and is driven by the most negative, damaging\nemotions. It harnesses together childish emotions and paranoid thought\nprocesses. Its narratives are a filter that reality has to try to\nstruggle through, often failing. The child-like thinking\nsolves all problems without pesky details and facts interfering, leading\nto delusions of intellectual brilliance.\nIt’s an interesting glimpse into what, for me, is an entirely alien mindset. I find it easier to understand those from very foreign cultures, including the English, the Italians, and even the Japanese, than I do a left-wing 2.0 American. While I correctly noted their fixation on narratives and the childish nature of their magical thinking, I was always mystified by their delusions of intellectual brilliance.\nI put it down to their education and credential fetishes, but the author makes clear their belief in their intelligence is actually due to the fact that they are so deluded, they believe they are actually producing the solution to all the various problems they encounter by virtue of repeating their magic mantra:\nmore government spending\n.\nOf course, their concept of government is childish too; it is essentially a magic combination of a 365-day Santa Claus with a friendly Sunday School god whose got the whole world in his hands.\nThis is useful, as it provides several clues for rhetorical triggers that should prove devastating. It also explains why it is not merely my high intelligence, but my willingness to openly flaunt it, that reliably enrages them. This confirms my belief that if you assume emotional projection when attacked by a rhetoric speaker, you’ll be given the key to dismantle the attacker’s psyche.",
  "tags": [
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-21T09:13:00+00:00"
}