{
  "url": "https://voxday.net/2016/03/31/the-abortion-misstep/",
  "scraped_at": "2025-12-17T17:52:01.338785",
  "title": "The abortion misstep",
  "date_display": "March 31, 2016",
  "date_iso": "2016-03-31T11:30:00+00:00",
  "date_from_url": "2016-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Trump mishandles <a href=\"http://www.zerohedge.com/news/2016-03-30/all-hell-breaks-loose-after-trump-says-women-must-be-punished-having-abortions\">a media ambush on abortion</a>:</p><blockquote class=\"tr_bq\"><ul><li>Host Chris Matthews presses Trump on anti-abortion position, repeatedly asking him, “Should abortion be punished? This is not something you can dodge”<ul><li>“Look, people in certain parts of the Republican Party, conservative Republicans, would say, ‘Yes, it should,’” Trump answers</li><li>“How about you?” Matthews asks</li><li>“I would say it’s a very serious problem and it’s a problem we have to decide on. Are you going to send them to jail?” Trump says</li><li>“I’m asking you,” Matthews says</li><li>“I am pro-life,” Trump says</li><li>“How do you actually ban abortion?” Matthews asks</li><li>“Well, you go back to a position like they had where they would perhaps go to illegal places but we have to ban it,” Trump says</li></ul></li><li>Matthews then presses Trump on if he believes there should be punishment for abortion if it were illegal<ul><li>“There has to be some form of punishment,” Trump says</li><li>“For the woman?” Matthews says; “Yeah,” Trump says, nodding</li><li>Trump says punishment would “have to be determined”</li><li>“They’ve<br> set the law and frankly the judges, you’re going to have a very big<br> election coming up for that reason because you have judges where it’s a<br> real tipping point and with the loss of Scalia, who was a very strong<br> conservative, this presidential election is going to be very important,”<br> Trump says</br></br></br></br></br></li><li>“When you say what’s the law, nobody knows what the law is going to be. It depends on who gets elected,” Trump says</li></ul></li></ul><p>Obviously, this was “gotcha” journalism on Matthews’ part (once he established that he was referring to <i>illegal</i><br> abortions he knew he could pin Trump between having to either say women<br> should be punished or that women could break the law with impunity),<br> and as we saw last year with the whole Kurds/Quds Hugh Hewitt debacle,<br> Trump is susceptible to badgering. The other problem here is that it<br> isn’t clear that Trump truly believes some of the things he’s forced to<br> say as a Republican candidate, which leads to exchanges like that<br> recounted above. “Don’t overthink it: Trump doesn’t understand the<br> pro-life position because he’s not pro-life,” a Cruz aid tweeted. Here’s<br> Politico <a href=\"http://www.politico.com/blogs/2016-gop-primary-live-updates-and-results/2016/03/donald-trump-illegal-abortions-punish-women-221391\">with a bit of context</a>:</br></br></br></br></br></br></br></br></br></p><blockquote><div class=\"quote_start\"></div><div class=\"quote_end\"></div><p><i>Trump’s policy idea is a departure from most state abortion<br> restrictions, which don’t impose penalties on the women who get<br> abortions. Typically, any penalties are imposed on the physician who<br> does the procedure.</br></br></br></i></p><p><i>The anti-abortion movement in recent decades has shied<br> away from the perception that it is “punishing” women for getting<br> abortions. Instead, it has focused on penalties for the<br> physicians who provide them, such as imposing medical or legal<br> restrictions on their practice. In some rare situations, women have<br> faced charges associated with abortions they have attempted on their<br> own.</br></br></br></br></br></br></i></p></blockquote><p>Having realized this had become a PR fiasco, Trump promptly walked back his comments.</p><p>This is a statement released just moments ago, in which the<br> billionaire revises his statement, calling the women “victims”, and<br> stating it is doctors who should be held legally responsible for<br> performing the illegal act:</br></br></br></p><p><i> If Congress were to pass legislation making abortion illegal and<br> the federal courts upheld this legislation, or any state were permitted<br> to ban abortion under state and federal law, the doctor or any other<br> person performing this illegal act upon a woman would be legally<br> responsible, not the woman. The woman is a victim in this case as is the<br> life in her womb. My position has not changed – like Ronald Reagan, I am pro-life with exceptions.</br></br></br></br></br></i></p></blockquote><p>That’s one of the risks of being outspoken and unafraid. People will lay traps for you, and from time to time, you will step in them. Trump made an initial mistake by hemming and hawing, thereby letting Matthews know that he didn’t have an effective position staked out and encouraging him to press on it. Then, he made the mistake of answering the dilemma posed instead of falling back on the trusty old “I’ve got people for that” evasion.</p><p>And finally, he compounded his error by backing down. The correct thing would have been to stand by his correct position in the abstract – women absolutely SHOULD be punished for murdering children  – while providing a practical temporization of it by observing that the primary goal is to save children, and politically, it will be impossible to stop legal abortion in a female-majority democracy if women are punished for having abortions.</p><p>In other words, he should have said that while he believes women are responsible for their criminal actions, and ideally should be held responsible for them, in this particular case, the interests of the unborn children should be prioritized and the punishments focused on the abortion providers.</p><div class=\"quote_start\"></div></div>",
  "content_text": "Trump mishandles\na media ambush on abortion\n:\nHost Chris Matthews presses Trump on anti-abortion position, repeatedly asking him, “Should abortion be punished? This is not something you can dodge”\n“Look, people in certain parts of the Republican Party, conservative Republicans, would say, ‘Yes, it should,’” Trump answers\n“How about you?” Matthews asks\n“I would say it’s a very serious problem and it’s a problem we have to decide on. Are you going to send them to jail?” Trump says\n“I’m asking you,” Matthews says\n“I am pro-life,” Trump says\n“How do you actually ban abortion?” Matthews asks\n“Well, you go back to a position like they had where they would perhaps go to illegal places but we have to ban it,” Trump says\nMatthews then presses Trump on if he believes there should be punishment for abortion if it were illegal\n“There has to be some form of punishment,” Trump says\n“For the woman?” Matthews says; “Yeah,” Trump says, nodding\nTrump says punishment would “have to be determined”\n“They’ve\nset the law and frankly the judges, you’re going to have a very big\nelection coming up for that reason because you have judges where it’s a\nreal tipping point and with the loss of Scalia, who was a very strong\nconservative, this presidential election is going to be very important,”\nTrump says\n“When you say what’s the law, nobody knows what the law is going to be. It depends on who gets elected,” Trump says\nObviously, this was “gotcha” journalism on Matthews’ part (once he established that he was referring to\nillegal\nabortions he knew he could pin Trump between having to either say women\nshould be punished or that women could break the law with impunity),\nand as we saw last year with the whole Kurds/Quds Hugh Hewitt debacle,\nTrump is susceptible to badgering. The other problem here is that it\nisn’t clear that Trump truly believes some of the things he’s forced to\nsay as a Republican candidate, which leads to exchanges like that\nrecounted above. “Don’t overthink it: Trump doesn’t understand the\npro-life position because he’s not pro-life,” a Cruz aid tweeted. Here’s\nPolitico\nwith a bit of context\n:\nTrump’s policy idea is a departure from most state abortion\nrestrictions, which don’t impose penalties on the women who get\nabortions. Typically, any penalties are imposed on the physician who\ndoes the procedure.\nThe anti-abortion movement in recent decades has shied\naway from the perception that it is “punishing” women for getting\nabortions. Instead, it has focused on penalties for the\nphysicians who provide them, such as imposing medical or legal\nrestrictions on their practice. In some rare situations, women have\nfaced charges associated with abortions they have attempted on their\nown.\nHaving realized this had become a PR fiasco, Trump promptly walked back his comments.\nThis is a statement released just moments ago, in which the\nbillionaire revises his statement, calling the women “victims”, and\nstating it is doctors who should be held legally responsible for\nperforming the illegal act:\nIf Congress were to pass legislation making abortion illegal and\nthe federal courts upheld this legislation, or any state were permitted\nto ban abortion under state and federal law, the doctor or any other\nperson performing this illegal act upon a woman would be legally\nresponsible, not the woman. The woman is a victim in this case as is the\nlife in her womb. My position has not changed – like Ronald Reagan, I am pro-life with exceptions.\nThat’s one of the risks of being outspoken and unafraid. People will lay traps for you, and from time to time, you will step in them. Trump made an initial mistake by hemming and hawing, thereby letting Matthews know that he didn’t have an effective position staked out and encouraging him to press on it. Then, he made the mistake of answering the dilemma posed instead of falling back on the trusty old “I’ve got people for that” evasion.\nAnd finally, he compounded his error by backing down. The correct thing would have been to stand by his correct position in the abstract – women absolutely SHOULD be punished for murdering children  – while providing a practical temporization of it by observing that the primary goal is to save children, and politically, it will be impossible to stop legal abortion in a female-majority democracy if women are punished for having abortions.\nIn other words, he should have said that while he believes women are responsible for their criminal actions, and ideally should be held responsible for them, in this particular case, the interests of the unborn children should be prioritized and the punishments focused on the abortion providers.",
  "tags": [
    "law",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-31T10:30:00+00:00"
}