{
  "url": "https://voxday.net/2016/03/25/the-fruit-of-compassion/",
  "scraped_at": "2025-12-17T17:51:24.045145",
  "title": "The fruit of compassion",
  "date_display": "March 25, 2016",
  "date_iso": "2016-03-25T18:00:00+00:00",
  "date_from_url": "2016-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://madworldnews.com/liberal-teacher-muslim-refugee/\">This heart-warming story</a> of a man taking a poor Muslim refugee into his home sounds almost too metaphorically fitting to be true:</p><blockquote class=\"tr_bq\"><p> A leftist professor decided to put into practice his own liberal<br> “open doors” policy, feeding and housing a poor Muslim refugee in his<br> own home. However, when his colleague showed up to find out why he<br> wasn’t at work, he found a stomach-churning trail that’s enough for<br> anyone to abandon their progressive “multicultural” beliefs.</br></br></br></br></p><p>A high school math teacher from Celle, a city near Hanover, Germany,<br> foolishly bought into the propaganda that Muslim asylum seekers can be<br> won over with Western hospitality and tolerance. Mehdi Hushmand was not<br> only popular with his students, but he had become an active volunteer in<br> the refugee movement.<br> Mehdi, a 55-year-old migrant himself from Iran, sympathized with the<br> flood of Muslim asylum seekers flocking across the borders. He began<br> bringing food, aid, and supplies to refugee centers, but he still felt<br> he wasn’t doing enough. So, he made friends with the male refugees, even<br> letting a few of them stay with him in his house.</br></br></br></br></br></br></br></br></br></p><p><a href=\"http://celleheute.de/dank-spenden-getoeteter-lehrer-mehdi-hushmand-im-iran-beigesetzt/\" rel=\"noopener\" target=\"_blank\">Celle Heute</a><br> reports that when Mehdi didn’t show up for work, one of his co-workers<br> went to check on him. After searching the home in February, he<br> discovered what looked like a trail of blood leading to the basement. It<br> was there that the colleague found Mehdi butchered and lying dead in a<br> pool of his own blood.</br></br></br></br></br></p></blockquote><p>It would be nice if all the casualties of refugee compassion could be limited to the compassionate.</p></div>",
  "content_text": "This heart-warming story\nof a man taking a poor Muslim refugee into his home sounds almost too metaphorically fitting to be true:\nA leftist professor decided to put into practice his own liberal\n“open doors” policy, feeding and housing a poor Muslim refugee in his\nown home. However, when his colleague showed up to find out why he\nwasn’t at work, he found a stomach-churning trail that’s enough for\nanyone to abandon their progressive “multicultural” beliefs.\nA high school math teacher from Celle, a city near Hanover, Germany,\nfoolishly bought into the propaganda that Muslim asylum seekers can be\nwon over with Western hospitality and tolerance. Mehdi Hushmand was not\nonly popular with his students, but he had become an active volunteer in\nthe refugee movement.\nMehdi, a 55-year-old migrant himself from Iran, sympathized with the\nflood of Muslim asylum seekers flocking across the borders. He began\nbringing food, aid, and supplies to refugee centers, but he still felt\nhe wasn’t doing enough. So, he made friends with the male refugees, even\nletting a few of them stay with him in his house.\nCelle Heute\nreports that when Mehdi didn’t show up for work, one of his co-workers\nwent to check on him. After searching the home in February, he\ndiscovered what looked like a trail of blood leading to the basement. It\nwas there that the colleague found Mehdi butchered and lying dead in a\npool of his own blood.\nIt would be nice if all the casualties of refugee compassion could be limited to the compassionate.",
  "tags": [
    "Clash of Civilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-25T18:00:00+00:00"
}