{
  "url": "https://voxday.net/2016/03/18/the-rise-of-channel-alt-rig/",
  "scraped_at": "2025-12-17T17:50:25.744799",
  "title": "The rise of Channel Alt Right",
  "date_display": "March 18, 2016",
  "date_iso": "2016-03-18T20:22:00+00:00",
  "date_from_url": "2016-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, the Kickstarter for Silenced is winding down. You only have four more hours to back it. <a href=\"https://www.kickstarter.com/projects/1494748038/silenced-our-war-on-free-speech\" rel=\"noopener\" target=\"_blank\">Back Silenced here</a>. I did. And I suspect that you’re going to want to be able to say you did too.</p><p>Second,  Mike Cernovich <a href=\"http://www.dangerandplay.com/2016/03/16/the-media-battle-no-one-saw/\">explains why the media</a> is losing its undeclared, but vicious war on the Alt Right:</p><blockquote class=\"tr_bq\"><p> Why has the mainstream media and especially conservative pundits<br> projected their rage onto Donald Trump and his supporters? Pundits are<br> fighting hard because there’s a war going on. No one saw this war. Well,<br> almost no one…</br></br></br></p><blockquote class=\"twitter-tweet\" data-width=\"500\"><div dir=\"ltr\" lang=\"en\"> This is a real time battle for future leadership of right wing media. I know it, Trump knows it, and even some cucks know it. <a href=\"https://twitter.com/sorin\">@sorin</a></div><p>— Mike Cernovich (@Cernovich) <a href=\"https://twitter.com/Cernovich/status/642125110900588544\">September 10, 2015</a></p></blockquote><h3 style=\"text-align: center;\"> This election has been about more than Trump.<br> This is a war over the future of the media.</br></h3><p>Pundits are poor in money and rich and status. Most of them live off<br> of sugar daddies to pay their bills, and money does not drive pundits.</br></p><p>Pundits are status obsessed. Being seen as the right kind of person<br> is their only goal in life. They live and die on shame…the feeling that<br> they do or do not belong to the proper social class.</br></br></p><p>Supposed journalists and pundits have accumulated considerable social<br> status and power. With the power of an article, journalists have forced<br> the most powerful politicians and richest chief executives to quit<br> their jobs.</br></br></br></p><p>One does not lose power without a fight.</p></blockquote><p>Third, on the basis of the new polls that show Trump +52 in New York, +12 in Arizona, and +16 in California (the latter is less credible since Rubio is included, but he’s only got 10 points), it is safe to conclude that Donald Trump has effectively won the Republican nomination.</p><p>He’s still got to close it out, but at this point, it would be a major surprise if he didn’t. He’s clearly increasing his lead over Cruz at this point.</p><p>UPDATE: Holy cats, nice work, everyone. It was at 58K when I last noticed. It finished with <b>838 backers pledging $71,060</b> to bring SILENCED to life. Well done.</p><p>I’ve spoken to Mike about this, and I don’t think he’d mind me telling you that the seeds being planted here are going to result in a lot more than just a single documentary film. The man has a vision and it is one worth supporting.</p></div>",
  "content_text": "First, the Kickstarter for Silenced is winding down. You only have four more hours to back it.\nBack Silenced here\n. I did. And I suspect that you’re going to want to be able to say you did too.\nSecond,  Mike Cernovich\nexplains why the media\nis losing its undeclared, but vicious war on the Alt Right:\nWhy has the mainstream media and especially conservative pundits\nprojected their rage onto Donald Trump and his supporters? Pundits are\nfighting hard because there’s a war going on. No one saw this war. Well,\nalmost no one…\nThis is a real time battle for future leadership of right wing media. I know it, Trump knows it, and even some cucks know it.\n@sorin\n— Mike Cernovich (@Cernovich)\nSeptember 10, 2015\nThis election has been about more than Trump.\nThis is a war over the future of the media.\nPundits are poor in money and rich and status. Most of them live off\nof sugar daddies to pay their bills, and money does not drive pundits.\nPundits are status obsessed. Being seen as the right kind of person\nis their only goal in life. They live and die on shame…the feeling that\nthey do or do not belong to the proper social class.\nSupposed journalists and pundits have accumulated considerable social\nstatus and power. With the power of an article, journalists have forced\nthe most powerful politicians and richest chief executives to quit\ntheir jobs.\nOne does not lose power without a fight.\nThird, on the basis of the new polls that show Trump +52 in New York, +12 in Arizona, and +16 in California (the latter is less credible since Rubio is included, but he’s only got 10 points), it is safe to conclude that Donald Trump has effectively won the Republican nomination.\nHe’s still got to close it out, but at this point, it would be a major surprise if he didn’t. He’s clearly increasing his lead over Cruz at this point.\nUPDATE: Holy cats, nice work, everyone. It was at 58K when I last noticed. It finished with\n838 backers pledging $71,060\nto bring SILENCED to life. Well done.\nI’ve spoken to Mike about this, and I don’t think he’d mind me telling you that the seeds being planted here are going to result in a lot more than just a single documentary film. The man has a vision and it is one worth supporting.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-18T20:22:00+00:00"
}