{
  "url": "https://voxday.net/2016/03/20/the-more-things-change/",
  "scraped_at": "2025-12-17T17:50:41.272263",
  "title": "The more things change….",
  "date_display": "March 20, 2016",
  "date_iso": "2016-03-20T18:47:00+00:00",
  "date_from_url": "2016-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to see how the new media, particularly Twitter, Wikipedia, and Facebook, are blithely walking in <a href=\"http://theothermccain.com/2016/03/20/fear-and-loathing-kazika-the-mad-jap-could-not-be-reached-for-comment/\">the footsteps of the old media</a>:</p><blockquote class=\"tr_bq\"><p> When Bill Kovach decided circa 1987 that the Atlanta papers needed a bureau in Nairobi, he could afford to do it, because the paper was making a handsome profit from advertising revenue. The fact that advertising ultimately paid the bills — the source of revenue, whereas the salaries of the newsroom staff were an expense — was an aspect of journalism that a lot of Good for Democracy types never really figured out. Bottom-line considerations were far from the minds of most people in our nation’s newsrooms 25 years ago, before Al Gore invented the Internet, and then some guy named Matt Drudge became America’s Editor-in-Chief.</p><p>Oh, the pages and pages of classified ads — help wanted, real estate,<br> used cars, whatever — that were once such a magnificent revenue<br> generator for newspaper publishers. Oh, the display ads from department<br> stores, and the full-color advertising inserts stuffed inside that thick<br> Sunday paper. Nearly all gone now — gone with the wind, along with the<br> fat profit margins that allowed Bill Kovach the luxury of force-feeding<br> readers in Atlanta their journalistic broccoli about the famine in<br> Sudan. Gone, those glory days when newsrooms were so crowded, and every<br> major metropolitan paper had an “investigative journalism” team of a<br> half-dozen hotshots whose bylines rarely appeared in print except on<br> those tedious five-part series written for the eyes of the Pulitzer<br> Prize judges.</br></br></br></br></br></br></br></br></br></br></br></p><p>Yeah, once upon a time, every newspaper in every state capital in<br> America — from Tallahassee to Juneau, from Augusta, Maine, to Honolulu,<br> Hawaii — had its own local crew of would-be Woodward and Bernsteins who<br> believed they were producing journalism that was Good for Democracy.</br></br></br></p><p>Gone! All gone now!</p></blockquote><p>In the same way the old media chased off its readers with what McCain calls “broccoli journalism”, the new media is chasing off its readers by telling them what they can and cannot say. In both cases, it is because the media wrongly believes it, and not its readers, are in control.</p><p>And that is only going to be of benefit to what we might call the next media, or if you prefer, the Alt Right media.</p></div>",
  "content_text": "It’s interesting to see how the new media, particularly Twitter, Wikipedia, and Facebook, are blithely walking in\nthe footsteps of the old media\n:\nWhen Bill Kovach decided circa 1987 that the Atlanta papers needed a bureau in Nairobi, he could afford to do it, because the paper was making a handsome profit from advertising revenue. The fact that advertising ultimately paid the bills — the source of revenue, whereas the salaries of the newsroom staff were an expense — was an aspect of journalism that a lot of Good for Democracy types never really figured out. Bottom-line considerations were far from the minds of most people in our nation’s newsrooms 25 years ago, before Al Gore invented the Internet, and then some guy named Matt Drudge became America’s Editor-in-Chief.\nOh, the pages and pages of classified ads — help wanted, real estate,\nused cars, whatever — that were once such a magnificent revenue\ngenerator for newspaper publishers. Oh, the display ads from department\nstores, and the full-color advertising inserts stuffed inside that thick\nSunday paper. Nearly all gone now — gone with the wind, along with the\nfat profit margins that allowed Bill Kovach the luxury of force-feeding\nreaders in Atlanta their journalistic broccoli about the famine in\nSudan. Gone, those glory days when newsrooms were so crowded, and every\nmajor metropolitan paper had an “investigative journalism” team of a\nhalf-dozen hotshots whose bylines rarely appeared in print except on\nthose tedious five-part series written for the eyes of the Pulitzer\nPrize judges.\nYeah, once upon a time, every newspaper in every state capital in\nAmerica — from Tallahassee to Juneau, from Augusta, Maine, to Honolulu,\nHawaii — had its own local crew of would-be Woodward and Bernsteins who\nbelieved they were producing journalism that was Good for Democracy.\nGone! All gone now!\nIn the same way the old media chased off its readers with what McCain calls “broccoli journalism”, the new media is chasing off its readers by telling them what they can and cannot say. In both cases, it is because the media wrongly believes it, and not its readers, are in control.\nAnd that is only going to be of benefit to what we might call the next media, or if you prefer, the Alt Right media.",
  "tags": [
    "media",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-03-20T18:47:00+00:00"
}