{
  "url": "https://voxday.net/2016/03/23/trump-math-updated/",
  "scraped_at": "2025-12-17T17:51:03.899684",
  "title": "Trump: the math updated",
  "date_display": "March 23, 2016",
  "date_iso": "2016-03-23T11:30:00+00:00",
  "date_from_url": "2016-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, Arizona, which matters, went for Trump, and did so by a 23-percent margin that exceeded the +13 polls by 10 points. Utah, which doesn’t matter much (I had Trump getting 17 delegates there, but he won’t get any), went unanimously to Cruz. So, let’s update the previous delegate math.</p><p>You may recall I originally stated this: <i>If Trump wins Florida, Ohio, Pennsylvania, New Jersey, and<br> California, plus one state from the following list (Arizona, Missouri,<br> Indiana, Wisconsin), he wins the nomination. Period. Nothing else<br> matters.</br></br></br></i></p><p>Since then, he has won Florida, Missouri and Arizona, but lost Ohio. So<i>, </i>all he needs now, in practical terms, is Pennsylvania, New Jersey, and California. Those are the three vital states, which the latest, but mostly outdated, polls currently show:</p><ul><li>Pennsylvania: Trump +17</li><li>New Jersey: Trump +27</li><li>California: Trump +16</li></ul><p>According to Fox News, after Arizona, Trump has 739 delegates<i>.</i> There are 238 proportional votes to be distributed; due to his strength in New York we can safely expect Trump to win at least 126 of them. That brings him to 865, which means he will need 372 out of the remaining 539 winner-takes-all delegates, or 69 percent of them.</p><p>That is three points fewer than he needed before this week; Cruz’s outperformance in Utah didn’t accomplish anything because Trump’s strength in New York outweighs Cruz’s in Utah.</p><p>As far as states go, to mathematically close out the nomination, he’ll need, at a minimum, Pennsylvania, New Jersey, California, Indiana, and one smaller state. If Cruz or Kasich can’t win at least one of those four states, (and two if one of them isn’t California), Trump will hit the required 1,237 delegates.</p><p>Of course, none of this takes into account the potential game-changing endorsement of Ted Cruz by Jeb Bush. You may want to consider the possibility that Cruz will withdraw from the race and join a monastery in Borneo. And, of course, the endorsement demonstrates the intrinsic falseness of the contention that the GOPe hates and fears Ted Cruz over all.</p></div>",
  "content_text": "So, Arizona, which matters, went for Trump, and did so by a 23-percent margin that exceeded the +13 polls by 10 points. Utah, which doesn’t matter much (I had Trump getting 17 delegates there, but he won’t get any), went unanimously to Cruz. So, let’s update the previous delegate math.\nYou may recall I originally stated this:\nIf Trump wins Florida, Ohio, Pennsylvania, New Jersey, and\nCalifornia, plus one state from the following list (Arizona, Missouri,\nIndiana, Wisconsin), he wins the nomination. Period. Nothing else\nmatters.\nSince then, he has won Florida, Missouri and Arizona, but lost Ohio. So\n,\nall he needs now, in practical terms, is Pennsylvania, New Jersey, and California. Those are the three vital states, which the latest, but mostly outdated, polls currently show:\nPennsylvania: Trump +17\nNew Jersey: Trump +27\nCalifornia: Trump +16\nAccording to Fox News, after Arizona, Trump has 739 delegates\n.\nThere are 238 proportional votes to be distributed; due to his strength in New York we can safely expect Trump to win at least 126 of them. That brings him to 865, which means he will need 372 out of the remaining 539 winner-takes-all delegates, or 69 percent of them.\nThat is three points fewer than he needed before this week; Cruz’s outperformance in Utah didn’t accomplish anything because Trump’s strength in New York outweighs Cruz’s in Utah.\nAs far as states go, to mathematically close out the nomination, he’ll need, at a minimum, Pennsylvania, New Jersey, California, Indiana, and one smaller state. If Cruz or Kasich can’t win at least one of those four states, (and two if one of them isn’t California), Trump will hit the required 1,237 delegates.\nOf course, none of this takes into account the potential game-changing endorsement of Ted Cruz by Jeb Bush. You may want to consider the possibility that Cruz will withdraw from the race and join a monastery in Borneo. And, of course, the endorsement demonstrates the intrinsic falseness of the contention that the GOPe hates and fears Ted Cruz over all.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2016-03-23T11:30:00+00:00"
}