{
  "url": "https://voxday.net/2014/01/04/2013-and-beyond/",
  "scraped_at": "2025-12-15T16:42:09.361783",
  "title": "2013 and beyond",
  "date_display": "January 4, 2014",
  "date_iso": "2014-01-04T11:26:00+00:00",
  "date_from_url": "2014-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It seems some other bloggers are beginning to get into the habit of being open with their traffic numbers; it’s nice to see people gradually getting over the idea that hiding this information from people will somehow inflate their perceived importance. Here are the Google pageviews for a few other bloggers, with the Global Alexa rank given in parentheses.</p><p>Whatever: 7,519,279<br> <a href=\"http://isteve.blogspot.com/\">Steve Sailer</a>: 6,635,426<br> <a href=\"http://therationalmale.com/\">Rational Male</a>: 2,543,859</br></br></p><p>Being open with our traffic is a healthy exercise, I think, because it prevents us from getting too carried away with any exaggerated sense of our own importance. The numbers are a tiny drop in the bucket compared to mainstream media sites like Fox News and the New York Times, but remember, there was a time when those media outlets were once very small too. If anyone else has a site for which they’d like to share their Google pageviews, leave the data in the comments and I’ll add it here.</p><p>It strikes me as almost criminal that such an original thinker as Steve should have only 6.6 million pageviews per year when clueless wonders such as Malcolm Gladwell are bestselling authors, but <a href=\"http://isteve.blogspot.com/2014/01/2013-isteve-blog-stats-13526540-minutes.html\">as Steve himself notes</a>, <i>“The reality is that web searches bring a lot of people to individual<br> postings I’ve written and then … it doesn’t make much impression on<br> them. They presumably stare blankly for awhile and then they’re on their<br> way. I suspect that my combination of highbrow content without highbrow<br> affectation is a turnoff for the vast majority of random visitors.”</br></br></br></br></i></p><p>They are the sort of people who gravitate to liberal blogs that invariably describe themselves as “thoughtful” while mindlessly repeating pablum straight out of the New York Times without ever evincing evidence of having had a single original thought of their own.</p><p>I don’t appear to have Steve’s problem, as the admitted reluctance of many bloggers to link here means that most of my traffic consists of regular readers rather than web searches and fly-by-nighters. Of course, it also means that the level of engagement, the average visit duration, and the quality of the discourse tends to be higher, so I see it as a net positive. This is also why, as the traffic continues to grow and the blog increasingly comes to the attention of various self-appointed activists, I’ll be cracking down harder and harder on the disruptive elements who will seek to interfere with the discourse here.</p><p>Disagreement is expected. Dissent is fine. Substantive criticism is both encouraged and appreciated. Mindless, reflexive ankle-biting is discouraged. Derailing is not permitted and trolls will be actively and aggressively pursued. Alles klar?</p><p>I’m also interested in opening up Alpha Game again to other regular contributors in 2014 as it was never intended as a single author blog. The initial batch of contributors all ran out of steam within the first month or two back in 2011, which is not terribly surprising, so this time I intend to take a different approach and begin by adding a single additional contributor who will focus on a particular aspect of Game. I want to add depth rather than breadth. This focus could be anything from Game in literature to Game and improving marital relations. However, if you’re not able to commit to four 500-word posts per week, please don’t even think of volunteering. Remember, I’ve been doing this for a while now and the fact is that the vast majority of people with the inchoate urge to write don’t really have all that much to say.</p></div>",
  "content_text": "It seems some other bloggers are beginning to get into the habit of being open with their traffic numbers; it’s nice to see people gradually getting over the idea that hiding this information from people will somehow inflate their perceived importance. Here are the Google pageviews for a few other bloggers, with the Global Alexa rank given in parentheses.\nWhatever: 7,519,279\nSteve Sailer\n: 6,635,426\nRational Male\n: 2,543,859\nBeing open with our traffic is a healthy exercise, I think, because it prevents us from getting too carried away with any exaggerated sense of our own importance. The numbers are a tiny drop in the bucket compared to mainstream media sites like Fox News and the New York Times, but remember, there was a time when those media outlets were once very small too. If anyone else has a site for which they’d like to share their Google pageviews, leave the data in the comments and I’ll add it here.\nIt strikes me as almost criminal that such an original thinker as Steve should have only 6.6 million pageviews per year when clueless wonders such as Malcolm Gladwell are bestselling authors, but\nas Steve himself notes\n,\n“The reality is that web searches bring a lot of people to individual\npostings I’ve written and then … it doesn’t make much impression on\nthem. They presumably stare blankly for awhile and then they’re on their\nway. I suspect that my combination of highbrow content without highbrow\naffectation is a turnoff for the vast majority of random visitors.”\nThey are the sort of people who gravitate to liberal blogs that invariably describe themselves as “thoughtful” while mindlessly repeating pablum straight out of the New York Times without ever evincing evidence of having had a single original thought of their own.\nI don’t appear to have Steve’s problem, as the admitted reluctance of many bloggers to link here means that most of my traffic consists of regular readers rather than web searches and fly-by-nighters. Of course, it also means that the level of engagement, the average visit duration, and the quality of the discourse tends to be higher, so I see it as a net positive. This is also why, as the traffic continues to grow and the blog increasingly comes to the attention of various self-appointed activists, I’ll be cracking down harder and harder on the disruptive elements who will seek to interfere with the discourse here.\nDisagreement is expected. Dissent is fine. Substantive criticism is both encouraged and appreciated. Mindless, reflexive ankle-biting is discouraged. Derailing is not permitted and trolls will be actively and aggressively pursued. Alles klar?\nI’m also interested in opening up Alpha Game again to other regular contributors in 2014 as it was never intended as a single author blog. The initial batch of contributors all ran out of steam within the first month or two back in 2011, which is not terribly surprising, so this time I intend to take a different approach and begin by adding a single additional contributor who will focus on a particular aspect of Game. I want to add depth rather than breadth. This focus could be anything from Game in literature to Game and improving marital relations. However, if you’re not able to commit to four 500-word posts per week, please don’t even think of volunteering. Remember, I’ve been doing this for a while now and the fact is that the vast majority of people with the inchoate urge to write don’t really have all that much to say.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-04T11:26:00+00:00"
}