{
  "url": "https://voxday.net/2014/01/17/a-lesson-in-rhetoric-2/",
  "scraped_at": "2025-12-15T16:43:35.474340",
  "title": "A lesson in rhetoric",
  "date_display": "January 17, 2014",
  "date_iso": "2014-01-17T09:37:00+00:00",
  "date_from_url": "2014-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In reading the responses to the Anti-Apologetics, SimplyTimothy observed: <i>“Not stated, but now obvious, is that when you decide to bring the<br> rhetoric it is like bringing a swift  kick to the balls to the<br> arm-wrestling contest. I like how you light the fuse of  their ideas,<br> amplify them,  then hand it back to them like a ticking time-bomb – then<br> you offer them a lit cigarette. It is very civilized of you.” </br></br></br></br></i></p><p>When writing on such disputative matters, I always attempt to do so with a tea service and one pinky extended. Anyhow, as a few people, mostly Tango, appear to be confused on the difference between a rhetorical response and a dialectical response, (which is legitimately confusing since technically, a rhetorical response IS a dialectical response), I think a brief refresher is worthwhile.</p><p>Remember that rhetoric is not limited to the laws of logic. Aristotle wrote: “Rhetorical study, in its strict sense, is concerned with the modes of persuasion. Persuasion<br> is clearly a sort of demonstration, since we are most fully persuaded when we consider a thing to have been<br> demonstrated. The orator’s demonstration is an enthymeme, and this is, in general, the most effective of the modes of<br> persuasion. The enthymeme is a sort of syllogism, and the consideration of syllogisms of all kinds, without<br> distinction, is the business of dialectic, either of dialectic as a whole or of one of its branches. It follows<br> plainly, therefore, that he who is best able to see how and from what elements a syllogism is produced will also be<br> best skilled in the enthymeme, when he has further learnt what its subject-matter is and in what respects it differs<br> from the syllogism of strict logic.”</br></br></br></br></br></br></br></p><p>In other words, when using rhetoric, one has to know when to utilize strict logical syllogisms and when to depart from them. And this totally depends on the audience. For, as I have frequently quoted him before, Aristotle observes: “Before some audiences not even the possession<br> of the exactest knowledge will make it easy for what we say to produce conviction. For argument based on knowledge<br> implies instruction, and there are people whom one cannot instruct.”</br></br></p><p>In rhetoric, it is perfectly legitimate to engage in all manner of logical fallacies. This is exactly what Peter Boghossian’s Street Epistemologists are taught to do, which is why they advance various arguments that are not only mutually contradictory, but blatantly flawed from a strict logical perspective. They engage in bait-and-switches, false definitions, and appeals to everything from authority to their own incredulity.</p><p>Now, because they claim to be faithful devotees of Science and Reason, this is why using scientific consensus and strict logic against them can be useful. But it is not our only weapon; they are woefully unprepared to see any sophisticated rhetoric arrayed against them. As one can see from the specific defenses they are being taught to attack, they are only being prepared for the lowest and crudest levels of rhetoric.</p><p>The rhetoric I am teaching you, on the other hand, is a much more sophisticated and deeper approach. Suppose, for example, the Street Epistemologist were to take Tango’s approach, retreat to the dialectic, and point out the difference between Boggie’s construction (1) and my own (2):</p><p>1) No faith is needed to POSTULATE that the universe may have always<br> existed.<br> 2) No faith is needed to POSTULATE that the<br> universe always existed.</br></br></br></p><p><i>“Postulate (Subject One) versus Postulate (Subject One or Subject<br> Two). What you postulate is enclosed within the brackets, the subject of<br> the postulation. There is a world of difference when the subject allows<br> for alternatives compared to a straight out declaration with no choice.”</br></br></br></i></p><p>While it is true that the subjects postulated are modestly different, the differences are irrelevant and it is a huge mistake for the Street Epistemologist to try this line of retreat because it exposes an even bigger flaw in Boghossian’s attack. The fact is that no faith is needed to POSTULATE ANYTHING because a postulate is, by definition, “a defining”. A postulate, or a positing, is not a conclusion; it is the IF in the IF-THEN statement. The spearpoint of Anti-Apologetic #1 is nothing more than a statement of the obvious given rhetorical effect through specification.</p><p>So, it should be obvious that if one goes with a purely dialectical approach here, one gets no additional benefit from the perfectly analogous enthymeme. The postulates may be different, but the important thing to note is that <i>there is no difference between the legitimacy of one postulate and another</i>. Recall that the opponent is not going to be impressed with your dialectical precision; he has already shown that he is willing to say anything so long as it might be persuasive. But by responding in the rhetorical manner, with a slightly modified postulate, one gets the same benefit as well as the additional rhetorical benefit of the stronger statement and opening up the possibility of not one, but two effective new lines of attack if the Street Epistemologist is so foolish as to stubbornly attempt to salvage this particular attack by distinguishing between Postulate 1 and Postulate 2.</p><p>I’ve already pointed out the one line of attack that a retreat to a dialectical defense would expose the Street Epistemologist. See if you can correctly identify the second, and even more effective one, it also exposes.</p></div>",
  "content_text": "In reading the responses to the Anti-Apologetics, SimplyTimothy observed:\n“Not stated, but now obvious, is that when you decide to bring the\nrhetoric it is like bringing a swift  kick to the balls to the\narm-wrestling contest. I like how you light the fuse of  their ideas,\namplify them,  then hand it back to them like a ticking time-bomb – then\nyou offer them a lit cigarette. It is very civilized of you.”\nWhen writing on such disputative matters, I always attempt to do so with a tea service and one pinky extended. Anyhow, as a few people, mostly Tango, appear to be confused on the difference between a rhetorical response and a dialectical response, (which is legitimately confusing since technically, a rhetorical response IS a dialectical response), I think a brief refresher is worthwhile.\nRemember that rhetoric is not limited to the laws of logic. Aristotle wrote: “Rhetorical study, in its strict sense, is concerned with the modes of persuasion. Persuasion\nis clearly a sort of demonstration, since we are most fully persuaded when we consider a thing to have been\ndemonstrated. The orator’s demonstration is an enthymeme, and this is, in general, the most effective of the modes of\npersuasion. The enthymeme is a sort of syllogism, and the consideration of syllogisms of all kinds, without\ndistinction, is the business of dialectic, either of dialectic as a whole or of one of its branches. It follows\nplainly, therefore, that he who is best able to see how and from what elements a syllogism is produced will also be\nbest skilled in the enthymeme, when he has further learnt what its subject-matter is and in what respects it differs\nfrom the syllogism of strict logic.”\nIn other words, when using rhetoric, one has to know when to utilize strict logical syllogisms and when to depart from them. And this totally depends on the audience. For, as I have frequently quoted him before, Aristotle observes: “Before some audiences not even the possession\nof the exactest knowledge will make it easy for what we say to produce conviction. For argument based on knowledge\nimplies instruction, and there are people whom one cannot instruct.”\nIn rhetoric, it is perfectly legitimate to engage in all manner of logical fallacies. This is exactly what Peter Boghossian’s Street Epistemologists are taught to do, which is why they advance various arguments that are not only mutually contradictory, but blatantly flawed from a strict logical perspective. They engage in bait-and-switches, false definitions, and appeals to everything from authority to their own incredulity.\nNow, because they claim to be faithful devotees of Science and Reason, this is why using scientific consensus and strict logic against them can be useful. But it is not our only weapon; they are woefully unprepared to see any sophisticated rhetoric arrayed against them. As one can see from the specific defenses they are being taught to attack, they are only being prepared for the lowest and crudest levels of rhetoric.\nThe rhetoric I am teaching you, on the other hand, is a much more sophisticated and deeper approach. Suppose, for example, the Street Epistemologist were to take Tango’s approach, retreat to the dialectic, and point out the difference between Boggie’s construction (1) and my own (2):\n1) No faith is needed to POSTULATE that the universe may have always\nexisted.\n2) No faith is needed to POSTULATE that the\nuniverse always existed.\n“Postulate (Subject One) versus Postulate (Subject One or Subject\nTwo). What you postulate is enclosed within the brackets, the subject of\nthe postulation. There is a world of difference when the subject allows\nfor alternatives compared to a straight out declaration with no choice.”\nWhile it is true that the subjects postulated are modestly different, the differences are irrelevant and it is a huge mistake for the Street Epistemologist to try this line of retreat because it exposes an even bigger flaw in Boghossian’s attack. The fact is that no faith is needed to POSTULATE ANYTHING because a postulate is, by definition, “a defining”. A postulate, or a positing, is not a conclusion; it is the IF in the IF-THEN statement. The spearpoint of Anti-Apologetic #1 is nothing more than a statement of the obvious given rhetorical effect through specification.\nSo, it should be obvious that if one goes with a purely dialectical approach here, one gets no additional benefit from the perfectly analogous enthymeme. The postulates may be different, but the important thing to note is that\nthere is no difference between the legitimacy of one postulate and another\n. Recall that the opponent is not going to be impressed with your dialectical precision; he has already shown that he is willing to say anything so long as it might be persuasive. But by responding in the rhetorical manner, with a slightly modified postulate, one gets the same benefit as well as the additional rhetorical benefit of the stronger statement and opening up the possibility of not one, but two effective new lines of attack if the Street Epistemologist is so foolish as to stubbornly attempt to salvage this particular attack by distinguishing between Postulate 1 and Postulate 2.\nI’ve already pointed out the one line of attack that a retreat to a dialectical defense would expose the Street Epistemologist. See if you can correctly identify the second, and even more effective one, it also exposes.",
  "tags": [
    "debate",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-17T09:37:00+00:00"
}