{
  "url": "https://voxday.net/2014/01/24/a-plague-of-fake-reviews_24/",
  "scraped_at": "2025-12-15T16:44:23.233522",
  "title": "A plague of fake reviews",
  "date_display": "January 24, 2014",
  "date_iso": "2014-01-24T21:30:00+00:00",
  "date_from_url": "2014-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not just <a href=\"http://www.dailymail.co.uk/sciencetech/article-2545336/Dont-trust-online-reviews-A-fifth-left-people-NEVER-tried-product.html\">Amazon and the political trolls</a>:</p><blockquote class=\"tr_bq\"><p> Sites<br> such as Amazon, TripAdvisor and Yelp are now the go-to destinations for<br> customers who want to cut through advertising waffle and discover what<br> products and services are really like. Yet, according to research that<br> is sure to panic business owners across the world, a fifth of Americans<br> have left online reviews for items they’ve never bought or even used. <br> This figure is even higher (32 per cent) among parents with children<br> under 18 and the most popular reason why online shoppers questioned did<br> this was simply because ‘they felt like it.’</br></br></br></br></br></br></br></br></p></blockquote><p>I think<br> “panic” is too strong a word. But I do think the online retailers need<br> to do a much better job of eliminating fake reviews and providing<br> meaningful rating systems than they do.</br></br></br></p><p>Although the<br> inaccurate headline is misleading. A fifth of all online reviews are not<br> fake. A fifth of Americans have, at some point, left a fake review.</br></br></p></div>",
  "content_text": "It’s not just\nAmazon and the political trolls\n:\nSites\nsuch as Amazon, TripAdvisor and Yelp are now the go-to destinations for\ncustomers who want to cut through advertising waffle and discover what\nproducts and services are really like. Yet, according to research that\nis sure to panic business owners across the world, a fifth of Americans\nhave left online reviews for items they’ve never bought or even used.\nThis figure is even higher (32 per cent) among parents with children\nunder 18 and the most popular reason why online shoppers questioned did\nthis was simply because ‘they felt like it.’\nI think\n“panic” is too strong a word. But I do think the online retailers need\nto do a much better job of eliminating fake reviews and providing\nmeaningful rating systems than they do.\nAlthough the\ninaccurate headline is misleading. A fifth of all online reviews are not\nfake. A fifth of Americans have, at some point, left a fake review.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-24T21:30:00+00:00"
}