{
  "url": "https://voxday.net/2014/01/04/an-idea-so-dumb-even-florio-doesn/",
  "scraped_at": "2025-12-15T16:42:11.216847",
  "title": "An idea so dumb even Florio doesn’t support it",
  "date_display": "January 4, 2014",
  "date_iso": "2014-01-04T14:00:00+00:00",
  "date_from_url": "2014-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jerry Jones <a href=\"http://profootballtalk.nbcsports.com/2014/01/03/jerry-jones-favors-expanding-the-playoffs/\">wants to turn the NFL into the NBA</a>. Why not, when Roger Goodell appears to be intent on turning it into the WNBA?</p><blockquote class=\"tr_bq\"><p> If Cowboys owner Jerry Jones had his way, more than 12 teams would be in the postseason right now. Jones was asked on 105.3 The Fan (<a href=\"http://espn.go.com/dallas/nfl/story/_/id/10237964/jerry-jones-dallas-cowboys-favor-expanding-nfl-playoffs\">via ESPN.com</a>)<br> whether he would support expanding the playoffs from six teams per<br> conference to eight teams per conference, and he said he likes that idea<br> because it would allow more teams to enter the playoffs and give more<br> fan bases a reason to get excited about the NFL in January.</br></br></br></br></p></blockquote><p>This is so mind-bogglingly stupid. I don’t know if Jerry is a liberal or not, but his reasoning certainly is. Liberals are binary thinkers who believe everything is static, and that the situation will remain the same except for whatever changes they introduce to it. They don’t deal well with complexity and they don’t understand that the act of introducing those changes intrinsically changes the previous situation.</p><p>Jones assumes that because twelve fan bases are (supposedly) excited about their team making the playoffs, increasing the number of fan bases to sixteen will increase the overall excitement. But that isn’t true, because increasing the percentage of teams that make the playoffs from 37.5% to 50 percent will reduce the perceived value of making the playoffs.</p><p>In fact, it’s been obvious to me that the value of the playoffs has already been watered down, as no one really starts to think their team has a chance to make the Super Bowl until the divisional round of the playoffs anyhow. The difficulty teams are having in selling out their tickets to the wild card round can’t be entirely blamed on this, as I suspect the economy and the New NFL rules are at least partly responsible. Regardless, the fact that three of four home teams are already having a tough time selling tickets with four games this weekend only underlines the idiocy of the idea of further expanding the playoffs.</p><p>The fans obviously realize how bad the idea is. In the PFT poll with 16,398 voters, 75 percent are against it.</p></div>",
  "content_text": "Jerry Jones\nwants to turn the NFL into the NBA\n. Why not, when Roger Goodell appears to be intent on turning it into the WNBA?\nIf Cowboys owner Jerry Jones had his way, more than 12 teams would be in the postseason right now. Jones was asked on 105.3 The Fan (\nvia ESPN.com\n)\nwhether he would support expanding the playoffs from six teams per\nconference to eight teams per conference, and he said he likes that idea\nbecause it would allow more teams to enter the playoffs and give more\nfan bases a reason to get excited about the NFL in January.\nThis is so mind-bogglingly stupid. I don’t know if Jerry is a liberal or not, but his reasoning certainly is. Liberals are binary thinkers who believe everything is static, and that the situation will remain the same except for whatever changes they introduce to it. They don’t deal well with complexity and they don’t understand that the act of introducing those changes intrinsically changes the previous situation.\nJones assumes that because twelve fan bases are (supposedly) excited about their team making the playoffs, increasing the number of fan bases to sixteen will increase the overall excitement. But that isn’t true, because increasing the percentage of teams that make the playoffs from 37.5% to 50 percent will reduce the perceived value of making the playoffs.\nIn fact, it’s been obvious to me that the value of the playoffs has already been watered down, as no one really starts to think their team has a chance to make the Super Bowl until the divisional round of the playoffs anyhow. The difficulty teams are having in selling out their tickets to the wild card round can’t be entirely blamed on this, as I suspect the economy and the New NFL rules are at least partly responsible. Regardless, the fact that three of four home teams are already having a tough time selling tickets with four games this weekend only underlines the idiocy of the idea of further expanding the playoffs.\nThe fans obviously realize how bad the idea is. In the PFT poll with 16,398 voters, 75 percent are against it.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-04T14:00:00+00:00"
}