{
  "url": "https://voxday.net/2014/01/17/bomb-makers-in-minneapolis/",
  "scraped_at": "2025-12-15T16:43:37.332969",
  "title": "Bomb-makers in Minneapolis",
  "date_display": "January 17, 2014",
  "date_iso": "2014-01-17T14:00:00+00:00",
  "date_from_url": "2014-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What used to be known as the Ghettos in the Sky are now the center of Mogadishu on the Mississippi. And the Somali population in Minneapolis has already contributed suicide bombers to Al-Shabab in Somalia as well as mall attackers to the same group in Kenya. So, <a href=\"http://gatesofvienna.net/2014/01/a-fiery-dawn-in-minneapolis/\">the mysterious recent explosion</a> in the heart of Somali Minneapolis should be a matter of more than a little concern to Minnesotans, as it indicates that the Somalis are likely to bring their jihad to the Mall of America or some other local target sooner or later.</p><blockquote class=\"tr_bq\"><p> A big explosion occurs next door to a mosque that has an unabashed<br> affection for the Muslim Brotherhood, in a Somali neighborhood where<br> terrorists are known to hang out — what could possibly be amiss with<br> that? Nothing, except possibly an Islamophobic hate crime, according to CAIR.</br></br></br></p><p>Zuhur Ahmed, a board member of the Minnesota chapter of<br> the Council on American-Islamic Relations, said the group was monitoring<br> the situation closely. “So far we don’t have any details,” she said. “But whenever there’s<br> an explosion, fire or anything of that sort by a mosque, there’s a<br> little bit of concern if the motive is a hate crime. We’re just<br> concerned and watching out for that.”</br></br></br></br></br></p><p>But then, CAIR always believes that the best defense is a good offense. If it were a gas explosion, the normal process would be for gas to<br> accumulate inside the building until a chance ignition detonated it.<br> Under those circumstances, the walls of the building would be blown<br> outwards, causing a sudden, catastrophic collapse of the structure and<br> filling the street and surrounding lots with bricks and rubble.</br></br></br></br></p><p>Nothing of the sort occurred. The earliest photos show an intense and<br> rapidly-spreading fire that looks like it originated on the second<br> floor, immediately above the grocery. This would be consistent with the<br> unexpected detonation of an explosive substance — say, ammonium nitrate,<br> just to pick a random example — which then distributed very flammable<br> material within an enclosed space, creating a flash-fire.</br></br></br></br></br></p></blockquote><p>The explosion was subsequently blamed on a gas leak, which is interesting because <a href=\"http://gatesofvienna.net/2014/01/what-the-police-and-the-gas-company-really-said/\">the Star Tribune has been caught lying</a> about its conversation with the gas company responsible.</p><blockquote class=\"tr_bq\"><p> I contacted CenterPoint and spoke with Rebecca Virden. I’m glad I did<br> because as you’ll see in a moment, there’s some very bad reporting<br> going on with this story.</br></br></p><p>“Our distribution system after we checked it — which runs<br> up to the meter, which is the distribution system’s responsibility, to<br> the meter — has no leak on it at all. We tested that system and it holds<br> its test. We even took it apart and tested it to make sure because it<br> had no leakage. It’s fully sound. As for our system, we had no leakage, no leak history, no leak calls<br> into our call centers prior to the incident before, during or after.”</br></br></br></br></br></p></blockquote><p>Throw in the fact that Homeland Security was spotted on the scene and it points to the probability that the police and media are covering up the explosion of a Somali bomb-making factory in Minneapolis.</p></div>",
  "content_text": "What used to be known as the Ghettos in the Sky are now the center of Mogadishu on the Mississippi. And the Somali population in Minneapolis has already contributed suicide bombers to Al-Shabab in Somalia as well as mall attackers to the same group in Kenya. So,\nthe mysterious recent explosion\nin the heart of Somali Minneapolis should be a matter of more than a little concern to Minnesotans, as it indicates that the Somalis are likely to bring their jihad to the Mall of America or some other local target sooner or later.\nA big explosion occurs next door to a mosque that has an unabashed\naffection for the Muslim Brotherhood, in a Somali neighborhood where\nterrorists are known to hang out — what could possibly be amiss with\nthat? Nothing, except possibly an Islamophobic hate crime, according to CAIR.\nZuhur Ahmed, a board member of the Minnesota chapter of\nthe Council on American-Islamic Relations, said the group was monitoring\nthe situation closely. “So far we don’t have any details,” she said. “But whenever there’s\nan explosion, fire or anything of that sort by a mosque, there’s a\nlittle bit of concern if the motive is a hate crime. We’re just\nconcerned and watching out for that.”\nBut then, CAIR always believes that the best defense is a good offense. If it were a gas explosion, the normal process would be for gas to\naccumulate inside the building until a chance ignition detonated it.\nUnder those circumstances, the walls of the building would be blown\noutwards, causing a sudden, catastrophic collapse of the structure and\nfilling the street and surrounding lots with bricks and rubble.\nNothing of the sort occurred. The earliest photos show an intense and\nrapidly-spreading fire that looks like it originated on the second\nfloor, immediately above the grocery. This would be consistent with the\nunexpected detonation of an explosive substance — say, ammonium nitrate,\njust to pick a random example — which then distributed very flammable\nmaterial within an enclosed space, creating a flash-fire.\nThe explosion was subsequently blamed on a gas leak, which is interesting because\nthe Star Tribune has been caught lying\nabout its conversation with the gas company responsible.\nI contacted CenterPoint and spoke with Rebecca Virden. I’m glad I did\nbecause as you’ll see in a moment, there’s some very bad reporting\ngoing on with this story.\n“Our distribution system after we checked it — which runs\nup to the meter, which is the distribution system’s responsibility, to\nthe meter — has no leak on it at all. We tested that system and it holds\nits test. We even took it apart and tested it to make sure because it\nhad no leakage. It’s fully sound. As for our system, we had no leakage, no leak history, no leak calls\ninto our call centers prior to the incident before, during or after.”\nThrow in the fact that Homeland Security was spotted on the scene and it points to the probability that the police and media are covering up the explosion of a Somali bomb-making factory in Minneapolis.",
  "tags": [
    "media",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-17T14:00:00+00:00"
}