{
  "url": "https://voxday.net/2014/01/31/book-review-escape-from-tekmar-ii/",
  "scraped_at": "2025-12-15T16:44:58.234647",
  "title": "Book Review: Escape from Tekmar II",
  "date_display": "January 31, 2014",
  "date_iso": "2014-01-31T09:25:00+00:00",
  "date_from_url": "2014-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Jill reviewed Kiti Lappi’s <a href=\"http://www.amazon.com/Escape-Tekmar-Kiti-Lappi-ebook/dp/B00GV4YO2O\">Escape from Tekmar</a>:</i></p><div style=\"margin-bottom: 0in;\"> I’m technically a bi-lingual person.<br> However, I would never have the confidence to pull off a book-length<br> manuscript in my second language. For that reason, I applaud Kiti<br> Lappi, the author of Escape From Tekmar, whose native language is<br> Finnish. She rose to a challenge and actually met that challenge.<br> Undoubtedly, she improved her skills in English by doing so. That<br> being said, while her book is readable in English, the level of<br> readability is extraordinarily low. The sentences are wordy and<br> awkward, and she often uses words improperly. For example, she<br> repeatedly confuses “commend” and “recommend”. While these<br> words are similar, they have subtle distinctions in usage. In<br> addition, there are many unclear run-on sentences, and I’m not sure<br> if this is owing to her limited knowledge of English, or simple bad<br> editing. Completing a cohesive thought in sentence-form is a matter<br> of logic, as far as I’m concerned.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Despite all that, the manuscript is<br> not<br> irredeemable. I would highly recommend (that is, advocate) that<br> she<br> pull this book off the market and choose one of two options: hire<br> a<br> native English speaker to help her with language edits; or write<br> the<br> book in Finnish and hire an English translator. Left as is, the<br> author risks giving herself an unnecessarily bad reputation as a<br> self-publisher of junk, which is a shame.</br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> And to be fair, the story isn’t junk.<br> The elements of a well-told story are there, albeit lost in the<br> awkward language. The plot, itself, is a simple sci-fi adventure<br> story about the space travelers, Rahan and Ryn, who find<br> themselves<br> unwittingly involved in another world’s revolution. The author<br> uses<br> many sci-fi tropes to give the basic plot color: genetic<br> modification, space travel, invasive spy technology that is too<br> expansive for upkeep, etc. Some of it is quite interesting and<br> imaginative, such as the “silver” that repairs the<br> genetically-engineered Shemasharras and gives them their<br> distinctive<br> silver eye color.</br></br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> The characterization is decent,<br> especially when the author depicts the relationship between Rahan<br> and<br> Ryn. Their relationship shines through enough that I’m not left<br> reeling when the author reveals their true relationship near the<br> end<br> of the book. Although the female protagonist, Lida, isn’t as<br> fleshed<br> out, I find it believable that she, as an idealist, has become<br> embroiled in a revolution that isn’t about the good of the people.<br> On<br> the other hand, I never get much sense of Ryn’s character, except<br> that he feels duty bound to always protect Rahan. Ryn is a<br> genetically-engineered human, yet he fills the ubiquitous sci-fi<br> role<br> of the almost-human robot. Sadly, there are many sci-fi robots out<br> there with more personality than the genetically-engineered Ryn.<br> Ryn<br> is too good, too intelligent, too strong to be entirely relatable.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> Along the same lines, the main<br> character, Rahan, has a strong character arc, from childish<br> dependency on Ryn’s saving him from disaster (as shown in the<br> first<br> scene), to fighting his own battles and becoming the rescuer of<br> Ryn.<br> Likewise, the main female character, Lida, also transforms<br> throughout<br> the story, beginning with reluctant compliance and ending with<br> defiance. Ryn, as befitting his flat character, doesn’t change<br> much;<br/> however, the author allows him to be possessing of weaknesses, as<br/> he<br/> is able to be captured at a crucial moment.</br></br></br></br></br></br></br></br></br></br></div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> The scene-setting is also quite well<br/> done for an author who has a limited vocabulary in English. I’ve<br/> read<br/> that there are literally no cognates between Finnish and English,<br/> which further gives me admiration for the author’s skills. That’s<br/> obviously beside the point, as I get a general sense of a planet<br/> that<br/> had one time been decked-out with better technology, but has<br/> devolved<br/> into an economic and social decline. The scene-setting works, even<br/> if<br/> it’s not extensive. For the record, I prefer books with extensive<br/> scene descriptions, almost to the point of travelogue, but I<br/> certainly don’t expect that from modern authors.</div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> If I have any banal writer-workshop<br/> type recommendations for the authors, they are these: she needs to<br/> learn how to write without giving info dumps. Info must be told in<br/> order to ground the reader, but it needs to be accomplished a<br/> little<br/> at a time through the scene itself (showing vs telling), or<br/> through<br/> natural dialogue, or through SHORT pieces of exposition. I don’t<br/> really give a shit about the absurd convention of excessive<br/> showing<br/> in fiction—the pretense that fiction should be written as though<br/> it<br/> were a film—but the author needs to work on her art of subtlety.<br/> Storytelling is an art, in which scene and exposition are woven<br/> smoothly together, and the author needs to work on this.</div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> As an<br/> extension of show-vs-tell, the facts the author presents in the<br/> story<br/> often don’t sound planned. I found myself wondering if the author<br/> made things up as she went along. For example, Rahan will suddenly<br/> be<br/> possessing of useful items in his backpack, when he had a moment<br/> before been deficient in useful items, which left me thinking,<br/> “How<br/> convenient for him!” This credulity could easily have been avoided<br/> if the character had been shown finding whatever-useful-item in<br/> real<br/> scene time.</div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> As a last word, the beginning scene is<br/> necessary, and a great way to demonstrate the relationship of<br/> Rahan<br/> and Ryn, but it’s too long. The author spends an inordinate amount<br/> of<br/> time describing a world that the characters are just passing<br/> through<br/> before landing on the planet where they will spend the next 250 or<br/> so<br/> pages.</div><div style=\"margin-bottom: 0in;\"></div><div style=\"margin-bottom: 0in;\"> To reiterate, Escape From Tekmar has<br/> merit. It’s a story that would be worth more of the author’s time<br/> and<br/> attention, as well as the money it would cost for an<br/> English-speaking<br/> editor to clean it up. As it is, though, I can’t rate it well. In<br/> fact, I would probably give it 1 or 2 stars out of 5 due to the<br/> sheer<br/> difficulty in reading the language.</div></div>",
  "content_text": "Jill reviewed Kiti Lappi’s\nEscape from Tekmar\n:\nI’m technically a bi-lingual person.\nHowever, I would never have the confidence to pull off a book-length\nmanuscript in my second language. For that reason, I applaud Kiti\nLappi, the author of Escape From Tekmar, whose native language is\nFinnish. She rose to a challenge and actually met that challenge.\nUndoubtedly, she improved her skills in English by doing so. That\nbeing said, while her book is readable in English, the level of\nreadability is extraordinarily low. The sentences are wordy and\nawkward, and she often uses words improperly. For example, she\nrepeatedly confuses “commend” and “recommend”. While these\nwords are similar, they have subtle distinctions in usage. In\naddition, there are many unclear run-on sentences, and I’m not sure\nif this is owing to her limited knowledge of English, or simple bad\nediting. Completing a cohesive thought in sentence-form is a matter\nof logic, as far as I’m concerned.\nDespite all that, the manuscript is\nnot\nirredeemable. I would highly recommend (that is, advocate) that\nshe\npull this book off the market and choose one of two options: hire\na\nnative English speaker to help her with language edits; or write\nthe\nbook in Finnish and hire an English translator. Left as is, the\nauthor risks giving herself an unnecessarily bad reputation as a\nself-publisher of junk, which is a shame.\nAnd to be fair, the story isn’t junk.\nThe elements of a well-told story are there, albeit lost in the\nawkward language. The plot, itself, is a simple sci-fi adventure\nstory about the space travelers, Rahan and Ryn, who find\nthemselves\nunwittingly involved in another world’s revolution. The author\nuses\nmany sci-fi tropes to give the basic plot color: genetic\nmodification, space travel, invasive spy technology that is too\nexpansive for upkeep, etc. Some of it is quite interesting and\nimaginative, such as the “silver” that repairs the\ngenetically-engineered Shemasharras and gives them their\ndistinctive\nsilver eye color.\nThe characterization is decent,\nespecially when the author depicts the relationship between Rahan\nand\nRyn. Their relationship shines through enough that I’m not left\nreeling when the author reveals their true relationship near the\nend\nof the book. Although the female protagonist, Lida, isn’t as\nfleshed\nout, I find it believable that she, as an idealist, has become\nembroiled in a revolution that isn’t about the good of the people.\nOn\nthe other hand, I never get much sense of Ryn’s character, except\nthat he feels duty bound to always protect Rahan. Ryn is a\ngenetically-engineered human, yet he fills the ubiquitous sci-fi\nrole\nof the almost-human robot. Sadly, there are many sci-fi robots out\nthere with more personality than the genetically-engineered Ryn.\nRyn\nis too good, too intelligent, too strong to be entirely relatable.\nAlong the same lines, the main\ncharacter, Rahan, has a strong character arc, from childish\ndependency on Ryn’s saving him from disaster (as shown in the\nfirst\nscene), to fighting his own battles and becoming the rescuer of\nRyn.\nLikewise, the main female character, Lida, also transforms\nthroughout\nthe story, beginning with reluctant compliance and ending with\ndefiance. Ryn, as befitting his flat character, doesn’t change\nmuch;\nhowever, the author allows him to be possessing of weaknesses, as\nhe\nis able to be captured at a crucial moment.\nThe scene-setting is also quite well\ndone for an author who has a limited vocabulary in English. I’ve\nread\nthat there are literally no cognates between Finnish and English,\nwhich further gives me admiration for the author’s skills. That’s\nobviously beside the point, as I get a general sense of a planet\nthat\nhad one time been decked-out with better technology, but has\ndevolved\ninto an economic and social decline. The scene-setting works, even\nif\nit’s not extensive. For the record, I prefer books with extensive\nscene descriptions, almost to the point of travelogue, but I\ncertainly don’t expect that from modern authors.\nIf I have any banal writer-workshop\ntype recommendations for the authors, they are these: she needs to\nlearn how to write without giving info dumps. Info must be told in\norder to ground the reader, but it needs to be accomplished a\nlittle\nat a time through the scene itself (showing vs telling), or\nthrough\nnatural dialogue, or through SHORT pieces of exposition. I don’t\nreally give a shit about the absurd convention of excessive\nshowing\nin fiction—the pretense that fiction should be written as though\nit\nwere a film—but the author needs to work on her art of subtlety.\nStorytelling is an art, in which scene and exposition are woven\nsmoothly together, and the author needs to work on this.\nAs an\nextension of show-vs-tell, the facts the author presents in the\nstory\noften don’t sound planned. I found myself wondering if the author\nmade things up as she went along. For example, Rahan will suddenly\nbe\npossessing of useful items in his backpack, when he had a moment\nbefore been deficient in useful items, which left me thinking,\n“How\nconvenient for him!” This credulity could easily have been avoided\nif the character had been shown finding whatever-useful-item in\nreal\nscene time.\nAs a last word, the beginning scene is\nnecessary, and a great way to demonstrate the relationship of\nRahan\nand Ryn, but it’s too long. The author spends an inordinate amount\nof\ntime describing a world that the characters are just passing\nthrough\nbefore landing on the planet where they will spend the next 250 or\nso\npages.\nTo reiterate, Escape From Tekmar has\nmerit. It’s a story that would be worth more of the author’s time\nand\nattention, as well as the money it would cost for an\nEnglish-speaking\neditor to clean it up. As it is, though, I can’t rate it well. In\nfact, I would probably give it 1 or 2 stars out of 5 due to the\nsheer\ndifficulty in reading the language.",
  "tags": [
    "Lions Den"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-31T09:25:00+00:00"
}