{
  "url": "https://voxday.net/2014/01/27/china-two-stories/",
  "scraped_at": "2025-12-15T16:44:35.091521",
  "title": "China: two stories",
  "date_display": "January 27, 2014",
  "date_iso": "2014-01-27T09:51:00+00:00",
  "date_from_url": "2014-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, this Forbes report is NOT true: <i>“The People’s Bank of China , the central bank, has just ordered commercial banks to halt cash transfers.”</i> The <a href=\"http://www.zerohedge.com/news/2014-01-26/no-there-no-stoppage-cash-transfers-china\">false report </a>was particularly worrisome in light of the way it appeared to coincide with HSBC’s recent attempt to crack down on all withdrawals of more than 3,000 pounds in the UK. (HSBC appears to have backed down on that following widespread outrage.) However, that does not mean that all is well with the Chinese economy, which you will recall has been engaged in much bigger credit inflation and government spending stimulus programs since 2009 than the USA or the European governments. <a href=\"http://www.zerohedge.com/news/2014-01-16/chinese-stocks-tumble-contagion-concerns-first-shadow-banking-default\">From Zerohedge</a> two weeks ago:</p><blockquote class=\"tr_bq\"><p> the big problem in big China remains that of an out-of-control credit creation process that is blowing up. As we previously noted, instead of crushing credit creation, the PBOC’s liquidity rationing has forced distressed companies into high-interest-cost products in the shadow-banking world. Investors on the other side of “troubled shadow banking products” had assumed that ‘someone’ would bail them out but this evening Reuters reports that ICBC has confirmed that it will not rescue holders of the “Credit Equals Gold #1 Collective Trust Product”, due to mature Jan 31st with $492 million outstanding.</p></blockquote><p>A single $492 million default sounds very small compared to the overall size of the shadow banking market, but the problem is that what expands by the multiplication effect will contract even faster. There are many multiples of credit dollars stacked upon each actual dollar, so a default has a domino effect that is one or two orders of magnitude greater than the size of the default itself.</p><p>It’s probably not a coincidence that the banks appear to be a little nervous leading up to this default, because it’s not possible to know exactly what the effects of the Friday default will be. I expect next weekend will be a very busy one throughout the financial industry as the markets position for the fallout on Monday; I imagine the central banks’ printing presses will be smoking.</p></div>",
  "content_text": "First, this Forbes report is NOT true:\n“The People’s Bank of China , the central bank, has just ordered commercial banks to halt cash transfers.”\nThe\nfalse report\nwas particularly worrisome in light of the way it appeared to coincide with HSBC’s recent attempt to crack down on all withdrawals of more than 3,000 pounds in the UK. (HSBC appears to have backed down on that following widespread outrage.) However, that does not mean that all is well with the Chinese economy, which you will recall has been engaged in much bigger credit inflation and government spending stimulus programs since 2009 than the USA or the European governments.\nFrom Zerohedge\ntwo weeks ago:\nthe big problem in big China remains that of an out-of-control credit creation process that is blowing up. As we previously noted, instead of crushing credit creation, the PBOC’s liquidity rationing has forced distressed companies into high-interest-cost products in the shadow-banking world. Investors on the other side of “troubled shadow banking products” had assumed that ‘someone’ would bail them out but this evening Reuters reports that ICBC has confirmed that it will not rescue holders of the “Credit Equals Gold #1 Collective Trust Product”, due to mature Jan 31st with $492 million outstanding.\nA single $492 million default sounds very small compared to the overall size of the shadow banking market, but the problem is that what expands by the multiplication effect will contract even faster. There are many multiples of credit dollars stacked upon each actual dollar, so a default has a domino effect that is one or two orders of magnitude greater than the size of the default itself.\nIt’s probably not a coincidence that the banks appear to be a little nervous leading up to this default, because it’s not possible to know exactly what the effects of the Friday default will be. I expect next weekend will be a very busy one throughout the financial industry as the markets position for the fallout on Monday; I imagine the central banks’ printing presses will be smoking.",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-27T09:51:00+00:00"
}