{
  "url": "https://voxday.net/2014/01/21/dark-enlightenment-second-stage/",
  "scraped_at": "2025-12-15T16:44:04.498367",
  "title": "Dark Enlightenment: the second stage",
  "date_display": "January 21, 2014",
  "date_iso": "2014-01-21T18:00:00+00:00",
  "date_from_url": "2014-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We appear to have passed the “Ridicule” stage of the counterreaction to what some are calling “The Dark Enlightenment”. This is apparent because now, it’s not only our direct enemies on the godless equalitarian Left that are attacking us, but mealy-mouthed equalitarian Christian quislings are attempting to establish their credibility as Left-friendly moderates <a href=\"http://www.patheos.com/blogs/markshea/2014/01/whats-the-dark-enlightenment.html?utm_source=dlvr.it&amp;utm_medium=twitter\">by joining in on the fun</a>:</p><blockquote class=\"tr_bq\"><p> What’s the Dark Enlightenment? Basically, it’s a de-Christianized form of right wingery that is drinking deep of white supremacy and racialism. Sometimes, it appeals to something called “Western” Christianity, but this is basically a fig leaf for getting discernment-free conservatives to jettison actual Christian teaching in favor of nutty white supremacy by rhetoric about how Euro-superiority makes it plain that the whole “in Christ there is neither Jew nor Greek” race indifference is a huge mistake.</p><p>Other times, it daubs on a layer of pseudo-science by tossing around the phrase “human biodiversity” (by which they mean “some races are inferior to others”).</p><p>And not infrequently, some of its adherents ditch so much as the figleaf of Christianity (since Christianity really is irreconcilable with racism) and openly promotes bullshit “northern” neo-paganism as they get in touch with their inner Himmlers. Because everybody knows that the people who erected standing stones as their highest achievement were just about to usher in a golden age when they were rudely interrupted by brown ruffians named Augustine and St. Paul and Plato who tamed their manly Nordic creativity with their ethnically impure southern barbarism.</p></blockquote><p> Let’s count the errors:</p><ol><li>There is nothing de-Christianized about it. Several of the so-called “Sith Lords” of the movement, such as it is, are outspoken and uncompromising Christians.</li><li>It has nothing to do with white <i>supremacy </i>and everything to do with white <i>survival</i>. In fact, most of the HBDers would be better categorized as Asian supremacists.</li><li>There is no call to jettison any genuinely Christian teaching, but rather, the many anti-Biblical Churchian teachings that presently infect the Church.</li><li>It is true that “in Christ there is neither Jew nor Greek”. The key words there are “in Christ”. The Church is not the State. In the civil government of every political entity where non-Christians are permitted to reside, there most certainly are national, religious, and ethnic distinctions to be made.</li><li>There is nothing pseudo-scientific about human biodiversity. The only pseudo-science is on the part of the equalitarians and anti-racists, whose argument that human beings are all essentially the same has been conclusively destroyed by genetic science.</li><li>Christianity clearly encompasses the acknowledgement of differences between races and nations. See Matthew 10:5 and Matthew 15:21</li></ol><p>Shea wrongly sees the Dark Enlightenment as a threat to Christianity, failing to understand that it is the corrective for the disease of left-wing Churchianism.</p><blockquote class=\"tr_bq\"><p> At least one of my readers has a young, formerly Catholic, relative who is going for this vile crap in a big way (he now practices bullshit white supremacist paganism because Christianity adulterated European racial stock with its acceptance of all races as children of God) and it is apparently going viral in some College Republican circles (according to people who are writing me about it).</p></blockquote><p>The fact that young men are leaving the Church is not an indictment of the Dark Enlightenment. Indeed, we Christians who acknowledge its truths are the only ones who will be able to reach this young ex-Catholic and other young men who have left the Church because we are the only ones they will trust. We are the only ones who have not lied to them. Their leaving is an indictment of the deceitful Churchianism that has betrayed the young sheep who were in the fold, and who have fled it in reaction due to the non-stop lies they have observed, deceit of the sort that Shea is still perpetrating.</p><p>Jesus Christ is the Truth. And one cannot defend the truth with lies. John 15:4 states: <i>“</i><i>No branch can bear fruit by itself; it must remain in the vine. Neither can you bear fruit unless you remain in me.”</i> It is not hard to observe that every church, including the Roman Catholic Church, that has embraced equalitarianism, feminism, and anti-racism has almost immediately begun to die. But it appears the idea that anti-racism and desegregation is unbiblical and consequentially antithetical to Christianity may be as hard for some to bear as the idea that homosexuality and usury and fornication are for others.</p><p>And yet, fifty years of experience have rendered this conclusion all but inescapable. Show me a church that prides itself on its opposition to racism and I’ll show you a church that will soon embrace female pastors, unrepentant sinners, and declining attendance. That doesn’t mean that racism is a Christian virtue, it merely means that opposing racism is as legitimate a Christian policy as opposing chocolate or the Denver Broncos.</p><p>UPDATE: It looks like Irenist has a little confessing to do this weekend:</p><p><i>“Mr. Beale’s piece complains that the Church<br> embraces “anti-racism,” implying that he thinks the Church should be<br> pro-racist. As you might say: pretty lame.”</br></br></i> </p><p>He can lie and whine about the truths he finds uncomfortable all he likes. In the meantime, his Churchian organization will continue to die. Stick to the truth and you will never have to lie. Embrace a lie and you will soon find it difficult to speak the truth.</p></div>",
  "content_text": "We appear to have passed the “Ridicule” stage of the counterreaction to what some are calling “The Dark Enlightenment”. This is apparent because now, it’s not only our direct enemies on the godless equalitarian Left that are attacking us, but mealy-mouthed equalitarian Christian quislings are attempting to establish their credibility as Left-friendly moderates\nby joining in on the fun\n:\nWhat’s the Dark Enlightenment? Basically, it’s a de-Christianized form of right wingery that is drinking deep of white supremacy and racialism. Sometimes, it appeals to something called “Western” Christianity, but this is basically a fig leaf for getting discernment-free conservatives to jettison actual Christian teaching in favor of nutty white supremacy by rhetoric about how Euro-superiority makes it plain that the whole “in Christ there is neither Jew nor Greek” race indifference is a huge mistake.\nOther times, it daubs on a layer of pseudo-science by tossing around the phrase “human biodiversity” (by which they mean “some races are inferior to others”).\nAnd not infrequently, some of its adherents ditch so much as the figleaf of Christianity (since Christianity really is irreconcilable with racism) and openly promotes bullshit “northern” neo-paganism as they get in touch with their inner Himmlers. Because everybody knows that the people who erected standing stones as their highest achievement were just about to usher in a golden age when they were rudely interrupted by brown ruffians named Augustine and St. Paul and Plato who tamed their manly Nordic creativity with their ethnically impure southern barbarism.\nLet’s count the errors:\nThere is nothing de-Christianized about it. Several of the so-called “Sith Lords” of the movement, such as it is, are outspoken and uncompromising Christians.\nIt has nothing to do with white\nsupremacy\nand everything to do with white\nsurvival\n. In fact, most of the HBDers would be better categorized as Asian supremacists.\nThere is no call to jettison any genuinely Christian teaching, but rather, the many anti-Biblical Churchian teachings that presently infect the Church.\nIt is true that “in Christ there is neither Jew nor Greek”. The key words there are “in Christ”. The Church is not the State. In the civil government of every political entity where non-Christians are permitted to reside, there most certainly are national, religious, and ethnic distinctions to be made.\nThere is nothing pseudo-scientific about human biodiversity. The only pseudo-science is on the part of the equalitarians and anti-racists, whose argument that human beings are all essentially the same has been conclusively destroyed by genetic science.\nChristianity clearly encompasses the acknowledgement of differences between races and nations. See Matthew 10:5 and Matthew 15:21\nShea wrongly sees the Dark Enlightenment as a threat to Christianity, failing to understand that it is the corrective for the disease of left-wing Churchianism.\nAt least one of my readers has a young, formerly Catholic, relative who is going for this vile crap in a big way (he now practices bullshit white supremacist paganism because Christianity adulterated European racial stock with its acceptance of all races as children of God) and it is apparently going viral in some College Republican circles (according to people who are writing me about it).\nThe fact that young men are leaving the Church is not an indictment of the Dark Enlightenment. Indeed, we Christians who acknowledge its truths are the only ones who will be able to reach this young ex-Catholic and other young men who have left the Church because we are the only ones they will trust. We are the only ones who have not lied to them. Their leaving is an indictment of the deceitful Churchianism that has betrayed the young sheep who were in the fold, and who have fled it in reaction due to the non-stop lies they have observed, deceit of the sort that Shea is still perpetrating.\nJesus Christ is the Truth. And one cannot defend the truth with lies. John 15:4 states:\n“\nNo branch can bear fruit by itself; it must remain in the vine. Neither can you bear fruit unless you remain in me.”\nIt is not hard to observe that every church, including the Roman Catholic Church, that has embraced equalitarianism, feminism, and anti-racism has almost immediately begun to die. But it appears the idea that anti-racism and desegregation is unbiblical and consequentially antithetical to Christianity may be as hard for some to bear as the idea that homosexuality and usury and fornication are for others.\nAnd yet, fifty years of experience have rendered this conclusion all but inescapable. Show me a church that prides itself on its opposition to racism and I’ll show you a church that will soon embrace female pastors, unrepentant sinners, and declining attendance. That doesn’t mean that racism is a Christian virtue, it merely means that opposing racism is as legitimate a Christian policy as opposing chocolate or the Denver Broncos.\nUPDATE: It looks like Irenist has a little confessing to do this weekend:\n“Mr. Beale’s piece complains that the Church\nembraces “anti-racism,” implying that he thinks the Church should be\npro-racist. As you might say: pretty lame.”\nHe can lie and whine about the truths he finds uncomfortable all he likes. In the meantime, his Churchian organization will continue to die. Stick to the truth and you will never have to lie. Embrace a lie and you will soon find it difficult to speak the truth.",
  "tags": [
    "Christianity",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-21T18:00:00+00:00"
}