{
  "url": "https://voxday.net/2014/01/12/darth-vox/",
  "scraped_at": "2025-12-15T16:43:01.499793",
  "title": "Darth Vox",
  "date_display": "January 12, 2014",
  "date_iso": "2014-01-12T15:30:00+00:00",
  "date_from_url": "2014-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An amusing article on the creepy “<a href=\"http://www.vocativ.com/12-2013/dark-enlightenment-creepy-internet-movement-youd-better-take-seriously/?utm_campaign=dec6&amp;utm_medium=cpc&amp;utm_source=outbrain&amp;cid=dec6&amp;icid=outbrain&amp;ModPagespeed=noscript\">Sith Lords of the Dark Enlightenment</a>“:</p><blockquote class=\"tr_bq\"><p> Ladies and gentlemen, welcome to the Dark Enlightenment. The Empire is striking back. Much as Christianity grew out of the cult-sodden ferment of the Roman-occupied Middle East, the Dark Enlightenment has sprouted from the hyper-anxious anti-liberalism precincts in the darker recesses of the Internet.</p><p>So we’ve dug deep into the Web, where the movement lurks. We’ve talked online to its philosopher king, Nick Land, and we’ve conversed with his faceless adherents…. As the term suggests, the Dark Enlightenment is an ideological analysis<br> of modern democracy that harshly rejects the vision of the 18th century<br> European Enlightenment—a period punctuated by the development of<br> empirical science, the rise of humanist values and the first outburst of<br> revolutionary democratic reform. In contrast, the Dark Enlightenment<br> advocates an autocratic and neo-monarchical society. Its belief system<br> is unapologetically reactionary, almost feudal….</br></br></br></br></br></br></p><p>In the Dark Enlightenment, we seem to have stumbled across a place where<br> pseudo-intellectually grounded racism is flourishing in a way it hasn’t<br> since before World War II.</br></br></p></blockquote><p>I have to admit, I’m more than a little bemused to be informed that I am a faceless adherent of some guy whose name I’ve literally never seen before. It’s also a little odd to see myself listed under Christian Traditionalists rather than Economists or even Masculinity; I am certainly a Christian but I’m hardly a Christian Traditionalist in the Chestertonian style. I also enjoyed the term “pseudo-intellectually grounded racism”. This is Left-wing shorthand for the writer’s confession that the position is an intelligent and well-grounded one for which he have no rebuttal, but with which he disagrees anyhow.</p><p>One would think that he would at least stop long enough to consider why it is flourishing, but his analysis doesn’t run so deep. Setting aside the author’s fumbling attempts to make sense of what is developing and provide a nonexistent structure to it, this bit particularly amused me:</p><blockquote class=\"tr_bq\"><p> <b>Could the Dark Enlightenment become a major political movement?</b></p><p>Probably<br> not. To acquire momentum in the real world, the systems of modern<br> democratic capitalism would have to suffer a blow far more damaging than<br> any received so far.  </br></br></br></p></blockquote><p>And, as we all know, that is inconceivable, since we all know that history is nothing but the chronicle of the inexorable progress towards modern democratic capitalism and the unending bourgeois paradise it entails. Perhaps he might like to consider reading<i> The Return of the Great Depression</i>. We are already five years into Great Depression 2.0. The systems of modern democratic capitalism are already flashing red blinking signals and we are now merely awaiting the blow that will cause them to collapse. What it will be, no one claims to know, but it is coming, sooner or later.</p><p>And the article wouldn’t have been complete without the mandatory bit of nonsensical finger wagging: <i>“Universal equality and classical democracy are not synonymous with an<br> all-purpose, lowest-common-denominator leveling of mankind. Rather, they<br> speak only to an existential fairness in which each of us has the right<br> to value, direct and make meaning of our own lives.”</br></br></br></i></p><p>First, equality, universal or otherwise, doesn’t exist. This argomentum ad singulicornu is simply an irrelevant nonstarter. As for classical democracy, what does that have to do with the unelected European Commission, the unelected U.S. Supreme Court, the bifactional ruling party and the “first-past-the-post” parliamentary systems, all of which are meant to strictly limit democracy and forcibly prevent people from exercising their right to value, direct, and make meaning of their own lives.</p><p>But Mr. Sigl is right about in one thing. People would do well to take me and the other “Sith Lords” seriously. Because, as it happens, we are realistic and generally correct, on average, about the past and present states of Mankind.</p></div>",
  "content_text": "An amusing article on the creepy “\nSith Lords of the Dark Enlightenment\n“:\nLadies and gentlemen, welcome to the Dark Enlightenment. The Empire is striking back. Much as Christianity grew out of the cult-sodden ferment of the Roman-occupied Middle East, the Dark Enlightenment has sprouted from the hyper-anxious anti-liberalism precincts in the darker recesses of the Internet.\nSo we’ve dug deep into the Web, where the movement lurks. We’ve talked online to its philosopher king, Nick Land, and we’ve conversed with his faceless adherents…. As the term suggests, the Dark Enlightenment is an ideological analysis\nof modern democracy that harshly rejects the vision of the 18th century\nEuropean Enlightenment—a period punctuated by the development of\nempirical science, the rise of humanist values and the first outburst of\nrevolutionary democratic reform. In contrast, the Dark Enlightenment\nadvocates an autocratic and neo-monarchical society. Its belief system\nis unapologetically reactionary, almost feudal….\nIn the Dark Enlightenment, we seem to have stumbled across a place where\npseudo-intellectually grounded racism is flourishing in a way it hasn’t\nsince before World War II.\nI have to admit, I’m more than a little bemused to be informed that I am a faceless adherent of some guy whose name I’ve literally never seen before. It’s also a little odd to see myself listed under Christian Traditionalists rather than Economists or even Masculinity; I am certainly a Christian but I’m hardly a Christian Traditionalist in the Chestertonian style. I also enjoyed the term “pseudo-intellectually grounded racism”. This is Left-wing shorthand for the writer’s confession that the position is an intelligent and well-grounded one for which he have no rebuttal, but with which he disagrees anyhow.\nOne would think that he would at least stop long enough to consider why it is flourishing, but his analysis doesn’t run so deep. Setting aside the author’s fumbling attempts to make sense of what is developing and provide a nonexistent structure to it, this bit particularly amused me:\nCould the Dark Enlightenment become a major political movement?\nProbably\nnot. To acquire momentum in the real world, the systems of modern\ndemocratic capitalism would have to suffer a blow far more damaging than\nany received so far.\nAnd, as we all know, that is inconceivable, since we all know that history is nothing but the chronicle of the inexorable progress towards modern democratic capitalism and the unending bourgeois paradise it entails. Perhaps he might like to consider reading\nThe Return of the Great Depression\n. We are already five years into Great Depression 2.0. The systems of modern democratic capitalism are already flashing red blinking signals and we are now merely awaiting the blow that will cause them to collapse. What it will be, no one claims to know, but it is coming, sooner or later.\nAnd the article wouldn’t have been complete without the mandatory bit of nonsensical finger wagging:\n“Universal equality and classical democracy are not synonymous with an\nall-purpose, lowest-common-denominator leveling of mankind. Rather, they\nspeak only to an existential fairness in which each of us has the right\nto value, direct and make meaning of our own lives.”\nFirst, equality, universal or otherwise, doesn’t exist. This argomentum ad singulicornu is simply an irrelevant nonstarter. As for classical democracy, what does that have to do with the unelected European Commission, the unelected U.S. Supreme Court, the bifactional ruling party and the “first-past-the-post” parliamentary systems, all of which are meant to strictly limit democracy and forcibly prevent people from exercising their right to value, direct, and make meaning of their own lives.\nBut Mr. Sigl is right about in one thing. People would do well to take me and the other “Sith Lords” seriously. Because, as it happens, we are realistic and generally correct, on average, about the past and present states of Mankind.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-12T15:30:00+00:00"
}