{
  "url": "https://voxday.net/2014/01/28/democracy-in-middle-eas/",
  "scraped_at": "2025-12-15T16:44:43.847739",
  "title": "Democracy in the Middle East",
  "date_display": "January 28, 2014",
  "date_iso": "2014-01-28T14:00:00+00:00",
  "date_from_url": "2014-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>New York Times neocons<a href=\"http://www.nytimes.com/2014/01/28/opinion/cohen-the-egyptian-disaster.html?hp&amp;rref=opinion\"> never, ever, learn</a> from their past disasters:</p><blockquote class=\"tr_bq\"><p> David Kirkpatrick, my colleague in Cairo, said it all in <a href=\"http://www.nytimes.com/2014/01/26/world/middleeast/egypt.html\">this brilliant, depressing lead</a>:<br> “Thousands of Egyptians celebrated the third anniversary of their<br> revolt against autocracy on Saturday by holding a rally for the military<br> leader who ousted the country’s first democratically elected<br> president.”</br></br></br></br></p><p>…</p><p>There is plenty of blame to go around — for Obama, for the hapless<br> Morsi, for the paranoid power-grabbing Muslim Brotherhood, for the<br> controlling military. But above all I blame the squabbling Egyptian<br> liberals who fought for Mubarak’s ouster but did not give democracy a<br> chance.</br></br></br></br></p></blockquote><p>Did not give democracy a chance? The Muslim Brotherhood was democracy in action. Some of you will recall the way in which I dismissed the so-called Arab Spring; there were no shortage of the usual suspects attempting to claim that I was wrong, that all the experts were right about the miraculous democratic transformation of the Middle East.</p><p>As a general rule, unless one is dealing with technology, it is very seldom different. This is as true of politics as it is of economics. Democracy in the Middle East means Islamic rule, just as the importation of barbarians and savages into the USA means that they will henceforth serve as the deciding factor in government so long as some vestiges of democracy survive in the declining West.</p><p>The huge mistake of the immigration enthusiasts was to fail to realize that immigration and democracy are no more compatible than Islam and democracy. Celler, Hart, and Kennedy claimed that Americans could open their borders to the world and keep their nation, but they no more told the truth than Obama did when he told Americans they could keep their doctor.</p></div>",
  "content_text": "New York Times neocons\nnever, ever, learn\nfrom their past disasters:\nDavid Kirkpatrick, my colleague in Cairo, said it all in\nthis brilliant, depressing lead\n:\n“Thousands of Egyptians celebrated the third anniversary of their\nrevolt against autocracy on Saturday by holding a rally for the military\nleader who ousted the country’s first democratically elected\npresident.”\n…\nThere is plenty of blame to go around — for Obama, for the hapless\nMorsi, for the paranoid power-grabbing Muslim Brotherhood, for the\ncontrolling military. But above all I blame the squabbling Egyptian\nliberals who fought for Mubarak’s ouster but did not give democracy a\nchance.\nDid not give democracy a chance? The Muslim Brotherhood was democracy in action. Some of you will recall the way in which I dismissed the so-called Arab Spring; there were no shortage of the usual suspects attempting to claim that I was wrong, that all the experts were right about the miraculous democratic transformation of the Middle East.\nAs a general rule, unless one is dealing with technology, it is very seldom different. This is as true of politics as it is of economics. Democracy in the Middle East means Islamic rule, just as the importation of barbarians and savages into the USA means that they will henceforth serve as the deciding factor in government so long as some vestiges of democracy survive in the declining West.\nThe huge mistake of the immigration enthusiasts was to fail to realize that immigration and democracy are no more compatible than Islam and democracy. Celler, Hart, and Kennedy claimed that Americans could open their borders to the world and keep their nation, but they no more told the truth than Obama did when he told Americans they could keep their doctor.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2014-01-28T14:00:00+00:00"
}