{
  "url": "https://voxday.net/2014/01/11/desperately-seeking-deb/",
  "scraped_at": "2025-12-15T16:42:54.509909",
  "title": "Desperately seeking debt",
  "date_display": "January 11, 2014",
  "date_iso": "2014-01-11T09:10:00+00:00",
  "date_from_url": "2014-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s bad enough that the younger generation of Americans is being saddled with massive amounts of useless, permanent student loan debt. But this new concept of <a href=\"http://www.dailymail.co.uk/news/article-2537511/The-40-year-old-mortgage-pass-children-House-price-boom-forces-buyers-opt-two-generation-loans.html\">a multi-generational home mortage</a> being broached in the UK is truly evil:</p><blockquote class=\"tr_bq\"><p> Forty-year mortgages that may take two generations to pay off could become the norm, ministers believe. Rising house prices will prompt more homebuyers to abandon traditional 25-year loans and opt for ever longer repayment terms, they say. Cabinet ministers who discussed claims of a new property ‘bubble’ this week believe a cultural shift is under way which means people are increasingly comfortable with extended loans.</p><p>They believe that in future householders may choose to pass on a house<br> with an outstanding mortgage to their children, who will pay off the<br> rest. ‘In Japan, the 40-year mortgage is the norm,’ said one Government<br> source. ‘Paying it off is a two-generation job for many families. If<br> house prices remain high, longer-term mortgages like those will become<br> more acceptable to people here.’</br></br></br></br></br></p></blockquote><p>Imitating Japan, which has been stuck in economic stagnation and the highest proportion of debt-to-GDP, strikes me as an appallingly bad idea. And make no mistake, this is a short-term solution to a problem that is the result of the large-scale immigration into the UK as well as Russians driving up the London property market.</p><p>First it took one income to buy a house. Now it takes two incomes. Soon it will take two generations, assuming the system doesn’t collapse first. That which can’t continue indefinitely won’t.</p><p>Massive debt and native dispossession is one of the costs of free trade. But at least the indebted masses have the consolation of being able to buy cheap Korean flatscreens and poorly constructed clothes from China.</p></div>",
  "content_text": "It’s bad enough that the younger generation of Americans is being saddled with massive amounts of useless, permanent student loan debt. But this new concept of\na multi-generational home mortage\nbeing broached in the UK is truly evil:\nForty-year mortgages that may take two generations to pay off could become the norm, ministers believe. Rising house prices will prompt more homebuyers to abandon traditional 25-year loans and opt for ever longer repayment terms, they say. Cabinet ministers who discussed claims of a new property ‘bubble’ this week believe a cultural shift is under way which means people are increasingly comfortable with extended loans.\nThey believe that in future householders may choose to pass on a house\nwith an outstanding mortgage to their children, who will pay off the\nrest. ‘In Japan, the 40-year mortgage is the norm,’ said one Government\nsource. ‘Paying it off is a two-generation job for many families. If\nhouse prices remain high, longer-term mortgages like those will become\nmore acceptable to people here.’\nImitating Japan, which has been stuck in economic stagnation and the highest proportion of debt-to-GDP, strikes me as an appallingly bad idea. And make no mistake, this is a short-term solution to a problem that is the result of the large-scale immigration into the UK as well as Russians driving up the London property market.\nFirst it took one income to buy a house. Now it takes two incomes. Soon it will take two generations, assuming the system doesn’t collapse first. That which can’t continue indefinitely won’t.\nMassive debt and native dispossession is one of the costs of free trade. But at least the indebted masses have the consolation of being able to buy cheap Korean flatscreens and poorly constructed clothes from China.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-11T09:10:00+00:00"
}