{
  "url": "https://voxday.net/2014/01/04/digging-hole-deeper/",
  "scraped_at": "2025-12-15T16:42:12.685725",
  "title": "Digging the hole deeper",
  "date_display": "January 4, 2014",
  "date_iso": "2014-01-04T20:02:00+00:00",
  "date_from_url": "2014-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris Kluwe continues to insert his hypocritical foot into his mouth <a href=\"http://houston.cbslocal.com/2014/01/03/chris-kluwe-the-nfl-would-rather-have-felons-and-racists-and-abusers/\">while garnering absolutely no support</a> from anyone in the National Football League:</p><blockquote class=\"tr_bq\"><p> “I don’t know if the team would have kept me if the message was different. I think it is really unfortunate that in the NFL it seems like you can do a wide variety of awful things but if you speak out on a social issue then that’s what appears to be the bright line. The ‘hey you can’t cross that’. What does that say about our priorities? We’d rather have felons and racists and abusers then someone speaking out on issues.”</p><p>Those thoughts make Kluwe question if he even wants to come back to the National Football League.</p><p>“I don’t know if I want to deal with the unreality of the NFL anymore. It really is this bubble of people who think actions have no consequences and they can act however they want.”</p><p>If he did want to come back Kluwe isn’t sure if anyone would want him, now.</p><p>“I don’t know if there are any owners or head coaches out there that are willing to deal with everything that comes along with (signing me).”</p><p>Kluwe isn’t surprised no other players have come to his defense.</p></blockquote><p>I draw your attention to that last part. The homosexual advocates are constantly trying to claim that those who are opposed to normalizing and institutionalizing sexual abnormalities are outnumbered, but the fact is that we remain the majority <i>and we always will</i>. The Left will cite its cherry-picked polls and point to the youth, making the same static mistake it makes about everything, ignoring the fact that a) the youth are stupid, and, b) most of them grow up eventually.</p><p>The ironic thing is that while the idiot punter likely fancies himself an “anti-racist”, but there is nothing, short of a complete ban on African players, that would have more racist consequences than banning criminals and abusers from the league. This guy is even dumber than he first appeared.</p><p>Kluwe has no support from the players and I daresay he has even less from the coaches around the league in light of his statements about the Vikings coaches and general manager. Leslie Frazier, for all that he failed as a head coach, is a very well-respected defensive coordinator, and has already been hired by Tampa Bay. And after openly declaring his intention to see that one of his coaches is never employed again, Kluwe is the very last person who can complain about being blackballed.</p><p>And let’s not forget that Chris Culliver of the 49ers was publicly criticized by the team for expressing his views on homogamy.</p></div>",
  "content_text": "Chris Kluwe continues to insert his hypocritical foot into his mouth\nwhile garnering absolutely no support\nfrom anyone in the National Football League:\n“I don’t know if the team would have kept me if the message was different. I think it is really unfortunate that in the NFL it seems like you can do a wide variety of awful things but if you speak out on a social issue then that’s what appears to be the bright line. The ‘hey you can’t cross that’. What does that say about our priorities? We’d rather have felons and racists and abusers then someone speaking out on issues.”\nThose thoughts make Kluwe question if he even wants to come back to the National Football League.\n“I don’t know if I want to deal with the unreality of the NFL anymore. It really is this bubble of people who think actions have no consequences and they can act however they want.”\nIf he did want to come back Kluwe isn’t sure if anyone would want him, now.\n“I don’t know if there are any owners or head coaches out there that are willing to deal with everything that comes along with (signing me).”\nKluwe isn’t surprised no other players have come to his defense.\nI draw your attention to that last part. The homosexual advocates are constantly trying to claim that those who are opposed to normalizing and institutionalizing sexual abnormalities are outnumbered, but the fact is that we remain the majority\nand we always will\n. The Left will cite its cherry-picked polls and point to the youth, making the same static mistake it makes about everything, ignoring the fact that a) the youth are stupid, and, b) most of them grow up eventually.\nThe ironic thing is that while the idiot punter likely fancies himself an “anti-racist”, but there is nothing, short of a complete ban on African players, that would have more racist consequences than banning criminals and abusers from the league. This guy is even dumber than he first appeared.\nKluwe has no support from the players and I daresay he has even less from the coaches around the league in light of his statements about the Vikings coaches and general manager. Leslie Frazier, for all that he failed as a head coach, is a very well-respected defensive coordinator, and has already been hired by Tampa Bay. And after openly declaring his intention to see that one of his coaches is never employed again, Kluwe is the very last person who can complain about being blackballed.\nAnd let’s not forget that Chris Culliver of the 49ers was publicly criticized by the team for expressing his views on homogamy.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-04T20:02:00+00:00"
}