{
  "url": "https://voxday.net/2014/01/15/diversity-and-law/",
  "scraped_at": "2025-12-15T16:43:26.624118",
  "title": "Diversity and the law",
  "date_display": "January 15, 2014",
  "date_iso": "2014-01-15T21:00:00+00:00",
  "date_from_url": "2014-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It will be interesting to see if the left-wing gay activists who are so enthusiastic about diversity and immigration will stop to rethink their enthusiasm in light of <a href=\"http://www.telegraph.co.uk/news/worldnews/africaandindianocean/nigeria/10571788/Nigeria-begins-arrests-after-anti-gay-law-passed.html\">a series of new laws</a> in various African countries:</p><blockquote class=\"tr_bq\"><div class=\"firstPar\"> Nigerian authorities today began arresting gay men after legislation was<br> quietly approved criminalising homosexuality and imposing prison terms up to<br> 14 years for breaking the new law. Several gay couples were taken into custody in the country’s majority-Muslim<br> north, and rights groups feared that others would be targeted across the<br> West African country.<p>Goodluck Jonathan, Nigeria’s president, signed the Same Sex Marriage<br> Prohibition Act into law on January 7, but there was no public report of the<br> new law until journalists obtained a copy of the act on Monday. It prohibits homosexuals from even meeting in groups of two or more, bans<br> marriage or civil unions between people of the same sex, and criminalises<br> gay clubs and events.</br></br></br></br></p></br></br></br></br></div><div class=\"thirdPar\"> <br> Reuben Abati, the presidential spokesman, said Nigerians were happy with the<br> new law. It makes Nigeria the 38th African nation to enact legislation<br> persecuting gay people.</br></br></br></div></blockquote><p>This is obviously wonderful news for left-liberals around the world, since as we all know, increased government intervention is an inevitable indication of social progress. And given the increased number of Africans in the USA, obviously it will be important for Americans to respect their cultural mores by permitting them to arrest any homosexuals who offend them.</p><p>It would, of course, be racist, xenophobic, and cultural imperialist to suggest that the newfound American enthusiasm for legal buggery should be forced upon Africans. I find it amazing to observe that 38 countries across Africa alone have criminalized homosexuality. It’s not something one often hears the American media mention despite their interminable sob stories about the Dark Continent.</p><p>Ten years ago, I would have seen such a law as an outrage. Not something to justify foreign intervention, you understand, but still, it would have been an outrage to my libertarian sensibilities. However, after seeing the increasingly fascist behavior of the gay rights activists, I’m not only indifferent towards Nigeria’s actions, but fully expecting similar laws to start taking effect in the West once the current Washington-Brussels axis collapses. After all, we’re already seeing them start to surface in Russia and Eastern Europe.</p><p>In an age of global communications, it’s simply not possible to make the same deceptive arguments over and over again. Other countries see what has happened in the USA and elsewhere and they don’t wish to experience the same consequences. <i>“Some have suggested Nigeria’s<br> new law and a proposed one in Uganda were a backlash to Western pressure for<br> gay rights.”<br> </br></br></br></i></p><p>From Big Government Republicans to drag queens, everyone feeling their political oats always seems to forget that social mood is a pendulum. But one of the best ways one can predict what is likely to happen in the future is to observe whose pendulum appears to be closest to peaking.</p></div>",
  "content_text": "It will be interesting to see if the left-wing gay activists who are so enthusiastic about diversity and immigration will stop to rethink their enthusiasm in light of\na series of new laws\nin various African countries:\nNigerian authorities today began arresting gay men after legislation was\nquietly approved criminalising homosexuality and imposing prison terms up to\n14 years for breaking the new law. Several gay couples were taken into custody in the country’s majority-Muslim\nnorth, and rights groups feared that others would be targeted across the\nWest African country.\nGoodluck Jonathan, Nigeria’s president, signed the Same Sex Marriage\nProhibition Act into law on January 7, but there was no public report of the\nnew law until journalists obtained a copy of the act on Monday. It prohibits homosexuals from even meeting in groups of two or more, bans\nmarriage or civil unions between people of the same sex, and criminalises\ngay clubs and events.\nReuben Abati, the presidential spokesman, said Nigerians were happy with the\nnew law. It makes Nigeria the 38th African nation to enact legislation\npersecuting gay people.\nThis is obviously wonderful news for left-liberals around the world, since as we all know, increased government intervention is an inevitable indication of social progress. And given the increased number of Africans in the USA, obviously it will be important for Americans to respect their cultural mores by permitting them to arrest any homosexuals who offend them.\nIt would, of course, be racist, xenophobic, and cultural imperialist to suggest that the newfound American enthusiasm for legal buggery should be forced upon Africans. I find it amazing to observe that 38 countries across Africa alone have criminalized homosexuality. It’s not something one often hears the American media mention despite their interminable sob stories about the Dark Continent.\nTen years ago, I would have seen such a law as an outrage. Not something to justify foreign intervention, you understand, but still, it would have been an outrage to my libertarian sensibilities. However, after seeing the increasingly fascist behavior of the gay rights activists, I’m not only indifferent towards Nigeria’s actions, but fully expecting similar laws to start taking effect in the West once the current Washington-Brussels axis collapses. After all, we’re already seeing them start to surface in Russia and Eastern Europe.\nIn an age of global communications, it’s simply not possible to make the same deceptive arguments over and over again. Other countries see what has happened in the USA and elsewhere and they don’t wish to experience the same consequences.\n“Some have suggested Nigeria’s\nnew law and a proposed one in Uganda were a backlash to Western pressure for\ngay rights.”\nFrom Big Government Republicans to drag queens, everyone feeling their political oats always seems to forget that social mood is a pendulum. But one of the best ways one can predict what is likely to happen in the future is to observe whose pendulum appears to be closest to peaking.",
  "tags": [
    "law",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-15T21:00:00+00:00"
}