{
  "url": "https://voxday.net/2014/01/22/dont-write-for-living/",
  "scraped_at": "2025-12-15T16:44:11.106623",
  "title": "Don’t write for a living",
  "date_display": "January 22, 2014",
  "date_iso": "2014-01-22T20:00:00+00:00",
  "date_from_url": "2014-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://publishingperspectives.com/wp-content/uploads/2014/01/dbwslide.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"219\" src=\"http://publishingperspectives.com/wp-content/uploads/2014/01/dbwslide.png\" width=\"320\"/></a></div><p>I’ve pointed this out many times in the past, but this article on <a href=\"http://publishingperspectives.com/2014/01/how-much-do-writers-earn-less-than-you-think/\">how writers earn less than you think</a> should put it into perspective. I write solely as a hobby, I am persona non grata in most publishing circles, and even so my writing income puts me in the top 10 percent of traditionally published authors. That will go up in the coming year as I shift increasingly into Hybrid mode, but even so, I think I’d rather work a minimum wage job and spend all the money earned on lottery tickets than gamble on making $100,000 from writing for five consecutive years. Remember, unlike a salaried job, you are only as good as your last book, even if ebook sales extends the viability of your backlist.</p><p>This is not to discourage anyone from writing. To the contrary, I actively encourage anyone with an interest in writing to do so. Just don’t do it as a career. You don’t lift weights because you think you’re going to be a professional powerlifter, you don’t play softball because you think you’re going to make the major leagues, and you shouldn’t write because you think you’re going to be the next Stephen King or JK Rowling.</p></div>",
  "content_text": "I’ve pointed this out many times in the past, but this article on\nhow writers earn less than you think\nshould put it into perspective. I write solely as a hobby, I am persona non grata in most publishing circles, and even so my writing income puts me in the top 10 percent of traditionally published authors. That will go up in the coming year as I shift increasingly into Hybrid mode, but even so, I think I’d rather work a minimum wage job and spend all the money earned on lottery tickets than gamble on making $100,000 from writing for five consecutive years. Remember, unlike a salaried job, you are only as good as your last book, even if ebook sales extends the viability of your backlist.\nThis is not to discourage anyone from writing. To the contrary, I actively encourage anyone with an interest in writing to do so. Just don’t do it as a career. You don’t lift weights because you think you’re going to be a professional powerlifter, you don’t play softball because you think you’re going to make the major leagues, and you shouldn’t write because you think you’re going to be the next Stephen King or JK Rowling.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-22T20:00:00+00:00"
}