{
  "url": "https://voxday.net/2014/01/06/france-rises-again/",
  "scraped_at": "2025-12-15T16:42:21.738785",
  "title": "France rises again",
  "date_display": "January 6, 2014",
  "date_iso": "2014-01-06T14:00:00+00:00",
  "date_from_url": "2014-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is interesting to see that even the globalist expats are observing precisely <a href=\"http://opinionator.blogs.nytimes.com/2014/01/05/does-immigration-mean-france-is-over/\">the same nationalist phenomenon growing</a> that I have observed across Europe. The key difference, of course, being that they disapprove of it whereas I wholeheartedly approve of this eminently predictable development:</p><blockquote class=\"tr_bq\"><p> PARIS — It is difficult to go more than a day in France without hearing<br> someone express the conviction that the greatest problem in the country<br> is its ethnic minorities, that the presence of immigrants compromises<br> the identity of France itself. This conviction is typically expressed<br> without any acknowledgment of the country’s historical responsibility as<br> a colonial power for the presence of former colonial subjects in<br> metropolitan France, nor with any willingness to recognize that France<br> will be ethnically diverse from here on out, and that it’s the<br> responsibility of the French as much as of the immigrants to make this<br> work.</br></br></br></br></br></br></br></br></br></p><p>In the past year I have witnessed incessant stop-and-frisk of young<br> black men in the Gare du Nord; in contrast with New York, here in Paris<br> this practice is scarcely debated. I was told by a taxi driver as we<br> passed through a black neighborhood: “I hope you got your shots. You<br> don’t need to go to Africa anymore to get a tropical disease.” On<br> numerous occasions, French strangers have offered up the observation to<br> me, in reference to ethnic minorities going about their lives in the<br> capital: “This is no longer France. France is over.” There is a<br> constant, droning presupposition in virtually all social interactions<br> that a clear and meaningful division can be made between the people who<br> make up the real France and the impostors….</br></br></br></br></br></br></br></br></br></br></p><p>Equality is of course one of the virtues on which the French Republic<br> was founded, yet critics of the Enlightenment philosophy behind the<br> Revolution have long noticed a double standard: when equality is<br> invoked, these critics note, it is understood that this is equality <i>among equals</i>.<br> Political and social inequality is allowed to go on as before, as long<br> as it is presumed that this is rooted in a natural inequality….</br></br></br></br></br></p><p>The American approach to immigration is plainly rooted in historical<br> exigencies connected to the appropriation of a continent, and it is this<br> same history of appropriation that continues to induce shame in most<br> Euro-Americans who might otherwise be tempted to describe themselves as<br> natives. America has to recognize its hybrid and constructed identity,<br> since the only people who can plausibly lay claim to native status are<br> the very ones this new identity was conjured to displace. But in Europe<br> no similar displacement plays a role in historical memory: Europeans can<br> more easily imagine themselves to be their own natives, and so can<br> imagine any demographic impact on the continent from the extra-European<br> world as the harbinger of an eventual total displacement.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>The writer is an idiot multiculturalist, of course, but he does correctly identify the fundamental difference between European attitude towards mass migration and the American attitude. Where he is completely wrong is in forgetting that Europeans don’t have to “imagine themselves to be their own natives”, as they are quite literally the indigenous people of Europe, they have the same rights to protection in Europe that are afforded to indigenous peoples elsewhere, and they cannot permit any displacement there because they have literally nowhere else to go.</p><p>Israel for the Jews. Japan for the Japanese. Europe for the various nations of Europe. And France for the French. Nationalism is not a difficult or dangerous concept, it is a moral imperative and a divine decree. The globalist, multicultural dogma is not merely impractical, it is immoral and overtly anti-Biblical, being Babel writ large.</p></div>",
  "content_text": "It is interesting to see that even the globalist expats are observing precisely\nthe same nationalist phenomenon growing\nthat I have observed across Europe. The key difference, of course, being that they disapprove of it whereas I wholeheartedly approve of this eminently predictable development:\nPARIS — It is difficult to go more than a day in France without hearing\nsomeone express the conviction that the greatest problem in the country\nis its ethnic minorities, that the presence of immigrants compromises\nthe identity of France itself. This conviction is typically expressed\nwithout any acknowledgment of the country’s historical responsibility as\na colonial power for the presence of former colonial subjects in\nmetropolitan France, nor with any willingness to recognize that France\nwill be ethnically diverse from here on out, and that it’s the\nresponsibility of the French as much as of the immigrants to make this\nwork.\nIn the past year I have witnessed incessant stop-and-frisk of young\nblack men in the Gare du Nord; in contrast with New York, here in Paris\nthis practice is scarcely debated. I was told by a taxi driver as we\npassed through a black neighborhood: “I hope you got your shots. You\ndon’t need to go to Africa anymore to get a tropical disease.” On\nnumerous occasions, French strangers have offered up the observation to\nme, in reference to ethnic minorities going about their lives in the\ncapital: “This is no longer France. France is over.” There is a\nconstant, droning presupposition in virtually all social interactions\nthat a clear and meaningful division can be made between the people who\nmake up the real France and the impostors….\nEquality is of course one of the virtues on which the French Republic\nwas founded, yet critics of the Enlightenment philosophy behind the\nRevolution have long noticed a double standard: when equality is\ninvoked, these critics note, it is understood that this is equality\namong equals\n.\nPolitical and social inequality is allowed to go on as before, as long\nas it is presumed that this is rooted in a natural inequality….\nThe American approach to immigration is plainly rooted in historical\nexigencies connected to the appropriation of a continent, and it is this\nsame history of appropriation that continues to induce shame in most\nEuro-Americans who might otherwise be tempted to describe themselves as\nnatives. America has to recognize its hybrid and constructed identity,\nsince the only people who can plausibly lay claim to native status are\nthe very ones this new identity was conjured to displace. But in Europe\nno similar displacement plays a role in historical memory: Europeans can\nmore easily imagine themselves to be their own natives, and so can\nimagine any demographic impact on the continent from the extra-European\nworld as the harbinger of an eventual total displacement.\nThe writer is an idiot multiculturalist, of course, but he does correctly identify the fundamental difference between European attitude towards mass migration and the American attitude. Where he is completely wrong is in forgetting that Europeans don’t have to “imagine themselves to be their own natives”, as they are quite literally the indigenous people of Europe, they have the same rights to protection in Europe that are afforded to indigenous peoples elsewhere, and they cannot permit any displacement there because they have literally nowhere else to go.\nIsrael for the Jews. Japan for the Japanese. Europe for the various nations of Europe. And France for the French. Nationalism is not a difficult or dangerous concept, it is a moral imperative and a divine decree. The globalist, multicultural dogma is not merely impractical, it is immoral and overtly anti-Biblical, being Babel writ large.",
  "tags": [
    "EU",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-06T14:00:00+00:00"
}