{
  "url": "https://voxday.net/2014/01/14/getting-away-with-murder/",
  "scraped_at": "2025-12-15T16:43:18.090809",
  "title": "Getting away with murder",
  "date_display": "January 14, 2014",
  "date_iso": "2014-01-14T21:00:00+00:00",
  "date_from_url": "2014-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even on the rare occasions the police are ever charged with murder after killing someone, <a href=\"http://www.breitbart.com/Big-Government/2014/01/14/Officers-acquitted-in-California-homeless-death\">they get away with it</a>:</p><blockquote class=\"tr_bq\"><p> Two California police officers who were videotaped in a violent struggle<br> with a homeless man during an arrest were acquitted Monday of killing<br> him. It was a rare case in which police officers were charged in a death involving actions on duty….</br></br></p><p>The video began with Ramos stopping Thomas on July 5, 2011, after the<br> officer answered a call about a disheveled man jiggling the handles of<br> car doors in a busy transit center parking lot. Ramos grew frustrated with Thomas, who wasn’t following orders to sit on a curb with his hands on his knees.</br></br></p><p>Just before the altercation began, Ramos snapped on plastic gloves, made<br> two fists and then held them in front of Thomas’ face as he said, “Now<br> see these fists? They’re going to (expletive) you up.”</br></br></p><p>Cicinelli, who arrived a few moments later, jolted Thomas several times<br> with an electric stun gun and used the butt end to hit Thomas in the<br> head and face, breaking bones.</br></br></p><p>Thomas was taken off life support five days later.</p></blockquote><p>Well, that settles it. If the police are involved, you will get no justice from the legal system. It’s not as if this is a one-time event. It is dangerous to even <a href=\"http://rt.com/usa/cops-kill-mentally-ill-teen-283/\">call the police for help</a>.</p><blockquote class=\"tr_bq\"><p> A Boiling Springs Lakes, North Carolina family is looking for answers<br> after local police shot and killed their mentally ill teenage son while<br> responding to a call for help….Wilsey said<br> that Vidal had been subdued until the third officer walked in and<br> the boy became agitated.</br></br></br></br></p><p> “Then all of a sudden, this Southport cop came, walked in the<br> house [and said]: ‘I don’t have time for this. Tase him. Let’s<br> get him out of here,'” Wilsey told NBC. After the stun gun<br> was used on Vidal, Wilsey said the third officer shot him, saying<br> he was protecting his officers.</br></br></br></br></p><p> “He reached right up, shot this kid point-blank, with all<br> intent to kill,” Wilsey added. “He just murdered him<br> flat out.”</br></br></p></blockquote><p>It is increasingly looking as if the police in America have declared war on the mentally disturbed.</p></div>",
  "content_text": "Even on the rare occasions the police are ever charged with murder after killing someone,\nthey get away with it\n:\nTwo California police officers who were videotaped in a violent struggle\nwith a homeless man during an arrest were acquitted Monday of killing\nhim. It was a rare case in which police officers were charged in a death involving actions on duty….\nThe video began with Ramos stopping Thomas on July 5, 2011, after the\nofficer answered a call about a disheveled man jiggling the handles of\ncar doors in a busy transit center parking lot. Ramos grew frustrated with Thomas, who wasn’t following orders to sit on a curb with his hands on his knees.\nJust before the altercation began, Ramos snapped on plastic gloves, made\ntwo fists and then held them in front of Thomas’ face as he said, “Now\nsee these fists? They’re going to (expletive) you up.”\nCicinelli, who arrived a few moments later, jolted Thomas several times\nwith an electric stun gun and used the butt end to hit Thomas in the\nhead and face, breaking bones.\nThomas was taken off life support five days later.\nWell, that settles it. If the police are involved, you will get no justice from the legal system. It’s not as if this is a one-time event. It is dangerous to even\ncall the police for help\n.\nA Boiling Springs Lakes, North Carolina family is looking for answers\nafter local police shot and killed their mentally ill teenage son while\nresponding to a call for help….Wilsey said\nthat Vidal had been subdued until the third officer walked in and\nthe boy became agitated.\n“Then all of a sudden, this Southport cop came, walked in the\nhouse [and said]: ‘I don’t have time for this. Tase him. Let’s\nget him out of here,'” Wilsey told NBC. After the stun gun\nwas used on Vidal, Wilsey said the third officer shot him, saying\nhe was protecting his officers.\n“He reached right up, shot this kid point-blank, with all\nintent to kill,” Wilsey added. “He just murdered him\nflat out.”\nIt is increasingly looking as if the police in America have declared war on the mentally disturbed.",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-14T21:00:00+00:00"
}