{
  "url": "https://voxday.net/2014/01/13/hollywoods-favorite-monster/",
  "scraped_at": "2025-12-15T16:43:08.315165",
  "title": "Hollywood’s favorite monster",
  "date_display": "January 13, 2014",
  "date_iso": "2014-01-13T14:00:00+00:00",
  "date_from_url": "2014-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Granted, Mia Farrow is more than a bit of a nutcase. But given his confirmed behavior, there isn’t much reason to doubt the allegations that <a href=\"http://www.vanityfair.com/hollywood/2013/11/mia-farrow-frank-sinatra-ronan-farrow\">Woody Allen is a child molester</a> are true:</p><blockquote class=\"tr_bq\"><p> Frank and Mia stayed close, however, even when she was married to the<br> composer-conductor André Previn, whom she divorced in 1979, after having<br> three sons and adopting three at-risk Asian daughters. She also<br> continued to see Sinatra throughout her 13-year relationship with Woody<br> Allen, which suffered a jolt when she found lurid photographs taken by<br> Allen of Soon-Yi Previn, one of her adopted daughters, then a sophomore<br> in college, on the mantel in Allen’s Manhattan apartment. Only a month<br> earlier, in December 1991, Allen had formally adopted two of Mia’s<br> children, 15-year-old Moses and 7-year-old Dylan, even though he was in<br> therapy for inappropriate behavior toward Dylan. In August 1992, after<br> disappearing with Allen in Mia’s Connecticut country house and<br> reappearing without underpants, Dylan told her mother that Allen had<br> stuck his finger up her vagina and kissed her all over in the attic,<br> charges Allen has always vociferously denied.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Ronan Farrow adds on Twitter: <i>“Missed the Woody Allen tribute – did they put the part where a woman<br> publicly confirmed he molested her at age 7 before or after Annie Hall?”</br></i></p><p>Woody Allen isn’t funny. He’s grotesque. He’s ugly. He’s a whiny little sexually obsessed monster. His films are tedious, unimaginative, and narcissistic. And he’s a child molester. The fact that Hollywood sees in him a man worthy of receiving its tribute tells you all you need to know about that depraved Gomorrah.</p><p>Every now and then, I’m asked if I’m interested in optioning the film rights to my books, sometimes even by people with actual film credits. My answer is always no. Not merely no, but HELL NO! I want nothing to do with Hollywood. It’s not an accident or coincidence that Hollywood so often takes pure storytelling gold and turns it into filth. They are the anti-Rumplestiltskins. They love rolling in filth.</p></div>",
  "content_text": "Granted, Mia Farrow is more than a bit of a nutcase. But given his confirmed behavior, there isn’t much reason to doubt the allegations that\nWoody Allen is a child molester\nare true:\nFrank and Mia stayed close, however, even when she was married to the\ncomposer-conductor André Previn, whom she divorced in 1979, after having\nthree sons and adopting three at-risk Asian daughters. She also\ncontinued to see Sinatra throughout her 13-year relationship with Woody\nAllen, which suffered a jolt when she found lurid photographs taken by\nAllen of Soon-Yi Previn, one of her adopted daughters, then a sophomore\nin college, on the mantel in Allen’s Manhattan apartment. Only a month\nearlier, in December 1991, Allen had formally adopted two of Mia’s\nchildren, 15-year-old Moses and 7-year-old Dylan, even though he was in\ntherapy for inappropriate behavior toward Dylan. In August 1992, after\ndisappearing with Allen in Mia’s Connecticut country house and\nreappearing without underpants, Dylan told her mother that Allen had\nstuck his finger up her vagina and kissed her all over in the attic,\ncharges Allen has always vociferously denied.\nRonan Farrow adds on Twitter:\n“Missed the Woody Allen tribute – did they put the part where a woman\npublicly confirmed he molested her at age 7 before or after Annie Hall?”\nWoody Allen isn’t funny. He’s grotesque. He’s ugly. He’s a whiny little sexually obsessed monster. His films are tedious, unimaginative, and narcissistic. And he’s a child molester. The fact that Hollywood sees in him a man worthy of receiving its tribute tells you all you need to know about that depraved Gomorrah.\nEvery now and then, I’m asked if I’m interested in optioning the film rights to my books, sometimes even by people with actual film credits. My answer is always no. Not merely no, but HELL NO! I want nothing to do with Hollywood. It’s not an accident or coincidence that Hollywood so often takes pure storytelling gold and turns it into filth. They are the anti-Rumplestiltskins. They love rolling in filth.",
  "tags": [
    "freakshow",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-13T14:00:00+00:00"
}