{
  "url": "https://voxday.net/2014/01/20/i-see-fraud/",
  "scraped_at": "2025-12-15T16:43:57.029138",
  "title": "I see a fraud",
  "date_display": "January 20, 2014",
  "date_iso": "2014-01-20T15:15:00+00:00",
  "date_from_url": "2014-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Serial global warming scammer Michael Mann calls for <a href=\"http://www.nytimes.com/2014/01/19/opinion/sunday/if-you-see-something-say-something.html?hp&amp;rref=opinion&amp;_r=0\">the politicization of science</a>:</p><blockquote class=\"tr_bq\"><p> It<br> is not an uncommon view among scientists that we potentially compromise<br> our objectivity if we choose to wade into policy matters or the<br> societal implications of our work. And it would be problematic if our<br> views on policy somehow influenced the way we went about doing our<br> science. But there is nothing inappropriate at all about drawing on our<br> scientific knowledge to speak out about the very real implications of<br> our research.</br></br></br></br></br></br></br></p><p>My<br> colleague Stephen Schneider of Stanford University, who died in 2010,<br> used to say that being a scientist-advocate is not an oxymoron. Just<br> because we are scientists does not mean that we should check our<br> citizenship at the door of a public meeting, he would explain. The New<br> Republic once called him a “scientific pugilist” for advocating a<br> forceful approach to global warming. But fighting for scientific truth<br> and an informed debate is nothing to apologize for.</br></br></br></br></br></br></br></p><p>If<br> scientists choose not to engage in the public debate, we leave a vacuum<br> that will be filled by those whose agenda is one of short-term<br> self-interest. There is a great cost to society if scientists fail to<br> participate in the larger conversation — if we do not do all we can to<br> ensure that the policy debate is informed by an honest assessment of the<br> risks. In fact, it would be an abrogation of our responsibility to<br> society if we remained quiet in the face of such a grave threat.</br></br></br></br></br></br></br></p></blockquote><p>Actually, I welcome this development. It should completely destroy whatever vestiges of respect the average man holds for scientists. I mean, for a scientist who makes his living selling global warming in return for research grants to openly claim that it is a problem for those with short-term self-interests to engage in the public debate, well, we’re clearly not dealing with rocket scientists here.</p><p>Every time an idiot “climate scientist” calls for socialism in the name of science, a little more unwarranted regard for science is lost. And this is before the inevitable announcement that Mann and the 97 percent of climate scientists are shown conclusively to be wrong and the “fringe minority of our populace” is proven that its rejection of their consensus was not, in fact, irrational, but correct.</p><p>Unlike the socialists, the global warmists don’t have 100 years to obfuscate and explain away their failures. They have 10 more years, 20 at most. And we can hope, by then, that “because science” will have become irrevocably tarnished to the point that it is recognized as the logical fallacy it is.</p></div>",
  "content_text": "Serial global warming scammer Michael Mann calls for\nthe politicization of science\n:\nIt\nis not an uncommon view among scientists that we potentially compromise\nour objectivity if we choose to wade into policy matters or the\nsocietal implications of our work. And it would be problematic if our\nviews on policy somehow influenced the way we went about doing our\nscience. But there is nothing inappropriate at all about drawing on our\nscientific knowledge to speak out about the very real implications of\nour research.\nMy\ncolleague Stephen Schneider of Stanford University, who died in 2010,\nused to say that being a scientist-advocate is not an oxymoron. Just\nbecause we are scientists does not mean that we should check our\ncitizenship at the door of a public meeting, he would explain. The New\nRepublic once called him a “scientific pugilist” for advocating a\nforceful approach to global warming. But fighting for scientific truth\nand an informed debate is nothing to apologize for.\nIf\nscientists choose not to engage in the public debate, we leave a vacuum\nthat will be filled by those whose agenda is one of short-term\nself-interest. There is a great cost to society if scientists fail to\nparticipate in the larger conversation — if we do not do all we can to\nensure that the policy debate is informed by an honest assessment of the\nrisks. In fact, it would be an abrogation of our responsibility to\nsociety if we remained quiet in the face of such a grave threat.\nActually, I welcome this development. It should completely destroy whatever vestiges of respect the average man holds for scientists. I mean, for a scientist who makes his living selling global warming in return for research grants to openly claim that it is a problem for those with short-term self-interests to engage in the public debate, well, we’re clearly not dealing with rocket scientists here.\nEvery time an idiot “climate scientist” calls for socialism in the name of science, a little more unwarranted regard for science is lost. And this is before the inevitable announcement that Mann and the 97 percent of climate scientists are shown conclusively to be wrong and the “fringe minority of our populace” is proven that its rejection of their consensus was not, in fact, irrational, but correct.\nUnlike the socialists, the global warmists don’t have 100 years to obfuscate and explain away their failures. They have 10 more years, 20 at most. And we can hope, by then, that “because science” will have become irrevocably tarnished to the point that it is recognized as the logical fallacy it is.",
  "tags": [
    "AGW/CC",
    "politics",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-20T15:15:00+00:00"
}