{
  "url": "https://voxday.net/2014/01/27/lapine-spells/",
  "scraped_at": "2025-12-15T16:44:40.190277",
  "title": "Lapine spells",
  "date_display": "January 27, 2014",
  "date_iso": "2014-01-27T21:00:00+00:00",
  "date_from_url": "2014-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Oswald Spengler had the rabbits pegged in <i>The Decline of the West</i>. He explains why they are so prone to not only name-calling, but viewing name-calling as sufficient to make a case against a perceived foe.</p><p><i>“The world-fear is stilled when an intellectual form-language hammers out brazen vessels in which the mysterious is captured and made comprehensible. This is the idea of “taboo” which plays a decisive part in the spiritual life of all primitive men,  though the original content of the word lies so far from us that it is incapable of any translation into any ripe culture-language. Blind terror, religious awe, deep loneliness, melancholy, hate, obscure impulses to draw near, to be merged, to escape – all those formed feelings of mature souls are in the childish condition blurred in a monotonous indecision.”</i></p><p>Rabbits are not merely barbarians, but primitives. Thus the incantation “homophobe” is considered enough to banish the moralistic thought-criminal, even as the magic spell “raciss” is deemed sufficient to banish the ethno-cultural thought-criminal.</p><p>Spengler even offers an explanation for why they cannot create anything original, but more on that another time. But in the meantime, Kalel points out that Bradbury, too, identified the Nothing People:</p><p><i>“For these beings, fall is ever the normal season, the only weather, there be no choice beyond. Where do they come from? The dust. Where do they go? The grave. Does blood stir their veins? No: the night wind. What ticks in their head? The worm. What speaks from their mouth? The toad. What sees from their eye? The snake. What hears with their ear? The abyss between the stars. They sift the human storm for souls, eat flesh of reason, fill tombs with sinners. They frenzy forth….Such are the autumn people.”</i></p><p>Autumn is such a beautiful time of year that it seems a travesty to identify them by that noble name. I prefer to think of them as the Nothing People, the empty-eyed, soulless creatures of the Abyss. But it is fascinating to me to see how thinkers, philosophers, and artists have all observed the same phenomenon in certain people around them.</p><p>Alhough it is ironic. Who would have ever imagined that the Wicked in <i>Something Wicked This Way Comes</i> would turn out to be the hollow and petty evil that is perhaps best exemplified today by the likes of John Scalzi and the shambling shoggoths of the SFWA.</p></div>",
  "content_text": "Oswald Spengler had the rabbits pegged in\nThe Decline of the West\n. He explains why they are so prone to not only name-calling, but viewing name-calling as sufficient to make a case against a perceived foe.\n“The world-fear is stilled when an intellectual form-language hammers out brazen vessels in which the mysterious is captured and made comprehensible. This is the idea of “taboo” which plays a decisive part in the spiritual life of all primitive men,  though the original content of the word lies so far from us that it is incapable of any translation into any ripe culture-language. Blind terror, religious awe, deep loneliness, melancholy, hate, obscure impulses to draw near, to be merged, to escape – all those formed feelings of mature souls are in the childish condition blurred in a monotonous indecision.”\nRabbits are not merely barbarians, but primitives. Thus the incantation “homophobe” is considered enough to banish the moralistic thought-criminal, even as the magic spell “raciss” is deemed sufficient to banish the ethno-cultural thought-criminal.\nSpengler even offers an explanation for why they cannot create anything original, but more on that another time. But in the meantime, Kalel points out that Bradbury, too, identified the Nothing People:\n“For these beings, fall is ever the normal season, the only weather, there be no choice beyond. Where do they come from? The dust. Where do they go? The grave. Does blood stir their veins? No: the night wind. What ticks in their head? The worm. What speaks from their mouth? The toad. What sees from their eye? The snake. What hears with their ear? The abyss between the stars. They sift the human storm for souls, eat flesh of reason, fill tombs with sinners. They frenzy forth….Such are the autumn people.”\nAutumn is such a beautiful time of year that it seems a travesty to identify them by that noble name. I prefer to think of them as the Nothing People, the empty-eyed, soulless creatures of the Abyss. But it is fascinating to me to see how thinkers, philosophers, and artists have all observed the same phenomenon in certain people around them.\nAlhough it is ironic. Who would have ever imagined that the Wicked in\nSomething Wicked This Way Comes\nwould turn out to be the hollow and petty evil that is perhaps best exemplified today by the likes of John Scalzi and the shambling shoggoths of the SFWA.",
  "tags": [
    "rabbitology",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-27T21:00:00+00:00"
}