{
  "url": "https://voxday.net/2014/01/02/mailvox-fahrenheit-registry/",
  "scraped_at": "2025-12-15T16:41:56.678935",
  "title": "Mailvox: The Fahrenheit Registry",
  "date_display": "January 2, 2014",
  "date_iso": "2014-01-02T14:00:00+00:00",
  "date_from_url": "2014-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anang laments his inability to continue supporting authors who are his political enemies: </p><blockquote class=\"tr_bq\"><p> As an author you<br> obviously want your works reaching the widest possible audience without<br> sacrificing your own creative vision. At the same time, I believe an<br> author’s ideology, his Weltanschauung<i style=\"font-weight: bold;\"> </i>is<br> reflected in his works. I’m a new and proud male American citizen. Why<br> should I pay my good money to read or watch something that ignores and<br> insults my gender, my politics or the things that made me want to be an<br> American?</br></br></br></br></br></br></br></p><p> It’s<br> a little sad actually, having discovered I think this way. It means I<br> can never enjoy some of the most creative artists currently living. I<br> threw away my collection of Naomi Novik’s fantasy books after I realized<br> she was a local party volunteer for John Kerry’s 2004 election. All her<br> meticulous research into creating an alternate, fantastical history of<br> the Napoleonic Wars was just to insert leftist ideology and harp on<br> social justice/race theory/gender inequality.</br></br></br></br></br></br></br></p><p>It’s<br> a very lonely feeling, to know you are cut off from nearly every work<br> of popular entertainment and art if you wish to avoid propaganda-filled attacks on your existence. I suppose that is why most men watch<br> sports.</br></br></br></p></blockquote><p>I knew Novik’s books fell completely apart upon the visit to Australia, (never managed to finish that one), but I didn’t realize there was a sound political reason for it. I think Anang forgets that there are actually many excellent writers who support and sustain the Western intellectual tradition; the fact that they have been exiled by the Left’s gatekeepers doesn’t mean their works don’t exist or can’t be found. In fact, increasing the exposure and awareness of Blue SF/F writers is one of my objectives in the coming year.</p><p>Perhaps it would be helpful to maintain a political registry of SF/F writers so we can permit those who don’t wish to financially support their enemies to avoid doing so. This doesn’t mean one has to avoid reading them entirely, of course, as The Pirate Bay, LibGen, and other sites have far more books that one can hope to read in a lifetime. For example, here is LibGen’s list of the <a href=\"http://fiction.asuscomm.com/search.php?search_type=author&amp;search_text=Gould+Steven&amp;submit=%D0%9F%D0%BE%D0%B8%D1%81%D0%BA\">current SFWA president Steven Gould’s books</a>, in the unlikely event that anyone feels any pressing need to read them. As an added bonus, I can tell you that the SFWA absolutely hates and fears those sites; the idea that people can download their books for free seems to bother them considerably more than simply being ignored.</p><p>Never mind that there is no evidence indicating that pirated books actually harm an author’s book sales. As I’ve noted, about one in five free Amazon downloads turns into a purchase of <i>A Throne of Bones</i>, which is why I’d love to give away more than the 21,760 copies that were downloaded in 2013.</p><p>My thought is that one can rate an author in terms of “noviks”, in honor of Anang’s epiphany.  10 noviks would indicate an author that conservatives, Republicans, libertarians, and traditionalists should avoid at all costs on the basis of his anti-civilizational beliefs and activities. On the other side, 10 “kratmans” would indicate a staunch defender of Western civilization. Here are a few suggestions for the scale:</p><p>Naomi Novik: 5 noviks<br> China Mieville: 9 noviks<br> Charles Stross: 7 noviks<br> Larry Corriea: 8 kratmans<br> JRR Tolkien: 10 kratmans</br></br></br></br></p><p>I leave it to the rest of you to provide the ratings. I shall merely post them as they are added.</p></div>",
  "content_text": "Anang laments his inability to continue supporting authors who are his political enemies:\nAs an author you\nobviously want your works reaching the widest possible audience without\nsacrificing your own creative vision. At the same time, I believe an\nauthor’s ideology, his Weltanschauung\nis\nreflected in his works. I’m a new and proud male American citizen. Why\nshould I pay my good money to read or watch something that ignores and\ninsults my gender, my politics or the things that made me want to be an\nAmerican?\nIt’s\na little sad actually, having discovered I think this way. It means I\ncan never enjoy some of the most creative artists currently living. I\nthrew away my collection of Naomi Novik’s fantasy books after I realized\nshe was a local party volunteer for John Kerry’s 2004 election. All her\nmeticulous research into creating an alternate, fantastical history of\nthe Napoleonic Wars was just to insert leftist ideology and harp on\nsocial justice/race theory/gender inequality.\nIt’s\na very lonely feeling, to know you are cut off from nearly every work\nof popular entertainment and art if you wish to avoid propaganda-filled attacks on your existence. I suppose that is why most men watch\nsports.\nI knew Novik’s books fell completely apart upon the visit to Australia, (never managed to finish that one), but I didn’t realize there was a sound political reason for it. I think Anang forgets that there are actually many excellent writers who support and sustain the Western intellectual tradition; the fact that they have been exiled by the Left’s gatekeepers doesn’t mean their works don’t exist or can’t be found. In fact, increasing the exposure and awareness of Blue SF/F writers is one of my objectives in the coming year.\nPerhaps it would be helpful to maintain a political registry of SF/F writers so we can permit those who don’t wish to financially support their enemies to avoid doing so. This doesn’t mean one has to avoid reading them entirely, of course, as The Pirate Bay, LibGen, and other sites have far more books that one can hope to read in a lifetime. For example, here is LibGen’s list of the\ncurrent SFWA president Steven Gould’s books\n, in the unlikely event that anyone feels any pressing need to read them. As an added bonus, I can tell you that the SFWA absolutely hates and fears those sites; the idea that people can download their books for free seems to bother them considerably more than simply being ignored.\nNever mind that there is no evidence indicating that pirated books actually harm an author’s book sales. As I’ve noted, about one in five free Amazon downloads turns into a purchase of\nA Throne of Bones\n, which is why I’d love to give away more than the 21,760 copies that were downloaded in 2013.\nMy thought is that one can rate an author in terms of “noviks”, in honor of Anang’s epiphany.  10 noviks would indicate an author that conservatives, Republicans, libertarians, and traditionalists should avoid at all costs on the basis of his anti-civilizational beliefs and activities. On the other side, 10 “kratmans” would indicate a staunch defender of Western civilization. Here are a few suggestions for the scale:\nNaomi Novik: 5 noviks\nChina Mieville: 9 noviks\nCharles Stross: 7 noviks\nLarry Corriea: 8 kratmans\nJRR Tolkien: 10 kratmans\nI leave it to the rest of you to provide the ratings. I shall merely post them as they are added.",
  "tags": [
    "books",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-02T14:00:00+00:00"
}