{
  "url": "https://voxday.net/2014/01/13/mailvox-shut-up-he-explained/",
  "scraped_at": "2025-12-15T16:43:06.457443",
  "title": "Mailvox: shut up, he explained",
  "date_display": "January 13, 2014",
  "date_iso": "2014-01-13T09:29:00+00:00",
  "date_from_url": "2014-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Great Martini doesn’t permit his complete unfamiliarity with Sextus Empiricus get in the way of his expressing a demonstrably incorrect opinion about Boghossian’s clear-cut violation of Sextus’s Sceptical teaching of “suspension of judgment”:</p><blockquote class=\"tr_bq\"><p> He hasn’t seemed to run afoul of this yet — I just started reading the<br> Kindle version.  Sextus advised suspended judgement but didn’t preclude<br> the assertion of claims, that seems to be how his skeptical philosophy<br> would be conducted.  As far as I’ve gotten, Bog affirms Dawkins’ 1-7<br> level of belief, that Dawkins only claimed a 6, and that the definition<br> of “atheist” he wants to use is a person who doesn’t believe there is<br> enough evidence to confirm the existence of God.  I’m sure he’s not<br> going to spend the entire book holding to strict suspension of judgement<br> (I mean the entire purpose of the book is to weaken the societal<br> influence of religion, which implies a judgement), but at least he seems<br> to be aligning himself with the skeptical stance from the beginning.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This is completely and utterly wrong. Boghossian has done nothing of the sort. Do you want to know why I am so openly contemptuous of so many people who are fairly intelligent and sound more or less reasonable? Do you want to know why I am inspired to describe myself as a superintelligence? The reason is that it often feels as if I am the only intelligent individual who writes these days <i>who ever bothers to take five minutes to actually read the bloody material </i>upon which I am intending to opine. I don’t know if it was TGM’s intent to defend Boghossian or if he simply happened to miss the obvious, but either way, it is readily apparent that he doesn’t know anything about the Scepticism of Sextus Empiricus.</p><p>Scepticism does not mean “I am dubious about X.” It does not mean “I am going to convince you that X is better than Y”. It does not mean “I will only believe X if there is sufficient evidence to justify it”. It means: “I have no opinion about either X or Y, and if you assert that X is better, I will argue that Y is better in order to produce a contradiction of equal weight and thereby allow me to suspend my judgment.” What virtually no one who talks about skepticism seems to understand is that for the Sceptic, suspension of judgment is not the method or the initial approach, it is the <i>objective</i>. If Boghossian was a genuine Sceptic, he would have presented an argument for the primacy of faith over reason to his atheist audience.</p><p>TGM is disputing this: “<b> Boghossian’s very stated purpose is in direct and explicit<br> opposition to everything Sextus Empiricus advises, beginning with<br> “suspension of judgment”.”</br></br></b></p><p>In the fourth sentence of Chapter One, Boghossian explains his purpose:  “The goal of this book is to… help [the faithful] abandon their faith and embrace reason.”</p><p>So, already we know that the Fifth Horseman clearly has an opinion on at least two things. Faith is bad by nature. Reason is good by nature. That this is a correct summary of his opinions on the two matters is confirmed repeatedly throughout the book. Now let us turn to Sextus Empiricus and the <i>Outlines of Pyrrhonism</i>.</p><p>Sextus: <i>“He who is of the opinion that anything is either good or bad by nature is always troubled…. But he who is undecided, on the contrary, regarding things that are good and bad by nature, neither seeks nor avoids anything eagerly, is therefore in a state of tranquility of soul…. The Sceptic… rejects the opinion that anything is in itself bad by nature. Therefore we say that the aim of the Sceptic is imperturbability in matters of opinion.”</i></p><p>Boghossian reveals his clear-cut opinions concerning faith being bad by nature and reason being good by nature. He is not even remotely imperturbable with regards to either matter of opinion. Therefore he is not only troubled, but his very stated purpose is in direct and explicit opposition to the heart of what Sextus Empiricus teaches. Which is exactly what I stated in the first place. Boghossian can’t possibly be said to be “aligning himself with the skeptical stance from the beginning”, not when he is expressly violating the very aim of the Sceptic.</p><p>And, in doing so, the Fifth Horseman shows himself to be a fraud, given his risible attempt to claim the intellectual mantle of Sextus Empiricus. As it happens, I very much doubt that Boghossian has ever read anything Sextus wrote that isn’t on Wikipedia.</p><p>DH had a much more informed take on Boghossian’s little book:</p><blockquote class=\"tr_bq\"><p> This has all the hallmarks of petty atheism which has as its main feature a<br> stunning lack of scholarship and education.  One of the main<br> attractions of the RC church is that despite all the many faults, and<br> theological questions I may have, the long and ancient history of<br> scholarship remains unbroken.  Whatever you think of any given Pope,<br> it’s unlikely that anything he ever wrote would be so filled with rote<br> unverifiable garbage.</br></br></br></br></br></br></p></blockquote><p>Oh, we haven’t even gotten to the juvenile, self-serving definitions of terms such as “faith”, “hope” and “atheist” yet. It is a stunningly dishonest little book and is unlikely to impress anyone with an IQ over +1SD who reads it with an open or critical mind.</p></div>",
  "content_text": "The Great Martini doesn’t permit his complete unfamiliarity with Sextus Empiricus get in the way of his expressing a demonstrably incorrect opinion about Boghossian’s clear-cut violation of Sextus’s Sceptical teaching of “suspension of judgment”:\nHe hasn’t seemed to run afoul of this yet — I just started reading the\nKindle version.  Sextus advised suspended judgement but didn’t preclude\nthe assertion of claims, that seems to be how his skeptical philosophy\nwould be conducted.  As far as I’ve gotten, Bog affirms Dawkins’ 1-7\nlevel of belief, that Dawkins only claimed a 6, and that the definition\nof “atheist” he wants to use is a person who doesn’t believe there is\nenough evidence to confirm the existence of God.  I’m sure he’s not\ngoing to spend the entire book holding to strict suspension of judgement\n(I mean the entire purpose of the book is to weaken the societal\ninfluence of religion, which implies a judgement), but at least he seems\nto be aligning himself with the skeptical stance from the beginning.\nThis is completely and utterly wrong. Boghossian has done nothing of the sort. Do you want to know why I am so openly contemptuous of so many people who are fairly intelligent and sound more or less reasonable? Do you want to know why I am inspired to describe myself as a superintelligence? The reason is that it often feels as if I am the only intelligent individual who writes these days\nwho ever bothers to take five minutes to actually read the bloody material\nupon which I am intending to opine. I don’t know if it was TGM’s intent to defend Boghossian or if he simply happened to miss the obvious, but either way, it is readily apparent that he doesn’t know anything about the Scepticism of Sextus Empiricus.\nScepticism does not mean “I am dubious about X.” It does not mean “I am going to convince you that X is better than Y”. It does not mean “I will only believe X if there is sufficient evidence to justify it”. It means: “I have no opinion about either X or Y, and if you assert that X is better, I will argue that Y is better in order to produce a contradiction of equal weight and thereby allow me to suspend my judgment.” What virtually no one who talks about skepticism seems to understand is that for the Sceptic, suspension of judgment is not the method or the initial approach, it is the\nobjective\n. If Boghossian was a genuine Sceptic, he would have presented an argument for the primacy of faith over reason to his atheist audience.\nTGM is disputing this: “\nBoghossian’s very stated purpose is in direct and explicit\nopposition to everything Sextus Empiricus advises, beginning with\n“suspension of judgment”.”\nIn the fourth sentence of Chapter One, Boghossian explains his purpose:  “The goal of this book is to… help [the faithful] abandon their faith and embrace reason.”\nSo, already we know that the Fifth Horseman clearly has an opinion on at least two things. Faith is bad by nature. Reason is good by nature. That this is a correct summary of his opinions on the two matters is confirmed repeatedly throughout the book. Now let us turn to Sextus Empiricus and the\nOutlines of Pyrrhonism\n.\nSextus:\n“He who is of the opinion that anything is either good or bad by nature is always troubled…. But he who is undecided, on the contrary, regarding things that are good and bad by nature, neither seeks nor avoids anything eagerly, is therefore in a state of tranquility of soul…. The Sceptic… rejects the opinion that anything is in itself bad by nature. Therefore we say that the aim of the Sceptic is imperturbability in matters of opinion.”\nBoghossian reveals his clear-cut opinions concerning faith being bad by nature and reason being good by nature. He is not even remotely imperturbable with regards to either matter of opinion. Therefore he is not only troubled, but his very stated purpose is in direct and explicit opposition to the heart of what Sextus Empiricus teaches. Which is exactly what I stated in the first place. Boghossian can’t possibly be said to be “aligning himself with the skeptical stance from the beginning”, not when he is expressly violating the very aim of the Sceptic.\nAnd, in doing so, the Fifth Horseman shows himself to be a fraud, given his risible attempt to claim the intellectual mantle of Sextus Empiricus. As it happens, I very much doubt that Boghossian has ever read anything Sextus wrote that isn’t on Wikipedia.\nDH had a much more informed take on Boghossian’s little book:\nThis has all the hallmarks of petty atheism which has as its main feature a\nstunning lack of scholarship and education.  One of the main\nattractions of the RC church is that despite all the many faults, and\ntheological questions I may have, the long and ancient history of\nscholarship remains unbroken.  Whatever you think of any given Pope,\nit’s unlikely that anything he ever wrote would be so filled with rote\nunverifiable garbage.\nOh, we haven’t even gotten to the juvenile, self-serving definitions of terms such as “faith”, “hope” and “atheist” yet. It is a stunningly dishonest little book and is unlikely to impress anyone with an IQ over +1SD who reads it with an open or critical mind.",
  "tags": [
    "Fifth Horseman",
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-13T09:29:00+00:00"
}