{
  "url": "https://voxday.net/2014/01/05/mailvox-frying-pig/",
  "scraped_at": "2025-12-15T16:42:14.532036",
  "title": "Mailvox: frying the pig",
  "date_display": "January 5, 2014",
  "date_iso": "2014-01-05T11:18:00+00:00",
  "date_from_url": "2014-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not content with the crashing and burning of his political wise man act, Porky dives into the boiling oil again:</p><blockquote class=\"tr_bq\"><p> Porky: I’m not surprised that the libertarians here are falling over themselves<br> to praise the leftist for coming up with a hi-tech version of the Jew<br> badge. Funny how they hate the NSA for creating dossiers on citizens<br> minding their own business, but they drool like Pavlov’s dog at the<br> thought of being able to have a dossier on any complete stranger. As I’ve said previously, libertarians are the pupal stage of authoritarians.</br></br></br></br></p><p>VD: <i>As we’ve all observed previously, you’re an idiot.</i></p><p> Porky: Yet here you and the ilk are… giddily peeing your pants at the thought of spying on some stranger’s magazine subscriptions. ie:<br> Josh, who never lets me forget that libertarians “just want to be left<br> alone” yet salivates over the idea of an internet dossier on private<br> citizens.</br></br></br></p></blockquote><p>What Porky is clearly failing to take into account is that the system DH is creating is actually a technological recreation of the virtual one that is already in place in the government, in the universities, and in the big corporations.</p><p>All of the blackballing and stigmatizing goes only one way. The Left forcibly keeps those of the Right out of its organizations and institutions while the Right blithely permits leftists to infiltrate and suborn those that remain to it. The Right doesn’t realize this, in part because it keeps creating new ones, then losing control of them within a generation or two. Or sometimes, as in the case of Facebook, within a few weeks.</p><p>Opposing the idea that small private companies should have the same ability to defend themselves from infiltration by their political enemies that the giant left-leaning institutions do is little different than advocating gun control for the people while the government and police remain armed.</p><p>The Right has very little to fear from the proposed service. Everyone who is even remotely outspoken is already banned from employment with many, perhaps even the majority of existing companies in America. The persecution is real, even though it is passive, reactive, and remarkably gentle in historical terms. Keep in mind that I have not only been expelled from the SFWA for a single tweet, (an infraction of the sort committed by no less than 60 other current members), but I have experienced contractors told by major NGO’s that they would lose their contracts if they continued to work with me. The Left is playing hardball while the Right isn’t even aware that the game has begun.</p><p>So, like the Jews of the European ghettos, we of the traditionalist Right have no choice but to work with each other since no one else wants us around. We have no choice but to work harder, to work smarter, and to make ourselves more valuable than those who persecute us. And we can do that, because working harder and smarter has always been our strength; we are the builders. But how can the ants hope to build up new institutions if the moment they begin to succeed, their organizations are infiltrated and co-opted by the grasshoppers who are opposed to everything they believe?</p><p>We need to know that the prospective employee is a self-appointed activist who boasts of having no morals and a predilection for attacking those with whom he disagrees. Pajamaboy is hardly going to bring that up when he’s applying for a job now, is he? We need to know that the girl trying to sell us computers is a fire-breathing Jezebelle who believes all sex is rape. We need to know that the professed libertarian is heavily partial to left-wing entertainment. We need to know that the student applying for seminary is a radical homosexual whose primary interest in the priesthood is access to altar boys.</p><p>Above all, we have to bypass the corporate gatekeepers and take our case directly to the people. We have to become the very populists they fear. They will call us names, they will call us Nazis, they will call us fascists, they will call us a hundred other names that don’t reasonably apply to us. That doesn’t matter, because we have two things on our side that will always triumph over their vast edifice of temporal power: our faith in God and our acknowledgement for objective Reality.</p><p>As always, Porky is arguing in favor of despair, surrender, and unilateral disarming on the part of the Right. Perhaps this is because he is short-sighted, perhaps this is because he is an agent provocateur, or perhaps he is simply an idiot. It doesn’t really matter, all that matters is that he is wrong.</p><p>DH explains:</p><blockquote class=\"tr_bq\"><p> I see this as exactly what VD is talking about. I can work really well with libertarians. I can work really well with populists. But I can’t work well with GOP true believers. If you spend your working day listening to Shawn Hannity and Rush Limbaugh and thinking they are the greatest thing ever, it’s over. We are not going to work well unless it is quite literally a work-for-hire remote employee contracted position. Same thing with Glenn Beck. If you are real Glenn Beck believer, it’s probably not going to work out. I certainly can’t have you interacting with my clients and risking going into hysterics about whatever he was talking about the radio today. Oddly, almost the same thing is true of Rachael Maddow fans. If you are an activist liberal firebrand it’s probably not going to work out. In the real world Obama is a failure and everyone knows it. I can’t have you representing to the world otherwise. And what’s a good way to find this out? If I know you’ve posted 8,000 messages to TheBlaze.com, or Glenn Beck’s forums, if you’ve re-tweeted Rachael Maddow 500 times, those are great indicators you won’t fit in.</p></blockquote><p>How, precisely, can anyone reasonably argue with that? Conversely, if you are a true blue Real American in the Hannity sense, do you really want to be dependent upon the Maddow retweeter? Those of us whose views are already public have nothing to fear from this sort of thing because we already deal with it on a daily basis. Seeing the playing field leveled and applied to everyone on both sides hardly seems unfair.</p></div>",
  "content_text": "Not content with the crashing and burning of his political wise man act, Porky dives into the boiling oil again:\nPorky: I’m not surprised that the libertarians here are falling over themselves\nto praise the leftist for coming up with a hi-tech version of the Jew\nbadge. Funny how they hate the NSA for creating dossiers on citizens\nminding their own business, but they drool like Pavlov’s dog at the\nthought of being able to have a dossier on any complete stranger. As I’ve said previously, libertarians are the pupal stage of authoritarians.\nVD:\nAs we’ve all observed previously, you’re an idiot.\nPorky: Yet here you and the ilk are… giddily peeing your pants at the thought of spying on some stranger’s magazine subscriptions. ie:\nJosh, who never lets me forget that libertarians “just want to be left\nalone” yet salivates over the idea of an internet dossier on private\ncitizens.\nWhat Porky is clearly failing to take into account is that the system DH is creating is actually a technological recreation of the virtual one that is already in place in the government, in the universities, and in the big corporations.\nAll of the blackballing and stigmatizing goes only one way. The Left forcibly keeps those of the Right out of its organizations and institutions while the Right blithely permits leftists to infiltrate and suborn those that remain to it. The Right doesn’t realize this, in part because it keeps creating new ones, then losing control of them within a generation or two. Or sometimes, as in the case of Facebook, within a few weeks.\nOpposing the idea that small private companies should have the same ability to defend themselves from infiltration by their political enemies that the giant left-leaning institutions do is little different than advocating gun control for the people while the government and police remain armed.\nThe Right has very little to fear from the proposed service. Everyone who is even remotely outspoken is already banned from employment with many, perhaps even the majority of existing companies in America. The persecution is real, even though it is passive, reactive, and remarkably gentle in historical terms. Keep in mind that I have not only been expelled from the SFWA for a single tweet, (an infraction of the sort committed by no less than 60 other current members), but I have experienced contractors told by major NGO’s that they would lose their contracts if they continued to work with me. The Left is playing hardball while the Right isn’t even aware that the game has begun.\nSo, like the Jews of the European ghettos, we of the traditionalist Right have no choice but to work with each other since no one else wants us around. We have no choice but to work harder, to work smarter, and to make ourselves more valuable than those who persecute us. And we can do that, because working harder and smarter has always been our strength; we are the builders. But how can the ants hope to build up new institutions if the moment they begin to succeed, their organizations are infiltrated and co-opted by the grasshoppers who are opposed to everything they believe?\nWe need to know that the prospective employee is a self-appointed activist who boasts of having no morals and a predilection for attacking those with whom he disagrees. Pajamaboy is hardly going to bring that up when he’s applying for a job now, is he? We need to know that the girl trying to sell us computers is a fire-breathing Jezebelle who believes all sex is rape. We need to know that the professed libertarian is heavily partial to left-wing entertainment. We need to know that the student applying for seminary is a radical homosexual whose primary interest in the priesthood is access to altar boys.\nAbove all, we have to bypass the corporate gatekeepers and take our case directly to the people. We have to become the very populists they fear. They will call us names, they will call us Nazis, they will call us fascists, they will call us a hundred other names that don’t reasonably apply to us. That doesn’t matter, because we have two things on our side that will always triumph over their vast edifice of temporal power: our faith in God and our acknowledgement for objective Reality.\nAs always, Porky is arguing in favor of despair, surrender, and unilateral disarming on the part of the Right. Perhaps this is because he is short-sighted, perhaps this is because he is an agent provocateur, or perhaps he is simply an idiot. It doesn’t really matter, all that matters is that he is wrong.\nDH explains:\nI see this as exactly what VD is talking about. I can work really well with libertarians. I can work really well with populists. But I can’t work well with GOP true believers. If you spend your working day listening to Shawn Hannity and Rush Limbaugh and thinking they are the greatest thing ever, it’s over. We are not going to work well unless it is quite literally a work-for-hire remote employee contracted position. Same thing with Glenn Beck. If you are real Glenn Beck believer, it’s probably not going to work out. I certainly can’t have you interacting with my clients and risking going into hysterics about whatever he was talking about the radio today. Oddly, almost the same thing is true of Rachael Maddow fans. If you are an activist liberal firebrand it’s probably not going to work out. In the real world Obama is a failure and everyone knows it. I can’t have you representing to the world otherwise. And what’s a good way to find this out? If I know you’ve posted 8,000 messages to TheBlaze.com, or Glenn Beck’s forums, if you’ve re-tweeted Rachael Maddow 500 times, those are great indicators you won’t fit in.\nHow, precisely, can anyone reasonably argue with that? Conversely, if you are a true blue Real American in the Hannity sense, do you really want to be dependent upon the Maddow retweeter? Those of us whose views are already public have nothing to fear from this sort of thing because we already deal with it on a daily basis. Seeing the playing field leveled and applied to everyone on both sides hardly seems unfair.",
  "tags": [
    "corpocracy",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-05T11:18:00+00:00"
}