{
  "url": "https://voxday.net/2014/01/19/making-matters-worse/",
  "scraped_at": "2025-12-15T16:43:51.884015",
  "title": "Making matters worse",
  "date_display": "January 19, 2014",
  "date_iso": "2014-01-19T14:10:00+00:00",
  "date_from_url": "2014-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Shedlock explains how the Troika of the European Union-International Monetary Fund-European Central Bank have <a href=\"http://globaleconomicanalysis.blogspot.com/2014/01/syriza-surges-in-greek-polls-would-win.html\">made the Greek situation more than six times</a> worse by refusing to take their financial medicine five years ago:</p><blockquote class=\"tr_bq\"><p> Greece could have defaulted in 2009 with perhaps a €40-50 billion mess<br> to cleanup. In a foolish attempt to prevent contagion, the nannycrats<br> turned a relatively small mess into major €325 billion problem,<br> virtually assuring the contagion they set out to prevent. Expect to see much use of the word “contagion” in the coming months.</br></br></br></p></blockquote><p>One can’t help but notice that Spain, Italy, and, yes, Greece, are collectively responsible for guaranteeing 32.54 percent of the next Greek default. There would be your contagion vector. More debt is never the answer to a debt problem.</p></div>",
  "content_text": "Mike Shedlock explains how the Troika of the European Union-International Monetary Fund-European Central Bank have\nmade the Greek situation more than six times\nworse by refusing to take their financial medicine five years ago:\nGreece could have defaulted in 2009 with perhaps a €40-50 billion mess\nto cleanup. In a foolish attempt to prevent contagion, the nannycrats\nturned a relatively small mess into major €325 billion problem,\nvirtually assuring the contagion they set out to prevent. Expect to see much use of the word “contagion” in the coming months.\nOne can’t help but notice that Spain, Italy, and, yes, Greece, are collectively responsible for guaranteeing 32.54 percent of the next Greek default. There would be your contagion vector. More debt is never the answer to a debt problem.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-19T14:10:00+00:00"
}