{
  "url": "https://voxday.net/2014/01/10/more-highly-evolved/",
  "scraped_at": "2025-12-15T16:42:47.870730",
  "title": "More highly evolved",
  "date_display": "January 10, 2014",
  "date_iso": "2014-01-10T09:00:00+00:00",
  "date_from_url": "2014-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It should be interesting to see how those who are true believers in both a) the religion of TENS and b) the myth of human equality react to this scientific claim from Penn State that <a href=\"http://www.dailymail.co.uk/sciencetech/article-2535288/Light-skin-colour-Europeans-stems-ONE-ancestor-lived-India-Middle-East-10-000-years-ago.html#ixzz2pks14AUw\">Africans are less evolved than Europeans</a>:</p><blockquote class=\"tr_bq\"><p> Light skin in Europeans stems from a gene mutation from a single person who lived 10,000 years ago. This is according to a new U.S. study that claims the colour is due to an ancient ancestor who lived somewhere between the Middle East and the Indian subcontinent. Scientists made the discovery after identifying a key gene that contributes to lighter skin colour in Europeans.</p><p>In earlier research, Keith Cheng from Penn State College of Medicine reported that one amino acid difference in the gene SLC24A5 is a key contributor to the skin colour difference between Europeans and West Africans. ‘The mutation in SLC24A5 changes just one building block in the protein, and contributes about a third of the visually striking differences in skin tone between peoples of African and European ancestry,’ he said.</p></blockquote><p>We already know that the three major continental groups are not even equally human on the genetic level, with Africans being the only pure <i>homo sapiens sapiens</i>. This new claim indicates that Africans are lower in the evolutionary order, not that the skin color gene can be described as a speciation event. Regardless, one wonders why those who stubbornly, and ignorantly, continue to insist on human equality despite these undeniable genetic differences which are much more than skin deep are not yet tarred by the label “science denier”.</p><p>What I find amusing is that the scientists have already leaped in with some strained explanations to cram natural selection into the process when it is very clear from modern human behavior that the rapidity of the growth of the mutation would much more likely have stemmed from sexual selection. There need not be any environmental advantage to lighter skin for it to be preferred. Of course, that would also be a hate fact, as it would be scientific evidence that whites are more attractive than blacks. That being said, a fact is a fact.</p><p>However, that’s not the intriguing stuff. Here’s a much more interesting thought. The 10,000 year time frame is not all that far off from Bishop Usher’s famous 6,000 year estimation for the Age of the Earth. But most forget that the bishop’s estimate was based on Adam, not the Earth. So, what if it can eventually be determined that the single genetic mutation was actually an artificial one? That would certainly set the cat among the equality pigeons.</p></div>",
  "content_text": "It should be interesting to see how those who are true believers in both a) the religion of TENS and b) the myth of human equality react to this scientific claim from Penn State that\nAfricans are less evolved than Europeans\n:\nLight skin in Europeans stems from a gene mutation from a single person who lived 10,000 years ago. This is according to a new U.S. study that claims the colour is due to an ancient ancestor who lived somewhere between the Middle East and the Indian subcontinent. Scientists made the discovery after identifying a key gene that contributes to lighter skin colour in Europeans.\nIn earlier research, Keith Cheng from Penn State College of Medicine reported that one amino acid difference in the gene SLC24A5 is a key contributor to the skin colour difference between Europeans and West Africans. ‘The mutation in SLC24A5 changes just one building block in the protein, and contributes about a third of the visually striking differences in skin tone between peoples of African and European ancestry,’ he said.\nWe already know that the three major continental groups are not even equally human on the genetic level, with Africans being the only pure\nhomo sapiens sapiens\n. This new claim indicates that Africans are lower in the evolutionary order, not that the skin color gene can be described as a speciation event. Regardless, one wonders why those who stubbornly, and ignorantly, continue to insist on human equality despite these undeniable genetic differences which are much more than skin deep are not yet tarred by the label “science denier”.\nWhat I find amusing is that the scientists have already leaped in with some strained explanations to cram natural selection into the process when it is very clear from modern human behavior that the rapidity of the growth of the mutation would much more likely have stemmed from sexual selection. There need not be any environmental advantage to lighter skin for it to be preferred. Of course, that would also be a hate fact, as it would be scientific evidence that whites are more attractive than blacks. That being said, a fact is a fact.\nHowever, that’s not the intriguing stuff. Here’s a much more interesting thought. The 10,000 year time frame is not all that far off from Bishop Usher’s famous 6,000 year estimation for the Age of the Earth. But most forget that the bishop’s estimate was based on Adam, not the Earth. So, what if it can eventually be determined that the single genetic mutation was actually an artificial one? That would certainly set the cat among the equality pigeons.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-10T09:00:00+00:00"
}