{
  "url": "https://voxday.net/2014/01/03/mutual-assistance/",
  "scraped_at": "2025-12-15T16:42:07.549827",
  "title": "Mutual assistance",
  "date_display": "January 3, 2014",
  "date_iso": "2014-01-03T21:32:00+00:00",
  "date_from_url": "2014-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One thing most of you are going to have to understand is that the days of go along to get along are over. The Left is coming for you no matter what you do, no matter how careful you are to keep your head down and your mouth shut. One phrase I’m now seeing over and over again of late is an idea that was brought up often during the SFWA kerfluffle:</p><p>“Regardless of the reasons Kluwe was cut, if his description of Priefer’s<br> homophobic comments is accurate, then Priefer could (and should) face<br> NFL discipline. Open expressions of bigotry should have <b>no place</b> in the<br> NFL.”</br></br></br></p><p>“Hate speech, whether is it about race, gender or sexual preference has <b>no place</b> in any workplace.”</p><p>“I am a supporter of gay rights and equality.  I also think that Kluwe is<br> telling the truth about Priefer.  There is <b>no place</b> for a man like that<br> in any professional org.”</br></br></p><p>“Hate speech has <b>no place</b> in a work environment.”</p><p>And who defines bigotry and hate speech? Not you, that’s for sure. So, the Left can advocate the end of religion, the elimination of all Christians and anything else that they find desirable, and it will neither be considered hate nor bigotry, but if you even fail to show what is presently deemed sufficient enthusiasm for their latest insanity, there will be <b>no place</b> for you.</p><p>So, it is time to start making sure that there are places for you and for others like you who do not subscribe to the Left’s madness. DH’s new project is only one brick in a vast structure that will have to be built, because our predecessors failed us. To paraphrase the immortal words of Otter, they fucked up, they trusted the left. And now the left is running rampant through the institutions, just as Antonio Gramsci dreamed.</p><p>I received this email the other day from a self-described “Libertarian SQL Geek”</p><blockquote class=\"tr_bq\"><p> Vox, my current position will be eliminated in two weeks.  Yes, I’m being caught up in the Obamacare “we need to downsize to cover the costs of medical” rush. I view it as an opportunity.  If you have need of a database geek for projects, or know of anyone else in the who might have need of my services, please let me know, and feel free to pass my name along.</p></blockquote><p>If you’re looking for a SQL guy, email me and I’ll pass it along. And actually, if you’re looking for anyone, let me know and I’ll post it here.</p></div>",
  "content_text": "One thing most of you are going to have to understand is that the days of go along to get along are over. The Left is coming for you no matter what you do, no matter how careful you are to keep your head down and your mouth shut. One phrase I’m now seeing over and over again of late is an idea that was brought up often during the SFWA kerfluffle:\n“Regardless of the reasons Kluwe was cut, if his description of Priefer’s\nhomophobic comments is accurate, then Priefer could (and should) face\nNFL discipline. Open expressions of bigotry should have\nno place\nin the\nNFL.”\n“Hate speech, whether is it about race, gender or sexual preference has\nno place\nin any workplace.”\n“I am a supporter of gay rights and equality.  I also think that Kluwe is\ntelling the truth about Priefer.  There is\nno place\nfor a man like that\nin any professional org.”\n“Hate speech has\nno place\nin a work environment.”\nAnd who defines bigotry and hate speech? Not you, that’s for sure. So, the Left can advocate the end of religion, the elimination of all Christians and anything else that they find desirable, and it will neither be considered hate nor bigotry, but if you even fail to show what is presently deemed sufficient enthusiasm for their latest insanity, there will be\nno place\nfor you.\nSo, it is time to start making sure that there are places for you and for others like you who do not subscribe to the Left’s madness. DH’s new project is only one brick in a vast structure that will have to be built, because our predecessors failed us. To paraphrase the immortal words of Otter, they fucked up, they trusted the left. And now the left is running rampant through the institutions, just as Antonio Gramsci dreamed.\nI received this email the other day from a self-described “Libertarian SQL Geek”\nVox, my current position will be eliminated in two weeks.  Yes, I’m being caught up in the Obamacare “we need to downsize to cover the costs of medical” rush. I view it as an opportunity.  If you have need of a database geek for projects, or know of anyone else in the who might have need of my services, please let me know, and feel free to pass my name along.\nIf you’re looking for a SQL guy, email me and I’ll pass it along. And actually, if you’re looking for anyone, let me know and I’ll post it here.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-03T21:32:00+00:00"
}