{
  "url": "https://voxday.net/2014/01/07/protocols-of-learned-elders-of-wye/",
  "scraped_at": "2025-12-15T16:42:30.535575",
  "title": "Protocols of the Learned Elders of Wye",
  "date_display": "January 7, 2014",
  "date_iso": "2014-01-07T18:00:00+00:00",
  "date_from_url": "2014-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought this 2006 article on Haaretz by Shmuel Rosner<br> concerning a conference discussing <a href=\"http://www.haaretz.com/questions-of-survival-1.191164\">the survival of the Jewish people</a> was intriguing, both for what it suggested in terms of what the future holds in store for America as well as what it implied about the Jewish perception of the transience of their relationship with America:</br></p><blockquote class=\"tr_bq\"><p> Two groups of Jews gathered together last weekend<br> at Wye Plantation, Maryland for a long discussion on the situation of<br> the Jewish people. The first group, which met Wednesday and Thursday,<br> consisted of the heads of 15 Jewish organizations such as the<br> Presidents’ Conference, the American Israel Public Affairs Committee<br> (AIPAC), the Anti-Defamation League, the Union of Orthodox Jewish<br> Congregations, the American Jewish Committee and others. In the second<br> group were the “thinkers,” as the organizers termed them: Natan<br> Sharansky from Israel, Charles Krauthammer from The Washington Post,<br> former Canadian justice minister Irwin Cotler, former Jewish Agency head<br> Sallai Meridor and many others….</br></br></br></br></br></br></br></br></br></br></p><p>The fear expressed that “a real decline of the West,<br> particularly the United States, would have dramatic consequences for the<br> Jewish people,” also led to controversy. Brandeis University president<br> Jehuda Reinharz agreed that this type of decline can be expected “in the<br> coming two decades” – but Stuart Eisenstadt was less emphatic about it.<br> He believes the United States will remain the leading power. In all<br> events, it was agreed the Jews “should strengthen cultural links with<br> non-Western civilizations, particularly China and also India,” powers<br> that are on the ascent. This is not a question of preference or<br> closeness; it is a question of survival, of readiness for the future.</br></br></br></br></br></br></br></br></br></p></blockquote><p>I am very curious to know if there was any recognition that the observed decline of the West has any connection to a number of the policies that these organizations have supported for the last 50+ years? I also wonder why the targeted non-Western civilizations which are supposedly on the ascent, (raising some real questions about the participating economists given the ongoing Chinese meltdown), would be interested in stronger cultural links given the questionable consequences of those cultural links on the United States. The Indians might be amenable, but Chinese history suggests that the Han wouldn’t even blink before taking actions that would make Hitler look like a Righteous Gentile.</p><p>As an East Asian Studies major who is neither philo- nor antisemitic, I suggest the Elders of Wye might want to seriously rethink the potential of China as a safe landing place. Japan and Korea, too, are likely out.</p><p>The article tends to leave one with the unfortunate impression of rats congregating in order to contemplate the right time to leave a sinking ship. Or, to use a less ominous metaphor, magical golden geese who graciously convey manifold benefits and blessings on those with the courtesy to accept them discussing the right time to stop laying eggs and fly away before being greedily dissected. But regardless of whether one considers those discussing the timing of their exit as rats or golden geese. the mere fact that they are discussing the imminent sinking of the ship should be of no small concern to those who happen to be aboard it.</p><p>And before any philosemites feel led to cry holocaust, try to keep in mind that I didn’t forge the freaking article. If there is some non-pejorative way to view these discussions by a group of people actively making ready for an incipient American decline, by all means, feel free to share your interpretation. Regardless, it would be hard to deny that the conference participants do not see themselves as being a part of the American people.</p></div>",
  "content_text": "I thought this 2006 article on Haaretz by Shmuel Rosner\nconcerning a conference discussing\nthe survival of the Jewish people\nwas intriguing, both for what it suggested in terms of what the future holds in store for America as well as what it implied about the Jewish perception of the transience of their relationship with America:\nTwo groups of Jews gathered together last weekend\nat Wye Plantation, Maryland for a long discussion on the situation of\nthe Jewish people. The first group, which met Wednesday and Thursday,\nconsisted of the heads of 15 Jewish organizations such as the\nPresidents’ Conference, the American Israel Public Affairs Committee\n(AIPAC), the Anti-Defamation League, the Union of Orthodox Jewish\nCongregations, the American Jewish Committee and others. In the second\ngroup were the “thinkers,” as the organizers termed them: Natan\nSharansky from Israel, Charles Krauthammer from The Washington Post,\nformer Canadian justice minister Irwin Cotler, former Jewish Agency head\nSallai Meridor and many others….\nThe fear expressed that “a real decline of the West,\nparticularly the United States, would have dramatic consequences for the\nJewish people,” also led to controversy. Brandeis University president\nJehuda Reinharz agreed that this type of decline can be expected “in the\ncoming two decades” – but Stuart Eisenstadt was less emphatic about it.\nHe believes the United States will remain the leading power. In all\nevents, it was agreed the Jews “should strengthen cultural links with\nnon-Western civilizations, particularly China and also India,” powers\nthat are on the ascent. This is not a question of preference or\ncloseness; it is a question of survival, of readiness for the future.\nI am very curious to know if there was any recognition that the observed decline of the West has any connection to a number of the policies that these organizations have supported for the last 50+ years? I also wonder why the targeted non-Western civilizations which are supposedly on the ascent, (raising some real questions about the participating economists given the ongoing Chinese meltdown), would be interested in stronger cultural links given the questionable consequences of those cultural links on the United States. The Indians might be amenable, but Chinese history suggests that the Han wouldn’t even blink before taking actions that would make Hitler look like a Righteous Gentile.\nAs an East Asian Studies major who is neither philo- nor antisemitic, I suggest the Elders of Wye might want to seriously rethink the potential of China as a safe landing place. Japan and Korea, too, are likely out.\nThe article tends to leave one with the unfortunate impression of rats congregating in order to contemplate the right time to leave a sinking ship. Or, to use a less ominous metaphor, magical golden geese who graciously convey manifold benefits and blessings on those with the courtesy to accept them discussing the right time to stop laying eggs and fly away before being greedily dissected. But regardless of whether one considers those discussing the timing of their exit as rats or golden geese. the mere fact that they are discussing the imminent sinking of the ship should be of no small concern to those who happen to be aboard it.\nAnd before any philosemites feel led to cry holocaust, try to keep in mind that I didn’t forge the freaking article. If there is some non-pejorative way to view these discussions by a group of people actively making ready for an incipient American decline, by all means, feel free to share your interpretation. Regardless, it would be hard to deny that the conference participants do not see themselves as being a part of the American people.",
  "tags": [
    "Asia",
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-07T18:00:00+00:00"
}