{
  "url": "https://voxday.net/2014/01/10/puhutko-suomea/",
  "scraped_at": "2025-12-15T16:42:49.353702",
  "title": "Puhutko suomea?",
  "date_display": "January 10, 2014",
  "date_iso": "2014-01-10T14:00:00+00:00",
  "date_from_url": "2014-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><p><a href=\"http://1.bp.blogspot.com/xmbJHIpmD-NjTEFc973BjTtMPiW6fcESVetqqHe24r2O9jUDhvNr1c0bJLaM01jWYg=s1600\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://1.bp.blogspot.com/xmbJHIpmD-NjTEFc973BjTtMPiW6fcESVetqqHe24r2O9jUDhvNr1c0bJLaM01jWYg=s1600\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://1.bp.blogspot.com/xmbJHIpmD-NjTEFc973BjTtMPiW6fcESVetqqHe24r2O9jUDhvNr1c0bJLaM01jWYg=s1600\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>Thanks to the two translators and JartStar, the first two translated ebooks are now finished and will be released once the process of republishing my Selenoth and Quantum Mortis books is complete. The Finnish and Bahasa Indonesian versions of <i>A Magic Broken</i> will be released then, and I’m told there is a chance that the French version may be ready by then as well, depending upon how long it the process actually takes. Some of the books should enjoy broader distribution than they did as Hinterlands books, as we will be putting them into the Apple Store and other distribution outlets that hitherto went unaddressed.</p><p>Those who speak English and have no interest in the translations may, however, be interested to know that there will be a new English ebook released as well. (No, it isn’t TAODAL 2. That will be December with some luck and a strong tailwind.) I won’t say anything more about the new book for the time being, but if everything goes as planned, we should have the previous QM and Selenoth books, as well as the four new additions, all out and available by the end of the month. The seven other translations in the works will be published as they are completed; I am myself particularly fired up about the Wallisertiitsch translation of <i>Quantum Mortis:Gravity Kills.</i></p><p><a href=\"http://3.bp.blogspot.com/OWC5_tEymiqWPQ6AkJFaZXBMcLGADRiE5GA_6mmg1x_OaxTz_2nqrrSYjCmNwtBHxg=s1600\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://3.bp.blogspot.com/OWC5_tEymiqWPQ6AkJFaZXBMcLGADRiE5GA_6mmg1x_OaxTz_2nqrrSYjCmNwtBHxg=s1600\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://3.bp.blogspot.com/OWC5_tEymiqWPQ6AkJFaZXBMcLGADRiE5GA_6mmg1x_OaxTz_2nqrrSYjCmNwtBHxg=s1600\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>In the meantime, if you happen to speak either Finnish or Indonesian and you are willing to proofread the relevant ebook, please shoot me an email and let me know. I’m still looking for more translators too, so if your mother tongue is something other than English and you have been considering a new challenge in the new year, this might be an interesting one to tackle. It has certainly been fascinating for me to learn which  English idioms don’t translate well, and frankly, I am just a little shocked to have been informed of some of the Finnish quasi-equivalents. They are a naughty people.</p><p>UPDATE: Okay, I didn’t anticipate any problem finding a Finnish proofreader. But I was a little surprised to learn that there is more than one regular reader who is a native speaker of Bahasa Indonesia.</p></div>",
  "content_text": "Thanks to the two translators and JartStar, the first two translated ebooks are now finished and will be released once the process of republishing my Selenoth and Quantum Mortis books is complete. The Finnish and Bahasa Indonesian versions of\nA Magic Broken\nwill be released then, and I’m told there is a chance that the French version may be ready by then as well, depending upon how long it the process actually takes. Some of the books should enjoy broader distribution than they did as Hinterlands books, as we will be putting them into the Apple Store and other distribution outlets that hitherto went unaddressed.\nThose who speak English and have no interest in the translations may, however, be interested to know that there will be a new English ebook released as well. (No, it isn’t TAODAL 2. That will be December with some luck and a strong tailwind.) I won’t say anything more about the new book for the time being, but if everything goes as planned, we should have the previous QM and Selenoth books, as well as the four new additions, all out and available by the end of the month. The seven other translations in the works will be published as they are completed; I am myself particularly fired up about the Wallisertiitsch translation of\nQuantum Mortis:Gravity Kills.\nIn the meantime, if you happen to speak either Finnish or Indonesian and you are willing to proofread the relevant ebook, please shoot me an email and let me know. I’m still looking for more translators too, so if your mother tongue is something other than English and you have been considering a new challenge in the new year, this might be an interesting one to tackle. It has certainly been fascinating for me to learn which  English idioms don’t translate well, and frankly, I am just a little shocked to have been informed of some of the Finnish quasi-equivalents. They are a naughty people.\nUPDATE: Okay, I didn’t anticipate any problem finding a Finnish proofreader. But I was a little surprised to learn that there is more than one regular reader who is a native speaker of Bahasa Indonesia.",
  "tags": [
    "books",
    "Quantum Mortis",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-10T14:00:00+00:00"
}