{
  "url": "https://voxday.net/2014/01/20/richard-sherman-on-nfc-championship/",
  "scraped_at": "2025-12-15T16:43:58.854558",
  "title": "Richard Sherman on the NFC Championship",
  "date_display": "January 20, 2014",
  "date_iso": "2014-01-20T18:12:00+00:00",
  "date_from_url": "2014-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have no problem with his “outrageous” post-game interview. I wish more NFL players would simply say what they think. He’s a very good player, <a href=\"http://mmqb.si.com/2014/01/20/richard-sherman-interview-michael-crabtree/\">and like Sherman</a>, I still can’t believe Kaepernick chose that moment, of all moments, to throw in his direction:</p><blockquote class=\"tr_bq\"><p> Erin Andrews interviewed me after the game and I yelled what was obvious: If you put a subpar player across from a great one, most of the time you’re going to get one result. As far as Crabtree being a top-20 NFL receiver, you’d have a hard time making that argument to me. There are a lot of receivers playing good ball out there, and Josh Gordon needed 14 games to produce almost double what Crabtree can do in a full season. And Gordon had Brandon Weeden, Brian Hoyer and Jason Campbell playing quarterback.</p><p>But that’s not why I don’t like the man. It goes back to something he said to me this offseason in Arizona, but you’d have to ask him about that. A lot of what I said to Andrews was adrenaline talking, and some of that was Crabtree. I just don’t like him.</p><p>It was loud, it was in the moment, and it was just a small part of the<br> person I am. I don’t want to be a villain, because I’m not a villainous<br> person. When I say I’m the best cornerback in football, it’s with a<br> caveat: There isn’t a great defensive backfield in the NFL that doesn’t<br> have a great front seven. Everything begins with pressure up front, and<br> that’s what we get from our pass rushers every Sunday. To those who<br> would call me a thug or worse because I show passion on a football<br> field—don’t judge a person’s character by what they do between the<br> lines. Judge a man by what he does off the field, what he does for his<br> community, what he does for his family.</br></br></br></br></br></br></br></br></br></p></blockquote><p>I very much like the way he came out, refused to apologize or back down, and simply explained why he did what he did. Like him or hate him, approve or disapprove, Richard Sherman leaves one with no doubt that he is a man. How few men these days have the courage to avoid the passive-aggressive shots and simply state, in a forthright manner: I just don’t like him.</p><p>I’m no Seahawks fan, but I sure wouldn’t mind it if the Vikings had gotten him in the Percy Harvin trade.</p></div>",
  "content_text": "I have no problem with his “outrageous” post-game interview. I wish more NFL players would simply say what they think. He’s a very good player,\nand like Sherman\n, I still can’t believe Kaepernick chose that moment, of all moments, to throw in his direction:\nErin Andrews interviewed me after the game and I yelled what was obvious: If you put a subpar player across from a great one, most of the time you’re going to get one result. As far as Crabtree being a top-20 NFL receiver, you’d have a hard time making that argument to me. There are a lot of receivers playing good ball out there, and Josh Gordon needed 14 games to produce almost double what Crabtree can do in a full season. And Gordon had Brandon Weeden, Brian Hoyer and Jason Campbell playing quarterback.\nBut that’s not why I don’t like the man. It goes back to something he said to me this offseason in Arizona, but you’d have to ask him about that. A lot of what I said to Andrews was adrenaline talking, and some of that was Crabtree. I just don’t like him.\nIt was loud, it was in the moment, and it was just a small part of the\nperson I am. I don’t want to be a villain, because I’m not a villainous\nperson. When I say I’m the best cornerback in football, it’s with a\ncaveat: There isn’t a great defensive backfield in the NFL that doesn’t\nhave a great front seven. Everything begins with pressure up front, and\nthat’s what we get from our pass rushers every Sunday. To those who\nwould call me a thug or worse because I show passion on a football\nfield—don’t judge a person’s character by what they do between the\nlines. Judge a man by what he does off the field, what he does for his\ncommunity, what he does for his family.\nI very much like the way he came out, refused to apologize or back down, and simply explained why he did what he did. Like him or hate him, approve or disapprove, Richard Sherman leaves one with no doubt that he is a man. How few men these days have the courage to avoid the passive-aggressive shots and simply state, in a forthright manner: I just don’t like him.\nI’m no Seahawks fan, but I sure wouldn’t mind it if the Vikings had gotten him in the Percy Harvin trade.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-20T18:12:00+00:00"
}