{
  "url": "https://voxday.net/2014/01/08/rights-roundup_8/",
  "scraped_at": "2025-12-15T16:42:33.855480",
  "title": "Rights roundup",
  "date_display": "January 8, 2014",
  "date_iso": "2014-01-08T09:47:00+00:00",
  "date_from_url": "2014-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.absoluterights.com/thirty-years-of-gun-control-denial/\">30 Years of Gun Control Denial</a></b></p><p>Left-liberals often declare themselves to be on the side of fact and<br> reason. And yet, they show almost no interest whatsoever in the actual<br> facts when presented with them, especially when those facts contradict<br> liberal reasoning.</br></br></br></p><p> <b><a href=\"http://www.absoluterights.com/the-clueless-kluwe/\"> The Clueless Kluwe</a></b></p><p>I am, for my sins, a Minnesota Vikings fan. As one, I am more than a<br> little familiar with the ex-Vikings punter named Chris Kluwe, who in addition to giving up four punt returns for a<br> touchdown one season, has been an outspoken advocate of perverting the<br> sacrament of marriage. One year after being cut by the team and replaced<br> by a rookie punter at one-fourth the cost, Mr. Kluwe has penned an<br> outraged screed in which he claimed that he had unfairly lost his job<br> due to the actions of “two cowards and a bigot”.</br></br></br></br></br></br></p></div>",
  "content_text": "30 Years of Gun Control Denial\nLeft-liberals often declare themselves to be on the side of fact and\nreason. And yet, they show almost no interest whatsoever in the actual\nfacts when presented with them, especially when those facts contradict\nliberal reasoning.\nThe Clueless Kluwe\nI am, for my sins, a Minnesota Vikings fan. As one, I am more than a\nlittle familiar with the ex-Vikings punter named Chris Kluwe, who in addition to giving up four punt returns for a\ntouchdown one season, has been an outspoken advocate of perverting the\nsacrament of marriage. One year after being cut by the team and replaced\nby a rookie punter at one-fourth the cost, Mr. Kluwe has penned an\noutraged screed in which he claimed that he had unfairly lost his job\ndue to the actions of “two cowards and a bigot”.",
  "tags": [
    "Absolute Rights"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-08T09:47:00+00:00"
}