{
  "url": "https://voxday.net/2014/01/01/rights-roundup/",
  "scraped_at": "2025-12-15T16:41:53.044494",
  "title": "Rights roundup",
  "date_display": "January 1, 2014",
  "date_iso": "2014-01-01T18:00:00+00:00",
  "date_from_url": "2014-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.absoluterights.com/finding-climate-change/\">Finding Climate Change</a></b></p><p>There are some who doubt that God exists. They obviously haven’t been<br> paying much attention to the events at the South Pole, where the MV<br> Akademik Schokalskiy was carrying a group of true believers in the<br> gospel of Al Gore to document environmental changes there. For we now<br> know beyond any shadow of a doubt that God not only exists, but has a<br> rather puckish sense of humor.</br></br></br></br></br></p><p> <b><a href=\"http://www.absoluterights.com/its-official-racism-in-the-obama-regime/\">Racism in the Obama Regime</a></b></p><p>So it appears that despite my doubts, the so-called “Knockout Game”<br> exists after all. It turns out that it is a game of hate crime in which<br> young white thugs attempt to knock out innocent elderly black men.</br></br></p><p><a href=\"http://www.absoluterights.com/do-it-yourself-police/\"><br/></a><br> <b><a href=\"http://www.absoluterights.com/do-it-yourself-police/\">Do-It-Yourself Police</a></b></br></p><p>It should surprise no one that a county government would prefer to see<br> people hand them money and permit them to oversee the spending of it<br> than take matters, and responsibility, into their own hands. The entire<br> concept of “big government” is a socialistic one that depends entirely<br> on the idea that centralizing decision-making will inevitably lead to<br> better societal outcomes. The fact that this is much more often false<br> than it is true never even slows down those who benefit materially from<br> the structure from shamelessly attempting to push it on everyone.</br></br></br></br></br></br></br></p><p></p></div>",
  "content_text": "Finding Climate Change\nThere are some who doubt that God exists. They obviously haven’t been\npaying much attention to the events at the South Pole, where the MV\nAkademik Schokalskiy was carrying a group of true believers in the\ngospel of Al Gore to document environmental changes there. For we now\nknow beyond any shadow of a doubt that God not only exists, but has a\nrather puckish sense of humor.\nRacism in the Obama Regime\nSo it appears that despite my doubts, the so-called “Knockout Game”\nexists after all. It turns out that it is a game of hate crime in which\nyoung white thugs attempt to knock out innocent elderly black men.\nDo-It-Yourself Police\nIt should surprise no one that a county government would prefer to see\npeople hand them money and permit them to oversee the spending of it\nthan take matters, and responsibility, into their own hands. The entire\nconcept of “big government” is a socialistic one that depends entirely\non the idea that centralizing decision-making will inevitably lead to\nbetter societal outcomes. The fact that this is much more often false\nthan it is true never even slows down those who benefit materially from\nthe structure from shamelessly attempting to push it on everyone.",
  "tags": [
    "Absolute Rights"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-01T18:00:00+00:00"
}