{
  "url": "https://voxday.net/2014/01/07/scientific-evidence-that-gays-can-be/",
  "scraped_at": "2025-12-15T16:42:26.844489",
  "title": "Scientific evidence that gays can be cured",
  "date_display": "January 7, 2014",
  "date_iso": "2014-01-07T11:51:00+00:00",
  "date_from_url": "2014-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not really a matter for debate anymore. It is eminently obvious that <a href=\"http://www.latimes.com/science/sciencenow/la-sci-sn-gay-youth-research-jokesters-20140102,0,1949847.story#axzz2pOSSc9Hf\">gays can be cured</a>, and cure themselves, of their same-sex sexual orientations. Setting aside the obvious anecdotal examples, such as the new First Lady of New York City, the mutable nature of sexual orientation is statistically undeniable:</p><blockquote class=\"tr_bq\"><p> A controversial new study argues that a host of research on gay, lesbian and bisexual teenagers could be based on faulty data because of confused teens and “jokesters” who later said they were straight.</p><p>The report focuses on the National Longitudinal Study of Adolescent Health, a survey that followed a nationally representative group of tens of thousands of teens into adulthood. Add Health, as it is known, is considered one of the most important sources of data on the lives of young people, including those who are gay, lesbian and bisexual.</p><p>What caught the attention of Ritch Savin-Williams, a professor at Cornell University, was the fact that more than 70% of the teens who said they had ever had a “romantic attraction” to someone of the same sex later told researchers that they were straight.</p></blockquote><p>Sure, the “jokester” theory is one possible explanation. As is the hoary old “cultural stigma” concept, although that idea looks increasingly shaky as increased media acceptance has produced more gay suicides and other indications of serious psychological problems than the closet ever did. But unless we’re to assume that the vast majority of all self-reported homosexuals are fakes, (which would call into question many assumptions about the size and significance of the homosexual population), we must conclude that most youthful homosexuals eventually grow out of their sexual abnormalities.</p><p>Which is entirely understandable. Sex aside, how much Erasure can any man be expected to take?</p><p>It is readily observable that there is no such thing as a static sexual abnormality. Was Ian Watkins always a pedophile? Was the thrice-married Meredith Baxter Birney always a lesbian? The dynamic sin model explains observable human behavior rather better than most of the scientific alternatives, particularly the static ones. Regardless, whether it is a simple choice or a curable psychological disorder, the idea that homosexuality is always and necessarily a permanently fixed orientation is demonstrably false. Any homosexual who dares to question this, much less dispute it, must be asked why they deny science. And statistics.</p><p> UPDATE: This objection on Twitter made me laugh. Critics, it might help to keep in mind you’re dealing with a superintelligence before you say something stupid, all right? <i>I’m smarter than you are. </i>Just assume that even if you don’t believe it; it may save you some embarrassment. That doesn’t mean I’m always right, it just means that you’re probably wrong.</p><p>Buttercup Dew: <i>“Your logic doesn’t  follow? I was “bisexual” as a teen, now<br> unambiguously homosexual. You decided conclusion and worked backwards.”</br></i></p><p>To which I responded: “No, my logic is correct. You prove the point. The fact of the delta is what matters, not the direction.”</p></div>",
  "content_text": "It’s not really a matter for debate anymore. It is eminently obvious that\ngays can be cured\n, and cure themselves, of their same-sex sexual orientations. Setting aside the obvious anecdotal examples, such as the new First Lady of New York City, the mutable nature of sexual orientation is statistically undeniable:\nA controversial new study argues that a host of research on gay, lesbian and bisexual teenagers could be based on faulty data because of confused teens and “jokesters” who later said they were straight.\nThe report focuses on the National Longitudinal Study of Adolescent Health, a survey that followed a nationally representative group of tens of thousands of teens into adulthood. Add Health, as it is known, is considered one of the most important sources of data on the lives of young people, including those who are gay, lesbian and bisexual.\nWhat caught the attention of Ritch Savin-Williams, a professor at Cornell University, was the fact that more than 70% of the teens who said they had ever had a “romantic attraction” to someone of the same sex later told researchers that they were straight.\nSure, the “jokester” theory is one possible explanation. As is the hoary old “cultural stigma” concept, although that idea looks increasingly shaky as increased media acceptance has produced more gay suicides and other indications of serious psychological problems than the closet ever did. But unless we’re to assume that the vast majority of all self-reported homosexuals are fakes, (which would call into question many assumptions about the size and significance of the homosexual population), we must conclude that most youthful homosexuals eventually grow out of their sexual abnormalities.\nWhich is entirely understandable. Sex aside, how much Erasure can any man be expected to take?\nIt is readily observable that there is no such thing as a static sexual abnormality. Was Ian Watkins always a pedophile? Was the thrice-married Meredith Baxter Birney always a lesbian? The dynamic sin model explains observable human behavior rather better than most of the scientific alternatives, particularly the static ones. Regardless, whether it is a simple choice or a curable psychological disorder, the idea that homosexuality is always and necessarily a permanently fixed orientation is demonstrably false. Any homosexual who dares to question this, much less dispute it, must be asked why they deny science. And statistics.\nUPDATE: This objection on Twitter made me laugh. Critics, it might help to keep in mind you’re dealing with a superintelligence before you say something stupid, all right?\nI’m smarter than you are.\nJust assume that even if you don’t believe it; it may save you some embarrassment. That doesn’t mean I’m always right, it just means that you’re probably wrong.\nButtercup Dew:\n“Your logic doesn’t  follow? I was “bisexual” as a teen, now\nunambiguously homosexual. You decided conclusion and worked backwards.”\nTo which I responded: “No, my logic is correct. You prove the point. The fact of the delta is what matters, not the direction.”",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-07T11:51:00+00:00"
}