{
  "url": "https://voxday.net/2014/01/08/social-policies-have-long-ter/",
  "scraped_at": "2025-12-15T16:42:39.435913",
  "title": "Social policies have long-term consequences",
  "date_display": "January 8, 2014",
  "date_iso": "2014-01-08T20:13:00+00:00",
  "date_from_url": "2014-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That is Dr. Helen’s primary message in <i>Men on Strike</i>. <a href=\"http://www.forbes.com/sites/jerrybowyer/2014/01/08/men-are-on-strike-throughout-the-u-s-what-are-the-causes/\">She was interviewed by Jerry Bowyer</a> in Forbes.</p><blockquote class=\"tr_bq\"><p> <b>Jerry:</b> “It’s interesting – you mention Kay<br> Hymowitz’s book, which is in some ways similar to yours but in other<br> ways very different. Let’s not single her out in particular, but there<br> does tend to be a scold-y tone. Yeah, that’s really going to work with<br> men, right? There does tend to be a scold-y tone in a lot of the “what’s<br> wrong with men” vein, the “failure to launch”, “they’re not going to<br> college”, “they’re not participating in the economy” – a tone that seems<br> to (interestingly for liberals) place no obligation whatsoever or no<br> causal effect whatsoever on larger societal factors.”</br></br></br></br></br></br></br></br></p><p><b>Helen:</b> “I definitely think there is a scolding<br> factor and I think people are so used to shaming men, and that’s very<br> prevalent in the culture. I think that we see – I mean, there are so<br> many messages through the commercials, through the media, that men are<br> just no good. And so it’s just so easy to pick up and say that, “Yeah,<br> men are worthless. They’re not good fathers.” We’ve got so many messages<br> out there and I think that’s a really negative thing to be sending to<br> men and particularly young boys in schools and in society. Going back to<br> some of these books like End of Men or Manning Up, you’re right: the<br> message is basically, “You know what, you’re doing this because you’re<br> just an immature man.”</br></br></br></br></br></br></br></br></br></br></p><p>There’s a chapter in Hymowitz’s book about Child-Man in the Promised<br> Land and it’s looking at how men just have so many options and this is<br> why they’re doing what they’re doing. My point in my book is that men<br> are not going to participate in a society that is not going to reward<br> them for that behavior. In other words: if you’re a good father, a good<br> husband, and you do all of the things you’re supposed to do, society<br> still will go after you if you step out of line in any particular way.</br></br></br></br></br></br></p><p>In the old days, it was sort of like – fifty years ago a man was head<br> of household, looked up to, treated with respect, and now a married man<br> in many ways is seen as less of a man (not more of one) and it’s doubly<br> so if he has kids.</br></br></br></p></blockquote><p><i>Men on Strike</i> is a very good book, not so much because it contains anything that will be new to the readers here, but because it is putting those ideas in front of a lot of people who have never considered them before. And one of those things that many people haven’t seen before is what the Forbes writer describes as “a lack of scoldiness”; Dr. Helen is one of the few female writers on intersexual relations who is actually sympathetic towards men and understands that the world is not a zero-sum game where the sexes are concerned.</p><p>The fact that something is bad for men doesn’t mean that it is good for women.</p></div>",
  "content_text": "That is Dr. Helen’s primary message in\nMen on Strike\n.\nShe was interviewed by Jerry Bowyer\nin Forbes.\nJerry:\n“It’s interesting – you mention Kay\nHymowitz’s book, which is in some ways similar to yours but in other\nways very different. Let’s not single her out in particular, but there\ndoes tend to be a scold-y tone. Yeah, that’s really going to work with\nmen, right? There does tend to be a scold-y tone in a lot of the “what’s\nwrong with men” vein, the “failure to launch”, “they’re not going to\ncollege”, “they’re not participating in the economy” – a tone that seems\nto (interestingly for liberals) place no obligation whatsoever or no\ncausal effect whatsoever on larger societal factors.”\nHelen:\n“I definitely think there is a scolding\nfactor and I think people are so used to shaming men, and that’s very\nprevalent in the culture. I think that we see – I mean, there are so\nmany messages through the commercials, through the media, that men are\njust no good. And so it’s just so easy to pick up and say that, “Yeah,\nmen are worthless. They’re not good fathers.” We’ve got so many messages\nout there and I think that’s a really negative thing to be sending to\nmen and particularly young boys in schools and in society. Going back to\nsome of these books like End of Men or Manning Up, you’re right: the\nmessage is basically, “You know what, you’re doing this because you’re\njust an immature man.”\nThere’s a chapter in Hymowitz’s book about Child-Man in the Promised\nLand and it’s looking at how men just have so many options and this is\nwhy they’re doing what they’re doing. My point in my book is that men\nare not going to participate in a society that is not going to reward\nthem for that behavior. In other words: if you’re a good father, a good\nhusband, and you do all of the things you’re supposed to do, society\nstill will go after you if you step out of line in any particular way.\nIn the old days, it was sort of like – fifty years ago a man was head\nof household, looked up to, treated with respect, and now a married man\nin many ways is seen as less of a man (not more of one) and it’s doubly\nso if he has kids.\nMen on Strike\nis a very good book, not so much because it contains anything that will be new to the readers here, but because it is putting those ideas in front of a lot of people who have never considered them before. And one of those things that many people haven’t seen before is what the Forbes writer describes as “a lack of scoldiness”; Dr. Helen is one of the few female writers on intersexual relations who is actually sympathetic towards men and understands that the world is not a zero-sum game where the sexes are concerned.\nThe fact that something is bad for men doesn’t mean that it is good for women.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-08T20:13:00+00:00"
}