{
  "url": "https://voxday.net/2014/01/09/sparklepunter-retreats/",
  "scraped_at": "2025-12-15T16:42:43.094584",
  "title": "Sparklepunter retreats",
  "date_display": "January 9, 2014",
  "date_iso": "2014-01-09T14:00:00+00:00",
  "date_from_url": "2014-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The bravely outspoken Chris Kluwe is rapidly retreating from his<br> previous comments about the moral imperative to blackball Mike Priefer<br> and render him unemployable now that <a href=\"http://www.twincities.com/sports/ci_24841301/vikings-safety-harrison-smith-calls-chris-kluwes-comments?source=pkg\">current Vikings are speaking ou</a>t against him.</br></br></p><blockquote class=\"tr_bq\"><p> Harrison Smith came to the<br> defense of special-teams coordinator Mike Priefer on Friday, calling the<br> accusations made by former punter Chris Kluwe “a shame.”</br></br></p><p>As<br> a rookie in 2012, Smith said he attended many special-teams meetings<br> with Priefer and Kluwe. “In my experience with Coach Priefer, he has<br> been nothing but a<br> classy guy,” Smith said in a phone interview. “He’s been respectful for<br> everybody’s views, whether you’re black, white, Mexican, any religion.<br> … I just think it’s a shame to take a shot at a guy when he can’t<br> defend himself. I just don’t think it’s very fair that you can say<br> whatever you<br> want that somebody said something to you and you don’t really have any<br> person to back it up. I don’t think that’s good. I just think it’s a<br> slippery slope.”</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>The article also notes that Vikings kicker Blair<br> Walsh has also spoken publicly in defense of the special teams coach.<br> Underlying Sparklegate is the fact that there isn’t a single sane player<br> in the NFL who wants the league to get into the business of politically<br> policing the views of its players and its coaches. Even if Priefer did<br> say it would be a smashing idea to put all the gays on an island and<br> nuke it until it glows, not only is that his perfect right to express<br> his opinion, but I guarantee it is a more moderate view than that held<br> by many of the black players in the league. They’re not exactly what one<br> would call keen on “that sweet stuff”. Can’t be in there with that,<br> nah.</br></br></br></br></br></br></br></br></br></br></p><p>As an NCAA D1 sprinter, I competed against several<br> future NFL players. And believe me, merely being a) white, and b) under<br> 200 pounds was enough to provoke suspicious stares and the occasional<br> interrogation about your sexual preferences. From what I observed, elite<br> black athletes really do not like the “little white faggots” who<br> fetishize them.</br></br></br></br></br></p><p>Remember, the NFL does not only consist<br> of educated white coaches who speak in hyperbole. As politically<br> correct as the league is, it also has to be coldly realistic about the<br> possibility of groups of 75 IQ steroid-addled physical specimens<br> reacting to an inappropriate pass in the locker room by beating someone<br> to death. The Hernandez case is bad enough; like it or not, the NFL has<br> very good reasons for wanting to keep homosexuality tightly locked in<br> the closet and none of them involve religious white conservatives.</br></br></br></br></br></br></br></p><p>It appears Sparklepunter is finally beginning to realize just how deeply he has put his foot in it. If he doesn’t continue <a href=\"http://www.twincities.com/sports/ci_24872932/ex-viking-chris-kluwe-changed-mike-priefer-should\">to rapidly backtrack</a>, he’s going to come out of this looking more racist than a card-carrying Ku Klux Klan member.</p></div>",
  "content_text": "The bravely outspoken Chris Kluwe is rapidly retreating from his\nprevious comments about the moral imperative to blackball Mike Priefer\nand render him unemployable now that\ncurrent Vikings are speaking ou\nt against him.\nHarrison Smith came to the\ndefense of special-teams coordinator Mike Priefer on Friday, calling the\naccusations made by former punter Chris Kluwe “a shame.”\nAs\na rookie in 2012, Smith said he attended many special-teams meetings\nwith Priefer and Kluwe. “In my experience with Coach Priefer, he has\nbeen nothing but a\nclassy guy,” Smith said in a phone interview. “He’s been respectful for\neverybody’s views, whether you’re black, white, Mexican, any religion.\n… I just think it’s a shame to take a shot at a guy when he can’t\ndefend himself. I just don’t think it’s very fair that you can say\nwhatever you\nwant that somebody said something to you and you don’t really have any\nperson to back it up. I don’t think that’s good. I just think it’s a\nslippery slope.”\nThe article also notes that Vikings kicker Blair\nWalsh has also spoken publicly in defense of the special teams coach.\nUnderlying Sparklegate is the fact that there isn’t a single sane player\nin the NFL who wants the league to get into the business of politically\npolicing the views of its players and its coaches. Even if Priefer did\nsay it would be a smashing idea to put all the gays on an island and\nnuke it until it glows, not only is that his perfect right to express\nhis opinion, but I guarantee it is a more moderate view than that held\nby many of the black players in the league. They’re not exactly what one\nwould call keen on “that sweet stuff”. Can’t be in there with that,\nnah.\nAs an NCAA D1 sprinter, I competed against several\nfuture NFL players. And believe me, merely being a) white, and b) under\n200 pounds was enough to provoke suspicious stares and the occasional\ninterrogation about your sexual preferences. From what I observed, elite\nblack athletes really do not like the “little white faggots” who\nfetishize them.\nRemember, the NFL does not only consist\nof educated white coaches who speak in hyperbole. As politically\ncorrect as the league is, it also has to be coldly realistic about the\npossibility of groups of 75 IQ steroid-addled physical specimens\nreacting to an inappropriate pass in the locker room by beating someone\nto death. The Hernandez case is bad enough; like it or not, the NFL has\nvery good reasons for wanting to keep homosexuality tightly locked in\nthe closet and none of them involve religious white conservatives.\nIt appears Sparklepunter is finally beginning to realize just how deeply he has put his foot in it. If he doesn’t continue\nto rapidly backtrack\n, he’s going to come out of this looking more racist than a card-carrying Ku Klux Klan member.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-09T14:00:00+00:00"
}