{
  "url": "https://voxday.net/2014/01/08/tedious-remakes/",
  "scraped_at": "2025-12-15T16:42:35.731699",
  "title": "Tedious remakes",
  "date_display": "January 8, 2014",
  "date_iso": "2014-01-08T11:57:00+00:00",
  "date_from_url": "2014-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t usually find myself agreeing with third world Marxists who natter on about “neo-imperialist fantasies of power and domination”, but I have to admit, the man isn’t entirely wrong when he points out how <a href=\"http://www.nytimes.com/2014/01/12/books/review/james-bond-sherlock-holmes-hercule-poirot-why-do-we-keep-resurrecting-the-same-literary-characters.html?hpw&amp;rref=books\">taking a fictional work out of its historical milieu</a> often means sacrificing part of its heart and soul:</p><blockquote class=\"tr_bq\"><p> Shorn of their historical context, sequels and remakes today seem no<br> more than rebranding exercises in an age of socioeconomic crisis,<br> widespread uncertainty and creative stasis. Unlike most novelists, those<br> refurbishing James Bond or Philip Marlowe can count on a ready-made<br> store of readerly understanding and good will. As they do with the<br> numerous renderings of the Ramayana and Mahabharata in India and<br> Indonesia, audiences respond to familiarity spiced with the right<br> measure of novelty and strangeness. Such tickling of the mass<br> unconscious can be remunerative too: Unfocused nostalgia has a powerful<br> lure in postindustrial cultures that seem to have a recurrent present<br> but few clear traces of the past nor an avid anticipation of the future.</br></br></br></br></br></br></br></br></br></br></p><p>Naming the recent remakes of Bond  in his witty book “The Man Who Saved<br> Britain,” Simon Winder blurts out, “I’m sorry: I just can’t go on it’s<br> all so terrible. They’re roughly the same, come out at irregular<br> intervals and tend to have the word ‘Die’ in the title.” The<br> increasingly pained-looking Bond played by Daniel Craig seems to concur.</br></br></br></br></p><p>Britain is geopolitically too insignificant, and non-Western markets —<br> as well as political sensitivities — matter too much now for 007 to be<br> able to fulfill neo-imperialist fantasies of power and domination. The<br> artless seducer of women with names like Pussy Galore and Octopussy, a<br> man who once charmingly hoped for sex to have “the sweet tang of rape,”<br> also risks driving away a crucial demographic from the theaters. It is<br> surely a sign of the times that in “Skyfall” a non-misogynist Bond<br> retreats to his family estate in secession-minded Scotland, improbably<br> preoccupied with a childhood trauma after what seems to have been a<br> wholly unexamined life.</br></br></br></br></br></br></br></br></br></p></blockquote><p>As will become clear in the near future, I’m not intrinsically opposed to remakes. The new Star Trek movies are better than the originals in many ways, in fact, some of their worst aspects are their determination to insert callbacks to their predecessors. No doubt Trekkies found it totally sweet when whoever it was shouted “KHAAAAAAN” <i>just like the other guy did in the movie before him</i>. I just rolled my eyes.</p><p>Speaking as one who has created a new detective, (to the extent that Graven Tower can properly be considered a detective as opposed to a law enforcer who applies Arnaud Amalric’s approach to the detective arts), it’s understandable that many writers prefer to simply borrow existing characters. It’s much easier to lean on an existing store of known and well-loved characteristics than to try to create new ones.</p><p>One could even make a logical case for encouraging those who are better with plot and style to mine the public domain rather than inflict their cardboard creations on us. The problem is that many of those who are already characterization-challenged can’t seem to resist putting their inept skills to use, thereby transforming the characters we know and love into cheap parodies of themselves.</p><p>Sure, it’s not uninteresting to imagine what Holmes might be like if he lived today. But instead, we’re presented with alternative concepts, and asked to imagine what a character might be like if he wasn’t that character at all, but merely happened to be prone to utilizing the same catchphrases. Thus we have Watson transformed into an Asian woman and Holmes depicted as a gay vampire and all the deplorable host of modern politically correct(1) cliches that render most modern fiction so bloody tedious and unreadable.</p><p> <i>(1) “People forget that political correctness used to be called spastic gay talk.” – Frankie Boyle</i></p></div>",
  "content_text": "I don’t usually find myself agreeing with third world Marxists who natter on about “neo-imperialist fantasies of power and domination”, but I have to admit, the man isn’t entirely wrong when he points out how\ntaking a fictional work out of its historical milieu\noften means sacrificing part of its heart and soul:\nShorn of their historical context, sequels and remakes today seem no\nmore than rebranding exercises in an age of socioeconomic crisis,\nwidespread uncertainty and creative stasis. Unlike most novelists, those\nrefurbishing James Bond or Philip Marlowe can count on a ready-made\nstore of readerly understanding and good will. As they do with the\nnumerous renderings of the Ramayana and Mahabharata in India and\nIndonesia, audiences respond to familiarity spiced with the right\nmeasure of novelty and strangeness. Such tickling of the mass\nunconscious can be remunerative too: Unfocused nostalgia has a powerful\nlure in postindustrial cultures that seem to have a recurrent present\nbut few clear traces of the past nor an avid anticipation of the future.\nNaming the recent remakes of Bond  in his witty book “The Man Who Saved\nBritain,” Simon Winder blurts out, “I’m sorry: I just can’t go on it’s\nall so terrible. They’re roughly the same, come out at irregular\nintervals and tend to have the word ‘Die’ in the title.” The\nincreasingly pained-looking Bond played by Daniel Craig seems to concur.\nBritain is geopolitically too insignificant, and non-Western markets —\nas well as political sensitivities — matter too much now for 007 to be\nable to fulfill neo-imperialist fantasies of power and domination. The\nartless seducer of women with names like Pussy Galore and Octopussy, a\nman who once charmingly hoped for sex to have “the sweet tang of rape,”\nalso risks driving away a crucial demographic from the theaters. It is\nsurely a sign of the times that in “Skyfall” a non-misogynist Bond\nretreats to his family estate in secession-minded Scotland, improbably\npreoccupied with a childhood trauma after what seems to have been a\nwholly unexamined life.\nAs will become clear in the near future, I’m not intrinsically opposed to remakes. The new Star Trek movies are better than the originals in many ways, in fact, some of their worst aspects are their determination to insert callbacks to their predecessors. No doubt Trekkies found it totally sweet when whoever it was shouted “KHAAAAAAN”\njust like the other guy did in the movie before him\n. I just rolled my eyes.\nSpeaking as one who has created a new detective, (to the extent that Graven Tower can properly be considered a detective as opposed to a law enforcer who applies Arnaud Amalric’s approach to the detective arts), it’s understandable that many writers prefer to simply borrow existing characters. It’s much easier to lean on an existing store of known and well-loved characteristics than to try to create new ones.\nOne could even make a logical case for encouraging those who are better with plot and style to mine the public domain rather than inflict their cardboard creations on us. The problem is that many of those who are already characterization-challenged can’t seem to resist putting their inept skills to use, thereby transforming the characters we know and love into cheap parodies of themselves.\nSure, it’s not uninteresting to imagine what Holmes might be like if he lived today. But instead, we’re presented with alternative concepts, and asked to imagine what a character might be like if he wasn’t that character at all, but merely happened to be prone to utilizing the same catchphrases. Thus we have Watson transformed into an Asian woman and Holmes depicted as a gay vampire and all the deplorable host of modern politically correct(1) cliches that render most modern fiction so bloody tedious and unreadable.\n(1) “People forget that political correctness used to be called spastic gay talk.” – Frankie Boyle",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-08T11:57:00+00:00"
}