{
  "url": "https://voxday.net/2014/01/16/the-fading-first-amendmen/",
  "scraped_at": "2025-12-15T16:43:30.324723",
  "title": "The fading First Amendment",
  "date_display": "January 16, 2014",
  "date_iso": "2014-01-16T13:30:00+00:00",
  "date_from_url": "2014-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even the New York Times appears to be a little concerned about <a href=\"http://www.nytimes.com/2014/01/12/us/bloggers-incarceration-raises-first-amendment-questions.html?_r=0\">the incarceration of a blogger</a>:</p><blockquote class=\"tr_bq\"><p> For over six years, Roger Shuler has hounded figures of the state legal and political establishment on his blog, Legal Schnauzer, a hothouse of furious but often fuzzily sourced allegations of deep corruption and wide-ranging conspiracy. Some of these allegations he has tested in court, having sued his neighbor, his neighbor’s lawyer, his former employer, the Police Department, the Sheriff’s Department, the Alabama State Bar and two county circuit judges, among others. Mostly, he has lost.</p><p>But even those who longed for his muzzling, and there are many, did not see it coming like this: with Mr. Shuler sitting in jail indefinitely, and now on the list of imprisoned journalists worldwide kept by the Committee to Protect Journalists. There, in the company of jailed reporters in China, Iran and Egypt, is Mr. Shuler, the only person on the list in the Western Hemisphere.</p><p>A former sports reporter and a former employee in a university’s<br> publications department, Mr. Shuler, 57, was arrested in late October on<br> a contempt charge in connection with a defamation lawsuit filed by the<br> son of a former governor. The circumstances surrounding that arrest,<br> including a judge’s order that many legal experts described as<br> unconstitutional and behavior by Mr. Shuler that some of the same<br> experts described as self-defeating posturing, have made for an<br> exceptionally messy test of constitutional law….</br></br></br></br></br></br></br></p><p>On Nov. 14, the judge held a hearing, and Mr. Shuler, who was<br> representing himself, took the stand, insisting that the court had no<br> jurisdiction over him and calling the court a joke. The judge decided<br> that the hearing had “served as a trial on the merits” and made his<br> final ruling: Mr. Shuler was forbidden to publish anything about Mr.<br> Riley or Ms. Duke involving an affair, an abortion or payoffs; was to<br> pay them nearly $34,000 for legal fees; and was to remove the offending<br> posts or remain in jail.</br></br></br></br></br></br></br></p></blockquote><p>That didn’t take long. How long ago did the Left first start banging the drums about the need to ban “hate speech”. Ten years ago? And now we’re already seeing overtly political speech being banned in America. It’s only a judge’s action rather than a legislative act, but then, as we’ve learned from the examples of California and other states, it is the courts that now make the law, not the legislatures.</p><p>As per Barack Obama, the executive branch merely decides whether the government feels like implementing it or not.</p><p>The incarceration of Roger Shuler is merely one more example showing that there is not even the pretense of the rule of law in the USA anymore. The USA has devolved into a Maughamite state. Do what thou wilt is the whole of the law, with due regard for the federal agent around the corner.</p></div>",
  "content_text": "Even the New York Times appears to be a little concerned about\nthe incarceration of a blogger\n:\nFor over six years, Roger Shuler has hounded figures of the state legal and political establishment on his blog, Legal Schnauzer, a hothouse of furious but often fuzzily sourced allegations of deep corruption and wide-ranging conspiracy. Some of these allegations he has tested in court, having sued his neighbor, his neighbor’s lawyer, his former employer, the Police Department, the Sheriff’s Department, the Alabama State Bar and two county circuit judges, among others. Mostly, he has lost.\nBut even those who longed for his muzzling, and there are many, did not see it coming like this: with Mr. Shuler sitting in jail indefinitely, and now on the list of imprisoned journalists worldwide kept by the Committee to Protect Journalists. There, in the company of jailed reporters in China, Iran and Egypt, is Mr. Shuler, the only person on the list in the Western Hemisphere.\nA former sports reporter and a former employee in a university’s\npublications department, Mr. Shuler, 57, was arrested in late October on\na contempt charge in connection with a defamation lawsuit filed by the\nson of a former governor. The circumstances surrounding that arrest,\nincluding a judge’s order that many legal experts described as\nunconstitutional and behavior by Mr. Shuler that some of the same\nexperts described as self-defeating posturing, have made for an\nexceptionally messy test of constitutional law….\nOn Nov. 14, the judge held a hearing, and Mr. Shuler, who was\nrepresenting himself, took the stand, insisting that the court had no\njurisdiction over him and calling the court a joke. The judge decided\nthat the hearing had “served as a trial on the merits” and made his\nfinal ruling: Mr. Shuler was forbidden to publish anything about Mr.\nRiley or Ms. Duke involving an affair, an abortion or payoffs; was to\npay them nearly $34,000 for legal fees; and was to remove the offending\nposts or remain in jail.\nThat didn’t take long. How long ago did the Left first start banging the drums about the need to ban “hate speech”. Ten years ago? And now we’re already seeing overtly political speech being banned in America. It’s only a judge’s action rather than a legislative act, but then, as we’ve learned from the examples of California and other states, it is the courts that now make the law, not the legislatures.\nAs per Barack Obama, the executive branch merely decides whether the government feels like implementing it or not.\nThe incarceration of Roger Shuler is merely one more example showing that there is not even the pretense of the rule of law in the USA anymore. The USA has devolved into a Maughamite state. Do what thou wilt is the whole of the law, with due regard for the federal agent around the corner.",
  "tags": [
    "decline and fall",
    "law",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-16T13:30:00+00:00"
}