{
  "url": "https://voxday.net/2014/01/29/the-revolution-continues/",
  "scraped_at": "2025-12-15T16:44:49.061863",
  "title": "The revolution continues",
  "date_display": "January 29, 2014",
  "date_iso": "2014-01-29T16:25:00+00:00",
  "date_from_url": "2014-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/S%C3%A4rjetty-taika-Finnish-Vox-Day-ebook/dp/B00I3S8B8Y/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1391011186&amp;sr=1-1\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/01/AMB_FI_200.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/01/AMB_FI_200.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>I know some of you have been wondering when I was going to get my books back online. I think I’ve received between 35 and 50 emails informing me that the Amazon links were broken over the last month, which is always an intriguing lesson on the inefficient nature of transmitting information via blog posts. The process of changing over from Marcher Lord took a little longer than I’d hoped, but we are at last finally getting somewhere. And since it is based in Finland, it seems fitting that the new publisher, Castalia House, should launch with  <a href=\"http://www.amazon.com/S%C3%A4rjetty-taika-Finnish-Vox-Day-ebook/dp/B00I3S8B8Y/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1391011186&amp;sr=1-1\"><i><b>Särjetty taika</b></i></a>, the Finnish translation of <i>A Magic Broken</i>.</p><p>Särjetty taika on fantastinen tarina häikäilemättömyydestä, urheudesta<br> ja petollisuudesta. Novelli kertoo kapteeni Nicolas du Meren tarinan.<br> Hän on maanpaossa hänen kapinaan nousseen lordinsa kuoleman vuoksi. Se<br> kertoo myös Lodista, Dunmorin pojasta; rohkeasta kääpiöstä joka yrittää<br> pelastaa kääpiötoverinsa orjuudesta. Heidän vaaralliset polkunsa<br> kohtaavat, mutta tavalla joka on kaikkea muuta kuin ennalta-arvattava.</br></br></br></br></br></p><p><a href=\"http://www.amazon.com/QUANTUM-MORTIS-Gravity-Kills-Vox-ebook/dp/B00I41V7BI/ref=sr_1_2?s=books&amp;ie=UTF8&amp;qid=1391011186&amp;sr=1-2\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/01/QM_GK_200.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/01/QM_GK_200.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>We’d like to get a few Finnish reviews on Amazon, so if you speak Finnish and would like a review copy, please let me know. However, since the SF/F world doesn’t revolve around Helsinki, we have also published a number of the books in English today, including <a href=\"http://www.amazon.com/QUANTUM-MORTIS-Gravity-Kills-Vox-ebook/dp/B00I41V7BI/ref=sr_1_2?s=books&amp;ie=UTF8&amp;qid=1391011186&amp;sr=1-2\"><i><b>QUANTUM MORTIS: Gravity Kills</b></i></a>, <b><i><a href=\"http://www.amazon.com/Wardogs-Coin-Vox-Day-ebook/dp/B00I44ACHU/ref=sr_1_3?s=books&amp;ie=UTF8&amp;qid=1391011186&amp;sr=1-3\">The Wardog’s Coin</a></i></b>, and <i><b><a href=\"http://www.amazon.com/Last-Witchking-Vox-Day-ebook/dp/B00I45AE1I/ref=sr_1_4?s=books&amp;ie=UTF8&amp;qid=1391011186&amp;sr=1-4\">The Last Witchking</a></b></i>. The first four books are already live and the other books are in the works; most of them have already been uploaded to Amazon. I’m not sure why <i>QUANTUM MORTIS: A Man Disrupted</i> is not yet live, as it was the second book uploaded, but it appears there might be some technical conflict with the books that were published in print by Marcher Lord. But that should be resolved reasonably soon as Amazon has already acknowledged Marcher Lord’s unpublishing requests.</p><p>With a bit of luck and a tailwind, all the books should be live by the weekend with the possible exception of <i>Summa Elvetica and Other Stories</i> which hasn’t been created yet. Unfortunately, the process of transferring publishers appears to have caused the various reviews to disappeared. So, if you previously reviewed the books, or if you’ve read them but haven’t had the chance to get around to writing a review, I’d appreciate it if you’d consider taking the time to post a review again. I was told they would transfer over automatically, but that does not appear to be the case.</p><p>If you have any questions about Castalia House, please feel free to ask them here. My long-term expectation is that it will become a new model publisher and a key element in the Blue SF revolution. The publisher does intend to eventually publish other authors besides me, but please don’t send any inquiries in yet since we still have our hands full getting all of my books into print as well as publishing the various translated versions. Unfortunately, Amazon does not support Bahasa Indonesian or we would be publishing <i>Mantra yang Rusak</i> today as well.</p><p>But, if you’re interested in getting involved, as a slush reader, a translator, a blogger, or in some other way we haven’t anticipated, don’t hesitate to let me know. We haven’t even begun to put the web site together yet, as our first priority was to get the books online again. We have a long way to go to tear down the walls and towers of Pink SF, but we fully intend on having a good time in the process. After all, what is the point of sacking and pillaging if you’re not going to enjoy it?</p></div>",
  "content_text": "I know some of you have been wondering when I was going to get my books back online. I think I’ve received between 35 and 50 emails informing me that the Amazon links were broken over the last month, which is always an intriguing lesson on the inefficient nature of transmitting information via blog posts. The process of changing over from Marcher Lord took a little longer than I’d hoped, but we are at last finally getting somewhere. And since it is based in Finland, it seems fitting that the new publisher, Castalia House, should launch with\nSärjetty taika\n, the Finnish translation of\nA Magic Broken\n.\nSärjetty taika on fantastinen tarina häikäilemättömyydestä, urheudesta\nja petollisuudesta. Novelli kertoo kapteeni Nicolas du Meren tarinan.\nHän on maanpaossa hänen kapinaan nousseen lordinsa kuoleman vuoksi. Se\nkertoo myös Lodista, Dunmorin pojasta; rohkeasta kääpiöstä joka yrittää\npelastaa kääpiötoverinsa orjuudesta. Heidän vaaralliset polkunsa\nkohtaavat, mutta tavalla joka on kaikkea muuta kuin ennalta-arvattava.\nWe’d like to get a few Finnish reviews on Amazon, so if you speak Finnish and would like a review copy, please let me know. However, since the SF/F world doesn’t revolve around Helsinki, we have also published a number of the books in English today, including\nQUANTUM MORTIS: Gravity Kills\n,\nThe Wardog’s Coin\n, and\nThe Last Witchking\n. The first four books are already live and the other books are in the works; most of them have already been uploaded to Amazon. I’m not sure why\nQUANTUM MORTIS: A Man Disrupted\nis not yet live, as it was the second book uploaded, but it appears there might be some technical conflict with the books that were published in print by Marcher Lord. But that should be resolved reasonably soon as Amazon has already acknowledged Marcher Lord’s unpublishing requests.\nWith a bit of luck and a tailwind, all the books should be live by the weekend with the possible exception of\nSumma Elvetica and Other Stories\nwhich hasn’t been created yet. Unfortunately, the process of transferring publishers appears to have caused the various reviews to disappeared. So, if you previously reviewed the books, or if you’ve read them but haven’t had the chance to get around to writing a review, I’d appreciate it if you’d consider taking the time to post a review again. I was told they would transfer over automatically, but that does not appear to be the case.\nIf you have any questions about Castalia House, please feel free to ask them here. My long-term expectation is that it will become a new model publisher and a key element in the Blue SF revolution. The publisher does intend to eventually publish other authors besides me, but please don’t send any inquiries in yet since we still have our hands full getting all of my books into print as well as publishing the various translated versions. Unfortunately, Amazon does not support Bahasa Indonesian or we would be publishing\nMantra yang Rusak\ntoday as well.\nBut, if you’re interested in getting involved, as a slush reader, a translator, a blogger, or in some other way we haven’t anticipated, don’t hesitate to let me know. We haven’t even begun to put the web site together yet, as our first priority was to get the books online again. We have a long way to go to tear down the walls and towers of Pink SF, but we fully intend on having a good time in the process. After all, what is the point of sacking and pillaging if you’re not going to enjoy it?",
  "tags": [
    "books",
    "Quantum Mortis",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-29T16:25:00+00:00"
}