{
  "url": "https://voxday.net/2014/01/03/the-idiot-punter/",
  "scraped_at": "2025-12-15T16:42:05.722450",
  "title": "The idiot punter",
  "date_display": "January 3, 2014",
  "date_iso": "2014-01-03T18:00:00+00:00",
  "date_from_url": "2014-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Many people are rightly responding contemptuously to the hypocritical, self-serving, and poisonous article that Chris Kluwe wrote on Deadspin, in which he called one of the top special teams coaches in the NFL a “bigot” and called Leslie Frazier and Rick Spielman “cowards”. What a lot of people don’t know is that Kluwe also called Peyton Manning, Drew Brees, Logan Mankins and Vincent Jackson “douchebags” <a href=\"http://coedbc.files.wordpress.com/2011/07/kluwe1.jpg?w=600&amp;h=281\">back in 2011</a>. He is a nasty little piece of work.</p><p>Now <a href=\"http://deadspin.com/i-was-an-nfl-player-until-i-was-fired-by-two-cowards-an-1493208214/@johncook\">he’s spewing venom in public</a> about the fact that he lost his job not because he was an overpriced, mediocre punter who finished 22nd in the league, cost more than 4 times more than his replacement, and then lost his job again when he was beaten out by a rookie in Oakland, but because Mike Priefer is a bigot. Seriously. And yet, who would you rather pay $1.63 million for the season, Kluwe’s salary or the cumulative salaries of Jeff Locke, (whose 2013 punting stats were nearly identical to Kluwe’s 2012 stats), Blair Walsh, (one of the best kickers in the league), Cordarrelle Patterson, (All-Pro WR with a legitimate claim to offensive rookie of the year), and Xavier Rhodes, (a mediocre, but improving cornerback).</p><blockquote class=\"tr_bq\"><p> It’s my belief, based on everything that happened over the course of<br> 2012, that I was fired by Mike Priefer, a bigot who didn’t agree with<br> the cause I was working for, and two cowards, Leslie Frazier and Rick<br> Spielman, both of whom knew I was a good punter and would remain a good<br> punter for the foreseeable future, as my numbers over my eight-year<br> career had shown, but who lacked the fortitude to disagree with Mike<br> Priefer on a touchy subject matter.</br></br></br></br></br></br></p></blockquote><p>That’s quite the sentence there. He doesn’t write any better than he punted. If you cut through all the cheap shots and name-calling, Kluwe is saying that he believes he was fired. This is news? We all know he was cut and justifiably so. He wasn’t terrible, but he wasn’t a particularly good punter either. He also had a serious downside; going back to 2002, no punter in the league gave up more return touchdowns than Kluwe. In fact, in the last 384 team seasons, not a single team gave up as many punt return touchdowns as the four (4!) that Kluwe did in 2008. Among Vikings fans, Kluwe was much less notorious for his mouth than for frequently outkicking the punt coverage and kicking untimely touchbacks when the team had the chance to pin the opponent deep in its own end.</p><p>I saw every game in which he punted and at no point did I think it was surprising that Kluwe lost his job. There were fans who wanted to get rid of him after 2008 and 2010. Was it surprising that the Vikings drafted Jeff Locke in the 5th round? Sure, but not as surprising as drafting Christian Ponder in the 1st round or the Jaguars drafting Bryan Anger in the 3rd round. Don’t forget that a few months later Kluwe lost the Oakland job to an undrafted free agent, Marquette King. We’re not talking about Ray Guy here, or even Andy Lee.</p><p>Furthermore, Kluwe is actually dumb enough to argue that the Vikings would have been fully justified to cut him for his immoral beliefs:</p><blockquote class=\"tr_bq\"><p> If there’s one thing I hope to achieve from sharing this story, it’s to make sure that Mike Priefer never holds a coaching position again in the NFL, and ideally never coaches at any level. (According to the Pioneer Press, he is “the only in-house candidate with a chance” at the head-coaching job.) It’s inexcusable that someone would use his status as a teacher and a role model to proselytize on behalf of his own doctrine of intolerance, and I hope he never gets another opportunity to pass his example along to anyone else.</p></blockquote><p>In other words, Kluwe thinks it is absolutely fine to deprive someone of a livelihood on the basis of their beliefs. So, what is he complaining about then? If employers have the right to fire people for their beliefs, then the Vikings’ coaches were right to cut Kluwe. If they do not and the coaches were wrong to cut Kluwe, then how can he possibly call for Mike Priefer, who coached the Vikings special teams to fifth and sixth-place DVOA rankings in 2012 and 2013, to never again hold a coaching position at any level. If the NFL is going to take such a radical pro-homosexual position, it had better realize it is going to lose most of its fans.</p><p>As the Vikings themselves stated: <i>“Any notion that Chris was released from our football team due to his<br> stance on marriage equality is entirely inaccurate and inconsistent with<br> team policy. Chris was released strictly based on his football<br> performance.”</br></br></br></i></p><p>Kluwe is the scrawny, shrewish public face of left-wing totalitarianism. He demonstrates how if you permit a leftist into your organization, he will attempt to destroy you if you do not allow him to dictate your actions, your words, and even your thoughts. Obviously, by Kluwe’s own standards, he should never have been permitted to play in the NFL in the first place.</p><p>Just shut up and go away, Kluwe. We Vikings fans never thought much of you anyhow.</p></div>",
  "content_text": "Many people are rightly responding contemptuously to the hypocritical, self-serving, and poisonous article that Chris Kluwe wrote on Deadspin, in which he called one of the top special teams coaches in the NFL a “bigot” and called Leslie Frazier and Rick Spielman “cowards”. What a lot of people don’t know is that Kluwe also called Peyton Manning, Drew Brees, Logan Mankins and Vincent Jackson “douchebags”\nback in 2011\n. He is a nasty little piece of work.\nNow\nhe’s spewing venom in public\nabout the fact that he lost his job not because he was an overpriced, mediocre punter who finished 22nd in the league, cost more than 4 times more than his replacement, and then lost his job again when he was beaten out by a rookie in Oakland, but because Mike Priefer is a bigot. Seriously. And yet, who would you rather pay $1.63 million for the season, Kluwe’s salary or the cumulative salaries of Jeff Locke, (whose 2013 punting stats were nearly identical to Kluwe’s 2012 stats), Blair Walsh, (one of the best kickers in the league), Cordarrelle Patterson, (All-Pro WR with a legitimate claim to offensive rookie of the year), and Xavier Rhodes, (a mediocre, but improving cornerback).\nIt’s my belief, based on everything that happened over the course of\n2012, that I was fired by Mike Priefer, a bigot who didn’t agree with\nthe cause I was working for, and two cowards, Leslie Frazier and Rick\nSpielman, both of whom knew I was a good punter and would remain a good\npunter for the foreseeable future, as my numbers over my eight-year\ncareer had shown, but who lacked the fortitude to disagree with Mike\nPriefer on a touchy subject matter.\nThat’s quite the sentence there. He doesn’t write any better than he punted. If you cut through all the cheap shots and name-calling, Kluwe is saying that he believes he was fired. This is news? We all know he was cut and justifiably so. He wasn’t terrible, but he wasn’t a particularly good punter either. He also had a serious downside; going back to 2002, no punter in the league gave up more return touchdowns than Kluwe. In fact, in the last 384 team seasons, not a single team gave up as many punt return touchdowns as the four (4!) that Kluwe did in 2008. Among Vikings fans, Kluwe was much less notorious for his mouth than for frequently outkicking the punt coverage and kicking untimely touchbacks when the team had the chance to pin the opponent deep in its own end.\nI saw every game in which he punted and at no point did I think it was surprising that Kluwe lost his job. There were fans who wanted to get rid of him after 2008 and 2010. Was it surprising that the Vikings drafted Jeff Locke in the 5th round? Sure, but not as surprising as drafting Christian Ponder in the 1st round or the Jaguars drafting Bryan Anger in the 3rd round. Don’t forget that a few months later Kluwe lost the Oakland job to an undrafted free agent, Marquette King. We’re not talking about Ray Guy here, or even Andy Lee.\nFurthermore, Kluwe is actually dumb enough to argue that the Vikings would have been fully justified to cut him for his immoral beliefs:\nIf there’s one thing I hope to achieve from sharing this story, it’s to make sure that Mike Priefer never holds a coaching position again in the NFL, and ideally never coaches at any level. (According to the Pioneer Press, he is “the only in-house candidate with a chance” at the head-coaching job.) It’s inexcusable that someone would use his status as a teacher and a role model to proselytize on behalf of his own doctrine of intolerance, and I hope he never gets another opportunity to pass his example along to anyone else.\nIn other words, Kluwe thinks it is absolutely fine to deprive someone of a livelihood on the basis of their beliefs. So, what is he complaining about then? If employers have the right to fire people for their beliefs, then the Vikings’ coaches were right to cut Kluwe. If they do not and the coaches were wrong to cut Kluwe, then how can he possibly call for Mike Priefer, who coached the Vikings special teams to fifth and sixth-place DVOA rankings in 2012 and 2013, to never again hold a coaching position at any level. If the NFL is going to take such a radical pro-homosexual position, it had better realize it is going to lose most of its fans.\nAs the Vikings themselves stated:\n“Any notion that Chris was released from our football team due to his\nstance on marriage equality is entirely inaccurate and inconsistent with\nteam policy. Chris was released strictly based on his football\nperformance.”\nKluwe is the scrawny, shrewish public face of left-wing totalitarianism. He demonstrates how if you permit a leftist into your organization, he will attempt to destroy you if you do not allow him to dictate your actions, your words, and even your thoughts. Obviously, by Kluwe’s own standards, he should never have been permitted to play in the NFL in the first place.\nJust shut up and go away, Kluwe. We Vikings fans never thought much of you anyhow.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-03T18:00:00+00:00"
}