{
  "url": "https://voxday.net/2014/01/21/the-fifth-horseman-9/",
  "scraped_at": "2025-12-15T16:44:02.677356",
  "title": "The Fifth Horseman 9",
  "date_display": "January 21, 2014",
  "date_iso": "2014-01-21T14:00:00+00:00",
  "date_from_url": "2014-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>ANTI-APOLOGETIC #9 </b></p><blockquote class=\"tr_bq\"><p> <i>“Life has no meaning without faith.”</i></p><p>This is a remarkably common statement, although I’m not sure how this is a defense of faith. This is a statement about the consequences of faith as opposed to whether or not one’s faith latches onto truth. Many people allege that their lives would be meaningless and that they’d have no life purpose without faith.</p><p>If life has no meaning for someone unless they pretend to know something they don’t know, then I would strongly and sincerely urge extensive therapy and counseling. This is particularly true if feelings of meaninglessness and lack of purpose lead to depression, which is a serious illness. Absent a mental disorder, or head trauma, there is no reason an adult should feel life is meaningless without maintaining some form of delusion.</p><p>When I hear someone say, “Life has no meaning without faith,” I suggest possible sources of meaning one could find in one’s life: children, music, art, poetry, charity, reading, hobbies, simply trying to make the world a better place, small acts of kindness, etc. I usually try to tailor the source of meaning to the person with whom I’m speaking. I also talk about our daughter who was adopted from China as a “waiting child.” I discuss the meaning and joy she’s brought into our lives.</p><p>The overwhelming majority of people will acknowledge that they can find sources of meaning in their lives. For those who don’t, I sincerely recommend seeking professional psychological services.</p></blockquote><p>Being of the Austrian School of Economics, if only as a heretic, I dislike like this line of reasoning. The fact that you happen to find meaning in your religious faith says nothing about where other people happen to find it or not. But the fact that it is not a very good argument doesn’t mean we can’t tear apart Boghossian’s terrible response to it, because he isn’t merely content to point out the argument’s flaws, but tries to use it to suggest that faith is a mental illness.<b><br/></b></p><p><b>VD RESPONSE:</b> Who are you to say what does, or does not, have meaning for someone else? That is a fundamental violation of the first principle of human action, which states that acting man alone can provide the meaning for his actions. How can you reasonably say that it is impossible for religious faith, which numerous scientific studies have shown to have material benefits for people, to serve as a legitimate source of meaning on the same basis as the other possibilities you suggest?</p><p>You favor a scientific approach, so let’s look at your own claimed source of meaning from a scientific perspective. You claim to derive meaning from a nonexistent “daughter”. You are pretending that she is your child when you know perfectly well that she is not. How can you possibly claim to find meaning in a child who has no genetic relationship to you whatsoever? Such a claim is clearly delusional. Do you also find sources of meaning in random children in Vietnam, Nigeria, and Papua New Guinea? Or is this source of meaning only derived from magic little Chinese girls? You should probably seek professional psychological services for your delusions about your imaginary friends and offspring.</p><p><b>ANTI-APOLOGETIC #10</b></p><blockquote class=\"tr_bq\"><p> <i>“Why take away faith if it helps get people through the day?”</i></p><p>This is a common line among blue-collar liberals who’ve not been indoctrinated by leftist academic values.  I’ve never really understood how removing a bad way to reason will make it difficult to get through the day. If anything, it would seem that correcting someone’s reasoning would significantly increase their chances of getting through the day. With reliable forms of reasoning comes the capability of crafting conditions that enable people to navigate life’s obstacles. By using a more reliable form of reasoning, people are more capable of bringing about conditions that enable them to flourish.</p><p>Another interpretation of this statement is that it’s the contents of one’s beliefs that help people cope. For example, if one believes a recently deceased loved one has gone to the Happy Hunting Ground (a belief found among certain Native American tribes) where the wild game is in abundance, this makes it easier to deal with that person’s passing. However, if one used sound methods of reasoning one would produce better results and feel more in control of one’s life than unreflectively buying into a commonly held belief about what happens after death. One would thus rely less on the content of one’s beliefs and more on the process one uses to arrive at one’s beliefs.</p><p>To argue that people need faith is to abandon hope, and to condescend and accuse the faithful of being incapable of understanding the importance of reason and rationality. There are better and worse ways to come to terms with death, to find strength during times of crisis, to make meaning and purpose in our lives, to interpret our sense of awe and wonder, and to contribute to human well-being—and the faithful are completely capable of understanding and achieving this.</p></blockquote><p><b>VD RESPONSE: </b>You’re appealing to your own inability to understand again, and let’s face it, an appeal to Asperger’s Syndrome is an epistemology that is doomed to inevitable failure. Let’s consider that Chinese girl who lives in your house. Let’s suppose she was not a Chinese adoptee, but an Armenian one who looked like you, and she firmly believed that she was your real, biological daughter. Would telling her that she was adopted <i>necessarily </i>make it easier for her to get through the day? Isn’t at least possible that it would make it harder for her?</p><p>If you understand that, then you are perfectly capable of understanding how even a false belief can be emotionally and materially beneficial to an individual. The mere existence of nihilist philosophy is sufficient to shred your false claim that “if one used sound methods of reasoning one would produce better results and feel more in control of one’s life.” The historical fact is that sound methods of reasoning can be, and have been, utilized to justify everything from suicide to genocide.</p><p>Faith is not the abandonment of hope. Quite to the contrary, faith is an act of hope; it is an axiomatic choice upon which one’s future actions will depend. The faithful understand the importance of reason and rationality much better than you do, because they understand reason and rationality are intellectual tools that can harm as well as heal. They understand, as you do not, that reason and rationality are tools, they are neither imperatives nor objectives.</p><p>You commit a category error when you make a reason an imperative, and ironically, in doing so, you demonstrate your inferior capacity for it.</p></div>",
  "content_text": "ANTI-APOLOGETIC #9\n“Life has no meaning without faith.”\nThis is a remarkably common statement, although I’m not sure how this is a defense of faith. This is a statement about the consequences of faith as opposed to whether or not one’s faith latches onto truth. Many people allege that their lives would be meaningless and that they’d have no life purpose without faith.\nIf life has no meaning for someone unless they pretend to know something they don’t know, then I would strongly and sincerely urge extensive therapy and counseling. This is particularly true if feelings of meaninglessness and lack of purpose lead to depression, which is a serious illness. Absent a mental disorder, or head trauma, there is no reason an adult should feel life is meaningless without maintaining some form of delusion.\nWhen I hear someone say, “Life has no meaning without faith,” I suggest possible sources of meaning one could find in one’s life: children, music, art, poetry, charity, reading, hobbies, simply trying to make the world a better place, small acts of kindness, etc. I usually try to tailor the source of meaning to the person with whom I’m speaking. I also talk about our daughter who was adopted from China as a “waiting child.” I discuss the meaning and joy she’s brought into our lives.\nThe overwhelming majority of people will acknowledge that they can find sources of meaning in their lives. For those who don’t, I sincerely recommend seeking professional psychological services.\nBeing of the Austrian School of Economics, if only as a heretic, I dislike like this line of reasoning. The fact that you happen to find meaning in your religious faith says nothing about where other people happen to find it or not. But the fact that it is not a very good argument doesn’t mean we can’t tear apart Boghossian’s terrible response to it, because he isn’t merely content to point out the argument’s flaws, but tries to use it to suggest that faith is a mental illness.\nVD RESPONSE:\nWho are you to say what does, or does not, have meaning for someone else? That is a fundamental violation of the first principle of human action, which states that acting man alone can provide the meaning for his actions. How can you reasonably say that it is impossible for religious faith, which numerous scientific studies have shown to have material benefits for people, to serve as a legitimate source of meaning on the same basis as the other possibilities you suggest?\nYou favor a scientific approach, so let’s look at your own claimed source of meaning from a scientific perspective. You claim to derive meaning from a nonexistent “daughter”. You are pretending that she is your child when you know perfectly well that she is not. How can you possibly claim to find meaning in a child who has no genetic relationship to you whatsoever? Such a claim is clearly delusional. Do you also find sources of meaning in random children in Vietnam, Nigeria, and Papua New Guinea? Or is this source of meaning only derived from magic little Chinese girls? You should probably seek professional psychological services for your delusions about your imaginary friends and offspring.\nANTI-APOLOGETIC #10\n“Why take away faith if it helps get people through the day?”\nThis is a common line among blue-collar liberals who’ve not been indoctrinated by leftist academic values.  I’ve never really understood how removing a bad way to reason will make it difficult to get through the day. If anything, it would seem that correcting someone’s reasoning would significantly increase their chances of getting through the day. With reliable forms of reasoning comes the capability of crafting conditions that enable people to navigate life’s obstacles. By using a more reliable form of reasoning, people are more capable of bringing about conditions that enable them to flourish.\nAnother interpretation of this statement is that it’s the contents of one’s beliefs that help people cope. For example, if one believes a recently deceased loved one has gone to the Happy Hunting Ground (a belief found among certain Native American tribes) where the wild game is in abundance, this makes it easier to deal with that person’s passing. However, if one used sound methods of reasoning one would produce better results and feel more in control of one’s life than unreflectively buying into a commonly held belief about what happens after death. One would thus rely less on the content of one’s beliefs and more on the process one uses to arrive at one’s beliefs.\nTo argue that people need faith is to abandon hope, and to condescend and accuse the faithful of being incapable of understanding the importance of reason and rationality. There are better and worse ways to come to terms with death, to find strength during times of crisis, to make meaning and purpose in our lives, to interpret our sense of awe and wonder, and to contribute to human well-being—and the faithful are completely capable of understanding and achieving this.\nVD RESPONSE:\nYou’re appealing to your own inability to understand again, and let’s face it, an appeal to Asperger’s Syndrome is an epistemology that is doomed to inevitable failure. Let’s consider that Chinese girl who lives in your house. Let’s suppose she was not a Chinese adoptee, but an Armenian one who looked like you, and she firmly believed that she was your real, biological daughter. Would telling her that she was adopted\nnecessarily\nmake it easier for her to get through the day? Isn’t at least possible that it would make it harder for her?\nIf you understand that, then you are perfectly capable of understanding how even a false belief can be emotionally and materially beneficial to an individual. The mere existence of nihilist philosophy is sufficient to shred your false claim that “if one used sound methods of reasoning one would produce better results and feel more in control of one’s life.” The historical fact is that sound methods of reasoning can be, and have been, utilized to justify everything from suicide to genocide.\nFaith is not the abandonment of hope. Quite to the contrary, faith is an act of hope; it is an axiomatic choice upon which one’s future actions will depend. The faithful understand the importance of reason and rationality much better than you do, because they understand reason and rationality are intellectual tools that can harm as well as heal. They understand, as you do not, that reason and rationality are tools, they are neither imperatives nor objectives.\nYou commit a category error when you make a reason an imperative, and ironically, in doing so, you demonstrate your inferior capacity for it.",
  "tags": [
    "atheism",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-21T14:00:00+00:00"
}