{
  "url": "https://voxday.net/2014/01/23/the-fifth-horseman-9_23/",
  "scraped_at": "2025-12-15T16:44:12.560749",
  "title": "The Fifth Horseman 10",
  "date_display": "January 23, 2014",
  "date_iso": "2014-01-23T08:38:00+00:00",
  "date_from_url": "2014-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And finally, we reach the end of Peter Boghossian’s 16 anti-apologetics. This is, quite literally, all he has in terms of anti-apologetical arguments, so if you’ve been underwhelmed by what he’s been able to show here, well, that’s what he’s got. My conclusion is that any Christian, or indeed, theist, who has merely read through these ten posts will be more than ready to obliterate any Street Epistemologist who attacks his faith on the grounds proposed by Mr. Boghossian.<br> <b><br/></b><br> <b>ANTI-APOLOGETIC #11</b></br></br></p><blockquote class=\"tr_bq\"><p> <i>“Without faith, society would devolve morally.”</i></p><p>This tends to be a late-game line, with Stalin and Hitler always included, sometimes followed by Pol Pot, Mussolini, and the Kims thrown in for good measure. The basic idea is that without objective standards of right and wrong, not only do ordinary people descend into savages, but vicious dictatorships are also inevitable.</p><p>“Without faith, society would devolve morally,” is an empirical claim. It’s a claim about the world. It’s also false. To respond, one need only survey religiosity and livability indices among various societies. Scandinavia has the lowest rate of religious belief in the world, yet on virtually all measures of well-being Scandinavian countries top every index (for more on this, see American sociologist Phil Zuckerman’s work).</p><p>I usually hear this defense from Christians. One response I offer is, “Saudi Arabia.” (For a one-word response, try “Iran.”) Saudi Arabia has one of the most devout, adherent populations on the planet, yet its citizens lack basic freedoms and are subject to the tyranny of religious police.</p><p>Finally, people use the Stalin/Hitler card in an attempt to argue that the worst dictatorships in recent times have had atheists at their helm (Hitler was more likely a deist if not a theist).</p><p>However, even granting this argument’s assumption, these men didn’t act like they did because they were atheists. That is, their nonbelief in a deity didn’t dictate particular actions they took. (This would be akin to arguing that Pol Pot—who was a bad man—didn’t believe in leprechauns, you don’t believe in leprechauns, therefore you’re as bad as Pol Pot.) Their systems were horrific precisely because they resembled faith-based systems where suspending warrant for belief is required (as is the wholesale adoption of an ideology, like Communism, Nazism, Fascism, etc.).</p></blockquote><p><b>VD RESPONSE: </b>The citation of religiosity and livability indices is not a rational response to an assertion of moral devolution. I’m a little astonished that it is necessary to point out to you that livability is not morality. Moreover, Sweden has the highest rates of rape in Europe while Scandinavia as a whole has very low marriage rates and the majority of Scandinavian children are illegitimate. This is moral devolution by any traditional moral standard.</p><p>Saudi Arabia and Iran may lack what you consider to be basic freedoms, but you cannot argue that the behavior of the populace is considerably more moral, on average, than the behavior of people in the USA or Scandinavia. It may be an enforced morality, but let’s face it, there is going to be less theft wherever being caught stealing means running a real risk of having your hand chopped off. And don’t even think about trying to start disputing what is, or what is not moral, as doing so will simply prove the very point you are trying to argue against.</p><p>You are right to say that Hitler was not an atheist. He was not. He was a pagan occultist, which from the Christian perspective is considerably worse than atheism. However, you are committing the same basic logical error that Sam Harris commits by appealing to the No True Atheist fallacy. The point is not that an atheist’s action is <i>dictated </i>by his atheism. The point is that an atheist’s atheism removes any sense of externally imposed moral restrictions on his actions, and it is an observed and documented fact that atheists with unrestricted political power have historically been much more likely to behave in an immoral and murderous manner than Christians in similar positions of power. You’re trying to change the subject to causation while we’re pointing to an undeniable correlation.</p><p>We don’t have to know precisely what element of the cigarette causes cancer to know that it’s a bad idea to light it and stick it in your mouth. And we don’t have to understand why atheists are disproportionately prone to behaving in an immoral manner to observe when they do so.</p><p>In fact, what you are doing now is deeply and profoundly immoral. You have declared your object is to destroy the faith of others, while Mark 9:42 says: <i>“If anyone causes one of these little ones—those who believe in me—to stumble, it would be better for them if a large millstone were hung around their neck and they were thrown into the sea.”</i> Your very existence is testimony to the devolution of morality inherent in atheism.</p></div>",
  "content_text": "And finally, we reach the end of Peter Boghossian’s 16 anti-apologetics. This is, quite literally, all he has in terms of anti-apologetical arguments, so if you’ve been underwhelmed by what he’s been able to show here, well, that’s what he’s got. My conclusion is that any Christian, or indeed, theist, who has merely read through these ten posts will be more than ready to obliterate any Street Epistemologist who attacks his faith on the grounds proposed by Mr. Boghossian.\nANTI-APOLOGETIC #11\n“Without faith, society would devolve morally.”\nThis tends to be a late-game line, with Stalin and Hitler always included, sometimes followed by Pol Pot, Mussolini, and the Kims thrown in for good measure. The basic idea is that without objective standards of right and wrong, not only do ordinary people descend into savages, but vicious dictatorships are also inevitable.\n“Without faith, society would devolve morally,” is an empirical claim. It’s a claim about the world. It’s also false. To respond, one need only survey religiosity and livability indices among various societies. Scandinavia has the lowest rate of religious belief in the world, yet on virtually all measures of well-being Scandinavian countries top every index (for more on this, see American sociologist Phil Zuckerman’s work).\nI usually hear this defense from Christians. One response I offer is, “Saudi Arabia.” (For a one-word response, try “Iran.”) Saudi Arabia has one of the most devout, adherent populations on the planet, yet its citizens lack basic freedoms and are subject to the tyranny of religious police.\nFinally, people use the Stalin/Hitler card in an attempt to argue that the worst dictatorships in recent times have had atheists at their helm (Hitler was more likely a deist if not a theist).\nHowever, even granting this argument’s assumption, these men didn’t act like they did because they were atheists. That is, their nonbelief in a deity didn’t dictate particular actions they took. (This would be akin to arguing that Pol Pot—who was a bad man—didn’t believe in leprechauns, you don’t believe in leprechauns, therefore you’re as bad as Pol Pot.) Their systems were horrific precisely because they resembled faith-based systems where suspending warrant for belief is required (as is the wholesale adoption of an ideology, like Communism, Nazism, Fascism, etc.).\nVD RESPONSE:\nThe citation of religiosity and livability indices is not a rational response to an assertion of moral devolution. I’m a little astonished that it is necessary to point out to you that livability is not morality. Moreover, Sweden has the highest rates of rape in Europe while Scandinavia as a whole has very low marriage rates and the majority of Scandinavian children are illegitimate. This is moral devolution by any traditional moral standard.\nSaudi Arabia and Iran may lack what you consider to be basic freedoms, but you cannot argue that the behavior of the populace is considerably more moral, on average, than the behavior of people in the USA or Scandinavia. It may be an enforced morality, but let’s face it, there is going to be less theft wherever being caught stealing means running a real risk of having your hand chopped off. And don’t even think about trying to start disputing what is, or what is not moral, as doing so will simply prove the very point you are trying to argue against.\nYou are right to say that Hitler was not an atheist. He was not. He was a pagan occultist, which from the Christian perspective is considerably worse than atheism. However, you are committing the same basic logical error that Sam Harris commits by appealing to the No True Atheist fallacy. The point is not that an atheist’s action is\ndictated\nby his atheism. The point is that an atheist’s atheism removes any sense of externally imposed moral restrictions on his actions, and it is an observed and documented fact that atheists with unrestricted political power have historically been much more likely to behave in an immoral and murderous manner than Christians in similar positions of power. You’re trying to change the subject to causation while we’re pointing to an undeniable correlation.\nWe don’t have to know precisely what element of the cigarette causes cancer to know that it’s a bad idea to light it and stick it in your mouth. And we don’t have to understand why atheists are disproportionately prone to behaving in an immoral manner to observe when they do so.\nIn fact, what you are doing now is deeply and profoundly immoral. You have declared your object is to destroy the faith of others, while Mark 9:42 says:\n“If anyone causes one of these little ones—those who believe in me—to stumble, it would be better for them if a large millstone were hung around their neck and they were thrown into the sea.”\nYour very existence is testimony to the devolution of morality inherent in atheism.",
  "tags": [
    "atheism",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-23T08:38:00+00:00"
}