{
  "url": "https://voxday.net/2014/01/24/the-implications-of-complexity/",
  "scraped_at": "2025-12-15T16:44:18.105515",
  "title": "The implications of complexity",
  "date_display": "January 24, 2014",
  "date_iso": "2014-01-24T10:36:00+00:00",
  "date_from_url": "2014-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it remarkable that despite <a href=\"http://www.natureworldnews.com/articles/5290/20131213/dna-secret-code-gene-control-researchers.htm\">this apparent order of magnitude, (or more), change</a> in the complexity of the DNA code, (now codes), even the genetic scientists who made the discovery are failing to grasp its obvious implications with regards to conventional Neo-Darwinian selectionism:</p><blockquote class=\"tr_bq\"><p> “For over 40 years we have assumed that DNA changes affecting the genetic code solely impact how proteins are made,” said Stamatoyannopoulos. “Now we know that this basic assumption about reading the human genome missed half of the picture. These new findings highlight that DNA is an incredibly powerful information storage device, which nature has fully exploited in unexpected ways.”</p><p>The genetic code is similar for all organisms and is stored in one of the two DNA strands as non-overlapping, linear sequence of nitrogenous bases Adenine (A), Guanine (G), Cytosine (C) and Thymine (T). These four letters are the ‘alphabet’ of the genetic code and are used to write code words. The code consists of three-letter words (also called triplets or codons). There are a total of 64 codons.</p><p>Now, researchers have found that the codons, which they refer to as duons, can be used for gene control. The team says that about 15 percent of codons could act as duons and that these bilingual genetic codes have shaped protein evolution.</p></blockquote><p>At this point, one is beginning to wonder if the scientists are so focused on the evolutionary trees that even a copyright notice would somehow escape their attention. <i>Copyright (c) 6000 BC God. All rights reserved. </i>“Well, obviously that is a codal pattern that evolved early in a common ancestor and merely happens to look like alphabetical characters, from which the various divergent mutations didn’t happen to provide any selection advantages.”</p><p>Here is the point that so many die-hard evolutionists can’t seem to grasp. Let me try to walk them through the logic of my skepticism with a simple analogy.</p><p>Charlie has a car. Charlie is speaking to you in Minneapolis. Charlie says he left Chicago seven hours ago and drove to Minneapolis on a single tank of gas. However, in the car, you discover two receipts, both dated today, from gas stations in Colorado Springs and Sioux Falls.</p><p>Now, if you can understand how this indicates that Charlie’s story is false, you should be able to understand how adding an additional order of magnitude of complexity to the DNA programming process completely rules out the time-scale of the conventional Neo-Darwinian selectionist model. There were already real problems with the model, hence the development of hypothesized excuses such as Punctuated Equilibrium.</p><p>But by adding the time needed for another level of mutation on top of what was already required by the previous single-code model, I don’t see how it is possible to seriously insist that the conventional natural selection model can hold up in light of this discovery. Now, perhaps I’m missing something, but it seems to me that either the DNA mutation process has to take place considerably faster than has been observed over the past 50 years or a new model will be required.</p><p>My guess is that the initial explanatory defense will be that the mutations are more frequent, but more significant using the two-code process, but this is a defense unlikely to do more than buy a little time, as it will soon be possible to observe whether such mutations are actually taking place or not. Remember, the main reason that TENS has been able to survive so long is that its long timescales required resisted observation. If the timescales are shorter and the mutations selected more frequent, then we can observe and falsify them.</p><p>And, of course, even if the new, faster model turns out to be correct, this opens up a whole new can of worms that Jonathan Haidt correctly identifies as <a href=\"http://edge.org/response-detail/10376\">the likely consequences</a> of a faster evolutionary model:</p><blockquote class=\"tr_bq\"><p> A wall has long protected respectable evolutionary inquiry from accusations of aiding and abetting racism. That wall is the belief that genetic change happens at such a glacial pace that there simply was not time, in the 50,000 years since humans spread out from Africa, for selection pressures to have altered the genome in anything but the most trivial way (e.g., changes in skin color and nose shape were adaptive responses to cold climates). Evolutionary psychology has therefore focused on the Pleistocene era – the period from about 1.8 million years ago to the dawn of agriculture — during which our common humanity was forged for the hunter-gatherer lifestyle. But the writing is on the wall.</p></blockquote></div>",
  "content_text": "I find it remarkable that despite\nthis apparent order of magnitude, (or more), change\nin the complexity of the DNA code, (now codes), even the genetic scientists who made the discovery are failing to grasp its obvious implications with regards to conventional Neo-Darwinian selectionism:\n“For over 40 years we have assumed that DNA changes affecting the genetic code solely impact how proteins are made,” said Stamatoyannopoulos. “Now we know that this basic assumption about reading the human genome missed half of the picture. These new findings highlight that DNA is an incredibly powerful information storage device, which nature has fully exploited in unexpected ways.”\nThe genetic code is similar for all organisms and is stored in one of the two DNA strands as non-overlapping, linear sequence of nitrogenous bases Adenine (A), Guanine (G), Cytosine (C) and Thymine (T). These four letters are the ‘alphabet’ of the genetic code and are used to write code words. The code consists of three-letter words (also called triplets or codons). There are a total of 64 codons.\nNow, researchers have found that the codons, which they refer to as duons, can be used for gene control. The team says that about 15 percent of codons could act as duons and that these bilingual genetic codes have shaped protein evolution.\nAt this point, one is beginning to wonder if the scientists are so focused on the evolutionary trees that even a copyright notice would somehow escape their attention.\nCopyright (c) 6000 BC God. All rights reserved.\n“Well, obviously that is a codal pattern that evolved early in a common ancestor and merely happens to look like alphabetical characters, from which the various divergent mutations didn’t happen to provide any selection advantages.”\nHere is the point that so many die-hard evolutionists can’t seem to grasp. Let me try to walk them through the logic of my skepticism with a simple analogy.\nCharlie has a car. Charlie is speaking to you in Minneapolis. Charlie says he left Chicago seven hours ago and drove to Minneapolis on a single tank of gas. However, in the car, you discover two receipts, both dated today, from gas stations in Colorado Springs and Sioux Falls.\nNow, if you can understand how this indicates that Charlie’s story is false, you should be able to understand how adding an additional order of magnitude of complexity to the DNA programming process completely rules out the time-scale of the conventional Neo-Darwinian selectionist model. There were already real problems with the model, hence the development of hypothesized excuses such as Punctuated Equilibrium.\nBut by adding the time needed for another level of mutation on top of what was already required by the previous single-code model, I don’t see how it is possible to seriously insist that the conventional natural selection model can hold up in light of this discovery. Now, perhaps I’m missing something, but it seems to me that either the DNA mutation process has to take place considerably faster than has been observed over the past 50 years or a new model will be required.\nMy guess is that the initial explanatory defense will be that the mutations are more frequent, but more significant using the two-code process, but this is a defense unlikely to do more than buy a little time, as it will soon be possible to observe whether such mutations are actually taking place or not. Remember, the main reason that TENS has been able to survive so long is that its long timescales required resisted observation. If the timescales are shorter and the mutations selected more frequent, then we can observe and falsify them.\nAnd, of course, even if the new, faster model turns out to be correct, this opens up a whole new can of worms that Jonathan Haidt correctly identifies as\nthe likely consequences\nof a faster evolutionary model:\nA wall has long protected respectable evolutionary inquiry from accusations of aiding and abetting racism. That wall is the belief that genetic change happens at such a glacial pace that there simply was not time, in the 50,000 years since humans spread out from Africa, for selection pressures to have altered the genome in anything but the most trivial way (e.g., changes in skin color and nose shape were adaptive responses to cold climates). Evolutionary psychology has therefore focused on the Pleistocene era – the period from about 1.8 million years ago to the dawn of agriculture — during which our common humanity was forged for the hunter-gatherer lifestyle. But the writing is on the wall.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-24T10:36:00+00:00"
}