{
  "url": "https://voxday.net/2014/01/14/the-fifth-horseman-2/",
  "scraped_at": "2025-12-15T16:43:13.182965",
  "title": "The Fifth Horseman 2",
  "date_display": "January 14, 2014",
  "date_iso": "2014-01-14T10:10:00+00:00",
  "date_from_url": "2014-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I finished Peter Boghossian’s <i>A Manual for Creating Atheists</i> yesterday. Needless to say, it did not succeed in creating one. In fact, I suspect Dominic, TGM, and some of the other intelligent atheists here will tend to be mildly embarrassed by it, in much the same way that intelligent Christians are embarrassed by a Kirk Cameron attempt at apologetics. The difference is that Cameron means well, while Boghossian is, quite literally, the sort of person who will kick out a crutch from under a cripple’s arm because he doesn’t believe the individual is truly crippled. Nor will he likely apologize when he learns, after the fact, that he was wrong.</p><p>It is readily observable that Boghossian almost certainly ranks higher on the Aspie scale, or whatever they are calling it these days, than Sam Harris or even Richard Dawkins. He’s simply clueless about what (silence) in a conversation means, inevitably assuming that what the dialogue tends to indicate means: (I can’t talk to this idiot, he’s hopeless) is actually: (oh my goodness, I am struck dumb by the irrefutable reasoning of your beautiful mind). And that is giving Boggie the benefit of the doubt and assuming that he is accurately recalling the dialogues rather than inventing them out of whole cloth.</p><p>The funniest part of the book is without question the following conversation with his father. I have a strong suspicion that his father regards Boghossian with mixed embarrassment and pride, the latter over his minor celebrity, the former over the fact that Boggie is the picture of what Bruce Charlton describes as a <a href=\"http://medicalhypotheses.blogspot.com/2009/11/clever-sillies-why-high-iq-lack-common.html\">clever silly</a>.</p><p>(Not that these particular sillies are especially clever. The second funniest part of the book comes in the Introduction by the ever-hapless John Loftus:<i>“I thanked God for everything, from getting me into the Christian-based Pepperdine University (my grades and SAT scores were unspectacular) to finding a parking place at theaters and restaurants.”</i>)</p><p>Unspectacular grades, mediocre SATs, and barely getting into a third-rate university. And these guys are constantly appealing to their intelligence? But back to the two Boghossians and the book’s best dialogue:</p><blockquote class=\"tr_bq\"><p> When I told my father that K–12 educational systems should promote the value of epistemological rigor, he replied incredulously, “Are you kidding me? High school dropout rates are hovering around 33 percent in most [U.S.] cities. We can’t even teach kids how to read. What makes you think we’d be any more successful with instilling ‘epistemological rigor?’”</p><p>Whether or not we can be successful in helping people see value in epistemological rigor is an empirical question. I have my own speculation that this can be accomplished through pop culture—for example, comic books and TV shows for children that personify new heroes, Epistemic Knights, and new villains, Faith Monsters.</p></blockquote><p>Didn’t even slow him down. Yes, it is an empirical question, but the point that Boghossian the Younger simply ignores is that <i>the question has been answered!</i> As you can see, we’re not exactly dealing with a godless genius here.</p><p>Boghossian the Elder made precisely the same point that I have repeatedly made concerning the teaching of evolution in the public schools. Both the evangelical evolutionists and Boghossian the Younger are so removed from reality that they are not only wrong, they are making a fundamental category error. How are the children at <a href=\"http://blogs.ajc.com/news-to-me/2014/01/13/report-worst-school-in-u-s-has-no-books/\">schools like this one in Queens</a>, where the children have no books, going to develop epistemological vigor even if they spend all day watching what sounds like a bad version of Captain Planet? The total impossibility of the task is only underlined as one reads the book, as one observes that even though the younger Boghossian <i>values </i>the idea of epistemological rigor, he does not actually <i>practice </i>it.</p><p>The entire book reads rather like it was written by Otto from <i>A Fish Called Wanda</i>. Aristotle was not Belgian. The definition of faith is not “pretending to know things you don’t know”. The central message of Scepticism is not “Ecrasez l’infame”. More than one argument for the existence of God has withstood scrutiny and many of them have done so for centuries. I should very much like to see Boghossian personally attempt to address my preferred <i>argumentum e maleficus</i>; it would be certain to provide an amount of hilarity.</p><p>In any event, now that I’ve read the manual, I’m not going to go through it on a page by page basis because most of my posts would consist of long quotes followed by short one- or two-word summaries: “exhortation” and “naked assertion”. Instead, I’m will begin with critiquing each of the 17 tactical anti-apologetics he presents, after which I will address certain other aspects of the book when I am finished with it. If there are specific sections or assertions you would like to see me address in a post, please download the book from the readily available torrent Pirate Bay and let me know. Even if you are an IP enthusiast, you can do so in good conscience, as Boghossian writes in Chapter 9:</p><p><i>“To prevent doxastic closure it’s also important to read the work of noted apologists. The only two I’d suggest are Alvin Plantinga and William Lane Craig, though I’d urge you not to buy their books; their projects don’t need your support.”</i></p><p>It is entirely possible that Boghossian not familiar with <i>The Irrational Atheist</i>, but even if he was, I am confident he would not recommend reading it to prevent doxastic closure because TIA is exactly the sort of thing that Boghossian recommends his Street Epistemologists avoid at all costs: the questioning of atheist assumptions and the criticism of their arguments. The <i>Manual </i>may be intended to be inoffensive, but it is all offense and offers very little in the way of anticipated defense. And therein, as I will demonstrate in this series of posts, lies the tactical Christian response.</p><p>Since this has already been a long post, I will begin with one of the shorter anti-apologetics from Chapter 7:</p><p><b>ANTI-APOLOGETIC #12</b></p><blockquote class=\"tr_bq\"><p> <br> Defense: “Atheism is just another religion. You have faith in atheism.”</br></p><p>Response: “Atheism is a conclusion one comes to as a result of being rational and honest. Atheism is a conclusion that’s based on the best available evidence for the existence of God—which is that there is none. Atheism is not a religion. Atheism is not a belief. Atheism is, basically, the lack of belief in God(s). Atheists follow no creeds or doctrines. They engage in no particular set of behaviors.”</p></blockquote><p><b>VD RESPONSE:</b> How old were you when you became an atheist? Most atheists declare themselves to be atheists before they are old enough to be considered mature enough to legally drink, so reason indicates that it is less a conclusion based on reason and honesty than on teenage hormones and temptation. There is considerable documentary and testimonial evidence for the existence of God, the kind of evidence that is legally admissible in a court of law. You are deceptively substituting the subset of scientific evidence for the entire set of evidence, which calls into doubt your evidence-free assertion that atheism is based on being honest.</p><p>As for your other claims about atheism, do you believe in ghosts? Do you believe in Feng Shui? Do you believe in evolution by natural selection? Do you believe in abiogenesis? What do any of those things have to do with a lack of belief in God? Your definition of atheism is clearly incomplete, at best.</p><p>Finally, the atheist Peter Boghossian declared that an evangelical atheist <i>“offers a humanistic vision”</i>. He wrote that his atheist Street Epistemology <i>“offers a humanism that’s taken some hits and gained from experience. This isn’t Pollyanna humanism, but a humanism that’s been slapped around and won’t fall apart.” </i>So, how can you say that atheists follow no creeds or doctrines when they are going around actively trying to sell a specific type of humanism? Is that what you are offering to me? A humanistic vision? Then you obviously have faith in humanism! And given what you’ve been saying about the evils of faith, shouldn’t you be addressing that log in your own eye before worrying about any splinters in mine?</p><p> PREVIOUS IN THE SERIES: <a href=\"http://www.milobookclub.com/2014/01/13/the-fifth-horseman-1/\">The Fifth Horseman 1</a></p></div>",
  "content_text": "I finished Peter Boghossian’s\nA Manual for Creating Atheists\nyesterday. Needless to say, it did not succeed in creating one. In fact, I suspect Dominic, TGM, and some of the other intelligent atheists here will tend to be mildly embarrassed by it, in much the same way that intelligent Christians are embarrassed by a Kirk Cameron attempt at apologetics. The difference is that Cameron means well, while Boghossian is, quite literally, the sort of person who will kick out a crutch from under a cripple’s arm because he doesn’t believe the individual is truly crippled. Nor will he likely apologize when he learns, after the fact, that he was wrong.\nIt is readily observable that Boghossian almost certainly ranks higher on the Aspie scale, or whatever they are calling it these days, than Sam Harris or even Richard Dawkins. He’s simply clueless about what (silence) in a conversation means, inevitably assuming that what the dialogue tends to indicate means: (I can’t talk to this idiot, he’s hopeless) is actually: (oh my goodness, I am struck dumb by the irrefutable reasoning of your beautiful mind). And that is giving Boggie the benefit of the doubt and assuming that he is accurately recalling the dialogues rather than inventing them out of whole cloth.\nThe funniest part of the book is without question the following conversation with his father. I have a strong suspicion that his father regards Boghossian with mixed embarrassment and pride, the latter over his minor celebrity, the former over the fact that Boggie is the picture of what Bruce Charlton describes as a\nclever silly\n.\n(Not that these particular sillies are especially clever. The second funniest part of the book comes in the Introduction by the ever-hapless John Loftus:\n“I thanked God for everything, from getting me into the Christian-based Pepperdine University (my grades and SAT scores were unspectacular) to finding a parking place at theaters and restaurants.”\n)\nUnspectacular grades, mediocre SATs, and barely getting into a third-rate university. And these guys are constantly appealing to their intelligence? But back to the two Boghossians and the book’s best dialogue:\nWhen I told my father that K–12 educational systems should promote the value of epistemological rigor, he replied incredulously, “Are you kidding me? High school dropout rates are hovering around 33 percent in most [U.S.] cities. We can’t even teach kids how to read. What makes you think we’d be any more successful with instilling ‘epistemological rigor?’”\nWhether or not we can be successful in helping people see value in epistemological rigor is an empirical question. I have my own speculation that this can be accomplished through pop culture—for example, comic books and TV shows for children that personify new heroes, Epistemic Knights, and new villains, Faith Monsters.\nDidn’t even slow him down. Yes, it is an empirical question, but the point that Boghossian the Younger simply ignores is that\nthe question has been answered!\nAs you can see, we’re not exactly dealing with a godless genius here.\nBoghossian the Elder made precisely the same point that I have repeatedly made concerning the teaching of evolution in the public schools. Both the evangelical evolutionists and Boghossian the Younger are so removed from reality that they are not only wrong, they are making a fundamental category error. How are the children at\nschools like this one in Queens\n, where the children have no books, going to develop epistemological vigor even if they spend all day watching what sounds like a bad version of Captain Planet? The total impossibility of the task is only underlined as one reads the book, as one observes that even though the younger Boghossian\nvalues\nthe idea of epistemological rigor, he does not actually\npractice\nit.\nThe entire book reads rather like it was written by Otto from\nA Fish Called Wanda\n. Aristotle was not Belgian. The definition of faith is not “pretending to know things you don’t know”. The central message of Scepticism is not “Ecrasez l’infame”. More than one argument for the existence of God has withstood scrutiny and many of them have done so for centuries. I should very much like to see Boghossian personally attempt to address my preferred\nargumentum e maleficus\n; it would be certain to provide an amount of hilarity.\nIn any event, now that I’ve read the manual, I’m not going to go through it on a page by page basis because most of my posts would consist of long quotes followed by short one- or two-word summaries: “exhortation” and “naked assertion”. Instead, I’m will begin with critiquing each of the 17 tactical anti-apologetics he presents, after which I will address certain other aspects of the book when I am finished with it. If there are specific sections or assertions you would like to see me address in a post, please download the book from the readily available torrent Pirate Bay and let me know. Even if you are an IP enthusiast, you can do so in good conscience, as Boghossian writes in Chapter 9:\n“To prevent doxastic closure it’s also important to read the work of noted apologists. The only two I’d suggest are Alvin Plantinga and William Lane Craig, though I’d urge you not to buy their books; their projects don’t need your support.”\nIt is entirely possible that Boghossian not familiar with\nThe Irrational Atheist\n, but even if he was, I am confident he would not recommend reading it to prevent doxastic closure because TIA is exactly the sort of thing that Boghossian recommends his Street Epistemologists avoid at all costs: the questioning of atheist assumptions and the criticism of their arguments. The\nManual\nmay be intended to be inoffensive, but it is all offense and offers very little in the way of anticipated defense. And therein, as I will demonstrate in this series of posts, lies the tactical Christian response.\nSince this has already been a long post, I will begin with one of the shorter anti-apologetics from Chapter 7:\nANTI-APOLOGETIC #12\nDefense: “Atheism is just another religion. You have faith in atheism.”\nResponse: “Atheism is a conclusion one comes to as a result of being rational and honest. Atheism is a conclusion that’s based on the best available evidence for the existence of God—which is that there is none. Atheism is not a religion. Atheism is not a belief. Atheism is, basically, the lack of belief in God(s). Atheists follow no creeds or doctrines. They engage in no particular set of behaviors.”\nVD RESPONSE:\nHow old were you when you became an atheist? Most atheists declare themselves to be atheists before they are old enough to be considered mature enough to legally drink, so reason indicates that it is less a conclusion based on reason and honesty than on teenage hormones and temptation. There is considerable documentary and testimonial evidence for the existence of God, the kind of evidence that is legally admissible in a court of law. You are deceptively substituting the subset of scientific evidence for the entire set of evidence, which calls into doubt your evidence-free assertion that atheism is based on being honest.\nAs for your other claims about atheism, do you believe in ghosts? Do you believe in Feng Shui? Do you believe in evolution by natural selection? Do you believe in abiogenesis? What do any of those things have to do with a lack of belief in God? Your definition of atheism is clearly incomplete, at best.\nFinally, the atheist Peter Boghossian declared that an evangelical atheist\n“offers a humanistic vision”\n. He wrote that his atheist Street Epistemology\n“offers a humanism that’s taken some hits and gained from experience. This isn’t Pollyanna humanism, but a humanism that’s been slapped around and won’t fall apart.”\nSo, how can you say that atheists follow no creeds or doctrines when they are going around actively trying to sell a specific type of humanism? Is that what you are offering to me? A humanistic vision? Then you obviously have faith in humanism! And given what you’ve been saying about the evils of faith, shouldn’t you be addressing that log in your own eye before worrying about any splinters in mine?\nPREVIOUS IN THE SERIES:\nThe Fifth Horseman 1",
  "tags": [
    "atheism",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-14T10:10:00+00:00"
}