{
  "url": "https://voxday.net/2014/01/15/the-fifth-horseman-3/",
  "scraped_at": "2025-12-15T16:43:19.549284",
  "title": "The Fifth Horseman 3",
  "date_display": "January 15, 2014",
  "date_iso": "2014-01-15T09:58:00+00:00",
  "date_from_url": "2014-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which responses to two more of the 16 anti-apologetics offered in Peter Boghossian’s <i>A Manual to Creating Atheists</i> are provided. The juxtaposition of the two anti-apologetics is particularly effective, as it illustrates the intrinsic lack of integrity, indeed, one should say the lack of good faith, of the Street Epistemologist.</p><p><b>ANTI-APOLOGETIC #1 </b></p><blockquote class=\"tr_bq\"><p> FAITH IS TRUE</p><p>“Why is there something rather than nothing? You have faith that there was no Creator.”</p><p><i>“Bear in mind that an atheist believes that all these miraculous coincidences took place by chance. But he doesn’t just believe that man and woman came into being without a Creator, but that all of creation did—amazing flowers, massive trees, succulent fruits, beautiful birds, the animal kingdom, the sea, fish, natural laws, etc. His faith is much greater than mine.”</i><br> —Ray Comfort, You Can Lead an Atheist to Evidence, but You Can’t Make Him Think (2009, p. 2)</br></p><p>This is the best argument I’ve heard for the existence of God. It’s the trump card played by believers. However, it doesn’t work.</p><p>There are several related ways to respond to why there’s something rather than nothing: “Why assume nothing is the default?” This is a question that has no answer. As prolific German philosopher Adolf Grünbaum states, “Why be astonished at being at all? To marvel at existence is to assume that nothingness is somehow more natural, more restful. But why? The ancients started with matter, not the void; perhaps nothingness is stranger than being” (Holt, 2012).</p><p>Similarly, “How do you know the universe didn’t always exist?” Even if appeals are made to the Big Bang, one can never know either that reality is one endless time loop with Big Bangs strung together for eternity, or that à la American theoretical physicist Brian Greene, we’re part of a larger multiverse with an infinite number of Big Bangs constantly occurring.</p><p>Why isn’t there nothing rather than something? On what basis can one claim nothing is the default position for existence? Couldn’t something be the default position, with nothing being the truly extraordinary thing? And even if we do accept by fiat, given our limited knowledge, that something rather than nothing is extraordinary, does that give license to make up answers as to why this is the case? It begs the question: is it better to pretend we know an answer to something we don’t actually know, or is it better to simply be honest and say, “I don’t know?”</p><p>The possibility that the universe always existed cannot be ruled out. This by definition casts doubt on a creator. No faith is needed to posit that the universe may have always existed.</p></blockquote><p>The quality of Peter Boghossian’s education can be easily summarized by pointing out that of all the various intellectual arguments concerning God’s existence that have been concocted by Christendom over the centuries, the best one that he has ever heard was presented by Ray Comfort. This isn’t merely embarrassing for him, it should be so humiliating for him that he never again opines in public on the subject.</p><p><b>VD RESPONSE: </b>Why assume nothing is the default? Because Scripture, Science, and Reason all point to nothing having preceded the universe as we presently observe and experience it. How do I know the universe didn’t always exist? Because Fred Hoyle’s Steady-State Universe theory, which was inspired by a freaking <i>B-grade British horror movie</i>, is contradicted by the theory of general relativity, the discovery of cosmic microwave background radiation, Hubble’s observation that the universe was expanding, and both the First and Second Laws of Thermodynamics, just to name a few things. You might as reasonably believe in a magic perpetual motion machine as an eternal universe.</p><p>As for your appeal to the multiverse hypothesis, if you are going to insist upon an infinite number of universes, then you must admit that at least one of those universes would have to contain a Creator God, in which case the evidence suggests that this happens to be that particular universe. Even if we are assured that in none of them does Sheldon dance.</p><p>As to WHY there is something rather than nothing, that is irrelevant. This is not a question of why, it is a question of what. Do you believe that the Earth is older than 6,000 years old? Then you cannot appeal to the current scientific consensus that calculates the age of the Earth to be 4.54 ± 0.05 billion years while simultaneously rejecting its calculation that the age of the Universe is 13.798±0.037 billion years.</p><p>The possibility that the universe has always existed was ruled out by scientists decades ago. It is true that no faith is needed to posit that the universe has always existed, just as no faith is needed to posit that you are a clown made out of candy. But you have to be a science denier to claim that either of those things are a legitimate possibility in this particular universe. Now, are you really prepared to deny science and declare your disbelief in what Newton, Einstein, Hawking, and Hubble, just to name a few, have established scientifically?</p><p>Or do you have faith in those men and their conclusions? Because I know, I am not merely “pretending to know”, that you don’t understand the math involved.</p><p><b>ANTI-APOLOGETIC #13</b></p><blockquote class=\"tr_bq\"><p> Defense: “Much of modern science and practical mathematics is based upon mere ‘native preference,’ not on any rational proof. Faith is the same.”</p><p>Response: “Science has a built-in corrective mechanism that faith does not have. There’s been convergence across all fields of science on virtually all scientific theories since the eighteenth century. At any point in the future, do you ever think there will be convergence on specific faith propositions? I don’t, because those propositions are arbitrary.”</p></blockquote><p><b>VD RESPONSE:</b> You attacked science by denigrating its consensus concerning the age of the universe and now you’re appealing to it? Why, I find myself beginning to doubt your integrity and your intellectual honesty! And your statement is false: science does not have a built-in corrective mechanism. As Thomas Kuhn demonstrated, scientists work within paradigmatic assumptions that they do not question and the so-called “corrective mechanism” to which you appeal is no different than it is in accounting or any other human activity where sufficient divergence from observed reality eventually tends to draw someone’s attention. Including, you will note, organized religion.</p><p>As for your question about convergence on specific faith propositions, you are quite clearly wrong. We have already observed what you claim to be impossible. History shows a considerable degree of convergence on specific faith propositions; 2,000 years ago, there were a plethora of pagan religions and only 11 Christian apostles. Now most of those pagan religions are defunct and there are 2.2 billion Christians around the world, accounting for more than one-quarter of the global population. In fact, the Bible itself describes the process of this inevitable convergence. One day EVERY knee shall bow, and one day EVERY tongue will confess that Jesus Christ is Lord.</p><p>Including yours. You can do it now. Or you can do it later. But you will do it.</p><p> PREVIOUS IN THE SERIES: <a href=\"http://www.milobookclub.com/2014/01/14/the-fifth-horseman-2/\">The Fifth Horseman 2 </a></p></div>",
  "content_text": "In which responses to two more of the 16 anti-apologetics offered in Peter Boghossian’s\nA Manual to Creating Atheists\nare provided. The juxtaposition of the two anti-apologetics is particularly effective, as it illustrates the intrinsic lack of integrity, indeed, one should say the lack of good faith, of the Street Epistemologist.\nANTI-APOLOGETIC #1\nFAITH IS TRUE\n“Why is there something rather than nothing? You have faith that there was no Creator.”\n“Bear in mind that an atheist believes that all these miraculous coincidences took place by chance. But he doesn’t just believe that man and woman came into being without a Creator, but that all of creation did—amazing flowers, massive trees, succulent fruits, beautiful birds, the animal kingdom, the sea, fish, natural laws, etc. His faith is much greater than mine.”\n—Ray Comfort, You Can Lead an Atheist to Evidence, but You Can’t Make Him Think (2009, p. 2)\nThis is the best argument I’ve heard for the existence of God. It’s the trump card played by believers. However, it doesn’t work.\nThere are several related ways to respond to why there’s something rather than nothing: “Why assume nothing is the default?” This is a question that has no answer. As prolific German philosopher Adolf Grünbaum states, “Why be astonished at being at all? To marvel at existence is to assume that nothingness is somehow more natural, more restful. But why? The ancients started with matter, not the void; perhaps nothingness is stranger than being” (Holt, 2012).\nSimilarly, “How do you know the universe didn’t always exist?” Even if appeals are made to the Big Bang, one can never know either that reality is one endless time loop with Big Bangs strung together for eternity, or that à la American theoretical physicist Brian Greene, we’re part of a larger multiverse with an infinite number of Big Bangs constantly occurring.\nWhy isn’t there nothing rather than something? On what basis can one claim nothing is the default position for existence? Couldn’t something be the default position, with nothing being the truly extraordinary thing? And even if we do accept by fiat, given our limited knowledge, that something rather than nothing is extraordinary, does that give license to make up answers as to why this is the case? It begs the question: is it better to pretend we know an answer to something we don’t actually know, or is it better to simply be honest and say, “I don’t know?”\nThe possibility that the universe always existed cannot be ruled out. This by definition casts doubt on a creator. No faith is needed to posit that the universe may have always existed.\nThe quality of Peter Boghossian’s education can be easily summarized by pointing out that of all the various intellectual arguments concerning God’s existence that have been concocted by Christendom over the centuries, the best one that he has ever heard was presented by Ray Comfort. This isn’t merely embarrassing for him, it should be so humiliating for him that he never again opines in public on the subject.\nVD RESPONSE:\nWhy assume nothing is the default? Because Scripture, Science, and Reason all point to nothing having preceded the universe as we presently observe and experience it. How do I know the universe didn’t always exist? Because Fred Hoyle’s Steady-State Universe theory, which was inspired by a freaking\nB-grade British horror movie\n, is contradicted by the theory of general relativity, the discovery of cosmic microwave background radiation, Hubble’s observation that the universe was expanding, and both the First and Second Laws of Thermodynamics, just to name a few things. You might as reasonably believe in a magic perpetual motion machine as an eternal universe.\nAs for your appeal to the multiverse hypothesis, if you are going to insist upon an infinite number of universes, then you must admit that at least one of those universes would have to contain a Creator God, in which case the evidence suggests that this happens to be that particular universe. Even if we are assured that in none of them does Sheldon dance.\nAs to WHY there is something rather than nothing, that is irrelevant. This is not a question of why, it is a question of what. Do you believe that the Earth is older than 6,000 years old? Then you cannot appeal to the current scientific consensus that calculates the age of the Earth to be 4.54 ± 0.05 billion years while simultaneously rejecting its calculation that the age of the Universe is 13.798±0.037 billion years.\nThe possibility that the universe has always existed was ruled out by scientists decades ago. It is true that no faith is needed to posit that the universe has always existed, just as no faith is needed to posit that you are a clown made out of candy. But you have to be a science denier to claim that either of those things are a legitimate possibility in this particular universe. Now, are you really prepared to deny science and declare your disbelief in what Newton, Einstein, Hawking, and Hubble, just to name a few, have established scientifically?\nOr do you have faith in those men and their conclusions? Because I know, I am not merely “pretending to know”, that you don’t understand the math involved.\nANTI-APOLOGETIC #13\nDefense: “Much of modern science and practical mathematics is based upon mere ‘native preference,’ not on any rational proof. Faith is the same.”\nResponse: “Science has a built-in corrective mechanism that faith does not have. There’s been convergence across all fields of science on virtually all scientific theories since the eighteenth century. At any point in the future, do you ever think there will be convergence on specific faith propositions? I don’t, because those propositions are arbitrary.”\nVD RESPONSE:\nYou attacked science by denigrating its consensus concerning the age of the universe and now you’re appealing to it? Why, I find myself beginning to doubt your integrity and your intellectual honesty! And your statement is false: science does not have a built-in corrective mechanism. As Thomas Kuhn demonstrated, scientists work within paradigmatic assumptions that they do not question and the so-called “corrective mechanism” to which you appeal is no different than it is in accounting or any other human activity where sufficient divergence from observed reality eventually tends to draw someone’s attention. Including, you will note, organized religion.\nAs for your question about convergence on specific faith propositions, you are quite clearly wrong. We have already observed what you claim to be impossible. History shows a considerable degree of convergence on specific faith propositions; 2,000 years ago, there were a plethora of pagan religions and only 11 Christian apostles. Now most of those pagan religions are defunct and there are 2.2 billion Christians around the world, accounting for more than one-quarter of the global population. In fact, the Bible itself describes the process of this inevitable convergence. One day EVERY knee shall bow, and one day EVERY tongue will confess that Jesus Christ is Lord.\nIncluding yours. You can do it now. Or you can do it later. But you will do it.\nPREVIOUS IN THE SERIES:\nThe Fifth Horseman 2",
  "tags": [
    "atheism",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-15T09:58:00+00:00"
}