{
  "url": "https://voxday.net/2014/01/17/the-fifth-horseman-5/",
  "scraped_at": "2025-12-15T16:43:39.177900",
  "title": "The Fifth Horseman 5",
  "date_display": "January 17, 2014",
  "date_iso": "2014-01-17T18:20:00+00:00",
  "date_from_url": "2014-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Anti-Apologetic #3</b></p><blockquote class=\"tr_bq\"><p> <i>“I don’t have enough faith to be an atheist.”</i></p><p>I have personally heard this objection innumerous times—mostly from those who are more fundamentalist in their orientation. My suspicion is that people who have genuine doubts about their faith but want to demonstrate or voice strong verbal support for their faith (not necessarily to others but for themselves) make this statement.</p><p>This defense is problematic for several reasons. First, what amount of “faith” is required for someone’s nonbelief in the Norse god Thor? Or, are most people Thor atheists? Does nonbelief in Thor require effort? Do people need to congregate and sing songs together to reinforce their nonbelief in Thor? Anyone who says, “I don’t have enough faith to be an atheist,” doesn’t understand what the word “atheist” means, or is simply insincere.</p><p>Second, one possible reason this defense has gained such traction is the starting point. The faithful start with defaulting to God; in other words, the faithful look at the world around them and say, “God.” I happen to be on a plane now, and when I look around I see clouds, seats, people, my laptop, but I don’t see an invisible, unifying metaphysical and supernatural element. I see objects. It is unclear to me why one’s default would be God.</p><p>Borrowing from a term first used by pastor and French theologian John Calvin, contemporary American Christian apologist Alvin Plantinga tries to answer questions of defaulting to God with the Sensus Divinitatis or “God sensor” (Plantinga, 2000). Basically, Plantinga’s answer is that some people have a built-in sense of the divine—something within them senses God in the same way that we have eyes that sense things in the visual realm.</p><p>One of the main problems with the God sensor argument is that just as some people allegedly claim to sense God, other people can allegedly claim to sense other imagined entities. This common rebuttal is referred to as “the Great Pumpkin” objection. In American cartoonist Charles M. Schulz’s comic strip Peanuts, Linus believes there’s a Great Pumpkin who arises from the pumpkin patch to reward well-behaved children. If the theist can claim that her sensation of God is immediate, why can’t anyone who genuinely feels an imagined entity claim that entity is real? (This argument can become very complicated, and as a general rule I’d suggest avoiding it whenever possible. Focus instead on the fact that one’s confidence in a sensation does not map onto its accuracy—just because people feel in their hearts the Emperor of Japan is divine, does not make the Emperor of Japan divine.)</p><p>When responding to, “I don’t have enough faith to be an atheist,” I begin by clearly defining the words “faith” and “atheist.” I can’t imagine how these two definitions could align so as to make this statement sensible.</p></blockquote><p><b>VD RESPONSE:</b> An appeal to your own lack of imagination is not only a fundamental logical fallacy, but is so hapless and inept a response that I would be embarrassed for you if I didn’t think you were an intellectually dishonest jerk who is willing to say anything in order to tear others down.</p><p>Also, you’re wrong. Let’s look at your own definitions of “faith” and “atheist”. You defined faith, improperly, as<i> “pretending to know something you don’t”.</i> As for atheist, you say: <i>“Atheist,” as I use the term, means, “There’s insufficient evidence to warrant belief in a divine, supernatural creator of the universe.”</i></p><p>The two definitions don’t align because your definition of atheist doesn’t even conform to the grammatical rules of the English language. “Atheist” doesn’t mean “there’s insufficient evidence to believe” anything. It’s not a statement, it’s a freaking noun! An “atheist’ is a type of person, specifically, a person who does not believe in the existence of God, gods, or the supernatural, who “offers a humanistic vision”, to quote Peter Boghossian, and in most cases, also subscribes to rational materialism and scientific determinism.</p><p>And given that the possibility that God always existed cannot be ruled out, as per Mr. Boghossian’s Anti-Apologetic #1, it should be obvious that every atheist who claims God does not exist is someone who is pretending to know something he does not know. Which, according to your own definition, is someone who has faith.</p><p>Very few theists have the sort of faith required to engage in that pretense, to say nothing of the vast quantities required to pretend to know that the universe always existed, life came from non-life, science is the only means of obtaining reliable evidence, and global warming requires a global government.</p><p><b>ANTI-APOLOGETIC #15</b></p><blockquote class=\"tr_bq\"><p> <b>Defense:</b> “You’re just talking about blind faith. My faith is not blind.”</p><p><b>Response:</b> “There is no need to modify the word ‘faith’ with the word ‘blind.’ All faith is blind. All faith is belief on the basis of insufficient evidence. That’s what makes it faith. If one had evidence, one wouldn’t need faith, one would merely present the evidence.”</p></blockquote><p><b>VD RESPONSE:</b> Your thinking is too simplistic. Faith is no more a binary matter than science is. I also notice that you’re changing the definition of faith again: before you said faith was “pretending to know what you don’t know”. You are also contradicting yourself here. What distinguishes “sufficient” evidence from “insufficient” evidence? What is the magical binary line that separates one form of evidence from the other?</p><p>Even “insufficient evidence” is still evidence, by definition, so your assertion that if one had evidence, one wouldn’t need faith is obviously false since you declare that faith necessarily requires a form of evidence upon which the belief is based.</p></div>",
  "content_text": "Anti-Apologetic #3\n“I don’t have enough faith to be an atheist.”\nI have personally heard this objection innumerous times—mostly from those who are more fundamentalist in their orientation. My suspicion is that people who have genuine doubts about their faith but want to demonstrate or voice strong verbal support for their faith (not necessarily to others but for themselves) make this statement.\nThis defense is problematic for several reasons. First, what amount of “faith” is required for someone’s nonbelief in the Norse god Thor? Or, are most people Thor atheists? Does nonbelief in Thor require effort? Do people need to congregate and sing songs together to reinforce their nonbelief in Thor? Anyone who says, “I don’t have enough faith to be an atheist,” doesn’t understand what the word “atheist” means, or is simply insincere.\nSecond, one possible reason this defense has gained such traction is the starting point. The faithful start with defaulting to God; in other words, the faithful look at the world around them and say, “God.” I happen to be on a plane now, and when I look around I see clouds, seats, people, my laptop, but I don’t see an invisible, unifying metaphysical and supernatural element. I see objects. It is unclear to me why one’s default would be God.\nBorrowing from a term first used by pastor and French theologian John Calvin, contemporary American Christian apologist Alvin Plantinga tries to answer questions of defaulting to God with the Sensus Divinitatis or “God sensor” (Plantinga, 2000). Basically, Plantinga’s answer is that some people have a built-in sense of the divine—something within them senses God in the same way that we have eyes that sense things in the visual realm.\nOne of the main problems with the God sensor argument is that just as some people allegedly claim to sense God, other people can allegedly claim to sense other imagined entities. This common rebuttal is referred to as “the Great Pumpkin” objection. In American cartoonist Charles M. Schulz’s comic strip Peanuts, Linus believes there’s a Great Pumpkin who arises from the pumpkin patch to reward well-behaved children. If the theist can claim that her sensation of God is immediate, why can’t anyone who genuinely feels an imagined entity claim that entity is real? (This argument can become very complicated, and as a general rule I’d suggest avoiding it whenever possible. Focus instead on the fact that one’s confidence in a sensation does not map onto its accuracy—just because people feel in their hearts the Emperor of Japan is divine, does not make the Emperor of Japan divine.)\nWhen responding to, “I don’t have enough faith to be an atheist,” I begin by clearly defining the words “faith” and “atheist.” I can’t imagine how these two definitions could align so as to make this statement sensible.\nVD RESPONSE:\nAn appeal to your own lack of imagination is not only a fundamental logical fallacy, but is so hapless and inept a response that I would be embarrassed for you if I didn’t think you were an intellectually dishonest jerk who is willing to say anything in order to tear others down.\nAlso, you’re wrong. Let’s look at your own definitions of “faith” and “atheist”. You defined faith, improperly, as\n“pretending to know something you don’t”.\nAs for atheist, you say:\n“Atheist,” as I use the term, means, “There’s insufficient evidence to warrant belief in a divine, supernatural creator of the universe.”\nThe two definitions don’t align because your definition of atheist doesn’t even conform to the grammatical rules of the English language. “Atheist” doesn’t mean “there’s insufficient evidence to believe” anything. It’s not a statement, it’s a freaking noun! An “atheist’ is a type of person, specifically, a person who does not believe in the existence of God, gods, or the supernatural, who “offers a humanistic vision”, to quote Peter Boghossian, and in most cases, also subscribes to rational materialism and scientific determinism.\nAnd given that the possibility that God always existed cannot be ruled out, as per Mr. Boghossian’s Anti-Apologetic #1, it should be obvious that every atheist who claims God does not exist is someone who is pretending to know something he does not know. Which, according to your own definition, is someone who has faith.\nVery few theists have the sort of faith required to engage in that pretense, to say nothing of the vast quantities required to pretend to know that the universe always existed, life came from non-life, science is the only means of obtaining reliable evidence, and global warming requires a global government.\nANTI-APOLOGETIC #15\nDefense:\n“You’re just talking about blind faith. My faith is not blind.”\nResponse:\n“There is no need to modify the word ‘faith’ with the word ‘blind.’ All faith is blind. All faith is belief on the basis of insufficient evidence. That’s what makes it faith. If one had evidence, one wouldn’t need faith, one would merely present the evidence.”\nVD RESPONSE:\nYour thinking is too simplistic. Faith is no more a binary matter than science is. I also notice that you’re changing the definition of faith again: before you said faith was “pretending to know what you don’t know”. You are also contradicting yourself here. What distinguishes “sufficient” evidence from “insufficient” evidence? What is the magical binary line that separates one form of evidence from the other?\nEven “insufficient evidence” is still evidence, by definition, so your assertion that if one had evidence, one wouldn’t need faith is obviously false since you declare that faith necessarily requires a form of evidence upon which the belief is based.",
  "tags": [
    "atheism",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-17T18:20:00+00:00"
}