{
  "url": "https://voxday.net/2014/01/14/the-scientific-benefits-of-fai/",
  "scraped_at": "2025-12-15T16:43:14.670657",
  "title": "The scientific benefits of faith",
  "date_display": "January 14, 2014",
  "date_iso": "2014-01-14T14:00:00+00:00",
  "date_from_url": "2014-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tangentially related to the day’s earlier post comes this news that <a href=\"http://www.dailymail.co.uk/health/article-2531622/People-religious-spiritual-thicker-brains-Those-believe-god-deeper-outer-layer.html\">there are material differences</a> between the brains of religious individuals and those of the irreligious:</p><blockquote class=\"tr_bq\"><p> They say religion is a matter of the heart – but it seems the shape of our brains could also have a role to play. Believers or those with a spiritual side have ‘thicker’ sections of brain tissue than other people, a study suggests. And in welcome news for the faithful, the researchers think that this thickening could also help to stave off depression.</p><p>‘Our beliefs and our moods are reflected in our brain and with new imaging techniques we can begin to see this,’ Dr Myrna Weissman, a professor of psychiatry and epidemiology at Columbia University, told Reuters Health.</p></blockquote><p>As I mentioned in the previous comments, I think it might be informative to see a study done on the frontal lobes of atheists. My scientific hypothesis, based on the observation that adult atheists tend to exhibit a variety of reasoning patterns more commonly observed in teenagers, is that the brains of atheists will show signs of their frontal lobes not being fully developed.</p><p>And before you deny the science, keep in mind that not one, but two scientific studies at two different universities have already found evidence supporting my hypothesis concerning a connection between mild forms of autism and atheism. It looks increasingly likely that Sam Harris’s attempt to bring neuroscience into religious matters is going to backfire on atheists in a big way.</p><p>But this should have been obvious from the start, as who is more likely to be aneurotypical, a small and poorly behaved minority or the overwhelming majority? As economists have learned over the last 80 years, Sigmund Freud’s ideas are a very poor basis upon which to build one’s scientific hypotheses.</p><p>Of course, it’s entirely possible that Mr. Harris’s frontal lobes are, at least in part, to blame for his inability to correctly reason through the probable connection between brain development and religious belief, assuming that there is one in the first place.</p><p>UPDATE: Gara complained that I didn’t mention the fact that atheists have higher average IQs than theists. So, I’m rectifying that by quoting myself on the subject of <a href=\"http://www.milobookclub.com/2013/08/14/mailvox-superior-atheist-intelligence/\">superior average atheist intelligence</a>:</p><p><i>“I have readily conceded that religious individuals are less intelligent on average than non-believers in general and atheists in particular for years.  However, what the midwits who get very excited about this<br> statistical fact never seem to keep in mind is that because there are so<br> many more religious people, there are considerably more highly<br> intelligent religious people than there are highly intelligent<br> non-believers.</br></br></br></br></i></p><p>In fact, the ratio of theists to atheists with Mensa+ level IQs <a href=\"http://www.milobookclub.com/2011/01/16/most-atheists-have-sub-norma/\">is more than 10 to one</a>.”</p></div>",
  "content_text": "Tangentially related to the day’s earlier post comes this news that\nthere are material differences\nbetween the brains of religious individuals and those of the irreligious:\nThey say religion is a matter of the heart – but it seems the shape of our brains could also have a role to play. Believers or those with a spiritual side have ‘thicker’ sections of brain tissue than other people, a study suggests. And in welcome news for the faithful, the researchers think that this thickening could also help to stave off depression.\n‘Our beliefs and our moods are reflected in our brain and with new imaging techniques we can begin to see this,’ Dr Myrna Weissman, a professor of psychiatry and epidemiology at Columbia University, told Reuters Health.\nAs I mentioned in the previous comments, I think it might be informative to see a study done on the frontal lobes of atheists. My scientific hypothesis, based on the observation that adult atheists tend to exhibit a variety of reasoning patterns more commonly observed in teenagers, is that the brains of atheists will show signs of their frontal lobes not being fully developed.\nAnd before you deny the science, keep in mind that not one, but two scientific studies at two different universities have already found evidence supporting my hypothesis concerning a connection between mild forms of autism and atheism. It looks increasingly likely that Sam Harris’s attempt to bring neuroscience into religious matters is going to backfire on atheists in a big way.\nBut this should have been obvious from the start, as who is more likely to be aneurotypical, a small and poorly behaved minority or the overwhelming majority? As economists have learned over the last 80 years, Sigmund Freud’s ideas are a very poor basis upon which to build one’s scientific hypotheses.\nOf course, it’s entirely possible that Mr. Harris’s frontal lobes are, at least in part, to blame for his inability to correctly reason through the probable connection between brain development and religious belief, assuming that there is one in the first place.\nUPDATE: Gara complained that I didn’t mention the fact that atheists have higher average IQs than theists. So, I’m rectifying that by quoting myself on the subject of\nsuperior average atheist intelligence\n:\n“I have readily conceded that religious individuals are less intelligent on average than non-believers in general and atheists in particular for years.  However, what the midwits who get very excited about this\nstatistical fact never seem to keep in mind is that because there are so\nmany more religious people, there are considerably more highly\nintelligent religious people than there are highly intelligent\nnon-believers.\nIn fact, the ratio of theists to atheists with Mensa+ level IQs\nis more than 10 to one\n.”",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-14T14:00:00+00:00"
}