{
  "url": "https://voxday.net/2014/01/25/the-fifth-horseman-12/",
  "scraped_at": "2025-12-15T16:44:26.586261",
  "title": "The Fifth Horseman 12",
  "date_display": "January 25, 2014",
  "date_iso": "2014-01-25T14:00:00+00:00",
  "date_from_url": "2014-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the second of Peter Boghossian’s Interventions. In this dialogue, notice how failing to question Boghossian’s naked assertions and blithely agreeing to his inaccurate statements permits him to appear to make his point without ever doing anything more than getting the other person to concur with him. This demonstrates the importance of understanding how the Socratic method can be used to deceive and obscure rather than illuminate.</p><p>To repeat: “the dirty little secret of the Socratic method is the way it can be used<br> to create false dilemmas and illusionary contradictions. This is why<br> you never, ever, grant someone attempting to use it the right to define<br> anything, or even agree with any of their seemingly legitimate<br> statements. Instead, force dictionary definitions on them, as doing so<br> reliably disrupts their attempt to present their false dilemmas as well<br> as calls their credibility into question as they attempt to deny that a<br> dictionary definition is as legitimate as their own question-begging<br> inventions.”</br></br></br></br></br></br></br></br></p><blockquote class=\"tr_bq\"><p> KP: Do you trust your wife?</p><p>PB: To do what? To fly a plane, no. To diagnose a basic medical condition, yes. [My wife is a board certified physician and professor of medicine.]</p><p>KP: Well, I mean, you have faith in your wife.</p><p>PB: Well that’s not the same as trusting my wife, right? Trust and faith are not the same.</p><p>KP: Well, yeah, I mean, you do have faith in your wife, right?<br> <b>VD: Of course they are. Have you never read a thesaurus? They are synonyms. Trust is defined as <i>“reliance on the integrity, strength, ability, surety, etc., of a person or thing”</i>. Faith is defined as <i>“confidence or trust in a person or thing” Trust is a subset of Faith.</i></b></br></p><p>PB: No, actually, no. I don’t have faith in my wife. I trust my wife to do or not do certain things. I trust her to not abuse our children. I trust her to not pull a Lorena Bobbitt on me. But that has nothing to do with faith. Why do you ask?</p><p>KP: I’m asking because you said that faith is always bad, you know. And I think that you have faith.<br> <b>VD: Of course that has something to do with faith. Even by your own definition of faith being the pretense of knowing what you don’t know, it should be obvious that you don’t actually know that your wife hasn’t abused your children. You have no way of knowing that she isn’t planning  to Bobbit you tonight. And furthermore, let’s not forget that you’re pretending to know that your daughter is your child when we both know perfectly well that she isn’t. Look at her! She’s freaking Chinese! You’re not Chinese, Peter. Do the math.</b></br></p><p>PB: What do I have faith in?</p><p>KP: Well, lots of stuff. [Motioning to my wife] Your wife. When you flick a switch the light will go on—</p><p>PB: I have no faith. My life is joyfully devoid of faith.<br>(Mutual laughter)</br></p><p>PB: I don’t have faith that the light will go on when I flick a switch. I know it will both because of past experience and because of the scientific process that enabled that to occur in the first place. Why do you think that has anything to do with faith, or with unwarranted belief?</p><p>KP: Because you don’t know the light will go on.</p><p>PB: That’s true. The light could be burned out—</p><p>KP: So you do have faith that the light isn’t burned out.</p><p>PB: No. I hope the light isn’t burned out, but it’s always possible it is. That’s hope, that’s not faith. I don’t believe it’s burned out unless I see it’s burned out. And if it is burned out, then I’ll just replace it. And I know that replacing it will likely work because of my history with replacing bulbs. So I don’t need faith. Faith isn’t required at all. Or am I missing something? Is my reasoning in error?<br> <b>VD: Yes, your reasoning is in error. You said you know the light will go on when you flick a light switch. But if it doesn’t go on, then obviously you were pretending to know something you didn’t. By your own definition, you had faith that the light would go on, and it was a misplaced faith due to the bulb being burned out or the switch being broken.</b></br></p><p>(Pause)</p><p>KP: No, I guess not.</p><p>PB: So, can we agree that when it comes to my wife, or to flicking a light switch, we don’t need faith?</p><p>(Long pause)</p><p>KP: Yeah, I guess so.<br> <b>VD: No, because you were wrong in both cases. You have faith in your wife. You have faith every time you go to flick a light switch. And your level of knowledge quite clearly doesn’t rise to the level of Webster’s or Roget’s. </b></br></p><p>PB: Cool. So we now need to extend this further and talk about why we don’t need—shouldn’t have—faith at all. Faith, just say no. (Laughter)</p></blockquote><p>I can’t stress this enough. Never simply agree with the Street Epistemologist’s assertions. Make them prove every single statement and every single assertion, no matter how reasonable it sounds, by an objective source. They will not be able to do so because Boghossian’s entire approach is a verbal Three-Card-Monte, and by forcing them to show all of their cards, you will expose the game for the intellectually fraudulent one it is.</p></div>",
  "content_text": "This is the second of Peter Boghossian’s Interventions. In this dialogue, notice how failing to question Boghossian’s naked assertions and blithely agreeing to his inaccurate statements permits him to appear to make his point without ever doing anything more than getting the other person to concur with him. This demonstrates the importance of understanding how the Socratic method can be used to deceive and obscure rather than illuminate.\nTo repeat: “the dirty little secret of the Socratic method is the way it can be used\nto create false dilemmas and illusionary contradictions. This is why\nyou never, ever, grant someone attempting to use it the right to define\nanything, or even agree with any of their seemingly legitimate\nstatements. Instead, force dictionary definitions on them, as doing so\nreliably disrupts their attempt to present their false dilemmas as well\nas calls their credibility into question as they attempt to deny that a\ndictionary definition is as legitimate as their own question-begging\ninventions.”\nKP: Do you trust your wife?\nPB: To do what? To fly a plane, no. To diagnose a basic medical condition, yes. [My wife is a board certified physician and professor of medicine.]\nKP: Well, I mean, you have faith in your wife.\nPB: Well that’s not the same as trusting my wife, right? Trust and faith are not the same.\nKP: Well, yeah, I mean, you do have faith in your wife, right?\nVD: Of course they are. Have you never read a thesaurus? They are synonyms. Trust is defined as\n“reliance on the integrity, strength, ability, surety, etc., of a person or thing”\n. Faith is defined as\n“confidence or trust in a person or thing” Trust is a subset of Faith.\nPB: No, actually, no. I don’t have faith in my wife. I trust my wife to do or not do certain things. I trust her to not abuse our children. I trust her to not pull a Lorena Bobbitt on me. But that has nothing to do with faith. Why do you ask?\nKP: I’m asking because you said that faith is always bad, you know. And I think that you have faith.\nVD: Of course that has something to do with faith. Even by your own definition of faith being the pretense of knowing what you don’t know, it should be obvious that you don’t actually know that your wife hasn’t abused your children. You have no way of knowing that she isn’t planning  to Bobbit you tonight. And furthermore, let’s not forget that you’re pretending to know that your daughter is your child when we both know perfectly well that she isn’t. Look at her! She’s freaking Chinese! You’re not Chinese, Peter. Do the math.\nPB: What do I have faith in?\nKP: Well, lots of stuff. [Motioning to my wife] Your wife. When you flick a switch the light will go on—\nPB: I have no faith. My life is joyfully devoid of faith.\n(Mutual laughter)\nPB: I don’t have faith that the light will go on when I flick a switch. I know it will both because of past experience and because of the scientific process that enabled that to occur in the first place. Why do you think that has anything to do with faith, or with unwarranted belief?\nKP: Because you don’t know the light will go on.\nPB: That’s true. The light could be burned out—\nKP: So you do have faith that the light isn’t burned out.\nPB: No. I hope the light isn’t burned out, but it’s always possible it is. That’s hope, that’s not faith. I don’t believe it’s burned out unless I see it’s burned out. And if it is burned out, then I’ll just replace it. And I know that replacing it will likely work because of my history with replacing bulbs. So I don’t need faith. Faith isn’t required at all. Or am I missing something? Is my reasoning in error?\nVD: Yes, your reasoning is in error. You said you know the light will go on when you flick a light switch. But if it doesn’t go on, then obviously you were pretending to know something you didn’t. By your own definition, you had faith that the light would go on, and it was a misplaced faith due to the bulb being burned out or the switch being broken.\n(Pause)\nKP: No, I guess not.\nPB: So, can we agree that when it comes to my wife, or to flicking a light switch, we don’t need faith?\n(Long pause)\nKP: Yeah, I guess so.\nVD: No, because you were wrong in both cases. You have faith in your wife. You have faith every time you go to flick a light switch. And your level of knowledge quite clearly doesn’t rise to the level of Webster’s or Roget’s.\nPB: Cool. So we now need to extend this further and talk about why we don’t need—shouldn’t have—faith at all. Faith, just say no. (Laughter)\nI can’t stress this enough. Never simply agree with the Street Epistemologist’s assertions. Make them prove every single statement and every single assertion, no matter how reasonable it sounds, by an objective source. They will not be able to do so because Boghossian’s entire approach is a verbal Three-Card-Monte, and by forcing them to show all of their cards, you will expose the game for the intellectually fraudulent one it is.",
  "tags": [
    "atheism",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-25T14:00:00+00:00"
}