{
  "url": "https://voxday.net/2014/01/15/the-10-blocks-of-immigration/",
  "scraped_at": "2025-12-15T16:43:21.414474",
  "title": "The 10 blocks of immigration",
  "date_display": "January 15, 2014",
  "date_iso": "2014-01-15T14:00:00+00:00",
  "date_from_url": "2014-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paul Collier has <a href=\"http://www.newstatesman.com/global-issues/2013/11/new-exodus\">an excellent article in the New Statesman</a> summarizing what should be the beginning point for any rational discussion on immigration. And you will note that NONE of the points of evidence are in harmony with the assumptions that are taken for granted by most pro-immigrationists, whereas many of them are in-line with anti-immigration policies.</p><blockquote class=\"tr_bq\"><p> <b>Block 1</b> Around 40 per cent of the population of<br> poor countries say that they would emigrate if they could. There is<br> evidence that suggests this figure is not a wild exaggeration of how<br> people would behave. If migration happened on anything approaching this<br> scale, the host societies would suffer substantial reductions in living<br> standards. Hence, in attractive countries, immigration controls are<br> essential.</br></br></br></br></br></br></p><p><b>Block 2</b> Diasporas accelerate migration. By<br> “diasporas”, I mean those immigrants and their descendants who have<br> retained strong links with their home societies, rather than cutting<br> loose and integrating into their host societies. These links cut the<br> costs of migration and so fuel it. As a result, while diasporas are<br> growing, migration is accelerating. Diasporas continue to increase until<br> immigration is matched by the rate at which immigrants and their<br> offspring are absorbed into the general population. A crucial<br> implication of this interconnection is that the policies for migration<br> and diasporas must be compatible.</br></br></br></br></br></br></br></br></br></p><p><b>Block 3</b> Most immigrants prefer to retain their own<br> culture and hence to cluster together. This reduces the speed at which<br> diasporas are absorbed into the general population. The slower the rate<br> at which they are absorbed, the lower the rate of immigration that is<br> compatible with stable diasporas and migration. By design, absorption is<br> slower with multicultural policies than with assimilative policies.</br></br></br></br></br></p><p><b>Block 4</b> Migration from poor countries to rich ones<br> is driven by the wide gap in income between them. This gap is the moral<br> horror story of our times. The difference in incomes is ultimately due<br> to differences in political and social structures: poor countries have<br> political and social systems that are less functional than those in rich<br> ones. Their dysfunctional systems persist in part because they are<br> embedded in the identities and narratives of local cultures. Migrants<br> are escaping the consequences of their systems but usually bring their<br> culture with them.</br></br></br></br></br></br></br></br></p><p><b>Block 5</b> In economic terms, migrants are the<br> principal beneficiaries of migration but many suffer a wrenching<br> psychological shock. As far as can be judged from the net effect on<br> happiness, the economic gains and psychological costs broadly offset<br> each other, although the evidence on this is currently sketchy.</br></br></br></br></p><p><b>Block 6</b> Because migration is costly, migrants are<br> not among the poorest people in their home countries. The effect on<br> those left behind depends ultimately on whether emigrants speed<br> political and social change back home or slow it down. A modest rate of<br> emigration, as experienced by China and India, helps, especially if many<br> migrants return home. However, an exodus of the young and skilled – as<br> suffered by Haiti, for example – causes a haemorrhage that traps the<br> society in poverty.</br></br></br></br></br></br></br></p><p><b>Block 7</b> In high-income societies, the effect of<br> immigration on the average incomes of the indigenous population is<br> trivial. Economies are not damaged by immigration; nor do they need it.<br> The distributional effects can be more substantial but they depend on<br> the composition of immigration. In Australia, which permits only the immigration of the skilled, the<br> working classes probably gain from having more skilled people to work<br> with. In Europe, which attracts many low-skilled migrants, the<br> indigenous poor probably lose out through competition for social<br> housing, welfare, training and work. The clearest effect on the jobs<br> market is that new migrants compete with existing migrants, who would<br> consequently be substantial beneficiaries of tighter controls.</br></br></br></br></br></br></br></br></br></br></p><p><b>Block 8</b> The social effects of immigration outweigh<br> the economic, so they should be the main criteria for policy. These<br> effects come from diversity. Diversity increases variety and this<br> widening of choices and horizons is a social gain. Yet diversity also potentially jeopardises co-operation and<br> generosity. Co-operation rests on co-ordination games that support both<br> the provision of public goods and myriad socially enforced conventions.<br> Generosity rests on a widespread sense of mutual regard that supports<br> welfare systems. Both public goods and welfare systems benefit the<br> indigenous poor, which means they are the group most at risk of loss. As<br> diversity increases, the additional benefits of variety get smaller,<br> whereas the risks to co-operation and generosity get greater. Each host<br> society has an ideal level of diversity and hence an ideal size of<br> diasporas.</br></br></br></br></br></br></br></br></br></br></br></br></p><p><b>Block 9</b> The control of immigration is a human<br> right. The group instinct to defend territory is common throughout the<br> animal kingdom; it is likely to be even more fundamental than the<br> individual right to property. The right to control immigration is<br> asserted by all societies. You do not have the automatic right to move<br/> to Kuwait; nor do the Chinese have the automatic right to move to<br/> Angola, although millions would if they could. Nor do Bangladeshis have<br/> the automatic right to move to Britain and claim a share of its social<br/> and economic capital. It sometimes makes sense to grant the right to migrate on a<br/> reciprocal basis. Thousands of French people want to live in Britain,<br/> while thousands of Britons want to live in France. Yet if flows become<br/> too unbalanced, rights derived from mutual advantage can be withdrawn:<br/> Australia, for instance, withdrew them from Britain. The expansion of<br/> the EU has created these unbalanced situations and the original<br/> reciprocal right may therefore need modification.</br></br></br></br></p><p><b>Block 10 </b>Migration is not an inevitable consequence<br/> of globalisation. The vast expansion in trade and capital flows among<br/> developed countries has coincided with a decline in migration between<br/> them.</p></blockquote><p>Block 8 is partially incorrect, and even that quasi-error is mitigated by the fact that Collier points out that while the “widening of choices and horizons is a social gain”, diversity itself is not. Block 7, of course, is completely wrong, as evidenced by American post-1973 wage stagnation.</p><p>The biggest falsehood concerning immigration is that it is good for the economy. I’ll address this in a future post, but the TL;DR version can be understood by simply comparing GDP and immigration rates from 1900 to 2010.</p></div>",
  "content_text": "Paul Collier has\nan excellent article in the New Statesman\nsummarizing what should be the beginning point for any rational discussion on immigration. And you will note that NONE of the points of evidence are in harmony with the assumptions that are taken for granted by most pro-immigrationists, whereas many of them are in-line with anti-immigration policies.\nBlock 1\nAround 40 per cent of the population of\npoor countries say that they would emigrate if they could. There is\nevidence that suggests this figure is not a wild exaggeration of how\npeople would behave. If migration happened on anything approaching this\nscale, the host societies would suffer substantial reductions in living\nstandards. Hence, in attractive countries, immigration controls are\nessential.\nBlock 2\nDiasporas accelerate migration. By\n“diasporas”, I mean those immigrants and their descendants who have\nretained strong links with their home societies, rather than cutting\nloose and integrating into their host societies. These links cut the\ncosts of migration and so fuel it. As a result, while diasporas are\ngrowing, migration is accelerating. Diasporas continue to increase until\nimmigration is matched by the rate at which immigrants and their\noffspring are absorbed into the general population. A crucial\nimplication of this interconnection is that the policies for migration\nand diasporas must be compatible.\nBlock 3\nMost immigrants prefer to retain their own\nculture and hence to cluster together. This reduces the speed at which\ndiasporas are absorbed into the general population. The slower the rate\nat which they are absorbed, the lower the rate of immigration that is\ncompatible with stable diasporas and migration. By design, absorption is\nslower with multicultural policies than with assimilative policies.\nBlock 4\nMigration from poor countries to rich ones\nis driven by the wide gap in income between them. This gap is the moral\nhorror story of our times. The difference in incomes is ultimately due\nto differences in political and social structures: poor countries have\npolitical and social systems that are less functional than those in rich\nones. Their dysfunctional systems persist in part because they are\nembedded in the identities and narratives of local cultures. Migrants\nare escaping the consequences of their systems but usually bring their\nculture with them.\nBlock 5\nIn economic terms, migrants are the\nprincipal beneficiaries of migration but many suffer a wrenching\npsychological shock. As far as can be judged from the net effect on\nhappiness, the economic gains and psychological costs broadly offset\neach other, although the evidence on this is currently sketchy.\nBlock 6\nBecause migration is costly, migrants are\nnot among the poorest people in their home countries. The effect on\nthose left behind depends ultimately on whether emigrants speed\npolitical and social change back home or slow it down. A modest rate of\nemigration, as experienced by China and India, helps, especially if many\nmigrants return home. However, an exodus of the young and skilled – as\nsuffered by Haiti, for example – causes a haemorrhage that traps the\nsociety in poverty.\nBlock 7\nIn high-income societies, the effect of\nimmigration on the average incomes of the indigenous population is\ntrivial. Economies are not damaged by immigration; nor do they need it.\nThe distributional effects can be more substantial but they depend on\nthe composition of immigration. In Australia, which permits only the immigration of the skilled, the\nworking classes probably gain from having more skilled people to work\nwith. In Europe, which attracts many low-skilled migrants, the\nindigenous poor probably lose out through competition for social\nhousing, welfare, training and work. The clearest effect on the jobs\nmarket is that new migrants compete with existing migrants, who would\nconsequently be substantial beneficiaries of tighter controls.\nBlock 8\nThe social effects of immigration outweigh\nthe economic, so they should be the main criteria for policy. These\neffects come from diversity. Diversity increases variety and this\nwidening of choices and horizons is a social gain. Yet diversity also potentially jeopardises co-operation and\ngenerosity. Co-operation rests on co-ordination games that support both\nthe provision of public goods and myriad socially enforced conventions.\nGenerosity rests on a widespread sense of mutual regard that supports\nwelfare systems. Both public goods and welfare systems benefit the\nindigenous poor, which means they are the group most at risk of loss. As\ndiversity increases, the additional benefits of variety get smaller,\nwhereas the risks to co-operation and generosity get greater. Each host\nsociety has an ideal level of diversity and hence an ideal size of\ndiasporas.\nBlock 9\nThe control of immigration is a human\nright. The group instinct to defend territory is common throughout the\nanimal kingdom; it is likely to be even more fundamental than the\nindividual right to property. The right to control immigration is\nasserted by all societies. You do not have the automatic right to move\nto Kuwait; nor do the Chinese have the automatic right to move to\nAngola, although millions would if they could. Nor do Bangladeshis have\nthe automatic right to move to Britain and claim a share of its social\nand economic capital. It sometimes makes sense to grant the right to migrate on a\nreciprocal basis. Thousands of French people want to live in Britain,\nwhile thousands of Britons want to live in France. Yet if flows become\ntoo unbalanced, rights derived from mutual advantage can be withdrawn:\nAustralia, for instance, withdrew them from Britain. The expansion of\nthe EU has created these unbalanced situations and the original\nreciprocal right may therefore need modification.\nBlock 10\nMigration is not an inevitable consequence\nof globalisation. The vast expansion in trade and capital flows among\ndeveloped countries has coincided with a decline in migration between\nthem.\nBlock 8 is partially incorrect, and even that quasi-error is mitigated by the fact that Collier points out that while the “widening of choices and horizons is a social gain”, diversity itself is not. Block 7, of course, is completely wrong, as evidenced by American post-1973 wage stagnation.\nThe biggest falsehood concerning immigration is that it is good for the economy. I’ll address this in a future post, but the TL;DR version can be understood by simply comparing GDP and immigration rates from 1900 to 2010.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-15T14:00:00+00:00"
}