{
  "url": "https://voxday.net/2014/01/16/the-fifth-horseman-4/",
  "scraped_at": "2025-12-15T16:43:32.173530",
  "title": "The Fifth Horseman 4",
  "date_display": "January 16, 2014",
  "date_iso": "2014-01-16T18:00:00+00:00",
  "date_from_url": "2014-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This next anti-apologetic is particularly fascinating in light of the recent conversation I had on Twitter with one of Peter Boghossian’s Street Epistemologists named Blake. Blake staunchly defended the idea that there might have been an eternal universe consisting of Skittles, luminiferous aether, and highly compressed phlogiston prior to the Big Bang because, and I quote: “as far as what was before the Big Bang, (if that even makes sense), I just don’t know, and you don’t either.”</p><p><b>ANTI-APOLOGETIC #2  </b></p><blockquote class=\"tr_bq\"><p> <i>“You can’t prove there’s not a God.”</i></p><p>I try to have patience when I hear this. What’s perpetually surprising about this defense is that I hear it from people all over the intellectual and educational spectrum. The basic idea is that because you can’t prove that there’s not a God, then God must exist. Of all of the defenses of faith, it is most difficult to comprehend how someone could actually offer this as a legitimate defense for faith or for belief in God.</p><p>To rebut this, I talk about little blue creatures living inside Venus. Clearly one cannot prove there are no little blue men living inside Venus. I then ask the question directly, “Do you believe there are little blue men living inside the planet Venus?”</p><p>There are basically three answers for this: yes, no, or I don’t know. If they say “yes,” then I change the color to yellow. I continue to change the color until they admit that not all the men I’ve described can physically live inside the planet. I then repeat the question and ask if they believe there are little blue men living inside Venus.</p><p>If they say “no,” I reply, “Why not? You can’t prove it not to be true.” Most people will get the point and then say there’s something different about God. That is, this line of argument works against everything except God. (Here I’m reminded of defenders of Anselm’s argument for the existence of God. Every time someone would bring up an objection, they’d state that the argument only works with God.) When the respondent says there is something special about God that makes this argument not work, then I always press them to know what’s different about God. I’ve yet to hear a coherent answer to this question.</p><p>If they respond, “I don’t know,” to the question of little blue men living inside Venus, I ask them why they don’t take the same stance with God and say, “I don’t know.”</p><p>Finally, I ask, “What evidence could I give you that would prove God doesn’t exist? Can you please give me a specific example of exactly what that evidence would look like?” Because it’s not possible to have a justified belief in God due to the fact that there’s insufficient evidence to warrant this belief, very few people have been able to cogently answer the question. I then use the discussion as a springboard to suggest that they don’t believe in God on the basis of the evidence. From here it’s a rocky but clear path to, “One ought not believe in something for which there’s insufficient evidence.”</p></blockquote><p>Here Boghossian completely fails to understand the point of the defense he is trying to attack. He’s surprised because he is erroneously assuming that it is the basis for an assertion rather than the response to an attack which it obviously is. (This is more evidence of Boghossian’s social autism; it’s typical of many of the more socially awkward atheists that they cannot distinguish between an attack and a defense.) The basic idea is not that because you can’t prove that there’s not a God then God must exist, but rather because you can’t prove that there is not a God, then you cannot say there is not a God. And no faith is needed to posit that God exists and has always existed.</p><p>Which Boghossian should understand, given that in Anti-Apologetic #1, he stated: “The possibility that the universe always existed cannot be ruled out…. No faith is needed to posit that the universe may have always existed.”</p><p><b>VD RESPONSE:</b> I don’t believe that little blue men live inside Venus. The human body, regardless of size or color, is incapable of surviving temperatures on the surface of Venus, let alone inside Venus’s iron core. Therefore, it should be readily apparent that little blue men cannot live there. Furthermore, there is no testimonial or documentary evidence of little blue men on Venus, whereas there is a vast quantity of testimonial and documentary evidence in favor of the existence of God.</p><p>I will be happy to tell you what evidence you could give me that would prove God doesn’t exist if you agree to tell me what evidence I could give you to prove that God does exist. Are we agreed? Very well. If the human race could collectively go one single 7-day period without committing any of the acts that God describes as sins in the Bible, I would agree that God doesn’t exist. If God does not exist and evil is nothing more than how we happen to describe certain human choices, then obviously it is possible for Man to not commit evil as it is described in the Bible as the violation of God’s Will. In fact, even if only 10 people could manage to go about their normal daily lives for a single week without sin, I think this would be a remarkable piece of evidence against the existence of God.</p><p>If, however, Man cannot refrain from committing evil despite consciously choosing to do so, then obviously the Biblical model of fallen Man is more in line with observable reality than the godless model, thereby indicating that Man’s morality is defined by the Will of an existent God.</p><p>So, what evidence are you willing to accept that you would consider conclusive regarding the existence of God?</p><p><b>ANTI-APOLOGETIC #14</b></p><blockquote class=\"tr_bq\"><p> <b>Defense: </b>“You should never say such things. You’ll offend people and they’ll think you’re a jerk.”</p><p><b>Response: </b>“What people believe, and how they act, matter. They particularly matter in a democracy where people have a certain amount of influence over the lives of their fellow citizens. My intent is not to be a jerk. I don’t buy into the notion that criticizing an idea makes me a bad person. A criticism of an idea is not the same as a criticism of a person. We are not our ideas. Ideas don’t deserve dignity; people deserve dignity. I’m criticizing an idea because that idea is not true, and the fact that people think it is true has dangerous consequences.” </p></blockquote><p><b>VD RESPONSE:</b> First of all, you don’t live in a democracy. You live in a corrupt imperial republic imposed by force and ruled by a bi-factional oligarchy, in which the people have absolutely no amount of influence over the lives of their fellow citizens regardless of how they vote. Your argument is based on a false premise. And more importantly, it doesn’t matter what your intent is, the observable fact is that you are acting like a jerk. You are violating basic social etiquette and the fact that you genuinely can’t see that your behavior is offensive indicates you may have a neurological abnormality that prevents you from grasping normal human socio-sexual relations. You know how you complain about women not liking you? Well, Sherlock, here’s your first clue.</p><p>Furthermore, Peter Boghossian wrote that “tolerance has been perverted into another value that undermines reason”. So, you’re not merely a jerk, you’re an intolerant jerk. You’re every bit as intolerant as the Saudi clerics who run around whipping girls who dress improperly, only you’re running around verbally abusing everyone you think believes improperly. And what’s more, you’re revealing yourself to be either dishonest or incredibly forgetful. You said it is wrong to pretend to know what you don’t know, you also said that we can’t know if God exists or not, and now you’re saying that you know that idea is not true. Are you even listening to yourself? Because you are speaking out of both sides of your mouth.</p><p>You said how people act matters. I suggest you look at your own actions! Is it really your intention to go through life with everyone correctly seeing you as a dishonest, intolerant jerk and avoiding you if they can? Is that really what reason dictates?</p></div>",
  "content_text": "This next anti-apologetic is particularly fascinating in light of the recent conversation I had on Twitter with one of Peter Boghossian’s Street Epistemologists named Blake. Blake staunchly defended the idea that there might have been an eternal universe consisting of Skittles, luminiferous aether, and highly compressed phlogiston prior to the Big Bang because, and I quote: “as far as what was before the Big Bang, (if that even makes sense), I just don’t know, and you don’t either.”\nANTI-APOLOGETIC #2\n“You can’t prove there’s not a God.”\nI try to have patience when I hear this. What’s perpetually surprising about this defense is that I hear it from people all over the intellectual and educational spectrum. The basic idea is that because you can’t prove that there’s not a God, then God must exist. Of all of the defenses of faith, it is most difficult to comprehend how someone could actually offer this as a legitimate defense for faith or for belief in God.\nTo rebut this, I talk about little blue creatures living inside Venus. Clearly one cannot prove there are no little blue men living inside Venus. I then ask the question directly, “Do you believe there are little blue men living inside the planet Venus?”\nThere are basically three answers for this: yes, no, or I don’t know. If they say “yes,” then I change the color to yellow. I continue to change the color until they admit that not all the men I’ve described can physically live inside the planet. I then repeat the question and ask if they believe there are little blue men living inside Venus.\nIf they say “no,” I reply, “Why not? You can’t prove it not to be true.” Most people will get the point and then say there’s something different about God. That is, this line of argument works against everything except God. (Here I’m reminded of defenders of Anselm’s argument for the existence of God. Every time someone would bring up an objection, they’d state that the argument only works with God.) When the respondent says there is something special about God that makes this argument not work, then I always press them to know what’s different about God. I’ve yet to hear a coherent answer to this question.\nIf they respond, “I don’t know,” to the question of little blue men living inside Venus, I ask them why they don’t take the same stance with God and say, “I don’t know.”\nFinally, I ask, “What evidence could I give you that would prove God doesn’t exist? Can you please give me a specific example of exactly what that evidence would look like?” Because it’s not possible to have a justified belief in God due to the fact that there’s insufficient evidence to warrant this belief, very few people have been able to cogently answer the question. I then use the discussion as a springboard to suggest that they don’t believe in God on the basis of the evidence. From here it’s a rocky but clear path to, “One ought not believe in something for which there’s insufficient evidence.”\nHere Boghossian completely fails to understand the point of the defense he is trying to attack. He’s surprised because he is erroneously assuming that it is the basis for an assertion rather than the response to an attack which it obviously is. (This is more evidence of Boghossian’s social autism; it’s typical of many of the more socially awkward atheists that they cannot distinguish between an attack and a defense.) The basic idea is not that because you can’t prove that there’s not a God then God must exist, but rather because you can’t prove that there is not a God, then you cannot say there is not a God. And no faith is needed to posit that God exists and has always existed.\nWhich Boghossian should understand, given that in Anti-Apologetic #1, he stated: “The possibility that the universe always existed cannot be ruled out…. No faith is needed to posit that the universe may have always existed.”\nVD RESPONSE:\nI don’t believe that little blue men live inside Venus. The human body, regardless of size or color, is incapable of surviving temperatures on the surface of Venus, let alone inside Venus’s iron core. Therefore, it should be readily apparent that little blue men cannot live there. Furthermore, there is no testimonial or documentary evidence of little blue men on Venus, whereas there is a vast quantity of testimonial and documentary evidence in favor of the existence of God.\nI will be happy to tell you what evidence you could give me that would prove God doesn’t exist if you agree to tell me what evidence I could give you to prove that God does exist. Are we agreed? Very well. If the human race could collectively go one single 7-day period without committing any of the acts that God describes as sins in the Bible, I would agree that God doesn’t exist. If God does not exist and evil is nothing more than how we happen to describe certain human choices, then obviously it is possible for Man to not commit evil as it is described in the Bible as the violation of God’s Will. In fact, even if only 10 people could manage to go about their normal daily lives for a single week without sin, I think this would be a remarkable piece of evidence against the existence of God.\nIf, however, Man cannot refrain from committing evil despite consciously choosing to do so, then obviously the Biblical model of fallen Man is more in line with observable reality than the godless model, thereby indicating that Man’s morality is defined by the Will of an existent God.\nSo, what evidence are you willing to accept that you would consider conclusive regarding the existence of God?\nANTI-APOLOGETIC #14\nDefense:\n“You should never say such things. You’ll offend people and they’ll think you’re a jerk.”\nResponse:\n“What people believe, and how they act, matter. They particularly matter in a democracy where people have a certain amount of influence over the lives of their fellow citizens. My intent is not to be a jerk. I don’t buy into the notion that criticizing an idea makes me a bad person. A criticism of an idea is not the same as a criticism of a person. We are not our ideas. Ideas don’t deserve dignity; people deserve dignity. I’m criticizing an idea because that idea is not true, and the fact that people think it is true has dangerous consequences.”\nVD RESPONSE:\nFirst of all, you don’t live in a democracy. You live in a corrupt imperial republic imposed by force and ruled by a bi-factional oligarchy, in which the people have absolutely no amount of influence over the lives of their fellow citizens regardless of how they vote. Your argument is based on a false premise. And more importantly, it doesn’t matter what your intent is, the observable fact is that you are acting like a jerk. You are violating basic social etiquette and the fact that you genuinely can’t see that your behavior is offensive indicates you may have a neurological abnormality that prevents you from grasping normal human socio-sexual relations. You know how you complain about women not liking you? Well, Sherlock, here’s your first clue.\nFurthermore, Peter Boghossian wrote that “tolerance has been perverted into another value that undermines reason”. So, you’re not merely a jerk, you’re an intolerant jerk. You’re every bit as intolerant as the Saudi clerics who run around whipping girls who dress improperly, only you’re running around verbally abusing everyone you think believes improperly. And what’s more, you’re revealing yourself to be either dishonest or incredibly forgetful. You said it is wrong to pretend to know what you don’t know, you also said that we can’t know if God exists or not, and now you’re saying that you know that idea is not true. Are you even listening to yourself? Because you are speaking out of both sides of your mouth.\nYou said how people act matters. I suggest you look at your own actions! Is it really your intention to go through life with everyone correctly seeing you as a dishonest, intolerant jerk and avoiding you if they can? Is that really what reason dictates?",
  "tags": [
    "atheism",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-16T18:00:00+00:00"
}