{
  "url": "https://voxday.net/2014/01/18/the-fifth-horseman-6/",
  "scraped_at": "2025-12-15T16:43:44.656181",
  "title": "The Fifth Horseman 6",
  "date_display": "January 18, 2014",
  "date_iso": "2014-01-18T13:43:00+00:00",
  "date_from_url": "2014-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><b>ANTI-APOLOGETIC</b> #4</b></p><blockquote class=\"tr_bq\"><p> “My faith is true for me” is rarely heard among more sophisticated believers and almost never heard among fundamentalists.</p><p>It is very difficult to explain why this claim is fallacious because often the type of person who makes this statement does not have the intellectual or educational wherewithal to understand more thoughtful, substantive responses. (The exceptions are the youthful solipsists, the postmodernists, and the epistemological and cognitive relativists.)</p><p>The statement, “My faith is true for me,” means the faith-based beliefs one holds are true for the speaker and not necessarily for other people. The utterer of this statement is not making claims about faith beliefs being universally true—that is, true for all people.</p><p>Here’s my response: does your faith tradition include statements of fact about the world? For example, humans are thetans trapped on Earth in physical bodies, Jesus walked on water, the ability to fly can result from fasting (Jacobsen, 2011), or the Garden of Eden is in Jackson County, Missouri.</p><p>If your faith tradition includes no empirical statements, then it’s unclear what your faith tradition entails. However, if your faith tradition makes empirical claims (and all faith claims that fall within the domain of religion make empirical claims), then what you’re saying is that your belief is true for you, regardless of how the world actually is. Since the world is the way it is regardless of our beliefs or of the epistemology we use to know the world, “my faith is true for me” is a nonsensical statement. One can have faith that if one jumps out of a twenty-story window one will polymorph into an eagle and fly to safety. This doesn’t make it the case.</p><p>What one is really saying when one states, “My faith is true for me,” is, “I prefer my delusions, and I wish to remain with them in spite of the evidence.”</p></blockquote><p>Once more, we see Boghossian making an appeal to his personal incredulity. And the fact that some people may not understand “more thoughtful substantive responses” explaining why the statement is fallacious does not mean that it is difficult to explain why it is fallacious. After all, Boggie correctly notes that the youthful solipsists, the postmodernists, and the epistemological and cognitive relativists all have the intellectual wherewithal to understand any such explanation, and yet Boghossian does not provide one.</p><p>As will become clear from my recommended response, it’s not hard to understand why Boghossian doesn’t want to explain why the statement is fallacious. Nevertheless, because I am not a relativist, I would not recommend relying upon this particular defense of faith except as a rhetorical feint that is a prelude to an attack on unwarranted atheist morality claims.</p><p><b>VD RESPONSE:</b> My claim that my faith is true for me is no different than your claim that your morality is true for you. Do you believe that some actions are good and others are evil? Do you believe that some actions are objectively desirable and others are objectively undesirable? If one believes in an objective moral Law that is universally applicable to everyone, then one must necessarily believe in a Lawgiver.</p><p>However, since you reject the existence of the Lawgiver, we know you also reject the existence of an objective universal moral law. Therefore the limits of your moral claims extend no farther than you. What you’re saying is that your moral beliefs are true for you, regardless of what the moral law actually is. You’re saying that you prefer to act however you momentarily desire, regardless of the morality of your actions.</p><p>This is why even atheists believe other atheists are less trustworthy than believers. And the bloody history of atheist rule has shown that people whose moral reality is subjective are far more dangerous to the world than people whose perception of reality is subjective. The subjective believer may be delusional and dangerous to himself, but the subjective moralist is not only delusional, he is dangerous to everyone else.</p><p><b>ANTI-APOLOGETIC #16</b></p><blockquote class=\"tr_bq\"><p> <b>Defense:</b> “Atheism and secular humanism are as much a religion—and require as much faith—as any religion. Atheists and secular humanists love to equivocate on religious issues—claiming they are not religious and are free of religious bias—but they are no less religious or faithful than anyone else. They are not aware of their own faith and are blind to their biases. There is a saying: ‘There are no nonreligious people, only false Gods.’”</p><p><b>Response:</b> “Confusing atheism with secular humanism demonstrates a fundamental misunderstanding as to what the terms mean. Secular humanism is a philosophy and a set of ideals; atheism is simply the lack of belief in a God or Gods. There is no dogma attached to nonbelief in a divine Shiva the Destroyer. And, as to the saying—it’s silly. To assert that people are incapable of letting go of belief in mythological fairytales without attaching themselves to some other form of worship is narrow-minded, condescending, pessimistic, and without evidential merit.”</p></blockquote><p><b>VD RESPONSE:</b> How can you possibly think that is an adequate response? You are providing an example of the very evidence you claim does not exist! You are responding to a charge of atheist equivocation by blatantly equivocating! The claim was that atheism and secular humanism were religions that required faith… and your response is to say that atheism is not secular humanism? That is a complete non sequitur.</p><p>As a Street Epistemologist, you are an atheist who is actively selling secular humanism, a specific “humanistic vision” as Peter Boghossian describes it, and yet the moment you’re called on what you are doing, which is religious proselytizing, you retreat to pretending that your atheism is totally unrelated to your secular humanism.  And describing secular humanism as “a philosophy and a set of ideals” doesn’t mean that secular humanism isn’t a religion. Quite to the contrary, by describing it that way you have admitted that it is “a specific fundamental set of beliefs and practices generally agreed upon by a number of persons”. That is the literal dictionary definition of a religion!</p><p>You are not merely religious, you are a religious fanatic. You’re the secular humanist version of the crazy guy raving about the End of Days in the park.</p><p>As for atheism, it is merely a specific belief that is a subset of the secular humanist religion. Your position is no more reasonable than a Southern Baptist who doesn’t believe in infant baptism claiming that his lack of belief in infant baptism means he isn’t a theist. That sounds absurd, but it is no less absurd than your attempt to delink atheism from secular humanism.</p></div>",
  "content_text": "ANTI-APOLOGETIC\n#4\n“My faith is true for me” is rarely heard among more sophisticated believers and almost never heard among fundamentalists.\nIt is very difficult to explain why this claim is fallacious because often the type of person who makes this statement does not have the intellectual or educational wherewithal to understand more thoughtful, substantive responses. (The exceptions are the youthful solipsists, the postmodernists, and the epistemological and cognitive relativists.)\nThe statement, “My faith is true for me,” means the faith-based beliefs one holds are true for the speaker and not necessarily for other people. The utterer of this statement is not making claims about faith beliefs being universally true—that is, true for all people.\nHere’s my response: does your faith tradition include statements of fact about the world? For example, humans are thetans trapped on Earth in physical bodies, Jesus walked on water, the ability to fly can result from fasting (Jacobsen, 2011), or the Garden of Eden is in Jackson County, Missouri.\nIf your faith tradition includes no empirical statements, then it’s unclear what your faith tradition entails. However, if your faith tradition makes empirical claims (and all faith claims that fall within the domain of religion make empirical claims), then what you’re saying is that your belief is true for you, regardless of how the world actually is. Since the world is the way it is regardless of our beliefs or of the epistemology we use to know the world, “my faith is true for me” is a nonsensical statement. One can have faith that if one jumps out of a twenty-story window one will polymorph into an eagle and fly to safety. This doesn’t make it the case.\nWhat one is really saying when one states, “My faith is true for me,” is, “I prefer my delusions, and I wish to remain with them in spite of the evidence.”\nOnce more, we see Boghossian making an appeal to his personal incredulity. And the fact that some people may not understand “more thoughtful substantive responses” explaining why the statement is fallacious does not mean that it is difficult to explain why it is fallacious. After all, Boggie correctly notes that the youthful solipsists, the postmodernists, and the epistemological and cognitive relativists all have the intellectual wherewithal to understand any such explanation, and yet Boghossian does not provide one.\nAs will become clear from my recommended response, it’s not hard to understand why Boghossian doesn’t want to explain why the statement is fallacious. Nevertheless, because I am not a relativist, I would not recommend relying upon this particular defense of faith except as a rhetorical feint that is a prelude to an attack on unwarranted atheist morality claims.\nVD RESPONSE:\nMy claim that my faith is true for me is no different than your claim that your morality is true for you. Do you believe that some actions are good and others are evil? Do you believe that some actions are objectively desirable and others are objectively undesirable? If one believes in an objective moral Law that is universally applicable to everyone, then one must necessarily believe in a Lawgiver.\nHowever, since you reject the existence of the Lawgiver, we know you also reject the existence of an objective universal moral law. Therefore the limits of your moral claims extend no farther than you. What you’re saying is that your moral beliefs are true for you, regardless of what the moral law actually is. You’re saying that you prefer to act however you momentarily desire, regardless of the morality of your actions.\nThis is why even atheists believe other atheists are less trustworthy than believers. And the bloody history of atheist rule has shown that people whose moral reality is subjective are far more dangerous to the world than people whose perception of reality is subjective. The subjective believer may be delusional and dangerous to himself, but the subjective moralist is not only delusional, he is dangerous to everyone else.\nANTI-APOLOGETIC #16\nDefense:\n“Atheism and secular humanism are as much a religion—and require as much faith—as any religion. Atheists and secular humanists love to equivocate on religious issues—claiming they are not religious and are free of religious bias—but they are no less religious or faithful than anyone else. They are not aware of their own faith and are blind to their biases. There is a saying: ‘There are no nonreligious people, only false Gods.’”\nResponse:\n“Confusing atheism with secular humanism demonstrates a fundamental misunderstanding as to what the terms mean. Secular humanism is a philosophy and a set of ideals; atheism is simply the lack of belief in a God or Gods. There is no dogma attached to nonbelief in a divine Shiva the Destroyer. And, as to the saying—it’s silly. To assert that people are incapable of letting go of belief in mythological fairytales without attaching themselves to some other form of worship is narrow-minded, condescending, pessimistic, and without evidential merit.”\nVD RESPONSE:\nHow can you possibly think that is an adequate response? You are providing an example of the very evidence you claim does not exist! You are responding to a charge of atheist equivocation by blatantly equivocating! The claim was that atheism and secular humanism were religions that required faith… and your response is to say that atheism is not secular humanism? That is a complete non sequitur.\nAs a Street Epistemologist, you are an atheist who is actively selling secular humanism, a specific “humanistic vision” as Peter Boghossian describes it, and yet the moment you’re called on what you are doing, which is religious proselytizing, you retreat to pretending that your atheism is totally unrelated to your secular humanism.  And describing secular humanism as “a philosophy and a set of ideals” doesn’t mean that secular humanism isn’t a religion. Quite to the contrary, by describing it that way you have admitted that it is “a specific fundamental set of beliefs and practices generally agreed upon by a number of persons”. That is the literal dictionary definition of a religion!\nYou are not merely religious, you are a religious fanatic. You’re the secular humanist version of the crazy guy raving about the End of Days in the park.\nAs for atheism, it is merely a specific belief that is a subset of the secular humanist religion. Your position is no more reasonable than a Southern Baptist who doesn’t believe in infant baptism claiming that his lack of belief in infant baptism means he isn’t a theist. That sounds absurd, but it is no less absurd than your attempt to delink atheism from secular humanism.",
  "tags": [
    "atheism",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-18T13:43:00+00:00"
}