{
  "url": "https://voxday.net/2014/01/20/the-fifth-horseman-8/",
  "scraped_at": "2025-12-15T16:43:55.552466",
  "title": "The Fifth Horseman 8",
  "date_display": "January 20, 2014",
  "date_iso": "2014-01-20T10:27:00+00:00",
  "date_from_url": "2014-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>ANTI-APOLOGETIC 7</b></p><blockquote class=\"tr_bq\"><p> <i> “You have faith your partner loves you.”</i></p><p>In 2007, Dawkins was asked this question in a debate with British philosopher John Lennox (Dawkins, 2007). Dawkins eventually replied it’s “not the right use of the word.” Lennox responded, “Oh, it is.” It’s not.</p><p>“You have faith your partner loves you” tends to be an “early game” response, given before faith has been razed. It’s similar to, “You have faith in science,” but not as lofty. It’s a more colloquial way of saying that in everyday events you use faith to navigate reality.</p><p>Comparing that for which we have abundant evidence (the actions of a real person) to a faith claim, which by definition is that for which we lack evidence (like the existence of an undetectable creator of the universe), is not analogous.</p><p>The idea that my wife probably loves me is not a radical hypothesis. The idea that there is a being who created the universe, inseminated a woman, and gave birth to a son who rose from the dead, is an extraordinary, radical claim. Equating an extraordinary claim with a mundane one, and then suggesting they “both require faith,” is disanalogous.</p></blockquote><p> <b>VD RESPONSE: </b>Whether a claim is mundane or extraordinary is irrelevant. In either case, a claim is either true or it is not true. You may think you know your wife loves you, but you don’t actually know that any more than you know exactly how many days the Virgin Mary was pregnant before giving birth to the Christ Child. There are 1,116,000 divorces in the United States every year. Do you truly think none of those people wrongly believed that their partner loved them?</p><p>We all use faith to navigate our daily reality every single day. You say faith is “pretending to know what you don’t know”, but that is simply putting a simplistic spin on what everyone really does, which is act on the basis of a chosen assumption. You choose to act on the assumption that your wife loves you, and while that may not be a radical hypothesis, you may well discover one day that it isn’t true directly from her own lips. There are tens of millions of men and women who can tell you, from bitter experience, that all the “abundant evidence” you cite is totally meaningless with regards to proving that your partner really loves you.</p><p> <b>ANTI-APOLOGETIC 8</b></p><blockquote class=\"tr_bq\"><p> <i>“My faith is beneficial for me.”</i></p><p>I never allow the conversation to devolve into the merits of faith until my interlocutor has explicitly admitted that faith is an unreliable path to the truth. Almost invariably discussion about the alleged benefits of faith are red herrings, distracting one from the main issue—whether or not faith can reliably help one to arrive at the truth.</p><p>In your work as a Street Epistemologist, once you’ve started engaging the faithful in dialectical interventions, you’ll notice conversations about the merits of faith will have no clear demarcation. Someone won’t say, “Okay, you’re correct, faith is a failed epistemology and thus highly unlikely to get one to the truth. However, having faith is of tremendous benefit both to the faithful and to society.”</p><p>Conversations about whether or not faith is beneficial should only take place after your interlocutor explicitly states that faith is an unreliable path to truth. Once you ask people to acknowledge this, you’ll almost never enter into a conversation about the benefits of faith.</p><p>If you do, however, find yourself in this position, I’d ask how an unreliable reasoning process can benefit someone. I’d also ask how an unreliable and potentially unrevisable faulty process of reasoning can benefit an entire group of people.</p><p>One of the problems with the benefit argument is that people can be mistaken about what’s in their own interest. On an individual level, heroin addicts, alcoholics, and people in abusive relationships will, at various times, claim these states of affairs are beneficial. And in the realm of religious faith, people are often mistaken about what’s in their interest—for example, decisions about personal relationships that are not sanctioned by the faith (my grandfather, who converted to Catholicism, was prohibited by the Catholic Church from walking my mother down the aisle at her wedding because my parents were married in an Apostolic Church), refraining from engaging in homosexual relationships, staying in a deeply unhappy and emotionally harmful marriage due to prohibitions on divorce, physically harmful self-flagellation or extreme fasting, etc.</p><p>On a macro level, the Taliban believe imprisoning half their population and beating them is not only in their interest but also their duty: The more people who share a faulty process of reasoning the greater the magnification of potential harm. Premodern history is littered with cultures that have navigated themselves to extinction in part due to faith.</p><p>Finally, and perhaps most importantly, all or virtually all of the studies you’ll hear people cite about the alleged benefits of belief communities have nothing to do with faith, and everything to do with religion, community, social networks, social support, etc.</p><p>It could be that the variables in these studies being tested are social cohesion and group reciprocity. Faith would need to be teased out and isolated before any benefits could be shown. To my knowledge, no study has isolated faith as a variable and shown its positive results.</p></blockquote><p>Notice how right here Boghossian even admits that he won’t even try to make a case without having gotten his interlocutor to surrender on the primary point of the discussion. So, this tells us that when dealing with a Street Epistemologist, one should never agree to any of his definitions or agree to concede anything “just for the sake of argument” even if one doesn’t have actually a problem with them. Just like an NFL cornerback chucking a receiver at the line, refusing to go along with Street Epistemologist’s rote routines will disrupt him and throw him off his line of attack. It forces them to improvise, and the more they are forced to actually think and improvise, the more likely it is that they will make the sort of obvious blunder that you can exploit to destroy both their confidence in their arguments as well as their pretense at intellectual credibility.</p><p><b>VD RESPONSE: </b>That is an impressive collection of ignorant statements. First, it is outright hilarious to hear an atheist talking about cultures navigating themselves to extinction given the fact that atheists are much less likely to marry or to have children than people from every faith tradition on the planet, with the possible exception of Catholic priests sworn to celibacy. Even the Taliban are far more evolutionarily fit than you atheists.</p><p>Now, wouldn’t you agree that if you could avoid becoming more likely to be infected by an STD, more likely to smoke, more likely to become an alchoholic, more likely to become a drug addict, more likely to be depressed, more likely to commit suicide, and more likely to sexually abuse a child, that be pretty beneficial? It would add years to your life, right?</p><p>And that’s just one example of the many benefits of faith. You said yourself that religious faith can lead to “refraining from engaging in homosexual relationships”.</p><p>What I find most disappointing, however, is the way that you’ve again shown yourself to be a science denier. You openly admit that there are no shortage of scientific studies that show the benefits of religious faith, but then you turn around and claim, with absolutely no evidence whatsoever, that all of those scientists are incompetent and unable to understand the concept of controlling for various factors. Whatever happened to your claim that “Science is the best way we’ve currently found to explain and understand how the universe works”?</p><p>But what is even worse is that as someone who is actively attempting to destroy those religious communities and those social networks of faith-based groups, your criticism of those studies about the benefits of faith communities shows that you are <i>knowingly </i>attempting to harm people. You are <i>knowingly </i>attempting to destroy something that you admit is beneficial to people. Even if you were correct and the primary benefits of faith come from its community aspects, you’re not helping anyone by attacking their faith, you are trying to harm them by cutting them off from the very communities that benefit them!</p><p>And you can’t hide behind an excuse that the communities will exist even if the faith that sustains it vanishes either. You said yourself that you don’t believe religious faith has to be replaced by anything. So, whether the scientific benefits happen to stem from religious faith itself or from the faith-based community it inspires, your actions are clearly both harmful and malicious.</p></div>",
  "content_text": "ANTI-APOLOGETIC 7\n“You have faith your partner loves you.”\nIn 2007, Dawkins was asked this question in a debate with British philosopher John Lennox (Dawkins, 2007). Dawkins eventually replied it’s “not the right use of the word.” Lennox responded, “Oh, it is.” It’s not.\n“You have faith your partner loves you” tends to be an “early game” response, given before faith has been razed. It’s similar to, “You have faith in science,” but not as lofty. It’s a more colloquial way of saying that in everyday events you use faith to navigate reality.\nComparing that for which we have abundant evidence (the actions of a real person) to a faith claim, which by definition is that for which we lack evidence (like the existence of an undetectable creator of the universe), is not analogous.\nThe idea that my wife probably loves me is not a radical hypothesis. The idea that there is a being who created the universe, inseminated a woman, and gave birth to a son who rose from the dead, is an extraordinary, radical claim. Equating an extraordinary claim with a mundane one, and then suggesting they “both require faith,” is disanalogous.\nVD RESPONSE:\nWhether a claim is mundane or extraordinary is irrelevant. In either case, a claim is either true or it is not true. You may think you know your wife loves you, but you don’t actually know that any more than you know exactly how many days the Virgin Mary was pregnant before giving birth to the Christ Child. There are 1,116,000 divorces in the United States every year. Do you truly think none of those people wrongly believed that their partner loved them?\nWe all use faith to navigate our daily reality every single day. You say faith is “pretending to know what you don’t know”, but that is simply putting a simplistic spin on what everyone really does, which is act on the basis of a chosen assumption. You choose to act on the assumption that your wife loves you, and while that may not be a radical hypothesis, you may well discover one day that it isn’t true directly from her own lips. There are tens of millions of men and women who can tell you, from bitter experience, that all the “abundant evidence” you cite is totally meaningless with regards to proving that your partner really loves you.\nANTI-APOLOGETIC 8\n“My faith is beneficial for me.”\nI never allow the conversation to devolve into the merits of faith until my interlocutor has explicitly admitted that faith is an unreliable path to the truth. Almost invariably discussion about the alleged benefits of faith are red herrings, distracting one from the main issue—whether or not faith can reliably help one to arrive at the truth.\nIn your work as a Street Epistemologist, once you’ve started engaging the faithful in dialectical interventions, you’ll notice conversations about the merits of faith will have no clear demarcation. Someone won’t say, “Okay, you’re correct, faith is a failed epistemology and thus highly unlikely to get one to the truth. However, having faith is of tremendous benefit both to the faithful and to society.”\nConversations about whether or not faith is beneficial should only take place after your interlocutor explicitly states that faith is an unreliable path to truth. Once you ask people to acknowledge this, you’ll almost never enter into a conversation about the benefits of faith.\nIf you do, however, find yourself in this position, I’d ask how an unreliable reasoning process can benefit someone. I’d also ask how an unreliable and potentially unrevisable faulty process of reasoning can benefit an entire group of people.\nOne of the problems with the benefit argument is that people can be mistaken about what’s in their own interest. On an individual level, heroin addicts, alcoholics, and people in abusive relationships will, at various times, claim these states of affairs are beneficial. And in the realm of religious faith, people are often mistaken about what’s in their interest—for example, decisions about personal relationships that are not sanctioned by the faith (my grandfather, who converted to Catholicism, was prohibited by the Catholic Church from walking my mother down the aisle at her wedding because my parents were married in an Apostolic Church), refraining from engaging in homosexual relationships, staying in a deeply unhappy and emotionally harmful marriage due to prohibitions on divorce, physically harmful self-flagellation or extreme fasting, etc.\nOn a macro level, the Taliban believe imprisoning half their population and beating them is not only in their interest but also their duty: The more people who share a faulty process of reasoning the greater the magnification of potential harm. Premodern history is littered with cultures that have navigated themselves to extinction in part due to faith.\nFinally, and perhaps most importantly, all or virtually all of the studies you’ll hear people cite about the alleged benefits of belief communities have nothing to do with faith, and everything to do with religion, community, social networks, social support, etc.\nIt could be that the variables in these studies being tested are social cohesion and group reciprocity. Faith would need to be teased out and isolated before any benefits could be shown. To my knowledge, no study has isolated faith as a variable and shown its positive results.\nNotice how right here Boghossian even admits that he won’t even try to make a case without having gotten his interlocutor to surrender on the primary point of the discussion. So, this tells us that when dealing with a Street Epistemologist, one should never agree to any of his definitions or agree to concede anything “just for the sake of argument” even if one doesn’t have actually a problem with them. Just like an NFL cornerback chucking a receiver at the line, refusing to go along with Street Epistemologist’s rote routines will disrupt him and throw him off his line of attack. It forces them to improvise, and the more they are forced to actually think and improvise, the more likely it is that they will make the sort of obvious blunder that you can exploit to destroy both their confidence in their arguments as well as their pretense at intellectual credibility.\nVD RESPONSE:\nThat is an impressive collection of ignorant statements. First, it is outright hilarious to hear an atheist talking about cultures navigating themselves to extinction given the fact that atheists are much less likely to marry or to have children than people from every faith tradition on the planet, with the possible exception of Catholic priests sworn to celibacy. Even the Taliban are far more evolutionarily fit than you atheists.\nNow, wouldn’t you agree that if you could avoid becoming more likely to be infected by an STD, more likely to smoke, more likely to become an alchoholic, more likely to become a drug addict, more likely to be depressed, more likely to commit suicide, and more likely to sexually abuse a child, that be pretty beneficial? It would add years to your life, right?\nAnd that’s just one example of the many benefits of faith. You said yourself that religious faith can lead to “refraining from engaging in homosexual relationships”.\nWhat I find most disappointing, however, is the way that you’ve again shown yourself to be a science denier. You openly admit that there are no shortage of scientific studies that show the benefits of religious faith, but then you turn around and claim, with absolutely no evidence whatsoever, that all of those scientists are incompetent and unable to understand the concept of controlling for various factors. Whatever happened to your claim that “Science is the best way we’ve currently found to explain and understand how the universe works”?\nBut what is even worse is that as someone who is actively attempting to destroy those religious communities and those social networks of faith-based groups, your criticism of those studies about the benefits of faith communities shows that you are\nknowingly\nattempting to harm people. You are\nknowingly\nattempting to destroy something that you admit is beneficial to people. Even if you were correct and the primary benefits of faith come from its community aspects, you’re not helping anyone by attacking their faith, you are trying to harm them by cutting them off from the very communities that benefit them!\nAnd you can’t hide behind an excuse that the communities will exist even if the faith that sustains it vanishes either. You said yourself that you don’t believe religious faith has to be replaced by anything. So, whether the scientific benefits happen to stem from religious faith itself or from the faith-based community it inspires, your actions are clearly both harmful and malicious.",
  "tags": [
    "atheism",
    "Fifth Horseman"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-20T10:27:00+00:00"
}