{
  "url": "https://voxday.net/2014/01/11/what-happened-to-never-again/",
  "scraped_at": "2025-12-15T16:42:56.350264",
  "title": "What happened to “never again”?",
  "date_display": "January 11, 2014",
  "date_iso": "2014-01-11T14:00:00+00:00",
  "date_from_url": "2014-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Learned Elders of Wye had better speed up their exit plans if they’re going to continue <a href=\"http://isteve.blogspot.ch/2014/01/dual-loyalty-if-were-lucky.html?utm_source=twitterfeed&amp;utm_medium=twitter\">to perpetrate materially traitorous idiocies</a> such as this:</p><blockquote class=\"tr_bq\"><p> President Obama plans to nominate three people to the Federal Reserve’s<br> Board of Governors, including Stanley Fischer, former head of the Bank<br> of Israel, as the Fed’s next vice chairman, the White House said on<br> Friday…. Mr. Fischer, 70, would succeed Ms. Yellen in her current role. The<br> Senate confirmed Ms. Yellen as the Fed’s new chairwoman this week. She<br> will take over from the current chairman, Ben S. Bernanke, in February.<br> …</br></br></br></br></br></br></p><p>More importantly for Israel, Stanley Fischer won an appointment to the<br> Reagan administration’s U.S.-Israel Joint Economic Discussion Group that<br> dealt with Israel’s 1984-1985 economic crisis. … The U.S.-Israel<br> Joint Economic Discussion Group fundamentally transformed U.S. aid to<br> Israel forever.  Before the Reagan administration, most U.S. aid to<br> Israel took the form of loans that had to be repaid with interest.<br>  After the input of Fischer’s team, subsequent U.S. aid was delivered in<br> the form of outright grants paid directly from the U.S. Treasury—never<br> to be repaid or conditioned when Israel took actions the U.S. opposed.</br></br></br></br></br></br></br></br></p></blockquote><p>Can you even imagine the widespread outrage if Haruhiko Kuroda of the Bank of Japan was appointed to the Fed and he promptly began sending billions of dollars to Japan? Or if Zhou Xiaochuan of the People’s Bank of China was named vice chairman and he subsequently began repaying US debt to China in gold and advanced weapons technology? Now keep in mind that Stanley Fischer is already guilty of literally giving billions to Israel!</p><p>It’s long past time for the USA to take two immediate measures. First, shut down all financial aid to Israel. The USA is bankrupt. So is the Federal Reserve, if its newly expanded balance sheet was marked properly to market. If Israeli citizens are convinced that inflation is good for the economy and they want to print money, well and good, but let them print shekels, not U.S. dollars.</p><p>Second, ban all dual citizenships. There is no such thing as a “dual loyalty”. It’s very clear that Stanley Fischer has no loyalty to the USA. His loyalty is to Israel. That’s perfectly clear. It’s even admirable. Would that his American counterparts felt so strongly about serving their own country. But it also means that he has no more place in a decision-making capacity for the US monetary system than Christine Lagard or Mario Draghi.</p><p>Now, let’s preemptively deal with the usual reaction. Are you tempted to call my position antisemitic? That’s not merely incorrect, that’s <i>totally insane</i>. Do you truly not see where this is leading? For the love of the God of Old Testament and New, the reason I’m speaking out against this is precisely because I don’t wish to see an American holocaust. I don’t want the children of my Jewish friends being made the scapegoat in reaction to the dreadful behavior of an insatiable, unconscionable elite. What is sickening, what is ominous, what is materially antisemitic is what the federal government has done by permitting Greenspan, Bernanke, Yellen, and Fischer to financially rape the American people.</p><p>This is all astonishingly short-sighted on the part of <a href=\"http://www.milobookclub.com/2014/01/07/protocols-of-learned-elders-of-wye/\">the Elders of Wye</a>. Setting aside whether they can reasonably hope to successfully transfer their traveling game of three-card monte to China or India, even a bankrupt, post-collapse America will be filled with hundreds of millions of the same people who conquered the world in the 20th century, more or less without trying. And they are going to be very, very angry. They are going to be even more full of hate than the 20th century Germans were, because they are going to feel deeply betrayed. If an unfair post-war peace settlement created a sense of national fury, how much more anger will the bankruptcy and collapse of the union provoke?</p><p>In fact, having grown up in an End Times-conscious church, I can recall the eschatological enthusiasts discussing whether the King of the North was the Soviet Union or a united Europe. They often cited this passage from Jeremiah:</p><p>Behold, a people shall come from  the north,<br> And a great nation and many kings <br> Shall be raised up from the ends of the earth. <br> They shall hold the bow and the lance;<br> They are cruel and shall not show mercy.<br> Their voice shall roar like the sea;<br> They shall ride on horses,<br> Set in array, like a man for the battle,<br> Against you, O daughter of Babylon. <br> The king of Babylon has heard the report about them,<br> And his hands grow feeble;<br> Anguish has taken hold of him,<br> Pangs as of a woman in childbirth…”(Jeremiah 50:41-43)</br></br></br></br></br></br></br></br></br></br></br></br></p><p>And yet, when I look at the events of recent years, it increasingly looks as if the most powerful nation that is the most likely to bear a tremendous populist grudge against Israel in the 21st century will be the United States of America.</p></div>",
  "content_text": "The Learned Elders of Wye had better speed up their exit plans if they’re going to continue\nto perpetrate materially traitorous idiocies\nsuch as this:\nPresident Obama plans to nominate three people to the Federal Reserve’s\nBoard of Governors, including Stanley Fischer, former head of the Bank\nof Israel, as the Fed’s next vice chairman, the White House said on\nFriday…. Mr. Fischer, 70, would succeed Ms. Yellen in her current role. The\nSenate confirmed Ms. Yellen as the Fed’s new chairwoman this week. She\nwill take over from the current chairman, Ben S. Bernanke, in February.\n…\nMore importantly for Israel, Stanley Fischer won an appointment to the\nReagan administration’s U.S.-Israel Joint Economic Discussion Group that\ndealt with Israel’s 1984-1985 economic crisis. … The U.S.-Israel\nJoint Economic Discussion Group fundamentally transformed U.S. aid to\nIsrael forever.  Before the Reagan administration, most U.S. aid to\nIsrael took the form of loans that had to be repaid with interest.\nAfter the input of Fischer’s team, subsequent U.S. aid was delivered in\nthe form of outright grants paid directly from the U.S. Treasury—never\nto be repaid or conditioned when Israel took actions the U.S. opposed.\nCan you even imagine the widespread outrage if Haruhiko Kuroda of the Bank of Japan was appointed to the Fed and he promptly began sending billions of dollars to Japan? Or if Zhou Xiaochuan of the People’s Bank of China was named vice chairman and he subsequently began repaying US debt to China in gold and advanced weapons technology? Now keep in mind that Stanley Fischer is already guilty of literally giving billions to Israel!\nIt’s long past time for the USA to take two immediate measures. First, shut down all financial aid to Israel. The USA is bankrupt. So is the Federal Reserve, if its newly expanded balance sheet was marked properly to market. If Israeli citizens are convinced that inflation is good for the economy and they want to print money, well and good, but let them print shekels, not U.S. dollars.\nSecond, ban all dual citizenships. There is no such thing as a “dual loyalty”. It’s very clear that Stanley Fischer has no loyalty to the USA. His loyalty is to Israel. That’s perfectly clear. It’s even admirable. Would that his American counterparts felt so strongly about serving their own country. But it also means that he has no more place in a decision-making capacity for the US monetary system than Christine Lagard or Mario Draghi.\nNow, let’s preemptively deal with the usual reaction. Are you tempted to call my position antisemitic? That’s not merely incorrect, that’s\ntotally insane\n. Do you truly not see where this is leading? For the love of the God of Old Testament and New, the reason I’m speaking out against this is precisely because I don’t wish to see an American holocaust. I don’t want the children of my Jewish friends being made the scapegoat in reaction to the dreadful behavior of an insatiable, unconscionable elite. What is sickening, what is ominous, what is materially antisemitic is what the federal government has done by permitting Greenspan, Bernanke, Yellen, and Fischer to financially rape the American people.\nThis is all astonishingly short-sighted on the part of\nthe Elders of Wye\n. Setting aside whether they can reasonably hope to successfully transfer their traveling game of three-card monte to China or India, even a bankrupt, post-collapse America will be filled with hundreds of millions of the same people who conquered the world in the 20th century, more or less without trying. And they are going to be very, very angry. They are going to be even more full of hate than the 20th century Germans were, because they are going to feel deeply betrayed. If an unfair post-war peace settlement created a sense of national fury, how much more anger will the bankruptcy and collapse of the union provoke?\nIn fact, having grown up in an End Times-conscious church, I can recall the eschatological enthusiasts discussing whether the King of the North was the Soviet Union or a united Europe. They often cited this passage from Jeremiah:\nBehold, a people shall come from  the north,\nAnd a great nation and many kings\nShall be raised up from the ends of the earth.\nThey shall hold the bow and the lance;\nThey are cruel and shall not show mercy.\nTheir voice shall roar like the sea;\nThey shall ride on horses,\nSet in array, like a man for the battle,\nAgainst you, O daughter of Babylon.\nThe king of Babylon has heard the report about them,\nAnd his hands grow feeble;\nAnguish has taken hold of him,\nPangs as of a woman in childbirth…”(Jeremiah 50:41-43)\nAnd yet, when I look at the events of recent years, it increasingly looks as if the most powerful nation that is the most likely to bear a tremendous populist grudge against Israel in the 21st century will be the United States of America.",
  "tags": [
    "religion",
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-01-11T14:00:00+00:00"
}